DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 #A (A20)
1 #I (N3)
1 #C (N3)
END-DEFINE
  INCLUDE Z1069--C
WRITE (1) NOTITLE NOHDR  '=' *DATA
STACK TOP DATA 'ccc' 'ddd'
MOVE *DATA TO #C
PERFORM PRINT
RELEASE STACK

DEFINE SUBROUTINE PRINT
	WRITE (1) NOTITLE NOHDR  '=' *DATA
	FOR #I 1 TO #C
		INPUT #A
		WRITE (1) NOTITLE '=' #A
		WRITE (1) NOTITLE NOHDR  '=' *DATA
	END-FOR
END-SUBROUTINE

END