DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
  01 #F1 (A010)
  01 #F2 (N010)
  01 #F3 (N010)
  01 #I  (I004)
END-DEFINE

INCLUDE Z1069--C
FORMAT (1) PS=0

WRITE (1) NOTITLE NOHDR  *PROGRAM

FOR  #I                                EQ  1 TO 7 STEP 1
  IF  #I                               EQ  1 OR = 2 
    MOVE  'AAAAAAA'                    TO  #F1
  ELSE
    IF  #I                             EQ  3 OR = 4 OR = 5
      MOVE  'BBBBB'                    TO  #F1
    ELSE 
      MOVE  'CCCCCCCCCC'               TO  #F1
    END-IF
  END-IF    

  MOVE  123                            TO  #F2

  IF  #I                               EQ  1 OR = 2 
    MOVE  321                          TO  #F3
  ELSE
    IF  #I                             EQ  3 OR = 4 
      MOVE  654                        TO  #F3
    ELSE 
      MOVE  987                        TO  #F3
    END-IF
  END-IF    
END-ALL 
L1. SORT #F1 #F2 #F3
USING KEYS
  AT BREAK (L1.) OF  #F1
    SUSPEND IDENTICAL SUPPRESS (1)
  END-BREAK
  AT BREAK (L1.) OF  #F2
    SUSPEND IDENTICAL SUPPRESS (1)
  END-BREAK

  WRITE (1) NOTITLE (AD=I ZP=OFF)
    #F1 (IS=ON)
    #F2 (IS=ON)
    #F3 
END-SORT

END
