DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
01         #I01                        (I004)
01         #I02                        (I004)
01         #FIELD                      (A005)
01         REDEFINE                    #FIELD
  02       #FIELD-N                    (N005)
*
END-DEFINE

FORMAT (1) PS=0
INCLUDE Z1069--C
*
REPEAT
*
  ADD  1                               TO  #I01  
  IF  #I01                             GT  6
    ESCAPE BOTTOM
  END-IF

  ADD  1                               TO  #I02
  IF  #I02                             EQ  2
    MOVE  #I01                         TO  #FIELD-N
    RESET  #I02
  END-IF
  
  WRITE (1) NOTITLE  *PROGRAM 'loop:' #I01 'field:' #FIELD 'field-n' #FIELD-N
 
  PERFORM BREAK PROCESSING
  
  AT BREAK OF  #FIELD
    WRITE (1) NOTITLE  *PROGRAM 'BREAK at field:' #FIELD-N 'aver:' 	AVER(#FIELD-N)
    WRITE (1) NOTITLE  *PROGRAM 'BREAK at field:' #FIELD-N 'sum:' 	SUM(#FIELD-N)
    WRITE (1) NOTITLE  *PROGRAM 'BREAK at field:' #FIELD-N 'total:' TOTAL(#FIELD-N)
    WRITE (1) NOTITLE  *PROGRAM 'BREAK at field:' #FIELD 'count:' 	COUNT(#FIELD)
    WRITE (1) NOTITLE  *PROGRAM 'BREAK at field:' #FIELD 'max:' 	MAX(#FIELD)
    WRITE (1) NOTITLE  *PROGRAM 'BREAK at field:' #FIELD 'min:' 	MIN(#FIELD)
    WRITE (1) NOTITLE  *PROGRAM 'BREAK at field:' #FIELD 'old:' 	OLD(#FIELD)
  END-BREAK
  
END-REPEAT
*
END


