
 ADD007A: PROCEDURE OPTIONS(MAIN);
   %INCLUDE BAS001B;

     PUT SKIP LIST('ADD007 entered.');

     /*******Test case: ADD007_1   ******/

   DCL 1 GR_1,
    2 FD_10 FLOAT BINARY(15) INIT(988888888888888),
    2 FD_11 FIXED DECIMAL(13) INIT(8888888888888),
    2 FD_12 FLOAT DECIMAL(13) INIT(8888888888888);

   FD_10 = FD_11 + FD_12 ;
   PUT SKIP LIST('');
   PUT SKIP LIST('');
   PUT SKIP LIST('GR_1');
   PUT SKIP LIST('Test Case : ADD007_1    ******');
   PUT SKIP LIST('');

   CALL HEXDUMP32(ADDR(GR_1), SIZE(GR_1));

 END ADD007A;
