//MGOJOB1 JOB ,XXXXX,CLASS=J                                                
//*                                                                     
//STEP050 EXEC MGOPROC1                                             
//*   
