//MGOJOB3 JOB ,XXXXX,CLASS=J                                               
//*                                                                        
//STEP050 EXEC MGOPROC1                                             
//*   