DEFINE DATA
LOCAL USING MYLDASAM
LOCAL USING MYLDAEXT
LOCAL
01 MY-VIEW VIEW OF EMPLOYEES
	02 PERSONNEL-ID
END-DEFINE

INCLUDE MYCOPY

PERFORM MYSUBRSAM
PERFORM MYSUBREXT

CALLNAT 'SUBPRG1' #LOCAL1 #LOCAL2


END
