         PRINT NOGEN                                                            
         DBD   NAME=DBD4030B,                                          X        
               ACCESS=(PHDAM,OSAM),                                    X        
               RMNAME=(DFSHDC40,1,1)                                            
         SEGM    NAME=SEGONE,PARENT=0,POINTER=T,BYTES=30
         FIELD   NAME=(OFIELDA,SEQ,U),BYTES=10,START=1,TYPE=C
         FIELD   NAME=OFIELDB,BYTES=10,START=11,TYPE=C
         FIELD   NAME=OFIELDC,BYTES=10,START=21,TYPE=C
         LCHILD  NAME=(SGONE,INDB1I),POINTER=INDX
         SEGM    NAME=SEGTWO,PARENT=SEGONE,BYTES=30
         FIELD   NAME=(TFIELDA,SEQ,U),BYTES=10,START=1,TYPE=C
         FIELD   NAME=TFIELDB,BYTES=10,START=11,TYPE=C
         FIELD   NAME=TFIELDC,BYTES=10,START=21,TYPE=C
         SEGM    NAME=SEGTHR,PARENT=SEGONE,BYTES=30
         FIELD   NAME=(THRFLDA,SEQ,U),BYTES=10,START=1,TYPE=C
         FIELD   NAME=THRFLDB,BYTES=10,START=11,TYPE=C
         FIELD   NAME=THRFLDC,BYTES=10,START=21,TYPE=C
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    