******************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    PGMB.

      * SELECT the values into this field***************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
      *    ************************SELECT File**********

