DEFINE DATA
LOCAL
  1 A (A1)
  1 C (I4) INIT <1>
END-DEFINE

* Candidate Branch statement: The body contains an ARITHMETIC_STATEMENT
IF C SPECIFIED
    ADD 1 TO C
ELSE
    ADD 1 TO A
END-IF
END