DEFINE DATA
LOCAL
1 #VIEW VIEW OF DDM3618
  2 AA-1
  2 AT-1
  2 AD-1
  2 S1-SD
  2 S2-SD
  2 S3-SD
1 #FROM (A3)
1 #TO   (A3)
END-DEFINE

PERFORM CREATE-DATA

* No candidate
READ #VIEW BY S1-SD GT #FROM
  PERFORM DISPLAY-VIEW
END-READ

* Candidate: body contains a DATABASE_ACCESS_STATEMENT
IF #FROM <> 'A'
  READ #VIEW BY S1-SD GT #FROM
    PERFORM DISPLAY-VIEW
  END-READ
END-IF

* Candidate: body contains a DATABASE_ACCESS_STATEMENT
IF #FROM <> 'A'
  FIND #VIEW WITH S1-SD LT #TO SORTED BY S1-SD
    PERFORM DISPLAY-VIEW
  END-FIND
END-IF

* Candidate: body contains a DATABASE_ACCESS_STATEMENT
IF #FROM <> 'A'
  FIND #VIEW WITH S2-SD EQ #FROM THRU #TO SORTED BY S2-SD
    PERFORM DISPLAY-VIEW
  END-FIND
END-IF

* Candidate: body contains a DATABASE_ACCESS_STATEMENT
IF #FROM <> 'A'
  FIND #VIEW WITH S2-SD EQ #FROM THRU #TO SORTED BY S2-SD
    AA-1 = 'Y'
    UPDATE
  END-FIND
END-IF

DEFINE SUBROUTINE CREATE-DATA
* Candidate: body contains a DATABASE_ACCESS_STATEMENT
  IF #FROM <> 'A'
    STORE #VIEW
  END-IF
END-SUBROUTINE

DEFINE SUBROUTINE DISPLAY-VIEW
* No candidate
  IF #FROM <> 'A'
    WRITE (1) #VIEW.AA-1
  END-IF
END-SUBROUTINE

DEFINE SUBROUTINE CLEANUP-DATA
* Candidate: body contains a DATABASE_ACCESS_STATEMENT
  IF #FROM <> 'A'
    READ #VIEW
      DELETE
    END-READ
  END-IF
END-SUBROUTINE

END
