DEFINE DATA
LOCAL
1 #A (A10)
1 #B (A10)
END-DEFINE

DEFINE WORK FILE 1 'src/res/workfile'

WRITE WORK FILE 1 'test'

READ WORK FILE 1 #A
  WRITE (1) NOTITLE #A
END-WORK

READ WORK FILE 1 ONCE #A
AT END OF FILE
  #A := 'unexpected end of file'
  #B := 'just another text'
END-ENDFILE

READ WORK FILE 1 #B
  IF #B <> ''
    #B := 'blub'
  END-IF
END-WORK

CLOSE WORK FILE 1

IF #A <> ''
  DEFINE WORK FILE 1 'src/res/workfile'
END-IF

* Candidate: body (else) contains a FILE_ACCESS_STATEMENT
IF #A <> ''
  #B := 'blub'
ELSE
  WRITE WORK FILE 1 'test'
END-IF

IF #A <> ''
  CLOSE WORK FILE 1
END-IF

* Candidate: body (if) contains a FILE_ACCESS_STATEMENT
IF #A <> ''
  READ WORK FILE 1 #A
    WRITE (1) NOTITLE #A
  END-WORK
END-IF

* Candidate: body (if) contains a FILE_ACCESS_STATEMENT
IF #A <> ''
  READ WORK FILE 1 ONCE #A
  AT END OF FILE
  	#A := 'unexpected end of file'
  END-ENDFILE
END-IF

END