 BRIF: PROCEDURE OPTIONS(MAIN);

	/* No candidate: only 1 FIELD_REFERENCE which
	   is not from a Copybook */
		IF A = 1 THEN
			RETURN (0);

	/* Candidate: at least two FIELD_REFERENCEs */
		IF A = B THEN
			RETURN (0);

	/* Candidate: at least two FIELD_REFERENCEs
	   and two CONSTANT_REFERENCEs */
		IF A = 1 & B = 2 THEN
			RETURN (0);

	/* Candidate: at least two CONSTANT_REFERENCEs */
		IF 1 = 2 THEN
			RETURN (0);

 END BRIF;