DEFINE DATA
GLOBAL USING BRGDA
PARAMETER USING BRPDA
LOCAL USING BRLDA
END-DEFINE

* Candidate: A1 is from a GDA copybook
IF A1 SPECIFIED
    WRITE (1) NOTITLE '=' A1
END-IF

* Candidate: A2 is from a PDA copybook
IF A2 SPECIFIED
    WRITE (1) NOTITLE '=' A2
END-IF

* Candidate: A3 is from a LDA copybook
IF A3 SPECIFIED
    WRITE (1) NOTITLE '=' A3
END-IF

* Candidate: B3 is from a LDA copybook
IF B3 SPECIFIED
    WRITE (1) NOTITLE '=' B
END-IF

* Candidate: GRP3.B3 is from a LDA copybook
IF GRP3.B3 SPECIFIED
    WRITE (1) NOTITLE '=' B3
END-IF

* False positive candidate: Match by name str: LDA copybook contains a field 'B'
IF NON_EXISTING.B3 SPECIFIED
    WRITE (1) NOTITLE '=' B3
END-IF

END