DEFINE DATA LOCAL
  1 #A (A1)
  1 #B (A2)
END-DEFINE

* Candidate: Condition contains at least two FIELD_REFERENCEs and two CONSTANT_REFERENCEs
DECIDE FOR EVERY CONDITION
  WHEN #A >= 0 AND #B <= 0
    WRITE 'A >= 0'
  WHEN NONE
    IGNORE 
END-DECIDE