       IDENTIFICATION DIVISION.
       PROGRAM-ID.    DEPTEST.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY COPYTEST.
           COPY COPYTEST2.
       PROCEDURE DIVISION.
           GOBACK.