       IDENTIFICATION DIVISION.
       PROGRAM-ID. NDT3018.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

         01 TESTFIELD  PIC X(16).
         05 FIELD PIC 9999 USAGE IS COMP.
         01 HOLD-BASIC-TAX-MOD-DBKEY USAGE IS DATABASE-KEY.
         01 HOLD-BASIC-ENT-DBKEY USAGE IS DATABASE-KEY.
         01 DATABASE-KEY USAGE IS COMP PIC 9(10).
         03 PRIORITY USAGE IS COMP PIC 9(10) VALUE IS 000000.

       PROCEDURE DIVISION.
       GOBACK.

