       IDENTIFICATION DIVISION.
       PROGRAM-ID. NDT2679A.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 TESTFIELD  PIC X(16).

       PROCEDURE DIVISION.
           FETCH-DC-CONTROL-REC.
           DISPLAY 'FETCH-DC-CONTROL-REC ' UPON PRINTER.
             IF DC-NAME-S-CONTROL SET NOT EMPTY
                CONTINUE
             ELSE
                MOVE 'NO ' TO LAST-CONTROL-RECORD-IND
                PERFORM SEARCH-CONTROL-RECORD UNTIL
                   LAST-CONTROL-RECORD-IND IS EQUAL TO 'YES'.
       GOBACK.

