//YDECSD0S JOB (6,DE24A000,PDPB),'TCSES',                               00001000
//             CLASS=A,                                                 00004000
//JS015    EXEC PGM=sort                                                00039900
//SYSPRINT DD  SYSOUT=*                                                 00041300
//SYSIN    DD  DSN=DE.DE24APDS.PROD.CARD(CCARD),DISP=SHR
//*                                                                     00041500
//*                                                                     00057006