DEFINE DATA
LOCAL
1 #FIELD1 (A8)
END-DEFINE

INPUT USING MAP 'MEE6622M'

IF #FIELD1 EQ ' '
    REINPUT WITH TEXT '#FIELD1 must not be empty'
END-IF
IF #FIELD1 EQ 'HELP'
    REINPUT USING HELP MARK *#FIELD1
END-IF

END

