000100*    Datenstruktur für Tabelle LA_ABKSTDAUSKADRVW
000200     25 LADTSV0A-KEY.
000300        30 ABKNR                PIC S9(17)V USAGE COMP-3.
000400        30 FILLER               PIC  X(3).
000500        30 BEARBABKNR           PIC S9(9) USAGE COMP.
000600        30 BSABKKZ              PIC S9(4) USAGE COMP.
000700        30 FILLER               PIC  X(2).
000800        30 STDAUSKTYPKZ         PIC S9(4) USAGE COMP.
000900        30 FILLER               PIC  X(2).
001000        30 LFDNRSTDAUSK         PIC S9(9) USAGE COMP.
001100        30 LFDNRADRVWSTDAUSK    PIC S9(4) USAGE COMP.
001200        30 FILLER               PIC  X(2).
001300        30 ABGANGABKNR          PIC S9(9) USAGE COMP.
001400     25 LADTSV0A-DATA.
001500        30 ADRSTDAUSKKZ         PIC S9(4) USAGE COMP.
001600        30 FILLER               PIC  X(2).
001700        30 LFDNRADRSTDAUSK      PIC S9(4) USAGE COMP.
001800        30 FILLER               PIC  X(2).
001900        30 ZWEMPFSTDAUSKKZ      PIC S9(4) USAGE COMP.
002000        30 FILLER               PIC  X(2).
002100        30 LFDNRZWEMPFSTDAUSK   PIC S9(4) USAGE COMP.
002200        30 FILLER               PIC  X(2).
002300        30 VERSWEGSTDAUSKKZ     PIC S9(4) USAGE COMP.
002400        30 FILLER               PIC  X(2).
002500        30 MEDIUMSTDAUSKKZ      PIC S9(4) USAGE COMP.
002600        30 FILLER               PIC  X(2).
002700        30 DUPLIKATANZSTDAUSK   PIC S9(4) USAGE COMP.
002800        30 FILLER               PIC  X(2).
002900        30 BEGLSCHRSTDAUSKJN    PIC  X(1).
003000        30 FILLER               PIC  X(3).
