  P$$$ZZ: PROC(HMCOMMON, PARM_COUNT, FUNCTION, PCB_AIB_PTR, IO_AREA);
  
    DCL PARM_COUNT FIXED BIN (31),
    DCL FUNCTION CHAR (4);
    DCL IO_AREA CHAR (*);
    DCL PCB_AIB_PTR POINTER;
    DCL 1 HMCOMMON,
          2 FIELD1 CHAR(4),
          2 FIELD2 CHAR(4);
    DCL THREE FIXED BINARY(15) INIT(3);
    
    CALL  PLITDLI (PARM_COUNT, FUNCTION, PCB_AIB_PTR, IO_AREA);
   
  END;