//UTP233  JOB (A,D,ADIECN,R),'ADB CYC &:CURCWW DACOMP',                         
//        MSGCLASS=W,USER=ZIIGADI                                               
/*JOBPARM ROOM=ISYS                                                             
//*AUTOBEEP PAGE=PMADB                                                          
//JCLDSN JCLLIB ORDER=(AD87CM.LBP.IIFS.PROC.JES.JCLLIB,                         
//         AD87CM.LBP.CTSP.PROC.JES.JCLLIB)                                     
//JCLCNTL INCLUDE MEMBER=ADSISET                                                
//*---------------------------------------------------------------------        
//IDCM0001 EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD SUBSYS=(CCSS,                                                     
// ' LISTCAT ENTRY (ADADIE.CDX.UTP269.TAPEOA.POST97.D&:P015DCYC) ',             
// ' LISTCAT ENTRY (ADADIE.CDX.UTP269.TAPEOA.POST97.D&:P025DCYC) ',             
// ' LISTCAT ENTRY (ADADIE.CDX.UTP269.TAPEOA.POST97.D&:P035DCYC) ',             
// ' LISTCAT ENTRY (ADADIE.CDX.UTP269.TAPEOA.POST97.D&:P045DCYC) ',             
// ' LISTCAT ENTRY (ADADIE.CDX.UTP269.TAPEOA.POST97.D&:P055DCYC) ')             
//*---------------------------------------------------------------------        
// IF (IDCM0001.RC EQ 0) THEN                                                   
//*---------------------------------------------------------------------        
//UTP233  EXEC  UTP233,PARM233='DHR',                                           
//        ADBSMF='ADIE.CAH',CRWKCYC=&:CRYWK                                     
//UTP233.TAPEIA DD DISP=SHR,                                                    
//   DSN=ADADIE.CDX.UTP269.TAPEOA.POST97.D&:M5YWC5                              
//   DD DISP=SHR,DSN=ADADIE.CDX.UTP269.TAPEOA.POST97.D&:M4YWC5                  
//   DD DISP=SHR,DSN=ADADIE.CDX.UTP269.TAPEOA.POST97.D&:M3YWC5                  
//   DD DISP=SHR,DSN=ADADIE.CDX.UTP269.TAPEOA.POST97.D&:M2YWC5                  
//   DD DISP=SHR,DSN=ADADIE.CDX.UTP269.TAPEOA.POST97.D&:M1YWC5                  
//*---------------------------------------------------------------------        
// ELSE                                                                         
//*---------------------------------------------------------------------        
//UTP233  EXEC  UTP233,PARM233='DHR',                                           
//        ADBSMF='ADIE.CAH',CRWKCYC=&:CRYWK                                     
//UTP233.TAPEIA DD DISP=SHR,                                                    
//   DSN=ADADIE.CDX.UTP269.TAPEOA.POST97.D&:M4YWC5                              
//   DD DISP=SHR,DSN=ADADIE.CDX.UTP269.TAPEOA.POST97.D&:M3YWC5                  
//   DD DISP=SHR,DSN=ADADIE.CDX.UTP269.TAPEOA.POST97.D&:M2YWC5                  
//   DD DISP=SHR,DSN=ADADIE.CDX.UTP269.TAPEOA.POST97.D&:M1YWC5                  
//SMTP0001 EXEC SMTPHOL,JNAME=UTP233                                            
//*---------------------------------------------------------------------        
// ENDIF                                                                        
//*---------------------------------------------------------------------        
