//*---------------------------------------------------------------------        
//UTP229  PROC                                                                  
//*---------------------------------------------------------------------        
//UNCAT   EXEC PGM=IEXUNCAT                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  SUBSYS=(CCSS,                                                    
//    'AD&ADBSMF..DUTP2291.W&CRWKCYC',                                          
//    'AD&ADBSMF..DUTP2292.W&CRWKCYC',                                          
//    'AD&ADBSMF..DUTP2293.W&CRWKCYC')                                          
//*---------------------------------------------------------------------        
//UTP229  EXEC PGM=UTP22901,PARM='&PARM229'                                     
//STEPLIB    DD DISP=SHR,DSN=ADIIGE.LBP.IIGEMERG.LOADLIB                        
//           DD DISP=SHR,DSN=ADIIGE.LBP.IIG1.LOADLIB                            
//           DD DISP=SHR,DSN=ADIIGE.LBP.IIG1.LOADLIB.PRECMN                     
//MSGDS      DD  SYSOUT=*                                                       
//SYSUDUMP   DD  SYSOUT=*                                                       
//TAPEIA     DD DUMMY                                                           
//TAPEOA     DD  DSN=&&TOA,UNIT=SYSOUT3,DISP=(,PASS),                           
//             SPACE=(11554,(25,200),RLSE),                                     
//             LRECL=11554,BLKSIZE=0,RECFM=VB,AVGREC=K                          
//SRT1IN   DD DSN=*.TAPEOA,DISP=OLD,VOL=REF=*.TAPEOA                            
//SRT1WK01 DD UNIT=SYSOUT3,SPACE=(11554,(25,120),RLSE)                          
//SRT1WK02 DD UNIT=SYSOUT3,SPACE=(11554,(25,120),RLSE)                          
//SRT1WK03 DD UNIT=SYSOUT3,SPACE=(11554,(25,120),RLSE)                          
//SRT1OUT  DD DSN=&&SRT1,UNIT=SYSOUT3,DISP=(,PASS),                             
//            SPACE=(11554,(25,200),RLSE),                                      
//            LRECL=11554,BLKSIZE=0,RECFM=VB,AVGREC=K                           
//TAPEIB   DD DSN=*.SRT1OUT,DISP=(OLD,PASS),VOL=REF=*.SRT1OUT                   
//PRINT1   DD SYSOUT=*                                                          
//PRINT2   DD SYSOUT=*                                                          
//PRINT3   DD SYSOUT=*                                                          
//PRINT4   DD SYSOUT=*                                                          
//PUNCH1   DD DSN=AD&ADBSMF..DUTP2291.W&CRWKCYC,                                
//            UNIT=DASD,DISP=(,CATLG),RETPD=14,                                 
//            BLKSIZE=23440,LRECL=80,RECFM=FB,                                  
//            SPACE=(23440,(160,200),RLSE)                                      
//PUNCH2   DD DSN=AD&ADBSMF..DUTP2292.W&CRWKCYC,                                
//            UNIT=DASD,DISP=(,CATLG),RETPD=14,                                 
//            BLKSIZE=23440,LRECL=80,RECFM=FB,                                  
//            SPACE=(23440,(160,200),RLSE)                                      
//PUNCH3   DD DSN=AD&ADBSMF..DUTP2293.W&CRWKCYC,                                
//            UNIT=DASD,DISP=(,CATLG),RETPD=14,                                 
//            BLKSIZE=23440,LRECL=80,RECFM=FB,                                  
//            SPACE=(23440,(160,200),RLSE)                                      
//*---------------------------------------------------------------------        
