//**********************************************************                    
//* THIS PROC WAS CREATED AND IS EXECUTED FROM JOB  Z38ZG235                    
//**********************************************************                    
//LRM1100B JOB INIT='T',SYSOUT='(,)'                                           
//*                                                                             
//PS01     EXEC PROC=LRM1100A,TIME=30   