//TESTJOBA JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A
//STEP01   EXEC PGM=NAT
//STEPLIB  DD DSN=MMRS00C.A.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//CMWKF01  DD DSN=WRK.A.ONE,DISP=(OLD,DELETE)
//CMSYNIN DD *
 LOGON B
 WKFC
 FIN
//*
