//TESTJOBB JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A
//STEP01   EXEC TESTPRC
//STEPLIB  DD DSN=MMRS00C.A.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//CMWRK01  DD DSN=WRK.C.ONE,DISP=(OLD,DELETE)
//SYSIN  DD *
LOGON LIB
WKFC
Y
FIN
//*
