DEFINE DATA
LOCAL
1 #WF-LINE (A10)
END-DEFINE

DEFINE WORK FILE 1 'test/res/workfile/WKFA.txt' TYPE 'ASCII'
DEFINE WORK FILE 2 'test/res/workfile/WKFB.txt' TYPE 'ASCII'

READ WORK FILE 1 #WF-LINE

END-WORK

WRITE WORK FILE 1 #WF-LINE

READ WORK FILE 2 #WF-LINE

END-WORK

END
