//SMPVEH07 JOB  (130300,422),'ACB',CLASS=C,
//             MSGCLASS=Y
//COPYRPTS PROC
//COPYRPT  EXEC PGM=XYZ 
//           PEND      
//*
//STEP01   EXEC COPYRPTS
//STEP02   EXEC COPYRPTS
//* 