       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN518D.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           PERFORM TESTPARA
           GOBACK.
       TESTPARA.
            REWRITE  OUTPUT-RECORD
            INVALID KEY
            DISPLAY 'A'
            NOT INVALID KEY
            DISPLAY 'B'
            END-REWRITE.
       UNREACHABLE.
            DISPLAY 'UNREACHABLE'
