       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN518G.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           PERFORM TESTPARA
           GOBACK.
       TESTPARA.
            READ RECORDDUMMY
            INVALID KEY
            DISPLAY 'A'
            NOT INVALID KEY
            DISPLAY 'B'
            END-READ.
       UNREACHABLE.
            DISPLAY 'UNREACHABLE'
