       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN518B.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TESTFIELD PIC 9(10).
       PROCEDURE DIVISION.
            ADD 1 TO TESTFIELD
            GOBACK.
