 MAINP: PROC OPTIONS(MAIN);
    DECLARE RESULT BIT(1) INIT(1B);
    GOTO LABEL1;
    PUT SKIP LIST('POST LABEL1');
 END MAINP;
 PROCEDURE1: PROC;
 LABEL1:
  BEGIN;
   X = SUBSTR(X,LENGTH(X)+1 , Z);
   PUT SKIP LIST(' INSIDE LABEL1', X);
  END;
 END PROCEDURE1;
 