DEFINE DATA 
LOCAL USING WMIN1204E
LOCAL
 1 #VAR1 (A2) INIT <"V1">
 1 #VAR2 (A2) INIT <"V2">
 1 #VAR3 (A2) INIT <"V3">
PARAMETER USING WMIN1204G
END-DEFINE

PRINT #VAR2
INCLUDE WMIN1204C "#VAR1"     "#VAR2"     "#VAR3"
WRITE NOTITLE NOHDR #FLD1
INCLUDE WMIN1204H
* INCLUDE WMIN1204C "#VAR1"     "#VAR2"     "#VAR3"

END