DEFINE DATA 
LOCAL
 1 #VAR1 (A2) INIT <"V1">
 1 #VAR2 (A2) INIT <"V2">
 1 #VAR3 (A2) INIT <"V3">
END-DEFINE

INCLUDE WMIN1204C "#VAR1"     "#VAR2"     "#VAR3"

END