000060 IDENTIFICATION DIVISION.
000080
000090 PROGRAM-ID.  TEST.
000100
000110 AUTHOR. MARSIN S RAJ (A49).
000120
000130 DATE-WRITTEN.  9-DEC-2016.

000260 ENVIRONMENT DIVISION.
000270
000280 CONFIGURATION SECTION.
000290 SOURCE-COMPUTER.        VAX.
000300 OBJECT-COMPUTER.        VAX.
000310
000320 INPUT-OUTPUT SECTION.
000400 DATA DIVISION.
000410 WORKING-STORAGE SECTION.

000590*DECLARE_CURSOR.
000600
000790      EXEC SQL
000800            DECLARE HISTORY CURSOR FOR
000810         SELECT
000820             BEN160_CVRG_CD           AS CVRG_CODE
000940        FROM (((((BEN160_COVERAGE_CODE LEFT JOIN
IWCONT        BEN161_COVERAGE_CODE_HISTORY
000950                   ON BEN160_CVRG_CD = BEN161_CVRG_CD)
000960               LEFT JOIN BEN151_PLAN_CODE_COVERAGE_CODE
000970               ON BEN160_CVRG_CD = BEN151_CVRG_CD)
000980               LEFT JOIN BEN150_PLAN_CODE
000990               ON BEN151_PLN_CD_SUID = BEN150_PLN_CD_SUID)
001000               LEFT JOIN BEN152_PLAN_CODE_HISTORY
001010               ON BEN151_PLN_CD_SUID = BEN152_PLN_CD_SUID)
001020               LEFT JOIN BEN060_PRODUCT
001030               ON BEN150_PROD_SUID = BEN060_PROD_SUID)
001040               LEFT JOIN BEN162_CVRG_CD_OVER_AGE_RULE
001050               ON BEN160_CVRG_CD = BEN162_CVRG_CD
001060     END-EXEC.

004920 PROCEDURE DIVISION.
015660     STOP RUN.
