       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEVL8801.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

        01 G1.
          02 PARENT PIC X VALUE SPACE.
            88  FLAG-ENABLED   VALUE "E".
            88  FLAG-DISABLED  VALUE "D".

       PROCEDURE DIVISION.

            DISPLAY G1.
            DISPLAY PARENT.
            DISPLAY FLAG-ENABLED.
            DISPLAY FLAG-DISABLED.

            SET FLAG-ENABLED TO TRUE.
            SET FLAG-DISABLED TO TRUE.

       END PROGRAM LEVL8801.
