       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILDSIB3.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  MY-HEX-CONV.
           05 FILLER-1          PIC X(1) VALUE LOW-VALUES.
           05 MY-HEX-CONV-CHAR  PIC X(1).
       01 WS-ONE PIC 9 VALUE 1.
       01 WS-INPUT PIC X.
       01  MY-HEX-CONV-NUM REDEFINES MY-HEX-CONV PIC 9(4) COMP.
       01 WS-OUTPUTA PIC 9(4).
       01 WS-OUTPUTB PIC 9(4).

       PROCEDURE DIVISION.
           COMPUTE WS-OUTPUTA = WS-INPUT * WS-ONE.
           COMPUTE WS-OUTPUTB = MY-HEX-CONV-NUM * FILLER-1 * 2.
       END PROGRAM FILDSIB3.
