       IDENTIFICATION DIVISION.
       PROGRAM-ID. AND3CLEE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

        01 WS-FIELD PIC X.

       LINKAGE SECTION.

        01 G1 PIC X(1).
        01 G2 PIC x(1).

       PROCEDURE DIVISION USING G1 G2.

         DISPLAY G1 G2.

       END PROGRAM AND3CLEE.
