000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPD111.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*                                                                *00005000
000060*    RPD111 - CREATE NEW RELATIONSHIPS WITH DEFAULT MODEL.       *00006000
000070*                                                                *00007000
000080******************************************************************00008000
000090 ENVIRONMENT DIVISION.                                            00009000
000100 CONFIGURATION SECTION.                                           00010000
000110 SPECIAL-NAMES.                                                   00011000
000120     C01 IS C-01, C02 IS C-02, C03 IS C-03.                       00012000
000130 INPUT-OUTPUT SECTION.                                            00013000
000140 FILE-CONTROL.                                                    00014000
000000 COPY RPMSTWS.                                                    00015000
000160 DATA DIVISION.                                                   00016000
000170 FILE SECTION.                                                    00017000
000000 COPY RPMSTWF.                                                    00018000
000190 01  RPMSTW-RECORD.                                               00019000
000000 COPY RPSMSTW.                                                    00020000
000210 WORKING-STORAGE SECTION.                                         00021000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00022000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00022001
000230 01  RPS-RLSELIT.                                                 00023000
000000 COPY RPWRLSE.                                                    00024000
000250 01  MIC-RLSELIT.                                                 00025000
000000 COPY MIWRLSE.                                                    00026000
000270 01  RPWPRI-AREAS.                                                00027000
000000 COPY RPWPRI.                                                     00028000
000290 01  MIWPRI-AREAS.                                                00029000
000000 COPY MIWPRI.                                                     00030000
000310 01  SRW105-AREAS.                                                00031000
000000 COPY SRW105.                                                     00032000
000330 01  SRW022-AREAS.                                                00033000
000000 COPY SRW022.                                                     00034000
000350*01  BICPBPRM.                                                    00035000
000000 COPY BICPBPRM.                                                   00036000
000370*01  BICRSRB.                                                     00037000
000000 COPY BICRSRB.                                                    00038000
000390*01  BICRPSB.                                                     00039000
000000 COPY BICRPSB.                                                    00040000
000410*01  BICRVERB.                                                    00041000
000000 COPY BICRVERB.                                                   00042000
000430*01  BICRSTAT.                                                    00043000
000000 COPY BICRSTAT.                                                   00044000
000450*01  BICRDBS.                                                     00045000
000000 COPY BICRDBS.                                                    00046000
000470*01  BICRLOG.                                                     00047000
000000 COPY BICRLOG.                                                    00048000
000490 01  RPBNK-RECORD.                                                00049000
000000 COPY RPSBNK.                                                     00050000
000510 01  RPEVT-RECORD.                                                00051000
000000 COPY RPSEVT.                                                     00052000
P0060  01  RPIDX-RECORD.                                                00053000
000000 COPY RPSIDX.                                                     00053390
P0060  01  RPMST-RECORD.                                                00053780
000000 COPY RPSMST.                                                     00054170
000550 01  RPREL-RECORD.                                                00055000
000000 COPY RPSREL.                                                     00056000
000570 01  RPTRM-RECORD.                                                00057000
000000 COPY RPSTRM.                                                     00058000
000590 01  RPRPTS-RECORD.                                               00059000
000000 COPY RPSRPTS.                                                    00060000
000610 01  RPBNKA-AREA.                                                 00061000
000000 COPY RPWBNKA.                                                    00062000
000630 01  RPEVTA-AREA.                                                 00063000
000000 COPY RPWEVTA.                                                    00064000
P0060  01  RPIDXA-AREA.                                                 00064300
000000 COPY RPWIDXA.                                                    00064600
000650 01  RPMSTA-AREA.                                                 00065000
000000 COPY RPWMSTA.                                                    00066000
000670 01  RPRELA-AREA.                                                 00067000
000000 COPY RPWRELA.                                                    00068000
000690 01  RPTRMA-AREA.                                                 00069000
000000 COPY RPWTRMA.                                                    00070000
000710 01  RPRPTSA-RECORD.                                              00071000
000000 COPY RPWRPTS.                                                    00072000
000730*----------------------------------------------------------------*00073000
000740 01  FILLER                      PIC X(08)       VALUE '*MISMST*'.00074000
000750 01  MIMST-RECORD.                                                00075000
000000 COPY MISMST.                                                     00076000
000770 01  FILLER                      PIC X(08)       VALUE '*MI0307*'.00077000
000780 01  MI0307-RECORD.                                               00078000
000000 COPY MIS0307A.                                                   00079000
P0060  01  FILLER                      PIC X(08)       VALUE '*MI2023*'.00079200
P0060  01  MI2023-RECORD.                                               00079400
000000 COPY MIS2023A.                                                   00079600
000800 01  FILLER                      PIC X(08)       VALUE '*MI7100*'.00080000
000810 01  MI7100-RECORD.                                               00081000
000000 COPY MIS7100.                                                    00082000
000830 01  FILLER                      PIC X(08)       VALUE '*MI7101*'.00083000
000840 01  MI7101-RECORD.                                               00084000
000000 COPY MIS7101.                                                    00085000
000860 01  FILLER                      PIC X(08)       VALUE '*MI7110*'.00086000
000870 01  MI7110-RECORD.                                               00087000
000000 COPY MIS7110.                                                    00088000
000890 01  MIWMSTA-AREAS.                                               00089000
000000 COPY MIWMSTA.                                                    00090000
000910***************************************************************** 00091000
000920 01  SRW000-AREAS.                                                00092000
000000 COPY SRW000.                                                     00093000
000940 01  SRW009-AREAS.                                                00094000
000000 COPY SRW009.                                                     00095000
000960 01  WS-ABEND.                                                    00096000
000000 COPY SRW028.                                                     00097000
P0060  01  WS-RPMIM2023AREAS.                                           00097300
000000 COPY RPW2023.                                                    00097600
000980 01  WS-RPMIM7101AREAS.                                           00098000
000000 COPY RPW7101.                                                    00099000
001000 01  WS-RPMIM7110AREAS.                                           00100000
000000 COPY RPW7110.                                                    00101000
P0060 ***************************************************************** 00101300
000000 COPY RPW005.                                                     00101600
001020***************************************************************** 00102000
001030 01  WS-STORAGE.                                                  00103000
001040     03  FILLER                  PIC X(18)       VALUE            00104000
001050         '*** WS-STORAGE ***'.                                    00105000
001060     03  WS-FUNC                 PIC X(01)       VALUE SPACES.    00106000
001070     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00107000
P0060      03  WS-FIRST-REL            PIC X(01)       VALUE SPACES.    00107100
P0060      03  WS-COBOLTIME.                                            00107200
P0060          05  WS-COB-HHMMSS.                                       00107300
P0060              07  WS-COB-HH       PIC 9(02).                       00107400
P0060              07  WS-COB-MM       PIC 9(02).                       00107500
P0060              07  WS-COB-SS       PIC 9(02).                       00107600
001080     03  WS-CURDTYYYYMMDD        PIC 9(08)       VALUE ZEROS.     00108000
001090     03  FILLER          REDEFINES WS-CURDTYYYYMMDD.              00109000
001100         05  WS-CURDTYYYY        PIC 9(04).                       00110000
001110         05  WS-CURDTMMDD        PIC 9(04).                       00111000
001120         05  FILLER      REDEFINES WS-CURDTMMDD.                  00112000
001130             07  WS-CURDTMM      PIC 9(02).                       00113000
001140             07  WS-CURDTDD      PIC 9(02).                       00114000
001150     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00115000
001160     03  FILLER          REDEFINES WS-PDATE.                      00116000
001170         05  WS-PDATE-YYYY       PIC 9(04).                       00117000
001180         05  WS-PDATE-MM         PIC 9(02).                       00118000
001190         05  WS-PDATE-DD         PIC 9(02).                       00119000
001200     03  WS-SUB1                 PIC S9(04)      COMP             00120000
001210                                                 VALUE +0.        00121000
001220     03  WS-SUB2                 PIC S9(04)      COMP             00122000
001230                                                 VALUE +0.        00123000
001240     03  WS-RRPTCTL.                                              00124000
001250         05  FILLER              PIC X(04).                       00125000
001260         05  WS-RRPTPFC          PIC X(01)       VALUE SPACES.    00126000
001270     03  WS-EXPIRATION-DATE      PIC S9(09)      COMP-3.          00127000
001280     03  WS-DEFMODEL-FAIL        PIC X(01)       VALUE SPACES.    00128000
001290     03  WS-FILEOPTIONS          PIC X(25)       VALUE SPACES.    00129000
001300     03  WS-FILEOPTS     REDEFINES WS-FILEOPTIONS.                00130000
001310         05  WS-FILEOPT          PIC X(01)       OCCURS 25.       00131000
001320     03  WS-REL-RECORDS.                                          00132000
P0060          05  WS-REL-RECORD       PIC X(246)      OCCURS 20.       00133000
P0060      03  WS-IDNBR                PIC 9(18)       VALUE ZERO.      00133090
P0060      03  FILLER          REDEFINES WS-IDNBR.                      00133180
P0060          05  WS-IDNBR-DATE       PIC 9(08).                       00133270
P0060          05  WS-IDNBR-TIME       PIC 9(06).                       00133360
P0060          05  WS-IDNBR-DECSEC     PIC 9(02).                       00133450
P0060          05  WS-IDNBR-SEQ        PIC 9(02).                       00133540
001340******************************************************************00134000
001350 PROCEDURE DIVISION.                                              00135000
001360******************************************************************00136000
001370 INITIALIZATION SECTION.                                          00137000
001380 IN-START.                                                        00138000
001390     PERFORM GET-FILE-ORGANIZATION.                               00139000
001400     MOVE 'RPD111' TO SR-APIPROGLIT.                              00140000
001410     MOVE 'RPD111' TO WS-ABPROGID.                                00141000
001420     OPEN INPUT RP-MSTWFIL.                                       00142000
001430 IN-EXIT.                                                         00143000
001440     EXIT.                                                        00144000
001450******************************************************************00145000
001460 OPEN-API-FILES SECTION.                                          00146000
001470 OAF-START.                                                       00147000
001480     MOVE 'O R' TO SR-APIFUNC.                                    00148000
001490     PERFORM CALL-RPS-BNK.                                        00149000
001500     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00150000
001510         GO TO AR-0001.                                           00151000
001520     MOVE 'O U' TO SR-APIFUNC.                                    00152000
001530     PERFORM CALL-RPS-EVT.                                        00153000
001540     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00154000
001550         GO TO AR-0017.                                           00155000
001560     MOVE 'O U' TO SR-APIFUNC.                                    00156000
001570     PERFORM CALL-RPS-MST.                                        00157000
001580     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00158000
001590         GO TO AR-0002.                                           00159000
001600     MOVE 'O U' TO SR-APIFUNC.                                    00160000
001610     PERFORM CALL-RPS-REL.                                        00161000
001620     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00162000
001630         GO TO AR-0003.                                           00163000
001640     MOVE 'O U' TO SR-APIFUNC.                                    00164000
001650     PERFORM CALL-RPS-TRM.                                        00165000
001660     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00166000
001670         GO TO AR-0004.                                           00167000
001680 OAF-EXIT.                                                        00168000
001690     EXIT.                                                        00169000
001700******************************************************************00170000
001710 MAIN-LOGIC SECTION.                                              00171000
001720 ML-START.                                                        00172000
001730     MOVE ZEROS TO RPBNK-GRP-KEY.                                 00173000
001740     MOVE ZEROS TO RPEVT-GRP-KEY.                                 00174000
001750     MOVE ZEROS TO RPMST-GRP-KEY.                                 00175000
001760     MOVE ZEROS TO RPREL-GRP-KEY.                                 00176000
001770     MOVE ZEROS TO RPTRM-GRP-KEY.                                 00177000
001780 ML-PROCESS.                                                      00178000
001790     PERFORM PROCESS-MASTER-WORK.                                 00179000
001800 ML-END.                                                          00180000
001810     GO TO END-ROUTINE.                                           00181000
001820 ML-EXIT.                                                         00182000
001830     EXIT.                                                        00183000
001840******************************************************************00184000
001850 PROCESS-MASTER-WORK SECTION.                                     00185000
001860 PMW-START.                                                       00186000
001870 PMW-READ.                                                        00187000
001880     READ RP-MSTWFIL                                              00188000
001890         AT END                                                   00189000
001900         GO TO PMW-EXIT.                                          00190000
001910 PMW-PROCESS.                                                     00191000
001920     IF RPMSTW-INST IS NOT EQUAL TO RPBNK-INST                    00192000
001930         PERFORM CHANGE-BANK.                                     00193000
001940     MOVE '0' TO WS-DEFMODEL-FAIL.                                00194000
001950 PMW-CHECK-7101.                                                  00195000
001960     MOVE RPMSTW-DEFAULT-MODEL TO WS-RPMIM7101MODEL.              00196000
001970     PERFORM SEARCH-RPS-7101.                                     00197000
001980     IF WS-RPMIM7101FOUND IS EQUAL TO 'N'                         00198000
001990         MOVE '1' TO WS-DEFMODEL-FAIL                             00199000
002000         PERFORM REPORT-055                                       00200000
002010         GO TO PMW-READ.                                          00201000
002020     IF MIM-7101ACTCD IS NOT EQUAL TO 'A'                         00202000
002030         MOVE '2' TO WS-DEFMODEL-FAIL                             00203000
002040         PERFORM REPORT-055                                       00204000
002050         GO TO PMW-READ.                                          00205000
002060 PMW-CHECK-MASTER.                                                00206000
002070     MOVE RPMSTW-GRP-KEY TO RPMST-GRP-KEY.                        00207000
002080     MOVE RPMSTW-DEFAULT-MODEL TO RPMST-MODEL.                    00208000
002090     MOVE 'R  ' TO SR-APIFUNC.                                    00209000
002100     PERFORM CALL-RPS-MST.                                        00210000
002110     IF WS-FUNCTION IS EQUAL TO SPACES                            00211000
002120         MOVE '3' TO WS-DEFMODEL-FAIL                             00212000
002130         PERFORM REPORT-055                                       00213000
002140         GO TO PMW-READ.                                          00214000
002150     IF WS-FUNCTION IS NOT EQUAL TO 'N'                           00215000
002160         GO TO AR-0005.                                           00216000
002170 PMW-EXPDT.                                                       00217000
002180     MOVE ZEROS TO WS-EXPIRATION-DATE.                            00218000
002190     IF MIM-7101EXPDT IS EQUAL TO ZEROS                           00219000
002200         GO TO PMW-CHECK-FREQ.                                    00220000
P0060      IF MIM-7101EXPDT IS NOT GREATER THAN RPBNK-CURDT             00221000
002220         MOVE '4' TO WS-DEFMODEL-FAIL                             00222000
002230         PERFORM REPORT-055                                       00223000
002240         GO TO PMW-READ.                                          00224000
002250     MOVE MIM-7101EXPDT TO WS-EXPIRATION-DATE.                    00225000
002260     GO TO PMW-ADD-RECORDS.                                       00226000
002270 PMW-CHECK-FREQ.                                                  00227000
002280     IF MIM-7101EXPFREQ IS EQUAL TO 'N'                           00228000
002290         GO TO PMW-ADD-RECORDS.                                   00229000
002300     MOVE MIM-7101EXPFREQ TO SR-PERIOD.                           00230000
002310     MOVE MIM-7101EXPTERM TO SR-FREQ.                             00231000
002320     IF MIM-7101EXPFREQ IS EQUAL TO 'M'                           00232000
002330         AND MIM-7101ENDOFMONTH IS EQUAL TO 'Y'                   00233000
002340         MOVE 31 TO SR-DAY                                        00234000
002350     ELSE                                                         00235000
002360         MOVE ZEROS TO SR-DAY.                                    00236000
002370     MOVE WS-CURDTYYYY TO SR-FCYR.                                00237000
002380     MOVE WS-CURDTMM TO SR-FCMON.                                 00238000
002390     MOVE WS-CURDTDD TO SR-FCDAY.                                 00239000
002400     PERFORM JULIAN-365.                                          00240000
002410     MOVE SR-TOJUL TO SR-FROMJUL.                                 00241000
002420     PERFORM NEXT-DATE-365.                                       00242000
002430     MOVE SR-TOJUL TO SR-FROMJUL.                                 00243000
002440     PERFORM CALENDAR-365.                                        00244000
002450     MOVE SR-TCMON TO WS-PDATE-MM.                                00245000
002460     MOVE SR-TCDAY TO WS-PDATE-DD.                                00246000
002470     MOVE SR-TCYR TO WS-PDATE-YYYY.                               00247000
002480     MOVE WS-PDATE TO WS-EXPIRATION-DATE.                         00248000
P0060      IF WS-EXPIRATION-DATE IS NOT GREATER THAN RPBNK-CURDT        00249000
002500         MOVE '4' TO WS-DEFMODEL-FAIL                             00250000
002510         PERFORM REPORT-055                                       00251000
002520         GO TO PMW-READ.                                          00252000
002530 PMW-ADD-RECORDS.                                                 00253000
002540     PERFORM ADD-MASTER.                                          00254000
002550     PERFORM PROCESS-REL.                                         00255000
002560     PERFORM ADD-TRAN-MASTER.                                     00256000
002570     GO TO PMW-READ.                                              00257000
002580 PMW-EXIT.                                                        00258000
002590     EXIT.                                                        00259000
002600******************************************************************00260000
002610 ADD-MASTER SECTION.                                              00261000
002620 AM-START.                                                        00262000
002630     MOVE RPMSTW-GRP-KEY TO RPMST-GRP-KEY.                        00263000
002640     MOVE 'R  ' TO SR-APIFUNC.                                    00264000
002650     PERFORM CALL-RPS-MST.                                        00265000
002660     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00266000
002670         GO TO AR-0006.                                           00267000
002680     PERFORM REPORT-055.                                          00268000
002690     MOVE RPMSTW-DEFAULT-MODEL TO RPMST-MODEL.                    00269000
002700     MOVE 'A' TO RPMST-REL-STAT.                                  00270000
002710     MOVE 'N' TO RPMST-QUAL-STAT.                                 00271000
002720     MOVE RPBNK-CURDT TO RPMST-LMNTDT.                            00272000
002730     MOVE ZEROS TO RPMST-IQUALDT.                                 00273000
002740     MOVE ZEROS TO RPMST-VQUALDT.                                 00274000
002750     MOVE RPBNK-CURDT TO RPMST-DATE-OPENED.                       00275000
002760     MOVE WS-EXPIRATION-DATE TO RPMST-EXPIRATION-DATE.            00276000
002770     MOVE 'N' TO RPMST-SCTODAYFLAG.                               00277000
P0060      PERFORM GET-IDNUMBER.                                        00277300
P0060      MOVE WS-IDNBR TO RPMST-IDNUMBER.                             00277600
002780     MOVE ZEROS TO RPMST-COMBBAL1.                                00278000
002790     MOVE ZEROS TO RPMST-COMBBAL2.                                00279000
002800     MOVE ZEROS TO RPMST-COMBBAL3.                                00280000
002810     MOVE ZEROS TO RPMST-COMBBAL4.                                00281000
002820     MOVE ZEROS TO RPMST-VF-EXP-DATE.                             00282000
002830     MOVE ZEROS TO RPMST-EXTENSIONS.                              00283000
002840     MOVE ZEROS TO RPMST-RETENTION-DAYS.                          00284000
002850     MOVE ZEROS TO RPMST-VF-MSGNBR.                               00285000
002860     MOVE 'A  ' TO SR-APIFUNC.                                    00286000
002870     PERFORM CALL-RPS-MST.                                        00287000
002880     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00288000
002890         GO TO AR-0007.                                           00289000
002900 AM-EXIT.                                                         00290000
002910     EXIT.                                                        00291000
002920******************************************************************00292000
002930 PROCESS-REL SECTION.                                             00293000
002940 PR-START.                                                        00294000
P0060      MOVE 'Y' TO WS-FIRST-REL.                                    00294500
002950     MOVE ZEROS TO WS-SUB1.                                       00295000
002960     MOVE ZEROS TO WS-SUB2.                                       00296000
002970     MOVE SPACES TO WS-REL-RECORDS.                               00297000
P0060      MOVE ZEROS TO RPREL-GRP-KEY.                                 00297500
002980     MOVE RPMSTW-GRP-KEY TO RPREL-ACCT1-GRP.                      00298000
P0060      MOVE ZEROS TO RPREL-INST2.                                   00298200
P0060      MOVE SPACES TO RPREL-PRODCODE2.                              00298400
P0060      MOVE SPACES TO RPREL-ACCOUNT2.                               00298600
002990 PR-READ-NEXT.                                                    00299000
003000     MOVE 'N  ' TO SR-APIFUNC.                                    00300000
003010     PERFORM CALL-RPS-REL.                                        00301000
003020     IF WS-FUNCTION IS EQUAL TO 'E'                               00302000
003030         GO TO PR-PROCESS-REL.                                    00303000
003040     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00304000
003050         GO TO AR-0008.                                           00305000
003060     IF RPMSTW-GRP-KEY IS NOT EQUAL TO RPREL-ACCT1-GRP            00306000
003070         GO TO PR-PROCESS-REL.                                    00307000
P0060  PR-READ-CONT.                                                    00307500
003080     ADD +1 TO WS-SUB1.                                           00308000
P0060      MOVE RPMSTW-DEFAULT-MODEL TO RPREL-MODEL.                    00308500
003090     MOVE RPREL-RECORD TO WS-REL-RECORD (WS-SUB1).                00309000
P0060      MOVE RPMSTW-MODEL TO RPREL-MODEL.                            00309500
003100     IF WS-SUB1 IS LESS THAN +20                                  00310000
003110         GO TO PR-READ-NEXT.                                      00311000
003120 PR-PROCESS-REL.                                                  00312000
003130     IF WS-SUB1 IS EQUAL TO ZEROS                                 00313000
003140         GO TO PR-EXIT.                                           00314000
003150 PR-PROCESS-REL-LOOP.                                             00315000
003160     ADD +1 TO WS-SUB2.                                           00316000
003170     IF WS-REL-RECORD (WS-SUB2) IS EQUAL TO SPACES                00317000
003180         GO TO PR-EXIT.                                           00318000
003190     MOVE WS-REL-RECORD (WS-SUB2) TO RPREL-RECORD.                00319000
003200 PR-EVENT-RECORD.                                                 00320000
003210     IF MIM-7100EVENTHISTORYOPT IS EQUAL TO 'N'                   00321000
003220         GO TO PR-PROCESS-REL-CONT.                               00322000
003230     MOVE 'N' TO RPS-EVT-FLAG.                                    00323000
003240     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   00324000
003250     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   00325000
P0060      IF WS-FIRST-REL IS EQUAL TO 'Y'                              00326000
P0060          MOVE 'N' TO WS-FIRST-REL                                 00326190
P0060          MOVE 01 TO RPS-EVT-EVENT-CODE                            00326380
P0060      ELSE                                                         00326570
P0060          MOVE 07 TO RPS-EVT-EVENT-CODE.                           00326760
P0060      MOVE WS-IDNBR TO RPS-EVT-IDNUMBER.                           00326950
003280     MOVE ZEROS TO RPS-EVT-MSGNBR.                                00328000
003290     PERFORM ADD-EVENT-HISTORY.                                   00329000
003300     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00330000
003310         GO TO AR-0018.                                           00331000
003320 PR-PROCESS-REL-CONT.                                             00332000
003340     MOVE ZEROS TO RPREL-ACCTBAL-1.                               00334000
003350     MOVE ZEROS TO RPREL-ACCTBAL-2.                               00335000
003360     MOVE ZEROS TO RPREL-PRIMEBAL.                                00336000
003370     MOVE ZEROS TO RPREL-ACCT-COMBBAL1.                           00337000
003380     MOVE ZEROS TO RPREL-ACCT-COMBBAL2.                           00338000
003390     MOVE ZEROS TO RPREL-ACCT-COMBBAL3.                           00339000
003400     MOVE ZEROS TO RPREL-ACCT-COMBBAL4.                           00340000
003410     MOVE ZEROS TO RPREL-CASH-RW-BAL.                             00341000
003420     MOVE ZEROS TO RPREL-ACCT-RATE-BAL.                           00342000
003430     MOVE ZEROS TO RPREL-SC-BAL.                                  00343000
003440     MOVE ZEROS TO RPREL-SECSVC-BAL.                              00344000
003450 PR-INITIAL-OVERRIDE.                                             00345000
003460     MOVE 'N' TO RPREL-DISCAMT-OVRD-FLAG.                         00346000
003470     MOVE 'N' TO RPREL-DISCPCT-OVRD-FLAG.                         00347000
003480     MOVE 'N' TO RPREL-RATEPCT-OVRD-FLAG.                         00348000
003490     MOVE ZEROS TO RPREL-DISCAMT-OVRD.                            00349000
003500     MOVE ZEROS TO RPREL-DISCPCT-OVRD.                            00350000
003510     MOVE ZEROS TO RPREL-RATEPCT-OVRD.                            00351000
003520 PR-ADD-REL.                                                      00352000
003530     MOVE 'A  ' TO SR-APIFUNC.                                    00353000
003540     PERFORM CALL-RPS-REL.                                        00354000
003550     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00355000
003560         GO TO AR-0009.                                           00356000
003570     IF WS-SUB2 IS GREATER THAN +19                               00357000
003580         GO TO PR-GET-MORE-REL.                                   00358000
003590     GO TO PR-PROCESS-REL-LOOP.                                   00359000
003600 PR-GET-MORE-REL.                                                 00360000
003610     MOVE WS-REL-RECORD (WS-SUB2) TO RPREL-RECORD.                00361000
003620     MOVE ZEROS TO WS-SUB1.                                       00362000
003630     MOVE ZEROS TO WS-SUB2.                                       00363000
003640     MOVE SPACES TO WS-REL-RECORDS.                               00364000
003650     MOVE 'R  ' TO SR-APIFUNC.                                    00365000
003660     PERFORM CALL-RPS-REL.                                        00366000
003670     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00367000
003680         GO TO AR-0010.                                           00368000
003690     GO TO PR-READ-NEXT.                                          00369000
003700 PR-EXIT.                                                         00370000
003710     EXIT.                                                        00371000
003720******************************************************************00372000
003730 ADD-TRAN-MASTER SECTION.                                         00373000
003740 ATM-START.                                                       00374000
003750     MOVE ZEROS TO WS-SUB1.                                       00375000
003760     IF MIM-7101TRANPROFILE IS EQUAL TO SPACES                    00376000
003770         OR MIM-7101TRANPROFILE-I IS NOT EQUAL TO 'Y'             00377000
003780         GO TO ATM-EXIT.                                          00378000
003790 ATM-MOVE-KEY.                                                    00379000
003800     MOVE RPMSTW-GRP-KEY TO RPMST-GRP-KEY.                        00380000
003810     MOVE RPMSTW-DEFAULT-MODEL TO RPMST-MODEL.                    00381000
003820 ATM-GRACE-DAYS.                                                  00382000
003830     MOVE MIM-7101TRANPROFILE TO WS-RPMIM7110TRANPROFILE.         00383000
003840     PERFORM SEARCH-RPS-7110.                                     00384000
003850     IF WS-RPMIM7110FOUND IS EQUAL TO 'N'                         00385000
003860         MOVE ZEROS TO RPTRM-GRACE-EXPIRATION-DATE                00386000
003870         GO TO ATM-LOOP.                                          00387000
003880     IF MIM-7110GRACE-DAYS IS EQUAL TO ZEROS                      00388000
003890         MOVE ZEROS TO RPTRM-GRACE-EXPIRATION-DATE                00389000
003900         GO TO ATM-LOOP.                                          00390000
003910     MOVE 'D' TO SR-PERIOD.                                       00391000
003920     MOVE MIM-7110GRACE-DAYS TO SR-FREQ.                          00392000
003930     MOVE ZEROS TO SR-DAY.                                        00393000
003940     MOVE WS-CURDTYYYY TO SR-FCYR.                                00394000
003950     MOVE WS-CURDTMM TO SR-FCMON.                                 00395000
003960     MOVE WS-CURDTDD TO SR-FCDAY.                                 00396000
003970     PERFORM JULIAN-365.                                          00397000
003980     MOVE SR-TOJUL TO SR-FROMJUL.                                 00398000
003990     PERFORM NEXT-DATE-365.                                       00399000
004000     MOVE SR-TOJUL TO SR-FROMJUL.                                 00400000
004010     PERFORM CALENDAR-365.                                        00401000
004020     MOVE SR-TCMON TO WS-PDATE-MM.                                00402000
004030     MOVE SR-TCDAY TO WS-PDATE-DD.                                00403000
004040     MOVE SR-TCYR TO WS-PDATE-YYYY.                               00404000
004050     MOVE WS-PDATE TO RPTRM-GRACE-EXPIRATION-DATE.                00405000
004060 ATM-LOOP.                                                        00406000
004070     ADD +1 TO WS-SUB1.                                           00407000
004080     IF WS-SUB1 IS GREATER THAN WS-RPMIM7110MAXOCCURS             00408000
004090         GO TO ATM-ADD-TRM.                                       00409000
004100     MOVE ZEROS TO RPTRM-TRAN-DATE (WS-SUB1).                     00410000
004110     MOVE ZEROS TO RPTRM-TRAN-COUNT (WS-SUB1).                    00411000
004120     MOVE ZEROS TO RPTRM-TRAN-AMOUNT (WS-SUB1).                   00412000
004130     GO TO ATM-LOOP.                                              00413000
004140 ATM-ADD-TRM.                                                     00414000
004150     MOVE 'A  ' TO SR-APIFUNC.                                    00415000
004160     PERFORM CALL-RPS-TRM.                                        00416000
004170     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00417000
004180         GO TO AR-0011.                                           00418000
004190 ATM-EXIT.                                                        00419000
004200     EXIT.                                                        00420000
P0060 ******************************************************************00420050
P0060  GET-IDNUMBER SECTION.                                            00420100
P0060  GID-START.                                                       00420150
P0060  GID-IDX.                                                         00420200
P0060      MOVE ZEROES TO WS-IDNBR.                                     00420250
P0060      ACCEPT WS-COBOLTIME FROM TIME.                               00420300
P0060      MOVE WS-CURDTYYYYMMDD TO WS-IDNBR-DATE.                      00420350
P0060      MOVE WS-COB-HHMMSS TO WS-IDNBR-TIME.                         00420400
P0060      MOVE RPMSTW-INST TO WS-RPIDX-INST.                           00420450
P0060      PERFORM CALCULATE-MIL-SECOND.                                00420500
P0060      IF WS-RPIDX-ERROR IS EQUAL TO 'Y'                            00420550
P0060          GO TO AR-0023.                                           00420600
P0060  GID-EXIT.                                                        00420650
P0060      EXIT.                                                        00420700
P0060 ******************************************************************00420750
P0060  CALCULATE-MIL-SECOND SECTION.                                    00420800
000000 COPY RPP005B.                                                    00420850
004210******************************************************************00421000
004220 REPORT-055 SECTION.                                              00422000
004230 R055-START.                                                      00423000
004240     MOVE SPACES TO RPRPTS-RECORD.                                00424000
004250     MOVE 55 TO RPRPTS-RPTNBR.                                    00425000
004260     MOVE RPMSTW-INST TO RPRPTS-INST.                             00426000
004270     MOVE RPMSTW-PRODCODE TO RPRPTS-PRODCODE.                     00427000
004280     MOVE RPMSTW-ACCOUNT TO RPRPTS-ACCOUNT.                       00428000
004290     MOVE ZEROS TO RPRPTS-BRANCH.                                 00429000
004300     MOVE ZEROS TO RPRPTS-TYPE.                                   00430000
004310     MOVE RPMSTW-DEFAULT-MODEL TO RPRPTS-MODEL.                   00431000
004320     MOVE RPMSTW-MODEL TO RPRPTS-055EXPIRED-MODEL.                00432000
004330     MOVE WS-DEFMODEL-FAIL TO RPRPTS-055FAIL.                     00433000
004340 R055-WRITE-RECORD.                                               00434000
004350     IF WS-RRPTPFC IS EQUAL TO '0'                                00435000
004360         GO TO R055-EXIT.                                         00436000
004370     MOVE ZEROS TO RPRPTS-SRTNUMBER.                              00437000
004380     MOVE WS-RRPTCTL TO RPRPTS-RPTCTL.                            00438000
004390     MOVE 'ASE' TO WS-RRPTS.                                      00439000
004400     PERFORM CALL-RPRPTS.                                         00440000
004410     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00441000
004420         GO TO AR-0012.                                           00442000
004430 R055-EXIT.                                                       00443000
004440     EXIT.                                                        00444000
004450******************************************************************00445000
004460 CHANGE-BANK SECTION.                                             00446000
004470 CB-START.                                                        00447000
004480     MOVE 'R  ' TO SR-APIFUNC.                                    00448000
004490     MOVE RPMSTW-INST TO RPBNK-INST.                              00449000
004500     PERFORM CALL-RPS-BNK.                                        00450000
004510     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00451000
004520         GO TO AR-0013.                                           00452000
P0060      MOVE RPBNK-CURDT TO WS-CURDTYYYYMMDD.                        00452500
004530 CB-0307.                                                         00453000
004540     MOVE SPACES TO MI0307-RECORD.                                00454000
004550     MOVE RPBNK-INST TO MIM-0307KINST.                            00455000
004560     MOVE 50 TO MIM-0307KAPPL.                                    00456000
004570     MOVE 3 TO MIM-0307KRECNBR.                                   00457000
004580     MOVE +0307 TO MIM-0307KREC.                                  00458000
004590     MOVE MIC-MST-0307-PRI TO MIC-MST-REC-PRI.                    00459000
004600     MOVE MI0307-RECORD TO MIMST-RECORD.                          00460000
004610     PERFORM MIC-MST-GET-REQUEST.                                 00461000
004620     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00462000
004630         GO TO AR-0014.                                           00463000
004640     MOVE MIMST-RECORD TO MI0307-RECORD.                          00464000
004650     MOVE MIM-DSRPTCTL (16) TO WS-RRPTCTL.                        00465000
P0060  CB-REC2023.                                                      00465100
P0060      MOVE RPBNK-INST TO WS-RPMIM2023INST.                         00465200
P0060      PERFORM LOAD-RPS-2023.                                       00465300
P0060      IF WS-RPMIM2023ERROR IS EQUAL TO 'Y'                         00465400
P0060          GO TO AR-0024.                                           00465500
P0060      IF WS-RPMIM2023-RPS IS NOT GREATER THAN SPACES               00465600
P0060          GO TO AR-0025.                                           00465700
004660 CB-REC7100.                                                      00466000
004670     MOVE SPACES TO MI7100-RECORD.                                00467000
004680     MOVE RPBNK-INST TO MIM-7100KINST.                            00468000
004690     MOVE +7100 TO MIM-7100KREC.                                  00469000
004700     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00470000
004710     MOVE MI7100-RECORD TO MIMST-RECORD.                          00471000
004720     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00472000
004730     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00473000
004740         GO TO AR-0019.                                           00474000
004750     MOVE MIMST-RECORD TO MI7100-RECORD.                          00475000
004760     IF MIM-7100KINST IS NOT EQUAL TO RPBNK-INST                  00476000
004770         GO TO AR-0020.                                           00477000
004780 CB-REC7101.                                                      00478000
004790     MOVE RPBNK-INST TO WS-RPMIM7101INST.                         00479000
004800     COMPUTE WS-RPMIM7101EFFDT = RPBNK-CURDT - 99999999.          00480000
004810     PERFORM LOAD-RPS-7101.                                       00481000
004820     IF WS-RPMIM7101ERROR IS EQUAL TO 'Y'                         00482000
004830         GO TO AR-0015.                                           00483000
004840 CB-REC7110.                                                      00484000
004850     MOVE RPBNK-INST TO WS-RPMIM7110INST.                         00485000
004860     PERFORM LOAD-RPS-7110.                                       00486000
004870     IF WS-RPMIM7110ERROR IS EQUAL TO 'Y'                         00487000
004880         GO TO AR-0016.                                           00488000
004890 CB-EXIT.                                                         00489000
004900     EXIT.                                                        00490000
004910******************************************************************00491000
004920 GET-FILE-ORGANIZATION SECTION.                                   00492000
000000 COPY SRP093.                                                     00493000
004940******************************************************************00494000
004950*MIC-MST-API SECTION.                                             00495000
000000 COPY MIPMSTA.                                                    00496000
004970******************************************************************00497000
004980 ADD-EVENT-HISTORY SECTION.                                       00498000
000000 COPY RPPEVTC.                                                    00499000
005000******************************************************************00500000
005010 CALL-RPS-BNK SECTION.                                            00501000
000000 COPY RPPBNKB.                                                    00502000
005030******************************************************************00503000
005040 CALL-RPS-EVT SECTION.                                            00504000
000000 COPY RPPEVTB.                                                    00505000
005060******************************************************************00506000
P0060  CALL-RPS-IDX SECTION.                                            00507000
000000 COPY RPPIDXB.                                                    00507290
P0060 ******************************************************************00507580
P0060  CALL-RPS-MST SECTION.                                            00507870
000000 COPY RPPMSTB.                                                    00508160
005090******************************************************************00509000
005100 CALL-RPS-REL SECTION.                                            00510000
000000 COPY RPPRELB.                                                    00511000
005120******************************************************************00512000
005130 CALL-RPS-TRM SECTION.                                            00513000
000000 COPY RPPTRMB.                                                    00514000
P0060 ******************************************************************00514200
P0060  LOAD-RPS-2023 SECTION.                                           00514400
000000 COPY RPP2023.                                                    00514600
005150******************************************************************00515000
005160 LOAD-RPS-7101 SECTION.                                           00516000
000000 COPY RPP7101.                                                    00517000
005180******************************************************************00518000
005190 SEARCH-RPS-7101 SECTION.                                         00519000
000000 COPY RPP7101S.                                                   00520000
005210******************************************************************00521000
005220 LOAD-RPS-7110 SECTION.                                           00522000
000000 COPY RPP7110.                                                    00523000
005240******************************************************************00524000
005250 SEARCH-RPS-7110 SECTION.                                         00525000
000000 COPY RPP7110S.                                                   00526000
005270******************************************************************00527000
005280 JULIAN-365 SECTION.                                              00528000
000000 COPY SRP001.                                                     00529000
005300******************************************************************00530000
005310 CALENDAR-365 SECTION.                                            00531000
000000 COPY SRP003.                                                     00532000
005330******************************************************************00533000
005340 ELAPSED-DAYS-365 SECTION.                                        00534000
000000 COPY SRP005.                                                     00535000
005360***************************************************************** 00536000
005370 NEXT-CODASYL-365 SECTION.                                        00537000
000000 COPY SRP088.                                                     00538000
005390******************************************************************00539000
005400 CALL-RPRPTS SECTION.                                             00540000
000000 COPY RPPRPTS.                                                    00541000
005420******************************************************************00542000
005430 ELAPSED-MONTHS SECTION.                                          00543000
000000 COPY SRP101.                                                     00544000
005450******************************************************************00545000
005460 NEXT-DATE-365 SECTION.                                           00546000
000000 COPY SRP009.                                                     00547000
005480******************************************************************00548000
005490 NEXT-CYCLE-365 SECTION.                                          00549000
000000 COPY SRP022.                                                     00550000
005510******************************************************************00551000
005520 ABORT-ROUTINE SECTION.                                           00552000
005530 AR-0001.                                                         00553000
005540     MOVE 1 TO WS-ABCODE.                                         00554000
005550     GO TO AR-MSG.                                                00555000
005560 AR-0002.                                                         00556000
005570     MOVE 2 TO WS-ABCODE.                                         00557000
005580     GO TO AR-MSG.                                                00558000
005590 AR-0003.                                                         00559000
005600     MOVE 3 TO WS-ABCODE.                                         00560000
005610     GO TO AR-MSG.                                                00561000
005620 AR-0004.                                                         00562000
005630     MOVE 4 TO WS-ABCODE.                                         00563000
005640     GO TO AR-MSG.                                                00564000
005650 AR-0005.                                                         00565000
005660     MOVE 5 TO WS-ABCODE.                                         00566000
005670     GO TO AR-MSG.                                                00567000
005680 AR-0006.                                                         00568000
005690     MOVE 6 TO WS-ABCODE.                                         00569000
005700     GO TO AR-MSG.                                                00570000
005710 AR-0007.                                                         00571000
005720     MOVE 7 TO WS-ABCODE.                                         00572000
005730     GO TO AR-MSG.                                                00573000
005740 AR-0008.                                                         00574000
005750     MOVE 8 TO WS-ABCODE.                                         00575000
005760     GO TO AR-MSG.                                                00576000
005770 AR-0009.                                                         00577000
005780     MOVE 9 TO WS-ABCODE.                                         00578000
005790     GO TO AR-MSG.                                                00579000
005800 AR-0010.                                                         00580000
005810     MOVE 10 TO WS-ABCODE.                                        00581000
005820     GO TO AR-MSG.                                                00582000
005830 AR-0011.                                                         00583000
005840     MOVE 11 TO WS-ABCODE.                                        00584000
005850     GO TO AR-MSG.                                                00585000
005860 AR-0012.                                                         00586000
005870     MOVE 12 TO WS-ABCODE.                                        00587000
005880     GO TO AR-MSG.                                                00588000
005890 AR-0013.                                                         00589000
005900     MOVE 13 TO WS-ABCODE.                                        00590000
005910     GO TO AR-MSG.                                                00591000
005920 AR-0014.                                                         00592000
005930     MOVE 14 TO WS-ABCODE.                                        00593000
005940     GO TO AR-MSG.                                                00594000
005950 AR-0015.                                                         00595000
005960     MOVE 15 TO WS-ABCODE.                                        00596000
005970     GO TO AR-MSG.                                                00597000
005980 AR-0016.                                                         00598000
005990     MOVE 16 TO WS-ABCODE.                                        00599000
006000     GO TO AR-MSG.                                                00600000
006010 AR-0017.                                                         00601000
006020     MOVE 17 TO WS-ABCODE.                                        00602000
006030     GO TO AR-MSG.                                                00603000
006040 AR-0018.                                                         00604000
006050     MOVE 18 TO WS-ABCODE.                                        00605000
006060     GO TO AR-MSG.                                                00606000
006070 AR-0019.                                                         00607000
006080     MOVE 19 TO WS-ABCODE.                                        00608000
006090     GO TO AR-MSG.                                                00609000
006100 AR-0020.                                                         00610000
006110     MOVE 20 TO WS-ABCODE.                                        00611000
006120     GO TO AR-MSG.                                                00612000
P0060  AR-0021.                                                         00612060
P0060      MOVE 21 TO WS-ABCODE.                                        00612120
P0060      GO TO AR-MSG.                                                00612180
P0060  AR-0022.                                                         00612240
P0060      MOVE 22 TO WS-ABCODE.                                        00612300
P0060      GO TO AR-MSG.                                                00612360
P0060  AR-0023.                                                         00612420
P0060      MOVE 23 TO WS-ABCODE.                                        00612480
P0060      GO TO AR-MSG.                                                00612540
P0060  AR-0024.                                                         00612600
P0060      MOVE 24 TO WS-ABCODE.                                        00612660
P0060      GO TO AR-MSG.                                                00612720
P0060  AR-0025.                                                         00612780
P0060      MOVE 25 TO WS-ABCODE.                                        00612840
P0060      GO TO AR-MSG.                                                00612900
006130 AR-MSG.                                                          00613000
006140     MOVE WS-FUNCTION TO WS-ABFC.                                 00614000
006150 AR-PRINT.                                                        00615000
000000 COPY SRP029.                                                     00616000
006170******************************************************************00617000
006180 END-ROUTINE SECTION.                                             00618000
006190 ER-START.                                                        00619000
006200     CLOSE RP-MSTWFIL.                                            00620000
006210     MOVE 'GC ' TO SR-APIFUNC.                                    00621000
006220     PERFORM CALL-RPS-BNK.                                        00622000
006230     STOP RUN.                                                    00623000
