000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPD100.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*                                                                *00005000
000060*    RPD100 - RELATIONSHIP PRICING ENROLLMENT                    *00006000
000070*                                                                *00007000
000080******************************************************************00008000
000090 ENVIRONMENT DIVISION.                                            00009000
000100 CONFIGURATION SECTION.                                           00010000
000110 SPECIAL-NAMES.                                                   00011000
000120     C01 IS C-01, C02 IS C-02, C03 IS C-03.                       00012000
000130 INPUT-OUTPUT SECTION.                                            00013000
000140 FILE-CONTROL.                                                    00014000
000150 DATA DIVISION.                                                   00015000
000160 FILE SECTION.                                                    00016000
000170 WORKING-STORAGE SECTION.                                         00017000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00018000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00018001
000190 01  RPS-RLSELIT.                                                 00019000
000000 COPY RPWRLSE.                                                    00020000
000210 01  MIC-RLSELIT.                                                 00021000
000000 COPY MIWRLSE.                                                    00022000
000230 01  RPWPRI-AREAS.                                                00023000
000000 COPY RPWPRI.                                                     00024000
000250 01  MIWPRI-AREAS.                                                00025000
000000 COPY MIWPRI.                                                     00026000
000270 01  SRW105-AREAS.                                                00027000
000000 COPY SRW105.                                                     00028000
000290*01  BICPBPRM.                                                    00029000
000000 COPY BICPBPRM.                                                   00030000
000310*01  BICRSRB.                                                     00031000
000000 COPY BICRSRB.                                                    00032000
000330*01  BICRPSB.                                                     00033000
000000 COPY BICRPSB.                                                    00034000
000350*01  BICRVERB.                                                    00035000
000000 COPY BICRVERB.                                                   00036000
000370*01  BICRSTAT.                                                    00037000
000000 COPY BICRSTAT.                                                   00038000
000390*01  BICRDBS.                                                     00039000
000000 COPY BICRDBS.                                                    00040000
000410 01  RPACT-RECORD.                                                00041000
000000 COPY RPSACT.                                                     00042000
000430 01  RPBNK-RECORD.                                                00043000
000000 COPY RPSBNK.                                                     00044000
000450 01  RPCRW-RECORD.                                                00045000
000000 COPY RPSCRW.                                                     00046000
000470 01  RPEVT-RECORD.                                                00047000
000000 COPY RPSEVT.                                                     00048000
000490 01  RPMST-RECORD.                                                00049000
000000 COPY RPSMST.                                                     00050000
000510 01  RPQUA-RECORD.                                                00051000
000000 COPY RPSQUA.                                                     00052000
000530 01  RPREL-RECORD.                                                00053000
000000 COPY RPSREL.                                                     00054000
000550 01  RPRPTS-RECORD.                                               00055000
000000 COPY RPSRPTS.                                                    00056000
000570 01  RPTRM-RECORD.                                                00057000
000000 COPY RPSTRM.                                                     00058000
000590 01  RPACTA-AREA.                                                 00059000
000000 COPY RPWACTA.                                                    00060000
000610 01  RPBNKA-AREA.                                                 00061000
000000 COPY RPWBNKA.                                                    00062000
000630 01  RPCRWA-AREA.                                                 00063000
000000 COPY RPWCRWA.                                                    00064000
000650 01  RPEVTA-AREA.                                                 00065000
000000 COPY RPWEVTA.                                                    00066000
000670 01  RPMSTA-AREA.                                                 00067000
000000 COPY RPWMSTA.                                                    00068000
000690 01  RPQUAA-AREA.                                                 00069000
000000 COPY RPWQUAA.                                                    00070000
000710 01  RPRELA-AREA.                                                 00071000
000000 COPY RPWRELA.                                                    00072000
000730 01  RPRPTSA-AREA.                                                00073000
000000 COPY RPWRPTS.                                                    00074000
000750 01  RPTRMA-AREA.                                                 00075000
000000 COPY RPWTRMA.                                                    00076000
000770 01  FILLER                      PIC X(08)       VALUE '*MISMST*'.00077000
000780 01  MIMST-RECORD.                                                00078000
000000 COPY MISMST.                                                     00079000
000800 01  FILLER                      PIC X(08)       VALUE '*MI0237*'.00080000
000810 01  MI0237-RECORD.                                               00081000
000000 COPY MIS0237A.                                                   00082000
000830 01  FILLER                      PIC X(08)       VALUE '*MI0307*'.00083000
000840 01  MI0307-RECORD.                                               00084000
000000 COPY MIS0307A.                                                   00085000
000860 01  FILLER                      PIC X(08)       VALUE '*MI2001*'.00086000
000870 01  MI2001-RECORD.                                               00087000
000000 COPY MIS2001A.                                                   00088000
000890 01  FILLER                      PIC X(08)       VALUE '*MI2011*'.00089000
000900 01  MI2011-RECORD.                                               00090000
000000 COPY MIS2011A.                                                   00091000
000920 01  FILLER                      PIC X(08)       VALUE '*MI2023*'.00092000
000930 01  MI2023-RECORD.                                               00093000
000000 COPY MIS2023A.                                                   00094000
000950 01  FILLER                      PIC X(08)       VALUE '*MI2024*'.00095000
000960 01  MI2024-RECORD.                                               00096000
000000 COPY MIS2024A.                                                   00097000
000980 01  FILLER                      PIC X(08)       VALUE '*MI7100*'.00098000
000990 01  MI7100-RECORD.                                               00099000
000000 COPY MIS7100.                                                    00100000
001010 01  FILLER                      PIC X(08)       VALUE '*MI7101*'.00101000
001020 01  MI7101-RECORD.                                               00102000
000000 COPY MIS7101.                                                    00103000
001040 01  FILLER                      PIC X(08)       VALUE '*MI7102*'.00104000
001050 01  MI7102-RECORD.                                               00105000
000000 COPY MIS7102.                                                    00106000
001070 01  FILLER                      PIC X(08)       VALUE '*MI7104*'.00107000
001080 01  MI7104-RECORD.                                               00108000
000000 COPY MIS7104.                                                    00109000
001100 01  FILLER                      PIC X(08)       VALUE '*MI7106*'.00110000
001110 01  MI7106-RECORD.                                               00111000
000000 COPY MIS7106.                                                    00112000
001130 01  FILLER                      PIC X(08)       VALUE '*MI7107*'.00113000
001140 01  MI7107-RECORD.                                               00114000
000000 COPY MIS7107.                                                    00115000
001160 01  FILLER                      PIC X(08)       VALUE '*MI7110*'.00116000
001170 01  MI7110-RECORD.                                               00117000
000000 COPY MIS7110.                                                    00118000
001190 01  MIWMSTA-AREAS.                                               00119000
000000 COPY MIWMSTA.                                                    00120000
001210***************************************************************** 00121000
001220 01  WS-LINKRCIF.                                                 00122000
000000 COPY MISCNT00      REPLACING                                     00123000
001240     ==:MICNT:== BY ==RPRF21==.                                   00124000
000000 COPY RPSRF21.                                                    00125000
001260***************************************************************** 00126000
001270 01  WS-LINKAPPL.                                                 00127000
000000 COPY MISCNT00      REPLACING                                     00128000
001290     ==:MICNT:== BY ==RPINF00==.                                  00129000
000000 COPY RPSINF00.                                                   00130000
001310***************************************************************** 00131000
001320 01  WS-LINKUSER.                                                 00132000
000000 COPY MISCNT00      REPLACING                                     00133000
001340     ==:MICNT:== BY ==RPUSER==.                                   00134000
000000 COPY RPWUSER.                                                    00135000
001360***************************************************************** 00136000
001370 01  SRW000-AREAS.                                                00137000
000000 COPY SRW000.                                                     00138000
001390 01  SRW009-AREAS.                                                00139000
000000 COPY SRW009.                                                     00140000
001410 01  SRW015-AREAS.                                                00141000
000000 COPY SRW015.                                                     00142000
001430 01  SRW022-AREAS.                                                00143000
000000 COPY SRW022.                                                     00144000
001450 01  WS-ABEND.                                                    00145000
000000 COPY SRW028.                                                     00146000
001470 01  SRW033-AREAS.                                                00147000
000000 COPY SRW033.                                                     00148000
001490 01  SRW044-AREAS.                                                00149000
000000 COPY SRW044.                                                     00150000
001510 01  SRW060-AREAS.                                                00151000
000000 COPY SRW060.                                                     00152000
001530 01  RPW015-AREAS.                                                00153000
000000 COPY RPW015.                                                     00154000
001550 01  WS-RPMIM2001AREAS.                                           00155000
000000 COPY RPW2001.                                                    00156000
001570 01  WS-RPMIM2023AREAS.                                           00157000
000000 COPY RPW2023.                                                    00158000
001590 01  WS-RPMIM7101AREAS.                                           00159000
000000 COPY RPW7101.                                                    00160000
001610 01  WS-RPMIM7102AREAS.                                           00161000
000000 COPY RPW7102.                                                    00162000
001630 01  WS-RPMIM7104AREAS.                                           00163000
000000 COPY RPW7104.                                                    00164000
001650 01  WS-RPMIM7106AREAS.                                           00165000
000000 COPY RPW7106.                                                    00166000
001670 01  WS-RPMIM7107AREAS.                                           00167000
000000 COPY RPW7107.                                                    00168000
001690 01  WS-RPMIM7110AREAS.                                           00169000
000000 COPY RPW7110.                                                    00170000
P0101 ***************************************************************** 00170200
P0101  01  WS-PRIMRELCD-WORKAREA.                                       00170400
000000 COPY RPW007.                                                     00170600
P0101 ***************************************************************** 00170800
001710 01  WS-STORAGE.                                                  00171000
001720     03  FILLER                  PIC X(18)       VALUE            00172000
001730         '*** WS-STORAGE ***'.                                    00173000
001740     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00174000
001750     03  WS-0237-VALID           PIC X(01)       VALUE 'N'.       00175000
001760     03  WS-2011-MSGNBR          PIC X(05)       VALUE SPACES.    00176000
001770     03  WS-2011-ERROR.                                           00177000
001780         05  FILLER              PIC X(08)       VALUE            00178000
001790             'MESSAGE '.                                          00179000
001800         05  WS-2011-ERRORNBR    PIC X(05)       VALUE SPACES.    00180000
001810         05  FILLER              PIC X(22)       VALUE            00181000
001820              ' NOT ON FILE          '.                           00182000
001830     03  WS-ERRORMESSAGE         PIC X(35)       VALUE SPACES.    00183000
001840     03  WS-PRIMCATBAL           PIC S9(13)V99   COMP-3           00184000
001850                                                 VALUE ZEROS.     00185000
001860     03  WS-SECCATBAL            PIC S9(13)V99   COMP-3           00186000
001870                                                 VALUE ZEROS.     00187000
001880     03  WS-COMBINEBAL1          PIC S9(15)V99   COMP-3           00188000
001890                                                 VALUE ZEROS.     00189000
001900     03  WS-COMBINEBAL2          PIC S9(15)V99   COMP-3           00190000
001910                                                 VALUE ZEROS.     00191000
001920     03  WS-COMBINEBAL3          PIC S9(15)V99   COMP-3           00192000
001930                                                 VALUE ZEROS.     00193000
001940     03  WS-COMBINEBAL4          PIC S9(15)V99   COMP-3           00194000
001950                                                 VALUE ZEROS.     00195000
001960     03  WS-EXPIRATION-DATE      PIC S9(09)      COMP-3.          00196000
001970     03  WS-PRIMARY-ENROLL       PIC X(01)       VALUE 'N'.       00197000
001980     03  WS-PRIMARY-TABLE.                                        00198000
001990         05  WS-PRIM-INFO.                                        00199000
002000             07  WS-PRIM-PRODCD  PIC X(06).                       00200000
002010             07  WS-PRIM-APPL    PIC 9(02).                       00201000
002020             07  WS-PRIM-BRANCH  PIC 9(05).                       00202000
002030             07  WS-PRIM-TYPE    PIC 9(03).                       00203000
002040             07  WS-PRIM-ACCT    PIC X(18).                       00204000
002050             07  WS-PRIM-ACTREC  PIC X(01).                       00205000
002060             07  WS-PRIM-SCINCOPT                                 00206000
002070                                 PIC X(01).                       00207000
002080             07  WS-PRIM-RATEINCOPT                               00208000
002090                                 PIC X(01).                       00209000
002100             07  WS-PRIM-TIMEPROCOPT                              00210000
002110                                 PIC X(01).                       00211000
002120             07  WS-PRIM-SCNXT   PIC S9(09)      COMP-3.          00212000
002130             07  WS-PRIM-PROD-GROUP                               00213000
002140                                 PIC 9(01).                       00214000
002150             07  WS-PRIM-7102    PIC X(01).                       00215000
002160             07  WS-PRIM-MODEL   PIC X(10).                       00216000
002170     03  WS-SECONDARY-MAX        PIC S9(04)      COMP             00217000
002180                                                 VALUE +1000.     00218000
002190     03  WS-SECONDARY-TABLE.                                      00219000
002200         05  WS-SEC-INFO                         OCCURS           00220000
002210                                                 1000 TIMES.      00221000
002220             07  WS-SEC-PRODCD   PIC X(06).                       00222000
002230             07  WS-SEC-APPL     PIC 9(02).                       00223000
002240             07  WS-SEC-BRANCH   PIC 9(05).                       00224000
002250             07  WS-SEC-TYPE     PIC 9(03).                       00225000
002260             07  WS-SEC-INST     PIC 9(04).                       00226000
002270             07  WS-SEC-ACCT     PIC X(18).                       00227000
002280             07  WS-SEC-RELNBR   PIC 9(02).                       00228000
P0101              07  WS-SEC-PRIMCUSTRELNBR                            00228300
P0101                                  PIC 9(02).                       00228600
002290             07  WS-SEC-RPOPT    PIC X(01).                       00229000
002300             07  WS-SEC-ACTREC   PIC X(01).                       00230000
002310             07  WS-SEC-SCINCOPT                                  00231000
002320                                 PIC X(01).                       00232000
002330             07  WS-SEC-RATEINCOPT                                00233000
002340                                 PIC X(01).                       00234000
002350             07  WS-SEC-TIMEPROCOPT                               00235000
002360                                 PIC X(01).                       00236000
002370             07  WS-SEC-BAL1     PIC S9(15)V99   COMP-3.          00237000
002380             07  WS-SEC-BAL2     PIC S9(15)V99   COMP-3.          00238000
002390             07  WS-SEC-BAL3     PIC S9(15)V99   COMP-3.          00239000
002400             07  WS-SEC-BAL4     PIC S9(15)V99   COMP-3.          00240000
002410             07  WS-SEC-QUAL     PIC X(01).                       00241000
002420             07  WS-SEC-PROD-GROUP                                00242000
002430                                 PIC 9(01).                       00243000
002440             07  WS-SEC-7102     PIC X(01).                       00244000
002450             07  WS-SEC-ADDON    PIC X(01).                       00245000
002460     03  WS-APPLICATION-TABLE.                                    00246000
002470         05  WS-APPLTBL-INTRFACEX.                                00247000
002480             07  WS-INTRFACE     PIC X(08)       OCCURS 100 TIMES.00248000
002490     03  WS-CAC-MAX              PIC S9(04)      COMP             00249000
002500                                                 VALUE +33.       00250000
002510     03  WS-CAC-TABLE.                                            00251000
002520         05  WS-CAC-INFO                         OCCURS 33 TIMES. 00252000
002530             07  WS-CAC-INST     PIC 9(04).                       00253000
002540             07  WS-CAC-PRODCD   PIC X(06).                       00254000
002550             07  WS-CAC-ACCT     PIC X(18).                       00255000
002560             07  WS-CAC-RELNBR   PIC 9(02).                       00256000
002570         05 FILLER               PIC X(10)       VALUE SPACES.    00257000
002580     03  WS-PGSEARCH-MAX         PIC S9(04)      COMP             00258000
002590                                                 VALUE +99.       00259000
002600     03  WS-PGSEARCH-TABLE.                                       00260000
002610         05  WS-PGSEARCH                         OCCURS 99 TIMES. 00261000
002620             07  WS-PG-PRODCD    PIC X(06).                       00262000
002630             07  WS-PG-TYPE      PIC 9(03).                       00263000
002640             07  WS-PG-7102      PIC X(01).                       00264000
002650     03  WS-ADDON-MAX            PIC S9(04)      COMP             00265000
002660                                                 VALUE +99.       00266000
002670     03  WS-ADDON-TABLE.                                          00267000
002680         05  WS-ADDON                            OCCURS 99 TIMES. 00268000
002690             07  WS-ADD-INST     PIC 9(04).                       00269000
002700             07  WS-ADD-PRODCD   PIC X(06).                       00270000
002710             07  WS-ADD-ACCOUNT  PIC X(18).                       00271000
002720     03  WS-2024-AREA.                                            00272000
002730         05  WS-2024-RECORD                      OCCURS           00273000
002740                                                 9999 TIMES.      00274000
002750             07  WS-2024-EXISTS  PIC X(01).                       00275000
002760     03  WS-0237-MAX             PIC S9(04)      COMP             00276000
002770                                                 VALUE +1000.     00277000
002780     03  WS-0237-TABLE.                                           00278000
002790         05  WS-0237-INTRFACE                    OCCURS           00279000
002800                                                 1000 TIMES       00280000
002810                                 ASCENDING KEY IS WS-0237-KEY     00281000
002820                                 INDEXED BY INDX-0237.            00282000
002830             07  WS-0237-KEY.                                     00283000
002840                 09  WS-0237-INST                                 00284000
002850                                 PIC 9(04).                       00285000
002860                 09  WS-0237-APPL                                 00286000
002870                                 PIC 9(02).                       00287000
002880             07  WS-0237-INTF    PIC X(08).                       00288000
002890     03  WS-0237TEST-KEY.                                         00289000
002900         05  WS-0237TEST-INST    PIC 9(04).                       00290000
002910         05  WS-0237TEST-APPL    PIC 9(02).                       00291000
002920     03  WS-PRODCODE-MAX         PIC S9(04)      COMP             00292000
002930                                                 VALUE +1000.     00293000
002940     03  WS-PRODCODE-TABLE.                                       00294000
002950         05  WS-PRODCODE-INFO                    OCCURS           00295000
002960                                                 1000 TIMES.      00296000
002970             07  WS-PRODCODE     PIC X(06).                       00297000
002980     03  WS-CURDTYYYYMMDD        PIC 9(08)       VALUE ZEROS.     00298000
002990     03  FILLER          REDEFINES WS-CURDTYYYYMMDD.              00299000
003000         05  WS-CURDTYYYY        PIC 9(04).                       00300000
003010         05  WS-CURDTMMDD        PIC 9(04).                       00301000
003020         05  FILLER      REDEFINES WS-CURDTMMDD.                  00302000
003030             07  WS-CURDTMM      PIC 9(02).                       00303000
003040             07  WS-CURDTDD      PIC 9(02).                       00304000
003050     03  WS-DATEMMDDYYYY         PIC 9(08)       VALUE ZEROS.     00305000
003060     03  FILLER          REDEFINES WS-DATEMMDDYYYY.               00306000
003070         05  WS-DATEMM           PIC 9(02).                       00307000
003080         05  WS-DATEDD           PIC 9(02).                       00308000
003090         05  WS-DATEYYYY         PIC 9(04).                       00309000
003100     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00310000
003110     03  FILLER          REDEFINES WS-PDATE.                      00311000
003120         05  WS-PDATE-YYYY       PIC 9(04).                       00312000
003130         05  WS-PDATE-MM         PIC 9(02).                       00313000
003140         05  WS-PDATE-DD         PIC 9(02).                       00314000
003150     03  WS-LINES                PIC S9(03)      COMP-3           00315000
003160                                                 VALUE +0.        00316000
003170     03  WS-SUB1                 PIC S9(04)      COMP             00317000
003180                                                 VALUE +0.        00318000
003190     03  WS-SUB2                 PIC S9(04)      COMP             00319000
003200                                                 VALUE +0.        00320000
003210     03  WS-SUB3                 PIC S9(04)      COMP             00321000
003220                                                 VALUE +0.        00322000
003230     03  WS-SUB4                 PIC S9(04)      COMP             00323000
003240                                                 VALUE +0.        00324000
003250     03  WS-SUBSEC               PIC S9(04)      COMP             00325000
003260                                                 VALUE +0.        00326000
P0101      03  WS-SUBSEC2              PIC S9(04)      COMP             00326300
P0101                                                  VALUE +0.        00326600
003270     03  WS-SUBPROD              PIC S9(04)      COMP             00327000
003280                                                 VALUE +0.        00328000
003290     03  WS-SUBPG                PIC S9(04)      COMP             00329000
003300                                                 VALUE +0.        00330000
003310     03  WS-SUBADD               PIC S9(04)      COMP             00331000
003320                                                 VALUE +0.        00332000
003330     03  WS-SUBPCODE             PIC S9(04)      COMP             00333000
003340                                                 VALUE +0.        00334000
003350     03  WS-ENROLLATTEMPTS       PIC 9(02)       VALUE ZEROS.     00335000
003360     03  WS-SUBERROR             PIC 9(04)       VALUE ZEROS.     00336000
003370     03  WS-SUBINST              PIC 9(04)       VALUE ZEROS.     00337000
003380     03  WS-ERRORNBR             PIC S9(03)      COMP-3           00338000
003390                                                 VALUE ZEROS.     00339000
003400     03  WS-EDITEDACCOUNT        PIC X(22)       VALUE SPACES.    00340000
003410     03  WS-PREV-PRODCD          PIC X(06)       VALUE SPACES.    00341000
003420     03  WS-PRINT-SW             PIC X(01)       VALUE 'P'.       00342000
003430     03  WS-MODEL-REQS           PIC X(01)       VALUE 'N'.       00343000
003440     03  WS-MIN-MAX-PROD-REQS    PIC X(01)       VALUE 'N'.       00344000
003450     03  WS-MIN-MAX-ACCT-REQS    PIC X(01)       VALUE 'N'.       00345000
003460     03  WS-PROD-GROUPS-REQS     PIC X(01)       VALUE 'N'.       00346000
003470     03  WS-ACCOUNT-FOUND        PIC X(01)       VALUE 'N'.       00347000
003480     03  WS-PRODUCT-FOUND        PIC X(01)       VALUE 'N'.       00348000
003490     03  WS-BALCATCD-TEST        PIC 9(02)       VALUE ZEROS.     00349000
003500     03  WS-MINACCTS             PIC S9(03)      COMP-3           00350000
003510                                                 VALUE ZEROS.     00351000
003520     03  WS-MINACCTS-PG          PIC S9(03)      COMP-3           00352000
003530                                                 VALUE ZEROS.     00353000
003540     03  WS-MAXSECACCTS          PIC S9(03)      COMP-3           00354000
003550                                                 VALUE ZEROS.     00355000
003560     03  WS-MINPRODS             PIC S9(03)      COMP-3           00356000
003570                                                 VALUE ZEROS.     00357000
003580     03  WS-MAXPRODS             PIC S9(03)      COMP-3           00358000
003590                                                 VALUE ZEROS.     00359000
003600     03  WS-MINACCTS-2           PIC S9(03)      COMP-3           00360000
003610                                                 VALUE ZEROS.     00361000
003620     03  WS-MAXACCTS-2           PIC S9(03)      COMP-3           00362000
003630                                                 VALUE ZEROS.     00363000
003640     03  WS-MINPROD-GRP          PIC S9(03)      COMP-3           00364000
003650                                                 VALUE ZEROS.     00365000
003660     03  WS-MAXPROD-GRP          PIC S9(03)      COMP-3           00366000
003670                                                 VALUE ZEROS.     00367000
003680     03  WS-ACCTRELCD-O          PIC S9(03)      COMP-3           00368000
003690                                                 VALUE ZEROS.     00369000
003700     03  WS-WORK-APPL            PIC 9(02)       VALUE ZEROS.     00370000
003710     03  WS-WORK-COMBBALCD       PIC 9(02)       VALUE ZEROS.     00371000
003720     03  WS-WORK-BALANCE         PIC S9(13)V99   COMP-3           00372000
003730                                                 VALUE ZEROS.     00373000
003740     03  WS-LAST-PRODCD          PIC X(06)       VALUE SPACES.    00374000
003750     03  WS-NUMOFACCOUNTS        PIC S9(05)      COMP-3           00375000
003760                                                 VALUE ZEROS.     00376000
003770     03  WS-NUMOFPRODUCTS        PIC S9(05)      COMP-3           00377000
003780                                                 VALUE ZEROS.     00378000
003790     03  WS-ALLSW                PIC X(01)       VALUE SPACES.    00379000
003800     03  WS-INST-SW              PIC X(01)       VALUE SPACES.    00380000
003810     03  WS-DEFAULT-SWITCH       PIC X(01)       VALUE SPACES.    00381000
003820     03  WS-DEFAULT-REC          PIC X(80)       VALUE SPACES.    00382000
003830     03  WS-SAVE-CDTBLE.                                          00383000
003840         05  WS-SAVE-CDREC       PIC X(80)       OCCURS           00384000
003850                                                 9999 TIMES.      00385000
003860     03  WS-RRPTCTL.                                              00386000
003870         05  FILLER              PIC X(04).                       00387000
003880         05  WS-RRPTPFC          PIC X(01)       VALUE SPACES.    00388000
003890     03  WS-WORK-PRODCD          PIC X(06)       VALUE SPACES.    00389000
003900     03  WS-WORK-TYPE            PIC 9(03)       VALUE ZEROS.     00390000
003910     03  WS-RF21-RETURN          PIC X(01)       VALUE SPACE.     00391000
003920     03  WS-PRODCODE-SEARCH      PIC X(06)       VALUE SPACES.    00392000
003930     03  WS-FOUND-PRODCODE       PIC X(01)       VALUE SPACE.     00393000
003940     03  WS-CRW-OLDNXTDT         PIC S9(09)      COMP-3.          00394000
003950     03  WS-CRW-NEWNXTDT         PIC S9(09)      COMP-3.          00395000
003960 01  RPW135-AREAS.                                                00396000
000000 COPY RPW135.                                                     00397000
003980******************************************************************00398000
003990 PROCEDURE DIVISION.                                              00399000
004000******************************************************************00400000
004010 INITIALIZATION SECTION.                                          00401000
004020 IN-START.                                                        00402000
004030     PERFORM GET-FILE-ORGANIZATION.                               00403000
004040     MOVE 'RPD100' TO SR-APIPROGLIT.                              00404000
004050     MOVE 'RPD100' TO WS-ABPROGID.                                00405000
004060 IN-EXIT.                                                         00406000
004070     EXIT.                                                        00407000
004080******************************************************************00408000
004090 OPEN-API-FILES SECTION.                                          00409000
004100 OAF-START.                                                       00410000
004110     MOVE 'O U' TO SR-APIFUNC.                                    00411000
004120     PERFORM CALL-RPS-ACT.                                        00412000
004130     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00413000
004140         GO TO AR-0001.                                           00414000
004150     MOVE 'O R' TO SR-APIFUNC.                                    00415000
004160     PERFORM CALL-RPS-BNK.                                        00416000
004170     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00417000
004180         GO TO AR-0002.                                           00418000
004190     MOVE 'O R' TO SR-APIFUNC.                                    00419000
004200     PERFORM CALL-RPS-CRW.                                        00420000
004210     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00421000
004220         GO TO AR-0045.                                           00422000
004230     MOVE 'O U' TO SR-APIFUNC.                                    00423000
004240     PERFORM CALL-RPS-EVT.                                        00424000
004250     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00425000
004260         GO TO AR-0054.                                           00426000
004270     MOVE 'O U' TO SR-APIFUNC.                                    00427000
004280     PERFORM CALL-RPS-MST.                                        00428000
004290     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00429000
004300         GO TO AR-0003.                                           00430000
004310     MOVE 'O U' TO SR-APIFUNC.                                    00431000
004320     PERFORM CALL-RPS-QUA.                                        00432000
004330     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00433000
004340         GO TO AR-0004.                                           00434000
004350     MOVE 'O U' TO SR-APIFUNC.                                    00435000
004360     PERFORM CALL-RPS-REL.                                        00436000
004370     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00437000
004380         GO TO AR-0005.                                           00438000
004390 OAF-EXIT.                                                        00439000
004400     EXIT.                                                        00440000
004410******************************************************************00441000
004420 MAIN-LOGIC SECTION.                                              00442000
004430 ML-START.                                                        00443000
004440     MOVE ZEROS TO RPQUA-GRP-KEY.                                 00444000
004450     MOVE ZEROS TO RPBNK-GRP-KEY.                                 00445000
004460     PERFORM LOAD-ENTERPRISE-INTERFACE.                           00446000
004470 ML-READ-NEXT.                                                    00447000
004480     MOVE 'N  ' TO SR-APIFUNC.                                    00448000
004490     PERFORM CALL-RPS-QUA.                                        00449000
004500     IF WS-FUNCTION IS EQUAL TO 'E'                               00450000
004510         GO TO ML-END.                                            00451000
004520     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00452000
004530         GO TO AR-0006.                                           00453000
004540     IF RPQUA-INST IS NOT EQUAL TO RPBNK-INST                     00454000
004550         PERFORM CHANGE-BANK.                                     00455000
004560     PERFORM INITIALIZE-WORK-AREA.                                00456000
004570     PERFORM VALIDATE-PRIMARY-ACCOUNT.                            00457000
004580     IF WS-PRIMARY-ENROLL IS NOT EQUAL TO 'Y'                     00458000
004590         GO TO ML-RELATIONSHIP-FAILED.                            00459000
004600     PERFORM VALIDATE-SECONDARY-ACCOUNTS.                         00460000
004610     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        00461000
004620         AND MIM-7101ACCTRELCD-Q IS EQUAL TO 'E'                  00462000
004630         AND WS-ACCTRELCD-O IS EQUAL TO ZERO                      00463000
004640         MOVE 023 TO WS-ERRORNBR                                  00464000
004650         MOVE 1018 TO WS-SUBERROR                                 00465000
004660         PERFORM PRIMARY-ACCOUNT-ERROR                            00466000
004670         GO TO ML-RELATIONSHIP-FAILED.                            00467000
004680     IF WS-PRIMARY-ENROLL IS NOT EQUAL TO 'Y'                     00468000
004690         GO TO ML-RELATIONSHIP-FAILED.                            00469000
004700 ML-MODEL-REQ.                                                    00470000
004710     PERFORM VALIDATE-MODEL-REQUIREMENTS.                         00471000
004720     IF WS-MODEL-REQS IS EQUAL TO 'N'                             00472000
004730         MOVE 002 TO WS-ERRORNBR                                  00473000
004740         MOVE 1020 TO WS-SUBERROR                                 00474000
004750         PERFORM PRIMARY-ACCOUNT-ERROR                            00475000
004760         GO TO ML-RELATIONSHIP-FAILED.                            00476000
004770 ML-MIN-MAX-PRODS-REQ.                                            00477000
004780     PERFORM VALIDATE-PRODUCTS-REQUIREMENTS.                      00478000
004790     IF WS-MIN-MAX-PROD-REQS IS EQUAL TO 'N'                      00479000
004800         MOVE 030 TO WS-ERRORNBR                                  00480000
004810         MOVE 1020 TO WS-SUBERROR                                 00481000
004820         PERFORM PRIMARY-ACCOUNT-ERROR                            00482000
004830         GO TO ML-RELATIONSHIP-FAILED.                            00483000
004840 ML-MIN-MAX-ACCTS-REQ.                                            00484000
004850     PERFORM VALIDATE-ACCOUNTS-REQUIREMENTS.                      00485000
004860     IF WS-MIN-MAX-ACCT-REQS IS EQUAL TO 'N'                      00486000
004870         MOVE 031 TO WS-ERRORNBR                                  00487000
004880         MOVE 1020 TO WS-SUBERROR                                 00488000
004890         PERFORM PRIMARY-ACCOUNT-ERROR                            00489000
004900         GO TO ML-RELATIONSHIP-FAILED.                            00490000
004910 ML-PRODUCT-GROUPS-REQ.                                           00491000
004920     PERFORM VALIDATE-PRODUCT-GROUPS.                             00492000
004930     IF WS-PROD-GROUPS-REQS IS EQUAL TO 'N'                       00493000
004940         MOVE 032 TO WS-ERRORNBR                                  00494000
004950         MOVE 1020 TO WS-SUBERROR                                 00495000
004960         PERFORM PRIMARY-ACCOUNT-ERROR                            00496000
004970         GO TO ML-RELATIONSHIP-FAILED.                            00497000
004980     IF WS-MODEL-REQS IS EQUAL TO 'N'                             00498000
004990         MOVE 034 TO WS-ERRORNBR                                  00499000
005000         MOVE 1020 TO WS-SUBERROR                                 00500000
005010         PERFORM PRIMARY-ACCOUNT-ERROR                            00501000
005020         GO TO ML-RELATIONSHIP-FAILED.                            00502000
005030     IF WS-MIN-MAX-PROD-REQS IS EQUAL TO 'N'                      00503000
005040         MOVE 035 TO WS-ERRORNBR                                  00504000
005050         MOVE 1020 TO WS-SUBERROR                                 00505000
005060         PERFORM PRIMARY-ACCOUNT-ERROR                            00506000
005070         GO TO ML-RELATIONSHIP-FAILED.                            00507000
005080 ML-COMBINEBAL-REQ.                                               00508000
005090     IF MIM-7101COMBCATCD1-Q IS NOT EQUAL TO 'E'                  00509000
005100         AND MIM-7101COMBCATCD2-Q IS NOT EQUAL TO 'E'             00510000
005110         AND MIM-7101COMBCATCD3-Q IS NOT EQUAL TO 'E'             00511000
005120         AND MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'             00512000
005130         GO TO ML-EXPIRATION-DATE.                                00513000
005140     MOVE ZEROS TO WS-SUBSEC.                                     00514000
005150 ML-COMBINEBAL-NEXT.                                              00515000
005160     ADD +1 TO WS-SUBSEC.                                         00516000
005170     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                00517000
005180         GO TO ML-COMBINEBAL1-TEST.                               00518000
005190     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                00519000
005200         GO TO ML-COMBINEBAL1-TEST.                               00520000
005210     ADD WS-SEC-BAL1 (WS-SUBSEC) TO WS-COMBINEBAL1.               00521000
005220     ADD WS-SEC-BAL2 (WS-SUBSEC) TO WS-COMBINEBAL2.               00522000
005230     ADD WS-SEC-BAL3 (WS-SUBSEC) TO WS-COMBINEBAL3.               00523000
005240     ADD WS-SEC-BAL4 (WS-SUBSEC) TO WS-COMBINEBAL4.               00524000
005250     GO TO ML-COMBINEBAL-NEXT.                                    00525000
005260 ML-COMBINEBAL1-TEST.                                             00526000
005270     IF MIM-7101COMBCATCD1-Q IS NOT EQUAL TO 'E'                  00527000
005280         GO TO ML-COMBINEBAL2-TEST.                               00528000
005290     MOVE MIM-7101COMBCATCD1 TO WS-RPMIM7106RPREC.                00529000
005300     PERFORM SEARCH-RPS-7106.                                     00530000
005310     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         00531000
005320         AND MIM-7101COMBBALOPT IS EQUAL TO 'A'                   00532000
005330         GO TO ML-COMBINEBAL-FAIL.                                00533000
005340     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         00534000
005350         GO TO ML-COMBINEBAL2-TEST.                               00535000
005360     IF WS-COMBINEBAL1 IS NOT LESS THAN MIM-7106BALREQ-E          00536000
005370         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   00537000
005380         GO TO ML-EXPIRATION-DATE.                                00538000
005390     IF WS-COMBINEBAL1 IS NOT LESS THAN MIM-7106BALREQ-E          00539000
005400         GO TO ML-COMBINEBAL2-TEST.                               00540000
005410     IF MIM-7101COMBBALOPT IS EQUAL TO 'O'                        00541000
005420         GO TO ML-COMBINEBAL2-TEST.                               00542000
005430     GO TO ML-COMBINEBAL-FAIL.                                    00543000
005440 ML-COMBINEBAL2-TEST.                                             00544000
005450     IF MIM-7101COMBCATCD2-Q IS NOT EQUAL TO 'E'                  00545000
005460         GO TO ML-COMBINEBAL3-TEST.                               00546000
005470     MOVE MIM-7101COMBCATCD2 TO WS-RPMIM7106RPREC.                00547000
005480     PERFORM SEARCH-RPS-7106.                                     00548000
005490     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         00549000
005500         AND MIM-7101COMBBALOPT IS EQUAL TO 'A'                   00550000
005510         GO TO ML-COMBINEBAL-FAIL.                                00551000
005520     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         00552000
005530         GO TO ML-COMBINEBAL3-TEST.                               00553000
005540     IF WS-COMBINEBAL2 IS NOT LESS THAN MIM-7106BALREQ-E          00554000
005550         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   00555000
005560         GO TO ML-EXPIRATION-DATE.                                00556000
005570     IF WS-COMBINEBAL2 IS NOT LESS THAN MIM-7106BALREQ-E          00557000
005580         GO TO ML-COMBINEBAL3-TEST.                               00558000
005590     IF MIM-7101COMBBALOPT IS EQUAL TO 'O'                        00559000
005600         GO TO ML-COMBINEBAL3-TEST.                               00560000
005610     GO TO ML-COMBINEBAL-FAIL.                                    00561000
005620 ML-COMBINEBAL3-TEST.                                             00562000
005630     IF MIM-7101COMBCATCD3-Q IS NOT EQUAL TO 'E'                  00563000
005640         GO TO ML-COMBINEBAL4-TEST.                               00564000
005650     MOVE MIM-7101COMBCATCD3 TO WS-RPMIM7106RPREC.                00565000
005660     PERFORM SEARCH-RPS-7106.                                     00566000
005670     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         00567000
005680         AND MIM-7101COMBBALOPT IS EQUAL TO 'A'                   00568000
005690         GO TO ML-COMBINEBAL-FAIL.                                00569000
005700     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         00570000
005710         GO TO ML-COMBINEBAL4-TEST.                               00571000
005720     IF WS-COMBINEBAL3 IS NOT LESS THAN MIM-7106BALREQ-E          00572000
005730         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   00573000
005740         GO TO ML-EXPIRATION-DATE.                                00574000
005750     IF WS-COMBINEBAL3 IS NOT LESS THAN MIM-7106BALREQ-E          00575000
005760         GO TO ML-COMBINEBAL4-TEST.                               00576000
005770     IF MIM-7101COMBBALOPT IS EQUAL TO 'O'                        00577000
005780         GO TO ML-COMBINEBAL4-TEST.                               00578000
005790     GO TO ML-COMBINEBAL-FAIL.                                    00579000
005800 ML-COMBINEBAL4-TEST.                                             00580000
005810     IF MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'                  00581000
005820         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   00582000
005830         GO TO ML-COMBINEBAL-FAIL.                                00583000
005840     IF MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'                  00584000
005850         GO TO ML-EXPIRATION-DATE.                                00585000
005860     MOVE MIM-7101COMBCATCD4 TO WS-RPMIM7106RPREC.                00586000
005870     PERFORM SEARCH-RPS-7106.                                     00587000
005880     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         00588000
005890         GO TO ML-COMBINEBAL-FAIL.                                00589000
005900     IF WS-COMBINEBAL4 IS NOT LESS THAN MIM-7106BALREQ-E          00590000
005910         GO TO ML-EXPIRATION-DATE.                                00591000
005920 ML-COMBINEBAL-FAIL.                                              00592000
005930     MOVE 001 TO WS-ERRORNBR.                                     00593000
005940     MOVE 1019 TO WS-SUBERROR.                                    00594000
005950     PERFORM PRIMARY-ACCOUNT-ERROR.                               00595000
005960     GO TO ML-RELATIONSHIP-FAILED.                                00596000
005970 ML-RELATIONSHIP-FAILED.                                          00597000
005980     IF RPQUA-ENROLLATTEMPTS IS GREATER THAN ZEROS                00598000
005990         SUBTRACT 1 FROM RPQUA-ENROLLATTEMPTS.                    00599000
006000     IF RPQUA-ENROLLATTEMPTS IS GREATER THAN ZEROS                00600000
006010         GO TO ML-REWRITE-QUA.                                    00601000
006020     IF RPQUA-ADDON-ACCTS IS GREATER THAN ZEROS                   00602000
006030         PERFORM DELETE-ADDON-ACCOUNTS.                           00603000
006040     IF RPQUA-CASH-RW-KEY IS NOT EQUAL TO SPACES                  00604000
006050         PERFORM DELETE-CASH-REWARD-ACCOUNT.                      00605000
006060     MOVE 'D  ' TO SR-APIFUNC.                                    00606000
006070     PERFORM CALL-RPS-QUA.                                        00607000
006080     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00608000
006090         GO TO AR-0046.                                           00609000
006100     GO TO ML-READ-NEXT.                                          00610000
006110 ML-REWRITE-QUA.                                                  00611000
006120     MOVE 'W  ' TO SR-APIFUNC.                                    00612000
006130     PERFORM CALL-RPS-QUA.                                        00613000
006140     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00614000
006150         GO TO AR-0047.                                           00615000
006160     GO TO ML-READ-NEXT.                                          00616000
006170 ML-EXPIRATION-DATE.                                              00617000
006180     MOVE ZEROS TO WS-EXPIRATION-DATE.                            00618000
P0074      IF RPQUA-EXPIRATION-DATE IS GREATER THAN ZEROS               00618200
P0074          MOVE RPQUA-EXPIRATION-DATE TO WS-EXPIRATION-DATE         00618400
P0074          GO TO ML-ENROLL.                                         00618600
006190     IF MIM-7101EXPDT IS NOT EQUAL TO ZEROS                       00619000
006200         MOVE MIM-7101EXPDT TO WS-EXPIRATION-DATE                 00620000
006210         GO TO ML-ENROLL.                                         00621000
006220     IF MIM-7101EXPFREQ IS EQUAL TO 'N'                           00622000
006230         GO TO ML-ENROLL.                                         00623000
006240     MOVE MIM-7101EXPFREQ TO SR-PERIOD.                           00624000
006250     MOVE MIM-7101EXPTERM TO SR-FREQ.                             00625000
006260     IF MIM-7101EXPFREQ IS EQUAL TO 'M'                           00626000
006270         AND MIM-7101ENDOFMONTH IS EQUAL TO 'Y'                   00627000
006280         MOVE 31 TO SR-DAY                                        00628000
006290     ELSE                                                         00629000
006300         MOVE ZEROS TO SR-DAY.                                    00630000
006310     MOVE WS-CURDTYYYY TO SR-FCYR.                                00631000
006320     MOVE WS-CURDTMM TO SR-FCMON.                                 00632000
006330     MOVE WS-CURDTDD TO SR-FCDAY.                                 00633000
006340     PERFORM JULIAN-365.                                          00634000
006350     MOVE SR-TOJUL TO SR-FROMJUL.                                 00635000
006360     PERFORM NEXT-DATE-365.                                       00636000
006370     MOVE SR-TOJUL TO SR-FROMJUL.                                 00637000
006380     PERFORM CALENDAR-365.                                        00638000
006390     MOVE SR-TCMON TO WS-PDATE-MM.                                00639000
006400     MOVE SR-TCDAY TO WS-PDATE-DD.                                00640000
006410     MOVE SR-TCYR TO WS-PDATE-YYYY.                               00641000
006420     MOVE WS-PDATE TO WS-EXPIRATION-DATE.                         00642000
006430 ML-ENROLL.                                                       00643000
006440     IF RPQUA-CRW-PRODCODE IS NOT EQUAL TO SPACES                 00644000
006450         AND RPQUA-DATE-OPENED IS LESS THAN RPBNK-CURDT           00645000
006460         PERFORM UPDATE-CASH-REWARD-ACCOUNT.                      00646000
006470     PERFORM ADD-NEW-RELATIONSHIP.                                00647000
006480     MOVE 'D  ' TO SR-APIFUNC.                                    00648000
006490     PERFORM CALL-RPS-QUA.                                        00649000
006500     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00650000
006510         GO TO AR-0048.                                           00651000
006520     GO TO ML-READ-NEXT.                                          00652000
006530 ML-END.                                                          00653000
006540     GO TO END-ROUTINE.                                           00654000
006550 ML-EXIT.                                                         00655000
006560     EXIT.                                                        00656000
006570******************************************************************00657000
006580 CHANGE-BANK SECTION.                                             00658000
006590 CB-START.                                                        00659000
006600     MOVE 'R  ' TO SR-APIFUNC.                                    00660000
006610     MOVE RPQUA-INST TO RPBNK-INST.                               00661000
006620     PERFORM CALL-RPS-BNK.                                        00662000
006630     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00663000
006640         GO TO AR-0007.                                           00664000
006650     MOVE RPBNK-CURDT TO WS-CURDTYYYYMMDD.                        00665000
006660     MOVE WS-CURDTMM TO WS-DATEMM.                                00666000
006670     MOVE WS-CURDTDD TO WS-DATEDD.                                00667000
006680     MOVE WS-CURDTYYYY TO WS-DATEYYYY.                            00668000
006690     MOVE WS-DATEMMDDYYYY TO SR-TODAY.                            00669000
006700     MOVE SPACES TO MI0307-RECORD.                                00670000
006710     MOVE RPBNK-INST TO MIM-0307KINST.                            00671000
006720     MOVE 50 TO MIM-0307KAPPL.                                    00672000
006730     MOVE 3 TO MIM-0307KRECNBR.                                   00673000
006740     MOVE +0307 TO MIM-0307KREC.                                  00674000
006750     MOVE MIC-MST-0307-PRI TO MIC-MST-REC-PRI.                    00675000
006760     MOVE MI0307-RECORD TO MIMST-RECORD.                          00676000
006770     PERFORM MIC-MST-GET-REQUEST.                                 00677000
006780     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00678000
006790         GO TO AR-0008.                                           00679000
006800     MOVE MIMST-RECORD TO MI0307-RECORD.                          00680000
006810     MOVE MIM-DSRPTCTL (10) TO WS-RRPTCTL.                        00681000
006820 CB-REC7100.                                                      00682000
006830     MOVE SPACES TO MI7100-RECORD.                                00683000
006840     MOVE RPBNK-INST TO MIM-7100KINST.                            00684000
006850     MOVE +7100 TO MIM-7100KREC.                                  00685000
006860     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00686000
006870     MOVE MI7100-RECORD TO MIMST-RECORD.                          00687000
006880     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00688000
006890     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00689000
006900         GO TO AR-0009.                                           00690000
006910     MOVE MIMST-RECORD TO MI7100-RECORD.                          00691000
006920     IF MIM-7100KINST IS NOT EQUAL TO RPBNK-INST                  00692000
006930         GO TO AR-0010.                                           00693000
006940 CB-REC7101.                                                      00694000
006950     MOVE RPBNK-INST TO WS-RPMIM7101INST.                         00695000
006960     COMPUTE WS-RPMIM7101EFFDT = RPBNK-CURDT - 99999999.          00696000
006970     PERFORM LOAD-RPS-7101.                                       00697000
006980     IF WS-RPMIM7101ERROR IS EQUAL TO 'Y'                         00698000
006990         GO TO AR-0011.                                           00699000
007000 CB-REC7102.                                                      00700000
007010     MOVE RPBNK-INST TO WS-RPMIM7102INST.                         00701000
007020     PERFORM LOAD-RPS-7102.                                       00702000
007030     IF WS-RPMIM7102ERROR IS EQUAL TO 'Y'                         00703000
007040         GO TO AR-0012.                                           00704000
007050 CB-REC7104.                                                      00705000
007060     MOVE RPBNK-INST TO WS-RPMIM7104INST.                         00706000
007070     PERFORM LOAD-RPS-7104.                                       00707000
007080     IF WS-RPMIM7104ERROR IS EQUAL TO 'Y'                         00708000
007090         GO TO AR-0013.                                           00709000
007100 CB-REC7106.                                                      00710000
007110     MOVE RPBNK-INST TO WS-RPMIM7106INST.                         00711000
007120     PERFORM LOAD-RPS-7106.                                       00712000
007130     IF WS-RPMIM7106ERROR IS EQUAL TO 'Y'                         00713000
007140         GO TO AR-0014.                                           00714000
007150 CB-REC7107.                                                      00715000
007160     MOVE RPBNK-INST TO WS-RPMIM7107INST.                         00716000
007170     PERFORM LOAD-RPS-7107.                                       00717000
007180     IF WS-RPMIM7107ERROR IS EQUAL TO 'Y'                         00718000
007190         GO TO AR-0015.                                           00719000
007200 CB-REC7110.                                                      00720000
007210     MOVE RPBNK-INST TO WS-RPMIM7110INST.                         00721000
007220     PERFORM LOAD-RPS-7110.                                       00722000
007230     IF WS-RPMIM7110ERROR IS EQUAL TO 'Y'                         00723000
007240         GO TO AR-0040.                                           00724000
007250 CB-REC2001.                                                      00725000
007260     MOVE RPBNK-INST TO WS-RPMIM2001INST.                         00726000
007270     PERFORM LOAD-RPS-2001.                                       00727000
007280     IF WS-RPMIM2001ERROR IS EQUAL TO 'Y'                         00728000
007290         GO TO AR-0055.                                           00729000
007300 CB-REC2023.                                                      00730000
007310     MOVE RPBNK-INST TO WS-RPMIM2023INST.                         00731000
007320     PERFORM LOAD-RPS-2023.                                       00732000
007330     IF WS-RPMIM2023ERROR IS EQUAL TO 'Y'                         00733000
007340         GO TO AR-0016.                                           00734000
007350     INITIALIZE WS-2024-AREA.                                     00735000
007360 CB-REC2024.                                                      00736000
007370     MOVE 'Y' TO WS-2024-EXISTS (RPBNK-INST).                     00737000
007380     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'N'                     00738000
007390         GO TO CB-REC0237.                                        00739000
007400     MOVE SPACES TO MI2024-RECORD.                                00740000
007410     MOVE ZEROS TO MIM-2024KINST.                                 00741000
007420     MOVE +2024 TO MIM-2024KREC.                                  00742000
007430     MOVE 50 TO MIM-2024KMANGER.                                  00743000
007440     MOVE RPBNK-INST TO MIM-2024KGROUP-INST.                      00744000
007450     MOVE ZEROS TO MIM-2024KACCESS-INST.                          00745000
007460     MOVE MIC-MST-2024-PRI TO MIC-MST-REC-PRI.                    00746000
007470     MOVE MI2024-RECORD TO MIMST-RECORD.                          00747000
007480     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00748000
007490     GO TO CB-REC2024-CONT.                                       00749000
007500 CB-REC2024-READ.                                                 00750000
007510     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00751000
007520 CB-REC2024-CONT.                                                 00752000
007530     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00753000
007540         GO TO CB-REC0237.                                        00754000
007550     MOVE MIMST-RECORD TO MI2024-RECORD.                          00755000
007560     IF MIM-2024KINST IS NOT EQUAL TO ZEROS                       00756000
007570         GO TO CB-REC0237.                                        00757000
007580     IF MIM-2024KMANGER IS NOT EQUAL TO 50                        00758000
007590         OR MIM-2024KGROUP-INST IS NOT EQUAL TO RPBNK-INST        00759000
007600         GO TO CB-REC0237.                                        00760000
007610     IF MIM-2024KACCESS-INST IS EQUAL TO ZEROS                    00761000
007620         GO TO CB-REC2024-READ.                                   00762000
007630     MOVE 'Y' TO WS-2024-EXISTS (MIM-2024KACCESS-INST).           00763000
007640     GO TO CB-REC2024-READ.                                       00764000
007650 CB-REC0237.                                                      00765000
007660     MOVE SPACES TO WS-APPLICATION-TABLE.                         00766000
007670     MOVE SPACES TO MI0237-RECORD.                                00767000
007680     MOVE RPBNK-INST TO MIM-0237KINST.                            00768000
007690     MOVE +0237 TO MIM-0237KREC.                                  00769000
007700     MOVE 50 TO MIM-0237KPROCMGR.                                 00770000
007710     MOVE ZEROS TO MIM-0237KINTAPPL.                              00771000
007720     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    00772000
007730     MOVE MI0237-RECORD TO MIMST-RECORD.                          00773000
007740     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00774000
007750     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00775000
007760         GO TO AR-0018.                                           00776000
007770     GO TO CB-REC0237CONT.                                        00777000
007780 CB-REC0237READ.                                                  00778000
007790     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00779000
007800     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00780000
007810         GO TO CB-EXIT.                                           00781000
007820 CB-REC0237CONT.                                                  00782000
007830     MOVE MIMST-RECORD TO MI0237-RECORD.                          00783000
007840     IF MIM-0237KINST IS NOT EQUAL TO RPBNK-INST                  00784000
007850         OR MIM-0237KPROCMGR IS NOT EQUAL TO 50                   00785000
007860         GO TO CB-EXIT.                                           00786000
007870     IF MIM-0237KINTAPPL IS EQUAL TO ZEROS                        00787000
007880         MOVE MIM-237BATINTFC TO WS-INTRFACE (100)                00788000
007890     ELSE                                                         00789000
007900         MOVE MIM-237BATINTFC TO WS-INTRFACE (MIM-0237KINTAPPL).  00790000
007910     GO TO CB-REC0237READ.                                        00791000
007920 CB-EXIT.                                                         00792000
007930     EXIT.                                                        00793000
007940******************************************************************00794000
007950 LOAD-ENTERPRISE-INTERFACE SECTION.                               00795000
007960 LEI-START.                                                       00796000
007970     MOVE HIGH-VALUES TO WS-0237-TABLE.                           00797000
007980     SET INDX-0237 TO +1.                                         00798000
007990     SET INDX-0237 DOWN BY +1.                                    00799000
008000     MOVE SPACES TO MI0237-RECORD.                                00800000
008010     MOVE ZEROS TO MIM-0237KINST.                                 00801000
008020     MOVE +0237 TO MIM-0237KREC.                                  00802000
008030     MOVE 99 TO MIM-0237KPROCMGR.                                 00803000
008040     MOVE 99 TO MIM-0237KINTAPPL.                                 00804000
008050     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    00805000
008060     MOVE MI0237-RECORD TO MIMST-RECORD.                          00806000
008070     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00807000
008080     GO TO LEI-TEST0237.                                          00808000
008090 LEI-READ0237.                                                    00809000
008100     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00810000
008110 LEI-TEST0237.                                                    00811000
008120     IF WS-FUNCTION IS EQUAL TO 'E'                               00812000
008130         GO TO LEI-EXIT.                                          00813000
008140     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00814000
008150         GO TO AR-0042.                                           00815000
008160     MOVE MIMST-RECORD TO MI0237-RECORD.                          00816000
008170     IF MIM-0237KINST IS EQUAL TO ZEROS                           00817000
008180         OR MIM-0237KPROCMGR IS NOT EQUAL TO 50                   00818000
008190         OR MIM-0237KINTAPPL IS EQUAL TO ZEROS                    00819000
008200         GO TO LEI-READ0237.                                      00820000
008210     SET INDX-0237 UP BY +1.                                      00821000
008220     IF INDX-0237 IS GREATER THAN WS-0237-MAX                     00822000
008230         GO TO AR-0043.                                           00823000
008240     MOVE MIM-0237KINST TO WS-0237-INST (INDX-0237).              00824000
008250     MOVE MIM-0237KINTAPPL TO WS-0237-APPL (INDX-0237).           00825000
008260     MOVE MIM-237BATINTFC TO WS-0237-INTF (INDX-0237).            00826000
008270     GO TO LEI-READ0237.                                          00827000
008280 LEI-EXIT.                                                        00828000
008290     EXIT.                                                        00829000
008300******************************************************************00830000
008310 FIND-CROSS-INST-INTERFACE SECTION.                               00831000
008320 FCII-START.                                                      00832000
008330     MOVE WS-SEC-INST (WS-SUBSEC) TO WS-0237TEST-INST.            00833000
008340     MOVE WS-SEC-APPL (WS-SUBSEC) TO WS-0237TEST-APPL.            00834000
008350     SEARCH ALL WS-0237-INTRFACE                                  00835000
008360         AT END                                                   00836000
008370             GO TO FCII-EXIT                                      00837000
008380         WHEN WS-0237-KEY (INDX-0237) IS EQUAL TO WS-0237TEST-KEY 00838000
008390             MOVE WS-0237-INTF (INDX-0237) TO SR-060CALLNAME.     00839000
008400 FCII-EXIT.                                                       00840000
008410     EXIT.                                                        00841000
008420******************************************************************00842000
008430 INITIALIZE-WORK-AREA SECTION.                                    00843000
008440 IWA-START.                                                       00844000
008450     MOVE ZEROS TO WS-PRIMCATBAL.                                 00845000
008460     MOVE ZEROS TO WS-COMBINEBAL1.                                00846000
008470     MOVE ZEROS TO WS-COMBINEBAL2.                                00847000
008480     MOVE ZEROS TO WS-COMBINEBAL3.                                00848000
008490     MOVE ZEROS TO WS-COMBINEBAL4.                                00849000
008500     INITIALIZE WS-PRIMARY-TABLE.                                 00850000
008510     INITIALIZE WS-SECONDARY-TABLE.                               00851000
008520     MOVE ZEROS TO WS-BALCATCD-TEST.                              00852000
008530     MOVE ZEROS TO WS-WORK-COMBBALCD.                             00853000
008540     MOVE ZEROS TO WS-ACCTRELCD-O.                                00854000
008550     MOVE 'N' TO WS-PRIMARY-ENROLL.                               00855000
008560     MOVE 'N' TO WS-MODEL-REQS.                                   00856000
008570     MOVE 'N' TO WS-MIN-MAX-PROD-REQS.                            00857000
008580     MOVE 'N' TO WS-MIN-MAX-ACCT-REQS.                            00858000
008590     MOVE 'N' TO WS-PROD-GROUPS-REQS.                             00859000
008600     MOVE ZEROS TO WS-CRW-OLDNXTDT.                               00860000
008610     MOVE ZEROS TO WS-CRW-NEWNXTDT.                               00861000
008620 IWA-EXIT.                                                        00862000
008630     EXIT.                                                        00863000
008640******************************************************************00864000
008650 VALIDATE-PRIMARY-ACCOUNT SECTION.                                00865000
008660 VPA-START.                                                       00866000
008670     MOVE RPQUA-INST TO RPMST-INST.                               00867000
008680     MOVE RPQUA-PRODCODE TO RPMST-PRODCODE.                       00868000
008690     MOVE RPQUA-ACCOUNT TO RPMST-ACCOUNT.                         00869000
008700     MOVE RPQUA-MODEL TO RPMST-MODEL.                             00870000
008710     MOVE 'R  ' TO SR-APIFUNC.                                    00871000
008720     PERFORM CALL-RPS-MST.                                        00872000
008730     IF WS-FUNCTION IS EQUAL TO 'N'                               00873000
008740         GO TO VPA-7101.                                          00874000
008750     MOVE 003 TO WS-ERRORNBR.                                     00875000
008760     MOVE 1002 TO WS-SUBERROR.                                    00876000
008770     GO TO VPA-PRINT-ERROR.                                       00877000
008780 VPA-7101.                                                        00878000
008790     MOVE RPQUA-MODEL TO WS-RPMIM7101MODEL.                       00879000
008800     PERFORM SEARCH-RPS-7101.                                     00880000
008810     IF WS-RPMIM7101FOUND IS EQUAL TO 'N'                         00881000
008820         MOVE 004 TO WS-ERRORNBR                                  00882000
008830         MOVE 1003 TO WS-SUBERROR                                 00883000
008840         GO TO VPA-PRINT-ERROR.                                   00884000
008850 VPA-7101-ACTCD.                                                  00885000
008860     IF MIM-7101ACTCD IS NOT EQUAL TO 'A'                         00886000
008870         MOVE 005 TO WS-ERRORNBR                                  00887000
008880         MOVE 1004 TO WS-SUBERROR                                 00888000
008890         GO TO VPA-PRINT-ERROR.                                   00889000
008900 VPA-7101-EXPDT.                                                  00890000
008910     IF MIM-7101EXPDT IS EQUAL TO ZEROS                           00891000
008920         GO TO VPA-7101-CLOSEDT.                                  00892000
008930     IF RPBNK-CURDT IS NOT LESS THAN MIM-7101EXPDT                00893000
008940         MOVE 006 TO WS-ERRORNBR                                  00894000
008950         MOVE 1005 TO WS-SUBERROR                                 00895000
008960         GO TO VPA-PRINT-ERROR.                                   00896000
008970 VPA-7101-CLOSEDT.                                                00897000
008980     IF MIM-7101CLOSEDT IS EQUAL TO ZEROS                         00898000
008990         GO TO VPA-RCIF.                                          00899000
009000     IF RPBNK-CURDT IS GREATER THAN MIM-7101CLOSEDT               00900000
009010         MOVE 007 TO WS-ERRORNBR                                  00901000
009020         MOVE 1006 TO WS-SUBERROR                                 00902000
009030         GO TO VPA-PRINT-ERROR.                                   00903000
009040 VPA-RCIF.                                                        00904000
009050     MOVE RPQUA-PRODCODE TO WS-PRIM-PRODCD.                       00905000
009060     MOVE RPQUA-BRANCH TO WS-PRIM-BRANCH.                         00906000
009070     MOVE RPQUA-ACCT-TYPE TO WS-PRIM-TYPE.                        00907000
009080     MOVE RPQUA-ACCOUNT TO WS-PRIM-ACCT.                          00908000
009090     MOVE RPQUA-MODEL TO WS-PRIM-MODEL.                           00909000
009100     IF WS-INTRFACE (47) IS EQUAL TO SPACES                       00910000
009110         GO TO AR-0019.                                           00911000
009120     PERFORM CALL-RCIF.                                           00912000
009130     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00913000
009140         MOVE 008 TO WS-ERRORNBR                                  00914000
009150         MOVE 1007 TO WS-SUBERROR                                 00915000
009160         GO TO VPA-PRINT-ERROR.                                   00916000
P0101  VPA-7104-PRIMRELCD.                                              00916020
P0101      IF WS-PRIMRELCD-ERROR IS EQUAL TO 'Y'                        00916040
P0101          AND WS-NUMOFSECCUSTS IS EQUAL TO ZEROS                   00916060
P0101          MOVE 036 TO WS-ERRORNBR                                  00916080
P0101          MOVE 1025 TO WS-SUBERROR                                 00916100
P0101          GO TO VPA-PRINT-ERROR.                                   00916120
P0101      IF WS-CUSTRELCD-SKIP IS EQUAL TO 'Y'                         00916140
P0101          GO TO VPA-7101-ACCOUNTS.                                 00916160
P0101  VPA-7104-CUSTRELCD.                                              00916180
P0101      IF MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'B'                   00916200
P0101          AND MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'E'              00916220
P0101          GO TO VPA-7101-ACCOUNTS.                                 00916240
P0101      IF MIM-7101CUSTRELCD IS EQUAL TO SPACES                      00916260
P0101          GO TO VPA-7101-ACCOUNTS.                                 00916280
P0101      MOVE MIM-7101CUSTRELCD TO WS-RPMIM7104RPREC.                 00916300
P0101      PERFORM SEARCH-RPS-7104.                                     00916320
P0101      IF WS-RPMIM7104FOUND IS NOT EQUAL TO 'N'                     00916340
P0101          GO TO VPA-7104-FOUND.                                    00916360
P0101      MOVE 037 TO WS-ERRORNBR.                                     00916380
P0101      MOVE 1025 TO WS-SUBERROR.                                    00916400
P0101      GO TO VPA-PRINT-ERROR.                                       00916420
P0101  VPA-7104-FOUND.                                                  00916440
P0101      MOVE +1 TO WS-SUB4.                                          00916460
P0101      IF MIM-7104OPT IS EQUAL TO 'I'                               00916480
P0101          GO TO VPA-7104-CUSTRELCDI.                               00916500
P0101  VPA-7104-CUSTRELCDE.                                             00916520
P0101      IF WS-SUB4 IS GREATER THAN 50                                00916540
P0101          GO TO VPA-7101-ACCOUNTS.                                 00916560
P0101      IF MIM-7104RLSP (WS-SUB4)                                    00916580
P0101          IS NOT EQUAL TO WS-SEC-PRIMCUSTRELNBR (1)                00916600
P0101          ADD +1 TO WS-SUB4                                        00916620
P0101          GO TO VPA-7104-CUSTRELCDE.                               00916640
P0101      MOVE 038 TO WS-ERRORNBR.                                     00916660
P0101      MOVE 1025 TO WS-SUBERROR.                                    00916680
P0101      GO TO VPA-PRINT-ERROR.                                       00916700
P0101  VPA-7104-CUSTRELCDI.                                             00916720
P0101      IF MIM-7104RLSP (WS-SUB4)                                    00916740
P0101          IS EQUAL TO WS-SEC-PRIMCUSTRELNBR (1)                    00916760
P0101          GO TO VPA-7101-ACCOUNTS.                                 00916780
P0101      ADD +1 TO WS-SUB4.                                           00916800
P0101      IF WS-SUB4 IS NOT GREATER THAN 50                            00916820
P0101          GO TO VPA-7104-CUSTRELCDI.                               00916840
P0101      MOVE 039 TO WS-ERRORNBR.                                     00916860
P0101      MOVE 1025 TO WS-SUBERROR.                                    00916880
P0101      GO TO VPA-PRINT-ERROR.                                       00916900
009170 VPA-7101-ACCOUNTS.                                               00917000
009180     IF MIM-7101ACCTS-Q IS NOT EQUAL TO 'B'                       00918000
009190         AND MIM-7101ACCTS-Q IS NOT EQUAL TO 'E'                  00919000
009200         GO TO VPA-7101-PRODUCTS.                                 00920000
009210     IF WS-NUMOFACCOUNTS IS LESS THAN MIM-7101ACCTS               00921000
009220         MOVE 009 TO WS-ERRORNBR                                  00922000
009230         MOVE 1008 TO WS-SUBERROR                                 00923000
009240         GO TO VPA-PRINT-ERROR.                                   00924000
009250 VPA-7101-PRODUCTS.                                               00925000
009260     IF MIM-7101PROD-Q IS NOT EQUAL TO 'B'                        00926000
009270         AND MIM-7101PROD-Q IS NOT EQUAL TO 'E'                   00927000
009280         GO TO VPA-7102.                                          00928000
009290     IF WS-NUMOFPRODUCTS IS LESS THAN MIM-7101PROD                00929000
009300         MOVE 010 TO WS-ERRORNBR                                  00930000
009310         MOVE 1009 TO WS-SUBERROR                                 00931000
009320         GO TO VPA-PRINT-ERROR.                                   00932000
009330 VPA-7102.                                                        00933000
009340     MOVE RPQUA-MODEL TO WS-RPMIM7102MODEL.                       00934000
009350     MOVE WS-PRIM-PRODCD TO WS-RPMIM7102PRODCODE.                 00935000
009360     MOVE WS-PRIM-TYPE TO WS-RPMIM7102TYPE.                       00936000
009370     PERFORM SEARCH-RPS-7102.                                     00937000
009380     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         00938000
009390         MOVE 'B' TO WS-PRIM-7102                                 00939000
009400         GO TO VPA-7102-TEST.                                     00940000
009410 VPA-7102-TYPEZERO.                                               00941000
009420     MOVE ZEROS TO WS-RPMIM7102TYPE.                              00942000
009430     PERFORM SEARCH-RPS-7102.                                     00943000
009440     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         00944000
009450         MOVE 'P' TO WS-PRIM-7102                                 00945000
009460         GO TO VPA-7102-TEST.                                     00946000
009470 VPA-7102-MODELONLY.                                              00947000
009480     MOVE SPACES TO WS-RPMIM7102PRODCODE.                         00948000
009490     MOVE ZEROS TO WS-RPMIM7102TYPE.                              00949000
009500     PERFORM SEARCH-RPS-7102.                                     00950000
009510     IF WS-RPMIM7102FOUND IS EQUAL TO 'N'                         00951000
009520         MOVE 011 TO WS-ERRORNBR                                  00952000
009530         MOVE 1010 TO WS-SUBERROR                                 00953000
009540         GO TO VPA-PRINT-ERROR.                                   00954000
009550     MOVE 'M' TO WS-PRIM-7102.                                    00955000
009560 VPA-7102-TEST.                                                   00956000
009570     MOVE RPQUA-INST TO RPACT-INST.                               00957000
009580     MOVE RPQUA-PRODCODE TO RPACT-PRODCODE.                       00958000
009590     MOVE RPQUA-ACCOUNT TO RPACT-ACCOUNT.                         00959000
009600     MOVE 'R  ' TO SR-APIFUNC.                                    00960000
009610     PERFORM CALL-RPS-ACT.                                        00961000
009620     IF WS-FUNCTION IS EQUAL TO 'N'                               00962000
009630         MOVE 'N' TO WS-PRIM-ACTREC                               00963000
009640         GO TO VPA-7102-ACCTINFO.                                 00964000
009650     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      00965000
009660         MOVE 033 TO WS-ERRORNBR                                  00966000
009670         MOVE 0021 TO WS-SUBERROR                                 00967000
009680         GO TO VPA-PRINT-ERROR.                                   00968000
009690     IF RPACT-RATE-INC-OPTION IS EQUAL TO 'Y'                     00969000
009700         AND MIM-7102PRIMRATEINCOPT IS EQUAL TO 'Y'               00970000
009710         MOVE 013 TO WS-ERRORNBR                                  00971000
009720         MOVE 1012 TO WS-SUBERROR                                 00972000
009730         GO TO VPA-PRINT-ERROR.                                   00973000
009740     IF MIM-7100DUPINCOPT IS EQUAL TO 'Y'                         00974000
009750         MOVE 'Y' TO WS-PRIM-ACTREC                               00975000
009760         GO TO VPA-7102-ACCTINFO.                                 00976000
009770     IF RPACT-SC-INC-OPTION IS EQUAL TO 'Y'                       00977000
009780         AND MIM-7102PRIMSCINCOPT IS EQUAL TO 'Y'                 00978000
009790         MOVE 012 TO WS-ERRORNBR                                  00979000
009800         MOVE 1011 TO WS-SUBERROR                                 00980000
009810         GO TO VPA-PRINT-ERROR.                                   00981000
009820     MOVE 'Y' TO WS-PRIM-ACTREC.                                  00982000
009830 VPA-7102-ACCTINFO.                                               00983000
009840     MOVE MIM-7102PRIMSCINCOPT TO WS-PRIM-SCINCOPT.               00984000
009850     MOVE MIM-7102PRIMRATEINCOPT TO WS-PRIM-RATEINCOPT.           00985000
009860     MOVE MIM-7102TIMEPROCOPT TO WS-PRIM-TIMEPROCOPT.             00986000
009870     MOVE MIM-7102PRODUCTGROUP TO WS-PRIM-PROD-GROUP.             00987000
009880     MOVE RPQUA-PRODCODE TO WS-RPMIM2023PRODCD.                   00988000
009890     PERFORM SEARCH-RPS-2023.                                     00989000
009900     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         00990000
009910         MOVE 014 TO WS-ERRORNBR                                  00991000
009920         MOVE 1013 TO WS-SUBERROR                                 00992000
009930         GO TO VPA-PRINT-ERROR.                                   00993000
009940     MOVE WS-2023-INTAPPL (INDX-2023) TO WS-PRIM-APPL.            00994000
009950     IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'P'              00995000
009960         MOVE ZEROS TO WS-PRIM-SCNXT                              00996000
009970         GO TO VPA-PRIMARY-ACCT-VALID.                            00997000
009980     IF WS-PRIM-APPL IS EQUAL TO ZEROS                            00998000
009990         MOVE WS-INTRFACE (100) TO SR-060CALLNAME                 00999000
010000     ELSE                                                         01000000
010010         MOVE WS-INTRFACE (WS-PRIM-APPL) TO SR-060CALLNAME.       01001000
010020     IF SR-060CALLNAME IS EQUAL TO SPACES                         01002000
010030         MOVE 015 TO WS-ERRORNBR                                  01003000
010040         MOVE 1014 TO WS-SUBERROR                                 01004000
010050         GO TO VPA-PRINT-ERROR.                                   01005000
010060     MOVE RPQUA-INST TO RPINF00-INST.                             01006000
010070     MOVE RPQUA-ACCOUNT TO RPINF00-ACCOUNT.                       01007000
010080     MOVE RPQUA-PRODCODE TO RPINF00-PRODCODE.                     01008000
010090     MOVE WS-PRIM-APPL TO RPINF00-APPLR.                          01009000
010100     MOVE MIM-7101CLOSEDACCTOPT TO RPINF00-CLOSEDACCTOPT.         01010000
010110     MOVE 'R' TO RPINF00-FUNC.                                    01011000
010120     CALL SR-060CALLNAME USING                                    01012000
010130         WS-LINKAPPL.                                             01013000
010140     IF RPINF00-FUNCTION IS NOT EQUAL TO SPACE                    01014000
010150         MOVE 016 TO WS-ERRORNBR                                  01015000
010160         MOVE 1015 TO WS-SUBERROR                                 01016000
010170         GO TO VPA-PRINT-ERROR.                                   01017000
010180     MOVE RPINF00-SCNXT TO WS-PRIM-SCNXT.                         01018000
010190 VPA-7102-BALANCE.                                                01019000
010200     IF MIM-7102PRIMCATCD-Q IS NOT EQUAL TO 'E'                   01020000
010210         GO TO VPA-7101-PRIMBALOPT.                               01021000
010220     IF MIM-7102PRIMCATCD IS EQUAL TO SPACES                      01022000
010230         GO TO VPA-7101-PRIMBALOPT.                               01023000
010240     MOVE MIM-7102PRIMCATCD TO WS-RPMIM7106RPREC.                 01024000
010250     PERFORM SEARCH-RPS-7106.                                     01025000
010260     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01026000
010270         MOVE 017 TO WS-ERRORNBR                                  01027000
010280         MOVE 1016 TO WS-SUBERROR                                 01028000
010290         GO TO VPA-PRINT-ERROR.                                   01029000
010300     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01030000
010310     PERFORM GET-BALANCE.                                         01031000
010320     MOVE WS-WORK-BALANCE TO WS-PRIMCATBAL.                       01032000
010330     IF WS-PRIMCATBAL IS LESS THAN MIM-7106BALREQ-E               01033000
010340         MOVE 018 TO WS-ERRORNBR                                  01034000
010350         MOVE 1017 TO WS-SUBERROR                                 01035000
010360         GO TO VPA-PRINT-ERROR.                                   01036000
010370 VPA-7101-PRIMBALOPT.                                             01037000
010380     IF MIM-7101PRIMBALOPT-Q IS NOT EQUAL TO 'E'                  01038000
010390         GO TO VPA-7101-PRIMCOMBOPT.                              01039000
010400     IF MIM-7101PRIMBALOPT IS EQUAL TO 'N'                        01040000
010410         GO TO VPA-7101-PRIMCOMBOPT.                              01041000
010420 VPA-7102-BALCATCD1.                                              01042000
010430     IF MIM-7101ACCTRELCD-Q IS NOT EQUAL TO 'E'                   01043000
010440         GO TO VPA-7101-PRIMCOMBOPT.                              01044000
010450     IF MIM-7102BALCATCD1-Q IS NOT EQUAL TO 'E'                   01045000
010460         GO TO VPA-7102-BALCATCD2.                                01046000
010470     IF MIM-7102BALCATCD1 IS EQUAL TO SPACES                      01047000
010480         GO TO VPA-7102-BALCATCD2.                                01048000
010490     MOVE MIM-7102BALCATCD1 TO WS-RPMIM7106RPREC.                 01049000
010500     PERFORM SEARCH-RPS-7106.                                     01050000
010510     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01051000
010520         GO TO VPA-7102-BALCATCD2.                                01052000
010530     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01053000
010540     PERFORM GET-BALANCE.                                         01054000
010550     MOVE WS-WORK-BALANCE TO WS-PRIMCATBAL.                       01055000
010560     IF WS-PRIMCATBAL IS LESS THAN MIM-7106BALREQ-E               01056000
010570         GO TO VPA-7102-BALCATCD2.                                01057000
010580     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        01058000
010590         ADD +1 TO WS-ACCTRELCD-O.                                01059000
010600     GO TO VPA-7101-PRIMCOMBOPT.                                  01060000
010610 VPA-7102-BALCATCD2.                                              01061000
010620     IF MIM-7102BALCATCD2-Q IS NOT EQUAL TO 'E'                   01062000
010630         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01063000
010640             GO TO VPA-7101-PRIMCOMBOPT                           01064000
010650         ELSE                                                     01065000
010660             MOVE 019 TO WS-ERRORNBR                              01066000
010670             MOVE 1018 TO WS-SUBERROR                             01067000
010680             GO TO VPA-PRINT-ERROR.                               01068000
010690     IF MIM-7102BALCATCD2 IS EQUAL TO SPACES                      01069000
010700         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01070000
010710             GO TO VPA-7101-PRIMCOMBOPT                           01071000
010720         ELSE                                                     01072000
010730             MOVE 020 TO WS-ERRORNBR                              01073000
010740             MOVE 1018 TO WS-SUBERROR                             01074000
010750             GO TO VPA-PRINT-ERROR.                               01075000
010760     MOVE MIM-7102BALCATCD2 TO WS-RPMIM7106RPREC.                 01076000
010770     PERFORM SEARCH-RPS-7106.                                     01077000
010780     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01078000
010790         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01079000
010800             GO TO VPA-7101-PRIMCOMBOPT                           01080000
010810         ELSE                                                     01081000
010820             MOVE 021 TO WS-ERRORNBR                              01082000
010830             MOVE 1018 TO WS-SUBERROR                             01083000
010840             GO TO VPA-PRINT-ERROR.                               01084000
010850     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01085000
010860     PERFORM GET-BALANCE.                                         01086000
010870     MOVE WS-WORK-BALANCE TO WS-PRIMCATBAL.                       01087000
010880     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'A'                        01088000
010890         AND WS-PRIMCATBAL IS LESS THAN MIM-7106BALREQ-E          01089000
010900         MOVE 022 TO WS-ERRORNBR                                  01090000
010910         MOVE 1018 TO WS-SUBERROR                                 01091000
010920         GO TO VPA-PRINT-ERROR.                                   01092000
010930     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        01093000
010940         AND WS-PRIMCATBAL IS NOT LESS THAN MIM-7106BALREQ-E      01094000
010950         ADD +1 TO WS-ACCTRELCD-O.                                01095000
010960 VPA-7101-PRIMCOMBOPT.                                            01096000
010970     IF MIM-7101PRIMCOMBOPT1-Q IS NOT EQUAL TO 'E'                01097000
010980         GO TO VPA-7101-PRIMCOMBOPT2.                             01098000
010990     IF MIM-7101PRIMCOMBOPT1 IS NOT EQUAL TO 'Y'                  01099000
011000         GO TO VPA-7101-PRIMCOMBOPT2.                             01100000
011010     IF MIM-7101COMBCATCD1-Q IS NOT EQUAL TO 'E'                  01101000
011020         GO TO VPA-7101-PRIMCOMBOPT2.                             01102000
011030     IF MIM-7101COMBCATCD1 IS EQUAL TO SPACES                     01103000
011040         GO TO VPA-7101-PRIMCOMBOPT2.                             01104000
011050     IF MIM-7102COMBBALCD1-Q IS EQUAL TO 'E'                      01105000
011060         MOVE MIM-7102COMBBALCD1 TO WS-WORK-COMBBALCD             01106000
011070         GO TO VPA-7101-PRIMCOMBOPT1-CONT.                        01107000
011080     MOVE MIM-7101COMBCATCD1 TO WS-RPMIM7106RPREC.                01108000
011090     PERFORM SEARCH-RPS-7106.                                     01109000
011100     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01110000
011110         GO TO VPA-7101-PRIMCOMBOPT2.                             01111000
011120     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01112000
011130 VPA-7101-PRIMCOMBOPT1-CONT.                                      01113000
011140     PERFORM GET-BALANCE.                                         01114000
011150     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL1.                      01115000
011160 VPA-7101-PRIMCOMBOPT2.                                           01116000
011170     IF MIM-7101PRIMCOMBOPT2-Q IS NOT EQUAL TO 'E'                01117000
011180         GO TO VPA-7101-PRIMCOMBOPT3.                             01118000
011190     IF MIM-7101PRIMCOMBOPT2 IS NOT EQUAL TO 'Y'                  01119000
011200         GO TO VPA-7101-PRIMCOMBOPT3.                             01120000
011210     IF MIM-7101COMBCATCD2-Q IS NOT EQUAL TO 'E'                  01121000
011220         GO TO VPA-7101-PRIMCOMBOPT3.                             01122000
011230     IF MIM-7101COMBCATCD2 IS EQUAL TO SPACES                     01123000
011240         GO TO VPA-7101-PRIMCOMBOPT3.                             01124000
011250     IF MIM-7102COMBBALCD2-Q IS EQUAL TO 'E'                      01125000
011260         MOVE MIM-7102COMBBALCD2 TO WS-WORK-COMBBALCD             01126000
011270         GO TO VPA-7101-PRIMCOMBOPT2-CONT.                        01127000
011280     MOVE MIM-7101COMBCATCD2 TO WS-RPMIM7106RPREC.                01128000
011290     PERFORM SEARCH-RPS-7106.                                     01129000
011300     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01130000
011310         GO TO VPA-7101-PRIMCOMBOPT3.                             01131000
011320     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01132000
011330 VPA-7101-PRIMCOMBOPT2-CONT.                                      01133000
011340     PERFORM GET-BALANCE.                                         01134000
011350     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL2.                      01135000
011360 VPA-7101-PRIMCOMBOPT3.                                           01136000
011370     IF MIM-7101PRIMCOMBOPT3-Q IS NOT EQUAL TO 'E'                01137000
011380         GO TO VPA-7101-PRIMCOMBOPT4.                             01138000
011390     IF MIM-7101PRIMCOMBOPT3 IS NOT EQUAL TO 'Y'                  01139000
011400         GO TO VPA-7101-PRIMCOMBOPT4.                             01140000
011410     IF MIM-7101COMBCATCD3-Q IS NOT EQUAL TO 'E'                  01141000
011420         GO TO VPA-7101-PRIMCOMBOPT4.                             01142000
011430     IF MIM-7101COMBCATCD3 IS EQUAL TO SPACES                     01143000
011440         GO TO VPA-7101-PRIMCOMBOPT4.                             01144000
011450     IF MIM-7102COMBBALCD3-Q IS EQUAL TO 'E'                      01145000
011460         MOVE MIM-7102COMBBALCD3 TO WS-WORK-COMBBALCD             01146000
011470         GO TO VPA-7101-PRIMCOMBOPT3-CONT.                        01147000
011480     MOVE MIM-7101COMBCATCD3 TO WS-RPMIM7106RPREC.                01148000
011490     PERFORM SEARCH-RPS-7106.                                     01149000
011500     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01150000
011510         GO TO VPA-7101-PRIMCOMBOPT4.                             01151000
011520     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01152000
011530 VPA-7101-PRIMCOMBOPT3-CONT.                                      01153000
011540     PERFORM GET-BALANCE.                                         01154000
011550     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL3.                      01155000
011560 VPA-7101-PRIMCOMBOPT4.                                           01156000
011570     IF MIM-7101PRIMCOMBOPT4 IS NOT EQUAL TO 'Y'                  01157000
011580         GO TO VPA-PRIMARY-ACCT-VALID.                            01158000
011590     IF MIM-7101PRIMCOMBOPT4-Q IS NOT EQUAL TO 'E'                01159000
011600         GO TO VPA-PRIMARY-ACCT-VALID.                            01160000
011610     IF MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'                  01161000
011620         GO TO VPA-PRIMARY-ACCT-VALID.                            01162000
011630     IF MIM-7101COMBCATCD4 IS EQUAL TO SPACES                     01163000
011640         GO TO VPA-PRIMARY-ACCT-VALID.                            01164000
011650     IF MIM-7102COMBBALCD4-Q IS EQUAL TO 'E'                      01165000
011660         MOVE MIM-7102COMBBALCD4 TO WS-WORK-COMBBALCD             01166000
011670         GO TO VPA-7101-PRIMCOMBOPT4-CONT.                        01167000
011680     MOVE MIM-7101COMBCATCD4 TO WS-RPMIM7106RPREC.                01168000
011690     PERFORM SEARCH-RPS-7106.                                     01169000
011700     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01170000
011710         GO TO VPA-PRIMARY-ACCT-VALID.                            01171000
011720     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01172000
011730 VPA-7101-PRIMCOMBOPT4-CONT.                                      01173000
011740     PERFORM GET-BALANCE.                                         01174000
011750     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL4.                      01175000
011760 VPA-PRIMARY-ACCT-VALID.                                          01176000
011770     MOVE 'Y' TO WS-PRIMARY-ENROLL.                               01177000
011780     GO TO VPA-EXIT.                                              01178000
011790 VPA-PRINT-ERROR.                                                 01179000
011800     PERFORM PRIMARY-ACCOUNT-ERROR.                               01180000
011810 VPA-EXIT.                                                        01181000
011820     EXIT.                                                        01182000
011830******************************************************************01183000
011840 VALIDATE-SECONDARY-ACCOUNTS SECTION.                             01184000
011850 VSA-START.                                                       01185000
P0101      MOVE ZEROS TO WS-SUBSEC.                                     01186000
011870 VSA-NEXT.                                                        01187000
011880     ADD +1 TO WS-SUBSEC.                                         01188000
011890     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                01189000
011900         GO TO VSA-EXIT.                                          01190000
011910     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                01191000
011920         GO TO VSA-EXIT.                                          01192000
P0101      IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   01192050
P0101          GO TO VSA-NEXT.                                          01192100
P0101      MOVE ZEROS TO WS-SUBSEC2.                                    01192150
P0101  VSA-DUPLICATE-ACCOUNT-LOOP.                                      01192200
P0101      ADD +1 TO WS-SUBSEC2.                                        01192250
P0101      IF WS-SUBSEC2 IS NOT LESS THAN WS-SUBSEC                     01192300
P0101          GO TO VSA-NEXT-CONT.                                     01192350
P0101      IF WS-SEC-INST (WS-SUBSEC)                                   01192400
P0101          IS EQUAL TO WS-SEC-INST (WS-SUBSEC2)                     01192450
P0101          AND WS-SEC-PRODCD (WS-SUBSEC)                            01192500
P0101          IS EQUAL TO WS-SEC-PRODCD (WS-SUBSEC2)                   01192550
P0101          AND WS-SEC-ACCT (WS-SUBSEC)                              01192600
P0101          IS EQUAL TO WS-SEC-ACCT (WS-SUBSEC2)                     01192650
P0101          AND (WS-SEC-QUAL (WS-SUBSEC2) IS EQUAL TO SPACES         01192700
P0101          OR WS-SEC-QUAL (WS-SUBSEC2) IS EQUAL TO 'Y')             01192750
P0101          MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01192800
P0101          GO TO VSA-NEXT.                                          01192850
P0101      GO TO VSA-DUPLICATE-ACCOUNT-LOOP.                            01192900
P0101  VSA-NEXT-CONT.                                                   01192950
011930     MOVE ZEROS TO WS-SECCATBAL.                                  01193000
011940     MOVE WS-SEC-INST (WS-SUBSEC) TO RPACT-INST.                  01194000
011950     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPACT-PRODCODE.            01195000
011960     MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPACT-ACCOUNT.               01196000
011970     MOVE 'R  ' TO SR-APIFUNC.                                    01197000
011980     PERFORM CALL-RPS-ACT.                                        01198000
011990     IF WS-FUNCTION IS EQUAL TO 'N'                               01199000
012000         MOVE 'N' TO WS-SEC-ACTREC (WS-SUBSEC)                    01200000
012010         GO TO VSA-7101-CUSTRELCD.                                01201000
012020     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      01202000
012030         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01203000
012040         GO TO VSA-NEXT.                                          01204000
012050     MOVE 'Y' TO WS-SEC-ACTREC (WS-SUBSEC).                       01205000
012060 VSA-7101-CUSTRELCD.                                              01206000
012070     IF WS-SEC-ADDON (WS-SUBSEC) IS EQUAL TO 'Y'                  01207000
012080         GO TO VSA-ACCTINTERFACE.                                 01208000
012090     IF MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'B'                   01209000
012100         AND MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'E'              01210000
012110         GO TO VSA-ACCTINTERFACE.                                 01211000
012120     MOVE MIM-7101CUSTRELCD TO WS-RPMIM7104RPREC.                 01212000
012130     PERFORM SEARCH-RPS-7104.                                     01213000
012140     IF WS-RPMIM7104FOUND IS EQUAL TO 'N'                         01214000
012150         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01215000
012160         GO TO VSA-NEXT.                                          01216000
012170     MOVE +1 TO WS-SUB1.                                          01217000
012180     IF MIM-7104OPT IS EQUAL TO 'I'                               01218000
012190         GO TO VSA-7101-CUSTRELCDI.                               01219000
012200 VSA-7101-CUSTRELCDE.                                             01220000
012210     IF MIM-7104RLSP (WS-SUB1) IS EQUAL TO                        01221000
012220         WS-SEC-RELNBR (WS-SUBSEC)                                01222000
012230         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01223000
012240         GO TO VSA-NEXT.                                          01224000
012250     ADD +1 TO WS-SUB1.                                           01225000
012260     IF WS-SUB1 IS GREATER THAN 50                                01226000
012270         GO TO VSA-ACCTINTERFACE.                                 01227000
012280     GO TO VSA-7101-CUSTRELCDE.                                   01228000
012290 VSA-7101-CUSTRELCDI.                                             01229000
012300     IF MIM-7104RLSP (WS-SUB1) IS EQUAL TO                        01230000
012310         WS-SEC-RELNBR (WS-SUBSEC)                                01231000
012320         GO TO VSA-ACCTINTERFACE.                                 01232000
012330     ADD +1 TO WS-SUB1.                                           01233000
012340     IF WS-SUB1 IS GREATER THAN 50                                01234000
012350         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01235000
012360         GO TO VSA-NEXT.                                          01236000
012370     GO TO VSA-7101-CUSTRELCDI.                                   01237000
012380 VSA-ACCTINTERFACE.                                               01238000
012390     IF WS-SEC-RPOPT (WS-SUBSEC) IS EQUAL TO 'P'                  01239000
012400         MOVE ZEROS TO WS-SEC-BRANCH (WS-SUBSEC)                  01240000
012410         MOVE ZEROS TO WS-SEC-TYPE (WS-SUBSEC)                    01241000
012420         GO TO VSA-7102.                                          01242000
012430     IF WS-SEC-APPL (WS-SUBSEC) IS EQUAL TO ZEROS                 01243000
012440         MOVE WS-INTRFACE (100) TO SR-060CALLNAME                 01244000
012450     ELSE                                                         01245000
012460         MOVE WS-SEC-APPL (WS-SUBSEC) TO WS-WORK-APPL             01246000
012470         MOVE WS-INTRFACE (WS-WORK-APPL) TO SR-060CALLNAME.       01247000
012480     IF WS-SEC-INST (WS-SUBSEC) IS NOT EQUAL TO RPBNK-INST        01248000
012490         AND WS-SEC-APPL (WS-SUBSEC) IS NOT EQUAL TO ZEROS        01249000
012500         PERFORM FIND-CROSS-INST-INTERFACE.                       01250000
012510     IF SR-060CALLNAME IS EQUAL TO SPACES                         01251000
012520         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01252000
012530         GO TO VSA-NEXT.                                          01253000
012540     MOVE WS-SEC-INST (WS-SUBSEC) TO RPINF00-INST.                01254000
012550     MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPINF00-ACCOUNT.             01255000
012560     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPINF00-PRODCODE.          01256000
012570     MOVE WS-SEC-APPL (WS-SUBSEC) TO RPINF00-APPLR.               01257000
012580     MOVE MIM-7101CLOSEDACCTOPT TO RPINF00-CLOSEDACCTOPT.         01258000
012590     MOVE 'R' TO RPINF00-FUNC.                                    01259000
012600     CALL SR-060CALLNAME USING                                    01260000
012610         WS-LINKAPPL.                                             01261000
012620     IF RPINF00-FUNCTION IS NOT EQUAL TO SPACE                    01262000
012630         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01263000
012640         GO TO VSA-NEXT.                                          01264000
012650     MOVE RPINF00-BRANCH TO WS-SEC-BRANCH (WS-SUBSEC).            01265000
012660     MOVE RPINF00-ACCT-TYPE TO WS-SEC-TYPE (WS-SUBSEC).           01266000
012670 VSA-7102.                                                        01267000
012680     MOVE RPQUA-MODEL TO WS-RPMIM7102MODEL.                       01268000
012690     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO WS-RPMIM7102PRODCODE.      01269000
012700     IF WS-SEC-RPOPT (WS-SUBSEC) IS EQUAL TO 'P'                  01270000
012710         GO TO VSA-7102-TYPEZERO.                                 01271000
012720     MOVE WS-SEC-TYPE (WS-SUBSEC) TO WS-RPMIM7102TYPE.            01272000
012730     PERFORM SEARCH-RPS-7102.                                     01273000
012740     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01274000
012750         MOVE 'B' TO WS-SEC-7102 (WS-SUBSEC)                      01275000
012760         GO TO VSA-7102-TEST.                                     01276000
012770 VSA-7102-TYPEZERO.                                               01277000
012780     MOVE ZEROS TO WS-RPMIM7102TYPE.                              01278000
012790     PERFORM SEARCH-RPS-7102.                                     01279000
012800     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01280000
012810         MOVE 'P' TO WS-SEC-7102 (WS-SUBSEC)                      01281000
012820         GO TO VSA-7102-TEST.                                     01282000
012830 VSA-7102-MODELONLY.                                              01283000
012840     MOVE SPACES TO WS-RPMIM7102PRODCODE.                         01284000
012850     MOVE ZEROS TO WS-RPMIM7102TYPE.                              01285000
012860     PERFORM SEARCH-RPS-7102.                                     01286000
012870     IF WS-RPMIM7102FOUND IS EQUAL TO 'N'                         01287000
012880         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01288000
012890         GO TO VSA-NEXT.                                          01289000
012900     MOVE 'M' TO WS-SEC-7102 (WS-SUBSEC).                         01290000
012910 VSA-7102-TEST.                                                   01291000
012920     IF WS-SEC-ADDON (WS-SUBSEC) IS EQUAL TO 'Y'                  01292000
012930         AND MIM-7100ADDONINCOPT IS EQUAL TO 'N'                  01293000
012940         GO TO VSA-7102-USERROUTINE.                              01294000
012950     IF WS-SEC-ACTREC (WS-SUBSEC) IS NOT EQUAL TO 'Y'             01295000
012960         GO TO VSA-7102-USERROUTINE.                              01296000
012970     IF RPACT-RATE-INC-OPTION IS EQUAL TO 'Y'                     01297000
012980         AND MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                01298000
012990         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01299000
013000         GO TO VSA-NEXT.                                          01300000
013010     IF MIM-7100DUPINCOPT IS EQUAL TO 'Y'                         01301000
013020         GO TO VSA-7102-USERROUTINE.                              01302000
013030     IF RPACT-SC-INC-OPTION IS EQUAL TO 'Y'                       01303000
013040         AND MIM-7102SECSCINCOPT IS EQUAL TO 'Y'                  01304000
013050         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01305000
013060         GO TO VSA-NEXT.                                          01306000
013070 VSA-7102-USERROUTINE.                                            01307000
013080     MOVE MIM-7102SECSCINCOPT TO WS-SEC-SCINCOPT (WS-SUBSEC).     01308000
013090     MOVE MIM-7102SECRATEINCOPT TO WS-SEC-RATEINCOPT (WS-SUBSEC). 01309000
013100     MOVE MIM-7102TIMEPROCOPT TO WS-SEC-TIMEPROCOPT (WS-SUBSEC).  01310000
013110     MOVE MIM-7102PRODUCTGROUP TO WS-SEC-PROD-GROUP (WS-SUBSEC).  01311000
013120     IF (MIM-7102USERRTN-Q IS NOT EQUAL TO 'B'                    01312000
013130         AND MIM-7102USERRTN-Q IS NOT EQUAL TO 'E')               01313000
013140         OR MIM-7102USERRTN IS NOT EQUAL TO 'Y'                   01314000
013150         GO TO VSA-7102-BRANCH.                                   01315000
013160     IF WS-SEC-RPOPT (WS-SUBSEC) IS EQUAL TO 'P'                  01316000
013170         MOVE WS-SEC-INST (WS-SUBSEC) TO RPUSER-INST              01317000
013180         MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPUSER-ACCOUNT           01318000
013190         MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPUSER-PRODCODE        01319000
013200         MOVE WS-SEC-APPL (WS-SUBSEC) TO RPUSER-APPLR             01320000
013210         INITIALIZE RPUSER-GRP-DATA                               01321000
013220     ELSE                                                         01322000
013230         MOVE RPINF00-INST TO RPUSER-INST                         01323000
013240         MOVE RPINF00-ACCOUNT TO RPUSER-ACCOUNT                   01324000
013250         MOVE RPINF00-PRODCODE TO RPUSER-PRODCODE                 01325000
013260         MOVE RPINF00-APPLR TO RPUSER-APPLR                       01326000
013270         MOVE RPINF00-USER-INFO TO RPUSER-USER-INFO               01327000
013280         MOVE RPINF00-MISC-INFO TO RPUSER-MISC-INFO               01328000
013290         MOVE RPINF00-BAL-INFO TO RPUSER-BAL-INFO                 01329000
013300     END-IF.                                                      01330000
013310     MOVE 'RPBUSER ' TO SR-060CALLNAME.                           01331000
013320     CALL SR-060CALLNAME USING                                    01332000
013330         WS-LINKUSER.                                             01333000
013340     IF RPUSER-FUNCTION IS NOT EQUAL TO SPACES                    01334000
013350         OR RPUSER-PASSED IS EQUAL TO 'N'                         01335000
013360         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01336000
013370         GO TO VSA-NEXT.                                          01337000
013380 VSA-7102-BRANCH.                                                 01338000
013390     IF MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'B'                01339000
013400         AND MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'E'           01340000
013410         GO TO VSA-7102-MINTERM.                                  01341000
013420     MOVE WS-SEC-INST (WS-SUBSEC) TO WS-RPMIM7107INST2.           01342000
013430     MOVE WS-SEC-BRANCH (WS-SUBSEC) TO WS-RPMIM7107BRCHREGION.    01343000
013440     MOVE MIM-7102BRCHREGIONCD TO WS-RPMIM7107RPREC.              01344000
013450     PERFORM VALIDATE-BRANCH.                                     01345000
013460     IF WS-RPMIM7107ERROR IS NOT EQUAL TO SPACES                  01346000
013470         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01347000
013480         GO TO VSA-NEXT.                                          01348000
013490 VSA-7102-MINTERM.                                                01349000
013500     IF WS-SEC-RPOPT (WS-SUBSEC) IS EQUAL TO 'P'                  01350000
013510         GO TO VSA-SECONDARY-ACCT-VALID.                          01351000
013520     IF MIM-7102MINTERM-Q IS NOT EQUAL TO 'B'                     01352000
013530         AND MIM-7102MINTERM-Q IS NOT EQUAL TO 'E'                01353000
013540         GO TO VSA-7102-MAXTERM.                                  01354000
013550     IF RPINF00-TERM IS LESS THAN MIM-7102MINTERM                 01355000
013560         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01356000
013570         GO TO VSA-NEXT.                                          01357000
013580 VSA-7102-MAXTERM.                                                01358000
013590     IF MIM-7102MAXTERM-Q IS NOT EQUAL TO 'B'                     01359000
013600         AND MIM-7102MAXTERM-Q IS NOT EQUAL TO 'E'                01360000
013610         GO TO VSA-7102-USEROPT1.                                 01361000
013620     IF RPINF00-TERM IS GREATER THAN MIM-7102MAXTERM              01362000
013630         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01363000
013640         GO TO VSA-NEXT.                                          01364000
013650 VSA-7102-USEROPT1.                                               01365000
013660     IF MIM-7102USERTYPE1 IS EQUAL TO 'P'                         01366000
013670         GO TO VSA-7102-USEROPT2.                                 01367000
013680     IF MIM-7102USEROPT1-Q IS NOT EQUAL TO 'B'                    01368000
013690         AND MIM-7102USEROPT1-Q IS NOT EQUAL TO 'E'               01369000
013700         GO TO VSA-7102-USEROPT2.                                 01370000
013710     IF (MIM-7102USEROPTREL1 IS EQUAL TO 'EQ'                     01371000
013720         AND RPINF00-USEROPT1 IS NOT EQUAL TO MIM-7102USEROPT1)   01372000
013730         OR (MIM-7102USEROPTREL1 IS EQUAL TO 'NE'                 01373000
013740         AND RPINF00-USEROPT1 IS EQUAL TO MIM-7102USEROPT1)       01374000
013750         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01375000
013760         GO TO VSA-NEXT.                                          01376000
013770 VSA-7102-USEROPT2.                                               01377000
013780     IF MIM-7102USERTYPE2 IS EQUAL TO 'P'                         01378000
013790         GO TO VSA-7102-USEROPT3.                                 01379000
013800     IF MIM-7102USEROPT2-Q IS NOT EQUAL TO 'B'                    01380000
013810         AND MIM-7102USEROPT2-Q IS NOT EQUAL TO 'E'               01381000
013820         GO TO VSA-7102-USEROPT3.                                 01382000
013830     IF (MIM-7102USEROPTREL2 IS EQUAL TO 'EQ'                     01383000
013840         AND RPINF00-USEROPT2 IS NOT EQUAL TO MIM-7102USEROPT2)   01384000
013850         OR (MIM-7102USEROPTREL2 IS EQUAL TO 'NE'                 01385000
013860         AND RPINF00-USEROPT2 IS EQUAL TO MIM-7102USEROPT2)       01386000
013870         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01387000
013880         GO TO VSA-NEXT.                                          01388000
013890 VSA-7102-USEROPT3.                                               01389000
013900     IF MIM-7102USERTYPE3 IS EQUAL TO 'P'                         01390000
013910         GO TO VSA-7102-USEROPT4.                                 01391000
013920     IF MIM-7102USEROPT3-Q IS NOT EQUAL TO 'B'                    01392000
013930         AND MIM-7102USEROPT3-Q IS NOT EQUAL TO 'E'               01393000
013940         GO TO VSA-7102-USEROPT4.                                 01394000
013950     IF (MIM-7102USEROPTREL3 IS EQUAL TO 'EQ'                     01395000
013960         AND RPINF00-USEROPT3 IS NOT EQUAL TO MIM-7102USEROPT3)   01396000
013970         OR (MIM-7102USEROPTREL3 IS EQUAL TO 'NE'                 01397000
013980         AND RPINF00-USEROPT3 IS EQUAL TO MIM-7102USEROPT3)       01398000
013990         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01399000
014000         GO TO VSA-NEXT.                                          01400000
014010 VSA-7102-USEROPT4.                                               01401000
014020     IF MIM-7102USERTYPE4 IS EQUAL TO 'P'                         01402000
014030         GO TO VSA-7102-BALCATCD1.                                01403000
014040     IF MIM-7102USEROPT4-Q IS NOT EQUAL TO 'B'                    01404000
014050         AND MIM-7102USEROPT4-Q IS NOT EQUAL TO 'E'               01405000
014060         GO TO VSA-7102-BALCATCD1.                                01406000
014070     IF (MIM-7102USEROPTREL4 IS EQUAL TO 'EQ'                     01407000
014080         AND RPINF00-USEROPT4 IS NOT EQUAL TO MIM-7102USEROPT4)   01408000
014090         OR (MIM-7102USEROPTREL4 IS EQUAL TO 'NE'                 01409000
014100         AND RPINF00-USEROPT4 IS EQUAL TO MIM-7102USEROPT4)       01410000
014110         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01411000
014120         GO TO VSA-NEXT.                                          01412000
014130 VSA-7102-BALCATCD1.                                              01413000
014140     IF MIM-7101ACCTRELCD-Q IS NOT EQUAL TO 'E'                   01414000
014150         GO TO VSA-7101-COMBCATCD.                                01415000
014160     IF MIM-7102BALCATCD1-Q IS NOT EQUAL TO 'E'                   01416000
014170         GO TO VSA-7102-BALCATCD2.                                01417000
014180     IF MIM-7102BALCATCD1 IS EQUAL TO SPACES                      01418000
014190         GO TO VSA-7102-BALCATCD2.                                01419000
014200     MOVE MIM-7102BALCATCD1 TO WS-RPMIM7106RPREC.                 01420000
014210     PERFORM SEARCH-RPS-7106.                                     01421000
014220     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01422000
014230         GO TO VSA-7102-BALCATCD2.                                01423000
014240     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01424000
014250     PERFORM GET-BALANCE.                                         01425000
014260     MOVE WS-WORK-BALANCE TO WS-SECCATBAL.                        01426000
014270     IF WS-SECCATBAL IS LESS THAN MIM-7106BALREQ-E                01427000
014280         GO TO VSA-7102-BALCATCD2.                                01428000
014290     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        01429000
014300         ADD +1 TO WS-ACCTRELCD-O.                                01430000
014310     GO TO VSA-7101-COMBCATCD.                                    01431000
014320 VSA-7102-BALCATCD2.                                              01432000
014330     IF MIM-7102BALCATCD2-Q IS NOT EQUAL TO 'E'                   01433000
014340         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01434000
014350             GO TO VSA-7101-COMBCATCD                             01435000
014360         ELSE                                                     01436000
014370             MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                  01437000
014380             GO TO VSA-NEXT.                                      01438000
014390     IF MIM-7102BALCATCD2 IS EQUAL TO SPACES                      01439000
014400         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01440000
014410             GO TO VSA-7101-COMBCATCD                             01441000
014420         ELSE                                                     01442000
014430             MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                  01443000
014440             GO TO VSA-NEXT.                                      01444000
014450     MOVE MIM-7102BALCATCD2 TO WS-RPMIM7106RPREC.                 01445000
014460     PERFORM SEARCH-RPS-7106.                                     01446000
014470     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01447000
014480         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01448000
014490             GO TO VSA-7101-COMBCATCD                             01449000
014500         ELSE                                                     01450000
014510             MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                  01451000
014520             GO TO VSA-NEXT.                                      01452000
014530     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01453000
014540     PERFORM GET-BALANCE.                                         01454000
014550     MOVE WS-WORK-BALANCE TO WS-SECCATBAL.                        01455000
014560     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'A'                        01456000
014570         AND WS-SECCATBAL IS LESS THAN MIM-7106BALREQ-E           01457000
014580         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01458000
014590         GO TO VSA-EXIT.                                          01459000
014600     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        01460000
014610         AND WS-SECCATBAL IS NOT LESS THAN MIM-7106BALREQ-E       01461000
014620         ADD +1 TO WS-ACCTRELCD-O.                                01462000
014630 VSA-7101-COMBCATCD.                                              01463000
014640     IF MIM-7101COMBCATCD1-Q IS NOT EQUAL TO 'E'                  01464000
014650         GO TO VSA-7101-COMBCATCD2.                               01465000
014660     IF MIM-7101COMBCATCD1 IS EQUAL TO SPACES                     01466000
014670         GO TO VSA-7101-COMBCATCD2.                               01467000
014680     IF MIM-7102COMBBALCD1-Q IS EQUAL TO 'E'                      01468000
014690         MOVE MIM-7102COMBBALCD1 TO WS-WORK-COMBBALCD             01469000
014700         GO TO VSA-7101-COMBCATCD1-CONT.                          01470000
014710     MOVE MIM-7101COMBCATCD1 TO WS-RPMIM7106RPREC.                01471000
014720     PERFORM SEARCH-RPS-7106.                                     01472000
014730     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01473000
014740         GO TO VSA-7101-COMBCATCD2.                               01474000
014750     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01475000
014760 VSA-7101-COMBCATCD1-CONT.                                        01476000
014770     PERFORM GET-BALANCE.                                         01477000
014780     MOVE WS-WORK-BALANCE TO WS-SEC-BAL1 (WS-SUBSEC).             01478000
014790 VSA-7101-COMBCATCD2.                                             01479000
014800     IF MIM-7101COMBCATCD2-Q IS NOT EQUAL TO 'E'                  01480000
014810         GO TO VSA-7101-COMBCATCD3.                               01481000
014820     IF MIM-7101COMBCATCD2 IS EQUAL TO SPACES                     01482000
014830         GO TO VSA-7101-COMBCATCD3.                               01483000
014840     IF MIM-7102COMBBALCD2-Q IS EQUAL TO 'E'                      01484000
014850         MOVE MIM-7102COMBBALCD2 TO WS-WORK-COMBBALCD             01485000
014860         GO TO VSA-7101-COMBCATCD2-CONT.                          01486000
014870     MOVE MIM-7101COMBCATCD2 TO WS-RPMIM7106RPREC.                01487000
014880     PERFORM SEARCH-RPS-7106.                                     01488000
014890     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01489000
014900         GO TO VSA-7101-COMBCATCD3.                               01490000
014910     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01491000
014920 VSA-7101-COMBCATCD2-CONT.                                        01492000
014930     PERFORM GET-BALANCE.                                         01493000
014940     MOVE WS-WORK-BALANCE TO WS-SEC-BAL2 (WS-SUBSEC).             01494000
014950 VSA-7101-COMBCATCD3.                                             01495000
014960     IF MIM-7101COMBCATCD3-Q IS NOT EQUAL TO 'E'                  01496000
014970         GO TO VSA-7101-COMBCATCD4.                               01497000
014980     IF MIM-7101COMBCATCD3 IS EQUAL TO SPACES                     01498000
014990         GO TO VSA-7101-COMBCATCD4.                               01499000
015000     IF MIM-7102COMBBALCD3-Q IS EQUAL TO 'E'                      01500000
015010         MOVE MIM-7102COMBBALCD3 TO WS-WORK-COMBBALCD             01501000
015020         GO TO VSA-7101-COMBCATCD3-CONT.                          01502000
015030     MOVE MIM-7101COMBCATCD3 TO WS-RPMIM7106RPREC.                01503000
015040     PERFORM SEARCH-RPS-7106.                                     01504000
015050     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01505000
015060         GO TO VSA-7101-COMBCATCD4.                               01506000
015070     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01507000
015080 VSA-7101-COMBCATCD3-CONT.                                        01508000
015090     PERFORM GET-BALANCE.                                         01509000
015100     MOVE WS-WORK-BALANCE TO WS-SEC-BAL3 (WS-SUBSEC).             01510000
015110 VSA-7101-COMBCATCD4.                                             01511000
015120     MOVE ZEROS TO WS-SECCATBAL.                                  01512000
015130     IF MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'                  01513000
015140         GO TO VSA-SECONDARY-ACCT-VALID.                          01514000
015150     IF MIM-7101COMBCATCD4 IS EQUAL TO SPACES                     01515000
015160         GO TO VSA-SECONDARY-ACCT-VALID.                          01516000
015170     IF MIM-7102COMBBALCD4-Q IS EQUAL TO 'E'                      01517000
015180         MOVE MIM-7102COMBBALCD4 TO WS-WORK-COMBBALCD             01518000
015190         GO TO VSA-7101-COMBCATCD4-CONT.                          01519000
015200     MOVE MIM-7101COMBCATCD4 TO WS-RPMIM7106RPREC.                01520000
015210     PERFORM SEARCH-RPS-7106.                                     01521000
015220     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01522000
015230         GO TO VSA-SECONDARY-ACCT-VALID.                          01523000
015240     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01524000
015250 VSA-7101-COMBCATCD4-CONT.                                        01525000
015260     PERFORM GET-BALANCE.                                         01526000
015270     MOVE WS-WORK-BALANCE TO WS-SEC-BAL4 (WS-SUBSEC).             01527000
015280 VSA-SECONDARY-ACCT-VALID.                                        01528000
015290     MOVE 'Y' TO WS-SEC-QUAL (WS-SUBSEC).                         01529000
015300     GO TO VSA-NEXT.                                              01530000
015310 VSA-EXIT.                                                        01531000
015320     EXIT.                                                        01532000
015330******************************************************************01533000
015340 PRIMARY-ACCOUNT-ERROR SECTION.                                   01534000
015350 PAR-START.                                                       01535000
015360     MOVE SPACES TO RPRPTS-RECORD.                                01536000
015370     MOVE 1 TO RPRPTS-SRTNUMBER.                                  01537000
015380     MOVE 50 TO RPRPTS-RPTNBR.                                    01538000
015390     MOVE RPQUA-INST TO RPRPTS-INST.                              01539000
015400     MOVE RPQUA-PRODCODE TO RPRPTS-PRODCODE.                      01540000
015410     MOVE RPQUA-ACCOUNT TO RPRPTS-ACCOUNT.                        01541000
015420     MOVE RPQUA-MODEL TO RPRPTS-MODEL.                            01542000
015430     MOVE RPQUA-BRANCH TO RPRPTS-BRANCH.                          01543000
015440     MOVE RPQUA-ACCT-TYPE TO RPRPTS-TYPE.                         01544000
015450     MOVE RPQUA-DATE-OPENED TO RPRPTS-050OPENDATE.                01545000
015460     MOVE RPQUA-ENROLLATTEMPTS TO WS-ENROLLATTEMPTS.              01546000
015470     SUBTRACT 1 FROM WS-ENROLLATTEMPTS.                           01547000
015480     MOVE WS-ENROLLATTEMPTS TO RPRPTS-050ENROLLATTEMPTS.          01548000
015490     MOVE ZEROS TO RPRPTS-050CRWOLDNXTDT.                         01549000
015500     MOVE ZEROS TO RPRPTS-050CRWNEWNXTDT.                         01550000
015510     MOVE SPACES TO RPRPTS-NAME.                                  01551000
015520     MOVE WS-RRPTCTL TO RPRPTS-RPTCTL.                            01552000
015530     MOVE 1001 TO WS-2011-MSGNBR.                                 01553000
015540     PERFORM GET-ERROR-MESSAGE.                                   01554000
015550     MOVE WS-ERRORMESSAGE TO RPRPTS-050ERRORMSG.                  01555000
015560     MOVE 1001 TO RPRPTS-050ERRORNBR.                             01556000
015570     IF WS-RRPTPFC IS EQUAL TO '0'                                01557000
015580         GO TO PAR-END.                                           01558000
015590 PAR-WRITE.                                                       01559000
015600     MOVE 'ASE' TO WS-RRPTS.                                      01560000
015610     PERFORM CALL-RPRPTS.                                         01561000
015620     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01562000
015630         GO TO AR-0017.                                           01563000
015640     MOVE 2 TO RPRPTS-SRTNUMBER.                                  01564000
015650     MOVE WS-ERRORNBR TO RPRPTS-050ERRORNBR.                      01565000
015660     MOVE WS-SUBERROR TO WS-2011-MSGNBR.                          01566000
015670     PERFORM GET-ERROR-MESSAGE.                                   01567000
015680     MOVE WS-ERRORMESSAGE TO RPRPTS-050ERRORMSG.                  01568000
015690     MOVE 'ASE' TO WS-RRPTS.                                      01569000
015700     PERFORM CALL-RPRPTS.                                         01570000
015710     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01571000
015720         GO TO AR-0028.                                           01572000
015730 PAR-END.                                                         01573000
015740     MOVE SPACES TO RPRPTS-RECORD.                                01574000
015750     MOVE 0 TO RPRPTS-SRTNUMBER.                                  01575000
015760 PAR-EXIT.                                                        01576000
015770     EXIT.                                                        01577000
P0101 ******************************************************************01577200
P0101  VALIDATE-PRIM-RELCD SECTION.                                     01577400
000000 COPY RPP007.                                                     01577600
015780******************************************************************01578000
015790 CALL-RCIF SECTION.                                               01579000
P0101  CR-START.                                                        01580000
015810     INITIALIZE WS-SAVED-SECACCTS.                                01581000
015820     MOVE RPQUA-INST TO RPRF21-BASE-ACCT-INST.                    01582000
015830     MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE.                    01583000
015840     MOVE ZEROS TO RPRF21-BASE-ACCT.                              01584000
015850     MOVE RPQUA-RCIF-KEY TO RPRF21-BASE-CUSTOMER.                 01585000
015860     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          01586000
015870     MOVE 'N' TO RPRF21-FUNC.                                     01587000
015890     MOVE ZEROS TO WS-SUBADD.                                     01589000
015900     MOVE SPACES TO WS-LAST-PRODCD.                               01590000
015910     MOVE SPACES TO WS-RPMIM2023PRODCD.                           01591000
015920     MOVE SPACES TO WS-FUNCTION.                                  01592000
015930     MOVE ZEROS TO WS-NUMOFACCOUNTS.                              01593000
015940     MOVE ZEROS TO WS-NUMOFPRODUCTS.                              01594000
015950     MOVE SPACES TO WS-PRODCODE-TABLE.                            01595000
015970     INITIALIZE WS-ADDON-TABLE.                                   01597000
015980     MOVE 'N' TO WS-ACCOUNT-FOUND.                                01598000
015990     MOVE 'N' TO WS-PRODUCT-FOUND.                                01599000
P0101  CR-GET-PRIM-ACC.                                                 01599030
P0101      MOVE WS-INTRFACE (47) TO SR-060CALLNAME.                     01599060
P0101      MOVE RPQUA-INST TO RPRF21-BASE-ACCT-INST.                    01599090
P0101      MOVE RPQUA-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.            01599120
P0101      MOVE RPQUA-ACCOUNT TO RPRF21-BASE-ACCT.                      01599150
P0101      MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          01599180
P0101      MOVE SPACES TO RPRF21-BASE-CUSTOMER.                         01599210
P0101      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     01599240
P0101          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        01599270
P0101          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    01599300
P0101      MOVE 'R' TO RPRF21-FUNC.                                     01599330
P0101      CALL SR-060CALLNAME USING                                    01599360
P0101          WS-LINKRCIF.                                             01599390
P0101      IF RPRF21-FUNCTION IS EQUAL TO 'N'                           01599420
P0101          MOVE RPRF21-FUNCTION TO WS-FUNCTION                      01599450
P0101          GO TO CR-EXIT.                                           01599480
P0101      IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     01599510
P0101          MOVE RPRF21-FUNCTION TO WS-FUNCTION                      01599540
P0101          GO TO AR-0056.                                           01599570
P0101      MOVE RPQUA-INST TO WS-SEC-INST (1).                          01599600
P0101      MOVE RPQUA-PRODCODE TO WS-SEC-PRODCD (1).                    01599630
P0101      MOVE RPQUA-ACCOUNT TO WS-SEC-ACCT (1).                       01599660
P0101      MOVE RPRF21-REL TO WS-SEC-RELNBR (1).                        01599690
P0101      MOVE RPRF21-REL TO WS-SEC-PRIMCUSTRELNBR (1).                01599720
P0101      MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE.                    01599750
P0101      MOVE 'N' TO WS-SEC-QUAL (1)                                  01599780
P0101      MOVE ZEROS TO RPRF21-BASE-ACCT.                              01599810
P0101      MOVE +1 TO WS-SUB4.                                          01599840
P0101  CR-ADDON.                                                        01599870
016000     IF RPQUA-ADDON-ACCTS IS NOT GREATER THAN ZEROS               01600000
P0101          GO TO CR-PRIM-RELCODE.                                   01601000
016020     MOVE RPQUA-INST TO RPREL-INST.                               01602000
016030     MOVE RPQUA-PRODCODE TO RPREL-PRODCODE.                       01603000
016040     MOVE RPQUA-ACCOUNT TO RPREL-ACCOUNT.                         01604000
016050     MOVE RPQUA-MODEL TO RPREL-MODEL.                             01605000
016060     MOVE ZEROS TO RPREL-INST2.                                   01606000
016070     MOVE SPACES TO RPREL-PRODCODE2.                              01607000
016080     MOVE SPACES TO RPREL-ACCOUNT2.                               01608000
016090 CR-GET-ADDON-INFO.                                               01609000
016100     MOVE 'N  ' TO SR-APIFUNC.                                    01610000
016110     PERFORM CALL-RPS-REL.                                        01611000
016120     IF WS-FUNCTION IS EQUAL TO 'E'                               01612000
P0101          GO TO CR-PRIM-RELCODE.                                   01613000
016140     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01614000
016150         GO TO AR-0030.                                           01615000
016160     IF RPQUA-GRP-KEY IS NOT EQUAL TO RPREL-ACCT1-GRP             01616000
P0101          GO TO CR-PRIM-RELCODE.                                   01617000
016180     IF RPREL-ACCT-STATUS IS NOT EQUAL TO 'U'                     01618000
016190         AND RPREL-ACCT-STATUS IS NOT EQUAL TO 'Q'                01619000
016200         GO TO CR-GET-ADDON-INFO.                                 01620000
016210     ADD +1 TO WS-NUMOFACCOUNTS.                                  01621000
016220     ADD +1 TO WS-SUB4.                                           01622000
016230     IF WS-SUB4 IS GREATER THAN WS-SECONDARY-MAX                  01623000
016240         GO TO AR-0031.                                           01624000
016250     MOVE RPREL-PRODCODE2 TO WS-RPMIM2023PRODCD.                  01625000
016260     PERFORM SEARCH-RPS-2023.                                     01626000
016270     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         01627000
016280         MOVE 'P' TO WS-SEC-RPOPT (WS-SUB4)                       01628000
016290     ELSE                                                         01629000
016300         MOVE WS-2023-RPOPTION (INDX-2023)                        01630000
016310             TO WS-SEC-RPOPT (WS-SUB4).                           01631000
016320     MOVE RPREL-PRODCODE2 TO WS-SEC-PRODCD (WS-SUB4).             01632000
016330     MOVE RPREL-APPL TO WS-SEC-APPL (WS-SUB4).                    01633000
016340     MOVE RPREL-BRANCH TO WS-SEC-BRANCH (WS-SUB4).                01634000
016350     MOVE RPREL-ACCT-TYPE TO WS-SEC-TYPE (WS-SUB4).               01635000
016360     MOVE RPREL-INST2 TO WS-SEC-INST (WS-SUB4).                   01636000
016370     MOVE RPREL-ACCOUNT2 TO WS-SEC-ACCT (WS-SUB4).                01637000
016380     MOVE ZEROS TO WS-SEC-RELNBR (WS-SUB4).                       01638000
016390     MOVE SPACE TO WS-SEC-ACTREC (WS-SUB4).                       01639000
016400     MOVE SPACE TO WS-SEC-QUAL (WS-SUB4).                         01640000
016410     MOVE 'Y' TO WS-SEC-ADDON (WS-SUB4).                          01641000
016420     IF WS-SUBADD IS EQUAL TO ZEROS                               01642000
016430         ADD +1 TO WS-SUBADD                                      01643000
016440         MOVE RPREL-INST2 TO WS-ADD-INST (WS-SUBADD)              01644000
016450         MOVE RPREL-PRODCODE2 TO WS-ADD-PRODCD (WS-SUBADD)        01645000
016460         MOVE RPREL-ACCOUNT2 TO WS-ADD-ACCOUNT (WS-SUBADD)        01646000
016470         MOVE RPREL-PRODCODE2 TO WS-PRODCODE-SEARCH               01647000
016480         PERFORM SEARCH-PRODUCT-CODES                             01648000
016490         ADD +1 TO WS-NUMOFPRODUCTS                               01649000
016500         GO TO CR-GET-ADDON-INFO.                                 01650000
016510     MOVE RPREL-PRODCODE2 TO WS-PRODCODE-SEARCH.                  01651000
016520     PERFORM SEARCH-PRODUCT-CODES.                                01652000
016530     IF WS-FOUND-PRODCODE IS EQUAL TO 'N'                         01653000
016540         ADD +1 TO WS-NUMOFPRODUCTS.                              01654000
016550     ADD +1 TO WS-SUBADD.                                         01655000
016560     IF WS-SUBADD IS GREATER THAN WS-ADDON-MAX                    01656000
016570         GO TO AR-0032.                                           01657000
016580     MOVE RPREL-INST2 TO WS-ADD-INST (WS-SUBADD).                 01658000
016590     MOVE RPREL-PRODCODE2 TO WS-ADD-PRODCD (WS-SUBADD).           01659000
016600     MOVE RPREL-ACCOUNT2 TO WS-ADD-ACCOUNT (WS-SUBADD).           01660000
016610     GO TO CR-GET-ADDON-INFO.                                     01661000
P0101  CR-PRIM-RELCODE.                                                 01661100
P0101      MOVE SPACES TO WS-PRIMRELCD-OPTION.                          01661200
P0101      MOVE RPRF21-REL TO WS-RPW007-RELNBR.                         01661300
P0101      PERFORM VALIDATE-PRIM-RELCD.                                 01661400
P0101      IF WS-PRIMRELCD-ERROR IS EQUAL TO 'Y'                        01661500
P0101          GO TO CR-END.                                            01661600
016620 CR-GET-RCIF-INFO.                                                01662000
P0101      MOVE SPACE TO WS-RF21-RETURN.                                01663000
P0101      MOVE SPACES TO WS-LAST-PRODCD.                               01663790
P0101      MOVE SPACES TO WS-RPMIM2023PRODCD.                           01664580
P0101      MOVE SPACES TO WS-FUNCTION.                                  01665370
016670     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     01667000
016680         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        01668000
016690         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    01669000
016700     MOVE 'N' TO RPRF21-FUNC.                                     01670000
016710     CALL SR-060CALLNAME USING                                    01671000
016720         WS-LINKRCIF.                                             01672000
016730     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     01673000
016740         MOVE RPRF21-FUNCTION TO WS-FUNCTION                      01674000
016750         GO TO CR-EXIT.                                           01675000
016760     MOVE RPRF21-RETURN TO WS-RF21-RETURN.                        01676000
016770     MOVE RPRF21-RETURNED-OBJECT TO WS-CAC-TABLE.                 01677000
016780     MOVE ZEROS TO WS-SUB3.                                       01678000
016790 CR-CHECK-PRODCODE.                                               01679000
016800     ADD +1 TO WS-SUB3.                                           01680000
016810     IF WS-SUB3 IS GREATER THAN WS-CAC-MAX                        01681000
016820         GO TO CR-CHECK-MORE-SEC.                                 01682000
016830     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO SPACES                01683000
016840         GO TO CR-END.                                            01684000
016850     IF WS-CAC-ACCT (WS-SUB3) IS EQUAL TO SPACES                  01685000
016860         GO TO CR-CHECK-PRODCODE.                                 01686000
016870     IF RPQUA-ADDON-ACCTS IS GREATER THAN ZEROS                   01687000
016880         PERFORM SEARCH-ADDON-ACCOUNTS.                           01688000
016890     IF WS-ACCOUNT-FOUND IS EQUAL TO 'Y'                          01689000
016900         GO TO CR-CHECK-PRODCODE.                                 01690000
016910     MOVE WS-CAC-INST (WS-SUB3) TO WS-SUBINST.                    01691000
016920     IF WS-2024-EXISTS (WS-SUBINST) IS NOT EQUAL TO 'Y'           01692000
016930         GO TO CR-CHECK-PRODCODE.                                 01693000
016940     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-LAST-PRODCD        01694000
016950         GO TO CR-VALID-SECACCT.                                  01695000
016960     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-RPMIM2023PRODCD    01696000
016970         GO TO CR-CHECK-PRODCODE.                                 01697000
016980     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-RPMIM2023PRODCD.          01698000
016990     PERFORM SEARCH-RPS-2023.                                     01699000
017000     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         01700000
017010         GO TO CR-CHECK-PRODCODE.                                 01701000
017020     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-LAST-PRODCD.              01702000
017030     IF WS-PRODUCT-FOUND IS EQUAL TO 'Y'                          01703000
017040         GO TO CR-VALID-SECACCT.                                  01704000
017050     ADD +1 TO WS-NUMOFPRODUCTS.                                  01705000
017060 CR-VALID-SECACCT.                                                01706000
017070     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO RPQUA-PRODCODE        01707000
017080         AND WS-CAC-ACCT (WS-SUB3) IS EQUAL TO RPQUA-ACCOUNT      01708000
017090         AND WS-CAC-INST (WS-SUB3) IS EQUAL TO RPQUA-INST         01709000
017100         ADD +1 TO WS-NUMOFACCOUNTS                               01710000
017110         GO TO CR-CHECK-PRODCODE.                                 01711000
017120     ADD +1 TO WS-NUMOFACCOUNTS.                                  01712000
017130     ADD +1 TO WS-SUB4.                                           01713000
017140     IF WS-SUB4 IS GREATER THAN WS-SECONDARY-MAX                  01714000
017150         GO TO AR-0020.                                           01715000
017160* SAVE ACCOUNT TO CHECK FOR DUPLICATE                             01716000
017170     PERFORM GM-SEAC-SAVE-SECONDARY.                              01717000
017180     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SEC-PRODCD (WS-SUB4).     01718000
017190     MOVE WS-2023-INTAPPL (INDX-2023) TO WS-SEC-APPL (WS-SUB4).   01719000
017200     MOVE WS-2023-RPOPTION (INDX-2023) TO WS-SEC-RPOPT (WS-SUB4). 01720000
017210     MOVE ZEROS TO WS-SEC-BRANCH (WS-SUB4).                       01721000
017220     MOVE ZEROS TO WS-SEC-TYPE (WS-SUB4).                         01722000
017230     MOVE WS-CAC-INST (WS-SUB3) TO WS-SEC-INST (WS-SUB4).         01723000
017240     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SEC-ACCT (WS-SUB4).         01724000
017250     MOVE WS-CAC-RELNBR (WS-SUB3) TO WS-SEC-RELNBR (WS-SUB4).     01725000
P0101      MOVE ZEROS TO WS-SEC-PRIMCUSTRELNBR (WS-SUB4).               01725500
017260     MOVE SPACE TO WS-SEC-ACTREC (WS-SUB4).                       01726000
017270     MOVE SPACE TO WS-SEC-QUAL (WS-SUB4).                         01727000
017280     MOVE 'N' TO WS-SEC-ADDON (WS-SUB4).                          01728000
017290     GO TO CR-CHECK-PRODCODE.                                     01729000
017300 CR-CHECK-MORE-SEC.                                               01730000
017310     IF WS-RF21-RETURN IS NOT EQUAL TO 'M'                        01731000
017320         GO TO CR-END.                                            01732000
P0101      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     01733000
P0101          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        01733090
P0101          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST     01733180
P0101      ELSE                                                         01733270
P0101          MOVE WS-CAC-INST (WS-CAC-MAX) TO RPRF21-BASE-ACCT-INST.  01733360
017340     MOVE WS-CAC-PRODCD (WS-CAC-MAX) TO RPRF21-BASE-ACCT-PRODCODE.01734000
017350     MOVE WS-CAC-ACCT (WS-CAC-MAX) TO RPRF21-BASE-ACCT.           01735000
017360     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          01736000
017370     GO TO CR-GET-RCIF-INFO.                                      01737000
017380 CR-END.                                                          01738000
017390     PERFORM GET-MY-SECONDARY-ACCOUNTS.                           01739000
017400     IF WS-SECCUSTOVERFLOW IS EQUAL TO 'Y'                        01740000
017410         GO TO AR-0051.                                           01741000
017420 CR-EXIT.                                                         01742000
017430     EXIT.                                                        01743000
017440******************************************************************01744000
017450 SEARCH-ADDON-ACCOUNTS SECTION.                                   01745000
017460 SAA-START.                                                       01746000
017470     MOVE 'N' TO WS-ACCOUNT-FOUND.                                01747000
017480     MOVE 'N' TO WS-PRODUCT-FOUND.                                01748000
017490     MOVE ZEROS TO WS-SUBADD.                                     01749000
017500 SAA-NEXT.                                                        01750000
017510     ADD +1 TO WS-SUBADD.                                         01751000
017520     IF WS-SUBADD IS GREATER THAN WS-ADDON-MAX                    01752000
017530         GO TO SAA-EXIT.                                          01753000
017540     IF WS-ADD-PRODCD (WS-SUBADD) IS EQUAL TO SPACES              01754000
017550         GO TO SAA-EXIT.                                          01755000
017560     IF WS-PRODUCT-FOUND IS EQUAL TO 'Y'                          01756000
017570         AND WS-ACCOUNT-FOUND IS EQUAL TO 'Y'                     01757000
017580         GO TO SAA-EXIT.                                          01758000
017590     IF WS-ADD-PRODCD (WS-SUBADD) IS EQUAL TO                     01759000
017600         WS-CAC-PRODCD (WS-SUB3)                                  01760000
017610         MOVE 'Y' TO WS-PRODUCT-FOUND.                            01761000
017620     IF WS-ADD-PRODCD (WS-SUBADD) IS EQUAL TO                     01762000
017630         WS-CAC-PRODCD (WS-SUB3)                                  01763000
017640         AND WS-ADD-ACCOUNT (WS-SUBADD) IS EQUAL TO               01764000
017650             WS-CAC-ACCT (WS-SUB3)                                01765000
017660         AND WS-ADD-INST (WS-SUBADD) IS EQUAL TO                  01766000
017670             WS-CAC-INST (WS-SUB3)                                01767000
017680         MOVE 'Y' TO WS-ACCOUNT-FOUND.                            01768000
017690     GO TO SAA-NEXT.                                              01769000
017700 SAA-EXIT.                                                        01770000
017710     EXIT.                                                        01771000
017720******************************************************************01772000
017730 DELETE-ADDON-ACCOUNTS SECTION.                                   01773000
017740 DAA-START.                                                       01774000
017750     MOVE RPQUA-INST TO RPREL-INST.                               01775000
017760     MOVE RPQUA-PRODCODE TO RPREL-PRODCODE.                       01776000
017770     MOVE RPQUA-ACCOUNT TO RPREL-ACCOUNT.                         01777000
017780     MOVE RPQUA-MODEL TO RPREL-MODEL.                             01778000
017790     MOVE ZEROS TO RPREL-INST2.                                   01779000
017800     MOVE SPACES TO RPREL-PRODCODE2.                              01780000
017810     MOVE SPACES TO RPREL-ACCOUNT2.                               01781000
017820 DAA-READ-NEXT.                                                   01782000
017830     MOVE 'N  ' TO SR-APIFUNC.                                    01783000
017840     PERFORM CALL-RPS-REL.                                        01784000
017850     IF WS-FUNCTION IS EQUAL TO 'E'                               01785000
017860         GO TO DAA-EXIT.                                          01786000
017870     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01787000
017880         GO TO AR-0033.                                           01788000
017890     IF RPQUA-GRP-KEY IS NOT EQUAL TO RPREL-ACCT1-GRP             01789000
017900         GO TO DAA-EXIT.                                          01790000
017910     IF RPREL-ACCT-STATUS IS NOT EQUAL TO 'U'                     01791000
017920         AND RPREL-ACCT-STATUS IS NOT EQUAL TO 'Q'                01792000
017930         GO TO DAA-READ-NEXT.                                     01793000
017940     MOVE 'D  ' TO SR-APIFUNC.                                    01794000
017950     PERFORM CALL-RPS-REL.                                        01795000
017960     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01796000
017970         GO TO AR-0034.                                           01797000
017980     GO TO DAA-READ-NEXT.                                         01798000
017990 DAA-EXIT.                                                        01799000
018000     EXIT.                                                        01800000
018010******************************************************************01801000
018020 DELETE-CASH-REWARD-ACCOUNT SECTION.                              01802000
018030 DCRA-START.                                                      01803000
018040     MOVE RPQUA-INST TO RPCRW-INST.                               01804000
018050     MOVE RPQUA-PRODCODE TO RPCRW-PRODCODE.                       01805000
018060     MOVE RPQUA-ACCOUNT TO RPCRW-ACCOUNT.                         01806000
018070     MOVE RPQUA-MODEL TO RPCRW-MODEL.                             01807000
018080     MOVE RPQUA-CRW-INST TO RPCRW-INST2.                          01808000
018090     MOVE RPQUA-CRW-PRODCODE TO RPCRW-PRODCODE2.                  01809000
018100     MOVE RPQUA-CRW-ACCOUNT TO RPCRW-ACCOUNT2.                    01810000
018110     MOVE 'R  ' TO SR-APIFUNC.                                    01811000
018120     PERFORM CALL-RPS-CRW.                                        01812000
018130     IF WS-FUNCTION IS EQUAL TO 'N'                               01813000
018140         GO TO DCRA-EXIT.                                         01814000
018150     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01815000
018160         GO TO AR-0037.                                           01816000
018170     MOVE 'D  ' TO SR-APIFUNC.                                    01817000
018180     PERFORM CALL-RPS-CRW.                                        01818000
018190     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01819000
018200         GO TO AR-0038.                                           01820000
018210 DCRA-EXIT.                                                       01821000
018220     EXIT.                                                        01822000
018230******************************************************************01823000
018240 UPDATE-CASH-REWARD-ACCOUNT SECTION.                              01824000
018250 UCRA-START.                                                      01825000
018260     MOVE RPQUA-INST TO RPCRW-INST.                               01826000
018270     MOVE RPQUA-PRODCODE TO RPCRW-PRODCODE.                       01827000
018280     MOVE RPQUA-ACCOUNT TO RPCRW-ACCOUNT.                         01828000
018290     MOVE RPQUA-MODEL TO RPCRW-MODEL.                             01829000
018300     MOVE RPQUA-CRW-INST TO RPCRW-INST2.                          01830000
018310     MOVE RPQUA-CRW-PRODCODE TO RPCRW-PRODCODE2.                  01831000
018320     MOVE RPQUA-CRW-ACCOUNT TO RPCRW-ACCOUNT2.                    01832000
018330     MOVE 'R  ' TO SR-APIFUNC.                                    01833000
018340     PERFORM CALL-RPS-CRW.                                        01834000
018350     IF WS-FUNCTION IS EQUAL TO 'N'                               01835000
018360         GO TO UCRA-EXIT.                                         01836000
018370     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01837000
018380         GO TO AR-0049.                                           01838000
018390     MOVE RPBNK-CURDT TO RPCRW-DATE-OPEN.                         01839000
018400     IF RPCRW-NXTDATE IS NOT LESS THAN RPBNK-CURDT                01840000
018410         GO TO UCRA-REWRITE.                                      01841000
018420     MOVE RPCRW-NXTDATE TO WS-CRW-OLDNXTDT.                       01842000
018430 UCRA-CALC-NEXT-DATE.                                             01843000
018440     MOVE RPCRW-NXTDATE TO WS-CURDTYYYYMMDD.                      01844000
018450     MOVE WS-CURDTMM TO WS-DATEMM.                                01845000
018460     MOVE WS-CURDTDD TO WS-DATEDD.                                01846000
018470     MOVE WS-CURDTYYYY TO WS-DATEYYYY.                            01847000
018480     MOVE WS-DATEMMDDYYYY TO SR-FROMCAL.                          01848000
018490     PERFORM JULIAN-365.                                          01849000
018500     MOVE SR-TOJUL TO SR-CDATE.                                   01850000
018510     MOVE RPCRW-FREQ TO SR-CFREQ.                                 01851000
018520     MOVE RPCRW-TERM TO SR-CTERM.                                 01852000
018530     MOVE ZEROS TO SR-CDAYS.                                      01853000
018540     MOVE RPCRW-DAY TO SR-CDAY (1).                               01854000
018550     PERFORM NEXT-CYCLE-365.                                      01855000
018560     MOVE SR-CDATE TO SR-FROMJUL.                                 01856000
018570     PERFORM CALENDAR-365.                                        01857000
018580     MOVE SR-TOCAL TO WS-DATEMMDDYYYY.                            01858000
018590     MOVE WS-DATEMM TO WS-CURDTMM.                                01859000
018600     MOVE WS-DATEDD TO WS-CURDTDD.                                01860000
018610     MOVE WS-DATEYYYY TO WS-CURDTYYYY.                            01861000
018620     MOVE WS-CURDTYYYYMMDD TO RPCRW-NXTDATE.                      01862000
018630     MOVE RPCRW-NXTDATE TO WS-CRW-NEWNXTDT.                       01863000
018640     IF RPCRW-NXTDATE IS LESS THAN RPBNK-CURDT                    01864000
018650         GO TO UCRA-CALC-NEXT-DATE.                               01865000
018660 UCRA-REWRITE.                                                    01866000
018670     MOVE 'W  ' TO SR-APIFUNC.                                    01867000
018680     PERFORM CALL-RPS-CRW.                                        01868000
018690     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01869000
018700         GO TO AR-0050.                                           01870000
018710 UCRA-EXIT.                                                       01871000
018720     EXIT.                                                        01872000
018730******************************************************************01873000
018740 GET-BALANCE SECTION.                                             01874000
018750 GB-START.                                                        01875000
018760     MOVE ZEROS TO WS-WORK-BALANCE.                               01876000
018770     IF WS-WORK-COMBBALCD IS EQUAL TO ZEROS                       01877000
018780         OR WS-WORK-COMBBALCD IS GREATER THAN 20                  01878000
018790         GO TO GB-EXIT.                                           01879000
018800     MOVE RPINF00-BAL (WS-WORK-COMBBALCD) TO WS-WORK-BALANCE.     01880000
018810 GB-EXIT.                                                         01881000
018820     EXIT.                                                        01882000
018830******************************************************************01883000
018840 VALIDATE-MODEL-REQUIREMENTS SECTION.                             01884000
018850 VMR-START.                                                       01885000
018860     MOVE 'Y' TO WS-MODEL-REQS.                                   01886000
018870     SET INDX-7102 TO +1.                                         01887000
018880 VMR-FIND-7102S.                                                  01888000
018890     IF INDX-7102 IS GREATER THAN WS-RPMIM7102MAXSIZE             01889000
018900         GO TO VMR-EXIT.                                          01890000
018910     IF WS-7102-MODEL (INDX-7102) IS GREATER THAN RPQUA-MODEL     01891000
018920         GO TO VMR-EXIT.                                          01892000
018930     IF WS-7102-MODEL (INDX-7102) IS EQUAL TO RPQUA-MODEL         01893000
018940         GO TO VMR-TEST-7102S.                                    01894000
018950     SET INDX-7102 UP BY +1.                                      01895000
018960     GO TO VMR-FIND-7102S.                                        01896000
018970 VMR-TEST-7102S.                                                  01897000
018980     IF WS-7102-PRODCODE (INDX-7102) IS EQUAL TO SPACES           01898000
018990         AND WS-7102-TYPE (INDX-7102) IS EQUAL TO ZEROS           01899000
019000         GO TO VMR-CONTINUE.                                      01900000
019010     MOVE WS-7102-MODEL (INDX-7102) TO MIM-7102KMODEL.            01901000
019020     MOVE WS-7102-PRODCODE (INDX-7102) TO MIM-7102KPRODCODE.      01902000
019030     MOVE WS-7102-TYPE (INDX-7102) TO MIM-7102KACCTTYPE.          01903000
019040     MOVE WS-RPMIM7102 (INDX-7102) TO MIM-REC7102.                01904000
019050     IF MIM-7102MINACCTS-Q IS NOT EQUAL TO 'B'                    01905000
019060         AND MIM-7102MINACCTS-Q IS NOT EQUAL TO 'E'               01906000
019070         AND MIM-7102MAXSECACCTS-Q IS NOT EQUAL TO 'B'            01907000
019080         AND MIM-7102MAXSECACCTS-Q IS NOT EQUAL TO 'E'            01908000
019090         GO TO VMR-CONTINUE.                                      01909000
019100     IF MIM-7102MINACCTS-Q IS NOT EQUAL TO 'B'                    01910000
019110         AND MIM-7102MINACCTS-Q IS NOT EQUAL TO 'E'               01911000
019120         MOVE ZEROS TO WS-MINACCTS                                01912000
019130     ELSE                                                         01913000
019140         MOVE MIM-7102MINACCTS TO WS-MINACCTS.                    01914000
019150     IF MIM-7102MAXSECACCTS-Q IS NOT EQUAL TO 'B'                 01915000
019160         AND MIM-7102MAXSECACCTS-Q IS NOT EQUAL TO 'E'            01916000
019170         MOVE 999 TO WS-MAXSECACCTS                               01917000
019180     ELSE                                                         01918000
019190         MOVE MIM-7102MAXSECACCTS TO WS-MAXSECACCTS.              01919000
019200     IF MIM-7102KACCTTYPE IS EQUAL TO ZEROS                       01920000
019210         PERFORM VALIDATE-MINMAX-PRODCD                           01921000
019220     ELSE                                                         01922000
019230         PERFORM VALIDATE-MINMAX-TYPEPROD.                        01923000
019240 VMR-CONTINUE.                                                    01924000
019250     IF WS-MODEL-REQS IS EQUAL TO 'N'                             01925000
019260         GO TO VMR-EXIT.                                          01926000
019270     SET INDX-7102 UP BY +1.                                      01927000
019280     GO TO VMR-FIND-7102S.                                        01928000
019290 VMR-EXIT.                                                        01929000
019300     EXIT.                                                        01930000
019310******************************************************************01931000
019320 VALIDATE-MINMAX-PRODCD SECTION.                                  01932000
019330 VMP-START.                                                       01933000
019340     MOVE ZEROS TO WS-SUBSEC.                                     01934000
019350 VMP-NEXT.                                                        01935000
019360     ADD +1 TO WS-SUBSEC.                                         01936000
019370     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                01937000
019380         GO TO VMP-TEST.                                          01938000
019390     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                01939000
019400         GO TO VMP-TEST.                                          01940000
019410     IF WS-SEC-PRODCD (WS-SUBSEC) IS NOT EQUAL TO                 01941000
019420         MIM-7102KPRODCODE                                        01942000
019430         GO TO VMP-NEXT.                                          01943000
019440     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   01944000
019450         GO TO VMP-NEXT.                                          01945000
019460** MOVE AN 'M' SEC-QUAL FOR ACCOUNT THAT SATISFY THE MINIMUM      01946000
019470** REQUIREMENT SO THOSE ACCOUNTS CAN BE COUNTED FIRST WHEN        01947000
019480** TESTING MINIMUM AND MAXIMUM 7101 ACOUNTS                       01948000
019490     IF WS-MAXSECACCTS IS EQUAL TO ZEROS                          01949000
019500         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01950000
019510         MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC)                    01951000
019520         MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC)                    01952000
019530         GO TO VMP-NEXT                                           01953000
019540     ELSE                                                         01954000
019550         SUBTRACT +1 FROM WS-MAXSECACCTS.                         01955000
019560     IF WS-MINACCTS IS GREATER THAN ZEROS                         01956000
019570         MOVE 'M' TO WS-SEC-QUAL (WS-SUBSEC)                      01957000
019580         SUBTRACT +1 FROM WS-MINACCTS.                            01958000
019590     GO TO VMP-NEXT.                                              01959000
019600 VMP-TEST.                                                        01960000
019610     IF WS-MINACCTS IS GREATER THAN ZEROS                         01961000
019620         AND WS-PRIM-PRODCD IS EQUAL TO MIM-7102KPRODCODE         01962000
019630         SUBTRACT +1 FROM WS-MINACCTS.                            01963000
019640     IF WS-MINACCTS IS GREATER THAN ZEROS                         01964000
019650         MOVE 'N' TO WS-MODEL-REQS.                               01965000
019660 VMP-EXIT.                                                        01966000
019670     EXIT.                                                        01967000
019680******************************************************************01968000
019690 VALIDATE-MINMAX-TYPEPROD SECTION.                                01969000
019700 VMT-START.                                                       01970000
019710     MOVE ZEROS TO WS-SUBSEC.                                     01971000
019720 VMT-NEXT.                                                        01972000
019730     ADD +1 TO WS-SUBSEC.                                         01973000
019740     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                01974000
019750         GO TO VMT-TEST.                                          01975000
019760     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                01976000
019770         GO TO VMT-TEST.                                          01977000
019780     IF WS-SEC-PRODCD (WS-SUBSEC) IS NOT EQUAL TO                 01978000
019790             MIM-7102KPRODCODE                                    01979000
019800         OR WS-SEC-TYPE (WS-SUBSEC) IS NOT EQUAL TO               01980000
019810             MIM-7102KACCTTYPE                                    01981000
019820         GO TO VMT-NEXT.                                          01982000
019830     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   01983000
019840         GO TO VMT-NEXT.                                          01984000
019850** MOVE AN 'M' SEC-QUAL FOR ACCOUNT THAT SATISFY THE MINIMUM      01985000
019860** REQUIREMENT SO THOSE ACCOUNTS CAN BE COUNTED FIRST WHEN        01986000
019870** TESTING MINIMUM AND MAXIMUM 7101 ACOUNTS                       01987000
019880     IF WS-MAXSECACCTS IS EQUAL TO ZEROS                          01988000
019890         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01989000
019900         MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC)                    01990000
019910         MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC)                    01991000
019920         GO TO VMT-NEXT                                           01992000
019930     ELSE                                                         01993000
019940         SUBTRACT +1 FROM WS-MAXSECACCTS.                         01994000
019950     IF WS-MINACCTS IS GREATER THAN ZEROS                         01995000
019960         MOVE 'M' TO WS-SEC-QUAL (WS-SUBSEC)                      01996000
019970         SUBTRACT +1 FROM WS-MINACCTS.                            01997000
019980     GO TO VMT-NEXT.                                              01998000
019990 VMT-TEST.                                                        01999000
020000     IF WS-MINACCTS IS GREATER THAN ZEROS                         02000000
020010         AND WS-PRIM-PRODCD IS EQUAL TO MIM-7102KPRODCODE         02001000
020020         AND WS-PRIM-TYPE IS EQUAL TO MIM-7102KACCTTYPE           02002000
020030         SUBTRACT +1 FROM WS-MINACCTS.                            02003000
020040     IF WS-MINACCTS IS GREATER THAN ZEROS                         02004000
020050         MOVE 'N' TO WS-MODEL-REQS.                               02005000
020060 VMT-EXIT.                                                        02006000
020070     EXIT.                                                        02007000
020080******************************************************************02008000
020090 VALIDATE-PRODUCTS-REQUIREMENTS SECTION.                          02009000
020100 VPR-START.                                                       02010000
020110     MOVE 'Y' TO WS-MIN-MAX-PROD-REQS.                            02011000
020120     IF (MIM-7101MINPRODS-Q IS EQUAL TO 'N'                       02012000
020130         OR MIM-7101MINPRODS-Q IS EQUAL TO 'V')                   02013000
020140         AND (MIM-7101MAXPRODS-Q IS EQUAL TO 'N'                  02014000
020150         OR MIM-7101MAXPRODS-Q IS EQUAL TO 'V')                   02015000
020160         GO TO VPR-EXIT.                                          02016000
020170     MOVE SPACES TO WS-PRODCODE-TABLE.                            02017000
020180     IF MIM-7101MINPRODS-Q IS EQUAL TO 'N'                        02018000
020190         OR MIM-7101MINPRODS-Q IS EQUAL TO 'V'                    02019000
020200         MOVE ZEROS TO WS-MINPRODS                                02020000
020210     ELSE                                                         02021000
020220         MOVE MIM-7101MINPRODS TO WS-MINPRODS.                    02022000
020230     IF MIM-7101MAXPRODS-Q IS EQUAL TO 'N'                        02023000
020240         OR MIM-7101MAXPRODS-Q IS EQUAL TO 'V'                    02024000
020250         MOVE 999 TO WS-MAXPRODS                                  02025000
020260     ELSE                                                         02026000
020270         MOVE MIM-7101MAXPRODS TO WS-MAXPRODS.                    02027000
020280     MOVE WS-PRIM-PRODCD TO WS-PRODCODE-SEARCH.                   02028000
020290     PERFORM SEARCH-PRODUCT-CODES.                                02029000
020300     IF WS-MINPRODS IS GREATER THAN ZEROS                         02030000
020310         SUBTRACT +1 FROM WS-MINPRODS.                            02031000
020320     IF WS-MAXPRODS IS GREATER THAN ZEROS                         02032000
020330         SUBTRACT +1 FROM WS-MAXPRODS.                            02033000
020340     MOVE ZEROS TO WS-SUBSEC.                                     02034000
020350 VPR-NEXT.                                                        02035000
020360     ADD +1 TO WS-SUBSEC.                                         02036000
020370     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02037000
020380         GO TO VPR-TEST.                                          02038000
020390     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02039000
020400         GO TO VPR-TEST.                                          02040000
020410     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   02041000
020420         GO TO VPR-NEXT.                                          02042000
020430     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO WS-PRODCODE-SEARCH.        02043000
020440     PERFORM SEARCH-PRODUCT-CODES.                                02044000
020450     IF WS-FOUND-PRODCODE IS EQUAL TO 'Y'                         02045000
020460         GO TO VPR-NEXT.                                          02046000
020470     IF WS-MAXPRODS IS EQUAL TO ZEROS                             02047000
020480         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02048000
020490         MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC)                    02049000
020500         MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC)                    02050000
020510         GO TO VPR-NEXT                                           02051000
020520     ELSE                                                         02052000
020530         SUBTRACT +1 FROM WS-MAXPRODS.                            02053000
020540     IF WS-MINPRODS IS GREATER THAN ZEROS                         02054000
020550         SUBTRACT +1 FROM WS-MINPRODS.                            02055000
020560     GO TO VPR-NEXT.                                              02056000
020570 VPR-TEST.                                                        02057000
020580     IF WS-MINPRODS IS GREATER THAN ZEROS                         02058000
020590         MOVE 'N' TO WS-MIN-MAX-PROD-REQS.                        02059000
020600 VPR-EXIT.                                                        02060000
020610     EXIT.                                                        02061000
020620******************************************************************02062000
020630 VALIDATE-ACCOUNTS-REQUIREMENTS SECTION.                          02063000
020640 VAR-START.                                                       02064000
020650     MOVE 'Y' TO WS-MIN-MAX-ACCT-REQS.                            02065000
020660     IF (MIM-7101MINACCTS-Q IS EQUAL TO 'N'                       02066000
020670         OR MIM-7101MINACCTS-Q IS EQUAL TO 'V')                   02067000
020680         AND (MIM-7101MAXACCTS-Q IS EQUAL TO 'N'                  02068000
020690         OR MIM-7101MAXACCTS-Q IS EQUAL TO 'V')                   02069000
020700         GO TO VAR-EXIT.                                          02070000
020710     IF MIM-7101MINACCTS-Q IS EQUAL TO 'N'                        02071000
020720         OR MIM-7101MINACCTS-Q IS EQUAL TO 'V'                    02072000
020730         MOVE ZEROS TO WS-MINACCTS-2                              02073000
020740     ELSE                                                         02074000
020750         MOVE MIM-7101MINACCTS TO WS-MINACCTS-2.                  02075000
020760     IF MIM-7101MAXACCTS-Q IS EQUAL TO 'N'                        02076000
020770         OR MIM-7101MAXACCTS-Q IS EQUAL TO 'V'                    02077000
020780         MOVE 999 TO WS-MAXACCTS-2                                02078000
020790     ELSE                                                         02079000
020800         MOVE MIM-7101MAXACCTS TO WS-MAXACCTS-2.                  02080000
020810***  SUBTRACT 1 FROM COUNTS TO ACCOUNT FOR PRIMARY ACCOUNT        02081000
020820     IF WS-MINACCTS-2 IS GREATER THAN ZEROS                       02082000
020830         SUBTRACT +1 FROM WS-MINACCTS-2.                          02083000
020840     IF WS-MAXACCTS-2 IS GREATER THAN ZEROS                       02084000
020850         SUBTRACT +1 FROM WS-MAXACCTS-2.                          02085000
020860     MOVE ZEROS TO WS-SUBSEC.                                     02086000
020870 VAR-FIRST.                                                       02087000
020880     ADD +1 TO WS-SUBSEC.                                         02088000
020890     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02089000
020900         GO TO VAR-SECOND.                                        02090000
020910     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02091000
020920         GO TO VAR-SECOND.                                        02092000
020930     IF WS-SEC-QUAL (WS-SUBSEC) IS NOT EQUAL TO 'M'               02093000
020940         GO TO VAR-FIRST.                                         02094000
020950     IF WS-MINACCTS-2 IS GREATER THAN ZEROS                       02095000
020960         SUBTRACT +1 FROM WS-MINACCTS-2.                          02096000
020970     IF WS-MAXACCTS-2 IS EQUAL TO ZEROS                           02097000
020980         MOVE 'N' TO WS-MIN-MAX-ACCT-REQS                         02098000
020990         GO TO VAR-EXIT                                           02099000
021000     ELSE                                                         02100000
021010         SUBTRACT +1 FROM WS-MAXACCTS-2.                          02101000
021020     GO TO VAR-FIRST.                                             02102000
021030 VAR-SECOND.                                                      02103000
021040     MOVE ZEROS TO WS-SUBSEC.                                     02104000
021050 VAR-NEXT.                                                        02105000
021060     ADD +1 TO WS-SUBSEC.                                         02106000
021070     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02107000
021080         GO TO VAR-TEST.                                          02108000
021090     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02109000
021100         GO TO VAR-TEST.                                          02110000
021110     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   02111000
021120         GO TO VAR-NEXT.                                          02112000
021130     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'M'                   02113000
021140         MOVE 'Y' TO WS-SEC-QUAL (WS-SUBSEC)                      02114000
021150         GO TO VAR-NEXT.                                          02115000
021160     IF WS-MAXACCTS-2 IS EQUAL TO ZEROS                           02116000
021170         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02117000
021180         MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC)                    02118000
021190         MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC)                    02119000
021200         GO TO VAR-NEXT                                           02120000
021210     ELSE                                                         02121000
021220         SUBTRACT +1 FROM WS-MAXACCTS-2.                          02122000
021230     IF WS-MINACCTS-2 IS GREATER THAN ZEROS                       02123000
021240         SUBTRACT +1 FROM WS-MINACCTS-2.                          02124000
021250     GO TO VAR-NEXT.                                              02125000
021260 VAR-TEST.                                                        02126000
021270     IF WS-MINACCTS-2 IS GREATER THAN ZEROS                       02127000
021280         MOVE 'N' TO WS-MIN-MAX-ACCT-REQS.                        02128000
021290 VAR-EXIT.                                                        02129000
021300     EXIT.                                                        02130000
021310******************************************************************02131000
021320 VALIDATE-PRODUCT-GROUPS SECTION.                                 02132000
021330 VPG-START.                                                       02133000
021340     MOVE 'Y' TO WS-PROD-GROUPS-REQS.                             02134000
021350     IF (MIM-7101PG1-Q IS EQUAL TO 'N'                            02135000
021360         OR MIM-7101PG1-Q IS EQUAL TO 'V')                        02136000
021370         AND (MIM-7101PG2-Q IS EQUAL TO 'N'                       02137000
021380         OR MIM-7101PG2-Q IS EQUAL TO 'V')                        02138000
021390         AND (MIM-7101PG3-Q IS EQUAL TO 'N'                       02139000
021400         OR MIM-7101PG3-Q IS EQUAL TO 'V')                        02140000
021410         AND (MIM-7101PG4-Q IS EQUAL TO 'N'                       02141000
021420         OR MIM-7101PG4-Q IS EQUAL TO 'V')                        02142000
021430         AND (MIM-7101PG5-Q IS EQUAL TO 'N'                       02143000
021440         OR MIM-7101PG5-Q IS EQUAL TO 'V')                        02144000
021450         GO TO VPG-EXIT.                                          02145000
021460     MOVE ZEROS TO WS-SUBPROD.                                    02146000
021470     MOVE +1 TO WS-MINACCTS-PG.                                   02147000
021480     MOVE ZEROS TO WS-SUBSEC.                                     02148000
021490 VPG-ADD-NON-PG-ACCTS.                                            02149000
021500     ADD +1 TO WS-SUBSEC.                                         02150000
021510     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02151000
021520         GO TO VPG-NEXT-GROUP.                                    02152000
021530     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   02153000
021540         OR WS-SEC-PROD-GROUP (WS-SUBSEC) IS NOT EQUAL TO ZEROS   02154000
021550         GO TO VPG-ADD-NON-PG-ACCTS.                              02155000
021560     ADD +1 TO WS-MINACCTS-PG.                                    02156000
021570     IF WS-SUBSEC IS NOT GREATER THAN WS-SECONDARY-MAX            02157000
021580         GO TO VPG-ADD-NON-PG-ACCTS.                              02158000
021590 VPG-NEXT-GROUP.                                                  02159000
021600     ADD +1 TO WS-SUBPROD.                                        02160000
021610     IF WS-SUBPROD IS GREATER THAN +5                             02161000
021620         GO TO VPG-MINACCT-MODEL-REQ.                             02162000
021630     IF MIM-7101PG-Q (WS-SUBPROD) IS EQUAL TO 'N'                 02163000
021640         OR MIM-7101PG-Q (WS-SUBPROD) IS EQUAL TO 'V'             02164000
021650         GO TO VPG-NEXT-GROUP.                                    02165000
021660     INITIALIZE WS-PGSEARCH-TABLE.                                02166000
021670     MOVE MIM-7101PGMIN (WS-SUBPROD) TO WS-MINPROD-GRP.           02167000
021680     MOVE MIM-7101PGMAX (WS-SUBPROD) TO WS-MAXPROD-GRP.           02168000
021690     IF WS-MAXPROD-GRP IS EQUAL TO ZEROS                          02169000
021700         MOVE +999 TO WS-MAXPROD-GRP.                             02170000
021710     IF WS-PRIM-PROD-GROUP IS EQUAL TO WS-SUBPROD                 02171000
021720         AND WS-PRIM-7102 IS EQUAL TO 'B'                         02172000
021730         MOVE WS-PRIM-PRODCD TO WS-PG-PRODCD (1)                  02173000
021740         MOVE WS-PRIM-TYPE TO WS-PG-TYPE (1)                      02174000
021750         MOVE WS-PRIM-7102 TO WS-PG-7102 (1).                     02175000
021760     IF WS-PRIM-PROD-GROUP IS EQUAL TO WS-SUBPROD                 02176000
021770         AND WS-PRIM-7102 IS EQUAL TO 'P'                         02177000
021780         MOVE WS-PRIM-PRODCD TO WS-PG-PRODCD (1)                  02178000
021790         MOVE ZEROS TO WS-PG-TYPE (1)                             02179000
021800         MOVE WS-PRIM-7102 TO WS-PG-7102 (1).                     02180000
021810     IF WS-PRIM-PROD-GROUP IS EQUAL TO WS-SUBPROD                 02181000
021820         AND WS-PRIM-7102 IS EQUAL TO 'M'                         02182000
021830         MOVE SPACES TO WS-PG-PRODCD (1)                          02183000
021840         MOVE ZEROS TO WS-PG-TYPE (1)                             02184000
021850         MOVE WS-PRIM-7102 TO WS-PG-7102 (1).                     02185000
021860     IF WS-PRIM-PROD-GROUP IS EQUAL TO WS-SUBPROD                 02186000
021870         IF WS-MINPROD-GRP IS GREATER THAN ZEROS                  02187000
021880             SUBTRACT +1 FROM WS-MINPROD-GRP                      02188000
021890         END-IF                                                   02189000
021900         IF WS-MAXPROD-GRP IS GREATER THAN ZEROS                  02190000
021910             SUBTRACT +1 FROM WS-MAXPROD-GRP                      02191000
021920         END-IF                                                   02192000
021930     END-IF.                                                      02193000
021940 VPG-SECOND.                                                      02194000
021950     MOVE ZEROS TO WS-SUBSEC.                                     02195000
021960 VPG-NEXT.                                                        02196000
021970     ADD +1 TO WS-SUBSEC.                                         02197000
021980     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02198000
021990         GO TO VPG-TEST.                                          02199000
022000     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02200000
022010         GO TO VPG-TEST.                                          02201000
022020     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   02202000
022030         GO TO VPG-NEXT.                                          02203000
022040     IF WS-SEC-PROD-GROUP (WS-SUBSEC) IS NOT EQUAL TO WS-SUBPROD  02204000
022050         GO TO VPG-NEXT.                                          02205000
022060     MOVE ZEROS TO WS-SUBPG.                                      02206000
022070 VPG-SEARCH-NEXT.                                                 02207000
022080     ADD +1 TO WS-SUBPG.                                          02208000
022090     IF WS-SUBPG IS GREATER THAN WS-PGSEARCH-MAX                  02209000
022100         PERFORM VALIDATE-MINACCT-PROD-REQ                        02210000
022110         IF WS-MODEL-REQS IS EQUAL TO 'N'                         02211000
022120             GO TO VPG-EXIT                                       02212000
022130         ELSE                                                     02213000
022140             GO TO VPG-ACCT-NOT-QUAL                              02214000
022150         END-IF                                                   02215000
022160     END-IF.                                                      02216000
022170     IF WS-SEC-7102 (WS-SUBSEC) IS NOT EQUAL TO 'B'               02217000
022180         AND WS-SEC-7102 (WS-SUBSEC) IS NOT EQUAL TO 'P'          02218000
022190         AND WS-SEC-7102 (WS-SUBSEC) IS NOT EQUAL TO 'M'          02219000
022200         PERFORM VALIDATE-MINACCT-PROD-REQ                        02220000
022210         IF WS-MODEL-REQS IS EQUAL TO 'N'                         02221000
022220             GO TO VPG-EXIT                                       02222000
022230         ELSE                                                     02223000
022240             GO TO VPG-ACCT-NOT-QUAL                              02224000
022250         END-IF                                                   02225000
022260     END-IF.                                                      02226000
022270     IF WS-PG-7102 (WS-SUBPG) IS EQUAL TO SPACE                   02227000
022280         GO TO VPG-CHECK-NEW-PROD.                                02228000
022290     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'B'                   02229000
022300         AND WS-SEC-PRODCD (WS-SUBSEC) IS EQUAL TO                02230000
022310             WS-PG-PRODCD (WS-SUBPG)                              02231000
022320         AND WS-SEC-TYPE (WS-SUBSEC) IS EQUAL TO                  02232000
022330             WS-PG-TYPE (WS-SUBPG)                                02233000
022340         AND WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO                  02234000
022350             WS-PG-7102 (WS-SUBPG)                                02235000
022360         ADD +1 TO WS-MINACCTS-PG                                 02236000
022370         GO TO VPG-NEXT.                                          02237000
022380     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'P'                   02238000
022390         AND WS-SEC-PRODCD (WS-SUBSEC) IS EQUAL TO                02239000
022400             WS-PG-PRODCD (WS-SUBPG)                              02240000
022410         AND WS-PG-TYPE (WS-SUBPG) IS EQUAL TO ZEROS              02241000
022420         AND WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO                  02242000
022430             WS-PG-7102 (WS-SUBPG)                                02243000
022440         ADD +1 TO WS-MINACCTS-PG                                 02244000
022450         GO TO VPG-NEXT.                                          02245000
022460     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'M'                   02246000
022470         AND WS-PG-PRODCD (WS-SUBPG) IS EQUAL TO SPACES           02247000
022480         AND WS-PG-TYPE (WS-SUBPG) IS EQUAL TO ZEROS              02248000
022490         AND WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO                  02249000
022500             WS-PG-7102 (WS-SUBPG)                                02250000
022510         ADD +1 TO WS-MINACCTS-PG                                 02251000
022520         GO TO VPG-NEXT.                                          02252000
022530     GO TO VPG-SEARCH-NEXT.                                       02253000
022540 VPG-CHECK-NEW-PROD.                                              02254000
022550     IF WS-MAXPROD-GRP IS GREATER THAN ZEROS                      02255000
022560         GO TO VPG-ADD-NEW-PROD.                                  02256000
022570     PERFORM VALIDATE-MINACCT-PROD-REQ.                           02257000
022580     IF WS-MODEL-REQS IS EQUAL TO 'N'                             02258000
022590         GO TO VPG-EXIT.                                          02259000
022600     GO TO VPG-ACCT-NOT-QUAL.                                     02260000
022610 VPG-ADD-NEW-PROD.                                                02261000
022620     ADD +1 TO WS-MINACCTS-PG.                                    02262000
022630     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'B'                   02263000
022640         MOVE WS-SEC-PRODCD (WS-SUBSEC)                           02264000
022650             TO WS-PG-PRODCD (WS-SUBPG)                           02265000
022660         MOVE WS-SEC-TYPE (WS-SUBSEC) TO WS-PG-TYPE (WS-SUBPG)    02266000
022670         MOVE WS-SEC-7102 (WS-SUBSEC) TO WS-PG-7102 (WS-SUBPG)    02267000
022680         SUBTRACT +1 FROM WS-MAXPROD-GRP                          02268000
022690         IF WS-MINPROD-GRP IS GREATER THAN ZEROS                  02269000
022700             SUBTRACT +1 FROM WS-MINPROD-GRP                      02270000
022710         END-IF                                                   02271000
022720         GO TO VPG-NEXT                                           02272000
022730     END-IF.                                                      02273000
022740     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'P'                   02274000
022750         MOVE WS-SEC-PRODCD (WS-SUBSEC)                           02275000
022760             TO WS-PG-PRODCD (WS-SUBPG)                           02276000
022770         MOVE ZEROS TO WS-PG-TYPE (WS-SUBPG)                      02277000
022780         MOVE WS-SEC-7102 (WS-SUBSEC) TO WS-PG-7102 (WS-SUBPG)    02278000
022790         SUBTRACT +1 FROM WS-MAXPROD-GRP                          02279000
022800         IF WS-MINPROD-GRP IS GREATER THAN ZEROS                  02280000
022810             SUBTRACT +1 FROM WS-MINPROD-GRP                      02281000
022820         END-IF                                                   02282000
022830         GO TO VPG-NEXT                                           02283000
022840     END-IF.                                                      02284000
022850* WS-SEC-7102 MUST BE AN 'M'                                      02285000
022860     MOVE SPACES TO WS-PG-PRODCD (WS-SUBPG).                      02286000
022870     MOVE ZEROS TO WS-PG-TYPE (WS-SUBPG).                         02287000
022880     MOVE WS-SEC-7102 (WS-SUBSEC) TO WS-PG-7102 (WS-SUBPG).       02288000
022890     SUBTRACT +1 FROM WS-MAXPROD-GRP.                             02289000
022900     IF WS-MINPROD-GRP IS GREATER THAN ZEROS                      02290000
022910         SUBTRACT +1 FROM WS-MINPROD-GRP.                         02291000
022920     GO TO VPG-NEXT.                                              02292000
022930 VPG-ACCT-NOT-QUAL.                                               02293000
022940     MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC).                         02294000
022950     MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC).                       02295000
022960     MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC).                       02296000
022970     GO TO VPG-NEXT.                                              02297000
022980 VPG-TEST.                                                        02298000
022990     IF WS-MINPROD-GRP IS GREATER THAN ZERO                       02299000
023000         MOVE 'N' TO WS-PROD-GROUPS-REQS                          02300000
023010         GO TO VPG-EXIT.                                          02301000
023020     GO TO VPG-NEXT-GROUP.                                        02302000
023030 VPG-MINACCT-MODEL-REQ.                                           02303000
023040     IF MIM-7101MINACCTS-Q IS EQUAL TO 'N'                        02304000
023050         OR MIM-7101MINACCTS-Q IS EQUAL TO 'V'                    02305000
023060         GO TO VPG-EXIT.                                          02306000
023070     IF WS-MINACCTS-PG IS LESS THAN MIM-7101MINACCTS              02307000
023080         MOVE 'N' TO WS-MIN-MAX-ACCT-REQS.                        02308000
023090 VPG-EXIT.                                                        02309000
023100     EXIT.                                                        02310000
023110******************************************************************02311000
023120 VALIDATE-MINACCT-PROD-REQ SECTION.                               02312000
023130 VMPR-START.                                                      02313000
023140     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'B'                   02314000
023150         MOVE WS-SEC-PRODCD (WS-SUBSEC) TO WS-WORK-PRODCD         02315000
023160         MOVE WS-SEC-TYPE (WS-SUBSEC) TO WS-WORK-TYPE.            02316000
023170     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'P'                   02317000
023180         MOVE WS-SEC-PRODCD (WS-SUBSEC) TO WS-WORK-PRODCD         02318000
023190         MOVE ZEROS TO WS-WORK-TYPE.                              02319000
023200     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'M'                   02320000
023210         MOVE SPACES TO WS-WORK-PRODCD                            02321000
023220         MOVE ZEROS TO WS-WORK-TYPE.                              02322000
023230     SET INDX-7102 TO +1.                                         02323000
023240 VMPR-FIND-7102S.                                                 02324000
023250     IF INDX-7102 IS GREATER THAN WS-RPMIM7102MAXSIZE             02325000
023260         GO TO VMPR-EXIT.                                         02326000
023270     IF WS-7102-MODEL (INDX-7102) IS GREATER THAN WS-PRIM-MODEL   02327000
023280         GO TO VMPR-EXIT.                                         02328000
023290     IF WS-7102-MODEL (INDX-7102) IS EQUAL TO WS-PRIM-MODEL       02329000
023300         AND WS-7102-PRODCODE (INDX-7102)                         02330000
023310             IS EQUAL TO WS-WORK-PRODCD                           02331000
023320         AND WS-7102-TYPE (INDX-7102)                             02332000
023330             IS EQUAL TO WS-WORK-TYPE                             02333000
023340         MOVE WS-RPMIM7102 (INDX-7102) TO MIM-REC7102             02334000
023350         GO TO VMPR-TEST-7102S.                                   02335000
023360     SET INDX-7102 UP BY +1.                                      02336000
023370     GO TO VMPR-FIND-7102S.                                       02337000
023380 VMPR-TEST-7102S.                                                 02338000
023390     IF MIM-7102MINACCTS-Q IS NOT EQUAL TO 'B'                    02339000
023400         AND MIM-7102MINACCTS-Q IS NOT EQUAL TO 'E'               02340000
023410         GO TO VMPR-EXIT.                                         02341000
023420     IF MIM-7102MINACCTS IS GREATER THAN ZEROS                    02342000
023430         MOVE 'N' TO WS-MODEL-REQS.                               02343000
023440 VMPR-EXIT.                                                       02344000
023450     EXIT.                                                        02345000
023460******************************************************************02346000
023470 SEARCH-PRODUCT-CODES SECTION.                                    02347000
023480 SPC-START.                                                       02348000
023490     MOVE 'N' TO WS-FOUND-PRODCODE.                               02349000
023500     MOVE ZEROS TO WS-SUBPCODE.                                   02350000
023510 SPC-NEXT.                                                        02351000
023520     ADD +1 TO WS-SUBPCODE.                                       02352000
023530     IF WS-SUBPCODE IS GREATER THAN WS-PRODCODE-MAX               02353000
023540         GO TO AR-0044.                                           02354000
023550     IF WS-PRODCODE (WS-SUBPCODE) IS EQUAL TO SPACES              02355000
023560         MOVE WS-PRODCODE-SEARCH TO WS-PRODCODE (WS-SUBPCODE)     02356000
023570         GO TO SPC-EXIT.                                          02357000
023580     IF WS-PRODCODE-SEARCH IS EQUAL TO WS-PRODCODE (WS-SUBPCODE)  02358000
023590         MOVE 'Y' TO WS-FOUND-PRODCODE                            02359000
023600         GO TO SPC-EXIT.                                          02360000
023610     GO TO SPC-NEXT.                                              02361000
023620 SPC-EXIT.                                                        02362000
023630     EXIT.                                                        02363000
023640******************************************************************02364000
023650 ADD-NEW-RELATIONSHIP SECTION.                                    02365000
023660 ANR-START.                                                       02366000
023670     MOVE RPQUA-INST TO RPMST-INST.                               02367000
023680     MOVE RPQUA-PRODCODE TO RPMST-PRODCODE.                       02368000
023690     MOVE RPQUA-ACCOUNT TO RPMST-ACCOUNT.                         02369000
023700     MOVE RPQUA-MODEL TO RPMST-MODEL.                             02370000
023710     MOVE 'A' TO RPMST-REL-STAT.                                  02371000
023720     MOVE 'N' TO RPMST-QUAL-STAT.                                 02372000
023730     MOVE RPBNK-CURDT TO RPMST-LMNTDT.                            02373000
023740     MOVE ZEROS TO RPMST-IQUALDT.                                 02374000
023750     MOVE ZEROS TO RPMST-VQUALDT.                                 02375000
023760     MOVE WS-PRIM-SCNXT TO RPMST-SCNXTDT.                         02376000
023770     MOVE RPBNK-CURDT TO RPMST-DATE-OPENED.                       02377000
023780     MOVE WS-EXPIRATION-DATE TO RPMST-EXPIRATION-DATE.            02378000
023790     MOVE 'N' TO RPMST-SCTODAYFLAG.                               02379000
023800     MOVE RPQUA-IDNUMBER TO RPMST-IDNUMBER.                       02380000
023810     MOVE ZEROS TO RPMST-COMBBAL1.                                02381000
023820     MOVE ZEROS TO RPMST-COMBBAL2.                                02382000
023830     MOVE ZEROS TO RPMST-COMBBAL3.                                02383000
023840     MOVE ZEROS TO RPMST-COMBBAL4.                                02384000
023850     MOVE ZEROS TO RPMST-RSV-BAL2.                                02385000
023860     MOVE ZEROS TO RPMST-RSV-BAL3.                                02386000
023870     MOVE 'N' TO RPMST-OUT-FLAG.                                  02387000
023880     MOVE ZEROS TO RPMST-VF-EXP-DATE.                             02388000
023890     MOVE ZEROS TO RPMST-EXTENSIONS.                              02389000
023900     MOVE ZEROS TO RPMST-RETENTION-DAYS.                          02390000
023910     MOVE ZEROS TO RPMST-VF-MSGNBR.                               02391000
023920     MOVE ZEROS TO RPMST-IQ-MSGNBR.                               02392000
023930     MOVE ZEROS TO RPMST-CUST-NO.                                 02393000
023940     MOVE SPACES TO RPMST-RESERVED.                               02394000
023950     MOVE 'A  ' TO SR-APIFUNC.                                    02395000
023960     PERFORM CALL-RPS-MST.                                        02396000
023970     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02397000
023980         GO TO AR-0021.                                           02398000
P0101      PERFORM ADD-TRAN-MASTER.                                     02399000
024000     MOVE RPQUA-INST TO RPREL-INST.                               02400000
024010     MOVE RPQUA-PRODCODE TO RPREL-PRODCODE.                       02401000
024020     MOVE RPQUA-ACCOUNT TO RPREL-ACCOUNT.                         02402000
024030     MOVE RPQUA-MODEL TO RPREL-MODEL.                             02403000
024040     MOVE ZEROS TO RPREL-INST2.                                   02404000
024050     MOVE SPACES TO RPREL-PRODCODE2.                              02405000
024060     MOVE SPACES TO RPREL-ACCOUNT2.                               02406000
024070     MOVE 'A' TO RPREL-ACCT-STATUS.                               02407000
024080     MOVE WS-PRIM-BRANCH TO RPREL-BRANCH.                         02408000
024090     MOVE WS-PRIM-TYPE TO RPREL-ACCT-TYPE.                        02409000
024100     MOVE WS-PRIM-SCINCOPT TO RPREL-SC-INC-OPTION.                02410000
024110     MOVE WS-PRIM-RATEINCOPT TO RPREL-RATE-INC-OPTION.            02411000
024120     MOVE WS-PRIM-APPL TO RPREL-APPL.                             02412000
024130     MOVE ZEROS TO RPREL-ACCTBAL-1.                               02413000
024140     MOVE ZEROS TO RPREL-ACCTBAL-2.                               02414000
024150     MOVE ZEROS TO RPREL-PRIMEBAL.                                02415000
024160     MOVE ZEROS TO RPREL-ACCT-COMBBAL1.                           02416000
024170     MOVE ZEROS TO RPREL-ACCT-COMBBAL2.                           02417000
024180     MOVE ZEROS TO RPREL-ACCT-COMBBAL3.                           02418000
024190     MOVE ZEROS TO RPREL-ACCT-COMBBAL4.                           02419000
024200     MOVE ZEROS TO RPREL-CASH-RW-BAL.                             02420000
024210     MOVE ZEROS TO RPREL-ACCT-RATE-BAL.                           02421000
024220     MOVE ZEROS TO RPREL-SC-BAL.                                  02422000
024230     MOVE ZEROS TO RPREL-SECSVC-BAL.                              02423000
024240     MOVE ZEROS TO RPREL-DISCAMT-OVRD.                            02424000
024250     MOVE ZEROS TO RPREL-DISCPCT-OVRD.                            02425000
024260     MOVE ZEROS TO RPREL-RATEPCT-OVRD.                            02426000
024270     MOVE 'N' TO RPREL-DISCAMT-OVRD-FLAG.                         02427000
024280     MOVE 'N' TO RPREL-DISCPCT-OVRD-FLAG.                         02428000
024290     MOVE 'N' TO RPREL-RATEPCT-OVRD-FLAG.                         02429000
024300     MOVE SPACES TO RPREL-RESERVED.                               02430000
024310     MOVE 'A  ' TO SR-APIFUNC.                                    02431000
024320     PERFORM CALL-RPS-REL.                                        02432000
024330     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02433000
024340         GO TO AR-0022.                                           02434000
024350     IF WS-PRIM-ACTREC IS EQUAL TO 'Y'                            02435000
024360         GO TO ANR-REWRITE-PACT.                                  02436000
024370     INITIALIZE RPACT-RECORD.                                     02437000
024380     MOVE RPQUA-INST TO RPACT-INST.                               02438000
024390     MOVE RPQUA-PRODCODE TO RPACT-PRODCODE.                       02439000
024400     MOVE RPQUA-ACCOUNT TO RPACT-ACCOUNT.                         02440000
024410     MOVE WS-PRIM-SCINCOPT TO RPACT-SC-INC-OPTION.                02441000
024420     MOVE 'N' TO RPACT-SC-INC-QUAL.                               02442000
024430     MOVE ZEROS TO RPACT-DISCOUNT-AMOUNT.                         02443000
024440     MOVE ZEROS TO RPACT-DISCOUNT-PERCENT.                        02444000
024450     MOVE WS-PRIM-RATEINCOPT TO RPACT-RATE-INC-OPTION.            02445000
024460     MOVE 'N' TO RPACT-RATE-INC-QUAL.                             02446000
024470     MOVE ZEROS TO RPACT-RATE-PERCENT.                            02447000
024480     MOVE WS-PRIM-TIMEPROCOPT TO RPACT-PROCOPT.                   02448000
024490     MOVE WS-PRIM-APPL TO RPACT-APPL.                             02449000
024500     MOVE SPACE TO RPACT-RSV-FLAG.                                02450000
024510     MOVE SPACE TO RPACT-RSV-FLAG1.                               02451000
024520     MOVE SPACE TO RPACT-RSV-FLAG2.                               02452000
024530     MOVE SPACE TO RPACT-RSV-FLAG3.                               02453000
024540     MOVE SPACES TO RPACT-RESERVED.                               02454000
024550     GO TO ANR-WRITE-PACT.                                        02455000
024560 ANR-REWRITE-PACT.                                                02456000
024570     MOVE RPQUA-INST TO RPACT-INST.                               02457000
024580     MOVE RPQUA-PRODCODE TO RPACT-PRODCODE.                       02458000
024590     MOVE RPQUA-ACCOUNT TO RPACT-ACCOUNT.                         02459000
024600     MOVE 'R U' TO SR-APIFUNC.                                    02460000
024610     PERFORM CALL-RPS-ACT.                                        02461000
024620     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02462000
024630         GO TO AR-0023.                                           02463000
024640     IF RPACT-SC-INC-OPTION IS EQUAL TO 'N'                       02464000
024650         MOVE WS-PRIM-SCINCOPT TO RPACT-SC-INC-OPTION.            02465000
024660     IF RPACT-RATE-INC-OPTION IS EQUAL TO 'N'                     02466000
024670         MOVE WS-PRIM-RATEINCOPT TO RPACT-RATE-INC-OPTION.        02467000
024680     IF RPACT-PROCOPT IS EQUAL TO 'N'                             02468000
024690         MOVE WS-PRIM-TIMEPROCOPT TO RPACT-PROCOPT.               02469000
024700 ANR-WRITE-PACT.                                                  02470000
024710     IF WS-PRIM-ACTREC IS EQUAL TO 'Y'                            02471000
024720         MOVE 'W  ' TO SR-APIFUNC                                 02472000
024730     ELSE                                                         02473000
024740         MOVE 'A  ' TO SR-APIFUNC.                                02474000
024750     PERFORM CALL-RPS-ACT.                                        02475000
024760     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02476000
024770         GO TO AR-0024.                                           02477000
024780 ANR-ADD-PRIM-EVT.                                                02478000
024790     IF MIM-7100EVENTHISTORYOPT IS EQUAL TO 'N'                   02479000
024800         GO TO ANR-NO-PRIM-EVT.                                   02480000
024810     MOVE 'N' TO RPS-EVT-FLAG.                                    02481000
024820     MOVE 01 TO RPS-EVT-EVENT-CODE.                               02482000
024830     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   02483000
024840     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   02484000
024850     MOVE RPMST-IDNUMBER TO RPS-EVT-IDNUMBER.                     02485000
024860     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        02486000
024870     PERFORM ADD-EVENT-HISTORY.                                   02487000
024880     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02488000
024890         GO TO AR-0052.                                           02489000
024900 ANR-NO-PRIM-EVT.                                                 02490000
024910     MOVE 'P' TO WS-PRINT-SW.                                     02491000
P0101      MOVE +1 TO WS-SUBSEC.                                        02492000
024930 ANR-SECONDARY.                                                   02493000
024940     ADD +1 TO WS-SUBSEC.                                         02494000
024950     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02495000
024960         GO TO ANR-END.                                           02496000
024970     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02497000
024980         GO TO ANR-END.                                           02498000
024990     IF WS-SEC-ADDON (WS-SUBSEC) IS EQUAL TO 'Y'                  02499000
025000         PERFORM GET-ADDON-REL.                                   02500000
025010     IF WS-SEC-ADDON (WS-SUBSEC) IS EQUAL TO 'Y'                  02501000
025020         AND WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'              02502000
025030         PERFORM DELETE-ADDON-REL.                                02503000
025040     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   02504000
025050         GO TO ANR-SECONDARY.                                     02505000
025060     MOVE RPQUA-INST TO RPREL-INST.                               02506000
025070     MOVE RPQUA-PRODCODE TO RPREL-PRODCODE.                       02507000
025080     MOVE RPQUA-ACCOUNT TO RPREL-ACCOUNT.                         02508000
025090     MOVE RPQUA-MODEL TO RPREL-MODEL.                             02509000
025100     MOVE WS-SEC-INST (WS-SUBSEC) TO RPREL-INST2.                 02510000
025110     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPREL-PRODCODE2.           02511000
025120     MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPREL-ACCOUNT2.              02512000
025130     IF WS-SEC-ADDON (WS-SUBSEC) IS EQUAL TO 'N'                  02513000
025140         MOVE 'A' TO RPREL-ACCT-STATUS                            02514000
025150     ELSE                                                         02515000
025160         MOVE 'U' TO RPREL-ACCT-STATUS.                           02516000
025170     MOVE RPQUA-MODEL TO RPREL-MODEL.                             02517000
025180     MOVE WS-SEC-BRANCH (WS-SUBSEC) TO RPREL-BRANCH.              02518000
025190     MOVE WS-SEC-TYPE (WS-SUBSEC) TO RPREL-ACCT-TYPE.             02519000
025200     MOVE WS-SEC-SCINCOPT (WS-SUBSEC) TO RPREL-SC-INC-OPTION.     02520000
025210     MOVE WS-SEC-RATEINCOPT (WS-SUBSEC) TO RPREL-RATE-INC-OPTION. 02521000
025220     MOVE WS-SEC-APPL (WS-SUBSEC) TO RPREL-APPL.                  02522000
025230     MOVE ZEROS TO RPREL-ACCTBAL-1.                               02523000
025240     MOVE ZEROS TO RPREL-ACCTBAL-2.                               02524000
025250     MOVE ZEROS TO RPREL-PRIMEBAL.                                02525000
025260     MOVE ZEROS TO RPREL-ACCT-COMBBAL1.                           02526000
025270     MOVE ZEROS TO RPREL-ACCT-COMBBAL2.                           02527000
025280     MOVE ZEROS TO RPREL-CASH-RW-BAL.                             02528000
025290     MOVE ZEROS TO RPREL-ACCT-RATE-BAL.                           02529000
025300     MOVE ZEROS TO RPREL-SC-BAL.                                  02530000
025310     MOVE ZEROS TO RPREL-DISCAMT-OVRD.                            02531000
025320     MOVE ZEROS TO RPREL-DISCPCT-OVRD.                            02532000
025330     MOVE ZEROS TO RPREL-RATEPCT-OVRD.                            02533000
025340     MOVE 'N' TO RPREL-DISCAMT-OVRD-FLAG.                         02534000
025350     MOVE 'N' TO RPREL-DISCPCT-OVRD-FLAG.                         02535000
025360     MOVE 'N' TO RPREL-RATEPCT-OVRD-FLAG.                         02536000
025370     MOVE SPACES TO RPREL-RESERVED.                               02537000
025380     IF WS-SEC-ADDON (WS-SUBSEC) IS EQUAL TO 'Y'                  02538000
025390         MOVE 'W  ' TO SR-APIFUNC                                 02539000
025400     ELSE                                                         02540000
025410         MOVE 'A  ' TO SR-APIFUNC.                                02541000
025420     PERFORM CALL-RPS-REL.                                        02542000
025430     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02543000
025440         GO TO AR-0025.                                           02544000
025450     IF WS-SEC-ACTREC (WS-SUBSEC) IS EQUAL TO 'Y'                 02545000
025460         GO TO ANR-REWRITE-SACT.                                  02546000
025470     INITIALIZE RPACT-RECORD.                                     02547000
025480     MOVE WS-SEC-INST (WS-SUBSEC) TO RPACT-INST.                  02548000
025490     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPACT-PRODCODE.            02549000
025500     MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPACT-ACCOUNT.               02550000
025510     MOVE WS-SEC-SCINCOPT (WS-SUBSEC) TO RPACT-SC-INC-OPTION.     02551000
025520     MOVE 'N' TO RPACT-SC-INC-QUAL.                               02552000
025530     MOVE ZEROS TO RPACT-DISCOUNT-AMOUNT.                         02553000
025540     MOVE ZEROS TO RPACT-DISCOUNT-PERCENT.                        02554000
025550     MOVE WS-SEC-RATEINCOPT (WS-SUBSEC) TO RPACT-RATE-INC-OPTION. 02555000
025560     MOVE 'N' TO RPACT-RATE-INC-QUAL.                             02556000
025570     MOVE ZEROS TO RPACT-RATE-PERCENT.                            02557000
025580     MOVE WS-SEC-TIMEPROCOPT (WS-SUBSEC) TO RPACT-PROCOPT.        02558000
025590     MOVE WS-SEC-APPL (WS-SUBSEC) TO RPACT-APPL.                  02559000
025600     MOVE SPACE TO RPACT-RSV-FLAG.                                02560000
025610     MOVE SPACE TO RPACT-RSV-FLAG1.                               02561000
025620     MOVE SPACE TO RPACT-RSV-FLAG2.                               02562000
025630     MOVE SPACE TO RPACT-RSV-FLAG3.                               02563000
025640     MOVE SPACES TO RPACT-RESERVED.                               02564000
025650     GO TO ANR-WRITE-SACT.                                        02565000
025660 ANR-REWRITE-SACT.                                                02566000
025670     MOVE WS-SEC-INST (WS-SUBSEC) TO RPACT-INST.                  02567000
025680     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPACT-PRODCODE.            02568000
025690     MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPACT-ACCOUNT.               02569000
025700     MOVE 'R U' TO SR-APIFUNC.                                    02570000
025710     PERFORM CALL-RPS-ACT.                                        02571000
025720     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02572000
025730         GO TO AR-0026.                                           02573000
025740     IF RPACT-SC-INC-OPTION IS EQUAL TO 'N'                       02574000
025750         MOVE WS-SEC-SCINCOPT (WS-SUBSEC) TO                      02575000
025760             RPACT-SC-INC-OPTION.                                 02576000
025770     IF RPACT-RATE-INC-OPTION IS EQUAL TO 'N'                     02577000
025780         MOVE WS-SEC-RATEINCOPT (WS-SUBSEC) TO                    02578000
025790             RPACT-RATE-INC-OPTION.                               02579000
025800     IF RPACT-PROCOPT IS EQUAL TO 'N'                             02580000
025810         MOVE WS-SEC-TIMEPROCOPT (WS-SUBSEC) TO RPACT-PROCOPT.    02581000
025820 ANR-WRITE-SACT.                                                  02582000
025830     IF WS-SEC-ACTREC (WS-SUBSEC) IS EQUAL TO 'Y'                 02583000
025840         MOVE 'W  ' TO SR-APIFUNC                                 02584000
025850     ELSE                                                         02585000
025860         MOVE 'A  ' TO SR-APIFUNC.                                02586000
025870     PERFORM CALL-RPS-ACT.                                        02587000
025880     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02588000
025890         GO TO AR-0027.                                           02589000
025900 ANR-ADD-SEC-EVT.                                                 02590000
025910     IF MIM-7100EVENTHISTORYOPT IS EQUAL TO 'N'                   02591000
025920         GO TO ANR-NO-EVT.                                        02592000
025930     MOVE 'N' TO RPS-EVT-FLAG.                                    02593000
P0054      MOVE 07 TO RPS-EVT-EVENT-CODE.                               02594000
025950     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   02595000
025960     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   02596000
025970     MOVE RPMST-IDNUMBER TO RPS-EVT-IDNUMBER.                     02597000
025980     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        02598000
025990     PERFORM ADD-EVENT-HISTORY.                                   02599000
026000     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02600000
026010         GO TO AR-0053.                                           02601000
026020 ANR-NO-EVT.                                                      02602000
026030     PERFORM PRINT-REL-ADDED.                                     02603000
026040     IF WS-PRINT-SW IS EQUAL TO 'C'                               02604000
026050         MOVE 'X' TO WS-PRINT-SW.                                 02605000
026060     IF WS-PRINT-SW IS EQUAL TO 'P'                               02606000
026070         MOVE 'C' TO WS-PRINT-SW.                                 02607000
026080     GO TO ANR-SECONDARY.                                         02608000
026090 ANR-END.                                                         02609000
026100     IF WS-PRINT-SW IS EQUAL TO 'P' OR 'C'                        02610000
026110         PERFORM PRINT-PRIMARY-INFO.                              02611000
026120 ANR-EXIT.                                                        02612000
026130     EXIT.                                                        02613000
026140******************************************************************02614000
026150 ADD-TRAN-MASTER SECTION.                                         02615000
026160 ATM-START.                                                       02616000
026170     MOVE ZEROS TO WS-SUB1.                                       02617000
026180     IF MIM-7101TRANPROFILE IS EQUAL TO SPACES                    02618000
026190         OR MIM-7101TRANPROFILE-I IS NOT EQUAL TO 'Y'             02619000
026200         GO TO ATM-EXIT.                                          02620000
026210 ATM-MOVE-KEY.                                                    02621000
026220     MOVE RPQUA-INST TO RPTRM-INST.                               02622000
026230     MOVE RPQUA-PRODCODE TO RPTRM-PRODCODE.                       02623000
026240     MOVE RPQUA-ACCOUNT TO RPTRM-ACCOUNT.                         02624000
026250     MOVE RPQUA-MODEL TO RPTRM-MODEL.                             02625000
026260 ATM-GRACE-DAYS.                                                  02626000
026270     MOVE MIM-7101TRANPROFILE TO WS-RPMIM7110TRANPROFILE.         02627000
026280     PERFORM SEARCH-RPS-7110.                                     02628000
026290     IF WS-RPMIM7110FOUND IS EQUAL TO 'N'                         02629000
026300         MOVE ZEROS TO RPTRM-GRACE-EXPIRATION-DATE                02630000
026310         GO TO ATM-LOOP.                                          02631000
026320     IF MIM-7110GRACE-DAYS IS EQUAL TO ZEROS                      02632000
026330         MOVE ZEROS TO RPTRM-GRACE-EXPIRATION-DATE                02633000
026340         GO TO ATM-LOOP.                                          02634000
026350     MOVE 'D' TO SR-PERIOD.                                       02635000
026360     MOVE MIM-7110GRACE-DAYS TO SR-FREQ.                          02636000
026370     MOVE ZEROS TO SR-DAY.                                        02637000
026380     MOVE WS-CURDTYYYY TO SR-FCYR.                                02638000
026390     MOVE WS-CURDTMM TO SR-FCMON.                                 02639000
026400     MOVE WS-CURDTDD TO SR-FCDAY.                                 02640000
026410     PERFORM JULIAN-365.                                          02641000
026420     MOVE SR-TOJUL TO SR-FROMJUL.                                 02642000
026430     PERFORM NEXT-DATE-365.                                       02643000
026440     MOVE SR-TOJUL TO SR-FROMJUL.                                 02644000
026450     PERFORM CALENDAR-365.                                        02645000
026460     MOVE SR-TCMON TO WS-PDATE-MM.                                02646000
026470     MOVE SR-TCDAY TO WS-PDATE-DD.                                02647000
026480     MOVE SR-TCYR TO WS-PDATE-YYYY.                               02648000
026490     MOVE WS-PDATE TO RPTRM-GRACE-EXPIRATION-DATE.                02649000
026500 ATM-LOOP.                                                        02650000
026510     ADD +1 TO WS-SUB1.                                           02651000
026520     IF WS-SUB1 IS GREATER THAN WS-RPMIM7110MAXOCCURS             02652000
026530         GO TO ATM-ADD-TRM.                                       02653000
026540     MOVE ZEROS TO RPTRM-TRAN-DATE (WS-SUB1).                     02654000
026550     MOVE ZEROS TO RPTRM-TRAN-COUNT (WS-SUB1).                    02655000
026560     MOVE ZEROS TO RPTRM-TRAN-AMOUNT (WS-SUB1).                   02656000
026570     GO TO ATM-LOOP.                                              02657000
026580 ATM-ADD-TRM.                                                     02658000
026590     MOVE 'A  ' TO SR-APIFUNC.                                    02659000
026600     PERFORM CALL-RPS-TRM.                                        02660000
026610     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02661000
026620         GO TO AR-0041.                                           02662000
026630 ATM-EXIT.                                                        02663000
026640     EXIT.                                                        02664000
026650******************************************************************02665000
026660 GET-ADDON-REL SECTION.                                           02666000
026670 GAR-START.                                                       02667000
026680     MOVE RPQUA-INST TO RPREL-INST.                               02668000
026690     MOVE RPQUA-PRODCODE TO RPREL-PRODCODE.                       02669000
026700     MOVE RPQUA-ACCOUNT TO RPREL-ACCOUNT.                         02670000
026710     MOVE RPQUA-MODEL TO RPREL-MODEL.                             02671000
026720     MOVE WS-SEC-INST (WS-SUBSEC) TO RPREL-INST2.                 02672000
026730     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPREL-PRODCODE2.           02673000
026740     MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPREL-ACCOUNT2.              02674000
026750     MOVE 'R U' TO SR-APIFUNC.                                    02675000
026760     PERFORM CALL-RPS-REL.                                        02676000
026770     IF WS-FUNCTION IS EQUAL TO 'N'                               02677000
026780         MOVE 'N' TO WS-SEC-ADDON (WS-SUBSEC)                     02678000
026790         GO TO GAR-EXIT.                                          02679000
026800     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02680000
026810         GO TO AR-0035.                                           02681000
026820 GAR-EXIT.                                                        02682000
026830     EXIT.                                                        02683000
026840******************************************************************02684000
026850 DELETE-ADDON-REL SECTION.                                        02685000
026860 DAR-START.                                                       02686000
026870     MOVE 'D  ' TO SR-APIFUNC.                                    02687000
026880     PERFORM CALL-RPS-REL.                                        02688000
026890     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02689000
026900         GO TO AR-0036.                                           02690000
026910 DAR-EXIT.                                                        02691000
026920     EXIT.                                                        02692000
026930******************************************************************02693000
026940 PRINT-REL-ADDED SECTION.                                         02694000
026950 PRA-START.                                                       02695000
026960     MOVE SPACES TO RPRPTS-RECORD.                                02696000
026970     MOVE WS-SUBSEC TO RPRPTS-SRTNUMBER.                          02697000
026980     MOVE 50 TO RPRPTS-RPTNBR.                                    02698000
026990     MOVE RPQUA-INST TO RPRPTS-INST.                              02699000
027000     MOVE RPQUA-PRODCODE TO RPRPTS-PRODCODE.                      02700000
027010     MOVE RPQUA-ACCOUNT TO RPRPTS-ACCOUNT.                        02701000
027020     MOVE RPQUA-MODEL TO RPRPTS-MODEL.                            02702000
027030     MOVE RPQUA-BRANCH TO RPRPTS-BRANCH.                          02703000
027040     MOVE RPQUA-ACCT-TYPE TO RPRPTS-TYPE.                         02704000
027050     MOVE SPACES TO RPRPTS-NAME.                                  02705000
027060     MOVE WS-RRPTCTL TO RPRPTS-RPTCTL.                            02706000
027070     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPRPTS-050SECPRODCD.       02707000
027080     MOVE WS-SEC-BRANCH (WS-SUBSEC) TO RPRPTS-050SECBRANCH.       02708000
027090     MOVE WS-SEC-TYPE (WS-SUBSEC) TO RPRPTS-050SECTYPE.           02709000
027100     MOVE WS-SEC-INST (WS-SUBSEC) TO RPRPTS-050SECINST.           02710000
027110     MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPRPTS-050SECACCT.           02711000
027120     MOVE ZEROS TO RPRPTS-050OPENDATE.                            02712000
027130     MOVE ZEROS TO RPRPTS-050ENROLLATTEMPTS.                      02713000
027140     MOVE WS-CRW-OLDNXTDT TO RPRPTS-050CRWOLDNXTDT.               02714000
027150     MOVE WS-CRW-NEWNXTDT TO RPRPTS-050CRWNEWNXTDT.               02715000
027160     IF WS-RRPTPFC IS EQUAL TO '0'                                02716000
027170         GO TO PRA-END.                                           02717000
027180 PRA-WRITE.                                                       02718000
027190     MOVE 'ASE' TO WS-RRPTS.                                      02719000
027200     PERFORM CALL-RPRPTS.                                         02720000
027210     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02721000
027220         GO TO AR-0029.                                           02722000
027230 PRA-END.                                                         02723000
027240     MOVE SPACES TO RPRPTS-RECORD.                                02724000
027250     MOVE 0 TO RPRPTS-SRTNUMBER.                                  02725000
027260 PRA-EXIT.                                                        02726000
027270     EXIT.                                                        02727000
027280******************************************************************02728000
027290 PRINT-PRIMARY-INFO SECTION.                                      02729000
027300 PPI-START.                                                       02730000
027310     MOVE SPACES TO RPRPTS-RECORD.                                02731000
027320     MOVE WS-SUBSEC TO RPRPTS-SRTNUMBER.                          02732000
027330     MOVE 50 TO RPRPTS-RPTNBR.                                    02733000
027340     MOVE RPQUA-INST TO RPRPTS-INST.                              02734000
027350     MOVE RPQUA-PRODCODE TO RPRPTS-PRODCODE.                      02735000
027360     MOVE RPQUA-ACCOUNT TO RPRPTS-ACCOUNT.                        02736000
027370     MOVE RPQUA-MODEL TO RPRPTS-MODEL.                            02737000
027380     MOVE RPQUA-BRANCH TO RPRPTS-BRANCH.                          02738000
027390     MOVE RPQUA-ACCT-TYPE TO RPRPTS-TYPE.                         02739000
027400     MOVE SPACES TO RPRPTS-NAME.                                  02740000
027410     MOVE ZEROS TO RPRPTS-050OPENDATE.                            02741000
027420     MOVE ZEROS TO RPRPTS-050ENROLLATTEMPTS.                      02742000
027430     MOVE WS-CRW-OLDNXTDT TO RPRPTS-050CRWOLDNXTDT.               02743000
027440     MOVE WS-CRW-NEWNXTDT TO RPRPTS-050CRWNEWNXTDT.               02744000
027450     MOVE WS-RRPTCTL TO RPRPTS-RPTCTL.                            02745000
027460     IF WS-RRPTPFC IS EQUAL TO '0'                                02746000
027470         GO TO PPI-END.                                           02747000
027480 PPI-WRITE.                                                       02748000
027490     MOVE 'ASE' TO WS-RRPTS.                                      02749000
027500     PERFORM CALL-RPRPTS.                                         02750000
027510     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02751000
027520         GO TO AR-0039.                                           02752000
027530 PPI-END.                                                         02753000
027540     MOVE SPACES TO RPRPTS-RECORD.                                02754000
027550     MOVE 0 TO RPRPTS-SRTNUMBER.                                  02755000
027560 PPI-EXIT.                                                        02756000
027570     EXIT.                                                        02757000
027580******************************************************************02758000
027590 GET-ERROR-MESSAGE SECTION.                                       02759000
027600 GEM-START.                                                       02760000
027610     MOVE SPACES TO MI2011-RECORD.                                02761000
027620     MOVE ZERO TO MIM-2011KINST.                                  02762000
027630     MOVE +2011 TO MIM-2011KREC.                                  02763000
027640     MOVE 50 TO MIM-2011KMANGER.                                  02764000
027650     MOVE WS-2011-MSGNBR TO MIM-2011KMSGNBR.                      02765000
027660     MOVE 'EN' TO MIM-2011KLANG.                                  02766000
027670     MOVE MIC-MST-2011-PRI TO MIC-MST-REC-PRI.                    02767000
027680     MOVE MI2011-RECORD TO MIMST-RECORD.                          02768000
027690     PERFORM MIC-MST-GET-REQUEST.                                 02769000
027700     IF WS-FUNCTION IS EQUAL TO SPACE                             02770000
027710         MOVE MIMST-RECORD TO MI2011-RECORD                       02771000
027720         MOVE MIM-2011MSGLEFT TO WS-ERRORMESSAGE                  02772000
027730     ELSE                                                         02773000
027740         MOVE MIM-2011KMSGNBR TO WS-2011-ERRORNBR                 02774000
027750         MOVE WS-2011-ERROR TO WS-ERRORMESSAGE.                   02775000
027760 GEM-EXIT.                                                        02776000
027770     EXIT.                                                        02777000
027780******************************************************************02778000
027790 GET-MY-SECONDARY-ACCOUNTS SECTION.                               02779000
000000 COPY RPP137.                                                     02780000
027810******************************************************************02781000
027820 VALIDATE-BRANCH SECTION.                                         02782000
000000 COPY RPP7107B.                                                   02783000
027840******************************************************************02784000
027850*MIC-MST-API SECTION.                                             02785000
000000 COPY MIPMSTA.                                                    02786000
027870******************************************************************02787000
027880 JULIAN-365 SECTION.                                              02788000
000000 COPY SRP001.                                                     02789000
027900******************************************************************02790000
027910 CALENDAR-365 SECTION.                                            02791000
000000 COPY SRP003.                                                     02792000
027930******************************************************************02793000
027940 NEXT-DATE-365 SECTION.                                           02794000
000000 COPY SRP009.                                                     02795000
027960******************************************************************02796000
027970 NEXT-CYCLE-365 SECTION.                                          02797000
000000 COPY SRP022.                                                     02798000
027990******************************************************************02799000
028000 GET-FILE-ORGANIZATION SECTION.                                   02800000
000000 COPY SRP093.                                                     02801000
028020******************************************************************02802000
028030 ADD-EVENT-HISTORY SECTION.                                       02803000
000000 COPY RPPEVTC.                                                    02804000
028050***************************************************************** 02805000
028060 CALL-RPS-ACT SECTION.                                            02806000
000000 COPY RPPACTB.                                                    02807000
028080******************************************************************02808000
028090 CALL-RPS-BNK SECTION.                                            02809000
000000 COPY RPPBNKB.                                                    02810000
028110******************************************************************02811000
028120 CALL-RPS-CRW SECTION.                                            02812000
000000 COPY RPPCRWB.                                                    02813000
028140******************************************************************02814000
028150 CALL-RPS-EVT SECTION.                                            02815000
000000 COPY RPPEVTB.                                                    02816000
028170******************************************************************02817000
028180 CALL-RPS-MST SECTION.                                            02818000
000000 COPY RPPMSTB.                                                    02819000
028200******************************************************************02820000
028210 CALL-RPS-QUA SECTION.                                            02821000
000000 COPY RPPQUAB.                                                    02822000
028230******************************************************************02823000
028240 CALL-RPS-REL SECTION.                                            02824000
000000 COPY RPPRELB.                                                    02825000
028260******************************************************************02826000
028270 CALL-RPS-TRM SECTION.                                            02827000
000000 COPY RPPTRMB.                                                    02828000
028290******************************************************************02829000
028300 LOAD-RPS-2001 SECTION.                                           02830000
000000 COPY RPP2001.                                                    02831000
028320******************************************************************02832000
028330 LOAD-RPS-2023 SECTION.                                           02833000
000000 COPY RPP2023.                                                    02834000
028350******************************************************************02835000
028360 LOAD-RPS-7101 SECTION.                                           02836000
000000 COPY RPP7101.                                                    02837000
028380******************************************************************02838000
028390 LOAD-RPS-7102 SECTION.                                           02839000
000000 COPY RPP7102.                                                    02840000
028410******************************************************************02841000
028420 LOAD-RPS-7104 SECTION.                                           02842000
000000 COPY RPP7104.                                                    02843000
028440******************************************************************02844000
028450 LOAD-RPS-7106 SECTION.                                           02845000
000000 COPY RPP7106.                                                    02846000
028470******************************************************************02847000
028480 LOAD-RPS-7107 SECTION.                                           02848000
000000 COPY RPP7107.                                                    02849000
028500******************************************************************02850000
028510 LOAD-RPS-7110 SECTION.                                           02851000
000000 COPY RPP7110.                                                    02852000
028530******************************************************************02853000
028540 SEARCH-RPS-2001 SECTION.                                         02854000
000000 COPY RPP2001S.                                                   02855000
028560******************************************************************02856000
028570 SEARCH-RPS-2023 SECTION.                                         02857000
000000 COPY RPP2023S.                                                   02858000
028590******************************************************************02859000
028600 SEARCH-RPS-7101 SECTION.                                         02860000
000000 COPY RPP7101S.                                                   02861000
028620******************************************************************02862000
028630 SEARCH-RPS-7102 SECTION.                                         02863000
000000 COPY RPP7102S.                                                   02864000
028650******************************************************************02865000
028660 SEARCH-RPS-7104 SECTION.                                         02866000
000000 COPY RPP7104S.                                                   02867000
028680******************************************************************02868000
028690 SEARCH-RPS-7106 SECTION.                                         02869000
000000 COPY RPP7106S.                                                   02870000
028710******************************************************************02871000
028720 SEARCH-RPS-7107 SECTION.                                         02872000
000000 COPY RPP7107S.                                                   02873000
028740******************************************************************02874000
028750 SEARCH-RPS-7110 SECTION.                                         02875000
000000 COPY RPP7110S.                                                   02876000
028770******************************************************************02877000
028780 CALL-RPRPTS SECTION.                                             02878000
000000 COPY RPPRPTS.                                                    02879000
028800******************************************************************02880000
028810 ABORT-ROUTINE SECTION.                                           02881000
028820 AR-0001.                                                         02882000
028830     MOVE 1 TO WS-ABCODE.                                         02883000
028840     GO TO AR-MSG.                                                02884000
028850 AR-0002.                                                         02885000
028860     MOVE 2 TO WS-ABCODE.                                         02886000
028870     GO TO AR-MSG.                                                02887000
028880 AR-0003.                                                         02888000
028890     MOVE 3 TO WS-ABCODE.                                         02889000
028900     GO TO AR-MSG.                                                02890000
028910 AR-0004.                                                         02891000
028920     MOVE 4 TO WS-ABCODE.                                         02892000
028930     GO TO AR-MSG.                                                02893000
028940 AR-0005.                                                         02894000
028950     MOVE 5 TO WS-ABCODE.                                         02895000
028960     GO TO AR-MSG.                                                02896000
028970 AR-0006.                                                         02897000
028980     MOVE 6 TO WS-ABCODE.                                         02898000
028990     GO TO AR-MSG.                                                02899000
029000 AR-0007.                                                         02900000
029010     MOVE 7 TO WS-ABCODE.                                         02901000
029020     GO TO AR-MSG.                                                02902000
029030 AR-0008.                                                         02903000
029040     MOVE 8 TO WS-ABCODE.                                         02904000
029050     GO TO AR-MSG.                                                02905000
029060 AR-0009.                                                         02906000
029070     MOVE 9 TO WS-ABCODE.                                         02907000
029080     GO TO AR-MSG.                                                02908000
029090 AR-0010.                                                         02909000
029100     MOVE 10 TO WS-ABCODE.                                        02910000
029110     GO TO AR-MSG.                                                02911000
029120 AR-0011.                                                         02912000
029130     MOVE 11 TO WS-ABCODE.                                        02913000
029140     GO TO AR-MSG.                                                02914000
029150 AR-0012.                                                         02915000
029160     MOVE 12 TO WS-ABCODE.                                        02916000
029170     GO TO AR-MSG.                                                02917000
029180 AR-0013.                                                         02918000
029190     MOVE 13 TO WS-ABCODE.                                        02919000
029200     GO TO AR-MSG.                                                02920000
029210 AR-0014.                                                         02921000
029220     MOVE 14 TO WS-ABCODE.                                        02922000
029230     GO TO AR-MSG.                                                02923000
029240 AR-0015.                                                         02924000
029250     MOVE 15 TO WS-ABCODE.                                        02925000
029260     GO TO AR-MSG.                                                02926000
029270 AR-0016.                                                         02927000
029280     MOVE 16 TO WS-ABCODE.                                        02928000
029290     GO TO AR-MSG.                                                02929000
029300 AR-0017.                                                         02930000
029310     MOVE 17 TO WS-ABCODE.                                        02931000
029320     GO TO AR-MSG.                                                02932000
029330 AR-0018.                                                         02933000
029340     MOVE 18 TO WS-ABCODE.                                        02934000
029350     GO TO AR-MSG.                                                02935000
029360 AR-0019.                                                         02936000
029370     MOVE 19 TO WS-ABCODE.                                        02937000
029380     GO TO AR-MSG.                                                02938000
029390 AR-0020.                                                         02939000
029400     MOVE 20 TO WS-ABCODE.                                        02940000
029410     GO TO AR-MSG.                                                02941000
029420 AR-0021.                                                         02942000
029430     MOVE 21 TO WS-ABCODE.                                        02943000
029440     GO TO AR-MSG.                                                02944000
029450 AR-0022.                                                         02945000
029460     MOVE 22 TO WS-ABCODE.                                        02946000
029470     GO TO AR-MSG.                                                02947000
029480 AR-0023.                                                         02948000
029490     MOVE 23 TO WS-ABCODE.                                        02949000
029500     GO TO AR-MSG.                                                02950000
029510 AR-0024.                                                         02951000
029520     MOVE 24 TO WS-ABCODE.                                        02952000
029530     GO TO AR-MSG.                                                02953000
029540 AR-0025.                                                         02954000
029550     MOVE 25 TO WS-ABCODE.                                        02955000
029560     GO TO AR-MSG.                                                02956000
029570 AR-0026.                                                         02957000
029580     MOVE 26 TO WS-ABCODE.                                        02958000
029590     GO TO AR-MSG.                                                02959000
029600 AR-0027.                                                         02960000
029610     MOVE 27 TO WS-ABCODE.                                        02961000
029620     GO TO AR-MSG.                                                02962000
029630 AR-0028.                                                         02963000
029640     MOVE 28 TO WS-ABCODE.                                        02964000
029650     GO TO AR-MSG.                                                02965000
029660 AR-0029.                                                         02966000
029670     MOVE 29 TO WS-ABCODE.                                        02967000
029680     GO TO AR-MSG.                                                02968000
029690 AR-0030.                                                         02969000
029700     MOVE 30 TO WS-ABCODE.                                        02970000
029710     GO TO AR-MSG.                                                02971000
029720 AR-0031.                                                         02972000
029730     MOVE 31 TO WS-ABCODE.                                        02973000
029740     GO TO AR-MSG.                                                02974000
029750 AR-0032.                                                         02975000
029760     MOVE 32 TO WS-ABCODE.                                        02976000
029770     GO TO AR-MSG.                                                02977000
029780 AR-0033.                                                         02978000
029790     MOVE 33 TO WS-ABCODE.                                        02979000
029800     GO TO AR-MSG.                                                02980000
029810 AR-0034.                                                         02981000
029820     MOVE 34 TO WS-ABCODE.                                        02982000
029830     GO TO AR-MSG.                                                02983000
029840 AR-0035.                                                         02984000
029850     MOVE 35 TO WS-ABCODE.                                        02985000
029860     GO TO AR-MSG.                                                02986000
029870 AR-0036.                                                         02987000
029880     MOVE 36 TO WS-ABCODE.                                        02988000
029890     GO TO AR-MSG.                                                02989000
029900 AR-0037.                                                         02990000
029910     MOVE 37 TO WS-ABCODE.                                        02991000
029920     GO TO AR-MSG.                                                02992000
029930 AR-0038.                                                         02993000
029940     MOVE 38 TO WS-ABCODE.                                        02994000
029950     GO TO AR-MSG.                                                02995000
029960 AR-0039.                                                         02996000
029970     MOVE 39 TO WS-ABCODE.                                        02997000
029980     GO TO AR-MSG.                                                02998000
029990 AR-0040.                                                         02999000
030000     MOVE 40 TO WS-ABCODE.                                        03000000
030010     GO TO AR-MSG.                                                03001000
030020 AR-0041.                                                         03002000
030030     MOVE 41 TO WS-ABCODE.                                        03003000
030040     GO TO AR-MSG.                                                03004000
030050 AR-0042.                                                         03005000
030060     MOVE 42 TO WS-ABCODE.                                        03006000
030070     GO TO AR-MSG.                                                03007000
030080 AR-0043.                                                         03008000
030090     MOVE 43 TO WS-ABCODE.                                        03009000
030100     GO TO AR-MSG.                                                03010000
030110 AR-0044.                                                         03011000
030120     MOVE 44 TO WS-ABCODE.                                        03012000
030130     GO TO AR-MSG.                                                03013000
030140 AR-0045.                                                         03014000
030150     MOVE 45 TO WS-ABCODE.                                        03015000
030160     GO TO AR-MSG.                                                03016000
030170 AR-0046.                                                         03017000
030180     MOVE 46 TO WS-ABCODE.                                        03018000
030190     GO TO AR-MSG.                                                03019000
030200 AR-0047.                                                         03020000
030210     MOVE 47 TO WS-ABCODE.                                        03021000
030220     GO TO AR-MSG.                                                03022000
030230 AR-0048.                                                         03023000
030240     MOVE 48 TO WS-ABCODE.                                        03024000
030250     GO TO AR-MSG.                                                03025000
030260 AR-0049.                                                         03026000
030270     MOVE 49 TO WS-ABCODE.                                        03027000
030280     GO TO AR-MSG.                                                03028000
030290 AR-0050.                                                         03029000
030300     MOVE 50 TO WS-ABCODE.                                        03030000
030310     GO TO AR-MSG.                                                03031000
030320 AR-0051.                                                         03032000
030330     MOVE 51 TO WS-ABCODE.                                        03033000
030340     GO TO AR-MSG.                                                03034000
030350 AR-0052.                                                         03035000
030360     MOVE 52 TO WS-ABCODE.                                        03036000
030370     GO TO AR-MSG.                                                03037000
030380 AR-0053.                                                         03038000
030390     MOVE 53 TO WS-ABCODE.                                        03039000
030400     GO TO AR-MSG.                                                03040000
030410 AR-0054.                                                         03041000
030420     MOVE 54 TO WS-ABCODE.                                        03042000
030430     GO TO AR-MSG.                                                03043000
030440 AR-0055.                                                         03044000
030450     MOVE 55 TO WS-ABCODE.                                        03045000
030460     GO TO AR-MSG.                                                03046000
P0101  AR-0056.                                                         03046200
P0101      MOVE 56 TO WS-ABCODE.                                        03046400
P0101      GO TO AR-MSG.                                                03046600
030470 AR-MSG.                                                          03047000
030480     MOVE WS-FUNCTION TO WS-ABFC.                                 03048000
030490 AR-PRINT.                                                        03049000
000000 COPY SRP029.                                                     03050000
030510******************************************************************03051000
030520 END-ROUTINE SECTION.                                             03052000
030530 ER-START.                                                        03053000
030540     MOVE 'GC ' TO SR-APIFUNC.                                    03054000
030550     PERFORM CALL-RPS-BNK.                                        03055000
030560     STOP RUN.                                                    03056000
