000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPD250.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*                                                                *00005000
000060*    RPD250 - SORT TRANSACTION WORK FILE                         *00006000
000070*                                                                *00007000
000080******************************************************************00008000
000090 ENVIRONMENT DIVISION.                                            00009000
000100 CONFIGURATION SECTION.                                           00010000
000110 SPECIAL-NAMES.                                                   00011000
000120     C01 IS C-01, C02 IS C-02, C03 IS C-03.                       00012000
000130 INPUT-OUTPUT SECTION.                                            00013000
000140 FILE-CONTROL.                                                    00014000
000000 COPY RPTRNWS.                                                    00015000
000000 COPY RPTRNWSS.                                                   00016000
000000 COPY RPSORTS.                                                    00017000
000180 DATA DIVISION.                                                   00018000
000190 FILE SECTION.                                                    00019000
000000 COPY RPTRNWF.                                                    00020000
000210 01  RP-TRNWREC                  PIC X(43).                       00021000
000000 COPY RPTRNWSF.                                                   00022000
000230 01  RP-TRNWSREC                 PIC X(43).                       00023000
000000 COPY RPSRT043.                                                   00024000
000250 01  RP-SORTREC.                                                  00025000
000260     03  RP-S-SORT-KEY.                                           00026000
000270         05  RP-S-INST           PIC 9(04).                       00027000
000280         05  RP-S-PRODCODE       PIC X(06).                       00028000
000290         05  RP-S-ACCOUNT        PIC X(18).                       00029000
000300         05  RP-S-EXTC           PIC 9(04).                       00030000
000310         05  RP-S-ITC            PIC X(04).                       00031000
000320     03  RP-S-SORT-DATA.                                          00032000
000330         05  RP-S-AMOUNT         PIC S9(11)V99   COMP-3.          00033000
000340 WORKING-STORAGE SECTION.                                         00034000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00035000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00035001
000360 01  RPS-RLSELIT.                                                 00036000
000000 COPY RPWRLSE.                                                    00037000
000380 01  SRW105-AREAS.                                                00038000
000000 COPY SRW105.                                                     00039000
000400*01  BICPBPRM.                                                    00040000
000000 COPY BICPBPRM.                                                   00041000
000420*01  BICRSRB.                                                     00042000
000000 COPY BICRSRB.                                                    00043000
000440*01  BICRPSB.                                                     00044000
000000 COPY BICRPSB.                                                    00045000
000460*01  BICRVERB.                                                    00046000
000000 COPY BICRVERB.                                                   00047000
000480*01  BICRSTAT.                                                    00048000
000000 COPY BICRSTAT.                                                   00049000
000500*01  BICRDBS.                                                     00050000
000000 COPY BICRDBS.                                                    00051000
000520***************************************************************** 00052000
000530 01  WS-ABEND.                                                    00053000
000000 COPY SRW028.                                                     00054000
000550 01  WS-STORAGE.                                                  00055000
000560     03  FILLER                  PIC X(18)       VALUE            00056000
000570         '*** WS-STORAGE ***'.                                    00057000
000580     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00058000
000590******************************************************************00059000
000600 PROCEDURE DIVISION.                                              00060000
000610******************************************************************00061000
000620 INITIALIZATION SECTION.                                          00062000
000630 IN-START.                                                        00063000
000640     MOVE 'RPD250' TO SR-APIPROGLIT.                              00064000
000650     MOVE 'RPD250' TO WS-ABPROGID.                                00065000
000660 IN-EXIT.                                                         00066000
000670     EXIT.                                                        00067000
000680******************************************************************00068000
000690 MAIN-LOGIC SECTION.                                              00069000
000700 ML-START.                                                        00070000
000710     MOVE 200704 TO SORT-CORE-SIZE.                               00071000
000720     SORT RP-SORTFIL                                              00072000
000730         ASCENDING KEY                                            00073000
000740         RP-S-SORT-KEY                                            00074000
000750         USING RP-TRNWFIL                                         00075000
000760         GIVING RP-TRNWSFIL.                                      00076000
000770     IF SORT-RETURN IS NOT EQUAL TO ZERO                          00077000
000780         GO TO AR-0001.                                           00078000
000790 ML-END.                                                          00079000
000800     GO TO END-ROUTINE.                                           00080000
000810 ML-EXIT.                                                         00081000
000820     EXIT.                                                        00082000
000830******************************************************************00083000
000840 ABORT-ROUTINE SECTION.                                           00084000
000850 AR-0001.                                                         00085000
000860     MOVE 1 TO WS-ABCODE.                                         00086000
000870     GO TO AR-MSG.                                                00087000
000880 AR-MSG.                                                          00088000
000890     MOVE WS-FUNCTION TO WS-ABFC.                                 00089000
000900 AR-PRINT.                                                        00090000
000000 COPY SRP029.                                                     00091000
000920******************************************************************00092000
000930 END-ROUTINE SECTION.                                             00093000
000940 ER-START.                                                        00094000
000950     STOP RUN.                                                    00095000
