000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPD550.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*                                                                *00005000
000060*    RPD550 - RELATIONSHIP PRICING RCIF SYNCHRONIZATION          *00006000
000070*                                                                *00007000
000080******************************************************************00008000
000090 ENVIRONMENT DIVISION.                                            00009000
000100 CONFIGURATION SECTION.                                           00010000
000110 SPECIAL-NAMES.                                                   00011000
000120     C01 IS C-01, C02 IS C-02, C03 IS C-03.                       00012000
000130 INPUT-OUTPUT SECTION.                                            00013000
000140 FILE-CONTROL.                                                    00014000
000000 COPY RFTRNS.                                                     00015000
000000 COPY PRNTERS.                                                    00016000
000170 DATA DIVISION.                                                   00017000
000180 FILE SECTION.                                                    00018000
000000 COPY RFTRNF.                                                     00019000
000200 01  RF-TRNREC                   PIC X(660).                      00020000
000000 COPY PRNTERF.                                                    00021000
000220 01  PRINTERREC.                                                  00022000
000000 COPY SRW016.                                                     00023000
000240     03  PLINE4          REDEFINES PLINE1.                        00024000
000250         05  FILLER              PIC X(05).                       00025000
000260         05  P4-TIMELIT          PIC X(06).                       00026000
000270         05  P4-TIME             PIC 99B99B99.                    00027000
000280         05  FILLER              PIC X(113).                      00028000
000290     03  PLINE5          REDEFINES PLINE1.                        00029000
000300         05  FILLER              PIC X(11).                       00030000
000310         05  P5-INST             PIC 9(04).                       00031000
000320         05  FILLER              PIC X(10).                       00032000
000330         05  P5-PRODCODE         PIC X(06).                       00033000
000340         05  FILLER              PIC X(11).                       00034000
000350         05  P5-TOTAL-ADDED      PIC ZZZ,ZZZ,ZZZ,ZZ9.             00035000
000360         05  FILLER              PIC X(09).                       00036000
000370         05  P5-TOTAL-DELETE     PIC ZZZ,ZZZ,ZZZ,ZZ9.             00037000
000380         05  FILLER              PIC X(51).                       00038000
000390******************************************************************00039000
000400 WORKING-STORAGE SECTION.                                         00040000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00041000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00041001
000420 01  WS-COBOLDATE.                                                00042000
000430     03  WS-COBOLYY              PIC X(02).                       00043000
000440     03  WS-COBOLMM              PIC X(02).                       00044000
000450     03  WS-COBOLDD              PIC X(02).                       00045000
000460 01  WS-COBOLDATE-8.                                              00046000
000470     03  WS-COBOLMM8             PIC X(02).                       00047000
000480     03  FILLER                  PIC X(01)       VALUE '/'.       00048000
000490     03  WS-COBOLDD8             PIC X(02).                       00049000
000500     03  FILLER                  PIC X(01)       VALUE '/'.       00050000
000510     03  WS-COBOLYY8             PIC X(02).                       00051000
000520 01  WS-COBOLTIME.                                                00052000
000530     03  WS-COB-HHMMSS.                                           00053000
000540         05  WS-COB-HH           PIC X(02).                       00054000
000550         05  WS-COB-MM           PIC X(02).                       00055000
000560         05  WS-COB-SS           PIC X(02).                       00056000
000570     03  FILLER                  PIC X(02)       VALUE '00'.      00057000
000580 01  RPS-RLSELIT.                                                 00058000
000000 COPY RPWRLSE.                                                    00059000
000600 01  RCF-RLSELIT.                                                 00060000
000000 COPY RFWRLSE.                                                    00061000
000620 01  MIC-RLSELIT.                                                 00062000
000000 COPY MIWRLSE.                                                    00063000
000640 01  SRW105-AREAS.                                                00064000
000000 COPY SRW105.                                                     00065000
000660*01  BICPBPRM.                                                    00066000
000000 COPY BICPBPRM.                                                   00067000
000680*01  BICRSRB.                                                     00068000
000000 COPY BICRSRB.                                                    00069000
000700*01  BICRPSB.                                                     00070000
000000 COPY BICRPSB.                                                    00071000
000720*01  BICRVERB.                                                    00072000
000000 COPY BICRVERB.                                                   00073000
000740*01  BICRSTAT.                                                    00074000
000000 COPY BICRSTAT.                                                   00075000
000760*01  BICRDBS.                                                     00076000
000000 COPY BICRDBS.                                                    00077000
000780*01  BICRLOG.                                                     00078000
000000 COPY BICRLOG.                                                    00079000
000800*-----------------------------------------------------------------00080000
000810 01  FILLER                      PIC X(08)       VALUE '*RFACC*'. 00081000
000820 01  RFACC-RECORD.                                                00082000
000000 COPY RFSACC.                                                     00083000
000840*-----------------------------------------------------------------00084000
000850 01  FILLER                      PIC X(08)       VALUE '*RFACT*'. 00085000
000860 01  RFACT-RECORD.                                                00086000
000000 COPY RFSACT.                                                     00087000
000880*-----------------------------------------------------------------00088000
000890 01  FILLER                      PIC X(08)       VALUE '*RFCRF*'. 00089000
000900 01  RFCRF-RECORD.                                                00090000
000000 COPY RFSCRF.                                                     00091000
000920*-----------------------------------------------------------------00092000
000930 01  FILLER                      PIC X(08)       VALUE '*RFNON*'. 00093000
000940 01  RFNON-RECORD.                                                00094000
000000 COPY RFSNON.                                                     00095000
000960*-----------------------------------------------------------------00096000
000970 01  FILLER                      PIC X(08)       VALUE '*RFTRN*'. 00097000
000980 01  RFTRN-RECORD.                                                00098000
000000 COPY RFSTRN.                                                     00099000
001000*----------------------------------------------------------------*00100000
001010 01  FILLER                      PIC X(08)       VALUE '*RPBNK*'. 00101000
001020 01  RPBNK-RECORD.                                                00102000
000000 COPY RPSBNK.                                                     00103000
001040*-----------------------------------------------------------------00104000
001050 01  FILLER                      PIC X(08)       VALUE '*RPIDX*'. 00105000
001060 01  RPIDX-RECORD.                                                00106000
000000 COPY RPSIDX.                                                     00107000
001080*-----------------------------------------------------------------00108000
001090 01  FILLER                      PIC X(08)       VALUE '*RFWACC*'.00109000
001100 01  RFACCA-AREA.                                                 00110000
000000 COPY RFWACCA.                                                    00111000
001120*-----------------------------------------------------------------00112000
001130 01  FILLER                      PIC X(08)       VALUE '*RFWACT'. 00113000
001140 01  RFACTA-AREA.                                                 00114000
000000 COPY RFWACTA.                                                    00115000
001160*-----------------------------------------------------------------00116000
001170 01  FILLER                      PIC X(08)       VALUE '*RFWCRF'. 00117000
001180 01  RFCRFA-AREA.                                                 00118000
000000 COPY RFWCRFA.                                                    00119000
001200*-----------------------------------------------------------------00120000
001210 01  FILLER                      PIC X(08)       VALUE '*RFWNON'. 00121000
001220 01  RFNONA-AREA.                                                 00122000
000000 COPY RFWNONA.                                                    00123000
001240*-----------------------------------------------------------------00124000
001250 01  FILLER                      PIC X(08)       VALUE '*RPWBNK'. 00125000
001260 01  RPBNKA-AREA.                                                 00126000
000000 COPY RPWBNKA.                                                    00127000
001280*-----------------------------------------------------------------00128000
001290 01  FILLER                      PIC X(08)       VALUE '*RPWIDX'. 00129000
001300 01  RPIDXA-AREA.                                                 00130000
000000 COPY RPWIDXA.                                                    00131000
001320*-----------------------------------------------------------------00132000
001330 01  RPWPRI-AREAS.                                                00133000
000000 COPY RPWPRI.                                                     00134000
001350 01  MIWPRI-AREAS.                                                00135000
000000 COPY MIWPRI.                                                     00136000
001370 01  MIWMSTA-AREAS.                                               00137000
000000 COPY MIWMSTA.                                                    00138000
001390 01  MIMST-RECORD.                                                00139000
000000 COPY MISMST.                                                     00140000
001410 01  MI1001-RECORD.                                               00141000
000000 COPY MIS1001A.                                                   00142000
001430 01  MI2023-RECORD.                                               00143000
000000 COPY MIS2023A.                                                   00144000
001450 01  MI7100-RECORD.                                               00145000
000000 COPY MIS7100.                                                    00146000
001470*-----------------------------------------------------------------00147000
001480 01  SRW000-AREAS.                                                00148000
000000 COPY SRW000.                                                     00149000
001500 01  SRW009-AREAS.                                                00150000
000000 COPY SRW009.                                                     00151000
001520 01  SRW015-AREAS.                                                00152000
000000 COPY SRW015.                                                     00153000
001540 01  SRW066-AREAS.                                                00154000
000000 COPY SRW066.                                                     00155000
001560 01  SRW196-AREAS.                                                00156000
000000 COPY SRW196.                                                     00157000
001580 01  WS-ABEND.                                                    00158000
000000 COPY SRW028.                                                     00159000
001600 01  WS-RPMIM2023AREAS.                                           00160000
000000 COPY RPW2023.                                                    00161000
001620*-----------------------------------------------------------------00162000
001630 01  WS-LITERALS.                                                 00163000
001640     03  WS-SYSTITLE             PIC X(20)       VALUE            00164000
001650         'RELATIONSHIP PRICING'.                                  00165000
001660     03  WS-RPTTITLE1            PIC X(31)       VALUE            00166000
001670         'RP RCIF SYNCHRONIZATION        '.                       00167000
001680     03  WS-TIMELIT              PIC X(06)       VALUE 'TIME  '.  00168000
001690     03  WS-TOTALLIT             PIC X(11)       VALUE            00169000
001700         'TOTAL COUNT'.                                           00170000
001710     03  WS-HEAD5.                                                00171000
001720         05  FILLER              PIC X(45)       VALUE            00172000
001730             '           INST          PROD CD             '.     00173000
001740         05  FILLER              PIC X(45)       VALUE            00174000
001750             'NEW ACCOUNTS        DELETED ACCOUNTS         '.     00175000
001760         05  FILLER              PIC X(42)       VALUE            00176000
001770             '                                          '.        00177000
001780*-----------------------------------------------------------------00178000
001790 01  WS-WORKAREAS.                                                00179000
001800     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00180000
001810     03  WS-UPD-USER             PIC X(07)       VALUE 'RPD550 '. 00181000
001820     03  WS-RPS-RELCODE          PIC 9(03)       VALUE 089.       00182000
001830     03  WS-SEQNBR               PIC S9(07)      VALUE ZERO       00183000
001840                                                 COMP-3.          00184000
001850     03  WS-FUNC                 PIC X(01)       VALUE SPACE.     00185000
001860     03  WS-IDX-EOF              PIC X(01)       VALUE 'N'.       00186000
001870     03  WS-ACT-STOP             PIC X(01)       VALUE 'N'.       00187000
001880     03  WS-NEW-INST             PIC X(01)       VALUE 'N'.       00188000
001890     03  WS-PROGRAMID            PIC X(07)       VALUE 'RPD550 '. 00189000
P0143      03  WS-ENTERPRISE-SW        PIC X(01)       VALUE SPACES.    00189500
001900     03  WS-TODAY.                                                00190000
001910         05  WS-DTMM             PIC 9(02).                       00191000
001920         05  FILLER              PIC X(01).                       00192000
001930         05  WS-DTDD             PIC 9(02).                       00193000
001940         05  FILLER              PIC X(01).                       00194000
001950         05  WS-DTYY             PIC 9(02).                       00195000
001960     03  WS-HOLDINST             PIC 9(04)       VALUE ZERO.      00196000
001970     03  WS-FILEMESSAGE.                                          00197000
001980         05  FILLER              PIC X(09)       VALUE            00198000
001990             'FILESTAT='.                                         00199000
002000         05  WS-FILESTATUS       PIC X(02)       VALUE SPACES.    00200000
002010         05  FILLER              PIC X(09)       VALUE            00201000
002020             ' FILERET='.                                         00202000
002030         05  WS-FILERETURN       PIC 9(04)       VALUE ZERO.      00203000
002040     03  WS-FILEOPTIONS          PIC X(25)       VALUE SPACES.    00204000
002050     03  WS-FILEOPTS     REDEFINES WS-FILEOPTIONS.                00205000
002060         05  WS-FILEOPT          PIC X(01)       OCCURS 25.       00206000
002070     03  WS-SAVEFILEOPT          PIC X(01).                       00207000
002080     03  WS-TIME                 PIC 9(06).                       00208000
002090     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00209000
002100     03  FILLER          REDEFINES WS-PDATE.                      00210000
002110         05  WS-PDATE-CCYY       PIC 9(04).                       00211000
002120         05  WS-PDATE-MM         PIC 9(02).                       00212000
002130         05  WS-PDATE-DD         PIC 9(02).                       00213000
002140     03  WS-SUB                  PIC S9(04)      COMP             00214000
002150                                                 VALUE ZERO.      00215000
002160     03  WS-SUB1                 PIC S9(04)      COMP             00216000
002170                                                 VALUE ZERO.      00217000
002180     03  WS-TEST-IDX-KEY.                                         00218000
002190         05  WS-TEST-IDX-INST    PIC 9(04).                       00219000
002200         05  WS-TEST-IDX-PRODCODE                                 00220000
002210                                 PIC X(06).                       00221000
002220         05  WS-TEST-IDX-IDNUMBER                                 00222000
002230                                 PIC X(18).                       00223000
002240     03  WS-ACC-INST             PIC 9(04).                       00224000
002250     03  WS-PROD-INST            PIC 9(04)       VALUE ZERO.      00225000
P0143      03  WS-WORK-KEY.                                             00225200
P0143          05  WS-WORK-INST        PIC 9(04).                       00225400
P0143          05  WS-WORK-PRODCODE    PIC X(06).                       00225600
P0143          05  WS-WORK-ACCOUNT     PIC X(18).                       00225800
002260 01  WS-INSTTOTALS.                                               00226000
002270     03 WS-INSTTOT                               OCCURS 1000.     00227000
002280         05  WS-TINST            PIC S9(04)      COMP.            00228000
002290         05  WS-TOT-NEW          PIC S9(12)      COMP-3.          00229000
002300         05  WS-TOT-DELETE       PIC S9(12)      COMP-3.          00230000
002310         05  WS-TOT-PRODCODE     PIC X(06).                       00231000
002320******************************************************************00232000
002330 PROCEDURE DIVISION.                                              00233000
002340******************************************************************00234000
002350 INITIALIZATION SECTION.                                          00235000
002360 IN-START.                                                        00236000
002370     PERFORM GET-FILE-ORGANIZATION.                               00237000
002380     MOVE MIC-MST-APPL-ORG TO SR-APIOPENORG.                      00238000
002390     MOVE MIC-MST-APPL-ORG TO WS-FILEOPT (24).                    00239000
002400     MOVE 'RPD550 ' TO SR-APIPROGLIT.                             00240000
002410     PERFORM INIT-TOTALS.                                         00241000
002420     MOVE WS-PROGRAMID TO WS-ABPROGID.                            00242000
002430 IN-RGNMTBLEND.                                                   00243000
002440     MOVE SPACES TO PRINTERREC.                                   00244000
002450     MOVE ZERO TO RPBNK-INST.                                     00245000
002460     MOVE 'R  ' TO SR-APIFUNC.                                    00246000
002470     PERFORM CALL-RPS-BNK.                                        00247000
002480     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00248000
002490         GO TO AR-0001.                                           00249000
002500     MOVE SPACE TO MI1001-RECORD.                                 00250000
002510     MOVE ZERO TO MIM-1001KINST.                                  00251000
002520     MOVE +1001 TO MIM-1001KREC.                                  00252000
002530     MOVE MIC-MST-1001-PRI TO MIC-MST-REC-PRI.                    00253000
002540     MOVE MI1001-RECORD TO MIMST-RECORD.                          00254000
002550     PERFORM MIC-MST-GET-REQUEST.                                 00255000
002560     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00256000
002570         GO TO AR-0002.                                           00257000
002580     MOVE MIMST-RECORD TO MI1001-RECORD.                          00258000
002590     IF RPBNK-INCH IS EQUAL TO '6'                                00259000
002600         MOVE +55 TO SR-PAGE                                      00260000
002610     ELSE                                                         00261000
002620         MOVE +75 TO SR-PAGE.                                     00262000
002630     MOVE RPBNK-CURDT TO SR-CODASYL.                              00263000
002640     MOVE MIM-1001DATE-SEQ TO SR-CDSEQ.                           00264000
002650     MOVE MIM-1001DATE-DELIM TO SR-CDDELIM.                       00265000
002660     PERFORM EDIT-CODASYL-DATE.                                   00266000
002670     MOVE SR-CODASYL-EDITED TO SR-TODAY-X.                        00267000
002680     ACCEPT WS-COB-HHMMSS FROM TIME.                              00268000
002690     MOVE WS-COB-HHMMSS TO WS-TIME.                               00269000
002700     MOVE SPACES TO SR-BKNAME.                                    00270000
002710     MOVE SPACES TO SR-BRNAME.                                    00271000
002720     MOVE WS-SYSTITLE TO SR-SYSTEM.                               00272000
002730     MOVE +01 TO SR-PGCTR.                                        00273000
002740     OPEN OUTPUT RF-TRNFIL                                        00274000
002750                 PRINTERFIL.                                      00275000
002760     MOVE 'N  ' TO SR-APIFUNC.                                    00276000
002770     PERFORM CALL-RPS-BNK.                                        00277000
002780     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00278000
002790         GO TO AR-0003.                                           00279000
002800     MOVE ZEROS TO MIM-7100KINST.                                 00280000
002810     MOVE ZEROS TO WS-PROD-INST.                                  00281000
002820 IN-EXIT.                                                         00282000
002830     EXIT.                                                        00283000
002840******************************************************************00284000
002850 MAIN-LINE SECTION.                                               00285000
002860 ML-START.                                                        00286000
002870     MOVE LOW-VALUES TO RPIDX-GRP-KEY.                            00287000
002880 ML-IDX.                                                          00288000
002890     PERFORM RPS-IDX-GET-GE-REQUEST.                              00289000
002900 ML-IDX-CONT.                                                     00290000
002910     IF WS-FUNCTION IS EQUAL TO 'E'                               00291000
002920         MOVE ALL '9' TO RPIDX-INST                               00292000
002930         MOVE ALL '9' TO RPIDX-IDNUMBER                           00293000
002940         MOVE 'Y' TO WS-IDX-EOF                                   00294000
002950         GO TO ML-IDX-CONT1.                                      00295000
002960     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00296000
002970         GO TO AR-0004.                                           00297000
002980 ML-IDX-CONT1.                                                    00298000
002990     IF WS-IDX-EOF IS NOT EQUAL TO 'Y'                            00299000
003000         AND RPIDX-RCIF-STATUS IS EQUAL TO 'Q'                    00300000
003010         PERFORM RPS-IDX-GET-NEXT-REQUEST                         00301000
P0143          GO TO ML-IDX-CONT.                                       00302000
003030     MOVE RPBNK-INST TO WS-HOLDINST.                              00303000
003040     IF RPBNK-INST IS EQUAL TO RPIDX-INST                         00304000
003050         GO TO ML-ACT.                                            00305000
P0143      MOVE SPACES TO WS-ENTERPRISE-SW.                             00305500
003060     MOVE 'Y' TO WS-NEW-INST.                                     00306000
003070     MOVE RPBNK-INST TO WS-PROD-INST.                             00307000
003080     PERFORM GET-PRODCODE.                                        00308000
003090     IF SRW196-FUNCTION IS EQUAL TO SPACES                        00309000
003100         GO TO ML-ACT.                                            00310000
003110 ML-BNK.                                                          00311000
003120     MOVE 'N' TO WS-NEW-INST.                                     00312000
003130     MOVE 'N  ' TO SR-APIFUNC.                                    00313000
003140     PERFORM CALL-RPS-BNK.                                        00314000
003150     IF WS-FUNCTION IS EQUAL TO 'E'                               00315000
003160         AND WS-IDX-EOF IS EQUAL TO 'Y'                           00316000
003170         GO TO ML-EXIT.                                           00317000
003180     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00318000
003190         GO TO AR-0005.                                           00319000
003200     MOVE RPBNK-INST TO WS-HOLDINST.                              00320000
003210     IF RPBNK-INST IS EQUAL TO RPIDX-INST                         00321000
003220         GO TO ML-ACT.                                            00322000
003230     IF RPBNK-INST IS GREATER THAN RPIDX-INST                     00323000
003240         AND WS-IDX-EOF IS NOT EQUAL TO 'Y'                       00324000
003250         GO TO AR-0006.                                           00325000
003260     MOVE 'Y' TO WS-NEW-INST.                                     00326000
003270     MOVE RPBNK-INST TO WS-PROD-INST.                             00327000
003280     PERFORM GET-PRODCODE.                                        00328000
003290     IF SRW196-FUNCTION IS NOT EQUAL TO SPACES                    00329000
003300         GO TO ML-BNK.                                            00330000
003310 ML-ACT.                                                          00331000
003320     IF RPBNK-INST IS NOT EQUAL TO MIM-7100KINST                  00332000
003330         PERFORM GET-MICM-7100.                                   00333000
003340     MOVE 'N' TO WS-ACT-STOP.                                     00334000
003350     MOVE LOW-VALUES TO RFACT-GRP-KEY.                            00335000
003360     MOVE WS-HOLDINST TO RFACT-INST.                              00336000
003370     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00337000
003380         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00338000
P0143          MOVE 'Y' TO WS-ENTERPRISE-SW                             00338500
003390         MOVE MIM-7100ENTERPRISEINST TO RFACT-INST.               00339000
003400     MOVE RPIDX-PRODCODE TO RFACT-PRODCODE.                       00340000
003410     PERFORM RCF-ACT-GET-GE-REQUEST.                              00341000
003420     IF WS-FUNCTION IS EQUAL TO 'E'                               00342000
003430         OR RPIDX-PRODCODE IS NOT EQUAL TO RFACT-PRODCODE         00343000
003440         MOVE 'Y' TO WS-ACT-STOP                                  00344000
003450         GO TO ML-SYNC.                                           00345000
003460     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00346000
003470         MOVE RCF-ACT-STAT TO WS-FILESTATUS                       00347000
003480         MOVE RCF-ACT-RETURN TO WS-FILERETURN                     00348000
003490         GO TO AR-0007.                                           00349000
003500 ML-SYNC.                                                         00350000
003510     IF (WS-IDX-EOF IS EQUAL TO 'Y'                               00351000
003520         OR WS-NEW-INST IS EQUAL TO 'Y')                          00352000
003530         AND WS-ACT-STOP IS EQUAL TO 'Y'                          00353000
003540         GO TO ML-BNK.                                            00354000
P0143      IF WS-ENTERPRISE-SW IS EQUAL TO 'Y'                          00354200
P0143          AND RPBNK-INST IS NOT EQUAL TO RFACT-APPL-INST           00354400
P0143          PERFORM RF-GET-NEXT                                      00354600
P0143          GO TO ML-SYNC.                                           00354800
003550     MOVE RPIDX-GRP-KEY TO WS-TEST-IDX-KEY.                       00355000
003560     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00356000
003570         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00357000
003580         MOVE MIM-7100ENTERPRISEINST TO WS-TEST-IDX-INST.         00358000
P0143      IF WS-TEST-IDX-KEY IS LESS THAN RFACT-GRP-KEY                00359000
003600         MOVE 'N' TO WS-FUNC                                      00360000
003610         PERFORM CREATE-RFTRN-FILE                                00361000
003620         PERFORM RP-GET-NEXT                                      00362000
003630         GO TO ML-SYNC.                                           00363000
003640     IF WS-TEST-IDX-KEY IS GREATER THAN RFACT-GRP-KEY             00364000
003650         MOVE 'D' TO WS-FUNC                                      00365000
003660         PERFORM CREATE-RFTRN-FILE                                00366000
003670         PERFORM RF-GET-NEXT                                      00367000
003680         GO TO ML-SYNC.                                           00368000
P0143  ML-GET-NEXT-RECORD.                                              00368500
003690     PERFORM RP-GET-NEXT.                                         00369000
003700     PERFORM RF-GET-NEXT.                                         00370000
003710     GO TO ML-SYNC.                                               00371000
003720 ML-EXIT.                                                         00372000
003730     EXIT.                                                        00373000
003740******************************************************************00374000
003750 END-JOB SECTION.                                                 00375000
003760 EJ-START.                                                        00376000
003770     PERFORM PRINT-TOTALS.                                        00377000
003780     CLOSE PRINTERFIL.                                            00378000
003790     CLOSE RF-TRNFIL.                                             00379000
003800     PERFORM MIC-MST-CLOSE-REQUEST.                               00380000
003810     PERFORM RCF-ACC-CLOSE-REQUEST.                               00381000
003820     PERFORM RCF-ACT-CLOSE-REQUEST.                               00382000
003830     PERFORM RPS-IDX-CLOSE-REQUEST.                               00383000
003840     MOVE 'GC ' TO SR-APIFUNC.                                    00384000
003850     PERFORM CALL-RPS-BNK.                                        00385000
003860     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00386000
003870         GO TO AR-0008.                                           00387000
003880     STOP RUN.                                                    00388000
003890 EJ-EXIT.                                                         00389000
003900     EXIT.                                                        00390000
003910******************************************************************00391000
003920 GET-PRODCODE SECTION.                                            00392000
003930 GP-START.                                                        00393000
003940     MOVE WS-PROD-INST TO MIM-2023KINST.                          00394000
003950     MOVE SPACES TO MIM-2023KPRODCODE.                            00395000
003960     MOVE 50 TO MIM-2023INTAPPL211.                               00396000
003970     MOVE 'Y' TO SRW196-FIND-APPL.                                00397000
003980     MOVE WS-RPMIM2023BANKSW TO SRW196-BANKS.                     00398000
003990     PERFORM SRP196-GET-2023-RECORD.                              00399000
004000     IF SRW196-FUNCTION IS NOT EQUAL TO SPACES                    00400000
004010         GO TO GP-EXIT.                                           00401000
004020 GP-EXIT.                                                         00402000
004030     EXIT.                                                        00403000
004040******************************************************************00404000
004050 RP-GET-NEXT SECTION.                                             00405000
004060 RPGN-START.                                                      00406000
004070     IF WS-IDX-EOF IS EQUAL TO 'Y'                                00407000
004080         GO TO RPGN-EXIT.                                         00408000
004090 RPGN-READ-IDX.                                                   00409000
004100     PERFORM RPS-IDX-GET-NEXT-REQUEST.                            00410000
004110     IF WS-FUNCTION IS EQUAL TO 'E'                               00411000
004120         MOVE ALL '9' TO RPIDX-INST                               00412000
004130         MOVE ALL '9' TO RPIDX-IDNUMBER                           00413000
004140         MOVE 'Y' TO WS-IDX-EOF                                   00414000
004150         GO TO RPGN-EXIT.                                         00415000
004160     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00416000
004170         GO TO AR-0009.                                           00417000
004180     IF RPIDX-RCIF-STATUS IS EQUAL TO 'Q'                         00418000
004190         GO TO RPGN-READ-IDX.                                     00419000
004200     IF WS-HOLDINST IS NOT EQUAL TO RPIDX-INST                    00420000
004210         MOVE 'Y' TO WS-NEW-INST.                                 00421000
004220 RPGN-EXIT.                                                       00422000
004230     EXIT.                                                        00423000
004240******************************************************************00424000
004250 RF-GET-NEXT SECTION.                                             00425000
004260 RFGN-START.                                                      00426000
004270     PERFORM RCF-ACT-GET-NEXT-REQUEST.                            00427000
004280     IF WS-FUNCTION IS EQUAL TO 'E'                               00428000
004290         OR RPIDX-PRODCODE IS NOT EQUAL TO RFACT-PRODCODE         00429000
004300         MOVE 'Y' TO WS-ACT-STOP                                  00430000
004310         GO TO RFGN-EXIT.                                         00431000
004320     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00432000
004330         MOVE RCF-ACT-STAT TO WS-FILESTATUS                       00433000
004340         MOVE RCF-ACT-RETURN TO WS-FILERETURN                     00434000
004350         GO TO AR-0010.                                           00435000
004360 RFGN-EXIT.                                                       00436000
004370     EXIT.                                                        00437000
004380******************************************************************00438000
004390 CREATE-RFTRN-FILE SECTION.                                       00439000
004400 CTRNF-START.                                                     00440000
004410     MOVE WS-HOLDINST TO WS-SUB.                                  00441000
004420     MOVE WS-SUB TO WS-TINST (WS-SUB).                            00442000
004430     IF WS-TOT-PRODCODE (WS-SUB) IS NOT EQUAL TO RPIDX-PRODCODE   00443000
004440         AND WS-TOT-PRODCODE (WS-SUB) IS GREATER THAN SPACES      00444000
004450         MOVE 'INSTITUTION MISSING 2023 RECORD FOR RP'            00445000
004460             TO WS-ABORTMSG                                       00446000
004470         GO TO AR-0011                                            00447000
004480     ELSE                                                         00448000
004490         MOVE RPIDX-PRODCODE TO WS-TOT-PRODCODE (WS-SUB).         00449000
004500     INITIALIZE RFTRN-RECORD.                                     00450000
004510     MOVE ZERO TO WS-SEQNBR.                                      00451000
004520     IF WS-FUNC IS EQUAL TO 'D'                                   00452000
004530         GO TO CTRNF-STATUS.                                      00453000
004540 CTRNF-ACC.                                                       00454000
004550     MOVE LOW-VALUES TO RFACC-GRP-KEY.                            00455000
004560     MOVE RPIDX-INST2 TO WS-ACC-INST.                             00456000
004570     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00457000
004580         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00458000
004590         MOVE MIM-7100ENTERPRISEINST TO WS-ACC-INST.              00459000
004600     MOVE WS-ACC-INST TO RFACC-INST.                              00460000
004610     MOVE RPIDX-PRODCODE2 TO RFACC-PRODCODE.                      00461000
004620     MOVE RPIDX-ACCT2 TO RFACC-ACCT.                              00462000
004630     PERFORM RCF-ACC-GET-GE-REQUEST.                              00463000
004640     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00464000
004650         MOVE RCF-ACC-STAT TO WS-FILESTATUS                       00465000
004660         MOVE RCF-ACC-RETURN TO WS-FILERETURN                     00466000
004670         GO TO AR-0012.                                           00467000
004680     IF WS-ACC-INST IS NOT EQUAL TO RFACC-INST                    00468000
004690         OR RPIDX-PRODCODE2 IS NOT EQUAL TO RFACC-PRODCODE        00469000
004700         OR RPIDX-ACCT2 IS NOT EQUAL TO RFACC-ACCT                00470000
004710         OR RFACC-REL-GRP IS GREATER THAN 99                      00471000
004720         DISPLAY 'MISSING RCIF ACCOUNT TO CUSTOMER RECORD'        00472000
004730         DISPLAY ' INST: ' RPIDX-INST2                            00473000
004740             ' PRODCD: ' RPIDX-PRODCODE2                          00474000
004750             ' ACCOUNT: ' RPIDX-ACCT2                             00475000
004760             ' REL: ' RFACC-REL-GRP                               00476000
004770         GO TO CTRNF-EXIT.                                        00477000
004780     MOVE RPIDX-GRP-KEY TO WS-TEST-IDX-KEY.                       00478000
004790     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00479000
004800         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00480000
004810         MOVE MIM-7100ENTERPRISEINST TO WS-TEST-IDX-INST.         00481000
004820     MOVE WS-TEST-IDX-KEY TO RFTRN-GRP-KEY.                       00482000
004830     MOVE RPIDX-INST2 TO RFTRN-APPL-INST.                         00483000
004840     IF WS-PROD-INST IS NOT EQUAL TO RPIDX-INST                   00484000
004850         MOVE RPIDX-INST TO WS-PROD-INST                          00485000
004860         PERFORM GET-PRODCODE.                                    00486000
P0143      MOVE 'RPS' TO RFTRN-APPL-CD.                                 00487000
004880     MOVE RPIDX-IDNUMBER TO RFTRN-APPL-ACCT.                      00488000
004890     MOVE WS-SEQNBR TO RFTRN-SEQNBR.                              00489000
004900     MOVE 'N' TO RFTRN-FUNC.                                      00490000
004910     MOVE 'RPS' TO RFTRN-FILEID.                                  00491000
004920     MOVE 'O' TO RFTRN-STATUS.                                    00492000
004930     MOVE RPBNK-CURDT TO RFTRN-DT-OPENED.                         00493000
004940     MOVE WS-RPS-RELCODE TO RFTRN-REL-CODE.                       00494000
004950     MOVE RFACC-CUST-TYPE TO RFTRN-CUST-TYPE.                     00495000
004960     MOVE RFACC-CUST TO RFTRN-CUST.                               00496000
004970     MOVE WS-ACC-INST TO RFCRF-INST.                              00497000
004980     MOVE RFTRN-CUST-TYPE TO RFCRF-CUST-TYPE.                     00498000
004990     MOVE RFTRN-CUST TO RFCRF-CUST.                               00499000
005000     IF RFTRN-CUST-TYPE IS EQUAL TO 'R'                           00500000
005010         PERFORM RCF-CRF-GET-GE-REQUEST                           00501000
005020             IF WS-FUNCTION IS NOT EQUAL TO SPACES                00502000
005030                 MOVE RCF-CRF-STAT TO WS-FILESTATUS               00503000
005040                 MOVE RCF-CRF-RETURN TO WS-FILERETURN             00504000
005050                 GO TO AR-0016                                    00505000
005060             END-IF                                               00506000
005070         MOVE RFCRF-CUST-NO TO RFTRN-CUST-NO                      00507000
005080     ELSE                                                         00508000
005090         MOVE RFCRF-GRP-KEY TO RFNON-GRP-KEY                      00509000
P0143          PERFORM RCF-NON-GET-GE-REQUEST                           00510000
005110             IF WS-FUNCTION IS NOT EQUAL TO SPACES                00511000
P0143                  MOVE RCF-NON-STAT TO WS-FILESTATUS               00512000
P0143                  MOVE RCF-NON-RETURN TO WS-FILERETURN             00512590
005140                 GO TO AR-0017                                    00514000
005150             END-IF                                               00515000
005160         MOVE RFNON-CUST-NO TO RFTRN-CUST-NO                      00516000
005170     END-IF.                                                      00517000
005180     MOVE '1' TO RFTRN-NEW-METHOD-CD.                             00518000
005190     PERFORM WRITE-RFTRN-RECORD.                                  00519000
005200     ADD +1 TO WS-TOT-NEW (WS-SUB).                               00520000
005210     GO TO CTRNF-EXIT.                                            00521000
005220 CTRNF-STATUS.                                                    00522000
005230     MOVE RFACT-GRP-KEY TO RFTRN-GRP-KEY.                         00523000
005240     MOVE RFACT-GRP-AIX1 TO RFTRN-APPL-ACCT-KEY.                  00524000
005250     IF RFACT-STATUS IS EQUAL TO 'C'                              00525000
005260         GO TO CTRNF-CLOSE.                                       00526000
005270     IF RFACT-STATUS IS EQUAL TO 'D'                              00527000
005280         GO TO CTRNF-DELETE.                                      00528000
005290     ADD +1 TO WS-SEQNBR.                                         00529000
005300     MOVE WS-SEQNBR TO RFTRN-SEQNBR.                              00530000
005310     MOVE 'M' TO RFTRN-FUNC.                                      00531000
005320     MOVE 'RPS' TO RFTRN-FILEID.                                  00532000
005330     MOVE 'C' TO RFTRN-STATUS.                                    00533000
005340     PERFORM WRITE-RFTRN-RECORD.                                  00534000
005350 CTRNF-CLOSE.                                                     00535000
005360     ADD +1 TO WS-SEQNBR.                                         00536000
005370     MOVE WS-SEQNBR TO RFTRN-SEQNBR.                              00537000
005380     MOVE 'M' TO RFTRN-FUNC.                                      00538000
005390     MOVE 'RPS' TO RFTRN-FILEID.                                  00539000
005400     MOVE 'D' TO RFTRN-STATUS.                                    00540000
005410     PERFORM WRITE-RFTRN-RECORD.                                  00541000
005420 CTRNF-DELETE.                                                    00542000
005430     ADD +1 TO WS-SEQNBR.                                         00543000
005440     MOVE WS-SEQNBR TO RFTRN-SEQNBR.                              00544000
005450     MOVE 'D' TO RFTRN-FUNC.                                      00545000
005460     MOVE 'RPS' TO RFTRN-FILEID.                                  00546000
005470     ADD +1 TO WS-TOT-DELETE (WS-SUB).                            00547000
005480     PERFORM WRITE-RFTRN-RECORD.                                  00548000
005490 CTRNF-EXIT.                                                      00549000
005500     EXIT.                                                        00550000
005510******************************************************************00551000
005520 PRINT-TOTALS SECTION.                                            00552000
005530 PT-START.                                                        00553000
005540     MOVE WS-RPTTITLE1 TO SR-REPORT.                              00554000
005550     MOVE 50201 TO SR-RPTNBR.                                     00555000
005560     MOVE +01 TO SR-PGCTR.                                        00556000
005570     PERFORM HEADING-ROUTINE.                                     00557000
005580     MOVE WS-HEAD5 TO PLINE1.                                     00558000
005590     PERFORM PR-02 THRU PR-EXIT.                                  00559000
005600 PT-PRINT.                                                        00560000
005610     MOVE +1 TO WS-SUB.                                           00561000
005620 PT-LOOP.                                                         00562000
005630     IF WS-TOT-NEW (WS-SUB) IS EQUAL TO ZEROS                     00563000
005640         AND WS-TOT-DELETE (WS-SUB) IS EQUAL TO ZEROS             00564000
005650         GO TO PT-TEST.                                           00565000
005660     MOVE WS-SUB TO P5-INST.                                      00566000
005670     MOVE WS-TOT-PRODCODE (WS-SUB) TO P5-PRODCODE.                00567000
005680     MOVE WS-TOT-NEW (WS-SUB) TO P5-TOTAL-ADDED.                  00568000
005690     MOVE WS-TOT-DELETE (WS-SUB) TO P5-TOTAL-DELETE.              00569000
005700     PERFORM PR-01 THRU PR-EXIT.                                  00570000
005710     PERFORM PR-02 THRU PR-EXIT.                                  00571000
005720     ADD WS-TOT-NEW (WS-SUB) TO WS-TOT-NEW (1000).                00572000
005730     ADD WS-TOT-DELETE (WS-SUB) TO WS-TOT-DELETE (1000).          00573000
005740 PT-TEST.                                                         00574000
005750     ADD +1 TO WS-SUB.                                            00575000
005760     IF WS-SUB IS LESS THAN +1000                                 00576000
005770         GO TO PT-LOOP.                                           00577000
005780     IF (SR-LINES + 9) IS GREATER THAN +56                        00578000
005790         ADD +1 TO SR-PGCTR                                       00579000
005800         PERFORM HEADING-ROUTINE                                  00580000
005810         MOVE WS-HEAD5 TO PLINE1                                  00581000
005820         PERFORM PR-01 THRU PR-EXIT.                              00582000
005830     MOVE '  TOTAL COUNT' TO PLINE5.                              00583000
005840     MOVE WS-TOT-PRODCODE (1000) TO P5-PRODCODE.                  00584000
005850     MOVE WS-TOT-NEW (1000) TO P5-TOTAL-ADDED.                    00585000
005860     MOVE WS-TOT-DELETE (1000) TO P5-TOTAL-DELETE.                00586000
005870     PERFORM PR-02 THRU PR-EXIT.                                  00587000
005880 PT-EXIT.                                                         00588000
005890     EXIT.                                                        00589000
005900******************************************************************00590000
005910 WRITE-RFTRN-RECORD SECTION.                                      00591000
005920 WRR-START.                                                       00592000
005930     MOVE RFTRN-RECORD TO RF-TRNREC.                              00593000
005940     WRITE RF-TRNREC                                              00594000
005950         INVALID KEY                                              00595000
005960         GO TO AR-0014.                                           00596000
005970     MOVE SPACES TO RF-TRNREC.                                    00597000
005980 WRR-EXIT.                                                        00598000
005990     EXIT.                                                        00599000
006000******************************************************************00600000
006010 HEADING-ROUTINE SECTION.                                         00601000
000000 COPY SRP016.                                                     00602000
006030 HR-CONT.                                                         00603000
006040     MOVE WS-TIMELIT TO P4-TIMELIT.                               00604000
006050     MOVE WS-TIME TO P4-TIME.                                     00605000
006060     INSPECT P4-TIME REPLACING ALL SPACES BY '.'.                 00606000
006070     PERFORM PR-02 THRU PR-EXIT.                                  00607000
006080 HR-END.                                                          00608000
006090     EXIT.                                                        00609000
006100******************************************************************00610000
006110 INIT-TOTALS SECTION.                                             00611000
006120 IT-START.                                                        00612000
006130     MOVE ZEROS TO WS-TOT-NEW (1).                                00613000
006140     MOVE ZEROS TO WS-TOT-DELETE (1).                             00614000
006150     MOVE SPACES TO WS-TOT-PRODCODE (1).                          00615000
006160     MOVE +1 TO WS-SUB.                                           00616000
006170 IT-LOOP.                                                         00617000
006180     ADD +1 TO WS-SUB.                                            00618000
006190     IF WS-SUB IS GREATER THAN 1000                               00619000
006200         GO TO IT-EXIT.                                           00620000
006210     MOVE WS-INSTTOT (1) TO WS-INSTTOT (WS-SUB).                  00621000
006220     GO TO IT-LOOP.                                               00622000
006230 IT-EXIT.                                                         00623000
006240     EXIT.                                                        00624000
006250******************************************************************00625000
006260 GET-MICM-7100 SECTION.                                           00626000
006270 GM7100-START.                                                    00627000
006280     MOVE SPACES TO MI7100-RECORD.                                00628000
006290     MOVE RPBNK-INST TO MIM-7100KINST.                            00629000
006300     MOVE +7100 TO MIM-7100KREC.                                  00630000
006310     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00631000
006320     MOVE MI7100-RECORD TO MIMST-RECORD.                          00632000
006330     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00633000
006340     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00634000
006350         GO TO AR-0015.                                           00635000
006360     MOVE MIMST-RECORD TO MI7100-RECORD.                          00636000
006370 GM7100-EXIT.                                                     00637000
006380     EXIT.                                                        00638000
006390******************************************************************00639000
000000 COPY RFPACCA.                                                    00640000
006410******************************************************************00641000
000000 COPY RFPACTA.                                                    00642000
006430******************************************************************00643000
000000 COPY RFPCRFA.                                                    00644000
006450******************************************************************00645000
000000 COPY RFPNONA.                                                    00646000
006470******************************************************************00647000
006480 CALL-RPS-BNK SECTION.                                            00648000
000000 COPY RPPBNKB.                                                    00649000
006500******************************************************************00650000
000000 COPY RPPIDXA.                                                    00651000
006520******************************************************************00652000
006530 MIC-MST-API SECTION.                                             00653000
000000 COPY MIPMSTA.                                                    00654000
006550***************************************************************** 00655000
006560 PRINTER-ROUTINE SECTION.                                         00656000
000000 COPY SRP017.                                                     00657000
006580******************************************************************00658000
006590 EDIT-CODASYL-DATE SECTION.                                       00659000
000000 COPY SRP087.                                                     00660000
006610******************************************************************00661000
006620 SRP196-GET-2023-RECORD SECTION.                                  00662000
000000 COPY SRP196.                                                     00663000
006640******************************************************************00664000
006650 GET-FILE-ORGANIZATION SECTION.                                   00665000
000000 COPY SRP093.                                                     00666000
006670***************************************************************** 00667000
006680 ABORT-ROUTINE SECTION.                                           00668000
006690 AR-0001.                                                         00669000
006700     MOVE 0001 TO WS-ABCODE.                                      00670000
006710     GO TO AR-MSG.                                                00671000
006720 AR-0002.                                                         00672000
006730     MOVE 0002 TO WS-ABCODE.                                      00673000
006740     GO TO AR-MSG.                                                00674000
006750 AR-0003.                                                         00675000
006760     MOVE 0003 TO WS-ABCODE.                                      00676000
006770     GO TO AR-MSG.                                                00677000
006780 AR-0004.                                                         00678000
006790     MOVE 0004 TO WS-ABCODE.                                      00679000
006800     GO TO AR-MSG.                                                00680000
006810 AR-0005.                                                         00681000
006820     MOVE 0005 TO WS-ABCODE.                                      00682000
006830     GO TO AR-MSG.                                                00683000
006840 AR-0006.                                                         00684000
006850     MOVE 0006 TO WS-ABCODE.                                      00685000
006860     GO TO AR-MSG.                                                00686000
006870 AR-0007.                                                         00687000
006880     MOVE 0007 TO WS-ABCODE.                                      00688000
006890     GO TO AR-MSG.                                                00689000
006900 AR-0008.                                                         00690000
006910     MOVE 0008 TO WS-ABCODE.                                      00691000
006920     GO TO AR-MSG.                                                00692000
006930 AR-0009.                                                         00693000
006940     MOVE 0009 TO WS-ABCODE.                                      00694000
006950     GO TO AR-MSG.                                                00695000
006960 AR-0010.                                                         00696000
006970     MOVE 0010 TO WS-ABCODE.                                      00697000
006980     GO TO AR-MSG.                                                00698000
006990 AR-0011.                                                         00699000
007000     MOVE 0011 TO WS-ABCODE.                                      00700000
007010     GO TO AR-MSG.                                                00701000
007020 AR-0012.                                                         00702000
007030     MOVE 0012 TO WS-ABCODE.                                      00703000
007040     GO TO AR-MSG.                                                00704000
007050 AR-0013.                                                         00705000
007060     MOVE 0013 TO WS-ABCODE.                                      00706000
007070     GO TO AR-MSG.                                                00707000
007080 AR-0014.                                                         00708000
007090     MOVE 0014 TO WS-ABCODE.                                      00709000
007100     GO TO AR-MSG.                                                00710000
007110 AR-0015.                                                         00711000
007120     MOVE 0015 TO WS-ABCODE.                                      00712000
007130     GO TO AR-MSG.                                                00713000
007140 AR-0016.                                                         00714000
007150     MOVE 0016 TO WS-ABCODE.                                      00715000
007160     GO TO AR-MSG.                                                00716000
007170 AR-0017.                                                         00717000
007180     MOVE 0017 TO WS-ABCODE.                                      00718000
007190     GO TO AR-MSG.                                                00719000
007200 AR-MSG.                                                          00720000
007210     MOVE WS-FUNCTION TO WS-ABFC.                                 00721000
007220     IF WS-ABORTMSG IS EQUAL TO SPACES                            00722000
007230         MOVE WS-FILEMESSAGE TO WS-ABORTMSG.                      00723000
007240 AR-PRINT.                                                        00724000
000000 COPY SRP029.                                                     00725000
007260******************************************************************00726000
