000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPG052.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPG052 - ACCOUNT INCENTIVE REPORT                           *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  WS-MIM1006KEY.                                               00012000
000130     03  WS-MIM1006APPL          PIC 9(02).                       00013000
000140     03  WS-MIM1006FORM          PIC 9(03).                       00014000
000150     03  WS-MIM1006ERR           PIC 9(03).                       00015000
000160 01  SRW000-AREAS.                                                00016000
000000 COPY SRW000.                                                     00017000
000180 01  MIMST-RECORD.                                                00018000
000000 COPY MISMST.                                                     00019000
000200 01  MIWMSTA-AREAS.                                               00020000
000000 COPY MIWMSTA.                                                    00021000
000220 01  MIWPRI-AREAS.                                                00022000
000000 COPY MIWPRI.                                                     00023000
000240 01  MI1006-RECORD.                                               00024000
000000 COPY MIS1006A.                                                   00025000
000260 01  MI2023-RECORD.                                               00026000
000000 COPY MIS2023A.                                                   00027000
000280 01  SRW105-AREAS.                                                00028000
000000 COPY SRW105.                                                     00029000
000300*01  BICPBPRM.                                                    00030000
000000 COPY BICPBPRM.                                                   00031000
000320*01  BICRSRB.                                                     00032000
000000 COPY BICRSRB.                                                    00033000
000340*01  BICRPSB.                                                     00034000
000000 COPY BICRPSB.                                                    00035000
000360*01  BICRVERB.                                                    00036000
000000 COPY BICRVERB.                                                   00037000
000380*01  BICRSTAT.                                                    00038000
000000 COPY BICRSTAT.                                                   00039000
000400*01  BICRDBS.                                                     00040000
000000 COPY BICRDBS.                                                    00041000
000420*01  BICRLOG.                                                     00042000
000000 COPY BICRLOG.                                                    00043000
000440 01  MIC-RLSELIT.                                                 00044000
000000 COPY MIWRLSE.                                                    00045000
000460 01  RPW015-AREAS.                                                00046000
000000 COPY RPW015.                                                     00047000
000480 01  WS-RPMIM2023AREAS.                                           00048000
000000 COPY RPW2023.                                                    00049000
000500*----------------------------------------------------------------*00050000
000510 01  PRINTERREC.                                                  00051000
000000 COPY SRW016.                                                     00052000
000530     03  PLINE4          REDEFINES   PLINE1.                      00053000
000540         05  P4-PRODCODE         PIC X(06).                       00054000
000550         05  FILLER              PIC X(02).                       00055000
000560         05  P4-ACCOUNT          PIC X(22).                       00056000
000570         05  FILLER              PIC X(03).                       00057000
000580         05  P4-SCMODEL          PIC X(10).                       00058000
000590         05  FILLER              PIC X(02).                       00059000
000600         05  P4-SCOPT            PIC X(01).                       00060000
000610         05  FILLER              PIC X(03).                       00061000
000620         05  P4-SCQUAL           PIC X(01).                       00062000
000630         05  FILLER              PIC X(04).                       00063000
000640         05  P4-SCAMOUNT         PIC ZZZ.99-.                     00064000
000650         05  FILLER              PIC X(01).                       00065000
000660         05  P4-SCPCT            PIC .99999.                      00066000
000670         05  FILLER              PIC X(04).                       00067000
000680         05  P4-RATEMODEL        PIC X(10).                       00068000
000690         05  FILLER              PIC X(02).                       00069000
000700         05  P4-RATEOPT          PIC X(01).                       00070000
000710         05  FILLER              PIC X(03).                       00071000
000720         05  P4-RATEQUAL         PIC X(01).                       00072000
000730         05  FILLER              PIC X(03).                       00073000
000740         05  P4-RATEPCT          PIC .9(09).                      00074000
000750         05  FILLER              PIC X(02).                       00075000
000760         05  P4-RATETYPE         PIC X(01).                       00076000
000770         05  FILLER              PIC X(05).                       00077000
000780         05  P4-SPLITRATE        PIC X(01).                       00078000
000790         05  FILLER              PIC X(06).                       00079000
000800         05  P4-PROCOPT          PIC X(01).                       00080000
000810         05  FILLER              PIC X(14).                       00081000
000820     03  PLINE5          REDEFINES   PLINE1.                      00082000
000830         05  FILLER              PIC X(22).                       00083000
000840         05  P5-TIERCOL1-HDR     PIC X(04).                       00084000
000850         05  FILLER              PIC X(01).                       00085000
000860         05  P5-BALANCE1         PIC ZZZ,ZZZ,ZZ9.                 00086000
000870         05  FILLER              PIC X(01).                       00087000
000880         05  P5-RATE1            PIC .9(09).                      00088000
000890         05  FILLER              PIC X(02).                       00089000
000900         05  P5-TIERCOL2-HDR     PIC X(04).                       00090000
000910         05  FILLER              PIC X(01).                       00091000
000920         05  P5-BALANCE2         PIC ZZZ,ZZZ,ZZ9.                 00092000
000930         05  FILLER              PIC X(01).                       00093000
000940         05  P5-RATE2            PIC .9(09).                      00094000
000950         05  FILLER              PIC X(02).                       00095000
000960         05  P5-TIERCOL3-HDR     PIC X(04).                       00096000
000970         05  FILLER              PIC X(01).                       00097000
000980         05  P5-BALANCE3         PIC ZZZ,ZZZ,ZZ9.                 00098000
000990         05  FILLER              PIC X(01).                       00099000
001000         05  P5-RATE3            PIC .9(09).                      00100000
001010         05  FILLER              PIC X(25).                       00101000
001020*----------------------------------------------------------------*00102000
001030 01  WS-SRW033.                                                   00103000
000000 COPY SRW033.                                                     00104000
001050*----------------------------------------------------------------*00105000
001060*    SUBSCRIPT USAGE                                             *00106000
001070*        WS-SUB1 - POINTER FOR LS-PRINTLINES.                    *00107000
001080*        WS-SUB2 - ROUTINE POINTER FOR RETURN.                   *00108000
001090*        WS-SUB3 - WORK SUBSCRIPT.                               *00109000
001100*        WS-SUB4 - WORK SUBSCRIPT.                               *00110000
001110*----------------------------------------------------------------*00111000
001120 01  WS-SUBSCRIPTS.                                               00112000
001130     03  WS-SUB1                 PIC S9(04)      COMP             00113000
001140                                                 VALUE ZERO.      00114000
001150     03  WS-SUB2                 PIC S9(04)      COMP             00115000
001160                                                 VALUE ZERO.      00116000
001170     03  WS-SUB3                 PIC S9(04)      COMP             00117000
001180                                                 VALUE ZERO.      00118000
001190     03  WS-SUB4                 PIC S9(04)      COMP             00119000
001200                                                 VALUE ZERO.      00120000
001210*----------------------------------------------------------------*00121000
001220 01  WS-HEADINGS.                                                 00122000
001230     03  FILLER                  PIC X(19)       VALUE            00123000
001240         '*** WS-HEADINGS ***'.                                   00124000
001250     03  WS-HEAD01.                                               00125000
001260         05  FILLER              PIC X(44)       VALUE            00126000
001270             '*---------- ACCOUNT ---------*   *--------- '.      00127000
001280         05  FILLER              PIC X(44)       VALUE            00128000
001290             'SERVICE CHARGE ---------*   *---------------'.      00129000
001300         05  FILLER              PIC X(44)       VALUE            00130000
001310             '------ RATE ---------------------*          '.      00131000
001320     03  WS-HEAD02.                                               00132000
001330         05  FILLER              PIC X(44)       VALUE            00133000
001340             'PROD CD         ACCOUNT NUMBER   MODEL      '.      00134000
001350         05  FILLER              PIC X(44)       VALUE            00135000
001360             'OPT QUAL  AMOUNT  PERCENT   MODEL      OPT Q'.      00136000
001370         05  FILLER              PIC X(44)       VALUE            00137000
001380             'UAL PERCENT    TYPE SPLIT PROC OPT          '.      00138000
001390     03  WS-HEAD03.                                               00139000
001400         05  FILLER              PIC X(44)       VALUE            00140000
001410             '      * SPLIT RATE *           BALANCE RATE '.      00141000
001420         05  FILLER              PIC X(44)       VALUE            00142000
001430             '                BALANCE RATE                '.      00143000
001440         05  FILLER              PIC X(44)       VALUE            00144000
001450             ' BALANCE RATE                               '.      00145000
001460 01  WS-TOTALS.                                                   00146000
001470     03  FILLER                  PIC X(17)       VALUE            00147000
001480         '*** WS-TOTALS ***'.                                     00148000
001490     03  WS-TOTAL1.                                               00149000
001500         05  FILLER              PIC X(16)       VALUE            00150000
001510         '           INST '.                                      00151000
001520         05  WS-T1INST           PIC 9(04).                       00152000
001530         05  FILLER              PIC X(33)       VALUE            00153000
001540             '       ACCOUNT INCENTIVE RECORDS '.                 00154000
001550         05  WS-T1ACTREC         PIC ZZZ,ZZZ,ZZZ,ZZ9.             00155000
001560         05  FILLER              PIC X(64)       VALUE SPACES.    00156000
001570     03  WS-TOTAL2.                                               00157000
001580         05  FILLER              PIC X(20)       VALUE SPACES.    00158000
001590         05  FILLER              PIC X(33)       VALUE            00159000
001600             '    DUPLICATE ACCOUNT INCENTIVES '.                 00160000
001610         05  WS-T2DUPREC         PIC ZZZ,ZZZ,ZZZ,ZZ9.             00161000
001620         05  FILLER              PIC X(64)       VALUE SPACES.    00162000
001630*----------------------------------------------------------------*00163000
001640 01  WS-RPW001-AREAS.                                             00164000
000000 COPY RPW001.                                                     00165000
001660******************************************************************00166000
001670 01  WS-STORAGE.                                                  00167000
001680     03  WS-HEADSW               PIC X(01)       VALUE SPACE.     00168000
001690     03  WS-FUNCTION             PIC X(01)       VALUE SPACE.     00169000
001700     03  WS-EDITEDACCOUNT.                                        00170000
001710         05  WS-EDITACCT         PIC X(22).                       00171000
001720     03  WS-EFTIMEX.                                              00172000
001730         05  WS-EFTIME           PIC 99B99B99.                    00173000
001740     03  WS-DATEIN               PIC 9(8).                        00174000
001750     03  FILLER          REDEFINES WS-DATEIN.                     00175000
001760         05  WS-DATEIN-YYYY      PIC X(04).                       00176000
001770         05  WS-DATEIN-MM        PIC X(02).                       00177000
001780         05  WS-DATEIN-DD        PIC X(02).                       00178000
001790     03  WS-DATEOUT.                                              00179000
001800         05  WS-DATEOUT-MM       PIC X(02).                       00180000
001810         05  FILLER              PIC X(01)       VALUE '/'.       00181000
001820         05  WS-DATEOUT-DD       PIC X(02).                       00182000
001830         05  FILLER              PIC X(01)       VALUE '/'.       00183000
001840         05  WS-DATEOUT-YYYY     PIC X(04).                       00184000
001850*----------------------------------------------------------------*00185000
001860     03  WS-REC-COUNT            PIC S9(04)      COMP.            00186000
001870     03  WS-52LASTINST           PIC S9(03)      COMP-3.          00187000
001880     03  WS-EDITED-DATE.                                          00188000
001890         05  FILLER              PIC X(02).                       00189000
001900         05  WS-DATE-SLASH-1     PIC X.                           00190000
001910         05  FILLER              PIC X(02).                       00191000
001920         05  WS-DATE-SLASH-2     PIC X.                           00192000
001930         05  FILLER              PIC X(02).                       00193000
001940     03  WS-DATE-EDIT-AREA                                        00194000
001950                         REDEFINES WS-EDITED-DATE                 00195000
001960                                 PIC 99,99,99.                    00196000
001970     03  WS-NUMOFACTREC          PIC S9(05)      COMP-3           00197000
001980                                                 VALUE ZEROS.     00198000
001990     03  WS-NUMOFDUPREC          PIC S9(05)      COMP-3           00199000
002000                                                 VALUE ZEROS.     00200000
002010     03  WS-SPLITRATETABLE.                                       00201000
002020         05  WS-SPLITRATE-DATA                   OCCURS 15.       00202000
002030             07  WS-SPLITRATEAMT PIC S9(09)      COMP-3.          00203000
002040             07  WS-SPLITRATEPCT PIC SV9(09)     COMP-3.          00204000
002050     03  WS-SPLITRATE-TIER-HEADERS.                               00205000
002060         05  FILLER              PIC X(32)       VALUE            00206000
002070         ' (1) (2) (3) (4) (5) (6) (7) (8)'.                      00207000
002080         05  FILLER              PIC X(28)       VALUE            00208000
002090         ' (9)(10)(11)(12)(13)(14)(15)'.                          00209000
002100     03  WS-SPLITRATE-TIER-HEADERSX                               00210000
002110                         REDEFINES WS-SPLITRATE-TIER-HEADERS.     00211000
002120         05  WS-SPLITRATE-TIER-HDR                                00212000
002130                                 PIC X(04)       OCCURS 15.       00213000
002140******************************************************************00214000
002150 LINKAGE SECTION.                                                 00215000
002160******************************************************************00216000
002170 01  LS-SRW015.                                                   00217000
000000 COPY SRW015.                                                     00218000
002190*----------------------------------------------------------------*00219000
002200 01  LS-SRW066.                                                   00220000
000000 COPY SRW066.                                                     00221000
002220*----------------------------------------------------------------*00222000
002230 01  LS-BANKREC.                                                  00223000
000000 COPY RPSBNK.                                                     00224000
002250*----------------------------------------------------------------*00225000
002260 01  LS-MASTREC.                                                  00226000
002270     03  LS-MAST                 PIC X(2000).                     00227000
002280*----------------------------------------------------------------*00228000
002290 01  LS-RPT3REC.                                                  00229000
000000 COPY RPSRPTS.                                                    00230000
002310     03  LSRPT3-KEY              PIC X(70).                       00231000
002320     03  LS-DSKEY        REDEFINES LSRPT3-KEY.                    00232000
002330         05  LS-DSFORMX          PIC X(02).                       00233000
002340         05  LS-DSSEPREPX        PIC X(01).                       00234000
002350         05  LS-DPHOLDCOX.                                        00235000
002360             07  LS-DPHOLDCO     PIC S9(03)      COMP-3.          00236000
002370         05  LS-DSINSTX.                                          00237000
002380             07  LS-DSINST       PIC S9(03)      COMP-3.          00238000
002390         05  LS-DSALTBRNBRX.                                      00239000
002400             07  LS-DSALTBRNBR   PIC S9(05)      COMP-3.          00240000
002410         05  LS-DSSPECX          PIC X(01).                       00241000
002420         05  LS-DSREGNBRX.                                        00242000
002430             07  LS-DSREGNBR     PIC S9(03)      COMP-3.          00243000
002440         05  LS-DPRPTNBRX.                                        00244000
002450             07  LS-DPRPTNBR     PIC S9(04)      COMP.            00245000
002460         05  LS-DSBRANCHX.                                        00246000
002470             07  LS-DSBRANCH     PIC S9(05)      COMP-3.          00247000
002480         05  LS-DSTYPEX.                                          00248000
002490             07  LS-DSTYPE       PIC S9(03)      COMP-3.          00249000
002500         05  LS-DSOFFX.                                           00250000
002510             07  LS-DSOFF        PIC X(09).                       00251000
002520         05  LS-DSCUSTX.                                          00252000
002530             07  LS-DSCUST       PIC X(10).                       00253000
002540         05  LS-DSACCTX.                                          00254000
002550             07  LS-DSACCT       PIC S9(18)      COMP-3.          00255000
002560         05  FILLER              PIC X(21).                       00256000
002570*----------------------------------------------------------------*00257000
002580 01  LS-LINKDATA.                                                 00258000
000000 COPY RPW003.                                                     00259000
002600*----------------------------------------------------------------*00260000
002610 01  LS-PRINTLINES.                                               00261000
002620     03  LS-PRTLINES.                                             00262000
002630         05  LS-PLENTRY                          OCCURS 0020.     00263000
002640             07  LS-PLCONT       PIC X(01).                       00264000
002650             07  LS-PLDATA       PIC X(132).                      00265000
002660     03  LS-PLSIZE               PIC S9(04)      COMP             00266000
002670                                                 VALUE +0020.     00267000
002680******************************************************************00268000
002690 PROCEDURE DIVISION                                               00269000
002700         USING                                                    00270000
002710         LS-SRW015                                                00271000
002720         LS-SRW066                                                00272000
002730         LS-BANKREC                                               00273000
002740         LS-MASTREC                                               00274000
002750         LS-RPT3REC                                               00275000
002760         LS-LINKDATA                                              00276000
002770         LS-PRINTLINES.                                           00277000
002780******************************************************************00278000
002790 CONTROL-ROUTINE SECTION.                                         00279000
002800 CR-START.                                                        00280000
002810     IF LS-CONTROL IS EQUAL TO SPACES                             00281000
002820         GO TO CR-EXIT.                                           00282000
002830     GO TO                                                        00283000
002840         TOTAL-ROUTINE                                            00284000
002850         TOTAL-ROUTINE                                            00285000
002860         TOTAL-ROUTINE                                            00286000
002870         TOTAL-ROUTINE                                            00287000
002880         TOTAL-ROUTINE                                            00288000
002890         TOTAL-ROUTINE                                            00289000
002900         TOTAL-ROUTINE                                            00290000
002910         TOTAL-ROUTINE                                            00291000
002920         TOTAL-ROUTINE                                            00292000
002930         REPORT-ROUTINE                                           00293000
002940         DEPENDING ON WS-SUB2.                                    00294000
002950 CR-EXIT.                                                         00295000
002960     GO TO INITIAL-ROUTINE.                                       00296000
002970******************************************************************00297000
002980 INITIAL-ROUTINE SECTION.                                         00298000
002990 IR-START.                                                        00299000
003000     IF LS-INITSW IS EQUAL TO SPACE                               00300000
003010         GO TO IR-EXIT.                                           00301000
003020     MOVE SPACE TO LS-INITSW.                                     00302000
003030     MOVE SPACE TO LS-HEADSW.                                     00303000
003040     MOVE SPACE TO WS-ACCTSW.                                     00304000
003050     MOVE +0 TO WS-52LASTINST.                                    00305000
003060     MOVE SPACES TO LS-PRTLINES.                                  00306000
003070     MOVE SPACES TO PLINE1.                                       00307000
003080     MOVE +900 TO SR-LINES.                                       00308000
003090     MOVE +0 TO SR-PGCTR.                                         00309000
003100     MOVE 'RELATIONSHIP PRICING' TO SR-SYSTEM.                    00310000
003110     MOVE 'ACCOUNT INCENTIVE REPORT' TO SR-REPORT.                00311000
003120     MOVE 50052 TO SR-RPTNBR.                                     00312000
003130 IR-REC2023.                                                      00313000
003140     MOVE RPRPTS-INST TO WS-RPMIM2023INST.                        00314000
003150     PERFORM LOAD-RPS-2023.                                       00315000
003160 IR-EXIT.                                                         00316000
003170     GO TO TOTAL-ROUTINE.                                         00317000
003180******************************************************************00318000
003190 TOTAL-ROUTINE SECTION.                                           00319000
000000 COPY RPP001.                                                     00320000
003210******************************************************************00321000
003220 REPORT-ROUTINE SECTION.                                          00322000
003230 RR-START.                                                        00323000
003240     IF LS-TOTSW IS NOT EQUAL TO SPACE                            00324000
003250         MOVE SPACE TO LS-CONTROL                                 00325000
003260         GO TO RR-EXIT.                                           00326000
003270     IF LS-CONTROL IS NOT EQUAL TO SPACE                          00327000
003280         MOVE SPACE TO LS-CONTROL.                                00328000
003290 RR-HEADING.                                                      00329000
003300     MOVE +0 TO WS-SUB1.                                          00330000
003310     PERFORM R4-HEADCHECK.                                        00331000
003320     MOVE SPACES TO PLINE1.                                       00332000
003330     MOVE SPACES TO WS-EDITEDACCOUNT.                             00333000
003340     MOVE RPRPTS-PRODCODE TO P4-PRODCODE.                         00334000
003350                                                                  00335000
003360     MOVE RPRPTS-PRODCODE TO RPW015-PRODCODE.                     00336000
003370                                                                  00337000
003380     MOVE RPRPTS-ACCOUNT TO RPW015-ACCOUNT.                       00338000
003390                                                                  00339000
003400     PERFORM EDIT-ACCOUNT.                                        00340000
003410                                                                  00341000
003420     MOVE RPW015-EDITEDACCOUNT TO P4-ACCOUNT.                     00342000
003430     MOVE RPRPTS-052SCMODEL TO P4-SCMODEL.                        00343000
003440     MOVE RPRPTS-052SCOPTION TO P4-SCOPT.                         00344000
003450     MOVE RPRPTS-052SCQUAL TO P4-SCQUAL.                          00345000
003460     MOVE RPRPTS-052SCAMT TO P4-SCAMOUNT.                         00346000
003470     MOVE RPRPTS-052SCPCT TO P4-SCPCT.                            00347000
003480     MOVE RPRPTS-052RATEMODEL TO P4-RATEMODEL.                    00348000
003490     MOVE RPRPTS-052RTOPTION TO P4-RATEOPT.                       00349000
003500     MOVE RPRPTS-052RTQUAL TO P4-RATEQUAL.                        00350000
003510     MOVE RPRPTS-052RTPCT TO P4-RATEPCT.                          00351000
003520     MOVE RPRPTS-052RATETYPE TO P4-RATETYPE                       00352000
003530     MOVE SPACES TO P4-SPLITRATE.                                 00353000
003540     IF RPRPTS-052RATEOPTION IS EQUAL TO '2'                      00354000
003550         MOVE 'S' TO P4-SPLITRATE.                                00355000
003560     MOVE RPRPTS-052RTPROCOPT TO P4-PROCOPT.                      00356000
003570     IF RPRPTS-052RATEOPTION IS NOT EQUAL TO '2'                  00357000
003580         PERFORM PR-01 THRU PR-EXIT                               00358000
003590     ELSE                                                         00359000
003600         PERFORM PR-02 THRU PR-EXIT.                              00360000
003610     MOVE RPRPTS-INST TO WS-52LASTINST.                           00361000
003620     MOVE SPACES TO PLINE1.                                       00362000
003630     ADD RPRPTS-052NUMOFDUPREC TO WS-NUMOFDUPREC.                 00363000
003640     ADD 1 TO WS-NUMOFACTREC.                                     00364000
003650     IF RPRPTS-052RATEOPTION IS NOT EQUAL TO '2'                  00365000
003660         GO TO RR-EXIT.                                           00366000
003670     MOVE RPRPTS-052SPLITRATETABLE TO WS-SPLITRATETABLE.          00367000
003680     PERFORM R5-HEADCHECK.                                        00368000
003690     MOVE +1 TO WS-SUB3.                                          00369000
003700     MOVE ZEROS TO WS-SUB4.                                       00370000
003710 RR-SPLITRATE-LOOP.                                               00371000
003720     ADD +1 TO WS-SUB4.                                           00372000
003730     MOVE SPACES TO PLINE1.                                       00373000
003740     MOVE WS-SPLITRATE-TIER-HDR (WS-SUB4) TO P5-TIERCOL1-HDR.     00374000
003750     MOVE WS-SPLITRATEAMT (WS-SUB4) TO P5-BALANCE1.               00375000
003760     MOVE WS-SPLITRATEPCT (WS-SUB4) TO P5-RATE1.                  00376000
003770     ADD +1 TO WS-SUB4.                                           00377000
003780     MOVE WS-SPLITRATE-TIER-HDR (WS-SUB4) TO P5-TIERCOL2-HDR.     00378000
003790     MOVE WS-SPLITRATEAMT (WS-SUB4) TO P5-BALANCE2.               00379000
003800     MOVE WS-SPLITRATEPCT (WS-SUB4) TO P5-RATE2.                  00380000
003810     ADD +1 TO WS-SUB4.                                           00381000
003820     MOVE WS-SPLITRATE-TIER-HDR (WS-SUB4) TO P5-TIERCOL3-HDR.     00382000
003830     MOVE WS-SPLITRATEAMT (WS-SUB4) TO P5-BALANCE3.               00383000
003840     MOVE WS-SPLITRATEPCT (WS-SUB4) TO P5-RATE3.                  00384000
003850     IF WS-SUB3 IS LESS THAN +5                                   00385000
003860         PERFORM PR-01 THRU PR-EXIT                               00386000
003870     ELSE                                                         00387000
003880         PERFORM PR-02 THRU PR-EXIT.                              00388000
003890     ADD +1 TO WS-SUB3.                                           00389000
003900     IF WS-SUB3 IS LESS THAN +6                                   00390000
003910         GO TO RR-SPLITRATE-LOOP.                                 00391000
003920 RR-EXIT.                                                         00392000
003930     GO TO END-ROUTINE.                                           00393000
003940******************************************************************00394000
003950 R4-HEADCHECK SECTION.                                            00395000
003960 R4-HEADSTART.                                                    00396000
003970     IF LS-HEADSW IS NOT EQUAL TO SPACE                           00397000
003980         MOVE SPACE TO LS-HEADSW                                  00398000
003990         GO TO R4-HEADPRT.                                        00399000
004000     IF (SR-LINES + 4) IS NOT GREATER THAN SR-PAGE                00400000
004010         GO TO R4-HEADEXIT.                                       00401000
004020 R4-HEADPRT.                                                      00402000
004030     ADD +1 TO SR-PGCTR.                                          00403000
004040     PERFORM HEADING-ROUTINE.                                     00404000
004050     MOVE WS-HEAD01 TO PLINE1.                                    00405000
004060     PERFORM PR-01 THRU PR-EXIT.                                  00406000
004070     MOVE WS-HEAD02 TO PLINE1.                                    00407000
004080     PERFORM PR-02 THRU PR-EXIT.                                  00408000
004090 R4-HEADEXIT.                                                     00409000
004100     EXIT.                                                        00410000
004110******************************************************************00411000
004120 R5-HEADCHECK SECTION.                                            00412000
004130 R5-HEADSTART.                                                    00413000
004140     IF (SR-LINES + 8) IS NOT GREATER THAN SR-PAGE                00414000
004150         MOVE WS-HEAD03 TO PLINE1                                 00415000
004160         PERFORM PR-01 THRU PR-EXIT                               00416000
004170         GO TO R5-HEADEXIT.                                       00417000
004180 R5-HEADPRT.                                                      00418000
004190     ADD +1 TO SR-PGCTR.                                          00419000
004200     PERFORM HEADING-ROUTINE.                                     00420000
004210     MOVE WS-HEAD03 TO PLINE1.                                    00421000
004220     PERFORM PR-01 THRU PR-EXIT.                                  00422000
004230 R5-HEADEXIT.                                                     00423000
004240     EXIT.                                                        00424000
004250******************************************************************00425000
004260 PRINT-TOTALS SECTION.                                            00426000
004270 PT-START.                                                        00427000
004280     IF (SR-LINES + 5) IS GREATER THAN SR-PAGE                    00428000
004290         ADD +1 TO SR-PGCTR                                       00429000
004300         PERFORM HEADING-ROUTINE.                                 00430000
004310     MOVE SPACES TO PLINE1.                                       00431000
004320     PERFORM PR-01 THRU PR-EXIT.                                  00432000
004330     MOVE WS-52LASTINST TO WS-T1INST.                             00433000
004340     MOVE WS-NUMOFACTREC TO WS-T1ACTREC.                          00434000
004350     MOVE WS-TOTAL1 TO PLINE1.                                    00435000
004360     PERFORM PR-01 THRU PR-EXIT.                                  00436000
004370     MOVE WS-NUMOFDUPREC TO WS-T2DUPREC.                          00437000
004380     MOVE WS-TOTAL2 TO PLINE1.                                    00438000
004390     PERFORM PR-01 THRU PR-EXIT.                                  00439000
004400     MOVE ZEROS TO WS-NUMOFACTREC.                                00440000
004410     MOVE ZEROS TO WS-NUMOFDUPREC.                                00441000
004420 PT-EXIT.                                                         00442000
004430     EXIT.                                                        00443000
004440******************************************************************00444000
004450 MIC-MST-API SECTION.                                             00445000
000000 COPY MIPMSTA.                                                    00446000
004470******************************************************************00447000
004480 CHANGE-ACCOUNT SECTION.                                          00448000
004490 CA-START.                                                        00449000
004500 CA-EXIT.                                                         00450000
004510     EXIT.                                                        00451000
004520******************************************************************00452000
004530 PRINTER-ROUTINE SECTION.                                         00453000
000000 COPY SRP041.                                                     00454000
004550******************************************************************00455000
004560 CALENDAR-365 SECTION.                                            00456000
000000 COPY SRP003.                                                     00457000
004580******************************************************************00458000
004590 CONVERT-8-TO-6 SECTION.                                          00459000
000000 COPY SRP012.                                                     00460000
004610******************************************************************00461000
004620 ACCOUNT-EDIT SECTION.                                            00462000
000000 COPY SRP033.                                                     00463000
004640******************************************************************00464000
004650 HEADING-ROUTINE SECTION.                                         00465000
000000 COPY SRP016.                                                     00466000
004670******************************************************************00467000
004680 LOAD-RPS-2023 SECTION.                                           00468000
000000 COPY RPP2023.                                                    00469000
004700******************************************************************00470000
004710 SEARCH-RPS-2023 SECTION.                                         00471000
000000 COPY RPP2023S.                                                   00472000
004730******************************************************************00473000
004740 EDIT-ACCOUNT SECTION.                                            00474000
000000 COPY RPP015.                                                     00475000
004760******************************************************************00476000
004770 END-ROUTINE SECTION.                                             00477000
004780 ER-START.                                                        00478000
004790     GOBACK.                                                      00479000
004800******************************************************************00480000
