000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPG055.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPG055 - TRANSFERRED RELATIONSHIP REPORT                    *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  SRW000-AREAS.                                                00012000
000000 COPY SRW000.                                                     00013000
000140 01  MIMST-RECORD.                                                00014000
000000 COPY MISMST.                                                     00015000
000160 01  MIWMSTA-AREAS.                                               00016000
000000 COPY MIWMSTA.                                                    00017000
000180 01  MIWPRI-AREAS.                                                00018000
000000 COPY MIWPRI.                                                     00019000
000200 01  MI2023-RECORD.                                               00020000
000000 COPY MIS2023A.                                                   00021000
000220 01  SRW105-AREAS.                                                00022000
000000 COPY SRW105.                                                     00023000
000240*01  BICPBPRM.                                                    00024000
000000 COPY BICPBPRM.                                                   00025000
000260*01  BICRSRB.                                                     00026000
000000 COPY BICRSRB.                                                    00027000
000280*01  BICRPSB.                                                     00028000
000000 COPY BICRPSB.                                                    00029000
000300*01  BICRVERB.                                                    00030000
000000 COPY BICRVERB.                                                   00031000
000320*01  BICRSTAT.                                                    00032000
000000 COPY BICRSTAT.                                                   00033000
000340*01  BICRDBS.                                                     00034000
000000 COPY BICRDBS.                                                    00035000
000360*01  BICRLOG.                                                     00036000
000000 COPY BICRLOG.                                                    00037000
000380 01  MIC-RLSELIT.                                                 00038000
000000 COPY MIWRLSE.                                                    00039000
000400 01  RPW015-AREAS.                                                00040000
000000 COPY RPW015.                                                     00041000
000420 01  WS-RPMIM2023AREAS.                                           00042000
000000 COPY RPW2023.                                                    00043000
000440*----------------------------------------------------------------*00044000
000450 01  PRINTERREC.                                                  00045000
000000 COPY SRW016.                                                     00046000
000470     03  PLINE4          REDEFINES   PLINE1.                      00047000
000480         05  P4-PRODCODE         PIC X(06).                       00048000
000490         05  FILLER              PIC X(02).                       00049000
000500         05  P4-ACCOUNT          PIC X(22).                       00050000
000510         05  FILLER              PIC X(02).                       00051000
000520         05  P4-EXPIRED-MODEL    PIC X(10).                       00052000
000530         05  FILLER              PIC X(07).                       00053000
000540         05  P4-NEW-MODEL        PIC X(10).                       00054000
000550         05  FILLER              PIC X(04).                       00055000
000560         05  P4-COMMENT          PIC X(33).                       00056000
000570         05  FILLER              PIC X(37).                       00057000
000580*----------------------------------------------------------------*00058000
000590 01  WS-SRW033.                                                   00059000
000000 COPY SRW033.                                                     00060000
000610*----------------------------------------------------------------*00061000
000620*    SUBSCRIPT USAGE                                             *00062000
000630*        WS-SUB1 - POINTER FOR LS-PRINTLINES.                    *00063000
000640*        WS-SUB2 - ROUTINE POINTER FOR RETURN.                   *00064000
000650*        WS-SUB3 - WORK SUBSCRIPT.                               *00065000
000660*        WS-SUB4 - WORK SUBSCRIPT.                               *00066000
000670*----------------------------------------------------------------*00067000
000680 01  WS-SUBSCRIPTS.                                               00068000
000690     03  WS-SUB1                 PIC S9(04)      COMP             00069000
000700                                                 VALUE ZERO.      00070000
000710     03  WS-SUB2                 PIC S9(04)      COMP             00071000
000720                                                 VALUE ZERO.      00072000
000730     03  WS-SUB3                 PIC S9(04)      COMP             00073000
000740                                                 VALUE ZERO.      00074000
000750     03  WS-SUB4                 PIC S9(04)      COMP             00075000
000760                                                 VALUE ZERO.      00076000
000770*----------------------------------------------------------------*00077000
000780 01  WS-HEADINGS.                                                 00078000
000790     03  FILLER                  PIC X(19)       VALUE            00079000
000800         '*** WS-HEADINGS ***'.                                   00080000
000810     03  WS-HEAD01.                                               00081000
000820         05  FILLER              PIC X(44)       VALUE            00082000
000830             '*----- PRIMARY ACCOUNT ------*              '.      00083000
000840         05  FILLER              PIC X(44)       VALUE            00084000
000850             '                                            '.      00085000
000860         05  FILLER              PIC X(44)       VALUE            00086000
000870             '                                            '.      00087000
000880     03  WS-HEAD02.                                               00088000
000890         05  FILLER              PIC X(44)       VALUE            00089000
000900             'PROD CD            ACCOUNT NBR  EXPIRED MODE'.      00090000
000910         05  FILLER              PIC X(44)       VALUE            00091000
000920             'L    NEW MODEL     COMMENT                  '.      00092000
000930         05  FILLER              PIC X(44)       VALUE            00093000
000940             '                                            '.      00094000
000950 01  WS-TOTALS.                                                   00095000
000960     03  FILLER                  PIC X(17)       VALUE            00096000
000970         '*** WS-TOTALS ***'.                                     00097000
000980     03  WS-TOTAL1.                                               00098000
000990         05  FILLER              PIC X(16)       VALUE            00099000
001000             '           INST '.                                  00100000
001010         05  WS-T1INST           PIC 9(04).                       00101000
001020         05  FILLER              PIC X(31)       VALUE            00102000
001030             '  TOTAL TRANSFERS            '.                     00103000
001040         05  WS-T1TOTREL         PIC ZZ,ZZ9.                      00104000
001050         05  FILLER              PIC X(64)       VALUE SPACES.    00105000
001060     03  WS-TOTAL2.                                               00106000
001070         05  FILLER              PIC X(20)       VALUE SPACES.    00107000
001080         05  FILLER              PIC X(31)       VALUE            00108000
001090             '  TOTAL TRANSFERS COMPLETED  '.                     00109000
001100         05  WS-T2TOTREL         PIC ZZ,ZZ9.                      00110000
001110         05  FILLER              PIC X(64)       VALUE SPACES.    00111000
001120     03  WS-TOTAL3.                                               00112000
001130         05  FILLER              PIC X(20)       VALUE SPACES.    00113000
001140         05  FILLER              PIC X(31)       VALUE            00114000
001150             '  TOTAL TRANSFERS FAILED     '.                     00115000
001160         05  WS-T3TOTREL         PIC ZZ,ZZ9.                      00116000
001170         05  FILLER              PIC X(64)       VALUE SPACES.    00117000
001180*----------------------------------------------------------------*00118000
001190 01  WS-RPW001-AREAS.                                             00119000
000000 COPY RPW001.                                                     00120000
001210******************************************************************00121000
001220 01  WS-STORAGE.                                                  00122000
001230     03  WS-HEADSW               PIC X(01)       VALUE SPACE.     00123000
001240     03  WS-FUNCTION             PIC X(01)       VALUE SPACE.     00124000
001250     03  WS-EDITEDACCOUNT.                                        00125000
001260         05  WS-EDITACCT         PIC X(22).                       00126000
001270     03  WS-LASTACCOUNT          PIC X(18)       VALUE SPACES.    00127000
001280     03  WS-EFTIMEX.                                              00128000
001290         05  WS-EFTIME           PIC 99B99B99.                    00129000
001300     03  WS-DATEIN               PIC 9(8).                        00130000
001310     03  FILLER          REDEFINES WS-DATEIN.                     00131000
001320         05  WS-DATEIN-YYYY      PIC X(04).                       00132000
001330         05  WS-DATEIN-MM        PIC X(02).                       00133000
001340         05  WS-DATEIN-DD        PIC X(02).                       00134000
001350     03  WS-DATEOUT.                                              00135000
001360         05  WS-DATEOUT-MM       PIC X(02).                       00136000
001370         05  FILLER              PIC X(01)       VALUE '/'.       00137000
001380         05  WS-DATEOUT-DD       PIC X(02).                       00138000
001390         05  FILLER              PIC X(01)       VALUE '/'.       00139000
001400         05  WS-DATEOUT-YYYY     PIC X(04).                       00140000
001410*----------------------------------------------------------------*00141000
001420     03  WS-REC-COUNT            PIC S9(04)      COMP.            00142000
001430     03  WS-55LASTINST           PIC S9(03)      COMP-3.          00143000
001440     03  WS-EDITED-DATE.                                          00144000
001450         05  FILLER              PIC X(02).                       00145000
001460         05  WS-DATE-SLASH-1     PIC X.                           00146000
001470         05  FILLER              PIC X(02).                       00147000
001480         05  WS-DATE-SLASH-2     PIC X.                           00148000
001490         05  FILLER              PIC X(02).                       00149000
001500     03  WS-DATE-EDIT-AREA                                        00150000
001510                         REDEFINES WS-EDITED-DATE                 00151000
001520                                 PIC 99,99,99.                    00152000
001530     03  WS-TRANSFERS            PIC S9(05)      COMP-3           00153000
001540                                                 VALUE ZEROS.     00154000
001550     03  WS-TRANSFERS-COMPLETED  PIC S9(05)      COMP-3           00155000
001560                                                 VALUE ZEROS.     00156000
001570     03  WS-TRANSFERS-FAILED     PIC S9(05)      COMP-3           00157000
001580                                                 VALUE ZEROS.     00158000
001590******************************************************************00159000
001600 LINKAGE SECTION.                                                 00160000
001610******************************************************************00161000
001620 01  LS-SRW015.                                                   00162000
000000 COPY SRW015.                                                     00163000
001640*----------------------------------------------------------------*00164000
001650 01  LS-SRW066.                                                   00165000
000000 COPY SRW066.                                                     00166000
001670*----------------------------------------------------------------*00167000
001680 01  LS-BANKREC.                                                  00168000
000000 COPY RPSBNK.                                                     00169000
001700*----------------------------------------------------------------*00170000
001710 01  LS-MASTREC.                                                  00171000
001720     03  LS-MAST                 PIC X(2000).                     00172000
001730*----------------------------------------------------------------*00173000
001740 01  LS-RPT3REC.                                                  00174000
000000 COPY RPSRPTS.                                                    00175000
001760     03  LSRPT3-KEY              PIC X(70).                       00176000
001770     03  LS-DSKEY        REDEFINES LSRPT3-KEY.                    00177000
001780         05  LS-DSFORMX          PIC X(02).                       00178000
001790         05  LS-DSSEPREPX        PIC X(01).                       00179000
001800         05  LS-DPHOLDCOX.                                        00180000
001810             07  LS-DPHOLDCO     PIC S9(03)      COMP-3.          00181000
001820         05  LS-DSINSTX.                                          00182000
001830             07  LS-DSINST       PIC S9(03)      COMP-3.          00183000
001840         05  LS-DSALTBRNBRX.                                      00184000
001850             07  LS-DSALTBRNBR   PIC S9(05)      COMP-3.          00185000
001860         05  LS-DSSPECX          PIC X(01).                       00186000
001870         05  LS-DSREGNBRX.                                        00187000
001880             07  LS-DSREGNBR     PIC S9(03)      COMP-3.          00188000
001890         05  LS-DPRPTNBRX.                                        00189000
001900             07  LS-DPRPTNBR     PIC S9(04)      COMP.            00190000
001910         05  LS-DSBRANCHX.                                        00191000
001920             07  LS-DSBRANCH     PIC S9(05)      COMP-3.          00192000
001930         05  LS-DSTYPEX.                                          00193000
001940             07  LS-DSTYPE       PIC S9(03)      COMP-3.          00194000
001950         05  LS-DSOFFX.                                           00195000
001960             07  LS-DSOFF        PIC X(09).                       00196000
001970         05  LS-DSCUSTX.                                          00197000
001980             07  LS-DSCUST       PIC X(10).                       00198000
001990         05  LS-DSACCTX.                                          00199000
002000             07  LS-DSACCT       PIC S9(18)      COMP-3.          00200000
002010         05  FILLER              PIC X(21).                       00201000
002020*----------------------------------------------------------------*00202000
002030 01  LS-LINKDATA.                                                 00203000
000000 COPY RPW003.                                                     00204000
002050*----------------------------------------------------------------*00205000
002060 01  LS-PRINTLINES.                                               00206000
002070     03  LS-PRTLINES.                                             00207000
002080         05  LS-PLENTRY                          OCCURS 0020.     00208000
002090             07  LS-PLCONT       PIC X(01).                       00209000
002100             07  LS-PLDATA       PIC X(132).                      00210000
002110     03  LS-PLSIZE               PIC S9(04)      COMP             00211000
002120                                                 VALUE +0020.     00212000
002130******************************************************************00213000
002140 PROCEDURE DIVISION                                               00214000
002150         USING                                                    00215000
002160         LS-SRW015                                                00216000
002170         LS-SRW066                                                00217000
002180         LS-BANKREC                                               00218000
002190         LS-MASTREC                                               00219000
002200         LS-RPT3REC                                               00220000
002210         LS-LINKDATA                                              00221000
002220         LS-PRINTLINES.                                           00222000
002230******************************************************************00223000
002240 CONTROL-ROUTINE SECTION.                                         00224000
002250 CR-START.                                                        00225000
002260     IF LS-CONTROL IS EQUAL TO SPACES                             00226000
002270         GO TO CR-EXIT.                                           00227000
002280     GO TO                                                        00228000
002290         TOTAL-ROUTINE                                            00229000
002300         TOTAL-ROUTINE                                            00230000
002310         TOTAL-ROUTINE                                            00231000
002320         TOTAL-ROUTINE                                            00232000
002330         TOTAL-ROUTINE                                            00233000
002340         TOTAL-ROUTINE                                            00234000
002350         TOTAL-ROUTINE                                            00235000
002360         TOTAL-ROUTINE                                            00236000
002370         TOTAL-ROUTINE                                            00237000
002380         REPORT-ROUTINE                                           00238000
002390         DEPENDING ON WS-SUB2.                                    00239000
002400 CR-EXIT.                                                         00240000
002410     GO TO INITIAL-ROUTINE.                                       00241000
002420******************************************************************00242000
002430 INITIAL-ROUTINE SECTION.                                         00243000
002440 IR-START.                                                        00244000
002450     IF LS-INITSW IS EQUAL TO SPACE                               00245000
002460         GO TO IR-EXIT.                                           00246000
002470     MOVE SPACE TO LS-INITSW.                                     00247000
002480     MOVE SPACE TO LS-HEADSW.                                     00248000
002490     MOVE SPACE TO WS-ACCTSW.                                     00249000
002500     MOVE +0 TO WS-55LASTINST.                                    00250000
002510     MOVE SPACES TO LS-PRTLINES.                                  00251000
002520     MOVE SPACES TO PLINE1.                                       00252000
002530     MOVE +900 TO SR-LINES.                                       00253000
002540     MOVE +0 TO SR-PGCTR.                                         00254000
002550     MOVE 'RELATIONSHIP PRICING' TO SR-SYSTEM.                    00255000
002560     MOVE 'TRANSFERRED RELATIONSHIP REPORT' TO SR-REPORT.         00256000
002570     MOVE 50055 TO SR-RPTNBR.                                     00257000
002580 IR-REC2023.                                                      00258000
002590     MOVE RPRPTS-INST TO WS-RPMIM2023INST.                        00259000
002600     PERFORM LOAD-RPS-2023.                                       00260000
002610 IR-EXIT.                                                         00261000
002620     GO TO TOTAL-ROUTINE.                                         00262000
002630******************************************************************00263000
002640 TOTAL-ROUTINE SECTION.                                           00264000
000000 COPY RPP001.                                                     00265000
002660******************************************************************00266000
002670 REPORT-ROUTINE SECTION.                                          00267000
002680 RR-START.                                                        00268000
002690     IF LS-TOTSW IS NOT EQUAL TO SPACE                            00269000
002700         MOVE SPACE TO LS-CONTROL                                 00270000
002710         GO TO RR-EXIT.                                           00271000
002720     IF LS-CONTROL IS NOT EQUAL TO SPACE                          00272000
002730         MOVE SPACE TO LS-CONTROL.                                00273000
002740 RR-HEADING.                                                      00274000
002750     MOVE +0 TO WS-SUB1.                                          00275000
002760     PERFORM R4-HEADCHECK.                                        00276000
002770     MOVE SPACES TO PLINE1.                                       00277000
002780     MOVE SPACES TO WS-EDITEDACCOUNT.                             00278000
002790     MOVE RPRPTS-PRODCODE TO P4-PRODCODE.                         00279000
002800     MOVE RPRPTS-PRODCODE TO RPW015-PRODCODE.                     00280000
002810     MOVE RPRPTS-ACCOUNT TO RPW015-ACCOUNT.                       00281000
002820     PERFORM EDIT-ACCOUNT.                                        00282000
002830     MOVE RPW015-EDITEDACCOUNT TO P4-ACCOUNT.                     00283000
002840     MOVE RPRPTS-055EXPIRED-MODEL TO P4-EXPIRED-MODEL.            00284000
002850     MOVE RPRPTS-MODEL TO P4-NEW-MODEL.                           00285000
002860     ADD +1 TO WS-TRANSFERS.                                      00286000
002870     IF RPRPTS-055FAIL IS EQUAL TO '0'                            00287000
002880         ADD +1 TO WS-TRANSFERS-COMPLETED                         00288000
002890         GO TO RR-PRINT.                                          00289000
002900     ADD +1 TO WS-TRANSFERS-FAILED.                               00290000
002910     IF RPRPTS-055FAIL IS EQUAL TO '1'                            00291000
002920         MOVE 'NEW MODEL NOT FOUND              ' TO P4-COMMENT   00292000
002930         GO TO RR-PRINT.                                          00293000
002940     IF RPRPTS-055FAIL IS EQUAL TO '2'                            00294000
002950         MOVE 'NEW MODEL NOT ACTIVE             ' TO P4-COMMENT   00295000
002960         GO TO RR-PRINT.                                          00296000
002970     IF RPRPTS-055FAIL IS EQUAL TO '3'                            00297000
002980         MOVE 'RELATIONSHIP EXISTS FOR NEW MODEL' TO P4-COMMENT   00298000
002990         GO TO RR-PRINT.                                          00299000
003000     IF RPRPTS-055FAIL IS EQUAL TO '3'                            00300000
003010         MOVE 'NEW MODEL HAS EXPIRED            ' TO P4-COMMENT   00301000
003020         GO TO RR-PRINT.                                          00302000
003030 RR-PRINT.                                                        00303000
003040     PERFORM PR-01 THRU PR-EXIT.                                  00304000
003050     MOVE RPRPTS-INST TO WS-55LASTINST.                           00305000
003060     MOVE SPACES TO PLINE1.                                       00306000
003070 RR-EXIT.                                                         00307000
003080     GO TO END-ROUTINE.                                           00308000
003090******************************************************************00309000
003100 R4-HEADCHECK SECTION.                                            00310000
003110 R4-HEADSTART.                                                    00311000
003120     IF LS-HEADSW IS NOT EQUAL TO SPACE                           00312000
003130         MOVE SPACE TO LS-HEADSW                                  00313000
003140         GO TO R4-HEADPRT.                                        00314000
003150     IF (SR-LINES + 4) IS NOT GREATER THAN SR-PAGE                00315000
003160         GO TO R4-HEADEXIT.                                       00316000
003170 R4-HEADPRT.                                                      00317000
003180     ADD +1 TO SR-PGCTR.                                          00318000
003190     PERFORM HEADING-ROUTINE.                                     00319000
003200     MOVE WS-HEAD01 TO PLINE1.                                    00320000
003210     PERFORM PR-01 THRU PR-EXIT.                                  00321000
003220     MOVE WS-HEAD02 TO PLINE1.                                    00322000
003230     PERFORM PR-01 THRU PR-EXIT.                                  00323000
003240 R4-HEADEXIT.                                                     00324000
003250     EXIT.                                                        00325000
003260******************************************************************00326000
003270 PRINT-TOTALS SECTION.                                            00327000
003280 PT-START.                                                        00328000
003290     IF (SR-LINES + 6) IS GREATER THAN SR-PAGE                    00329000
003300         ADD +1 TO SR-PGCTR                                       00330000
003310         PERFORM HEADING-ROUTINE.                                 00331000
003320     MOVE SPACES TO PLINE1.                                       00332000
003330     PERFORM PR-01 THRU PR-EXIT.                                  00333000
003340     MOVE WS-55LASTINST TO WS-T1INST.                             00334000
003350     MOVE WS-TRANSFERS TO WS-T1TOTREL.                            00335000
003360     MOVE WS-TOTAL1 TO PLINE1.                                    00336000
003370     PERFORM PR-01 THRU PR-EXIT.                                  00337000
003380     MOVE WS-TRANSFERS-COMPLETED TO WS-T2TOTREL.                  00338000
003390     MOVE WS-TOTAL2 TO PLINE1.                                    00339000
003400     PERFORM PR-01 THRU PR-EXIT.                                  00340000
003410     MOVE WS-TRANSFERS-FAILED TO WS-T3TOTREL.                     00341000
003420     MOVE WS-TOTAL3 TO PLINE1.                                    00342000
003430     PERFORM PR-01 THRU PR-EXIT.                                  00343000
003440     MOVE ZEROS TO WS-TRANSFERS.                                  00344000
003450     MOVE ZEROS TO WS-TRANSFERS-COMPLETED.                        00345000
003460     MOVE ZEROS TO WS-TRANSFERS-FAILED.                           00346000
003470 PT-EXIT.                                                         00347000
003480     EXIT.                                                        00348000
003490******************************************************************00349000
003500 MIC-MST-API SECTION.                                             00350000
000000 COPY MIPMSTA.                                                    00351000
003520******************************************************************00352000
003530 CHANGE-ACCOUNT SECTION.                                          00353000
003540 CA-START.                                                        00354000
003550 CA-EXIT.                                                         00355000
003560     EXIT.                                                        00356000
003570******************************************************************00357000
003580 PRINTER-ROUTINE SECTION.                                         00358000
000000 COPY SRP041.                                                     00359000
003600******************************************************************00360000
003610 CALENDAR-365 SECTION.                                            00361000
000000 COPY SRP003.                                                     00362000
003630******************************************************************00363000
003640 CONVERT-8-TO-6 SECTION.                                          00364000
000000 COPY SRP012.                                                     00365000
003660******************************************************************00366000
003670 ACCOUNT-EDIT SECTION.                                            00367000
000000 COPY SRP033.                                                     00368000
003690******************************************************************00369000
003700 HEADING-ROUTINE SECTION.                                         00370000
000000 COPY SRP016.                                                     00371000
003720******************************************************************00372000
003730 LOAD-RPS-2023 SECTION.                                           00373000
000000 COPY RPP2023.                                                    00374000
003750******************************************************************00375000
003760 SEARCH-RPS-2023 SECTION.                                         00376000
000000 COPY RPP2023S.                                                   00377000
003780******************************************************************00378000
003790 EDIT-ACCOUNT SECTION.                                            00379000
000000 COPY RPP015.                                                     00380000
003810******************************************************************00381000
003820 END-ROUTINE SECTION.                                             00382000
003830 ER-START.                                                        00383000
003840     GOBACK.                                                      00384000
003850******************************************************************00385000
