000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPIACTTI.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*  RPIACTTI - RELATIONSHIP PRICING - ACCOUNT RECORD INTERFACE    *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 CONFIGURATION SECTION.                                           00008000
000090 SPECIAL-NAMES.                                                   00009000
000100     C01 IS C-01, C02 IS C-02, C03 IS C-03.                       00010000
000110 INPUT-OUTPUT SECTION.                                            00011000
000120 FILE-CONTROL.                                                    00012000
000130 DATA DIVISION.                                                   00013000
000140 FILE SECTION.                                                    00014000
000150******************************************************************00015000
000160 WORKING-STORAGE SECTION.                                         00016000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00017000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00017001
000180 01  RPS-RLSELIT.                                                 00018000
000000 COPY RPWRLSE.                                                    00019000
000200 01  MIWMSTA-AREAS.                                               00020000
000000 COPY MIWMSTA.                                                    00021000
000220 01  SRW000-AREAS.                                                00022000
000000 COPY SRW000.                                                     00023000
000240 01  SRW009-AREAS.                                                00024000
000000 COPY SRW009.                                                     00025000
000260 01  SRW105-AREAS.                                                00026000
000000 COPY SRW105.                                                     00027000
000280*01  BICPBPRM.                                                    00028000
000000 COPY BICPBPRM.                                                   00029000
000300*01  BICRSRB.                                                     00030000
000000 COPY BICRSRB.                                                    00031000
000320*01  BICRPSB.                                                     00032000
000000 COPY BICRPSB.                                                    00033000
000340*01  BICRVERB.                                                    00034000
000000 COPY BICRVERB.                                                   00035000
000360*01  BICRSTAT.                                                    00036000
000000 COPY BICRSTAT.                                                   00037000
000380*01  BICRDBS.                                                     00038000
000000 COPY BICRDBS.                                                    00039000
000400*01  BICRLOG.                                                     00040000
000000 COPY BICRLOG.                                                    00041000
000420 01  RPACT-RECORD.                                                00042000
000000 COPY RPSACT.                                                     00043000
000440 01  RPWACT-AREAS.                                                00044000
000000 COPY RPWACTA.                                                    00045000
000460 01  WS-WORKAREAS.                                                00046000
000470     03  WS-ACTOPEN              PIC X(01)       VALUE SPACES.    00047000
000480     03  WS-UPD-USER             PIC X(08)       VALUE SPACES.    00048000
000490     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00049000
000500 LINKAGE SECTION.                                                 00050000
000510 01  LS-LINKDATA.                                                 00051000
000000 COPY RPW010.                                                     00052000
000530******************************************************************00053000
000540 PROCEDURE DIVISION                                               00054000
000550         USING LS-LINKDATA.                                       00055000
000560******************************************************************00056000
000570 INITIALIZATION SECTION.                                          00057000
000580 IN-START.                                                        00058000
000590     MOVE 'RPIACTTI' TO SR-APIPROGLIT.                            00059000
000600     MOVE 'RPIACTTI' TO WS-UPD-USER.                              00060000
000610     MOVE 'N' TO RPS-ACT-LOG.                                     00061000
000620     IF LS-ACT-FUNCTION IS EQUAL TO 'C'                           00062000
000630         GO TO CLOSE-ROUTINE.                                     00063000
000640     IF LS-ACT-FUNCTION IS EQUAL TO 'O'                           00064000
000650         OR LS-ACT-FUNCTION IS EQUAL TO 'R'                       00065000
000660         GO TO MAIN-LOGIC.                                        00066000
000670     MOVE 'X' TO LS-ACT-FUNCTION.                                 00067000
000680     GO TO RETURN-ROUTINE.                                        00068000
000690 IN-EXIT.                                                         00069000
000700     EXIT.                                                        00070000
000710******************************************************************00071000
000720 MAIN-LOGIC SECTION.                                              00072000
000730 ML-START.                                                        00073000
000740     PERFORM OPEN-ROUTINE.                                        00074000
000750     IF LS-ACT-FUNCTION IS EQUAL TO 'R'                           00075000
000760         GO TO READ-RANDOM.                                       00076000
000770     GO TO RETURN-ROUTINE.                                        00077000
000780 ML-EXIT.                                                         00078000
000790     EXIT.                                                        00079000
000800******************************************************************00080000
000810 OPEN-ROUTINE SECTION.                                            00081000
000820 OR-OPENREL.                                                      00082000
000830     IF WS-ACTOPEN IS EQUAL TO 'Y'                                00083000
000840         GO TO OR-EXIT.                                           00084000
000850     PERFORM GET-FILE-ORGANIZATION.                               00085000
000860     MOVE 'Y' TO WS-ACTOPEN.                                      00086000
000870     MOVE LS-ACT-KEY TO RPACT-GRP-KEY.                            00087000
000880     PERFORM RPS-ACT-OPEN-REQUEST.                                00088000
000890 OR-EXIT.                                                         00089000
000900     EXIT.                                                        00090000
000910******************************************************************00091000
000920 CLOSE-ROUTINE SECTION.                                           00092000
000930 CR-START.                                                        00093000
000940     PERFORM RPS-ACT-CLOSE-REQUEST.                               00094000
000950     MOVE SPACES TO WS-ACTOPEN.                                   00095000
000960 CR-END.                                                          00096000
000970     GO TO RETURN-ROUTINE.                                        00097000
000980 CR-EXIT.                                                         00098000
000990     EXIT.                                                        00099000
001000******************************************************************00100000
001010 READ-RANDOM SECTION.                                             00101000
001020 RR-START.                                                        00102000
001030     MOVE 'N' TO LS-ACT-RATEINCENTIVE.                            00103000
001040     MOVE 'N' TO LS-ACT-SCINCENTIVE.                              00104000
001050     MOVE ZEROS TO LS-ACT-RATE-PERCENT.                           00105000
001060     MOVE ZEROS TO LS-ACT-DISCAMT.                                00106000
001070     MOVE '0' TO LS-ACT-RATE-OPTION.                              00107000
001080     MOVE 'I' TO LS-ACT-RATE-TYPE.                                00108000
001090     MOVE ZEROS TO LS-ACT-DISCPCT.                                00109000
001100     MOVE 'N' TO LS-ACT-RATECHG-FLAG.                             00110000
001110     MOVE ZEROS TO LS-ACT-RATE-PREV.                              00111000
001120     INITIALIZE LS-ACT-SPLIT-RATE-TABLE.                          00112000
001130 RR-READ.                                                         00113000
001140     MOVE LS-ACT-KEY TO RPACT-GRP-KEY.                            00114000
001150     PERFORM RPS-ACT-GET-REQUEST.                                 00115000
001160     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00116000
001170         GO TO RETURN-ROUTINE.                                    00117000
001180 RR-GOOD.                                                         00118000
001190     MOVE RPACT-SC-INC-QUAL TO LS-ACT-SCINCENTIVE.                00119000
001200     MOVE RPACT-DISCOUNT-AMOUNT TO LS-ACT-DISCAMT.                00120000
001210     MOVE RPACT-DISCOUNT-PERCENT TO LS-ACT-DISCPCT.               00121000
001220     MOVE RPACT-RATE-INC-QUAL TO LS-ACT-RATEINCENTIVE.            00122000
001230     MOVE RPACT-RATE-OPTION TO LS-ACT-RATE-OPTION.                00123000
001240     MOVE RPACT-RATE-TYPE TO LS-ACT-RATE-TYPE.                    00124000
001250     MOVE RPACT-RATE-PERCENT TO LS-ACT-RATE-PERCENT.              00125000
001260     MOVE RPACT-SPLIT-RATE-TABLE TO LS-ACT-SPLIT-RATE-TABLE.      00126000
001270 RR-END.                                                          00127000
001280     GO TO RETURN-ROUTINE.                                        00128000
001290 RR-EXIT.                                                         00129000
001300     EXIT.                                                        00130000
001310***************************************************************** 00131000
000000 COPY RPPACTA.                                                    00132000
001330***************************************************************** 00133000
001340 GET-FILE-ORGANIZATION SECTION.                                   00134000
000000 COPY SRP093.                                                     00135000
001360******************************************************************00136000
001370 RETURN-ROUTINE SECTION.                                          00137000
001380 RET-START.                                                       00138000
001390     MOVE WS-FUNCTION TO LS-ACT-FUNCTION.                         00139000
001400     GOBACK.                                                      00140000
001410******************************************************************00141000
