000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPK0DP81.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*   RPK0DP81 - RELATIONSHIP PRICING / DEPOSITS 8.1                00005000
000060*             INTERFACE EXTRACT FOR DEPOSITS RELEASE 8.1         *00006000
000070******************************************************************00007000
000080 ENVIRONMENT DIVISION.                                            00008000
000090 CONFIGURATION SECTION.                                           00009000
000100 DATA DIVISION.                                                   00010000
000110 FILE SECTION.                                                    00011000
000120******************************************************************00012000
000130 WORKING-STORAGE SECTION.                                         00013000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00014000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00014001
000150 01  RPS-RLSELIT.                                                 00015000
000000 COPY RPWRLSE.                                                    00016000
000170 01  DEP-RLSELIT.                                                 00017000
000000 COPY DPWRLSE.                                                    00018000
000190 01  SRW000-AREAS.                                                00019000
000000 COPY SRW000.                                                     00020000
000210 01  SRW009-AREAS.                                                00021000
000000 COPY SRW009.                                                     00022000
000230 01  SRW105-AREAS.                                                00023000
000000 COPY SRW105.                                                     00024000
000250*01  BICPBPRM.                                                    00025000
000000 COPY BICPBPRM.                                                   00026000
000270*01  BICRSRB.                                                     00027000
000000 COPY BICRSRB.                                                    00028000
000290*01  BICRPSB.                                                     00029000
000000 COPY BICRPSB.                                                    00030000
000310*01  BICRVERB.                                                    00031000
000000 COPY BICRVERB.                                                   00032000
000330*01  BICRSTAT.                                                    00033000
000000 COPY BICRSTAT.                                                   00034000
000350*01  BICRDBS.                                                     00035000
000000 COPY BICRDBS.                                                    00036000
000370*01  BICRLOG.                                                     00037000
000000 COPY BICRLOG.                                                    00038000
000390 01  WS-01                       PIC X(06)       VALUE 'DPDDM '.  00039000
000400 01  DPDDM-RECORD.                                                00040000
000000 COPY DPSDDM.                                                     00041000
000420 01  FILLER                      PIC X(06)       VALUE 'DPDDN '.  00042000
000430 01  DPDDN-RECORD.                                                00043000
000000 COPY DPSDDN.                                                     00044000
000450 01  WS-02                       PIC X(06)       VALUE 'DPSVM '.  00045000
000460 01  DPSVM-RECORD.                                                00046000
000000 COPY DPSSVM.                                                     00047000
000480 01  FILLER                      PIC X(06)       VALUE 'DPSVN '.  00048000
000490 01  DPSVN-RECORD.                                                00049000
000000 COPY DPSSVN.                                                     00050000
000510 01  WS-04                       PIC X(06)       VALUE 'DPCLM '.  00051000
000520 01  DPCLM-RECORD.                                                00052000
000000 COPY DPSCLM.                                                     00053000
000540 01  WS-06                       PIC X(06)       VALUE 'DPBNK '.  00054000
000550 01  DPBNK-RECORD.                                                00055000
000000 COPY DPSBNK.                                                     00056000
000570 01  DPWCLM-AREAS.                                                00057000
000000 COPY DPWCLMA.                                                    00058000
000590 01  DPWDDM-AREAS.                                                00059000
000000 COPY DPWDDMA.                                                    00060000
000610 01  DPWDDN-AREAS.                                                00061000
000000 COPY DPWDDNA.                                                    00062000
000630 01  DPWSVM-AREAS.                                                00063000
000000 COPY DPWSVMA.                                                    00064000
000650 01  DPWSVN-AREAS.                                                00065000
000000 COPY DPWSVNA.                                                    00066000
000670 01  DPWBNK-AREAS.                                                00067000
000000 COPY DPWBNKA.                                                    00068000
000690 01  MIWMSTA-AREAS.                                               00069000
000000 COPY MIWMSTA.                                                    00070000
000710 01  WS-WORKAREAS.                                                00071000
000720     03  WS-FILESTATUS.                                           00072000
000730         05  WS-FSKEY1           PIC X(01)       VALUE SPACES.    00073000
000740         05  WS-FSKEY2           PIC X(01)       VALUE SPACES.    00074000
000750     03  WS-DDMOPEN              PIC X(01)       VALUE SPACES.    00075000
000760     03  WS-DDNOPEN              PIC X(01)       VALUE SPACES.    00076000
000770     03  WS-SAVOPEN              PIC X(01)       VALUE SPACES.    00077000
000780     03  WS-SVNOPEN              PIC X(01)       VALUE SPACES.    00078000
000790     03  WS-CLMOPEN              PIC X(01)       VALUE SPACES.    00079000
000800     03  WS-BNKOPEN              PIC X(01)       VALUE SPACES.    00080000
000810     03  WS-UPD-USER             PIC X(08)       VALUE SPACES.    00081000
000820     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00082000
000830     03  WS-READ-SW              PIC X(01)       VALUE SPACES.    00083000
000840     03  WS-DAYS-FROM-SC         PIC S9(07)      COMP-3.          00084000
000850     03  WS-SUB1                 PIC S9(04)      COMP.            00085000
000860     03  WS-BAL                  PIC S9(11)V99   COMP-3.          00086000
000870     03  WS-NPROCDTA             PIC S9(07)      COMP-3.          00087000
000880     03  WS-LASTDATE             PIC S9(07)      COMP-3.          00088000
000890     03  WS-BAL-MAX              PIC S9(04)      COMP             00089000
000900                                                 VALUE +20.       00090000
000910******************************************************************00091000
000920 LINKAGE SECTION.                                                 00092000
000930 01  WS-LINKDATA.                                                 00093000
000000 COPY MISCNT00      REPLACING                                     00094000
000950     ==:MICNT:== BY ==RPINF00==.                                  00095000
000000 COPY RPSINF00.                                                   00096000
000970******************************************************************00097000
000980 PROCEDURE DIVISION                                               00098000
000990         USING                                                    00099000
001000         WS-LINKDATA.                                             00100000
001010******************************************************************00101000
001020 INITIALIZATION SECTION.                                          00102000
001030 IN-START.                                                        00103000
001040     MOVE 'RPK0DP81' TO SR-APIPROGLIT.                            00104000
001050     MOVE 'RPK0DP81' TO WS-UPD-USER.                              00105000
001060     MOVE SPACES TO WS-FUNCTION.                                  00106000
001070     MOVE ZEROS TO RPINF00-ABTRACE.                               00107000
001080     IF RPINF00-FUNC IS EQUAL TO 'O'                              00108000
001090         PERFORM OPEN-ROUTINE                                     00109000
001100         GO TO RETURN-ROUTINE.                                    00110000
001110     IF RPINF00-FUNC IS EQUAL TO 'B'                              00111000
001120         GO TO READ-FIRST.                                        00112000
001130     IF RPINF00-FUNC IS EQUAL TO 'N'                              00113000
001140         GO TO READ-NEXT.                                         00114000
001150     IF RPINF00-FUNC IS EQUAL TO 'R'                              00115000
001160         GO TO READ-RANDOM.                                       00116000
001170     IF RPINF00-FUNC IS EQUAL TO 'C'                              00117000
001180         GO TO CLOSE-ROUTINE.                                     00118000
001190     MOVE 'X' TO WS-FUNCTION.                                     00119000
001200     MOVE 'X' TO RPINF00-RETURN.                                  00120000
001210     MOVE 0001 TO RPINF00-ABTRACE.                                00121000
001220     GO TO RETURN-ROUTINE.                                        00122000
001230 IN-EXIT.                                                         00123000
001240     EXIT.                                                        00124000
001250******************************************************************00125000
001260 OPEN-ROUTINE SECTION.                                            00126000
001270 OR-OPEN.                                                         00127000
001280     MOVE 'N' TO WS-READ-SW.                                      00128000
001290     IF WS-BNKOPEN IS EQUAL TO 'Y'                                00129000
001300         GO TO OR-OPENDDM.                                        00130000
001310     MOVE 'Y' TO WS-BNKOPEN.                                      00131000
001320     PERFORM GET-FILE-ORGANIZATION.                               00132000
001330     MOVE 'N' TO DEP-DDM-LOG.                                     00133000
001340     MOVE 'N' TO DEP-DDN-LOG.                                     00134000
001350     MOVE 'N' TO DEP-SVM-LOG.                                     00135000
001360     MOVE 'N' TO DEP-SVN-LOG.                                     00136000
001370     MOVE 'N' TO DEP-CLM-LOG.                                     00137000
001380     MOVE RPINF00-INST TO DPBNK-INST.                             00138000
001390     PERFORM DEP-BNK-OPEN-REQUEST.                                00139000
001400     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00140000
001410         MOVE 'O' TO RPINF00-RETURN                               00141000
001420         MOVE 0002 TO RPINF00-ABTRACE                             00142000
001430         GO TO RETURN-ROUTINE.                                    00143000
001440     MOVE RPINF00-INST TO DPBNK-INST.                             00144000
001450     PERFORM DEP-BNK-GET-REQUEST.                                 00145000
001460     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00146000
001470         MOVE 'R' TO RPINF00-RETURN                               00147000
001480         MOVE 0003 TO RPINF00-ABTRACE                             00148000
001490         GO TO RETURN-ROUTINE.                                    00149000
001500     MOVE DPBNK-NPROCDTA TO WS-NPROCDTA.                          00150000
001510 OR-OPENDDM.                                                      00151000
001520     IF RPINF00-APPLR IS NOT EQUAL TO '01'                        00152000
001530         GO TO OR-OPENCLM.                                        00153000
001540     IF WS-DDMOPEN IS EQUAL TO 'Y'                                00154000
001550         GO TO OR-OPENDDN.                                        00155000
001560     MOVE 'Y' TO WS-DDMOPEN.                                      00156000
001570     MOVE RPINF00-INST TO DPDDM-INST.                             00157000
001580     MOVE RPINF00-ACCOUNT TO DPDDM-ACCOUNT.                       00158000
001590     PERFORM DEP-DDM-OPEN-REQUEST.                                00159000
001600     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00160000
001610         MOVE 'O' TO RPINF00-RETURN                               00161000
001620         MOVE 0004 TO RPINF00-ABTRACE                             00162000
001630         GO TO RETURN-ROUTINE.                                    00163000
001640 OR-OPENDDN.                                                      00164000
001650     IF WS-DDNOPEN IS EQUAL TO 'Y'                                00165000
001660         GO TO OR-EXIT.                                           00166000
001670     MOVE 'Y' TO WS-DDNOPEN.                                      00167000
001680     MOVE RPINF00-INST TO DPDDN-INST.                             00168000
001690     MOVE RPINF00-ACCOUNT TO DPDDN-ACCOUNT.                       00169000
001700     PERFORM DEP-DDN-OPEN-REQUEST.                                00170000
001710     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00171000
001720         MOVE 'O' TO RPINF00-RETURN                               00172000
001730         MOVE 0005 TO RPINF00-ABTRACE                             00173000
001740         GO TO RETURN-ROUTINE.                                    00174000
001750     GO TO OR-END.                                                00175000
001760 OR-OPENCLM.                                                      00176000
001770     IF RPINF00-APPLR IS NOT EQUAL TO '03'                        00177000
001780         GO TO OR-OPENSAV.                                        00178000
001790     IF WS-CLMOPEN IS EQUAL TO 'Y'                                00179000
001800         GO TO OR-EXIT.                                           00180000
001810     MOVE 'Y' TO WS-CLMOPEN.                                      00181000
001820     MOVE RPINF00-INST TO DPCLM-INST.                             00182000
001830     MOVE RPINF00-ACCOUNT TO DPCLM-ACCOUNT.                       00183000
001840     PERFORM DEP-CLM-OPEN-REQUEST.                                00184000
001850     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00185000
001860         MOVE 'O' TO RPINF00-RETURN                               00186000
001870         MOVE 0006 TO RPINF00-ABTRACE                             00187000
001880         GO TO RETURN-ROUTINE.                                    00188000
001890     GO TO OR-END.                                                00189000
001900 OR-OPENSAV.                                                      00190000
001910     IF RPINF00-APPLR IS NOT EQUAL TO '04'                        00191000
001920         GO TO OR-EXIT.                                           00192000
001930     IF WS-SAVOPEN IS EQUAL TO 'Y'                                00193000
001940         GO TO OR-OPENSVN.                                        00194000
001950     MOVE 'Y' TO WS-SAVOPEN.                                      00195000
001960     MOVE RPINF00-INST TO DPSVM-INST.                             00196000
001970     MOVE RPINF00-ACCOUNT TO DPSVM-ACCOUNT.                       00197000
001980     PERFORM DEP-SVM-OPEN-REQUEST.                                00198000
001990     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00199000
002000         MOVE 'O' TO RPINF00-RETURN                               00200000
002010         MOVE 0007 TO RPINF00-ABTRACE                             00201000
002020         GO TO RETURN-ROUTINE.                                    00202000
002030 OR-OPENSVN.                                                      00203000
002040     IF WS-SVNOPEN IS EQUAL TO 'Y'                                00204000
002050         GO TO OR-EXIT.                                           00205000
002060     MOVE 'Y' TO WS-SVNOPEN.                                      00206000
002070     MOVE RPINF00-INST TO DPSVN-INST.                             00207000
002080     MOVE RPINF00-ACCOUNT TO DPSVN-ACCOUNT.                       00208000
002090     PERFORM DEP-SVN-OPEN-REQUEST.                                00209000
002100     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00210000
002110         MOVE 'O' TO RPINF00-RETURN                               00211000
002120         MOVE 0008 TO RPINF00-ABTRACE                             00212000
002130         GO TO RETURN-ROUTINE.                                    00213000
002140 OR-END.                                                          00214000
002150     MOVE WS-FUNCTION TO RPINF00-FUNCTION.                        00215000
002160 OR-EXIT.                                                         00216000
002170     EXIT.                                                        00217000
002180******************************************************************00218000
002190 CLOSE-ROUTINE SECTION.                                           00219000
002200 CR-START.                                                        00220000
002210     IF WS-BNKOPEN IS NOT EQUAL TO 'Y'                            00221000
002220         GO TO CR-CLOSEDDM.                                       00222000
002230     PERFORM DEP-BNK-CLOSE-REQUEST.                               00223000
002240     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00224000
002250         MOVE 'C' TO RPINF00-RETURN                               00225000
002260         MOVE 0009 TO RPINF00-ABTRACE                             00226000
002270         GO TO RETURN-ROUTINE.                                    00227000
002280     MOVE SPACES TO WS-BNKOPEN.                                   00228000
002290 CR-CLOSEDDM.                                                     00229000
002300     IF RPINF00-APPLR IS NOT EQUAL TO '01'                        00230000
002310         GO TO CR-CLOSECLM.                                       00231000
002320     IF WS-DDMOPEN IS NOT EQUAL TO 'Y'                            00232000
002330         GO TO CR-CLOSEDDN.                                       00233000
002340     PERFORM DEP-DDM-CLOSE-REQUEST.                               00234000
002350     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00235000
002360         MOVE 'C' TO RPINF00-RETURN                               00236000
002370         MOVE 0010 TO RPINF00-ABTRACE                             00237000
002380         GO TO RETURN-ROUTINE.                                    00238000
002390     MOVE SPACES TO WS-DDMOPEN.                                   00239000
002400 CR-CLOSEDDN.                                                     00240000
002410     IF WS-DDNOPEN IS NOT EQUAL TO 'Y'                            00241000
002420         GO TO CR-END.                                            00242000
002430     PERFORM DEP-DDN-CLOSE-REQUEST.                               00243000
002440     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00244000
002450         MOVE 'C' TO RPINF00-RETURN                               00245000
002460         MOVE 0011 TO RPINF00-ABTRACE                             00246000
002470         GO TO RETURN-ROUTINE.                                    00247000
002480     MOVE SPACES TO WS-DDNOPEN.                                   00248000
002490     GO TO CR-END.                                                00249000
002500 CR-CLOSECLM.                                                     00250000
002510     IF RPINF00-APPLR IS NOT EQUAL TO '03'                        00251000
002520         GO TO CR-CLOSESAV.                                       00252000
002530     IF WS-CLMOPEN IS NOT EQUAL TO 'Y'                            00253000
002540         GO TO CR-END.                                            00254000
002550     PERFORM DEP-CLM-CLOSE-REQUEST.                               00255000
002560     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00256000
002570         MOVE 'C' TO RPINF00-RETURN                               00257000
002580         MOVE 0012 TO RPINF00-ABTRACE                             00258000
002590         GO TO RETURN-ROUTINE.                                    00259000
002600     MOVE SPACES TO WS-CLMOPEN.                                   00260000
002610     GO TO CR-END.                                                00261000
002620 CR-CLOSESAV.                                                     00262000
002630     IF RPINF00-APPLR IS NOT EQUAL TO '04'                        00263000
002640         GO TO CR-END.                                            00264000
002650     IF WS-SAVOPEN IS NOT EQUAL TO 'Y'                            00265000
002660         GO TO CR-CLOSESVN.                                       00266000
002670     PERFORM DEP-SVM-CLOSE-REQUEST.                               00267000
002680     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00268000
002690         MOVE 'C' TO RPINF00-RETURN                               00269000
002700         MOVE 0013 TO RPINF00-ABTRACE                             00270000
002710         GO TO RETURN-ROUTINE.                                    00271000
002720     MOVE SPACES TO WS-SAVOPEN.                                   00272000
002730 CR-CLOSESVN.                                                     00273000
002740     IF WS-SVNOPEN IS NOT EQUAL TO 'Y'                            00274000
002750         GO TO CR-END.                                            00275000
002760     PERFORM DEP-SVN-CLOSE-REQUEST.                               00276000
002770     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00277000
002780         MOVE 'C' TO RPINF00-RETURN                               00278000
002790         MOVE 0014 TO RPINF00-ABTRACE                             00279000
002800         GO TO RETURN-ROUTINE.                                    00280000
002810     MOVE SPACES TO WS-SVNOPEN.                                   00281000
002820 CR-END.                                                          00282000
002830     MOVE WS-FUNCTION TO RPINF00-FUNCTION.                        00283000
002840     GO TO RETURN-ROUTINE.                                        00284000
002850 CR-EXIT.                                                         00285000
002860     EXIT.                                                        00286000
002870******************************************************************00287000
002880 READ-FIRST SECTION.                                              00288000
002890 RF-START.                                                        00289000
002900     IF RPINF00-APPLR IS NOT EQUAL TO '01'                        00290000
002910         GO TO RF-READCLM.                                        00291000
002920     IF WS-DDMOPEN IS NOT EQUAL TO 'Y'                            00292000
002930         OR WS-DDNOPEN IS NOT EQUAL TO 'Y'                        00293000
002940         OR WS-BNKOPEN IS NOT EQUAL TO 'Y'                        00294000
002950         PERFORM OPEN-ROUTINE.                                    00295000
002960 RF-READDDM.                                                      00296000
002970     MOVE RPINF00-INST TO DPDDM-INST.                             00297000
002980     MOVE RPINF00-ACCOUNT TO DPDDM-ACCOUNT.                       00298000
002990     PERFORM DEP-DDM-GET-EQUAL-REQUEST.                           00299000
003000     IF WS-FUNCTION IS EQUAL TO 'E'                               00300000
003010         OR WS-FUNCTION IS EQUAL TO 'N'                           00301000
003020         GO TO RF-END.                                            00302000
003030     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00303000
003040         MOVE 'B' TO RPINF00-RETURN                               00304000
003050         MOVE 0015 TO RPINF00-ABTRACE                             00305000
003060         GO TO RF-END.                                            00306000
003070     IF RPINF00-INST IS NOT EQUAL TO DPDDM-INST                   00307000
003080         OR RPINF00-ACCOUNT IS NOT EQUAL TO DPDDM-ACCOUNT         00308000
003090         MOVE 'Y' TO WS-READ-SW                                   00309000
003100         MOVE 'N' TO WS-FUNCTION                                  00310000
003110         GO TO RF-END.                                            00311000
003120 RF-READDDN.                                                      00312000
003130     MOVE RPINF00-INST TO DPDDN-INST.                             00313000
003140     MOVE RPINF00-ACCOUNT TO DPDDN-ACCOUNT.                       00314000
003150     PERFORM DEP-DDN-GET-EQUAL-REQUEST.                           00315000
003160     IF WS-FUNCTION IS EQUAL TO 'E'                               00316000
003170         OR WS-FUNCTION IS EQUAL TO 'N'                           00317000
003180         GO TO RF-END.                                            00318000
003190     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00319000
003200         MOVE 'B' TO RPINF00-RETURN                               00320000
003210         MOVE 0016 TO RPINF00-ABTRACE                             00321000
003220         GO TO RF-END.                                            00322000
003230     IF RPINF00-INST IS NOT EQUAL TO DPDDN-INST                   00323000
003240         OR RPINF00-ACCOUNT IS NOT EQUAL TO DPDDN-ACCOUNT         00324000
003250         MOVE 'Y' TO WS-READ-SW                                   00325000
003260         MOVE 'N' TO WS-FUNCTION                                  00326000
003270         GO TO RF-END.                                            00327000
003280     IF DPDDM-MSTATUS IS EQUAL TO SPACES                          00328000
003290         GO TO RF-MOVEDDM.                                        00329000
003300     IF RPINF00-CLOSEDACCTOPT IS EQUAL TO 'Y'                     00330000
003310         AND DPDDM-MSTATUS IS NOT EQUAL TO 'P'                    00331000
003320         MOVE SPACES TO DPDDM-MSTATUS                             00332000
003330         GO TO RF-MOVEDDM.                                        00333000
003340     IF DPDDM-MSTATUS IS EQUAL TO 'C'                             00334000
003350         MOVE 'D' TO WS-FUNCTION                                  00335000
003360         GO TO RF-END.                                            00336000
003370     MOVE 'N' TO WS-FUNCTION.                                     00337000
003380     GO TO RF-END.                                                00338000
003390 RF-MOVEDDM.                                                      00339000
003400     PERFORM MOVE-DDM-TO-INF.                                     00340000
003410     GO TO RF-END.                                                00341000
003420 RF-READCLM.                                                      00342000
003430     IF RPINF00-APPLR IS NOT EQUAL TO '03'                        00343000
003440         GO TO RF-READSAV.                                        00344000
003450     IF WS-CLMOPEN IS NOT EQUAL TO 'Y'                            00345000
003460         PERFORM OPEN-ROUTINE.                                    00346000
003470     MOVE RPINF00-INST TO DPCLM-INST.                             00347000
003480     MOVE RPINF00-ACCOUNT TO DPCLM-ACCOUNT.                       00348000
003490     PERFORM DEP-CLM-GET-EQUAL-REQUEST.                           00349000
003500     IF WS-FUNCTION IS EQUAL TO 'E'                               00350000
003510         OR WS-FUNCTION IS EQUAL TO 'N'                           00351000
003520         GO TO RF-END.                                            00352000
003530     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00353000
003540         MOVE 'B' TO RPINF00-RETURN                               00354000
003550         MOVE 0017 TO RPINF00-ABTRACE                             00355000
003560         GO TO RF-END.                                            00356000
003570     IF RPINF00-INST IS NOT EQUAL TO DPCLM-INST                   00357000
003580         OR RPINF00-ACCOUNT IS NOT EQUAL TO DPCLM-ACCOUNT         00358000
003590         MOVE 'Y' TO WS-READ-SW                                   00359000
003600         MOVE 'N' TO WS-FUNCTION                                  00360000
003610         GO TO RF-END.                                            00361000
003620     IF DPCLM-MSTATUS IS EQUAL TO SPACES                          00362000
003630         GO TO RF-MOVECLM.                                        00363000
003640     IF RPINF00-CLOSEDACCTOPT IS EQUAL TO 'Y'                     00364000
003650         AND DPCLM-MSTATUS IS NOT EQUAL TO 'P'                    00365000
003660         MOVE SPACES TO DPCLM-MSTATUS                             00366000
003670         GO TO RF-MOVECLM.                                        00367000
003680     IF DPCLM-MSTATUS IS EQUAL TO 'C'                             00368000
003690         MOVE 'D' TO WS-FUNCTION                                  00369000
003700         GO TO RF-END.                                            00370000
003710     MOVE 'N' TO WS-FUNCTION.                                     00371000
003720     GO TO RF-END.                                                00372000
003730 RF-MOVECLM.                                                      00373000
003740     PERFORM MOVE-CLM-TO-INF.                                     00374000
003750     GO TO RF-END.                                                00375000
003760 RF-READSAV.                                                      00376000
003770     IF WS-SAVOPEN IS NOT EQUAL TO 'Y'                            00377000
003780         OR WS-SVNOPEN IS NOT EQUAL TO 'Y'                        00378000
003790         PERFORM OPEN-ROUTINE.                                    00379000
003800     MOVE RPINF00-INST TO DPSVM-INST.                             00380000
003810     MOVE RPINF00-ACCOUNT TO DPSVM-ACCOUNT.                       00381000
003820     PERFORM DEP-SVM-GET-EQUAL-REQUEST.                           00382000
003830     IF WS-FUNCTION IS EQUAL TO 'E'                               00383000
003840         OR WS-FUNCTION IS EQUAL TO 'N'                           00384000
003850         GO TO RF-END.                                            00385000
003860     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00386000
003870         MOVE 'B' TO RPINF00-RETURN                               00387000
003880         MOVE 0018 TO RPINF00-ABTRACE                             00388000
003890         GO TO RF-END.                                            00389000
003900     IF RPINF00-INST IS NOT EQUAL TO DPSVM-INST                   00390000
003910         OR RPINF00-ACCOUNT IS NOT EQUAL TO DPSVM-ACCOUNT         00391000
003920         MOVE 'Y' TO WS-READ-SW                                   00392000
003930         MOVE 'N' TO WS-FUNCTION                                  00393000
003940         GO TO RF-END.                                            00394000
003950 RF-READSVN.                                                      00395000
003960     MOVE RPINF00-INST TO DPSVN-INST.                             00396000
003970     MOVE RPINF00-ACCOUNT TO DPSVN-ACCOUNT.                       00397000
003980     PERFORM DEP-SVN-GET-EQUAL-REQUEST.                           00398000
003990     IF WS-FUNCTION IS EQUAL TO 'E'                               00399000
004000         OR WS-FUNCTION IS EQUAL TO 'N'                           00400000
004010         GO TO RF-END.                                            00401000
004020     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00402000
004030         MOVE 'B' TO RPINF00-RETURN                               00403000
004040         MOVE 0019 TO RPINF00-ABTRACE                             00404000
004050         GO TO RF-END.                                            00405000
004060     IF RPINF00-INST IS NOT EQUAL TO DPSVN-INST                   00406000
004070         OR RPINF00-ACCOUNT IS NOT EQUAL TO DPSVN-ACCOUNT         00407000
004080         MOVE 'Y' TO WS-READ-SW                                   00408000
004090         MOVE 'N' TO WS-FUNCTION                                  00409000
004100         GO TO RF-END.                                            00410000
004110     IF DPSVM-MSTATUS IS EQUAL TO SPACES                          00411000
004120         GO TO RF-MOVESVM.                                        00412000
004130     IF RPINF00-CLOSEDACCTOPT IS EQUAL TO 'Y'                     00413000
004140         AND DPSVM-MSTATUS IS NOT EQUAL TO 'P'                    00414000
004150         MOVE SPACES TO DPSVM-MSTATUS                             00415000
004160         GO TO RF-MOVESVM.                                        00416000
004170     IF DPSVM-MSTATUS IS EQUAL TO 'C'                             00417000
004180         MOVE 'D' TO WS-FUNCTION                                  00418000
004190         GO TO RF-END.                                            00419000
004200     MOVE 'N' TO WS-FUNCTION.                                     00420000
004210     GO TO RF-END.                                                00421000
004220 RF-MOVESVM.                                                      00422000
004230     PERFORM MOVE-SVM-TO-INF.                                     00423000
004240 RF-END.                                                          00424000
004250     GO TO RETURN-ROUTINE.                                        00425000
004260 RF-EXIT.                                                         00426000
004270     EXIT.                                                        00427000
004280******************************************************************00428000
004290 READ-NEXT SECTION.                                               00429000
004300 RN-START.                                                        00430000
004310     IF RPINF00-APPLR IS NOT EQUAL TO '01'                        00431000
004320         GO TO RN-CLM.                                            00432000
004330     IF WS-DDMOPEN IS NOT EQUAL TO 'Y'                            00433000
004340         OR WS-DDNOPEN IS NOT EQUAL TO 'Y'                        00434000
004350         OR WS-BNKOPEN IS NOT EQUAL TO 'Y'                        00435000
004360         PERFORM OPEN-ROUTINE.                                    00436000
004370 RN-DDM.                                                          00437000
004380     IF WS-READ-SW IS EQUAL TO 'Y'                                00438000
004390         MOVE 'N' TO WS-READ-SW                                   00439000
004400         GO TO RN-CHECK-DDM.                                      00440000
004410 RN-READNEXT-DDM.                                                 00441000
004420     PERFORM DEP-DDM-GET-NEXT-REQUEST.                            00442000
004430     IF WS-FUNCTION IS EQUAL TO 'E'                               00443000
004440         OR WS-FUNCTION IS EQUAL TO 'N'                           00444000
004450         GO TO RN-END.                                            00445000
004460     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00446000
004470         MOVE 'N' TO RPINF00-RETURN                               00447000
004480         MOVE 0020 TO RPINF00-ABTRACE                             00448000
004490         GO TO RN-END.                                            00449000
004500 RN-READNEXT-DDN.                                                 00450000
004510     PERFORM DEP-DDN-GET-NEXT-REQUEST.                            00451000
004520     IF WS-FUNCTION IS EQUAL TO 'E'                               00452000
004530         OR WS-FUNCTION IS EQUAL TO 'N'                           00453000
004540         GO TO RN-END.                                            00454000
004550     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00455000
004560         MOVE 'N' TO RPINF00-RETURN                               00456000
004570         MOVE 0021 TO RPINF00-ABTRACE                             00457000
004580         GO TO RN-END.                                            00458000
004590     IF DPDDN-GRP-KEY IS LESS THAN DPDDM-GRP-KEY                  00459000
004600         GO TO RN-READNEXT-DDN.                                   00460000
004610 RN-CHECK-DDM.                                                    00461000
004620     IF DPDDM-INST IS LESS THAN RPINF00-INST                      00462000
004630         OR DPDDM-ACCOUNT IS LESS THAN RPINF00-ACCOUNT            00463000
004640         GO TO RN-READNEXT-DDM.                                   00464000
004650     IF DPDDM-INST IS GREATER THAN RPINF00-INST                   00465000
004660         OR DPDDM-ACCOUNT IS GREATER THAN RPINF00-ACCOUNT         00466000
004670         OR DPDDN-INST IS GREATER THAN RPINF00-INST               00467000
004680         OR DPDDN-ACCOUNT IS GREATER THAN RPINF00-ACCOUNT         00468000
004690         MOVE 'Y' TO WS-READ-SW                                   00469000
004700         MOVE 'N' TO WS-FUNCTION                                  00470000
004710         GO TO RN-END.                                            00471000
004720     IF DPDDM-MSTATUS IS EQUAL TO SPACES                          00472000
004730         GO TO RN-MOVEDDM.                                        00473000
004740     IF RPINF00-CLOSEDACCTOPT IS EQUAL TO 'Y'                     00474000
004750         AND DPDDM-MSTATUS IS NOT EQUAL TO 'P'                    00475000
004760         MOVE SPACES TO DPDDM-MSTATUS                             00476000
004770         GO TO RN-MOVEDDM.                                        00477000
004780     IF DPDDM-MSTATUS IS EQUAL TO 'C'                             00478000
004790         MOVE 'D' TO WS-FUNCTION                                  00479000
004800         GO TO RN-END.                                            00480000
004810     MOVE 'N' TO WS-FUNCTION.                                     00481000
004820     GO TO RN-END.                                                00482000
004830 RN-MOVEDDM.                                                      00483000
004840     PERFORM MOVE-DDM-TO-INF.                                     00484000
004850     GO TO RN-END.                                                00485000
004860 RN-CLM.                                                          00486000
004870     IF RPINF00-APPLR IS NOT EQUAL TO '03'                        00487000
004880         GO TO RN-SVM.                                            00488000
004890     IF WS-CLMOPEN IS NOT EQUAL TO 'Y'                            00489000
004900         PERFORM OPEN-ROUTINE.                                    00490000
004910     IF WS-READ-SW IS EQUAL TO 'Y'                                00491000
004920         MOVE 'N' TO WS-READ-SW                                   00492000
004930         GO TO RN-CHECK-CLM.                                      00493000
004940 RN-READNEXT-CLM.                                                 00494000
004950     PERFORM DEP-CLM-GET-NEXT-REQUEST.                            00495000
004960     IF WS-FUNCTION IS EQUAL TO 'E'                               00496000
004970         OR WS-FUNCTION IS EQUAL TO 'N'                           00497000
004980         GO TO RN-END.                                            00498000
004990     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00499000
005000         MOVE 'N' TO RPINF00-RETURN                               00500000
005010         MOVE 0022 TO RPINF00-ABTRACE                             00501000
005020         GO TO RN-END.                                            00502000
005030 RN-CHECK-CLM.                                                    00503000
005040     IF DPCLM-INST IS LESS THAN RPINF00-INST                      00504000
005050         OR DPCLM-ACCOUNT IS LESS THAN RPINF00-ACCOUNT            00505000
005060         GO TO RN-READNEXT-CLM.                                   00506000
005070     IF DPCLM-INST IS GREATER THAN RPINF00-INST                   00507000
005080         OR DPCLM-ACCOUNT IS GREATER THAN RPINF00-ACCOUNT         00508000
005090         MOVE 'Y' TO WS-READ-SW                                   00509000
005100         MOVE 'N' TO WS-FUNCTION                                  00510000
005110         GO TO RN-END.                                            00511000
005120     IF DPCLM-MSTATUS IS EQUAL TO SPACES                          00512000
005130         GO TO RN-MOVECLM.                                        00513000
005140     IF RPINF00-CLOSEDACCTOPT IS EQUAL TO 'Y'                     00514000
005150         AND DPCLM-MSTATUS IS NOT EQUAL TO 'P'                    00515000
005160         MOVE SPACES TO DPCLM-MSTATUS                             00516000
005170         GO TO RN-MOVECLM.                                        00517000
005180     IF DPCLM-MSTATUS IS EQUAL TO 'C'                             00518000
005190         MOVE 'D' TO WS-FUNCTION                                  00519000
005200         GO TO RN-END.                                            00520000
005210     MOVE 'N' TO WS-FUNCTION.                                     00521000
005220     GO TO RN-END.                                                00522000
005230 RN-MOVECLM.                                                      00523000
005240     PERFORM MOVE-CLM-TO-INF.                                     00524000
005250     GO TO RN-END.                                                00525000
005260 RN-SVM.                                                          00526000
005270     IF WS-SAVOPEN IS NOT EQUAL TO 'Y'                            00527000
005280         OR WS-SVNOPEN IS NOT EQUAL TO 'Y'                        00528000
005290         PERFORM OPEN-ROUTINE.                                    00529000
005300     IF WS-READ-SW IS EQUAL TO 'Y'                                00530000
005310         MOVE 'N' TO WS-READ-SW                                   00531000
005320         GO TO RN-CHECK-SVM.                                      00532000
005330 RN-READNEXT-SVM.                                                 00533000
005340     PERFORM DEP-SVM-GET-NEXT-REQUEST.                            00534000
005350     IF WS-FUNCTION IS EQUAL TO 'E'                               00535000
005360         OR WS-FUNCTION IS EQUAL TO 'N'                           00536000
005370         GO TO RN-END.                                            00537000
005380     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00538000
005390         MOVE 'N' TO RPINF00-RETURN                               00539000
005400         MOVE 0023 TO RPINF00-ABTRACE                             00540000
005410         GO TO RN-END.                                            00541000
005420 RN-READNEXT-SVN.                                                 00542000
005430     PERFORM DEP-SVN-GET-NEXT-REQUEST.                            00543000
005440     IF WS-FUNCTION IS EQUAL TO 'E'                               00544000
005450         OR WS-FUNCTION IS EQUAL TO 'N'                           00545000
005460         GO TO RN-END.                                            00546000
005470     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00547000
005480         MOVE 'N' TO RPINF00-RETURN                               00548000
005490         MOVE 0024 TO RPINF00-ABTRACE                             00549000
005500         GO TO RN-END.                                            00550000
005510     IF DPSVN-GRP-KEY IS LESS THAN DPSVM-GRP-KEY                  00551000
005520         GO TO RN-READNEXT-SVN.                                   00552000
005530 RN-CHECK-SVM.                                                    00553000
005540     IF DPSVM-INST IS LESS THAN RPINF00-INST                      00554000
005550         OR DPSVM-ACCOUNT IS LESS THAN RPINF00-ACCOUNT            00555000
005560         GO TO RN-READNEXT-SVM.                                   00556000
005570     IF DPSVM-INST IS GREATER THAN RPINF00-INST                   00557000
005580         OR DPSVM-ACCOUNT IS GREATER THAN RPINF00-ACCOUNT         00558000
005590         OR DPSVN-INST IS GREATER THAN RPINF00-INST               00559000
005600         OR DPSVN-ACCOUNT IS GREATER THAN RPINF00-ACCOUNT         00560000
005610         MOVE 'Y' TO WS-READ-SW                                   00561000
005620         MOVE 'N' TO WS-FUNCTION                                  00562000
005630         GO TO RN-END.                                            00563000
005640     IF DPSVM-MSTATUS IS EQUAL TO SPACES                          00564000
005650         GO TO RN-MOVESVM.                                        00565000
005660     IF RPINF00-CLOSEDACCTOPT IS EQUAL TO 'Y'                     00566000
005670         AND DPSVM-MSTATUS IS NOT EQUAL TO 'P'                    00567000
005680         MOVE SPACES TO DPSVM-MSTATUS                             00568000
005690         GO TO RN-MOVESVM.                                        00569000
005700     IF DPSVM-MSTATUS IS EQUAL TO 'C'                             00570000
005710         MOVE 'D' TO WS-FUNCTION                                  00571000
005720         GO TO RN-END.                                            00572000
005730     MOVE 'N' TO WS-FUNCTION.                                     00573000
005740     GO TO RN-END.                                                00574000
005750 RN-MOVESVM.                                                      00575000
005760     PERFORM MOVE-SVM-TO-INF.                                     00576000
005770 RN-END.                                                          00577000
005780     GO TO RETURN-ROUTINE.                                        00578000
005790 RN-EXIT.                                                         00579000
005800     EXIT.                                                        00580000
005810******************************************************************00581000
005820 READ-RANDOM SECTION.                                             00582000
005830 RR-START.                                                        00583000
005840     IF RPINF00-APPLR IS NOT EQUAL TO '01'                        00584000
005850         GO TO RR-READCLM.                                        00585000
005860     IF WS-DDMOPEN IS NOT EQUAL TO 'Y'                            00586000
005870         OR WS-DDNOPEN IS NOT EQUAL TO 'Y'                        00587000
005880         OR WS-BNKOPEN IS NOT EQUAL TO 'Y'                        00588000
005890         PERFORM OPEN-ROUTINE.                                    00589000
005900 RR-READDDM.                                                      00590000
005910     MOVE RPINF00-INST TO DPDDM-INST.                             00591000
005920     MOVE RPINF00-ACCOUNT TO DPDDM-ACCOUNT.                       00592000
005930     PERFORM DEP-DDM-GET-REQUEST.                                 00593000
005940     IF WS-FUNCTION IS EQUAL TO 'N'                               00594000
005950         GO TO RR-END.                                            00595000
005960     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00596000
005970         MOVE 'R' TO RPINF00-RETURN                               00597000
005980         MOVE 0025 TO RPINF00-ABTRACE                             00598000
005990         GO TO RETURN-ROUTINE.                                    00599000
006000 RR-READDDN.                                                      00600000
006010     MOVE RPINF00-INST TO DPDDN-INST.                             00601000
006020     MOVE RPINF00-ACCOUNT TO DPDDN-ACCOUNT.                       00602000
006030     PERFORM DEP-DDN-GET-REQUEST.                                 00603000
006040     IF WS-FUNCTION IS EQUAL TO 'N'                               00604000
006050         GO TO RR-END.                                            00605000
006060     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00606000
006070         MOVE 'R' TO RPINF00-RETURN                               00607000
006080         MOVE 0026 TO RPINF00-ABTRACE                             00608000
006090         GO TO RETURN-ROUTINE.                                    00609000
006100     IF DPDDM-MSTATUS IS EQUAL TO SPACES                          00610000
006110         GO TO RR-MOVEDDM.                                        00611000
006120     IF RPINF00-CLOSEDACCTOPT IS EQUAL TO 'Y'                     00612000
006130         AND DPDDM-MSTATUS IS NOT EQUAL TO 'P'                    00613000
006140         MOVE SPACES TO DPDDM-MSTATUS                             00614000
006150         GO TO RR-MOVEDDM.                                        00615000
006160     IF DPDDM-MSTATUS IS EQUAL TO 'C'                             00616000
006170         MOVE 'D' TO WS-FUNCTION                                  00617000
006180         GO TO RR-END.                                            00618000
006190     MOVE 'N' TO WS-FUNCTION.                                     00619000
006200     GO TO RR-END.                                                00620000
006210 RR-MOVEDDM.                                                      00621000
006220     PERFORM MOVE-DDM-TO-INF.                                     00622000
006230     GO TO RR-END.                                                00623000
006240 RR-READCLM.                                                      00624000
006250     IF RPINF00-APPLR IS NOT EQUAL TO '03'                        00625000
006260         GO TO RR-READSAV.                                        00626000
006270     IF WS-CLMOPEN IS NOT EQUAL TO 'Y'                            00627000
006280         PERFORM OPEN-ROUTINE.                                    00628000
006290     MOVE RPINF00-INST TO DPCLM-INST.                             00629000
006300     MOVE RPINF00-ACCOUNT TO DPCLM-ACCOUNT.                       00630000
006310     PERFORM DEP-CLM-GET-REQUEST.                                 00631000
006320     IF WS-FUNCTION IS EQUAL TO 'N'                               00632000
006330         GO TO RR-END.                                            00633000
006340     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00634000
006350         MOVE 'R' TO RPINF00-RETURN                               00635000
006360         MOVE 0027 TO RPINF00-ABTRACE                             00636000
006370         GO TO RETURN-ROUTINE.                                    00637000
006380     IF DPCLM-MSTATUS IS EQUAL TO SPACES                          00638000
006390         GO TO RR-MOVECLM.                                        00639000
006400     IF RPINF00-CLOSEDACCTOPT IS EQUAL TO 'Y'                     00640000
006410         AND DPCLM-MSTATUS IS NOT EQUAL TO 'P'                    00641000
006420         MOVE SPACES TO DPCLM-MSTATUS                             00642000
006430         GO TO RR-MOVECLM.                                        00643000
006440     IF DPCLM-MSTATUS IS EQUAL TO 'C'                             00644000
006450         MOVE 'D' TO WS-FUNCTION                                  00645000
006460         GO TO RR-END.                                            00646000
006470     MOVE 'N' TO WS-FUNCTION.                                     00647000
006480     GO TO RR-END.                                                00648000
006490 RR-MOVECLM.                                                      00649000
006500     PERFORM MOVE-CLM-TO-INF.                                     00650000
006510     GO TO RR-END.                                                00651000
006520 RR-READSAV.                                                      00652000
006530     IF WS-SAVOPEN IS NOT EQUAL TO 'Y'                            00653000
006540         OR WS-SVNOPEN IS NOT EQUAL TO 'Y'                        00654000
006550         PERFORM OPEN-ROUTINE.                                    00655000
006560     MOVE RPINF00-INST TO DPSVM-INST.                             00656000
006570     MOVE RPINF00-ACCOUNT TO DPSVM-ACCOUNT.                       00657000
006580     PERFORM DEP-SVM-GET-REQUEST.                                 00658000
006590     IF WS-FUNCTION IS EQUAL TO 'N'                               00659000
006600         GO TO RR-END.                                            00660000
006610     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00661000
006620         MOVE 'R' TO RPINF00-RETURN                               00662000
006630         MOVE 0028 TO RPINF00-ABTRACE                             00663000
006640         GO TO RETURN-ROUTINE.                                    00664000
006650 RR-READSVN.                                                      00665000
006660     MOVE RPINF00-INST TO DPSVN-INST.                             00666000
006670     MOVE RPINF00-ACCOUNT TO DPSVN-ACCOUNT.                       00667000
006680     PERFORM DEP-SVN-GET-REQUEST.                                 00668000
006690     IF WS-FUNCTION IS EQUAL TO 'N'                               00669000
006700         GO TO RR-END.                                            00670000
006710     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00671000
006720         MOVE 'R' TO RPINF00-RETURN                               00672000
006730         MOVE 0029 TO RPINF00-ABTRACE                             00673000
006740         GO TO RETURN-ROUTINE.                                    00674000
006750     IF DPSVM-MSTATUS IS NOT EQUAL TO SPACES                      00675000
006760         MOVE 'N' TO WS-FUNCTION                                  00676000
006770         GO TO RR-END.                                            00677000
006780     IF DPSVM-MSTATUS IS EQUAL TO SPACES                          00678000
006790         GO TO RR-MOVESVM.                                        00679000
006800     IF RPINF00-CLOSEDACCTOPT IS EQUAL TO 'Y'                     00680000
006810         AND DPSVM-MSTATUS IS NOT EQUAL TO 'P'                    00681000
006820         MOVE SPACES TO DPSVM-MSTATUS                             00682000
006830         GO TO RR-MOVESVM.                                        00683000
006840     IF DPSVM-MSTATUS IS EQUAL TO 'C'                             00684000
006850         MOVE 'D' TO WS-FUNCTION                                  00685000
006860         GO TO RR-END.                                            00686000
006870     MOVE 'N' TO WS-FUNCTION.                                     00687000
006880     GO TO RR-END.                                                00688000
006890 RR-MOVESVM.                                                      00689000
006900     PERFORM MOVE-SVM-TO-INF.                                     00690000
006910 RR-END.                                                          00691000
006920     GO TO RETURN-ROUTINE.                                        00692000
006930 RR-EXIT.                                                         00693000
006940     EXIT.                                                        00694000
006950******************************************************************00695000
006960 MOVE-DDM-TO-INF SECTION.                                         00696000
006970 MDTI-START.                                                      00697000
006980     MOVE SPACES TO RPINF00-GRP-DATA.                             00698000
006990     MOVE DPDDM-MSTATUS TO RPINF00-APPL-STATUS.                   00699000
007000     MOVE DPDDM-MNEWBRANCH TO RPINF00-BRANCH.                     00700000
007010     MOVE DPDDM-MNEWTYPE TO RPINF00-ACCT-TYPE.                    00701000
007020     MOVE ZEROS TO RPINF00-TERM.                                  00702000
007030     MOVE ZEROS TO RPINF00-DEL-DAYS.                              00703000
007040     MOVE DPDDM-MDORM TO RPINF00-MDORM.                           00704000
007050     MOVE DPDDN-MCOSTC TO RPINF00-COSTC.                          00705000
007060     MOVE SPACES TO RPINF00-USEROPT1.                             00706000
007070     MOVE SPACES TO RPINF00-USEROPT2.                             00707000
007080     MOVE SPACES TO RPINF00-USEROPT3.                             00708000
007090     MOVE SPACES TO RPINF00-USEROPT4.                             00709000
007100     MOVE DPDDM-SCNXT TO SR-FROMJUL.                              00710000
007110     PERFORM CALENDAR-365.                                        00711000
007120     MOVE SR-TCMON TO SR-CMM.                                     00712000
007130     MOVE SR-TCDAY TO SR-CDD.                                     00713000
007140     MOVE SR-TCYR TO SR-CYYYY.                                    00714000
007150     MOVE SR-CYEAR-FIRST TO RPINF00-SCNXT.                        00715000
007160     MOVE DPDDM-BALCUR TO RPINF00-CURBAL.                         00716000
007170     MOVE DPDDM-BALCUR TO WS-BAL.                                 00717000
007180     MOVE +0 TO WS-SUB1.                                          00718000
007190 MDTI-CURCUSTCOL-LOOP.                                            00719000
007200     ADD +1 TO WS-SUB1.                                           00720000
007210     SUBTRACT DPDDM-MFCAMT (WS-SUB1) FROM WS-BAL.                 00721000
007220     IF WS-SUB1 IS LESS THAN +9                                   00722000
007230         GO TO MDTI-CURCUSTCOL-LOOP.                              00723000
007240     MOVE WS-BAL TO RPINF00-CURCUSTCOL.                           00724000
007250     MOVE DPDDM-BALCUR TO WS-BAL.                                 00725000
007260     MOVE +0 TO WS-SUB1.                                          00726000
007270 MDTI-CURBANKCOL-LOOP.                                            00727000
007280     ADD +1 TO WS-SUB1.                                           00728000
007290     SUBTRACT DPDDM-MFBAMT (WS-SUB1) FROM WS-BAL.                 00729000
007300     IF WS-SUB1 IS LESS THAN +9                                   00730000
007310         GO TO MDTI-CURBANKCOL-LOOP.                              00731000
007320     MOVE WS-BAL TO RPINF00-CURBANKCOL.                           00732000
007330     MOVE DPDDM-SCLOWBAL TO RPINF00-LOWBAL.                       00733000
007340     MOVE DPDDM-SCDL TO WS-LASTDATE.                              00734000
007350     PERFORM COMPUTE-DAYS-IN-CYCLE.                               00735000
007360     IF DPDDM-SCAGRBAL IS EQUAL TO ZERO                           00736000
007370         MOVE RPINF00-CURBAL TO RPINF00-AVGBAL                    00737000
007380     ELSE                                                         00738000
007390         DIVIDE DPDDM-SCAGRBAL BY WS-DAYS-FROM-SC                 00739000
007400         GIVING RPINF00-AVGBAL.                                   00740000
007410     IF DPDDM-SCCAGR IS EQUAL TO ZERO                             00741000
007420         MOVE RPINF00-CURBANKCOL TO RPINF00-AVGCOLBAL             00742000
007430     ELSE                                                         00743000
007440         DIVIDE DPDDM-SCCAGR BY WS-DAYS-FROM-SC                   00744000
007450         GIVING RPINF00-AVGCOLBAL.                                00745000
007460     MOVE ZEROS TO RPINF00-COMMAMT.                               00746000
007470     MOVE ZEROS TO RPINF00-CREDIT-LIMIT.                          00747000
007480     MOVE +8 TO WS-SUB1.                                          00748000
007490 MDTI-LOOP.                                                       00749000
007500     ADD +1 TO WS-SUB1.                                           00750000
007510     MOVE ZEROS TO RPINF00-BAL (WS-SUB1).                         00751000
007520     IF WS-SUB1 IS LESS THAN WS-BAL-MAX                           00752000
007530         GO TO MDTI-LOOP.                                         00753000
007540 MDTI-EXIT.                                                       00754000
007550     EXIT.                                                        00755000
007560******************************************************************00756000
007570 MOVE-CLM-TO-INF SECTION.                                         00757000
007580 MCTI-START.                                                      00758000
007590     MOVE SPACES TO RPINF00-GRP-DATA.                             00759000
007600     MOVE DPCLM-MSTATUS TO RPINF00-APPL-STATUS.                   00760000
007610     MOVE DPCLM-MBRANCH TO RPINF00-BRANCH.                        00761000
007620     MOVE DPCLM-MTYPE TO RPINF00-ACCT-TYPE.                       00762000
007630     MOVE ZEROS TO RPINF00-TERM.                                  00763000
007640     MOVE ZEROS TO RPINF00-DEL-DAYS.                              00764000
007650     MOVE SPACES TO RPINF00-MDORM.                                00765000
007660     MOVE DPCLM-MCOSTC TO RPINF00-COSTC.                          00766000
007670     MOVE ZEROS TO RPINF00-SCNXT.                                 00767000
007680     MOVE DPCLM-BALCUR TO RPINF00-CURBAL.                         00768000
007690     MOVE ZEROS TO RPINF00-CURCUSTCOL.                            00769000
007700     MOVE ZEROS TO RPINF00-CURBANKCOL.                            00770000
007710     MOVE DPCLM-BALCUR TO RPINF00-LOWBAL.                         00771000
007720     MOVE DPCLM-STMCODLS TO WS-LASTDATE.                          00772000
007730     PERFORM COMPUTE-DAYS-IN-CYCLE.                               00773000
007740     DIVIDE DPCLM-INTAGR BY WS-DAYS-FROM-SC                       00774000
007750         GIVING RPINF00-AVGBAL.                                   00775000
007760     DIVIDE DPCLM-INTAGR BY WS-DAYS-FROM-SC                       00776000
007770         GIVING RPINF00-AVGCOLBAL.                                00777000
007780     MOVE ZEROS TO RPINF00-COMMAMT.                               00778000
007790     MOVE ZEROS TO RPINF00-CREDIT-LIMIT.                          00779000
007800     MOVE +8 TO WS-SUB1.                                          00780000
007810 MCTI-LOOP.                                                       00781000
007820     ADD +1 TO WS-SUB1.                                           00782000
007830     MOVE ZEROS TO RPINF00-BAL (WS-SUB1).                         00783000
007840     IF WS-SUB1 IS LESS THAN WS-BAL-MAX                           00784000
007850         GO TO MCTI-LOOP.                                         00785000
007860 MCTI-EXIT.                                                       00786000
007870     EXIT.                                                        00787000
007880******************************************************************00788000
007890 MOVE-SVM-TO-INF SECTION.                                         00789000
007900 MSTI-START.                                                      00790000
007910     MOVE SPACES TO RPINF00-GRP-DATA.                             00791000
007920     MOVE DPSVM-MSTATUS TO RPINF00-APPL-STATUS.                   00792000
007930     MOVE DPSVM-MNEWBRANCH TO RPINF00-BRANCH.                     00793000
007940     MOVE DPSVM-MNEWTYPE TO RPINF00-ACCT-TYPE.                    00794000
007950     MOVE ZEROS TO RPINF00-TERM.                                  00795000
007960     MOVE ZEROS TO RPINF00-DEL-DAYS.                              00796000
007970     MOVE DPSVM-MDORM TO RPINF00-MDORM.                           00797000
007980     MOVE DPSVN-MCOSTC TO RPINF00-COSTC.                          00798000
007990     MOVE DPSVM-SCNXT TO SR-FROMJUL.                              00799000
008000     PERFORM CALENDAR-365.                                        00800000
008010     MOVE SR-TCMON TO SR-CMM.                                     00801000
008020     MOVE SR-TCDAY TO SR-CDD.                                     00802000
008030     MOVE SR-TCYR TO SR-CYYYY.                                    00803000
008040     MOVE SR-CYEAR-FIRST TO RPINF00-SCNXT.                        00804000
008050     MOVE DPSVM-BALCUR TO RPINF00-CURBAL.                         00805000
008060     MOVE DPSVM-BALCUR TO WS-BAL.                                 00806000
008070     MOVE +0 TO WS-SUB1.                                          00807000
008080 MSTI-CURCUSTCOL-LOOP.                                            00808000
008090     ADD +1 TO WS-SUB1.                                           00809000
008100     SUBTRACT DPSVM-MFCAMT (WS-SUB1) FROM WS-BAL.                 00810000
008110     IF WS-SUB1 IS LESS THAN +9                                   00811000
008120         GO TO MSTI-CURCUSTCOL-LOOP.                              00812000
008130     MOVE WS-BAL TO RPINF00-CURCUSTCOL.                           00813000
008140     MOVE DPSVM-BALCUR TO WS-BAL.                                 00814000
008150     MOVE +0 TO WS-SUB1.                                          00815000
008160 MSTI-CURBANKCOL-LOOP.                                            00816000
008170     ADD +1 TO WS-SUB1.                                           00817000
008180     SUBTRACT DPSVM-MFBAMT (WS-SUB1) FROM WS-BAL.                 00818000
008190     IF WS-SUB1 IS LESS THAN +9                                   00819000
008200         GO TO MSTI-CURBANKCOL-LOOP.                              00820000
008210     MOVE WS-BAL TO RPINF00-CURBANKCOL.                           00821000
008220     MOVE DPSVM-SCLOWBAL TO RPINF00-LOWBAL.                       00822000
008230     MOVE DPSVM-SCDL TO WS-LASTDATE.                              00823000
008240     PERFORM COMPUTE-DAYS-IN-CYCLE.                               00824000
008250     DIVIDE DPSVM-SCAGRBAL BY WS-DAYS-FROM-SC                     00825000
008260         GIVING RPINF00-AVGBAL.                                   00826000
008270     DIVIDE DPSVM-SCCAGR BY WS-DAYS-FROM-SC                       00827000
008280         GIVING RPINF00-AVGCOLBAL.                                00828000
008290     MOVE ZEROS TO RPINF00-COMMAMT.                               00829000
008300     MOVE ZEROS TO RPINF00-CREDIT-LIMIT.                          00830000
008310     MOVE +8 TO WS-SUB1.                                          00831000
008320 MSTI-LOOP.                                                       00832000
008330     ADD +1 TO WS-SUB1.                                           00833000
008340     MOVE ZEROS TO RPINF00-BAL (WS-SUB1).                         00834000
008350     IF WS-SUB1 IS LESS THAN WS-BAL-MAX                           00835000
008360         GO TO MSTI-LOOP.                                         00836000
008370 MSTI-EXIT.                                                       00837000
008380     EXIT.                                                        00838000
008390***************************************************************** 00839000
008400 COMPUTE-DAYS-IN-CYCLE SECTION.                                   00840000
008410 CDIC-START.                                                      00841000
008420     MOVE WS-NPROCDTA TO SR-FROMJUL.                              00842000
008430     MOVE 'D' TO SR-PERIOD.                                       00843000
008440     MOVE 1 TO SR-FREQ.                                           00844000
008450     MOVE ZEROS TO SR-DAY.                                        00845000
008460     PERFORM LAST-DATE-365.                                       00846000
008470     MOVE WS-LASTDATE TO SR-FROMJUL.                              00847000
008480     PERFORM ELAPSED-DAYS-365.                                    00848000
008490     MOVE SR-RESULT TO WS-DAYS-FROM-SC.                           00849000
008500     IF WS-DAYS-FROM-SC IS NOT GREATER THAN ZERO                  00850000
008510         MOVE +1 TO WS-DAYS-FROM-SC.                              00851000
008520 CDIC-EXIT.                                                       00852000
008530     EXIT.                                                        00853000
008540******************************************************************00854000
008550 GET-FILE-ORGANIZATION SECTION.                                   00855000
000000 COPY SRP093.                                                     00856000
008570******************************************************************00857000
000000 COPY DPPDDMA.                                                    00858000
008590******************************************************************00859000
000000 COPY DPPDDNA.                                                    00860000
008610******************************************************************00861000
000000 COPY DPPSVMA.                                                    00862000
008630******************************************************************00863000
000000 COPY DPPSVNA.                                                    00864000
008650******************************************************************00865000
000000 COPY DPPCLMA.                                                    00866000
008670******************************************************************00867000
000000 COPY DPPBNKA.                                                    00868000
008690******************************************************************00869000
008700 JULIAN-365 SECTION.                                              00870000
000000 COPY SRP001.                                                     00871000
008720******************************************************************00872000
008730 CALENDAR-365 SECTION.                                            00873000
000000 COPY SRP003.                                                     00874000
008750******************************************************************00875000
008760 ELAPSED-DAYS-365 SECTION.                                        00876000
000000 COPY SRP005.                                                     00877000
008780******************************************************************00878000
008790 LAST-DATE-365 SECTION.                                           00879000
000000 COPY SRP019.                                                     00880000
008810******************************************************************00881000
008820 RETURN-ROUTINE SECTION.                                          00882000
008830 RT-START.                                                        00883000
008840     MOVE WS-FUNCTION TO RPINF00-FUNCTION.                        00884000
008850     GOBACK.                                                      00885000
008860******************************************************************00886000
