000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPK7105.                                 00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*     RPK7105 EDIT EXIT FOR FORM 7105 BATCH                       00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW105-AREAS.                                                00016000
000000 COPY SRW105.                                                     00017000
000180*01  BICRSRB.                                                     00018000
000000 COPY BICRSRB.                                                    00019000
000200*01  BICRPSB.                                                     00020000
000000 COPY BICRPSB.                                                    00021000
000220*01  BICRVERB.                                                    00022000
000000 COPY BICRVERB.                                                   00023000
000240*01  BICRSTAT.                                                    00024000
000000 COPY BICRSTAT.                                                   00025000
000260*01  BICRLOG.                                                     00026000
000000 COPY BICRLOG.                                                    00027000
000280*01  BICRDBS.                                                     00028000
000000 COPY BICRDBS.                                                    00029000
000300*01  BICPBPRM.                                                    00030000
000000 COPY BICPBPRM.                                                   00031000
000320 01  RPWPRI-AREAS.                                                00032000
000000 COPY RPWPRI.                                                     00033000
000340 01  MIWPRI-AREAS.                                                00034000
000000 COPY MIWPRI.                                                     00035000
000360 01  MIWMSTA-AREAS.                                               00036000
000000 COPY MIWMSTA.                                                    00037000
000380 01  MIMST-RECORD.                                                00038000
000000 COPY MISMST.                                                     00039000
000400 01  MI7105-RECORD.                                               00040000
000000 COPY MIS7105.                                                    00041000
000420 01  WS-ABEND.                                                    00042000
000000 COPY SRW028.                                                     00043000
000440 01  WORK-AREAS.                                                  00044000
000450     03  WS-PROGRAM-ID           PIC X(08)       VALUE 'RPK7105'. 00045000
000460     03  WS-UPD-USER             PIC X(08)       VALUE SPACES.    00046000
000470     03  WS-FILEOPTS             PIC X(25)       VALUE SPACES.    00047000
000480     03  WS-FILEOPT      REDEFINES WS-FILEOPTS                    00048000
000490                                 PIC X(01)       OCCURS 25 TIMES. 00049000
000500     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00050000
000510     03  WS-RETURNX              PIC X(08)       VALUE SPACES.    00051000
000520     03  WS-END-FLAG             PIC X(01)       VALUE SPACES.    00052000
000530     03  WS-SUB1                 PIC S9(04)      COMP             00053000
000540                                                 VALUE +0000.     00054000
000550     03  WS-MMDDYYYY             PIC 9(08)       VALUE ZERO.      00055000
000560     03  FILLER          REDEFINES WS-MMDDYYYY.                   00056000
000570         05  WS-MMDDYYYY-MON     PIC 9(02).                       00057000
000580         05  WS-MMDDYYYY-DAY     PIC 9(02).                       00058000
000590         05  WS-MMDDYYYY-YR      PIC 9(04).                       00059000
000600     03  WS-YYYYMMDD             PIC 9(08)       VALUE ZERO.      00060000
000610     03  FILLER          REDEFINES WS-YYYYMMDD.                   00061000
000620         05  WS-YYYYMMDD-YR      PIC 9(04).                       00062000
000630         05  WS-YYYYMMDD-MON     PIC 9(02).                       00063000
000640         05  WS-YYYYMMDD-DAY     PIC 9(02).                       00064000
000650******************************************************************00065000
000660 LINKAGE SECTION.                                                 00066000
000670 01  DFHCOMMAREA.                                                 00067000
000680*    03  SLSCOMM-MESSSAGE                                         00068000
000000 COPY SLSCOMM.                                                    00069000
000700*    03  MISAME-AREAS.                                            00070000
000000 COPY MISAME.                                                     00071000
000720******************************************************************00072000
000730 PROCEDURE DIVISION USING DFHCOMMAREA.                            00073000
000740******************************************************************00074000
000750 MAIN-ROUTINE SECTION.                                            00075000
000760 MR-START.                                                        00076000
000770     MOVE SLCOMM-FILEOPTS TO WS-FILEOPTS.                         00077000
000780     IF MIAME-FOPTSUB IS GREATER THAN ZEROS                       00078000
000790         MOVE WS-FILEOPT (MIAME-FOPTSUB) TO MIC-MST-APPL-ORG      00079000
000800         MOVE WS-FILEOPT (MIAME-FOPTSUB) TO MIC-MST-ORG.          00080000
000810     MOVE SLCOMM-OPERID TO WS-UPD-USER.                           00081000
000820     MOVE SLCOMM-DATE TO WS-MMDDYYYY.                             00082000
000830     MOVE WS-MMDDYYYY-MON TO WS-YYYYMMDD-MON.                     00083000
000840     MOVE WS-MMDDYYYY-DAY TO WS-YYYYMMDD-DAY.                     00084000
000850     MOVE WS-MMDDYYYY-YR TO WS-YYYYMMDD-YR.                       00085000
000860     MOVE 'N' TO MIAME-RECORD-WRITE.                              00086000
000870     IF MIAME-CLOSE-FILE IS EQUAL TO 'C'                          00087000
000880         GO TO MR-DONE.                                           00088000
000890     MOVE MIAME-DATA-BASE TO MI7105-RECORD.                       00089000
000900     PERFORM MICM-7105.                                           00090000
000910     MOVE MI7105-RECORD TO MIAME-DATA-BASE.                       00091000
000920 MR-DONE.                                                         00092000
000930     GO TO RETURN-ROUTINE.                                        00093000
000940 MR-EXIT.                                                         00094000
000950     EXIT.                                                        00095000
000960******************************************************************00096000
000970 MICM-7105 SECTION.                                               00097000
000980 MR7105-START.                                                    00098000
000990     MOVE SPACES TO WS-END-FLAG.                                  00099000
001000     IF SLCOMM-FUNC IS EQUAL TO 'D'                               00100000
001010         GO TO MR7105-EXIT.                                       00101000
001020 MR7105-GRP1.                                                     00102000
001030     IF MIM-7105DEMOGRP-1 IS EQUAL TO SPACES                      00103000
001040         GO TO MR7105-GRP2.                                       00104000
001050     IF MIM-7105KEYWORD-1 IS EQUAL TO SPACES                      00105000
001060         OR MIM-7105REL-1 IS EQUAL TO SPACES                      00106000
001070         OR MIM-7105CONJUNCTION-1 IS EQUAL TO SPACES              00107000
001080         GO TO MR7105-GRP1-ERR.                                   00108000
001090     IF MIM-7105CONJUNCTION-1 IS EQUAL TO 'END'                   00109000
001100         MOVE 'Y' TO WS-END-FLAG.                                 00110000
001110     GO TO MR7105-GRP2.                                           00111000
001120 MR7105-GRP1-ERR.                                                 00112000
001130     ADD +3 TO SLCOMM-ERRCNT.                                     00113000
001140     MOVE 'E' TO MIAME-ERRORINDR (050).                           00114000
001150     MOVE 'E' TO MIAME-ERRORINDR (051).                           00115000
001160     MOVE 'E' TO MIAME-ERRORINDR (053).                           00116000
001170 MR7105-GRP2.                                                     00117000
001180     IF MIM-7105DEMOGRP-2 IS EQUAL TO SPACES                      00118000
001190         GO TO MR7105-GRP3.                                       00119000
001200     IF MIM-7105DEMOGRP-1 IS EQUAL TO SPACES                      00120000
001210         GO TO MR7105-GRP2-ERR.                                   00121000
001220     IF MIM-7105KEYWORD-2 IS EQUAL TO SPACES                      00122000
001230         OR MIM-7105REL-2 IS EQUAL TO SPACES                      00123000
001240         OR MIM-7105CONJUNCTION-2 IS EQUAL TO SPACES              00124000
001250         GO TO MR7105-GRP2-ERR.                                   00125000
001260     IF MIM-7105CONJUNCTION-2 IS EQUAL TO 'END'                   00126000
001270         AND WS-END-FLAG IS EQUAL TO 'Y'                          00127000
001280         ADD +1 TO SLCOMM-ERRCNT                                  00128000
001290         MOVE 'E' TO MIAME-ERRORINDR (057)                        00129000
001300         GO TO MR7105-GRP3.                                       00130000
001310     IF MIM-7105CONJUNCTION-2 IS EQUAL TO 'END'                   00131000
001320         MOVE 'Y' TO WS-END-FLAG.                                 00132000
001330     GO TO MR7105-GRP3.                                           00133000
001340 MR7105-GRP2-ERR.                                                 00134000
001350     ADD +3 TO SLCOMM-ERRCNT.                                     00135000
001360     MOVE 'E' TO MIAME-ERRORINDR (054).                           00136000
001370     MOVE 'E' TO MIAME-ERRORINDR (055).                           00137000
001380     MOVE 'E' TO MIAME-ERRORINDR (057).                           00138000
001390 MR7105-GRP3.                                                     00139000
001400     IF MIM-7105DEMOGRP-3 IS EQUAL TO SPACES                      00140000
001410         GO TO MR7105-GRP4.                                       00141000
001420     IF MIM-7105DEMOGRP-2 IS EQUAL TO SPACES                      00142000
001430         GO TO MR7105-GRP3-ERR.                                   00143000
001440     IF MIM-7105KEYWORD-3 IS EQUAL TO SPACES                      00144000
001450         OR MIM-7105REL-3 IS EQUAL TO SPACES                      00145000
001460         OR MIM-7105CONJUNCTION-3 IS EQUAL TO SPACES              00146000
001470         GO TO MR7105-GRP3-ERR.                                   00147000
001480     IF MIM-7105CONJUNCTION-3 IS EQUAL TO 'END'                   00148000
001490         AND WS-END-FLAG IS EQUAL TO 'Y'                          00149000
001500         ADD +1 TO SLCOMM-ERRCNT                                  00150000
001510         MOVE 'E' TO MIAME-ERRORINDR (061)                        00151000
001520         GO TO MR7105-GRP4.                                       00152000
001530     IF MIM-7105CONJUNCTION-3 IS EQUAL TO 'END'                   00153000
001540         MOVE 'Y' TO WS-END-FLAG.                                 00154000
001550     GO TO MR7105-GRP4.                                           00155000
001560 MR7105-GRP3-ERR.                                                 00156000
001570     ADD +3 TO SLCOMM-ERRCNT.                                     00157000
001580     MOVE 'E' TO MIAME-ERRORINDR (058).                           00158000
001590     MOVE 'E' TO MIAME-ERRORINDR (059).                           00159000
001600     MOVE 'E' TO MIAME-ERRORINDR (061).                           00160000
001610 MR7105-GRP4.                                                     00161000
001620     IF MIM-7105DEMOGRP-4 IS EQUAL TO SPACES                      00162000
001630         GO TO MR7105-GRP5.                                       00163000
001640     IF MIM-7105DEMOGRP-3 IS EQUAL TO SPACES                      00164000
001650         GO TO MR7105-GRP4-ERR.                                   00165000
001660     IF MIM-7105KEYWORD-4 IS EQUAL TO SPACES                      00166000
001670         OR MIM-7105REL-4 IS EQUAL TO SPACES                      00167000
001680         OR MIM-7105CONJUNCTION-4 IS EQUAL TO SPACES              00168000
001690         GO TO MR7105-GRP4-ERR.                                   00169000
001700     IF MIM-7105CONJUNCTION-4 IS EQUAL TO 'END'                   00170000
001710         AND WS-END-FLAG IS EQUAL TO 'Y'                          00171000
001720         ADD +1 TO SLCOMM-ERRCNT                                  00172000
001730         MOVE 'E' TO MIAME-ERRORINDR (065)                        00173000
001740         GO TO MR7105-GRP5.                                       00174000
001750     IF MIM-7105CONJUNCTION-4 IS EQUAL TO 'END'                   00175000
001760         MOVE 'Y' TO WS-END-FLAG.                                 00176000
001770     GO TO MR7105-GRP5.                                           00177000
001780 MR7105-GRP4-ERR.                                                 00178000
001790     ADD +3 TO SLCOMM-ERRCNT.                                     00179000
001800     MOVE 'E' TO MIAME-ERRORINDR (062).                           00180000
001810     MOVE 'E' TO MIAME-ERRORINDR (063).                           00181000
001820     MOVE 'E' TO MIAME-ERRORINDR (065).                           00182000
001830 MR7105-GRP5.                                                     00183000
001840     IF MIM-7105DEMOGRP-5 IS EQUAL TO SPACES                      00184000
001850         GO TO MR7105-GRP6.                                       00185000
001860     IF MIM-7105DEMOGRP-4 IS EQUAL TO SPACES                      00186000
001870         GO TO MR7105-GRP5-ERR.                                   00187000
001880     IF MIM-7105KEYWORD-5 IS EQUAL TO SPACES                      00188000
001890         OR MIM-7105REL-5 IS EQUAL TO SPACES                      00189000
001900         OR MIM-7105CONJUNCTION-5 IS EQUAL TO SPACES              00190000
001910         GO TO MR7105-GRP5-ERR.                                   00191000
001920     IF MIM-7105CONJUNCTION-5 IS EQUAL TO 'END'                   00192000
001930         AND WS-END-FLAG IS EQUAL TO 'Y'                          00193000
001940         ADD +1 TO SLCOMM-ERRCNT                                  00194000
001950         MOVE 'E' TO MIAME-ERRORINDR (069)                        00195000
001960         GO TO MR7105-GRP6.                                       00196000
001970     IF MIM-7105CONJUNCTION-5 IS EQUAL TO 'END'                   00197000
001980         MOVE 'Y' TO WS-END-FLAG.                                 00198000
001990     GO TO MR7105-GRP6.                                           00199000
002000 MR7105-GRP5-ERR.                                                 00200000
002010     ADD +3 TO SLCOMM-ERRCNT.                                     00201000
002020     MOVE 'E' TO MIAME-ERRORINDR (066).                           00202000
002030     MOVE 'E' TO MIAME-ERRORINDR (067).                           00203000
002040     MOVE 'E' TO MIAME-ERRORINDR (069).                           00204000
002050 MR7105-GRP6.                                                     00205000
002060     IF MIM-7105DEMOGRP-6 IS EQUAL TO SPACES                      00206000
002070         GO TO MR7105-GRP7.                                       00207000
002080     IF MIM-7105DEMOGRP-5 IS EQUAL TO SPACES                      00208000
002090         GO TO MR7105-GRP6-ERR.                                   00209000
002100     IF MIM-7105KEYWORD-6 IS EQUAL TO SPACES                      00210000
002110         OR MIM-7105REL-6 IS EQUAL TO SPACES                      00211000
002120         OR MIM-7105CONJUNCTION-6 IS EQUAL TO SPACES              00212000
002130         GO TO MR7105-GRP6-ERR.                                   00213000
002140     IF MIM-7105CONJUNCTION-6 IS EQUAL TO 'END'                   00214000
002150         AND WS-END-FLAG IS EQUAL TO 'Y'                          00215000
002160         ADD +1 TO SLCOMM-ERRCNT                                  00216000
002170         MOVE 'E' TO MIAME-ERRORINDR (073)                        00217000
002180         GO TO MR7105-GRP7.                                       00218000
002190     IF MIM-7105CONJUNCTION-6 IS EQUAL TO 'END'                   00219000
002200         MOVE 'Y' TO WS-END-FLAG.                                 00220000
002210     GO TO MR7105-GRP7.                                           00221000
002220 MR7105-GRP6-ERR.                                                 00222000
002230     ADD +3 TO SLCOMM-ERRCNT.                                     00223000
002240     MOVE 'E' TO MIAME-ERRORINDR (070).                           00224000
002250     MOVE 'E' TO MIAME-ERRORINDR (071).                           00225000
002260     MOVE 'E' TO MIAME-ERRORINDR (073).                           00226000
002270 MR7105-GRP7.                                                     00227000
002280     IF MIM-7105DEMOGRP-7 IS EQUAL TO SPACES                      00228000
002290         GO TO MR7105-GRP8.                                       00229000
002300     IF MIM-7105DEMOGRP-6 IS EQUAL TO SPACES                      00230000
002310         GO TO MR7105-GRP7-ERR.                                   00231000
002320     IF MIM-7105KEYWORD-7 IS EQUAL TO SPACES                      00232000
002330         OR MIM-7105REL-7 IS EQUAL TO SPACES                      00233000
002340         OR MIM-7105CONJUNCTION-7 IS EQUAL TO SPACES              00234000
002350         GO TO MR7105-GRP7-ERR.                                   00235000
002360     IF MIM-7105CONJUNCTION-7 IS EQUAL TO 'END'                   00236000
002370         AND WS-END-FLAG IS EQUAL TO 'Y'                          00237000
002380         ADD +1 TO SLCOMM-ERRCNT                                  00238000
002390         MOVE 'E' TO MIAME-ERRORINDR (077)                        00239000
002400         GO TO MR7105-GRP8.                                       00240000
002410     IF MIM-7105CONJUNCTION-7 IS EQUAL TO 'END'                   00241000
002420         MOVE 'Y' TO WS-END-FLAG.                                 00242000
002430     GO TO MR7105-GRP8.                                           00243000
002440 MR7105-GRP7-ERR.                                                 00244000
002450     ADD +3 TO SLCOMM-ERRCNT.                                     00245000
002460     MOVE 'E' TO MIAME-ERRORINDR (074).                           00246000
002470     MOVE 'E' TO MIAME-ERRORINDR (075).                           00247000
002480     MOVE 'E' TO MIAME-ERRORINDR (077).                           00248000
002490 MR7105-GRP8.                                                     00249000
002500     IF MIM-7105DEMOGRP-8 IS EQUAL TO SPACES                      00250000
002510         GO TO MR7105-GRP9.                                       00251000
002520     IF MIM-7105DEMOGRP-7 IS EQUAL TO SPACES                      00252000
002530         GO TO MR7105-GRP8-ERR.                                   00253000
002540     IF MIM-7105KEYWORD-8 IS EQUAL TO SPACES                      00254000
002550         OR MIM-7105REL-8 IS EQUAL TO SPACES                      00255000
002560         OR MIM-7105CONJUNCTION-8 IS EQUAL TO SPACES              00256000
002570         GO TO MR7105-GRP8-ERR.                                   00257000
002580     IF MIM-7105CONJUNCTION-8 IS EQUAL TO 'END'                   00258000
002590         AND WS-END-FLAG IS EQUAL TO 'Y'                          00259000
002600         ADD +1 TO SLCOMM-ERRCNT                                  00260000
002610         MOVE 'E' TO MIAME-ERRORINDR (081)                        00261000
002620         GO TO MR7105-GRP9.                                       00262000
002630     IF MIM-7105CONJUNCTION-8 IS EQUAL TO 'END'                   00263000
002640         MOVE 'Y' TO WS-END-FLAG.                                 00264000
002650     GO TO MR7105-GRP9.                                           00265000
002660 MR7105-GRP8-ERR.                                                 00266000
002670     ADD +3 TO SLCOMM-ERRCNT.                                     00267000
002680     MOVE 'E' TO MIAME-ERRORINDR (078).                           00268000
002690     MOVE 'E' TO MIAME-ERRORINDR (079).                           00269000
002700     MOVE 'E' TO MIAME-ERRORINDR (081).                           00270000
002710 MR7105-GRP9.                                                     00271000
002720     IF MIM-7105DEMOGRP-9 IS EQUAL TO SPACES                      00272000
002730         GO TO MR7105-GRP10.                                      00273000
002740     IF MIM-7105DEMOGRP-8 IS EQUAL TO SPACES                      00274000
002750         GO TO MR7105-GRP9-ERR.                                   00275000
002760     IF MIM-7105KEYWORD-9 IS EQUAL TO SPACES                      00276000
002770         OR MIM-7105REL-9 IS EQUAL TO SPACES                      00277000
002780         OR MIM-7105CONJUNCTION-9 IS EQUAL TO SPACES              00278000
002790         GO TO MR7105-GRP9-ERR.                                   00279000
002800     IF MIM-7105CONJUNCTION-9 IS EQUAL TO 'END'                   00280000
002810         AND WS-END-FLAG IS EQUAL TO 'Y'                          00281000
002820         ADD +1 TO SLCOMM-ERRCNT                                  00282000
002830         MOVE 'E' TO MIAME-ERRORINDR (085)                        00283000
002840         GO TO MR7105-GRP10.                                      00284000
002850     IF MIM-7105CONJUNCTION-9 IS EQUAL TO 'END'                   00285000
002860         MOVE 'Y' TO WS-END-FLAG.                                 00286000
002870     GO TO MR7105-GRP10.                                          00287000
002880 MR7105-GRP9-ERR.                                                 00288000
002890     ADD +3 TO SLCOMM-ERRCNT.                                     00289000
002900     MOVE 'E' TO MIAME-ERRORINDR (082).                           00290000
002910     MOVE 'E' TO MIAME-ERRORINDR (083).                           00291000
002920     MOVE 'E' TO MIAME-ERRORINDR (085).                           00292000
002930 MR7105-GRP10.                                                    00293000
002940     IF MIM-7105DEMOGRP-10 IS EQUAL TO SPACES                     00294000
002950         GO TO MR7105-GRP11.                                      00295000
002960     IF MIM-7105DEMOGRP-9 IS EQUAL TO SPACES                      00296000
002970         GO TO MR7105-GRP10-ERR.                                  00297000
002980     IF MIM-7105KEYWORD-10 IS EQUAL TO SPACES                     00298000
002990         OR MIM-7105REL-10 IS EQUAL TO SPACES                     00299000
003000         OR MIM-7105CONJUNCTION-10 IS EQUAL TO SPACES             00300000
003010         GO TO MR7105-GRP10-ERR.                                  00301000
003020     IF MIM-7105CONJUNCTION-10 IS EQUAL TO 'END'                  00302000
003030         AND WS-END-FLAG IS EQUAL TO 'Y'                          00303000
003040         ADD +1 TO SLCOMM-ERRCNT                                  00304000
003050         MOVE 'E' TO MIAME-ERRORINDR (089)                        00305000
003060         GO TO MR7105-GRP11.                                      00306000
003070     IF MIM-7105CONJUNCTION-10 IS EQUAL TO 'END'                  00307000
003080         MOVE 'Y' TO WS-END-FLAG.                                 00308000
003090     GO TO MR7105-GRP11.                                          00309000
003100 MR7105-GRP10-ERR.                                                00310000
003110     ADD +3 TO SLCOMM-ERRCNT.                                     00311000
003120     MOVE 'E' TO MIAME-ERRORINDR (086).                           00312000
003130     MOVE 'E' TO MIAME-ERRORINDR (087).                           00313000
003140     MOVE 'E' TO MIAME-ERRORINDR (089).                           00314000
003150 MR7105-GRP11.                                                    00315000
003160     IF MIM-7105DEMOGRP-11 IS EQUAL TO SPACES                     00316000
003170         GO TO MR7105-GRP12.                                      00317000
003180     IF MIM-7105DEMOGRP-10 IS EQUAL TO SPACES                     00318000
003190         GO TO MR7105-GRP11-ERR.                                  00319000
003200     IF MIM-7105KEYWORD-11 IS EQUAL TO SPACES                     00320000
003210         OR MIM-7105REL-11 IS EQUAL TO SPACES                     00321000
003220         OR MIM-7105CONJUNCTION-11 IS EQUAL TO SPACES             00322000
003230         GO TO MR7105-GRP11-ERR.                                  00323000
003240     IF MIM-7105CONJUNCTION-11 IS EQUAL TO 'END'                  00324000
003250         AND WS-END-FLAG IS EQUAL TO 'Y'                          00325000
003260         ADD +1 TO SLCOMM-ERRCNT                                  00326000
003270         MOVE 'E' TO MIAME-ERRORINDR (093)                        00327000
003280         GO TO MR7105-GRP12.                                      00328000
003290     IF MIM-7105CONJUNCTION-11 IS EQUAL TO 'END'                  00329000
003300         MOVE 'Y' TO WS-END-FLAG.                                 00330000
003310     GO TO MR7105-GRP12.                                          00331000
003320 MR7105-GRP11-ERR.                                                00332000
003330     ADD +3 TO SLCOMM-ERRCNT.                                     00333000
003340     MOVE 'E' TO MIAME-ERRORINDR (090).                           00334000
003350     MOVE 'E' TO MIAME-ERRORINDR (091).                           00335000
003360     MOVE 'E' TO MIAME-ERRORINDR (093).                           00336000
003370 MR7105-GRP12.                                                    00337000
003380     IF MIM-7105DEMOGRP-12 IS EQUAL TO SPACES                     00338000
003390         GO TO MR7105-GRP13.                                      00339000
003400     IF MIM-7105DEMOGRP-11 IS EQUAL TO SPACES                     00340000
003410         GO TO MR7105-GRP12-ERR.                                  00341000
003420     IF MIM-7105KEYWORD-12 IS EQUAL TO SPACES                     00342000
003430         OR MIM-7105REL-12 IS EQUAL TO SPACES                     00343000
003440         OR MIM-7105CONJUNCTION-12 IS EQUAL TO SPACES             00344000
003450         GO TO MR7105-GRP12-ERR.                                  00345000
003460     IF MIM-7105CONJUNCTION-12 IS EQUAL TO 'END'                  00346000
003470         AND WS-END-FLAG IS EQUAL TO 'Y'                          00347000
003480         ADD +1 TO SLCOMM-ERRCNT                                  00348000
003490         MOVE 'E' TO MIAME-ERRORINDR (097)                        00349000
003500         GO TO MR7105-GRP13.                                      00350000
003510     IF MIM-7105CONJUNCTION-12 IS EQUAL TO 'END'                  00351000
003520         MOVE 'Y' TO WS-END-FLAG.                                 00352000
003530     GO TO MR7105-GRP13.                                          00353000
003540 MR7105-GRP12-ERR.                                                00354000
003550     ADD +3 TO SLCOMM-ERRCNT.                                     00355000
003560     MOVE 'E' TO MIAME-ERRORINDR (094).                           00356000
003570     MOVE 'E' TO MIAME-ERRORINDR (095).                           00357000
003580     MOVE 'E' TO MIAME-ERRORINDR (097).                           00358000
003590 MR7105-GRP13.                                                    00359000
003600     IF MIM-7105DEMOGRP-13 IS EQUAL TO SPACES                     00360000
003610         GO TO MR7105-GRP14.                                      00361000
003620     IF MIM-7105DEMOGRP-12 IS EQUAL TO SPACES                     00362000
003630         GO TO MR7105-GRP13-ERR.                                  00363000
003640     IF MIM-7105KEYWORD-13 IS EQUAL TO SPACES                     00364000
003650         OR MIM-7105REL-13 IS EQUAL TO SPACES                     00365000
003660         OR MIM-7105CONJUNCTION-13 IS EQUAL TO SPACES             00366000
003670         GO TO MR7105-GRP13-ERR.                                  00367000
003680     IF MIM-7105CONJUNCTION-13 IS EQUAL TO 'END'                  00368000
003690         AND WS-END-FLAG IS EQUAL TO 'Y'                          00369000
003700         ADD +1 TO SLCOMM-ERRCNT                                  00370000
003710         MOVE 'E' TO MIAME-ERRORINDR (101)                        00371000
003720         GO TO MR7105-GRP14.                                      00372000
003730     IF MIM-7105CONJUNCTION-13 IS EQUAL TO 'END'                  00373000
003740         MOVE 'Y' TO WS-END-FLAG.                                 00374000
003750     GO TO MR7105-GRP14.                                          00375000
003760 MR7105-GRP13-ERR.                                                00376000
003770     ADD +3 TO SLCOMM-ERRCNT.                                     00377000
003780     MOVE 'E' TO MIAME-ERRORINDR (098).                           00378000
003790     MOVE 'E' TO MIAME-ERRORINDR (099).                           00379000
003800     MOVE 'E' TO MIAME-ERRORINDR (101).                           00380000
003810 MR7105-GRP14.                                                    00381000
003820     IF MIM-7105DEMOGRP-14 IS EQUAL TO SPACES                     00382000
003830         GO TO MR7105-GRP15.                                      00383000
003840     IF MIM-7105DEMOGRP-13 IS EQUAL TO SPACES                     00384000
003850         GO TO MR7105-GRP14-ERR.                                  00385000
003860     IF MIM-7105KEYWORD-14 IS EQUAL TO SPACES                     00386000
003870         OR MIM-7105REL-14 IS EQUAL TO SPACES                     00387000
003880         OR MIM-7105CONJUNCTION-14 IS EQUAL TO SPACES             00388000
003890         GO TO MR7105-GRP14-ERR.                                  00389000
003900     IF MIM-7105CONJUNCTION-14 IS EQUAL TO 'END'                  00390000
003910         AND WS-END-FLAG IS EQUAL TO 'Y'                          00391000
003920         ADD +1 TO SLCOMM-ERRCNT                                  00392000
003930         MOVE 'E' TO MIAME-ERRORINDR (105)                        00393000
003940         GO TO MR7105-GRP15.                                      00394000
003950     IF MIM-7105CONJUNCTION-14 IS EQUAL TO 'END'                  00395000
003960         MOVE 'Y' TO WS-END-FLAG.                                 00396000
003970     GO TO MR7105-GRP15.                                          00397000
003980 MR7105-GRP14-ERR.                                                00398000
003990     ADD +3 TO SLCOMM-ERRCNT.                                     00399000
004000     MOVE 'E' TO MIAME-ERRORINDR (102).                           00400000
004010     MOVE 'E' TO MIAME-ERRORINDR (103).                           00401000
004020     MOVE 'E' TO MIAME-ERRORINDR (105).                           00402000
004030 MR7105-GRP15.                                                    00403000
004040     IF MIM-7105DEMOGRP-15 IS EQUAL TO SPACES                     00404000
004050         GO TO MR7105-END.                                        00405000
004060     IF MIM-7105DEMOGRP-14 IS EQUAL TO SPACES                     00406000
004070         GO TO MR7105-GRP15-ERR.                                  00407000
004080     IF MIM-7105KEYWORD-15 IS EQUAL TO SPACES                     00408000
004090         OR MIM-7105REL-15 IS EQUAL TO SPACES                     00409000
004100         OR MIM-7105CONJUNCTION-15 IS EQUAL TO SPACES             00410000
004110         GO TO MR7105-GRP15-ERR.                                  00411000
004120     IF MIM-7105CONJUNCTION-15 IS EQUAL TO 'END'                  00412000
004130         AND WS-END-FLAG IS EQUAL TO 'Y'                          00413000
004140         ADD +1 TO SLCOMM-ERRCNT                                  00414000
004150         MOVE 'E' TO MIAME-ERRORINDR (109)                        00415000
004160         GO TO MR7105-END.                                        00416000
004170     IF MIM-7105CONJUNCTION-15 IS EQUAL TO 'END'                  00417000
004180         MOVE 'Y' TO WS-END-FLAG.                                 00418000
004190     GO TO MR7105-END.                                            00419000
004200 MR7105-GRP15-ERR.                                                00420000
004210     ADD +3 TO SLCOMM-ERRCNT.                                     00421000
004220     MOVE 'E' TO MIAME-ERRORINDR (106).                           00422000
004230     MOVE 'E' TO MIAME-ERRORINDR (107).                           00423000
004240     MOVE 'E' TO MIAME-ERRORINDR (109).                           00424000
004250 MR7105-END.                                                      00425000
004260     IF WS-END-FLAG IS EQUAL TO 'Y'                               00426000
004270         GO TO MR7105-EXIT.                                       00427000
004280     MOVE +0015 TO WS-SUB1.                                       00428000
004290 MR7105-END-LOOP.                                                 00429000
004300     IF WS-SUB1 IS LESS THAN +0001                                00430000
004310         GO TO MR7105-EXIT.                                       00431000
004320     IF MIM-7105KEYWORD (WS-SUB1) IS EQUAL TO SPACES              00432000
004330         SUBTRACT +0001 FROM WS-SUB1                              00433000
004340         GO TO MR7105-END-LOOP.                                   00434000
004350     MULTIPLY 4 BY WS-SUB1.                                       00435000
004360     ADD +49 TO WS-SUB1.                                          00436000
004370     ADD +1 TO SLCOMM-ERRCNT.                                     00437000
004380     MOVE 'E' TO MIAME-ERRORINDR (WS-SUB1).                       00438000
004390 MR7105-EXIT.                                                     00439000
004400     EXIT.                                                        00440000
004410******************************************************************00441000
004420 RETURN-ROUTINE SECTION.                                          00442000
004430 RR-START.                                                        00443000
004440     GOBACK.                                                      00444000
004450 RR-EXIT.                                                         00445000
004460     EXIT.                                                        00446000
004470******************************************************************00447000
