000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL120.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL120 - RELATIONSHIP PROFILE                               *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  RPW014-AREAS.                                                00016000
000000 COPY RPW014.                                                     00017000
000180 01  RPW033-AREAS.                                                00018000
000000 COPY RPW033.                                                     00019000
000200 01  RPW130-AREAS.                                                00020000
000000 COPY RPW130.                                                     00021000
000220*01  BICRSRB.                                                     00022000
000000 COPY BICRSRB.                                                    00023000
000240*01  BICRPSB.                                                     00024000
000000 COPY BICRPSB.                                                    00025000
000260*01  BICRVERB.                                                    00026000
000000 COPY BICRVERB.                                                   00027000
000280*01  BICRSTAT.                                                    00028000
000000 COPY BICRSTAT.                                                   00029000
000300*01  BICRCONS.                                                    00030000
000000 COPY BICRCONS.                                                   00031000
000320*01  BICRDBS.                                                     00032000
000000 COPY BICRDBS.                                                    00033000
000340*01  BICRPAN.                                                     00034000
000000 COPY BICRPAN.                                                    00035000
000360 01  SRW710-AREAS.                                                00036000
000000 COPY SRW710.                                                     00037000
000380 01  RPV120K-PANL-DATA-BLOCK.                                     00038000
000000 COPY RPV120KW.                                                   00039000
000400 01  RPV120-PANL-DATA-BLOCK.                                      00040000
000000 COPY RPV120W.                                                    00041000
000420 01  WS-WORKAREAS.                                                00042000
000430     03  ws-test-acct2-grp.                                       00043000
000440         05  ws-test-inst2       pic 9(04).                       00044000
000450         05  ws-test-prodcode2   pic x(06).                       00045000
000460         05  ws-test-acct2       pic x(18).                       00046000
000470         05  ws-test-model2      pic x(10).                       00047000
000480     03  WS-NEXTKEY.                                              00048000
000490         05  WS-EXTID            PIC X(08).                       00049000
000500         05  WS-DELIM1           PIC X(01)       VALUE ','.       00050000
000510         05  WS-DATA.                                             00051000
000520             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00052000
000530             07  WS-DELIM2       PIC X(01)       VALUE ','.       00053000
000540             07  WS-ACCTX.                                        00054000
000550                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00055000
000560         05  FILLER              PIC X(53)       VALUE SPACES.    00056000
000570     03  WS-MORE                 PIC X(05)       VALUE 'More:'.   00057000
000580     03  WS-LNKPROG              PIC X(08)       VALUE 'RPLSEC00'.00058000
000590     03  WS-LKLGTH               PIC S9(04)      COMP             00059000
000600                                                 VALUE +4088.     00060000
000610     03  WS-PDATE                PIC 9(08).                       00061000
000620     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00062000
000630         05  WS-PDATE-YYYY       PIC 9(04).                       00063000
000640         05  WS-PDATE-MM         PIC 9(02).                       00064000
000650         05  WS-PDATE-DD         PIC 9(02).                       00065000
000660 01  WS-LINKMSG                  PIC X(4500).                     00066000
000670 01  RPSEC00-MESSAGE.                                             00067000
000000 COPY MISCNT00      REPLACING                                     00068000
000690             ==:MICNT:== BY ==RPSEC00==.                          00069000
000000 COPY RPSSEC00.                                                   00070000
000710 01  WS-TSQAREAS.                                                 00071000
000720     03  WS-TSQITEM              PIC S9(04)      COMP             00072000
000730                                                 VALUE +0001.     00073000
000740     03  WS-TSQLGTH              PIC S9(04)      COMP             00074000
000750                                                 VALUE +4096.     00075000
000760     03  WS-TSQKEY.                                               00076000
000770         05  WS-TSQID            PIC X(04).                       00077000
000780         05  WS-TSQTRMID         PIC X(04).                       00078000
000790 01  LS-TSQAREA.                                                  00079000
000800     03  LS-TSQKEY               PIC X(08).                       00080000
000810     03  LS-TSQDATA              PIC X(4088).                     00081000
000820 01  MIWPRI-AREAS.                                                00082000
000000 COPY MIWPRI.                                                     00083000
000840 01  MIWMSTA-AREAS.                                               00084000
000000 COPY MIWMSTA.                                                    00085000
000860 01  MIMST-RECORD.                                                00086000
000000 COPY MISMST.                                                     00087000
000880 01  MI2023-RECORD.                                               00088000
000000 COPY MIS2023A.                                                   00089000
000900 01  WS-ABORTCODES.                                               00090000
000910     03  WS-AB0009               PIC S9(04)      COMP             00091000
000920                                                 VALUE +0009.     00092000
000930     03  WS-AB0106               PIC S9(04)      COMP             00093000
000940                                                 VALUE +0106.     00094000
000950     03  WS-AB2033               PIC S9(04)      COMP             00095000
000960                                                 VALUE +2033.     00096000
000970     03  WS-AB6345               PIC S9(04)      COMP             00097000
000980                                                 VALUE +6345.     00098000
000990 01  WS-TRACECODES.                                               00099000
001000     03  WS-TR0001               PIC S9(04)      COMP             00100000
001010                                                 VALUE +0001.     00101000
001020     03  WS-TR0002               PIC S9(04)      COMP             00102000
001030                                                 VALUE +0002.     00103000
001040     03  WS-TR0003               PIC S9(04)      COMP             00104000
001050                                                 VALUE +0003.     00105000
001060 01  SLW096-AREAS.                                                00106000
000000 COPY SLW096.                                                     00107000
001080 01  SRW000-AREAS.                                                00108000
000000 COPY SRW000.                                                     00109000
001100 01  SRW025-AREAS.                                                00110000
000000 COPY SRW025.                                                     00111000
001120 01  SRW030-AREAS.                                                00112000
000000 COPY SRW030.                                                     00113000
001140 01  SRW031-AREAS.                                                00114000
000000 COPY SRW031.                                                     00115000
001160 01  SRW105-AREAS.                                                00116000
000000 COPY SRW105.                                                     00117000
001180 01  SRW170-AREAS.                                                00118000
000000 COPY SRW170.                                                     00119000
001200 01  SRW161-AREAS.                                                00120000
000000 COPY SRW161.                                                     00121000
001220 COPY DFHAID.                                                     00122000
001230******************************************************************00123000
001240 LINKAGE SECTION.                                                 00124000
001250 01  DFHCOMMAREA.                                                 00125000
000000 COPY SLS1112.                                                    00126000
001270     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00127000
001280         05  COM-PROGRAM-ID      PIC X(06).                       00128000
001290         05  COM-EDIT-DATE       PIC X(10).                       00129000
001300         05  COM-KEY-INFO.                                        00130000
001310             07  COM-KEY-OCCUR   PIC S9(04)      COMP-3.          00131000
001320         05  COM-PANEL-ACTION    PIC X(01).                       00132000
001330             88  INITIAL-PANEL                   VALUE ' '.       00133000
001340             88  EDIT-PANEL                      VALUE 'E'.       00134000
001350         05  COM-FROM-PANEL      PIC X(01).                       00135000
001360             88  FROM-KEY-PANEL                  VALUE 'K'.       00136000
001370             88  FROM-INFO-PANEL                 VALUE 'I'.       00137000
001380             88  FROM-HELP                       VALUE 'H'.       00138000
001390             88  FROM-BREAKAWAY                  VALUE 'B'.       00139000
001400         05  COM-KEY-FIELDS.                                      00140000
001410             07  COM-KEY-PRODCODE                                 00141000
001420                                 PIC X(06).                       00142000
001430             07  COM-KEY-ACCOUNT PIC X(18).                       00143000
001440             07  COM-KEY-ACCOUNT-N                                00144000
001450                         REDEFINES COM-KEY-ACCOUNT                00145000
001460                                 PIC 9(18).                       00146000
001470             07  COM-KEY-MODEL   PIC X(10).                       00147000
001480         05  COM-KEY-MSGNBR      PIC X(06).                       00148000
001490         05  COM-KEY-COMMAND     PIC X(50).                       00149000
001500         05  COM-KEY-FORMATTEDACCT                                00150000
001510                                 PIC X(22).                       00151000
001520         05  COM-RPSEC00-CURPAGE PIC S9(04)      COMP-3.          00152000
001530         05  COM-RPSEC00-OCCUR   PIC S9(04)      COMP-3.          00153000
001540         05  COM-CUST-TYPE       PIC X(01).                       00154000
001550         05  COM-CUST-NAME       PIC X(40).                       00155000
001560         05  COM-FIRST-KEY       PIC X(38).                       00156000
001570         05  COM-LAST-KEY        PIC X(38).                       00157000
001580         05  COM-MORE            PIC X(01).                       00158000
001590******************************************************************00159000
001600*01  SLW096-2023RECORDS.                                          00160000
000000 COPY SLW096L.                                                    00161000
001620******************************************************************00162000
001630 PROCEDURE DIVISION.                                              00163000
001640******************************************************************00164000
001650 ENTRY-ROUTINE SECTION.                                           00165000
001660     MOVE 'RPL120' TO COM-ABPROGID.                               00166000
000000 COPY SLP771.                                                     00167000
001680******************************************************************00168000
001690 TRANSACTION-CLEAN-UP SECTION.                                    00169000
001700 TCU-START.                                                       00170000
001710 TCU-EXIT.                                                        00171000
001720     EXIT.                                                        00172000
001730******************************************************************00173000
001740 CICS-HANDLE-CONDITION SECTION.                                   00174000
000000 COPY SLP772.                                                     00175000
001760     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00176000
001770         GO TO CTSRI-EXIT.                                        00177000
001780     MOVE WS-AB2033 TO COM-ABORT.                                 00178000
001790     MOVE WS-TR0001 TO COM-ABTRACE.                               00179000
001800     GO TO ABORT-EXIT.                                            00180000
001810 CHC-EXIT.                                                        00181000
001820     EXIT.                                                        00182000
001830******************************************************************00183000
001840 ROUTING-ROUTINE SECTION.                                         00184000
001850 RR-START.                                                        00185000
001860     MOVE LOW-VALUES TO RPSEC00-MESSAGE.                          00186000
001870     MOVE LOW-VALUES TO RPV120-PANL-DATA-AREA.                    00187000
001880     MOVE LOW-VALUES TO RPV120K-PANL-DATA-AREA.                   00188000
001890     MOVE ALL ZEROS TO WS-MSGNBR.                                 00189000
001900     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00190000
001910     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00191000
001920     IF COM-RETURN IS EQUAL TO 'B'                                00192000
001930         OR COM-BKPGRMID IS EQUAL TO SPACE                        00193000
001940         MOVE 'RP00' TO WS-TSQFILEID                              00194000
001950     ELSE                                                         00195000
001960         MOVE 'RP01' TO WS-TSQFILEID.                             00196000
001970     MOVE 'RPI' TO WS-TSQSYSID.                                   00197000
001980     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00198000
001990         MOVE COM-PAN TO BICRPAN                                  00199000
002000         MOVE COM-PSB TO BICRPSB                                  00200000
002010         MOVE COM-SRB TO BICRSRB                                  00201000
002020     ELSE                                                         00202000
002030         MOVE '1' TO BPSB-LEVEL.                                  00203000
002040     IF COM-RETURN IS EQUAL TO 'B'                                00204000
002050         GO TO BREAKAWAY-RETURN.                                  00205000
002060     IF COM-RETURN IS EQUAL TO '0'                                00206000
002070         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00207000
002080         MOVE SPACES TO COM-WORKAREAS                             00208000
002090         MOVE '1' TO SRB-VERSION                                  00209000
002100         MOVE 'IPRP' TO SRB-APPL-ID                               00210000
002110         MOVE 'RPL120' TO SRB-PROG-ID                             00211000
002120         MOVE 'RPL120' TO COM-PROGRAM-ID                          00212000
002130         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00213000
002140         MOVE 'P' TO PAN-TYPE                                     00214000
002150         MOVE SPACE TO PAN-OVERLAY                                00215000
002160         MOVE SPACE TO PAN-CLOSE                                  00216000
002170         MOVE SPACE TO PAN-ALARM                                  00217000
002180         MOVE SPACE TO PAN-CURSOR-PAN                             00218000
002190         MOVE SPACE TO PAN-CURSOR-FLD                             00219000
002200         MOVE SPACE TO PAN-SET-FLD                                00220000
002210         MOVE SPACE TO PAN-SET-VID                                00221000
002220         MOVE SPACE TO PAN-SET-EMP                                00222000
002230         MOVE +0 TO COM-RPSEC00-CURPAGE                           00223000
002240         MOVE +0 TO COM-RPSEC00-OCCUR                             00224000
002250         MOVE PDB-RPV120K-NAME TO PAN-NAME                        00225000
002260         PERFORM PANEL-INIT                                       00226000
002270         MOVE BICRPAN TO COM-PAN                                  00227000
002280         MOVE BICRPSB TO COM-PSB                                  00228000
002290         MOVE BICRSRB TO COM-SRB                                  00229000
002300         PERFORM INITIALIZE-DATE                                  00230000
002310         GO TO PANEL-ROUTER.                                      00231000
002320     PERFORM PANEL-NAME-SET.                                      00232000
002330     IF COM-HELPSW IS EQUAL TO 'Y'                                00233000
002340         GO TO HELP-RETURN.                                       00234000
002350     PERFORM PANEL-RECEIVE.                                       00235000
002360     PERFORM PANEL-DATA-GET.                                      00236000
002370     PERFORM PANEL-PFKEY-SET.                                     00237000
002380     PERFORM VALIDATE-PFKEYS.                                     00238000
002390     IF EIBAID IS EQUAL TO DFHPF1                                 00239000
002400         GO TO GET-HELP.                                          00240000
002410     IF EIBAID IS EQUAL TO DFHPF11                                00241000
002420         GO TO BREAK-AWAY.                                        00242000
002430     IF (COM-RETURN IS EQUAL TO 'E'                               00243000
002440         OR COM-RETURN IS EQUAL TO '1')                           00244000
002450         AND (EIBAID IS EQUAL TO DFHPF2                           00245000
002460         OR EIBAID IS EQUAL TO DFHPF3                             00246000
002470         OR EIBAID IS EQUAL TO DFHPF4                             00247000
002480         OR EIBAID IS EQUAL TO DFHPF7                             00248000
002490         OR EIBAID IS EQUAL TO DFHPF8                             00249000
002500         OR EIBAID IS EQUAL TO DFHPF12)                           00250000
002510         GO TO CLOSE-TRANSACTION.                                 00251000
002520     IF COM-RETURN IS EQUAL TO '0'                                00252000
002530         OR COM-RETURN IS EQUAL TO 'E'                            00253000
002540         OR COM-RETURN IS EQUAL TO '1'                            00254000
002550         GO TO PANEL-ROUTER.                                      00255000
002560 RR-END.                                                          00256000
002570     GO TO CLOSE-TRANSACTION.                                     00257000
002580 RR-EXIT.                                                         00258000
002590     EXIT.                                                        00259000
002600******************************************************************00260000
002610 INITIALIZE-DATE SECTION.                                         00261000
002620 ID-START.                                                        00262000
002630     MOVE COM-DATE TO WS-CURDATE8.                                00263000
002640     MOVE '-' TO WS-CD8DSH1.                                      00264000
002650     MOVE '-' TO WS-CD8DSH2.                                      00265000
002660     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00266000
002670 ID-EXIT.                                                         00267000
002680     EXIT.                                                        00268000
002690******************************************************************00269000
002700 PANEL-NAME-SET SECTION.                                          00270000
002710 PNS-START.                                                       00271000
002720     IF COM-RETURN IS EQUAL TO '0'                                00272000
002730         MOVE PDB-RPV120K-NAME TO PAN-NAME.                       00273000
002740     IF COM-RETURN IS EQUAL TO 'E'                                00274000
002750         MOVE PDB-RPV120K-NAME TO PAN-NAME.                       00275000
002760     IF COM-RETURN IS EQUAL TO '1'                                00276000
002770         MOVE PDB-RPV120-NAME TO PAN-NAME.                        00277000
002780 PNS-EXIT.                                                        00278000
002790     EXIT.                                                        00279000
002800******************************************************************00280000
002810 PANEL-DATA-GET SECTION.                                          00281000
002820 PDG-START.                                                       00282000
002830     IF COM-RETURN IS EQUAL TO '0'                                00283000
002840         PERFORM PANEL-GET-RPV120K.                               00284000
002850     IF COM-RETURN IS EQUAL TO 'E'                                00285000
002860         PERFORM PANEL-GET-RPV120K                                00286000
002870         MOVE RPV120K-COMMAND TO WS-NEXTKEY                       00287000
002880         MOVE PDB-RPV120K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00288000
002890     IF COM-RETURN IS EQUAL TO '1'                                00289000
002900         PERFORM PANEL-GET-RPV120                                 00290000
002910         MOVE RPV120-COMMAND TO WS-NEXTKEY                        00291000
002920         MOVE PDB-RPV120-COMMAND-DCHG TO WS-COMMAND-DCHG.         00292000
002930 PDG-EXIT.                                                        00293000
002940     EXIT.                                                        00294000
002950******************************************************************00295000
002960 PANEL-PFKEY-SET SECTION.                                         00296000
002970 PPS-START.                                                       00297000
002980 PPS-EXIT.                                                        00298000
002990     EXIT.                                                        00299000
003000******************************************************************00300000
003010 PANEL-ROUTER SECTION.                                            00301000
003020 PR-START.                                                        00302000
003030     IF COM-RETURN IS EQUAL TO '0'                                00303000
003040         GO TO PROCESS-KEY-PANEL.                                 00304000
003050     IF COM-RETURN IS EQUAL TO 'E'                                00305000
003060         GO TO PROCESS-KEY-PANEL.                                 00306000
003070     IF COM-RETURN IS EQUAL TO '1'                                00307000
003080         GO TO PROCESS-INFO-PANEL.                                00308000
003090     GO TO CLOSE-TRANSACTION.                                     00309000
003100 PR-EXIT.                                                         00310000
003110     EXIT.                                                        00311000
003120******************************************************************00312000
003130 HELP-RETURN SECTION.                                             00313000
000000 COPY SRP074.                                                     00314000
003150******************************************************************00315000
003160 HELP-RETURN-FINISH SECTION.                                      00316000
003170 HRF-START.                                                       00317000
003180     PERFORM PANEL-DATA-GET.                                      00318000
003190     MOVE 'H' TO COM-FROM-PANEL.                                  00319000
003200     GO TO PANEL-ROUTER.                                          00320000
003210 HRF-EXIT.                                                        00321000
003220     EXIT.                                                        00322000
003230******************************************************************00323000
003240 HELP-MISSING-FINISH SECTION.                                     00324000
003250 HMF-START.                                                       00325000
003260     MOVE 'H' TO COM-FROM-PANEL.                                  00326000
003270     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00327000
003280     GO TO PANEL-ROUTER.                                          00328000
003290 HMF-EXIT.                                                        00329000
003300     EXIT.                                                        00330000
003310******************************************************************00331000
003320 BREAK-AWAY SECTION.                                              00332000
000000 COPY SRP0752.                                                    00333000
003340******************************************************************00334000
003350 BREAKAWAY-RETURN-FINISH SECTION.                                 00335000
003360 BRF-START.                                                       00336000
003370     PERFORM PANEL-DATA-GET.                                      00337000
003380     MOVE 'B' TO COM-FROM-PANEL.                                  00338000
003390     GO TO PANEL-ROUTER.                                          00339000
003400 BRF-EXIT.                                                        00340000
003410     EXIT.                                                        00341000
003420******************************************************************00342000
003430 PROCESS-KEY-PANEL SECTION.                                       00343000
003440 PKP-START.                                                       00344000
003450     IF INITIAL-PANEL                                             00345000
003460         MOVE COM-NEXTKEY TO COM-EXTERNALID                       00346000
003470         GO TO PKP-COM-INIT.                                      00347000
003480     IF EDIT-PANEL                                                00348000
003490         AND FROM-INFO-PANEL                                      00349000
003500         MOVE SPACE TO COM-FROM-PANEL                             00350000
003510         GO TO PKP-RELOAD-PANEL.                                  00351000
003520 PKP-COM-INIT.                                                    00352000
003530     MOVE COM-NEXTKEY TO SR-PSLIST.                               00353000
003540     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00354000
003550         GO TO PKP-SEND-PANEL.                                    00355000
003560 PKP-BEGIN-EDITS.                                                 00356000
003570     MOVE RPV120K-PRODCD TO RPW014-PRODCODE.                      00357000
003580     MOVE RPV120K-ACCOUNT TO RPW014-ACCT.                         00358000
003590     PERFORM EDIT-ACCOUNT-KEY.                                    00359000
003600     IF EDIT-PANEL                                                00360000
003610         GO TO PKP-RETURN-EDITS.                                  00361000
003620 PKP-RETURN-EDITS.                                                00362000
003630     MOVE RPW014-PRODCODE TO COM-PRODCODE.                        00363000
003640     MOVE RPW014-APPLNBR TO COM-APPL.                             00364000
003650     MOVE RPW014-DIALOGROUT TO COM-DIALOGROUT.                    00365000
003660     MOVE RPW014-PRODCODE TO COM-KEY-PRODCODE.                    00366000
003670     MOVE RPW014-ACCT TO COM-KEY-ACCOUNT.                         00367000
003680     MOVE RPW014-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          00368000
003690     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00369000
003700         MOVE LOW-VALUES TO COM-KEY-MODEL.                        00370000
003710     IF INITIAL-PANEL                                             00371000
003720         AND RPW014-PRODCODE IS EQUAL TO LOW-VALUES               00372000
003730         AND RPW014-ACCT IS EQUAL TO LOW-VALUES                   00373000
003740         MOVE '000001' TO WS-MSGNBR                               00374000
003750         GO TO PKP-SEND-PANEL.                                    00375000
003760     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00376000
003770     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00377000
003780     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00378000
003790         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00379000
003800     ELSE                                                         00380000
003810         MOVE ZERO TO COM-ACCOUNT.                                00381000
003820     IF FROM-BREAKAWAY                                            00382000
003830         OR FROM-HELP                                             00383000
003840         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00384000
003850         GO TO PKP-RELOAD-PANEL.                                  00385000
003860 PKP-EDITS-READY.                                                 00386000
003870     MOVE SPACE TO COM-PANEL-ACTION.                              00387000
003880     MOVE '1' TO COM-RETURN.                                      00388000
003890     MOVE 'K' TO COM-FROM-PANEL.                                  00389000
003900     GO TO PANEL-ROUTER.                                          00390000
003910 PKP-RELOAD-PANEL.                                                00391000
003920     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00392000
003930         MOVE LOW-VALUES TO RPV120K-PRODCD                        00393000
003940     ELSE                                                         00394000
003950         MOVE COM-KEY-PRODCODE TO RPV120K-PRODCD.                 00395000
003960     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00396000
003970         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROES                    00397000
003980         MOVE LOW-VALUES TO RPV120K-ACCOUNT                       00398000
003990     ELSE                                                         00399000
004000         MOVE COM-KEY-ACCOUNT TO RPV120K-ACCOUNT.                 00400000
004010 PKP-SEND-PANEL.                                                  00401000
004020     MOVE PDB-RPV120K-NAME TO PAN-NAME.                           00402000
004030     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00403000
004040     IF FROM-BREAKAWAY                                            00404000
004050         OR FROM-HELP                                             00405000
004060         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00406000
004070     ELSE                                                         00407000
004080         MOVE PDB-RPV120K-PRODCD TO PAN-SET-FLD.                  00408000
004090     PERFORM CALL-BISPAN-RPV120K.                                 00409000
004100     MOVE COM-OPERID TO RPV120K-OPERID.                           00410000
004110     MOVE COM-INST TO RPV120K-INST.                               00411000
004120     MOVE COM-EDIT-DATE TO RPV120K-SYSDATE.                       00412000
004130     IF RPV120K-PRODCD IS EQUAL TO SPACES                         00413000
004140         MOVE LOW-VALUES TO RPV120K-PRODCD.                       00414000
004150     MOVE RPV120K-ACCOUNT TO SR-JUSTIFYIN.                        00415000
004160     MOVE +18 TO SR-JLGTH.                                        00416000
004170     PERFORM LEFT-JUSTIFY.                                        00417000
004180     MOVE SR-JUSTIFYOUT TO RPV120K-ACCOUNT.                       00418000
004190     IF RPV120K-ACCOUNT IS EQUAL TO SPACES                        00419000
004200         MOVE LOW-VALUES TO RPV120K-ACCOUNT.                      00420000
004210     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00421000
004220         MOVE WS-HELPMSG TO WS-MSGNBR.                            00422000
004230     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00423000
004240         MOVE '000027' TO WS-MSGNBR                               00424000
004250     ELSE                                                         00425000
004260         PERFORM BUILD-NEXTKEY                                    00426000
004270         PERFORM COMPRESS-NEXTKEY                                 00427000
004280         MOVE WS-NEXTKEY TO RPV120K-COMMAND.                      00428000
004290     IF FROM-BREAKAWAY                                            00429000
004300         OR FROM-HELP                                             00430000
004310         MOVE SPACE TO COM-FROM-PANEL                             00431000
004320         MOVE COM-KEY-COMMAND TO RPV120K-COMMAND                  00432000
004330         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00433000
004340     ELSE                                                         00434000
004350         MOVE WS-NEXTKEY TO COM-KEY-COMMAND                       00435000
004360         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00436000
004370     MOVE 'E' TO COM-RETURN.                                      00437000
004380     PERFORM GET-MESSAGE.                                         00438000
004390     MOVE WS-MESSAGE TO RPV120K-MSGLINE.                          00439000
004400     PERFORM PANEL-PFKEY-SET.                                     00440000
004410     PERFORM BUILD-PFKEY-LINE.                                    00441000
004420     MOVE WS-PFLINE1 TO RPV120K-PFLINE1.                          00442000
004430     MOVE WS-PFLINE2 TO RPV120K-PFLINE2.                          00443000
004440     PERFORM PANEL-PUT-RPV120K.                                   00444000
004450     PERFORM PANEL-SEND.                                          00445000
004460     MOVE 'E' TO COM-PANEL-ACTION.                                00446000
004470     MOVE COM-INTID TO WS-TRANSID.                                00447000
004480     GO TO CICS-RETURN-TRANSID.                                   00448000
004490 PKP-EXIT.                                                        00449000
004500     EXIT.                                                        00450000
004510******************************************************************00451000
004520 PROCESS-INFO-PANEL SECTION.                                      00452000
004530 PIP-START.                                                       00453000
004540     IF FROM-HELP                                                 00454000
004550         OR FROM-BREAKAWAY                                        00455000
004560         GO TO PIP-SEND-PANEL.                                    00456000
004570     IF INITIAL-PANEL                                             00457000
004580         MOVE +1 TO RPSEC00-PAGES-TO-READ                         00458000
004590         MOVE +1 TO COM-RPSEC00-CURPAGE                           00459000
004600         MOVE SPACES TO COM-FIRST-KEY                             00460000
004610         MOVE COM-RPSEC00-CURPAGE TO RPSEC00-CURPAGE              00461000
004620         GO TO PIP-CONTINUE.                                      00462000
004630 PIP-PFKEYS.                                                      00463000
004640     MOVE ALL ZEROS TO WS-MSGNBR.                                 00464000
004650     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00465000
004660         GO TO PIP-SEND-PANEL.                                    00466000
004670     IF EIBAID IS EQUAL TO DFHPF2                                 00467000
004680         AND COM-RPSEC00-CURPAGE IS GREATER THAN +1               00468000
004690         MOVE +1 TO COM-RPSEC00-CURPAGE                           00469000
004700         MOVE COM-RPSEC00-CURPAGE TO RPSEC00-CURPAGE              00470000
004710         MOVE +1 TO RPSEC00-PAGES-TO-READ                         00471000
004720         MOVE SPACES TO COM-FIRST-KEY                             00472000
004730         MOVE SPACES TO RPSEC00-KEY-ACCT2-GRP                     00473000
004740         GO TO PIP-CONTINUE.                                      00474000
004750     IF EIBAID IS EQUAL TO DFHPF7                                 00475000
004760         AND COM-RPSEC00-CURPAGE IS GREATER THAN +1               00476000
004770         SUBTRACT +1 FROM COM-RPSEC00-CURPAGE                     00477000
004780         MOVE COM-RPSEC00-CURPAGE TO RPSEC00-CURPAGE              00478000
004790         MOVE RPSEC00-CURPAGE TO RPSEC00-PAGES-TO-READ            00479000
004800         MOVE COM-FIRST-KEY TO RPSEC00-KEY-ACCT2-GRP              00480000
004810         GO TO PIP-CONTINUE.                                      00481000
004820     IF EIBAID IS EQUAL TO DFHPF8                                 00482000
004830         AND COM-KEY-OCCUR IS LESS THAN +02                       00483000
004840         MOVE '000046' TO WS-MSGNBR                               00484000
004850         GO TO PIP-SEND-PANEL.                                    00485000
004860     IF EIBAID IS EQUAL TO DFHENTER                               00486000
004870         AND COM-KEY-OCCUR IS LESS THAN +02                       00487000
004880         AND NOT FROM-BREAKAWAY                                   00488000
004890         MOVE 'X' TO COM-RETURN                                   00489000
004900         GO TO PANEL-ROUTER.                                      00490000
004910     IF EIBAID IS EQUAL TO DFHPF8                                 00491000
004920         OR EIBAID IS EQUAL TO DFHENTER                           00492000
004930         ADD +1 TO COM-RPSEC00-CURPAGE                            00493000
004940         MOVE COM-RPSEC00-CURPAGE TO RPSEC00-CURPAGE              00494000
004950         MOVE +1 TO RPSEC00-PAGES-TO-READ                         00495000
004960         MOVE COM-LAST-KEY TO RPSEC00-KEY-ACCT2-GRP               00496000
004970         MOVE COM-LAST-KEY TO ws-test-acct2-grp                   00497000
004980         GO TO PIP-CONTINUE.                                      00498000
004990 PIP-CONTINUE.                                                    00499000
005000     MOVE +0 TO RPSEC00-SUB.                                      00500000
005010 PIP-RPSEC00-LOOP.                                                00501000
005020     ADD +1 TO RPSEC00-SUB.                                       00502000
005030     IF RPSEC00-SUB IS GREATER THAN RPSEC00-PAGES-TO-READ         00503000
005040         GO TO PIP-RPSEC00-RETURN-CHECK.                          00504000
005050     PERFORM RPSEC00-LINK-MESSAGE.                                00505000
005060     GO TO PIP-RPSEC00-LOOP.                                      00506000
005070 PIP-RPSEC00-RETURN-CHECK.                                        00507000
005080     IF RPSEC00-SELECT-RTN IS NOT EQUAL TO '1'                    00508000
005090         AND RPSEC00-SELECT-RTN IS NOT EQUAL TO '2'               00509000
005100         AND RPSEC00-SELECT-RTN IS NOT EQUAL TO '3'               00510000
005110         MOVE WS-AB6345 TO COM-ABORT                              00511000
005120         MOVE WS-TR0002 TO COM-ABTRACE                            00512000
005130         GO TO ABORT-EXIT.                                        00513000
005140     IF RPSEC00-SELECT-RTN IS EQUAL TO '3'                        00514000
005150         MOVE 'Y' TO COM-MORE                                     00515000
005160     ELSE                                                         00516000
005170         MOVE SPACES TO COM-MORE.                                 00517000
005180     IF RPSEC00-SELECT-RTN IS EQUAL TO '1'                        00518000
005190         AND EDIT-PANEL                                           00519000
005200         MOVE 'X' TO COM-RETURN                                   00520000
005210         GO TO PANEL-ROUTER.                                      00521000
005220     IF RPSEC00-SELECT-RTN IS EQUAL TO '1'                        00522000
005230         AND WS-MSGNBR IS GREATER THAN ZEROS                      00523000
005240         MOVE 'E' TO COM-RETURN                                   00524000
005250         MOVE 'E' TO COM-PANEL-ACTION                             00525000
005260         MOVE 'I' TO COM-FROM-PANEL                               00526000
005270         GO TO PANEL-ROUTER.                                      00527000
005280     IF RPSEC00-SELECT-RTN IS EQUAL TO '1'                        00528000
005290         MOVE '000003' TO WS-MSGNBR                               00529000
005300         MOVE 'E' TO COM-RETURN                                   00530000
005310         MOVE 'E' TO COM-PANEL-ACTION                             00531000
005320         MOVE 'I' TO COM-FROM-PANEL                               00532000
005330         GO TO PANEL-ROUTER.                                      00533000
005340     IF RPSEC00-RETURN IS EQUAL TO 'E'                            00534000
005350         AND FROM-KEY-PANEL                                       00535000
005360         AND INITIAL-PANEL                                        00536000
005370         MOVE RPSEC00-MSGNBR TO WS-MSGNBR                         00537000
005380         MOVE 'E' TO COM-RETURN                                   00538000
005390         MOVE 'E' TO COM-PANEL-ACTION                             00539000
005400         MOVE 'I' TO COM-FROM-PANEL                               00540000
005410         GO TO PANEL-ROUTER.                                      00541000
005420 PIP-PAGING-CONTROLS.                                             00542000
005430     IF COM-FIRST-KEY IS EQUAL TO SPACES                          00543000
005440         MOVE RPSEC00-ACCT2-GRP (1) TO COM-FIRST-KEY.             00544000
005450     MOVE RPSEC00-CUST-TYPE TO COM-CUST-TYPE.                     00545000
005460     MOVE RPSEC00-CUST-NAME TO COM-CUST-NAME.                     00546000
005470     MOVE RPSEC00-ACCT2-GRP (RPSEC00-OCCUR) TO COM-LAST-KEY.      00547000
005480     MOVE RPSEC00-ACCT2-GRP (RPSEC00-OCCUR)                       00548000
005490         to ws-test-acct2-grp.                                    00549000
005500     MOVE RPSEC00-CURPAGE TO COM-RPSEC00-CURPAGE.                 00550000
005510     MOVE RPSEC00-OCCUR TO COM-KEY-OCCUR.                         00551000
005520     PERFORM EDIT-INFO-PANEL.                                     00552000
005530 PIP-SEND-PANEL.                                                  00553000
005540     IF FROM-HELP                                                 00554000
005550         OR FROM-BREAKAWAY                                        00555000
005560         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00556000
005570         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00557000
005580     ELSE                                                         00558000
005590         MOVE PDB-RPV120-COMMAND TO PAN-SET-FLD.                  00559000
005600     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00560000
005610     PERFORM CALL-BISPAN-RPV120.                                  00561000
005620     MOVE COM-INST TO RPV120-INST.                                00562000
005630     MOVE COM-OPERID TO RPV120-OPERID.                            00563000
005640     MOVE COM-EDIT-DATE TO RPV120-SYSDATE.                        00564000
005650     MOVE COM-CUST-NAME TO RPV120-CUSTNA.                         00565000
005660     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00566000
005670         MOVE WS-HELPMSG TO WS-MSGNBR.                            00567000
005680     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00568000
005690         MOVE '000027' TO WS-MSGNBR                               00569000
005700     ELSE                                                         00570000
005710         PERFORM BUILD-NEXTKEY                                    00571000
005720         PERFORM COMPRESS-NEXTKEY                                 00572000
005730         MOVE WS-NEXTKEY TO RPV120-COMMAND.                       00573000
005740     IF FROM-HELP                                                 00574000
005750         OR FROM-BREAKAWAY                                        00575000
005760         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00576000
005770         MOVE COM-KEY-COMMAND TO RPV120-COMMAND                   00577000
005780         MOVE SPACE TO COM-FROM-PANEL                             00578000
005790     ELSE                                                         00579000
005800         MOVE RPV120-COMMAND TO COM-KEY-COMMAND                   00580000
005810         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00581000
005820     PERFORM PANEL-PFKEY-SET.                                     00582000
005830     MOVE SPACES TO RPV120-MORE.                                  00583000
005840     MOVE 'E' TO COM-END.                                         00584000
005850     IF COM-MORE IS EQUAL TO 'Y'                                  00585000
005860         MOVE WS-MORE TO RPV120-MORE                              00586000
005870         MOVE '+' TO RPV120-PLUS                                  00587000
005880         MOVE 'F' TO COM-END                                      00588000
005890     ELSE                                                         00589000
005900         MOVE 'N' TO WS-PF8-FLG                                   00590000
005910         MOVE SPACE TO RPV120-PLUS.                               00591000
005920     IF COM-RPSEC00-CURPAGE IS GREATER THAN +1                    00592000
005930         MOVE WS-MORE TO RPV120-MORE                              00593000
005940         MOVE '-' TO RPV120-MINUS                                 00594000
005950         MOVE 'P' TO COM-END                                      00595000
005960     ELSE                                                         00596000
005970         MOVE 'P' TO WS-PF7-FLG                                   00597000
005980         MOVE SPACE TO RPV120-MINUS.                              00598000
005990     IF COM-MORE IS EQUAL TO 'Y'                                  00599000
006000         AND COM-RPSEC00-CURPAGE IS GREATER THAN +1               00600000
006010         MOVE 'B' TO COM-END.                                     00601000
006020     IF COM-WKUCOUNT IS GREATER THAN ZERO                         00602000
006030         AND COM-WKUPOSITION IS GREATER THAN +1                   00603000
006040         AND COM-END IS NOT EQUAL TO 'P'                          00604000
006050         MOVE 'A' TO WS-PF7-FLG.                                  00605000
006060     IF COM-WKUCOUNT IS GREATER THAN ZERO                         00606000
006070         AND COM-WKUPOSITION IS LESS THAN COM-WKUCOUNT            00607000
006080         AND COM-END IS NOT EQUAL TO 'F'                          00608000
006090         MOVE 'A' TO WS-PF8-FLG.                                  00609000
006100 PIP-COMPLETE-SEND.                                               00610000
006110     PERFORM BUILD-PFKEY-LINE.                                    00611000
006120     MOVE WS-PFLINE1 TO RPV120-PFLINE1.                           00612000
006130     MOVE WS-PFLINE2 TO RPV120-PFLINE2.                           00613000
006140     PERFORM GET-MESSAGE.                                         00614000
006150     MOVE WS-MESSAGE TO RPV120-MSGLINE.                           00615000
006160     PERFORM PANEL-PUT-RPV120.                                    00616000
006170     PERFORM PANEL-SEND.                                          00617000
006180     MOVE '1' TO COM-RETURN.                                      00618000
006190     MOVE 'I' TO COM-FROM-PANEL.                                  00619000
006200     MOVE 'E' TO COM-PANEL-ACTION.                                00620000
006210     MOVE COM-INTID TO WS-TRANSID.                                00621000
006220     GO TO CICS-RETURN-TRANSID.                                   00622000
006230 PIP-EXIT.                                                        00623000
006240     EXIT.                                                        00624000
006250******************************************************************00625000
006260 EDIT-INFO-PANEL SECTION.                                         00626000
006270 EIP-START.                                                       00627000
006280     MOVE COM-KEY-ACCOUNT TO RPV120-ACCOUNT.                      00628000
006290     MOVE COM-PRODCODE TO RPV120-PRODCD.                          00629000
006300     MOVE RPSEC00-KEY-MODEL2 TO COM-KEY-MODEL.                    00630000
006310     MOVE COM-KEY-MODEL TO RPV120-MODEL.                          00631000
006320     MOVE RPSEC00-CUST-NAME TO RPV120-CUSTNA.                     00632000
006330     IF RPSEC00-INST2 (1) IS NOT GREATER THAN ZEROS               00633000
006340         MOVE 'PRIMARY' TO RPV120-REL                             00634000
006350         MOVE RPSEC00-KEY-INST TO RPSEC00-INST2 (1)               00635000
006360         MOVE RPSEC00-KEY-PRODCODE TO RPSEC00-PRODCODE2 (1)       00636000
006370         MOVE RPSEC00-KEY-ACCOUNT TO RPSEC00-ACCT2 (1)            00637000
006380     ELSE                                                         00638000
006390         MOVE 'SECONDARY' TO RPV120-REL.                          00639000
006400     MOVE RPSEC00-INST2 (1) TO RPV120-INST1.                      00640000
006410     MOVE RPSEC00-PRODCODE2 (1) TO RPV120-PRODCD1.                00641000
006420     MOVE RPSEC00-ACCT2 (1) TO RPV120-ACCT.                       00642000
006430     MOVE RPSEC00-MODEL2 (1) TO RPV120-MODEL.                     00643000
006440     MOVE RPSEC00-MODEL-DESC TO RPV120-DESC.                      00644000
006450     IF RPSEC00-SC-OPTION IS EQUAL TO 'Y'                         00645000
006460         MOVE 'YES' TO RPV120-SVCCHG                              00646000
006470     ELSE                                                         00647000
006480         MOVE 'NO' TO RPV120-SVCCHG.                              00648000
006490     IF RPSEC00-RATE-OPTION IS EQUAL TO 'Y'                       00649000
006500         MOVE 'YES' TO RPV120-RATE                                00650000
006510     ELSE                                                         00651000
006520         MOVE 'NO' TO RPV120-RATE.                                00652000
006530     IF RPSEC00-REL-STATUS IS EQUAL TO 'A'                        00653000
006540         MOVE 'ACTIVE' TO RPV120-STATUS.                          00654000
006550     IF RPSEC00-REL-STATUS IS EQUAL TO 'E'                        00655000
006560         MOVE 'EXPIRED' TO RPV120-STATUS.                         00656000
006570     IF RPSEC00-REL-STATUS IS EQUAL TO 'I'                        00657000
006580         MOVE 'INACTIVE' TO RPV120-STATUS.                        00658000
006590     MOVE RPSEC00-LAST-EVENT-DATE TO SR-CODASYL.                  00659000
006600     PERFORM EDIT-CODASYL-DATE.                                   00660000
006610     MOVE SR-CODASYL-EDITED TO RPV120-LEVTDT.                     00661000
006620 EIP-EXIT.                                                        00662000
006630     EXIT.                                                        00663000
006640******************************************************************00664000
006650 MORE-DATA-PANELS SECTION.                                        00665000
006660 MDP-START.                                                       00666000
006670     GO TO PANEL-ROUTER.                                          00667000
006680 MDP-EXIT.                                                        00668000
006690     EXIT.                                                        00669000
006700******************************************************************00670000
006710 CLOSE-TRANSACTION SECTION.                                       00671000
000000 COPY SRP0722.                                                    00672000
006730******************************************************************00673000
006740 PANEL-INIT SECTION.                                              00674000
000000 COPY SRP073.                                                     00675000
006760******************************************************************00676000
006770 EDIT-CODASYL-DATE SECTION.                                       00677000
000000 COPY SRP087.                                                     00678000
006790******************************************************************00679000
006800 BUILD-NEXTKEY SECTION.                                           00680000
006810 BXN-START.                                                       00681000
006820     MOVE SPACES TO WS-NEXTKEY.                                   00682000
006830     MOVE ',' TO WS-DELIM1.                                       00683000
006840     MOVE ',' TO WS-DELIM2.                                       00684000
006850     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00685000
006860     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00686000
006870         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00687000
006880     ELSE                                                         00688000
006890         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00689000
006900     MOVE COM-EXTERNALID TO WS-EXTID.                             00690000
006910 BXN-EXIT.                                                        00691000
006920     EXIT.                                                        00692000
006930******************************************************************00693000
006940 ABORT-EXIT SECTION.                                              00694000
006950 AE-START.                                                        00695000
006960     MOVE EIBFN TO COM-ABEIBFN.                                   00696000
006970     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00697000
006980     GO TO CICS-ABORT-EXIT.                                       00698000
006990 AE-EXIT.                                                         00699000
007000     EXIT.                                                        00700000
007010******************************************************************00701000
007020 RPSEC00-LINK-MESSAGE SECTION.                                    00702000
007030 RPLM-START.                                                      00703000
007040     MOVE 'Y' TO RPSEC00-GLOBAL-CLOSE.                            00704000
007050     MOVE 'VKL' TO RPSEC00-APIFUNC.                               00705000
007060     MOVE WS-FILEOPTIONS TO RPSEC00-FILEOPTS.                     00706000
007070     MOVE COM-RETURN TO RPSEC00-RETURN.                           00707000
007080     MOVE COM-MODELID TO RPSEC00-MODELID.                         00708000
007090     MOVE COM-SECALT TO RPSEC00-SECALT.                           00709000
007100     MOVE COM-OPERID TO RPSEC00-OPERID.                           00710000
007110     MOVE COM-DATE TO RPSEC00-DATE.                               00711000
007120     MOVE COM-EXTERNALID TO RPSEC00-EXTERNALID.                   00712000
007130     MOVE COM-INST TO RPSEC00-KEY-INST.                           00713000
007140     MOVE COM-PRODCODE TO RPSEC00-KEY-PRODCODE.                   00714000
007150     MOVE COM-ACCOUNT TO RPSEC00-KEY-ACCOUNT.                     00715000
007160     MOVE COM-RPSEC00-OCCUR TO RPSEC00-OCCUR.                     00716000
007170     MOVE COM-RPSEC00-CURPAGE TO RPSEC00-CURPAGE.                 00717000
007180     IF COM-CUST-TYPE IS NOT EQUAL TO 'R'                         00718000
007190         AND COM-CUST-TYPE IS NOT EQUAL TO 'C'                    00719000
007200         MOVE SPACES TO COM-CUST-TYPE                             00720000
007210         MOVE SPACES TO COM-CUST-NAME.                            00721000
007220     MOVE COM-CUST-TYPE TO RPSEC00-CUST-TYPE.                     00722000
007230     MOVE COM-CUST-NAME TO RPSEC00-CUST-NAME.                     00723000
007240     MOVE COM-LANG TO RPSEC00-COM-LANG.                           00724000
007250     MOVE COM-CURN-CODE TO RPSEC00-COM-CURNCD.                    00725000
007260     MOVE COM-INST-OPTS TO RPSEC00-INST-OPTS.                     00726000
007270     EXEC CICS LINK                                               00727000
007280         PROGRAM('RPLSEC00')                                      00728000
007290         COMMAREA(RPSEC00-MESSAGE)                                00729000
007300         LENGTH(LENGTH OF RPSEC00-MESSAGE)                        00730000
007310         RESP(WS-CICS-RESPONSE)                                   00731000
007320         END-EXEC.                                                00732000
007330     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00733000
007340         MOVE 'RPLSEC00 LINK FAILED' TO COM-ABMSG                 00734000
007350         MOVE WS-TR0003 TO COM-ABTRACE                            00735000
007360         MOVE WS-AB0009 TO COM-ABORT                              00736000
007370         GO TO CICS-ABORT-EXIT.                                   00737000
007380     MOVE RPSEC00-FUNCTION TO WS-FUNCTION.                        00738000
007390     IF RPSEC00-ABORT IS NOT EQUAL TO ZERO                        00739000
007400         MOVE RPSEC00-ABORT TO COM-ABORT                          00740000
007410         MOVE RPSEC00-ABTRACE TO COM-ABTRACE                      00741000
007420         MOVE RPSEC00-ABEIBFN TO COM-ABEIBFN                      00742000
007430         MOVE RPSEC00-ABEIBRCODE TO COM-ABEIBRCODE                00743000
007440         MOVE RPSEC00-ABPROGID TO COM-ABPROGID                    00744000
007450         MOVE RPSEC00-SRBMDB TO COM-SRBMDB                        00745000
007460         MOVE RPSEC00-ABTYPE TO COM-ABTYPE                        00746000
007470         GO TO CICS-ABORT-EXIT.                                   00747000
007480     MOVE RPSEC00-ABORT TO COM-ABORT.                             00748000
007490     MOVE RPSEC00-MSGNBR TO WS-MSGNBR.                            00749000
007500 RPLM-EXIT.                                                       00750000
007510     EXIT.                                                        00751000
007520******************************************************************00752000
007530 CLOSE-PANEL SECTION.                                             00753000
007540 CP-START.                                                        00754000
007550     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00755000
007560     IF COM-RETURN IS EQUAL TO 'E'                                00756000
007570         PERFORM CALL-BISPAN-RPV120K.                             00757000
007580     IF COM-RETURN IS EQUAL TO '1'                                00758000
007590         PERFORM CALL-BISPAN-RPV120.                              00759000
007600 CP-EXIT.                                                         00760000
007610     EXIT.                                                        00761000
007620******************************************************************00762000
007630 CALL-BISPAN-RPV120K SECTION.                                     00763000
007640 CBD1-START.                                                      00764000
007650     CALL 'BISPAN' USING                                          00765000
007660         BICRPSB,                                                 00766000
007670         BICRSRB,                                                 00767000
007680         BICRPAN,                                                 00768000
007690         RPV120K-PANL-DATA-BLOCK,                                 00769000
007700         RPV120K-PANL-DATA-AREA.                                  00770000
007710 CBD1-EXIT.                                                       00771000
007720     EXIT.                                                        00772000
007730******************************************************************00773000
007740 CALL-BISPAN-RPV120 SECTION.                                      00774000
007750 CBD2-START.                                                      00775000
007760     CALL 'BISPAN' USING                                          00776000
007770         BICRPSB,                                                 00777000
007780         BICRSRB,                                                 00778000
007790         BICRPAN,                                                 00779000
007800         RPV120-PANL-DATA-BLOCK,                                  00780000
007810         RPV120-PANL-DATA-AREA.                                   00781000
007820 CBD2-EXIT.                                                       00782000
007830     EXIT.                                                        00783000
007840******************************************************************00784000
007850 PANEL-GET-RPV120 SECTION.                                        00785000
007860 PANEL-GET-RPV120-START.                                          00786000
007870     MOVE 'N' TO RPV120-SW-SET-CURSOR.                            00787000
007880     MOVE PDB-RPV120-NAME TO PAN-NAME.                            00788000
007890     MOVE REQ-GET TO PAN-REQ-VERB.                                00789000
007900     CALL 'BISPAN' USING                                          00790000
007910         BICRPSB                                                  00791000
007920         BICRSRB                                                  00792000
007930         BICRPAN                                                  00793000
007940         RPV120-PANL-DATA-BLOCK,                                  00794000
007950         RPV120-PANL-DATA-AREA.                                   00795000
007960 PANEL-GET-RPV120-EXIT.                                           00796000
007970     EXIT.                                                        00797000
007980******************************************************************00798000
007990 PANEL-PUT-RPV120 SECTION.                                        00799000
008000 PANEL-PUT-RPV120-START.                                          00800000
008010     MOVE PDB-RPV120-NAME TO PAN-NAME.                            00801000
008020     MOVE REQ-PUT TO PAN-REQ-VERB.                                00802000
008030     CALL 'BISPAN' USING                                          00803000
008040         BICRPSB                                                  00804000
008050         BICRSRB                                                  00805000
008060         BICRPAN                                                  00806000
008070         RPV120-PANL-DATA-BLOCK,                                  00807000
008080         RPV120-PANL-DATA-AREA.                                   00808000
008090 PANEL-PUT-RPV120-EXIT.                                           00809000
008100     EXIT.                                                        00810000
008110******************************************************************00811000
008120 PANEL-GET-RPV120K SECTION.                                       00812000
008130 PANEL-GET-RPV120K-START.                                         00813000
008140     MOVE 'N' TO RPV120K-SW-SET-CURSOR.                           00814000
008150     MOVE PDB-RPV120K-NAME TO PAN-NAME.                           00815000
008160     MOVE REQ-GET TO PAN-REQ-VERB.                                00816000
008170     CALL 'BISPAN' USING                                          00817000
008180         BICRPSB                                                  00818000
008190         BICRSRB                                                  00819000
008200         BICRPAN                                                  00820000
008210         RPV120K-PANL-DATA-BLOCK,                                 00821000
008220         RPV120K-PANL-DATA-AREA.                                  00822000
008230 PANEL-GET-RPV120K-EXIT.                                          00823000
008240     EXIT.                                                        00824000
008250******************************************************************00825000
008260 PANEL-PUT-RPV120K SECTION.                                       00826000
008270 PANEL-PUT-RPV120K-START.                                         00827000
008280     MOVE PDB-RPV120K-NAME TO PAN-NAME.                           00828000
008290     MOVE REQ-PUT TO PAN-REQ-VERB.                                00829000
008300     CALL 'BISPAN' USING                                          00830000
008310         BICRPSB                                                  00831000
008320         BICRSRB                                                  00832000
008330         BICRPAN                                                  00833000
008340         RPV120K-PANL-DATA-BLOCK,                                 00834000
008350         RPV120K-PANL-DATA-AREA.                                  00835000
008360 PANEL-PUT-RPV120K-EXIT.                                          00836000
008370     EXIT.                                                        00837000
008380******************************************************************00838000
008390 MIC-MST-API SECTION.                                             00839000
000000 COPY MIPMSTA.                                                    00840000
008410******************************************************************00841000
008420 EDIT-ACCOUNT-KEY SECTION.                                        00842000
000000 COPY RPP014.                                                     00843000
008440******************************************************************00844000
008450 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 00845000
000000 COPY RPP033.                                                     00846000
008470******************************************************************00847000
008480 ACCOUNT-KEY-EDIT SECTION.                                        00848000
000000 COPY RPP130.                                                     00849000
008500******************************************************************00850000
008510 LEFT-JUSTIFY SECTION.                                            00851000
000000 COPY SRP025.                                                     00852000
008530******************************************************************00853000
008540 RIGHT-JUSTIFY SECTION.                                           00854000
000000 COPY SRP026.                                                     00855000
008560******************************************************************00856000
008570 PARAMETER-SEARCH SECTION.                                        00857000
000000 COPY SRP030.                                                     00858000
008590******************************************************************00859000
008600 COMPRESS-NEXTKEY SECTION.                                        00860000
000000 COPY SRP070.                                                     00861000
008620******************************************************************00862000
008630 GET-MESSAGE SECTION.                                             00863000
000000 COPY SRP071.                                                     00864000
008650******************************************************************00865000
008660 SRP170-ROUTINE SECTION.                                          00866000
000000 COPY SRP170.                                                     00867000
008680******************************************************************00868000
008690 BUILD-PFKEY-LINE SECTION.                                        00869000
000000 COPY SRP710.                                                     00870000
008710******************************************************************00871000
008720 VALIDATE-PFKEYS SECTION.                                         00872000
000000 COPY SRP711.                                                     00873000
008740******************************************************************00874000
008750 SLP096-GET-2023-RECORD SECTION.                                  00875000
000000 COPY SLP096.                                                     00876000
008770******************************************************************00877000
008780 CICS-XCTL SECTION.                                               00878000
000000 COPY SLP704.                                                     00879000
008800******************************************************************00880000
008810 CICS-RETURN-TRANSID SECTION.                                     00881000
000000 COPY SLP710.                                                     00882000
008830******************************************************************00883000
008840 TSQ-DELETE SECTION.                                              00884000
008850 TSQD-START.                                                      00885000
008860 TSQD-EXIT.                                                       00886000
008870     EXIT.                                                        00887000
008880******************************************************************00888000
008890 CICS-TSQ-READ SECTION.                                           00889000
000000 COPY SLP744.                                                     00890000
008910******************************************************************00891000
008920 CICS-ABORT-EXIT SECTION.                                         00892000
000000 COPY SLP798.                                                     00893000
008940******************************************************************00894000
