000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL115.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL115 - CASH REWARDS INCENTIVE PROFILE                     *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  RPW014-AREAS.                                                00016000
000000 COPY RPW014.                                                     00017000
000180 01  RPW130-AREAS.                                                00018000
000000 COPY RPW130.                                                     00019000
000200*01  BICRSRB.                                                     00020000
000000 COPY BICRSRB.                                                    00021000
000220*01  BICRPSB.                                                     00022000
000000 COPY BICRPSB.                                                    00023000
000240*01  BICRVERB.                                                    00024000
000000 COPY BICRVERB.                                                   00025000
000260*01  BICRSTAT.                                                    00026000
000000 COPY BICRSTAT.                                                   00027000
000280*01  BICRCONS.                                                    00028000
000000 COPY BICRCONS.                                                   00029000
000300*01  BICRDBS.                                                     00030000
000000 COPY BICRDBS.                                                    00031000
000320*01  BICRPAN.                                                     00032000
000000 COPY BICRPAN.                                                    00033000
000340 01  SRW710-AREAS.                                                00034000
000000 COPY SRW710.                                                     00035000
000360 01  RPV115K-PANL-DATA-BLOCK.                                     00036000
000000 COPY RPV115KW.                                                   00037000
000380 01  RPV115-PANL-DATA-BLOCK.                                      00038000
000000 COPY RPV115W.                                                    00039000
000400 01  WS-WORKAREAS.                                                00040000
000410     03  WS-NEXTKEY.                                              00041000
000420         05  WS-EXTID            PIC X(08).                       00042000
000430         05  WS-DELIM1           PIC X(01)       VALUE ','.       00043000
000440         05  WS-DATA.                                             00044000
000450             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00045000
000460             07  WS-DELIM2       PIC X(01)       VALUE ','.       00046000
000470             07  WS-ACCTX.                                        00047000
000480                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00048000
000490             07  WS-DELIM3       PIC X(01)       VALUE ','.       00049000
000500         05  FILLER              PIC X(42)       VALUE SPACES.    00050000
000510     03  WS-PROGRAM-ID           PIC X(06)       VALUE SPACES.    00051000
000520     03  WS-LNKPROG              PIC X(08)       VALUE 'RPLCRW01'.00052000
000530     03  WS-LKLGTH               PIC S9(04)      COMP             00053000
000540                                                 VALUE +4088.     00054000
000550     03  WS-PDATE                PIC 9(08).                       00055000
000560     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00056000
000570         05  WS-PDATE-YYYY       PIC 9(04).                       00057000
000580         05  WS-PDATE-MM         PIC 9(02).                       00058000
000590         05  WS-PDATE-DD         PIC 9(02).                       00059000
000600 01  WS-LINKMSG                  PIC X(4500).                     00060000
000610 01  RPCRW01-MESSAGE.                                             00061000
000000 COPY MISCNT00      REPLACING                                     00062000
000630             ==:MICNT:== BY ==RPCRW01==.                          00063000
000000 COPY RPSCRW01.                                                   00064000
000650 01  WS-TSQAREAS.                                                 00065000
000660     03  WS-TSQITEM              PIC S9(04)      COMP             00066000
000670                                                 VALUE +0001.     00067000
000680     03  WS-TSQLGTH              PIC S9(04)      COMP             00068000
000690                                                 VALUE +4096.     00069000
000700     03  WS-TSQKEY.                                               00070000
000710         05  WS-TSQID            PIC X(04).                       00071000
000720         05  WS-TSQTRMID         PIC X(04).                       00072000
000730 01  LS-TSQAREA.                                                  00073000
000740     03  LS-TSQKEY               PIC X(08).                       00074000
000750     03  LS-TSQDATA              PIC X(4088).                     00075000
000760 01  MIWPRI-AREAS.                                                00076000
000000 COPY MIWPRI.                                                     00077000
000780 01  MIWMSTA-AREAS.                                               00078000
000000 COPY MIWMSTA.                                                    00079000
000800 01  MIMST-RECORD.                                                00080000
000000 COPY MISMST.                                                     00081000
000820 01  MI2023-RECORD.                                               00082000
000000 COPY MIS2023A.                                                   00083000
000840 01  WS-ABORTCODES.                                               00084000
000850     03  WS-AB0009               PIC S9(04)      COMP             00085000
000860                                                 VALUE +0009.     00086000
000870     03  WS-AB0106               PIC S9(04)      COMP             00087000
000880                                                 VALUE +0106.     00088000
000890     03  WS-AB2033               PIC S9(04)      COMP             00089000
000900                                                 VALUE +2033.     00090000
000910 01  WS-TRACECODES.                                               00091000
000920     03  WS-TR0001               PIC S9(04)      COMP             00092000
000930                                                 VALUE +0001.     00093000
000940     03  WS-TR0002               PIC S9(04)      COMP             00094000
000950                                                 VALUE +0002.     00095000
000960 01  SLW096-AREAS.                                                00096000
000000 COPY SLW096.                                                     00097000
000980 01  SRW000-AREAS.                                                00098000
000000 COPY SRW000.                                                     00099000
001000 01  SRW025-AREAS.                                                00100000
000000 COPY SRW025.                                                     00101000
001020 01  SRW030-AREAS.                                                00102000
000000 COPY SRW030.                                                     00103000
001040 01  SRW031-AREAS.                                                00104000
000000 COPY SRW031.                                                     00105000
001060 01  SRW067-AREAS.                                                00106000
000000 COPY SRW067.                                                     00107000
001080 01  SRW105-AREAS.                                                00108000
000000 COPY SRW105.                                                     00109000
001100 01  SRW161-AREAS.                                                00110000
000000 COPY SRW161.                                                     00111000
001120 01  SRW170-AREAS.                                                00112000
000000 COPY SRW170.                                                     00113000
001140 COPY DFHAID.                                                     00114000
001150******************************************************************00115000
001160 LINKAGE SECTION.                                                 00116000
001170 01  DFHCOMMAREA.                                                 00117000
000000 COPY SLS1112.                                                    00118000
001190     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00119000
001200         05  COM-PROGRAM-ID      PIC X(06).                       00120000
001210         05  COM-EDIT-DATE       PIC X(10).                       00121000
001220         05  COM-KEY-INFO.                                        00122000
001230             07  COM-KEY-OCCUR   PIC S9(04)      COMP-3.          00123000
001240         05  COM-PANEL-ACTION    PIC X(01).                       00124000
001250             88  INITIAL-PANEL                   VALUE ' '.       00125000
001260             88  EDIT-PANEL                      VALUE 'E'.       00126000
001270         05  COM-FROM-PANEL      PIC X(01).                       00127000
001280             88  FROM-KEY-PANEL                  VALUE 'K'.       00128000
001290             88  FROM-INFO-PANEL                 VALUE 'I'.       00129000
001300             88  FROM-BREAKAWAY                  VALUE 'B'.       00130000
001310             88  FROM-HELP                       VALUE 'H'.       00131000
001320         05  COM-KEY-FIELDS.                                      00132000
001330             07  COM-KEY-PRODCODE                                 00133000
001340                                 PIC X(06).                       00134000
001350             07  COM-KEY-ACCOUNT PIC X(18).                       00135000
001360             07  COM-KEY-ACCOUNT-N                                00136000
001370                         REDEFINES COM-KEY-ACCOUNT                00137000
001380                                 PIC 9(18).                       00138000
001390         05  COM-KEY-MSGNBR      PIC X(06).                       00139000
001400         05  COM-KEY-COMMAND     PIC X(50).                       00140000
001410         05  COM-KEY-FORMATTEDACCT                                00141000
001420                                 PIC X(22).                       00142000
001430*01  SLW096-2023RECORDS.                                          00143000
000000 COPY SLW096L.                                                    00144000
001450******************************************************************00145000
001460 PROCEDURE DIVISION.                                              00146000
001470******************************************************************00147000
001480 ENTRY-ROUTINE SECTION.                                           00148000
001490     MOVE 'RPL115' TO COM-ABPROGID.                               00149000
000000 COPY SLP771.                                                     00150000
001510******************************************************************00151000
001520 TRANSACTION-CLEAN-UP SECTION.                                    00152000
001530 TCU-START.                                                       00153000
001540 TCU-EXIT.                                                        00154000
001550     EXIT.                                                        00155000
001560******************************************************************00156000
001570 CICS-HANDLE-CONDITION SECTION.                                   00157000
000000 COPY SLP772.                                                     00158000
001590     MOVE WS-AB2033 TO COM-ABORT.                                 00159000
001600     MOVE WS-TR0001 TO COM-ABTRACE.                               00160000
001610     GO TO ABORT-EXIT.                                            00161000
001620 CHC-EXIT.                                                        00162000
001630     EXIT.                                                        00163000
001640******************************************************************00164000
001650 ROUTING-ROUTINE SECTION.                                         00165000
001660 RR-START.                                                        00166000
001670     MOVE LOW-VALUES TO RPCRW01-MESSAGE.                          00167000
001680     MOVE LOW-VALUES TO RPV115K-PANL-DATA-AREA.                   00168000
001690     MOVE LOW-VALUES TO RPV115-PANL-DATA-AREA.                    00169000
001700     MOVE ZERO TO WS-MSGNBR.                                      00170000
001710     MOVE 'RP00' TO WS-TSQFILEID.                                 00171000
001720     MOVE 'RPI' TO WS-TSQSYSID.                                   00172000
001730     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00173000
001740     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00174000
001750     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00175000
001760         MOVE COM-PAN TO BICRPAN                                  00176000
001770         MOVE COM-PSB TO BICRPSB                                  00177000
001780         MOVE COM-SRB TO BICRSRB                                  00178000
001790     ELSE                                                         00179000
001800         MOVE '1' TO BPSB-LEVEL.                                  00180000
001810     IF COM-RETURN IS EQUAL TO 'B'                                00181000
001820         GO TO BREAKAWAY-RETURN.                                  00182000
001830     MOVE COM-PROGRAM-ID TO WS-PROGRAM-ID.                        00183000
001840     IF COM-RETURN IS EQUAL TO '0'                                00184000
001850         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00185000
001860         MOVE SPACES TO COM-WORKAREAS                             00186000
001870         MOVE '1' TO SRB-VERSION                                  00187000
001880         MOVE 'IPRP' TO SRB-APPL-ID                               00188000
001890         MOVE 'RPL115' TO SRB-PROG-ID                             00189000
001900         MOVE 'RPL115' TO COM-PROGRAM-ID                          00190000
001910         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00191000
001920         MOVE 'P' TO PAN-TYPE                                     00192000
001930         MOVE SPACE TO PAN-OVERLAY                                00193000
001940         MOVE SPACE TO PAN-CLOSE                                  00194000
001950         MOVE SPACE TO PAN-ALARM                                  00195000
001960         MOVE SPACE TO PAN-CURSOR-PAN                             00196000
001970         MOVE SPACE TO PAN-CURSOR-FLD                             00197000
001980         MOVE SPACE TO PAN-SET-FLD                                00198000
001990         MOVE SPACE TO PAN-SET-VID                                00199000
002000         MOVE SPACE TO PAN-SET-EMP                                00200000
002010         MOVE PDB-RPV115-NAME TO PAN-NAME                         00201000
002020         PERFORM PANEL-INIT                                       00202000
002030         MOVE BICRPAN TO COM-PAN                                  00203000
002040         MOVE BICRPSB TO COM-PSB                                  00204000
002050         MOVE BICRSRB TO COM-SRB                                  00205000
002060         PERFORM INITIALIZE-DATE                                  00206000
002070         GO TO PANEL-ROUTER.                                      00207000
002080     PERFORM PANEL-NAME-SET.                                      00208000
002090     IF COM-HELPSW IS EQUAL TO 'Y'                                00209000
002100         GO TO HELP-RETURN.                                       00210000
002110     PERFORM PANEL-RECEIVE.                                       00211000
002120     PERFORM PANEL-DATA-GET.                                      00212000
002130     PERFORM PANEL-PFKEY-SET.                                     00213000
002140     PERFORM VALIDATE-PFKEYS.                                     00214000
002150     IF EIBAID IS EQUAL TO DFHPF1                                 00215000
002160         GO TO GET-HELP.                                          00216000
002170     IF EIBAID IS EQUAL TO DFHPF11                                00217000
002180         GO TO BREAK-AWAY.                                        00218000
002190     IF (COM-RETURN IS EQUAL TO 'E'                               00219000
002200         OR COM-RETURN IS EQUAL TO '1')                           00220000
002210         AND (EIBAID IS EQUAL TO DFHPF2                           00221000
002220         OR EIBAID IS EQUAL TO DFHPF3                             00222000
002230         OR EIBAID IS EQUAL TO DFHPF4                             00223000
002240         OR EIBAID IS EQUAL TO DFHPF7                             00224000
002250         OR EIBAID IS EQUAL TO DFHPF8                             00225000
002260         OR EIBAID IS EQUAL TO DFHPF12)                           00226000
002270         GO TO CLOSE-TRANSACTION.                                 00227000
002280     IF COM-RETURN IS EQUAL TO '0'                                00228000
002290         OR COM-RETURN IS EQUAL TO 'E'                            00229000
002300         OR COM-RETURN IS EQUAL TO '1'                            00230000
002310         GO TO PANEL-ROUTER.                                      00231000
002320 RR-END.                                                          00232000
002330     GO TO CLOSE-TRANSACTION.                                     00233000
002340 RR-EXIT.                                                         00234000
002350     EXIT.                                                        00235000
002360******************************************************************00236000
002370 INITIALIZE-DATE SECTION.                                         00237000
002380 ID-START.                                                        00238000
002390     MOVE COM-DATE TO WS-CURDATE8.                                00239000
002400     MOVE '-' TO WS-CD8DSH1.                                      00240000
002410     MOVE '-' TO WS-CD8DSH2.                                      00241000
002420     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00242000
002430 ID-EXIT.                                                         00243000
002440     EXIT.                                                        00244000
002450******************************************************************00245000
002460 PANEL-NAME-SET SECTION.                                          00246000
002470 PNS-START.                                                       00247000
002480     IF COM-RETURN IS EQUAL TO '0'                                00248000
002490         MOVE PDB-RPV115K-NAME TO PAN-NAME.                       00249000
002500     IF COM-RETURN IS EQUAL TO 'E'                                00250000
002510         MOVE PDB-RPV115K-NAME TO PAN-NAME.                       00251000
002520     IF COM-RETURN IS EQUAL TO '1'                                00252000
002530         MOVE PDB-RPV115-NAME TO PAN-NAME.                        00253000
002540 PNS-EXIT.                                                        00254000
002550     EXIT.                                                        00255000
002560******************************************************************00256000
002570 PANEL-DATA-GET SECTION.                                          00257000
002580 PDG-START.                                                       00258000
002590     IF COM-RETURN IS EQUAL TO '0'                                00259000
002600         PERFORM PANEL-GET-RPV115K.                               00260000
002610     IF COM-RETURN IS EQUAL TO 'E'                                00261000
002620         PERFORM PANEL-GET-RPV115K                                00262000
002630         MOVE RPV115K-COMMAND TO WS-NEXTKEY                       00263000
002640         MOVE PDB-RPV115K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00264000
002650     IF COM-RETURN IS EQUAL TO '1'                                00265000
002660         PERFORM PANEL-GET-RPV115                                 00266000
002670         MOVE RPV115-COMMAND TO WS-NEXTKEY                        00267000
002680         MOVE PDB-RPV115-COMMAND-DCHG TO WS-COMMAND-DCHG.         00268000
002690 PDG-EXIT.                                                        00269000
002700     EXIT.                                                        00270000
002710******************************************************************00271000
002720 PANEL-PFKEY-SET SECTION.                                         00272000
002730 PPS-START.                                                       00273000
002740 PPS-EXIT.                                                        00274000
002750     EXIT.                                                        00275000
002760******************************************************************00276000
002770 PANEL-ROUTER SECTION.                                            00277000
002780 PR-START.                                                        00278000
002790     IF COM-RETURN IS EQUAL TO '0'                                00279000
002800         GO TO PROCESS-KEY-PANEL.                                 00280000
002810     IF COM-RETURN IS EQUAL TO 'E'                                00281000
002820         GO TO PROCESS-KEY-PANEL.                                 00282000
002830     IF COM-RETURN IS EQUAL TO '1'                                00283000
002840         GO TO PROCESS-INFO-PANEL.                                00284000
002850     GO TO CLOSE-TRANSACTION.                                     00285000
002860 PR-EXIT.                                                         00286000
002870     EXIT.                                                        00287000
002880******************************************************************00288000
002890 HELP-RETURN SECTION.                                             00289000
000000 COPY SRP074.                                                     00290000
002910******************************************************************00291000
002920 HELP-RETURN-FINISH SECTION.                                      00292000
002930 HRF-START.                                                       00293000
002940     PERFORM PANEL-DATA-GET.                                      00294000
002950     MOVE 'H' TO COM-FROM-PANEL.                                  00295000
002960     GO TO PANEL-ROUTER.                                          00296000
002970 HRF-EXIT.                                                        00297000
002980     EXIT.                                                        00298000
002990******************************************************************00299000
003000 HELP-MISSING-FINISH SECTION.                                     00300000
003010 HMF-START.                                                       00301000
003020     MOVE 'H' TO COM-FROM-PANEL.                                  00302000
003030     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00303000
003040     GO TO PANEL-ROUTER.                                          00304000
003050 HMF-EXIT.                                                        00305000
003060     EXIT.                                                        00306000
003070******************************************************************00307000
003080 BREAK-AWAY SECTION.                                              00308000
000000 COPY SRP0752.                                                    00309000
003100******************************************************************00310000
003110 BREAKAWAY-RETURN-FINISH SECTION.                                 00311000
003120 BRF-START.                                                       00312000
003130     PERFORM PANEL-DATA-GET.                                      00313000
003140     MOVE 'B' TO COM-FROM-PANEL.                                  00314000
003150     GO TO PANEL-ROUTER.                                          00315000
003160 BRF-EXIT.                                                        00316000
003170     EXIT.                                                        00317000
003180******************************************************************00318000
003190 PROCESS-KEY-PANEL SECTION.                                       00319000
003200 PKP-START.                                                       00320000
003210     IF INITIAL-PANEL                                             00321000
003220         MOVE COM-NEXTKEY TO COM-EXTERNALID                       00322000
003230         GO TO PKP-COM-INIT.                                      00323000
003240     IF EDIT-PANEL                                                00324000
003250         AND FROM-INFO-PANEL                                      00325000
003260         MOVE SPACE TO COM-FROM-PANEL                             00326000
003270         GO TO PKP-RELOAD-PANEL.                                  00327000
003280 PKP-COM-INIT.                                                    00328000
003290     MOVE COM-NEXTKEY TO SR-PSLIST.                               00329000
003300     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00330000
003310         GO TO PKP-SEND-PANEL.                                    00331000
003320 PKP-BEGIN-EDITS.                                                 00332000
003330     MOVE RPV115K-PRODCD TO RPW014-PRODCODE.                      00333000
003340     MOVE RPV115K-ACCOUNT TO RPW014-ACCT.                         00334000
003350     PERFORM EDIT-ACCOUNT-KEY.                                    00335000
003360     IF EDIT-PANEL                                                00336000
003370         GO TO PKP-RETURN-EDITS.                                  00337000
003380     PERFORM PARAMETER-SEARCH.                                    00338000
003390 PKP-RETURN-EDITS.                                                00339000
003400     MOVE RPW014-PRODCODE TO COM-PRODCODE.                        00340000
003410     MOVE RPW014-APPLNBR TO COM-APPL.                             00341000
003420     MOVE RPW014-DIALOGROUT TO COM-DIALOGROUT.                    00342000
003430     MOVE RPW014-PRODCODE TO COM-KEY-PRODCODE.                    00343000
003440     MOVE RPW014-ACCT TO COM-KEY-ACCOUNT.                         00344000
003450     MOVE RPW014-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          00345000
003460     IF INITIAL-PANEL                                             00346000
003470         AND RPW014-PRODCODE IS EQUAL TO LOW-VALUES               00347000
003480         AND RPW014-ACCT IS EQUAL TO LOW-VALUES                   00348000
003490         MOVE '000001' TO WS-MSGNBR                               00349000
003500         GO TO PKP-SEND-PANEL.                                    00350000
003510     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00351000
003520     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00352000
003530     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00353000
003540         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00354000
003550     ELSE                                                         00355000
003560         MOVE ZERO TO COM-ACCOUNT.                                00356000
003570     IF FROM-BREAKAWAY                                            00357000
003580         OR FROM-HELP                                             00358000
003590         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00359000
003600         GO TO PKP-RELOAD-PANEL.                                  00360000
003610 PKP-EDITS-READY.                                                 00361000
003620     MOVE SPACE TO COM-PANEL-ACTION.                              00362000
003630     MOVE '1' TO COM-RETURN.                                      00363000
003640     MOVE 'K' TO COM-FROM-PANEL.                                  00364000
003650     GO TO PANEL-ROUTER.                                          00365000
003660 PKP-RELOAD-PANEL.                                                00366000
003670     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00367000
003680         MOVE LOW-VALUES TO RPV115K-PRODCD                        00368000
003690     ELSE                                                         00369000
003700         MOVE COM-KEY-PRODCODE TO RPV115K-PRODCD.                 00370000
003710     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00371000
003720         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROES                    00372000
003730         MOVE LOW-VALUES TO RPV115K-ACCOUNT                       00373000
003740     ELSE                                                         00374000
003750         MOVE COM-KEY-ACCOUNT TO RPV115K-ACCOUNT.                 00375000
003760 PKP-SEND-PANEL.                                                  00376000
003770     MOVE PDB-RPV115K-NAME TO PAN-NAME.                           00377000
003780     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00378000
003790     IF FROM-BREAKAWAY                                            00379000
003800         OR FROM-HELP                                             00380000
003810         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00381000
003820     ELSE                                                         00382000
003830         MOVE PDB-RPV115K-PRODCD TO PAN-SET-FLD.                  00383000
003840     PERFORM CALL-BISPAN-RPV115K.                                 00384000
003850     MOVE COM-OPERID TO RPV115K-OPERID.                           00385000
003860     MOVE COM-INST TO RPV115K-INST.                               00386000
003870     MOVE COM-EDIT-DATE TO RPV115K-SYSDATE.                       00387000
003880     IF RPV115K-PRODCD IS EQUAL TO SPACES                         00388000
003890         MOVE LOW-VALUES TO RPV115K-PRODCD.                       00389000
003900     MOVE RPV115K-ACCOUNT TO SR-JUSTLONGIN.                       00390000
003910     MOVE +18 TO SR-JLGTH.                                        00391000
003920     PERFORM LEFT-JUSTIFY.                                        00392000
003930     MOVE SR-JUSTLONGOUT TO RPV115K-ACCOUNT.                      00393000
003940     IF RPV115K-ACCOUNT IS EQUAL TO SPACES                        00394000
003950         MOVE LOW-VALUES TO RPV115K-ACCOUNT.                      00395000
003960     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00396000
003970         MOVE WS-HELPMSG TO WS-MSGNBR.                            00397000
003980     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00398000
003990         MOVE '000027' TO WS-MSGNBR                               00399000
004000     ELSE                                                         00400000
004010         PERFORM BUILD-NEXTKEY                                    00401000
004020         PERFORM COMPRESS-NEXTKEY                                 00402000
004030         MOVE WS-NEXTKEY TO RPV115K-COMMAND.                      00403000
004040     IF FROM-BREAKAWAY                                            00404000
004050         OR FROM-HELP                                             00405000
004060         MOVE SPACE TO COM-FROM-PANEL                             00406000
004070         MOVE COM-KEY-COMMAND TO RPV115K-COMMAND                  00407000
004080         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00408000
004090     ELSE                                                         00409000
004100         MOVE WS-NEXTKEY TO COM-KEY-COMMAND                       00410000
004110         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00411000
004120     MOVE 'E' TO COM-RETURN.                                      00412000
004130     PERFORM GET-MESSAGE.                                         00413000
004140     MOVE WS-MESSAGE TO RPV115K-MSGLINE.                          00414000
004150     PERFORM PANEL-PFKEY-SET.                                     00415000
004160     PERFORM BUILD-PFKEY-LINE.                                    00416000
004170     MOVE WS-PFLINE1 TO RPV115K-PFLINE1.                          00417000
004180     MOVE WS-PFLINE2 TO RPV115K-PFLINE2.                          00418000
004190     PERFORM PANEL-PUT-RPV115K.                                   00419000
004200     PERFORM PANEL-SEND.                                          00420000
004210     MOVE 'E' TO COM-PANEL-ACTION.                                00421000
004220     MOVE COM-INTID TO WS-TRANSID.                                00422000
004230     GO TO CICS-RETURN-TRANSID.                                   00423000
004240 PKP-EXIT.                                                        00424000
004250     EXIT.                                                        00425000
004260******************************************************************00426000
004270 PROCESS-INFO-PANEL SECTION.                                      00427000
004280 PIP-START.                                                       00428000
004290     IF FROM-HELP                                                 00429000
004300         OR FROM-BREAKAWAY                                        00430000
004310         MOVE SPACE TO COM-FROM-PANEL                             00431000
004320         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00432000
004330         MOVE PAN-CURSOR-FLD TO WS-CURSOR-FIELD                   00433000
004340         GO TO PIP-SEND-PANEL.                                    00434000
004350     MOVE 'E' TO COM-END.                                         00435000
004360     IF INITIAL-PANEL                                             00436000
004370         GO TO PIP-CONTINUE.                                      00437000
004380     MOVE COM-NEXTKEY TO WS-NEXTKEY.                              00438000
004390 PIP-PFKEYS.                                                      00439000
004400     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00440000
004410         GO TO PIP-SEND-PANEL.                                    00441000
004420     IF EIBAID IS EQUAL TO DFHENTER                               00442000
004430         MOVE '2' TO COM-RETURN                                   00443000
004440         MOVE SPACE TO COM-PANEL-ACTION                           00444000
004450         GO TO PANEL-ROUTER.                                      00445000
004460     GO TO PIP-SEND-PANEL.                                        00446000
004470 PIP-CONTINUE.                                                    00447000
004480     MOVE 'VKL' TO RPCRW01-APIFUNC.                               00448000
004490     MOVE 'M' TO RPCRW01-FUNC.                                    00449000
004500     PERFORM RPCRW01-LINK-MESSAGE.                                00450000
004510 PIP-RPCRW01-RETURN-CHECK.                                        00451000
004520     IF RPCRW01-RETURN IS EQUAL TO 'E'                            00452000
004530         AND FROM-KEY-PANEL                                       00453000
004540         AND INITIAL-PANEL                                        00454000
004550         AND COM-WKUNAME IS EQUAL TO SPACES                       00455000
004560         MOVE RPCRW01-MSGNBR TO WS-MSGNBR                         00456000
004570         MOVE 'E' TO COM-RETURN                                   00457000
004580         MOVE 'E' TO COM-PANEL-ACTION                             00458000
004590         MOVE 'I' TO COM-FROM-PANEL                               00459000
004600         GO TO PANEL-ROUTER.                                      00460000
004610     IF RPCRW01-RETURN IS EQUAL TO 'E'                            00461000
004620         AND FROM-KEY-PANEL                                       00462000
004630         AND INITIAL-PANEL                                        00463000
004640         AND COM-WKUNAME IS NOT EQUAL TO SPACES                   00464000
004650         AND WS-PROGRAM-ID IS EQUAL TO 'RPL110'                   00465000
004660         MOVE DFHPF8 TO EIBAID                                    00466000
004670         GO TO CLOSE-TRANSACTION.                                 00467000
004680     IF RPCRW01-RETURN IS EQUAL TO 'E'                            00468000
004690         AND FROM-KEY-PANEL                                       00469000
004700         AND INITIAL-PANEL                                        00470000
004710         AND COM-WKUNAME IS NOT EQUAL TO SPACES                   00471000
004720         AND WS-PROGRAM-ID IS EQUAL TO 'RPL120'                   00472000
004730         MOVE DFHPF7 TO EIBAID                                    00473000
004740         GO TO CLOSE-TRANSACTION.                                 00474000
004750     MOVE PDB-RPV115-NAME TO PAN-NAME.                            00475000
004760 PIP-EDIT-PANEL.                                                  00476000
004770     PERFORM EDIT-INFO-PANEL.                                     00477000
004780 PIP-SEND-PANEL.                                                  00478000
004790     IF WS-CURSOR-FIELD IS EQUAL TO SPACE                         00479000
004800         MOVE PDB-RPV115-COMMAND TO PAN-SET-FLD                   00480000
004810     ELSE                                                         00481000
004820         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                     00482000
004830     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00483000
004840     PERFORM CALL-BISPAN-RPV115.                                  00484000
004850     MOVE COM-INST TO RPV115-INST.                                00485000
004860     MOVE COM-OPERID TO RPV115-OPERID.                            00486000
004870     MOVE COM-EDIT-DATE TO RPV115-SYSDATE.                        00487000
004880     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00488000
004890         MOVE WS-HELPMSG TO WS-MSGNBR.                            00489000
004900     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00490000
004910         AND WS-MSGNBR IS EQUAL TO ZERO                           00491000
004920         MOVE '000027' TO WS-MSGNBR                               00492000
004930     ELSE                                                         00493000
004940         PERFORM BUILD-NEXTKEY                                    00494000
004950         PERFORM COMPRESS-NEXTKEY                                 00495000
004960         MOVE WS-NEXTKEY TO RPV115-COMMAND.                       00496000
004970     MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                            00497000
004980     PERFORM GET-MESSAGE.                                         00498000
004990     MOVE WS-MESSAGE TO RPV115-MSGLINE.                           00499000
005000     PERFORM PANEL-PFKEY-SET.                                     00500000
005010     PERFORM BUILD-PFKEY-LINE.                                    00501000
005020     MOVE WS-PFLINE1 TO RPV115-PFLINE1.                           00502000
005030     MOVE WS-PFLINE2 TO RPV115-PFLINE2.                           00503000
005040     PERFORM PANEL-PUT-RPV115.                                    00504000
005050     PERFORM PANEL-SEND.                                          00505000
005060     MOVE '1' TO COM-RETURN.                                      00506000
005070     MOVE 'E' TO COM-PANEL-ACTION.                                00507000
005080     MOVE COM-INTID TO WS-TRANSID.                                00508000
005090     GO TO CICS-RETURN-TRANSID.                                   00509000
005100 PIP-EXIT.                                                        00510000
005110     EXIT.                                                        00511000
005120******************************************************************00512000
005130 EDIT-INFO-PANEL SECTION.                                         00513000
005140 EIP-START.                                                       00514000
005150     MOVE COM-KEY-ACCOUNT TO RPV115-ACCOUNT.                      00515000
005160     MOVE COM-PRODCODE TO RPV115-PRODCD.                          00516000
005170     MOVE RPCRW01-LAST-AMT TO SR-EDITSGNV02.                      00517000
005180     MOVE SR-EDIT20X TO RPV115-LASTAMT.                           00518000
005190     MOVE RPV115-LASTAMT TO SR-JUSTLONGIN.                        00519000
005200     MOVE 20 TO SR-JLGTH.                                         00520000
005210     PERFORM LEFT-JUSTIFY.                                        00521000
005220     MOVE SR-JUSTLONGOUT TO RPV115-LASTAMT.                       00522000
005230     MOVE RPCRW01-LSTCOMBBALUSED TO SR-EDITSGNV02.                00523000
005240     MOVE SR-EDIT20X TO RPV115-CMBUSED.                           00524000
005250     MOVE RPV115-CMBUSED TO SR-JUSTLONGIN.                        00525000
005260     MOVE 20 TO SR-JLGTH.                                         00526000
005270     PERFORM LEFT-JUSTIFY.                                        00527000
005280     MOVE SR-JUSTLONGOUT TO RPV115-CMBUSED.                       00528000
005290     MOVE RPCRW01-NXTDATE TO SR-CODASYL.                          00529000
005300     PERFORM EDIT-CODASYL-DATE.                                   00530000
005310     MOVE SR-CODASYL-EDITED TO RPV115-NEXTDATE.                   00531000
005320     MOVE RPCRW01-LSTDATE TO SR-CODASYL.                          00532000
005330     PERFORM EDIT-CODASYL-DATE.                                   00533000
005340     MOVE SR-CODASYL-EDITED TO RPV115-LASTDATE.                   00534000
005350     MOVE RPCRW01-PCT-USED TO SR-EDITMSKV09.                      00535000
005360     MOVE SR-EDIT10X TO RPV115-PERCENT.                           00536000
005370     MOVE RPV115-PERCENT TO SR-JUSTLONGIN.                        00537000
005380     MOVE 10 TO SR-JLGTH.                                         00538000
005390     PERFORM LEFT-JUSTIFY.                                        00539000
005400     MOVE SR-JUSTLONGOUT TO RPV115-PERCENT.                       00540000
005410     MOVE RPCRW01-AMT-YTD TO SR-EDITSGNV02.                       00541000
005420     MOVE SR-EDIT20X TO RPV115-PAIDYTD.                           00542000
005430     MOVE RPV115-PAIDYTD TO SR-JUSTLONGIN.                        00543000
005440     MOVE 20 TO SR-JLGTH.                                         00544000
005450     PERFORM LEFT-JUSTIFY.                                        00545000
005460     MOVE SR-JUSTLONGOUT TO RPV115-PAIDYTD.                       00546000
005470     MOVE RPCRW01-INST TO RPV115-RELINST.                         00547000
005480     MOVE RPCRW01-PRODCODE TO RPV115-RELPROD.                     00548000
005490     MOVE RPCRW01-ACCOUNT TO RPV115-RELACCT.                      00549000
005500     MOVE RPCRW01-IDNUMBER TO RPV115-RELIDNBR.                    00550000
005510 EIP-EXIT.                                                        00551000
005520     EXIT.                                                        00552000
005530******************************************************************00553000
005540 MORE-DATA-PANELS SECTION.                                        00554000
005550 MDP-START.                                                       00555000
005560     GO TO PANEL-ROUTER.                                          00556000
005570 MDP-EXIT.                                                        00557000
005580     EXIT.                                                        00558000
005590******************************************************************00559000
005600 CLOSE-TRANSACTION SECTION.                                       00560000
000000 COPY SRP0722.                                                    00561000
005620******************************************************************00562000
005630 PANEL-INIT SECTION.                                              00563000
000000 COPY SRP073.                                                     00564000
005650******************************************************************00565000
005660 BUILD-NEXTKEY SECTION.                                           00566000
005670 BXN-START.                                                       00567000
005680     MOVE SPACES TO WS-NEXTKEY.                                   00568000
005690     MOVE ',' TO WS-DELIM1.                                       00569000
005700     MOVE ',' TO WS-DELIM2.                                       00570000
005710     MOVE ',' TO WS-DELIM3.                                       00571000
005720     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00572000
005730     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00573000
005740         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00574000
005750     ELSE                                                         00575000
005760         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00576000
005770     MOVE COM-EXTERNALID TO WS-EXTID.                             00577000
005780 BXN-EXIT.                                                        00578000
005790     EXIT.                                                        00579000
005800******************************************************************00580000
005810 ABORT-EXIT SECTION.                                              00581000
005820 AE-START.                                                        00582000
005830     MOVE EIBFN TO COM-ABEIBFN.                                   00583000
005840     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00584000
005850     GO TO CICS-ABORT-EXIT.                                       00585000
005860 AE-EXIT.                                                         00586000
005870     EXIT.                                                        00587000
005880******************************************************************00588000
005890 RPCRW01-LINK-MESSAGE SECTION.                                    00589000
005900 CXLM-START.                                                      00590000
005910     MOVE 'Y' TO RPCRW01-GLOBAL-CLOSE.                            00591000
005920     MOVE WS-FILEOPTIONS TO RPCRW01-FILEOPTS.                     00592000
005930     MOVE COM-RETURN TO RPCRW01-RETURN.                           00593000
005940     MOVE COM-MODELID TO RPCRW01-MODELID.                         00594000
005950     MOVE COM-SECALT TO RPCRW01-SECALT.                           00595000
005960     MOVE COM-OPERID TO RPCRW01-OPERID.                           00596000
005970     MOVE COM-DATE TO RPCRW01-DATE.                               00597000
005980     MOVE COM-EXTERNALID TO RPCRW01-EXTERNALID.                   00598000
005990     MOVE COM-INST TO RPCRW01-KEY-INST.                           00599000
006000     MOVE COM-PRODCODE TO RPCRW01-KEY-PRODCODE.                   00600000
006010     MOVE COM-KEY-ACCOUNT TO RPCRW01-KEY-ACCOUNT.                 00601000
006020     MOVE SPACES TO RPCRW01-KEY-MODEL.                            00602000
006030     MOVE COM-LANG TO RPCRW01-COM-LANG.                           00603000
006040     MOVE COM-CURN-CODE TO RPCRW01-COM-CURNCD.                    00604000
006050     EXEC CICS LINK                                               00605000
006060         PROGRAM('RPLCRW01')                                      00606000
006070         COMMAREA(RPCRW01-MESSAGE)                                00607000
006080         LENGTH(LENGTH OF RPCRW01-MESSAGE)                        00608000
006090         RESP(WS-CICS-RESPONSE)                                   00609000
006100         NOHANDLE                                                 00610000
006110         END-EXEC.                                                00611000
006120     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00612000
006130         MOVE 'RPLCRW01 LINK FAILED' TO COM-ABMSG                 00613000
006140         MOVE WS-TR0002 TO COM-ABTRACE                            00614000
006150         MOVE WS-AB0009 TO COM-ABORT                              00615000
006160         GO TO CICS-ABORT-EXIT.                                   00616000
006170     MOVE RPCRW01-FUNCTION TO WS-FUNCTION.                        00617000
006180     IF RPCRW01-ABORT IS NOT EQUAL TO ZERO                        00618000
006190         MOVE RPCRW01-ABORT TO COM-ABORT                          00619000
006200         MOVE RPCRW01-ABTRACE TO COM-ABTRACE                      00620000
006210         MOVE RPCRW01-ABEIBFN TO COM-ABEIBFN                      00621000
006220         MOVE RPCRW01-ABEIBRCODE TO COM-ABEIBRCODE                00622000
006230         MOVE RPCRW01-ABPROGID TO COM-ABPROGID                    00623000
006240         MOVE RPCRW01-SRBMDB TO COM-SRBMDB                        00624000
006250         MOVE RPCRW01-ABTYPE TO COM-ABTYPE                        00625000
006260         GO TO CICS-ABORT-EXIT.                                   00626000
006270     MOVE RPCRW01-ABORT TO COM-ABORT.                             00627000
006280     MOVE RPCRW01-MSGNBR TO WS-MSGNBR.                            00628000
006290 CXLM-EXIT.                                                       00629000
006300     EXIT.                                                        00630000
006310******************************************************************00631000
006320 CLOSE-PANEL SECTION.                                             00632000
006330 CP-START.                                                        00633000
006340     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00634000
006350     IF COM-RETURN IS EQUAL TO 'E'                                00635000
006360         PERFORM CALL-BISPAN-RPV115K.                             00636000
006370     IF COM-RETURN IS EQUAL TO '1'                                00637000
006380         PERFORM CALL-BISPAN-RPV115.                              00638000
006390 CP-EXIT.                                                         00639000
006400     EXIT.                                                        00640000
006410******************************************************************00641000
006420 CALL-BISPAN-RPV115K SECTION.                                     00642000
006430 CBD1-START.                                                      00643000
006440     CALL 'BISPAN' USING                                          00644000
006450         BICRPSB,                                                 00645000
006460         BICRSRB,                                                 00646000
006470         BICRPAN,                                                 00647000
006480         RPV115K-PANL-DATA-BLOCK,                                 00648000
006490         RPV115K-PANL-DATA-AREA.                                  00649000
006500 CBD1-EXIT.                                                       00650000
006510     EXIT.                                                        00651000
006520******************************************************************00652000
006530 CALL-BISPAN-RPV115 SECTION.                                      00653000
006540 CBD2-START.                                                      00654000
006550     CALL 'BISPAN' USING                                          00655000
006560         BICRPSB,                                                 00656000
006570         BICRSRB,                                                 00657000
006580         BICRPAN,                                                 00658000
006590         RPV115-PANL-DATA-BLOCK,                                  00659000
006600         RPV115-PANL-DATA-AREA.                                   00660000
006610 CBD2-EXIT.                                                       00661000
006620     EXIT.                                                        00662000
006630******************************************************************00663000
006640 PANEL-GET-RPV115 SECTION.                                        00664000
006650 PANEL-GET-RPV115-START.                                          00665000
006660     MOVE 'N' TO RPV115-SW-SET-CURSOR.                            00666000
006670     MOVE PDB-RPV115-NAME TO PAN-NAME.                            00667000
006680     MOVE REQ-GET TO PAN-REQ-VERB.                                00668000
006690     CALL 'BISPAN' USING                                          00669000
006700         BICRPSB                                                  00670000
006710         BICRSRB                                                  00671000
006720         BICRPAN                                                  00672000
006730         RPV115-PANL-DATA-BLOCK,                                  00673000
006740         RPV115-PANL-DATA-AREA.                                   00674000
006750 PANEL-GET-RPV115-EXIT.                                           00675000
006760     EXIT.                                                        00676000
006770******************************************************************00677000
006780 PANEL-PUT-RPV115 SECTION.                                        00678000
006790 PANEL-PUT-RPV115-START.                                          00679000
006800     MOVE PDB-RPV115-NAME TO PAN-NAME.                            00680000
006810     MOVE REQ-PUT TO PAN-REQ-VERB.                                00681000
006820     CALL 'BISPAN' USING                                          00682000
006830         BICRPSB                                                  00683000
006840         BICRSRB                                                  00684000
006850         BICRPAN                                                  00685000
006860         RPV115-PANL-DATA-BLOCK,                                  00686000
006870         RPV115-PANL-DATA-AREA.                                   00687000
006880 PANEL-PUT-RPV115-EXIT.                                           00688000
006890     EXIT.                                                        00689000
006900******************************************************************00690000
006910 PANEL-GET-RPV115K SECTION.                                       00691000
006920 PANEL-GET-RPV115K-START.                                         00692000
006930     MOVE 'N' TO RPV115K-SW-SET-CURSOR.                           00693000
006940     MOVE PDB-RPV115K-NAME TO PAN-NAME.                           00694000
006950     MOVE REQ-GET TO PAN-REQ-VERB.                                00695000
006960     CALL 'BISPAN' USING                                          00696000
006970         BICRPSB                                                  00697000
006980         BICRSRB                                                  00698000
006990         BICRPAN                                                  00699000
007000         RPV115K-PANL-DATA-BLOCK,                                 00700000
007010         RPV115K-PANL-DATA-AREA.                                  00701000
007020 PANEL-GET-RPV115K-EXIT.                                          00702000
007030     EXIT.                                                        00703000
007040******************************************************************00704000
007050 PANEL-PUT-RPV115K SECTION.                                       00705000
007060 PANEL-PUT-RPV115K-START.                                         00706000
007070     MOVE PDB-RPV115K-NAME TO PAN-NAME.                           00707000
007080     MOVE REQ-PUT TO PAN-REQ-VERB.                                00708000
007090     CALL 'BISPAN' USING                                          00709000
007100         BICRPSB                                                  00710000
007110         BICRSRB                                                  00711000
007120         BICRPAN                                                  00712000
007130         RPV115K-PANL-DATA-BLOCK,                                 00713000
007140         RPV115K-PANL-DATA-AREA.                                  00714000
007150 PANEL-PUT-RPV115K-EXIT.                                          00715000
007160     EXIT.                                                        00716000
007170******************************************************************00717000
007180 MIC-MST-API SECTION.                                             00718000
000000 COPY MIPMSTA.                                                    00719000
007200******************************************************************00720000
007210 EDIT-ACCOUNT-KEY SECTION.                                        00721000
000000 COPY RPP014.                                                     00722000
007230******************************************************************00723000
007240 ACCOUNT-KEY-EDIT SECTION.                                        00724000
000000 COPY RPP130.                                                     00725000
007260******************************************************************00726000
007270 LEFT-JUSTIFY SECTION.                                            00727000
000000 COPY SRP068.                                                     00728000
007290******************************************************************00729000
007300 RIGHT-JUSTIFY SECTION.                                           00730000
000000 COPY SRP026.                                                     00731000
007320******************************************************************00732000
007330 PARAMETER-SEARCH SECTION.                                        00733000
000000 COPY SRP030.                                                     00734000
007350******************************************************************00735000
007360 COMPRESS-NEXTKEY SECTION.                                        00736000
000000 COPY SRP070.                                                     00737000
007380******************************************************************00738000
007390 GET-MESSAGE SECTION.                                             00739000
000000 COPY SRP071.                                                     00740000
007410******************************************************************00741000
007420 SRP170-ROUTINE SECTION.                                          00742000
000000 COPY SRP170.                                                     00743000
007440******************************************************************00744000
007450 BUILD-PFKEY-LINE SECTION.                                        00745000
000000 COPY SRP710.                                                     00746000
007470******************************************************************00747000
007480 VALIDATE-PFKEYS SECTION.                                         00748000
000000 COPY SRP711.                                                     00749000
007500******************************************************************00750000
007510 EDIT-CODASYL-DATE SECTION.                                       00751000
000000 COPY SRP087.                                                     00752000
007530******************************************************************00753000
007540 SLP096-GET-2023-RECORD SECTION.                                  00754000
000000 COPY SLP096.                                                     00755000
007560******************************************************************00756000
007570 CICS-XCTL SECTION.                                               00757000
000000 COPY SLP704.                                                     00758000
007590******************************************************************00759000
007600 CICS-RETURN-TRANSID SECTION.                                     00760000
000000 COPY SLP710.                                                     00761000
007620******************************************************************00762000
007630 TSQ-DELETE SECTION.                                              00763000
007640 TSQD-START.                                                      00764000
007650 TSQD-EXIT.                                                       00765000
007660     EXIT.                                                        00766000
007670******************************************************************00767000
007680 CICS-ABORT-EXIT SECTION.                                         00768000
000000 COPY SLP798.                                                     00769000
007700******************************************************************00770000
