000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL135.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL135 - SECONDARY SERVICES INQUIRY                         *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRCONS.                                                    00024000
000000 COPY BICRCONS.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRPAN.                                                     00028000
000000 COPY BICRPAN.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  RPV135K-PANL-DATA-BLOCK.                                     00032000
000000 COPY RPV135KW.                                                   00033000
000340 01  RPV135-PANL-DATA-BLOCK.                                      00034000
000000 COPY RPV135W.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00037000
000380     03  WS-NEXTKEY.                                              00038000
000390         05  WS-EXTID            PIC X(08).                       00039000
000400         05  WS-DELIM1           PIC X(01)       VALUE ','.       00040000
000410         05  WS-DATA.                                             00041000
000420             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00042000
000430             07  WS-DELIM2       PIC X(01)       VALUE ','.       00043000
000440             07  WS-ACCTX.                                        00044000
000450                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00045000
000460             07  WS-DELIM3       PIC X(01)       VALUE ','.       00046000
000470             07  WS-RECTYPE      PIC X(01)       VALUE SPACES.    00047000
000480         05  FILLER              PIC X(42)       VALUE SPACES.    00048000
000490     03  WS-MORE                 PIC X(05)       VALUE 'More:'.   00049000
000500     03  WS-LNKPROG1             PIC X(08)       VALUE 'RPLXXX07'.00050000
000510     03  WS-LKLGTH               PIC S9(04)      COMP             00051000
000520                                                 VALUE +4088.     00052000
000530     03  WS-DCHG-TEST            PIC X(01)       VALUE SPACE.     00053000
000540         88  WS-DCHG-PROTECT                     VALUE 'P'.       00054000
000550         88  WS-DCHG-EDITERR                     VALUE 'E'.       00055000
000560         88  WS-DCHG-HIDDEN                      VALUE 'H'.       00056000
000570     03  WS-ERROR-COUNT          PIC S9(04)      COMP             00057000
000580                                                 VALUE ZERO.      00058000
000590     03  WS-PDATE                PIC 9(08).                       00059000
000600     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00060000
000610         05  WS-PDATE-YYYY       PIC 9(04).                       00061000
000620         05  WS-PDATE-MM         PIC 9(02).                       00062000
000630         05  WS-PDATE-DD         PIC 9(02).                       00063000
000640     03  WS-SUB1                 PIC S9(04)      COMP             00064000
000650                                                 VALUE +0000.     00065000
000660     03  WS-SUB2                 PIC S9(04)      COMP             00066000
000670                                                 VALUE +0000.     00067000
000680 01  WS-LINKMSG                  PIC X(4500).                     00068000
000690 01  RPXXX11-MESSAGE.                                             00069000
000000 COPY MISCNT00      REPLACING                                     00070000
000710             ==:MICNT:== BY ==RPXXX11==.                          00071000
000000 COPY RPSXXX11.                                                   00072000
000730 01  WS-TSQAREAS.                                                 00073000
000740     03  WS-TSQITEM              PIC S9(04)      COMP             00074000
000750                                                 VALUE +0001.     00075000
000760     03  WS-TSQLGTH              PIC S9(04)      COMP             00076000
000770                                                 VALUE +4096.     00077000
000780     03  WS-TSQKEY.                                               00078000
000790         05  WS-TSQID            PIC X(04).                       00079000
000800         05  WS-TSQTRMID         PIC X(04).                       00080000
000810 01  LS-TSQAREA.                                                  00081000
000820     03  LS-TSQKEY               PIC X(08).                       00082000
000830     03  LS-TSQDATA              PIC X(4088).                     00083000
000840 01  MIWPRI-AREAS.                                                00084000
000000 COPY MIWPRI.                                                     00085000
000860 01  MIWMSTA-AREAS.                                               00086000
000000 COPY MIWMSTA.                                                    00087000
000880 01  MIMST-RECORD.                                                00088000
000000 COPY MISMST.                                                     00089000
000900 01  MI2023-RECORD.                                               00090000
000000 COPY MIS2023A.                                                   00091000
000920 01  WS-ABORTCODES.                                               00092000
000930     03  WS-AB0009               PIC S9(04)      COMP             00093000
000940                                                 VALUE +0009.     00094000
000950     03  WS-AB0106               PIC S9(04)      COMP             00095000
000960                                                 VALUE +0106.     00096000
000970     03  WS-AB2033               PIC S9(04)      COMP             00097000
000980                                                 VALUE +2033.     00098000
000990     03  WS-AB6345               PIC S9(04)      COMP             00099000
001000                                                 VALUE +6345.     00100000
001010 01  WS-TRACECODES.                                               00101000
001020     03  WS-TR0001               PIC S9(04)      COMP             00102000
001030                                                 VALUE +0001.     00103000
001040     03  WS-TR0002               PIC S9(04)      COMP             00104000
001050                                                 VALUE +0002.     00105000
001060 01  SLW096-AREAS.                                                00106000
000000 COPY SLW096.                                                     00107000
001080 01  RPW014-AREAS.                                                00108000
000000 COPY RPW014.                                                     00109000
001100 01  RPW033-AREAS.                                                00110000
000000 COPY RPW033.                                                     00111000
001120 01  RPW130-AREAS.                                                00112000
000000 COPY RPW130.                                                     00113000
001140 01  SRW000-AREAS.                                                00114000
000000 COPY SRW000.                                                     00115000
001160 01  SRW025-AREAS.                                                00116000
000000 COPY SRW025.                                                     00117000
001180 01  SRW030-AREAS.                                                00118000
000000 COPY SRW030.                                                     00119000
001200 01  SRW031-AREAS.                                                00120000
000000 COPY SRW031.                                                     00121000
001220 01  SRW105-AREAS.                                                00122000
000000 COPY SRW105.                                                     00123000
001240 01  SRW161-AREAS.                                                00124000
000000 COPY SRW161.                                                     00125000
001260 01  SRW166-AREAS.                                                00126000
000000 COPY SRW166.                                                     00127000
001280 01  SRW170-AREAS.                                                00128000
000000 COPY SRW170.                                                     00129000
001300 COPY DFHAID.                                                     00130000
001310******************************************************************00131000
001320 LINKAGE SECTION.                                                 00132000
001330 01  DFHCOMMAREA.                                                 00133000
000000 COPY SLS1112.                                                    00134000
001350     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00135000
001360         05  COM-EDIT-DATE       PIC X(10).                       00136000
001370         05  COM-KEY-INFO.                                        00137000
001380             07  COM-KEY-DATA.                                    00138000
001390                 09  COM-SK-INST PIC 9(04).                       00139000
001400                 09  COM-SK-PRODCODE                              00140000
001410                                 PIC X(06).                       00141000
001420                 09  COM-SK-ACCOUNT                               00142000
001430                                 PIC X(18).                       00143000
001440                 09  COM-SK-ACCOUNT-N                             00144000
001450                         REDEFINES COM-SK-ACCOUNT                 00145000
001460                                 PIC 9(18).                       00146000
001470         05  COM-NBR-OCCURS      PIC S9(05)      COMP-3.          00147000
001480         05  COM-END-FILE-INST   PIC X(01).                       00148000
001490         05  COM-PANEL-ACTION    PIC X(01).                       00149000
001500             88  INITIAL-PANEL                   VALUE ' '.       00150000
001510             88  EDIT-PANEL                      VALUE 'E'.       00151000
001520         05  COM-FROM-PANEL      PIC X(01).                       00152000
001530             88  FROM-KEY-PANEL                  VALUE 'K'.       00153000
001540             88  FROM-INFO-PANEL                 VALUE 'I'.       00154000
001550             88  FROM-HELP                       VALUE 'H'.       00155000
001560             88  FROM-BREAKAWAY                  VALUE 'B'.       00156000
001570         05  COM-KEY-FORMATTEDACCT                                00157000
001580                                 PIC X(22).                       00158000
001590         05  COM-KEY-MSGNBR      PIC X(06).                       00159000
001600         05  COM-KEY-COMMAND     PIC X(50).                       00160000
001610******************************************************************00161000
001620*01  SLW096-2023RECORDS.                                          00162000
000000 COPY SLW096L.                                                    00163000
001640******************************************************************00164000
001650 PROCEDURE DIVISION.                                              00165000
001660******************************************************************00166000
001670 ENTRY-ROUTINE SECTION.                                           00167000
001680     MOVE 'RPL135' TO COM-ABPROGID.                               00168000
000000 COPY SLP771.                                                     00169000
001700******************************************************************00170000
001710 TRANSACTION-CLEAN-UP SECTION.                                    00171000
001720 TCU-START.                                                       00172000
001730 TCU-EXIT.                                                        00173000
001740     EXIT.                                                        00174000
001750******************************************************************00175000
001760 CICS-HANDLE-CONDITION SECTION.                                   00176000
000000 COPY SLP772.                                                     00177000
001780     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00178000
001790         GO TO CTSRI-EXIT.                                        00179000
001800     MOVE WS-AB2033 TO COM-ABORT.                                 00180000
001810     MOVE WS-TR0001 TO COM-ABTRACE.                               00181000
001820     GO TO ABORT-EXIT.                                            00182000
001830 CHC-EXIT.                                                        00183000
001840     EXIT.                                                        00184000
001850******************************************************************00185000
001860 ROUTING-ROUTINE SECTION.                                         00186000
001870 RR-START.                                                        00187000
001880     MOVE LOW-VALUES TO RPXXX11-MESSAGE.                          00188000
001890     MOVE LOW-VALUES TO RPV135-PANL-DATA-AREA.                    00189000
001900     MOVE LOW-VALUES TO RPV135K-PANL-DATA-AREA.                   00190000
001910     MOVE ALL ZEROS TO WS-MSGNBR.                                 00191000
001920     MOVE 'RP00' TO WS-TSQFILEID.                                 00192000
001930     MOVE 'RPI' TO WS-TSQSYSID.                                   00193000
001940     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00194000
001950     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00195000
001960     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00196000
001970         MOVE COM-PAN TO BICRPAN                                  00197000
001980         MOVE COM-PSB TO BICRPSB                                  00198000
001990         MOVE COM-SRB TO BICRSRB                                  00199000
002000     ELSE                                                         00200000
002010         MOVE '1' TO BPSB-LEVEL.                                  00201000
002020     IF COM-RETURN IS EQUAL TO 'B'                                00202000
002030         GO TO BREAKAWAY-RETURN.                                  00203000
002040     IF COM-RETURN IS EQUAL TO '0'                                00204000
002050         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00205000
002060         MOVE SPACES TO COM-WORKAREAS                             00206000
002070         MOVE '1' TO SRB-VERSION                                  00207000
002080         MOVE 'IPRP' TO SRB-APPL-ID                               00208000
002090         MOVE 'RPL135' TO SRB-PROG-ID                             00209000
002100         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00210000
002110         MOVE 'P' TO PAN-TYPE                                     00211000
002120         MOVE SPACE TO PAN-OVERLAY                                00212000
002130         MOVE SPACE TO PAN-CLOSE                                  00213000
002140         MOVE SPACE TO PAN-ALARM                                  00214000
002150         MOVE SPACE TO PAN-CURSOR-PAN                             00215000
002160         MOVE SPACE TO PAN-CURSOR-FLD                             00216000
002170         MOVE SPACE TO PAN-SET-FLD                                00217000
002180         MOVE SPACE TO PAN-SET-VID                                00218000
002190         MOVE SPACE TO PAN-SET-EMP                                00219000
002200         MOVE PDB-RPV135K-NAME TO PAN-NAME                        00220000
002210         PERFORM PANEL-INIT                                       00221000
002220         MOVE BICRPAN TO COM-PAN                                  00222000
002230         MOVE BICRPSB TO COM-PSB                                  00223000
002240         MOVE BICRSRB TO COM-SRB                                  00224000
002250         PERFORM INITIALIZE-DATE                                  00225000
002260         GO TO PANEL-ROUTER.                                      00226000
002270     PERFORM PANEL-NAME-SET.                                      00227000
002280     IF COM-HELPSW IS EQUAL TO 'Y'                                00228000
002290         GO TO HELP-RETURN.                                       00229000
002300     PERFORM PANEL-RECEIVE.                                       00230000
002310     PERFORM PANEL-DATA-GET.                                      00231000
002320     PERFORM PANEL-PFKEY-SET.                                     00232000
002330     PERFORM VALIDATE-PFKEYS.                                     00233000
002340     IF EIBAID IS EQUAL TO DFHPF1                                 00234000
002350         GO TO GET-HELP.                                          00235000
002360     IF EIBAID IS EQUAL TO DFHPF11                                00236000
002370         GO TO BREAK-AWAY.                                        00237000
002380     IF (COM-RETURN IS EQUAL TO 'E'                               00238000
002390         OR COM-RETURN IS EQUAL TO '1')                           00239000
002400         AND (EIBAID IS EQUAL TO DFHPF2                           00240000
002410         OR EIBAID IS EQUAL TO DFHPF3                             00241000
002420         OR EIBAID IS EQUAL TO DFHPF4                             00242000
002430         OR EIBAID IS EQUAL TO DFHPF7                             00243000
002440         OR EIBAID IS EQUAL TO DFHPF8                             00244000
002450         OR EIBAID IS EQUAL TO DFHPF12)                           00245000
002460         GO TO CLOSE-TRANSACTION.                                 00246000
002470     IF COM-RETURN IS EQUAL TO '0'                                00247000
002480         OR COM-RETURN IS EQUAL TO 'E'                            00248000
002490         OR COM-RETURN IS EQUAL TO '1'                            00249000
002500         GO TO PANEL-ROUTER.                                      00250000
002510 RR-END.                                                          00251000
002520     GO TO CLOSE-TRANSACTION.                                     00252000
002530 RR-EXIT.                                                         00253000
002540     EXIT.                                                        00254000
002550******************************************************************00255000
002560 INITIALIZE-DATE SECTION.                                         00256000
002570 ID-START.                                                        00257000
002580     MOVE COM-DATE TO WS-CURDATE8.                                00258000
002590     MOVE '-' TO WS-CD8DSH1.                                      00259000
002600     MOVE '-' TO WS-CD8DSH2.                                      00260000
002610     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00261000
002620 ID-EXIT.                                                         00262000
002630     EXIT.                                                        00263000
002640******************************************************************00264000
002650 PANEL-NAME-SET SECTION.                                          00265000
002660 PNS-START.                                                       00266000
002670     IF COM-RETURN IS EQUAL TO '0'                                00267000
002680         MOVE PDB-RPV135K-NAME TO PAN-NAME.                       00268000
002690     IF COM-RETURN IS EQUAL TO 'E'                                00269000
002700         MOVE PDB-RPV135K-NAME TO PAN-NAME.                       00270000
002710     IF COM-RETURN IS EQUAL TO '1'                                00271000
002720         MOVE PDB-RPV135-NAME TO PAN-NAME.                        00272000
002730 PNS-EXIT.                                                        00273000
002740     EXIT.                                                        00274000
002750******************************************************************00275000
002760 PANEL-DATA-GET SECTION.                                          00276000
002770 PDG-START.                                                       00277000
002780     IF COM-RETURN IS EQUAL TO '0'                                00278000
002790         PERFORM PANEL-GET-RPV135K.                               00279000
002800     IF COM-RETURN IS EQUAL TO 'E'                                00280000
002810         PERFORM PANEL-GET-RPV135K                                00281000
002820         MOVE RPV135K-COMMAND TO WS-NEXTKEY                       00282000
002830         MOVE PDB-RPV135K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00283000
002840     IF COM-RETURN IS EQUAL TO '1'                                00284000
002850         PERFORM PANEL-GET-RPV135                                 00285000
002860         MOVE RPV135-COMMAND TO WS-NEXTKEY                        00286000
002870         MOVE PDB-RPV135-COMMAND-DCHG TO WS-COMMAND-DCHG.         00287000
002880 PDG-EXIT.                                                        00288000
002890     EXIT.                                                        00289000
002900******************************************************************00290000
002910 PANEL-PFKEY-SET SECTION.                                         00291000
002920 PPS-START.                                                       00292000
002930 PPS-EXIT.                                                        00293000
002940     EXIT.                                                        00294000
002950******************************************************************00295000
002960 PANEL-ROUTER SECTION.                                            00296000
002970 PR-START.                                                        00297000
002980     IF COM-RETURN IS EQUAL TO '0'                                00298000
002990         GO TO PROCESS-KEY-PANEL.                                 00299000
003000     IF COM-RETURN IS EQUAL TO 'E'                                00300000
003010         GO TO PROCESS-KEY-PANEL.                                 00301000
003020     IF COM-RETURN IS EQUAL TO '1'                                00302000
003030         GO TO PROCESS-INFO-PANEL.                                00303000
003040     GO TO CLOSE-TRANSACTION.                                     00304000
003050 PR-EXIT.                                                         00305000
003060     EXIT.                                                        00306000
003070******************************************************************00307000
003080 HELP-RETURN SECTION.                                             00308000
000000 COPY SRP074.                                                     00309000
003100******************************************************************00310000
003110 HELP-RETURN-FINISH SECTION.                                      00311000
003120 HRF-START.                                                       00312000
003130     PERFORM PANEL-DATA-GET.                                      00313000
003140     MOVE 'H' TO COM-FROM-PANEL.                                  00314000
003150     GO TO PANEL-ROUTER.                                          00315000
003160 HRF-EXIT.                                                        00316000
003170     EXIT.                                                        00317000
003180******************************************************************00318000
003190 HELP-MISSING-FINISH SECTION.                                     00319000
003200 HMF-START.                                                       00320000
003210     MOVE 'H' TO COM-FROM-PANEL.                                  00321000
003220     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00322000
003230     GO TO PANEL-ROUTER.                                          00323000
003240 HMF-EXIT.                                                        00324000
003250     EXIT.                                                        00325000
003260******************************************************************00326000
003270 BREAK-AWAY SECTION.                                              00327000
000000 COPY SRP0752.                                                    00328000
003290******************************************************************00329000
003300 BREAKAWAY-RETURN-FINISH SECTION.                                 00330000
003310 BRF-START.                                                       00331000
003320     PERFORM PANEL-DATA-GET.                                      00332000
003330     MOVE 'B' TO COM-FROM-PANEL.                                  00333000
003340     GO TO PANEL-ROUTER.                                          00334000
003350 BRF-EXIT.                                                        00335000
003360     EXIT.                                                        00336000
003370******************************************************************00337000
003380 PROCESS-KEY-PANEL SECTION.                                       00338000
003390 PKP-START.                                                       00339000
003400     IF INITIAL-PANEL                                             00340000
003410         MOVE COM-NEXTKEY TO COM-EXTERNALID                       00341000
003420         GO TO PKP-COM-INIT.                                      00342000
003430     IF EDIT-PANEL                                                00343000
003440         AND FROM-INFO-PANEL                                      00344000
003450         MOVE SPACE TO COM-FROM-PANEL                             00345000
003460         GO TO PKP-RELOAD-PANEL.                                  00346000
003470 PKP-COM-INIT.                                                    00347000
003480     MOVE COM-NEXTKEY TO SR-PSLIST.                               00348000
003490     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00349000
003500         GO TO PKP-SEND-PANEL.                                    00350000
003510 PKP-BEGIN-EDITS.                                                 00351000
003520     IF EDIT-PANEL                                                00352000
003530         MOVE RPV135K-PRODCD TO COM-SK-PRODCODE                   00353000
003540         MOVE RPV135K-ACCOUNT TO COM-SK-ACCOUNT                   00354000
003550         GO TO PKP-RETURN-EDITS.                                  00355000
003560     PERFORM PARAMETER-SEARCH.                                    00356000
003570     MOVE SR-PSPARM TO COM-EXTID.                                 00357000
003580     MOVE SR-PSPARM TO COM-EXTERNALID.                            00358000
003590     PERFORM PARAMETER-SEARCH.                                    00359000
003600     MOVE SR-PSPARM TO COM-SK-PRODCODE.                           00360000
003610     PERFORM PARAMETER-SEARCH.                                    00361000
003620     MOVE SR-PSPARM TO COM-SK-ACCOUNT.                            00362000
003630 PKP-RETURN-EDITS.                                                00363000
003640     IF COM-SK-PRODCODE IS EQUAL TO SPACE                         00364000
003650         MOVE LOW-VALUE TO COM-SK-PRODCODE.                       00365000
003660     IF COM-SK-ACCOUNT IS EQUAL TO SPACE                          00366000
003670         MOVE LOW-VALUE TO COM-SK-ACCOUNT.                        00367000
003680     IF COM-SK-PRODCODE IS EQUAL TO LOW-VALUE                     00368000
003690         AND COM-SK-ACCOUNT IS EQUAL TO LOW-VALUE                 00369000
003700         GO TO PKP-RETURN-CONT.                                   00370000
003710     IF COM-SK-PRODCODE IS EQUAL TO LOW-VALUE                     00371000
003720         MOVE '000002' TO WS-MSGNBR                               00372000
003730         GO TO PKP-RETURN-CONT.                                   00373000
003740     PERFORM EDIT-ACCOUNT-KEY.                                    00374000
003750 PKP-RETURN-CONT.                                                 00375000
003760     IF INITIAL-PANEL                                             00376000
003770         AND COM-SK-PRODCODE IS EQUAL TO LOW-VALUE                00377000
003780         AND COM-SK-ACCOUNT IS EQUAL TO LOW-VALUE                 00378000
003790         MOVE '000001' TO WS-MSGNBR                               00379000
003800         GO TO PKP-SEND-PANEL.                                    00380000
003810     MOVE COM-SK-PRODCODE TO COM-PRODCODE.                        00381000
003820     MOVE COM-SK-ACCOUNT TO COM-ACCOUNTALPHA.                     00382000
003830     IF FROM-BREAKAWAY                                            00383000
003840         OR FROM-HELP                                             00384000
003850         GO TO PKP-RELOAD-PANEL.                                  00385000
003860     IF COM-SK-PRODCODE IS EQUAL TO LOW-VALUE                     00386000
003870         AND COM-SK-ACCOUNT IS EQUAL TO LOW-VALUE                 00387000
003880         GO TO PKP-EDITS-READY.                                   00388000
003890     IF COM-SK-ACCOUNT-N IS NUMERIC                               00389000
003900         MOVE COM-SK-ACCOUNT-N TO COM-ACCOUNT                     00390000
003910     ELSE                                                         00391000
003920         MOVE ZERO TO COM-ACCOUNT.                                00392000
003930     IF WS-MSGNBR IS NOT EQUAL TO ZERO                            00393000
003940         GO TO PKP-RELOAD-PANEL.                                  00394000
003950 PKP-EDITS-READY.                                                 00395000
003960     MOVE SPACE TO COM-PANEL-ACTION.                              00396000
003970     MOVE '1' TO COM-RETURN.                                      00397000
003980     MOVE 'K' TO COM-FROM-PANEL.                                  00398000
003990     GO TO PANEL-ROUTER.                                          00399000
004000 PKP-RELOAD-PANEL.                                                00400000
004010     IF COM-SK-PRODCODE IS EQUAL TO SPACES                        00401000
004020         MOVE LOW-VALUES TO RPV135K-PRODCD                        00402000
004030     ELSE                                                         00403000
004040         MOVE COM-SK-PRODCODE TO RPV135K-PRODCD.                  00404000
004050     IF COM-SK-ACCOUNT IS EQUAL TO SPACES                         00405000
004060         OR COM-SK-ACCOUNT IS EQUAL TO ZEROS                      00406000
004070         MOVE LOW-VALUES TO RPV135K-ACCOUNT                       00407000
004080     ELSE                                                         00408000
004090         MOVE COM-SK-ACCOUNT TO RPV135K-ACCOUNT.                  00409000
004100 PKP-SEND-PANEL.                                                  00410000
004110     MOVE PDB-RPV135K-NAME TO PAN-NAME.                           00411000
004120     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00412000
004130     IF FROM-HELP                                                 00413000
004140         OR FROM-BREAKAWAY                                        00414000
004150         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD.                      00415000
004160     IF WS-CURSOR-FIELD IS EQUAL TO SPACE                         00416000
004170         MOVE PDB-RPV135K-PRODCD TO PAN-SET-FLD                   00417000
004180     ELSE                                                         00418000
004190         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                     00419000
004200     PERFORM CALL-BISPAN-RPV135K.                                 00420000
004210     MOVE COM-OPERID TO RPV135K-OPERID.                           00421000
004220     MOVE COM-INST TO RPV135K-INST.                               00422000
004230     MOVE COM-EDIT-DATE TO RPV135K-SYSDATE.                       00423000
004240     IF RPV135K-PRODCD IS EQUAL TO SPACES                         00424000
004250         MOVE LOW-VALUES TO RPV135K-PRODCD.                       00425000
004260     MOVE RPV135K-ACCOUNT TO SR-JUSTIFYIN.                        00426000
004270     MOVE +18 TO SR-JLGTH.                                        00427000
004280     PERFORM LEFT-JUSTIFY.                                        00428000
004290     MOVE SR-JUSTIFYOUT TO RPV135K-ACCOUNT.                       00429000
004300     IF RPV135K-ACCOUNT IS EQUAL TO SPACES                        00430000
004310         MOVE LOW-VALUES TO RPV135K-ACCOUNT.                      00431000
004320     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00432000
004330         MOVE WS-HELPMSG TO WS-MSGNBR.                            00433000
004340     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00434000
004350         MOVE '000027' TO WS-MSGNBR                               00435000
004360     ELSE                                                         00436000
004370         PERFORM BUILD-NEXTKEY                                    00437000
004380         PERFORM COMPRESS-NEXTKEY                                 00438000
004390         MOVE WS-NEXTKEY TO RPV135K-COMMAND.                      00439000
004400     IF FROM-BREAKAWAY                                            00440000
004410         OR FROM-HELP                                             00441000
004420         MOVE SPACE TO COM-FROM-PANEL                             00442000
004430         MOVE COM-KEY-COMMAND TO RPV135K-COMMAND                  00443000
004440         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00444000
004450     ELSE                                                         00445000
004460         MOVE WS-NEXTKEY TO COM-KEY-COMMAND                       00446000
004470         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00447000
004480     MOVE 'E' TO COM-RETURN.                                      00448000
004490     PERFORM GET-MESSAGE.                                         00449000
004500     MOVE WS-MESSAGE TO RPV135K-MSGLINE.                          00450000
004510     PERFORM PANEL-PFKEY-SET.                                     00451000
004520     PERFORM BUILD-PFKEY-LINE.                                    00452000
004530     MOVE WS-PFLINE1 TO RPV135K-PFLINE1.                          00453000
004540     MOVE WS-PFLINE2 TO RPV135K-PFLINE2.                          00454000
004550     PERFORM PANEL-PUT-RPV135K.                                   00455000
004560     PERFORM PANEL-SEND.                                          00456000
004570     MOVE 'E' TO COM-PANEL-ACTION.                                00457000
004580     MOVE COM-INTID TO WS-TRANSID.                                00458000
004590     GO TO CICS-RETURN-TRANSID.                                   00459000
004600 PKP-EXIT.                                                        00460000
004610     EXIT.                                                        00461000
004620******************************************************************00462000
004630 PROCESS-INFO-PANEL SECTION.                                      00463000
004640 PIP-START.                                                       00464000
004650     IF FROM-HELP                                                 00465000
004660         OR FROM-BREAKAWAY                                        00466000
004670         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00467000
004680         MOVE PAN-CURSOR-FLD TO WS-CURSOR-FIELD                   00468000
004690         GO TO PIP-SEND-PANEL.                                    00469000
004700     MOVE 'E' TO COM-END.                                         00470000
004710     IF INITIAL-PANEL                                             00471000
004720         GO TO PIP-CONTINUE.                                      00472000
004730     MOVE COM-NEXTKEY TO WS-NEXTKEY.                              00473000
004740 PIP-PFKEYS.                                                      00474000
004750     MOVE ALL ZEROS TO WS-MSGNBR.                                 00475000
004760     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00476000
004770         MOVE PDB-RPV135-COMMAND TO WS-CURSOR-FIELD               00477000
004780         GO TO PIP-SEND-PANEL.                                    00478000
004790     IF EIBAID IS EQUAL TO DFHENTER                               00479000
004800         MOVE '2' TO COM-RETURN                                   00480000
004810         MOVE SPACE TO COM-PANEL-ACTION                           00481000
004820         GO TO PANEL-ROUTER.                                      00482000
004830     GO TO PIP-SEND-PANEL.                                        00483000
004840 PIP-CONTINUE.                                                    00484000
004850     PERFORM RPXXX11-LINK-MESSAGE.                                00485000
004860     MOVE RPXXX11-END-FILE-INST TO COM-END-FILE-INST.             00486000
004870     MOVE RPXXX11-NBR-OCCURS TO COM-NBR-OCCURS.                   00487000
004880 PIP-RPXXX11-RETURN-CHECK.                                        00488000
004890     IF RPXXX11-RETURN IS EQUAL TO 'E'                            00489000
004900         MOVE 'E' TO COM-RETURN                                   00490000
004910         MOVE 'E' TO COM-PANEL-ACTION                             00491000
004920         MOVE 'I' TO COM-FROM-PANEL                               00492000
004930         GO TO PANEL-ROUTER.                                      00493000
004940     IF INITIAL-PANEL                                             00494000
004950         AND RPXXX11-END-FILE-INST IS EQUAL TO 'E'                00495000
004960         AND RPXXX11-NBR-OCCURS IS EQUAL TO ZEROS                 00496000
004970         MOVE 'E' TO COM-RETURN                                   00497000
004980         MOVE 'E' TO COM-PANEL-ACTION                             00498000
004990         MOVE 'I' TO COM-FROM-PANEL                               00499000
005000         MOVE '500057' TO WS-MSGNBR                               00500000
005010         GO TO PANEL-ROUTER.                                      00501000
005020 PIP-PAGING-CONTROLS.                                             00502000
005030     IF COM-PRODCODE IS EQUAL TO LOW-VALUES                       00503000
005040         MOVE RPXXX11-SK-PRODCODE TO COM-PRODCODE                 00504000
005050         MOVE RPXXX11-SK-PRODCODE TO COM-SK-PRODCODE              00505000
005060         MOVE RPXXX11-SK-ACCOUNT TO COM-SK-ACCOUNT.               00506000
005070 PIP-BUILD-MAINT-PANEL.                                           00507000
005080     PERFORM BUILD-MAINT-PANEL.                                   00508000
005090 PIP-SEND-PANEL.                                                  00509000
005100     MOVE PDB-RPV135-NAME TO PAN-NAME.                            00510000
005110     MOVE COM-INST TO RPV135-INST.                                00511000
005120     MOVE COM-OPERID TO RPV135-OPERID.                            00512000
005130     MOVE COM-PRODCODE TO RPV135-PRODCD.                          00513000
005140     MOVE COM-SK-ACCOUNT TO RPV135-ACCOUNT.                       00514000
005150     IF FROM-HELP                                                 00515000
005160         OR FROM-BREAKAWAY                                        00516000
005170         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00517000
005180         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00518000
005190         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00519000
005200     ELSE                                                         00520000
005210         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD                      00521000
005220         MOVE WS-CURSOR-OCC TO PAN-SET-OCC.                       00522000
005230     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00523000
005240     PERFORM CALL-BISPAN-RPV135.                                  00524000
005250     MOVE COM-INST TO RPV135-INST.                                00525000
005260     MOVE COM-OPERID TO RPV135-OPERID.                            00526000
005270     MOVE COM-EDIT-DATE TO RPV135-SYSDATE.                        00527000
005280     IF WS-MSGNBR NOT NUMERIC                                     00528000
005290         MOVE ZERO TO WS-MSGNBR.                                  00529000
005300     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00530000
005310         MOVE WS-HELPMSG TO WS-MSGNBR.                            00531000
005320     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00532000
005330         MOVE '000027' TO WS-MSGNBR                               00533000
005340     ELSE                                                         00534000
005350         PERFORM BUILD-NEXTKEY                                    00535000
005360         PERFORM COMPRESS-NEXTKEY                                 00536000
005370         MOVE WS-NEXTKEY TO RPV135-COMMAND.                       00537000
005380     IF FROM-HELP                                                 00538000
005390         OR FROM-BREAKAWAY                                        00539000
005400         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00540000
005410         MOVE COM-KEY-COMMAND TO RPV135-COMMAND                   00541000
005420         MOVE SPACE TO COM-FROM-PANEL                             00542000
005430     ELSE                                                         00543000
005440         MOVE RPV135-COMMAND TO COM-KEY-COMMAND                   00544000
005450         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00545000
005460     PERFORM GET-MESSAGE.                                         00546000
005470     MOVE WS-MESSAGE TO RPV135-MSGLINE.                           00547000
005480     PERFORM PANEL-PFKEY-SET.                                     00548000
005490     PERFORM BUILD-PFKEY-LINE.                                    00549000
005500     MOVE WS-PFLINE1 TO RPV135-PFLINE1.                           00550000
005510     MOVE WS-PFLINE2 TO RPV135-PFLINE2.                           00551000
005520     PERFORM PANEL-PUT-RPV135.                                    00552000
005530     PERFORM PANEL-SEND.                                          00553000
005540     MOVE '1' TO COM-RETURN.                                      00554000
005550     MOVE 'E' TO COM-PANEL-ACTION.                                00555000
005560     MOVE 'I' TO COM-FROM-PANEL.                                  00556000
005570     MOVE COM-INTID TO WS-TRANSID.                                00557000
005580     GO TO CICS-RETURN-TRANSID.                                   00558000
005590 PIP-EXIT.                                                        00559000
005600     EXIT.                                                        00560000
005610******************************************************************00561000
005620 BUILD-MAINT-PANEL SECTION.                                       00562000
005630 BMP-START.                                                       00563000
005640     MOVE +0 TO WS-SUB1.                                          00564000
005650     MOVE +0 TO WS-SUB2.                                          00565000
005660 BMP-LOOP.                                                        00566000
005670     ADD +0001 TO WS-SUB1.                                        00567000
005680     IF WS-SUB1 IS GREATER THAN +0010                             00568000
005690         GO TO BMP-EXIT.                                          00569000
005700     ADD +0001 TO WS-SUB2.                                        00570000
005710     IF WS-SUB2 IS GREATER THAN RPXXX11-NBR-OCCURS                00571000
005720         PERFORM PANEL-SPACE                                      00572000
005730         GO TO BMP-EXIT.                                          00573000
005740     MOVE RPXXX11-SECSVC (WS-SUB2) TO RPV135-SERVICEA.            00574000
005750     MOVE RPXXX11-DESC (WS-SUB2) TO RPV135-DESCA.                 00575000
005760     ADD +0001 TO WS-SUB2.                                        00576000
005770     MOVE RPXXX11-SECSVC (WS-SUB2) TO RPV135-SERVICEB.            00577000
005780     MOVE RPXXX11-DESC (WS-SUB2) TO RPV135-DESCB.                 00578000
005790     MOVE PDB-RPV135-NAME TO PAN-NAME.                            00579000
005800     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00580000
005810     PERFORM PANEL-PUT-OCCUR-RPV135.                              00581000
005820     GO TO BMP-LOOP.                                              00582000
005830 BMP-EXIT.                                                        00583000
005840     EXIT.                                                        00584000
005850******************************************************************00585000
005860 PANEL-SPACE SECTION.                                             00586000
005870 PS-START.                                                        00587000
005880     MOVE SPACES TO RPV135-SERVICEA.                              00588000
005890     MOVE SPACES TO RPV135-DESCA.                                 00589000
005900     MOVE SPACES TO RPV135-SERVICEB.                              00590000
005910     MOVE SPACES TO RPV135-DESCB.                                 00591000
005920     PERFORM PANEL-PUT-OCCUR-RPV135.                              00592000
005930     IF PAN-STAT IS EQUAL TO STAT-END                             00593000
005940         GO TO PS-EXIT.                                           00594000
005950     GO TO PS-START.                                              00595000
005960 PS-EXIT.                                                         00596000
005970     EXIT.                                                        00597000
005980******************************************************************00598000
005990 MORE-DATA-PANELS SECTION.                                        00599000
006000 MDP-START.                                                       00600000
006010     GO TO PANEL-ROUTER.                                          00601000
006020 MDP-EXIT.                                                        00602000
006030     EXIT.                                                        00603000
006040******************************************************************00604000
006050 CLOSE-TRANSACTION SECTION.                                       00605000
000000 COPY SRP0722.                                                    00606000
006070******************************************************************00607000
006080 PANEL-INIT SECTION.                                              00608000
000000 COPY SRP073.                                                     00609000
006100******************************************************************00610000
006110 BUILD-NEXTKEY SECTION.                                           00611000
006120 BXN-START.                                                       00612000
006130     MOVE SPACES TO WS-NEXTKEY.                                   00613000
006140     MOVE ',' TO WS-DELIM1.                                       00614000
006150     MOVE ',' TO WS-DELIM2.                                       00615000
006160     MOVE ',' TO WS-DELIM3.                                       00616000
006170     MOVE COM-SK-PRODCODE TO WS-PRODCODE.                         00617000
006180     IF COM-SK-ACCOUNT IS NOT NUMERIC                             00618000
006190         MOVE COM-SK-ACCOUNT TO WS-ACCTX                          00619000
006200     ELSE                                                         00620000
006210         MOVE COM-SK-ACCOUNT-N TO WS-ACCT.                        00621000
006220     MOVE COM-EXTERNALID TO WS-EXTID.                             00622000
006230 BXN-EXIT.                                                        00623000
006240     EXIT.                                                        00624000
006250******************************************************************00625000
006260 ABORT-EXIT SECTION.                                              00626000
006270 AE-START.                                                        00627000
006280     MOVE EIBFN TO COM-ABEIBFN.                                   00628000
006290     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00629000
006300     GO TO CICS-ABORT-EXIT.                                       00630000
006310 AE-EXIT.                                                         00631000
006320     EXIT.                                                        00632000
006330******************************************************************00633000
006340 RPXXX11-LINK-MESSAGE SECTION.                                    00634000
006350 CRLM-START.                                                      00635000
006360     MOVE 'Y' TO RPXXX11-GLOBAL-CLOSE.                            00636000
006370     MOVE WS-FILEOPTIONS TO RPXXX11-FILEOPTS.                     00637000
006380     MOVE COM-RETURN TO RPXXX11-RETURN.                           00638000
006390     MOVE COM-DATE TO RPXXX11-DATE.                               00639000
006400     MOVE COM-MODELID TO RPXXX11-MODELID.                         00640000
006410     MOVE COM-SECALT TO RPXXX11-SECALT.                           00641000
006420     MOVE COM-EXTERNALID TO RPXXX11-EXTERNALID.                   00642000
006430     MOVE COM-EIBTRMID TO RPXXX11-TERMID.                         00643000
006440     MOVE COM-WKUNAME TO RPXXX11-WORKID.                          00644000
006450     MOVE COM-TRANSTART TO RPXXX11-TRANSTART.                     00645000
006460     MOVE COM-UPDATE TO RPXXX11-UPDATE.                           00646000
006470     MOVE COM-APPLSEQ TO RPXXX11-APPLSEQ.                         00647000
006480     MOVE WS-RPSAPPLNBR TO RPXXX11-APPL.                          00648000
006490     MOVE COM-INST TO RPXXX11-SK-INST.                            00649000
006500     MOVE COM-INST TO COM-SK-INST.                                00650000
006510     MOVE COM-PRODCODE TO RPXXX11-SK-PRODCODE.                    00651000
006520     MOVE COM-SK-ACCOUNT TO RPXXX11-SK-ACCOUNT.                   00652000
006530     MOVE ALL 'N' TO RPXXX11-DCHG.                                00653000
006540     INITIALIZE RPXXX11-DATA-GRP.                                 00654000
006550     MOVE 'VKL' TO RPXXX11-APIFUNC.                               00655000
006560     IF RPXXX11-SK-INST IS GREATER THAN ZEROS                     00656000
006570         MOVE 'Y' TO RPXXX11-SK-INST-DCHG.                        00657000
006580     IF RPXXX11-SK-PRODCODE IS NOT EQUAL TO SPACES                00658000
006590         AND RPXXX11-SK-PRODCODE IS NOT EQUAL TO LOW-VALUES       00659000
006600         MOVE 'Y' TO RPXXX11-SK-PRODCODE-DCHG.                    00660000
006610     IF RPXXX11-SK-ACCOUNT IS NOT EQUAL TO SPACES                 00661000
006620         AND RPXXX11-SK-ACCOUNT IS NOT EQUAL TO LOW-VALUES        00662000
006630         MOVE 'Y' TO RPXXX11-SK-ACCOUNT-DCHG.                     00663000
006640     IF RPXXX11-SK-MODEL IS EQUAL TO LOW-VALUES                   00664000
006650         MOVE SPACES TO RPXXX11-SK-MODEL                          00665000
006660         MOVE 'N' TO RPXXX11-SK-MODEL-DCHG.                       00666000
006670     MOVE 'Y' TO RPXXX11-NBR-OCCURS-DCHG.                         00667000
006680     MOVE +20 TO RPXXX11-NBR-OCCURS.                              00668000
006690     MOVE 'N' TO RPXXX11-END-FILE-INST-DCHG.                      00669000
006700     MOVE SPACES TO RPXXX11-END-FILE-INST.                        00670000
006710     MOVE COM-OPERID TO RPXXX11-OPERID.                           00671000
006720     MOVE COM-LANG TO RPXXX11-COM-LANG.                           00672000
006730     MOVE COM-CURN-CODE TO RPXXX11-COM-CURNCD.                    00673000
006740     MOVE COM-INST-OPTS TO RPXXX11-INST-OPTS.                     00674000
006750     EXEC CICS LINK                                               00675000
006760         PROGRAM('RPLXXX11')                                      00676000
006770         COMMAREA(RPXXX11-MESSAGE)                                00677000
006780         LENGTH(LENGTH OF RPXXX11-MESSAGE)                        00678000
006790         RESP(WS-CICS-RESPONSE)                                   00679000
006800         END-EXEC.                                                00680000
006810     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00681000
006820         MOVE 'RPLXXX11 LINK FAILED' TO COM-ABMSG                 00682000
006830         MOVE WS-TR0002 TO COM-ABTRACE                            00683000
006840         MOVE WS-AB0009 TO COM-ABORT                              00684000
006850         GO TO CICS-ABORT-EXIT.                                   00685000
006860     MOVE RPXXX11-FUNCTION TO WS-FUNCTION.                        00686000
006870     IF RPXXX11-ABORT IS NOT EQUAL TO ZERO                        00687000
006880         MOVE RPXXX11-ABORT TO COM-ABORT                          00688000
006890         MOVE RPXXX11-ABTRACE TO COM-ABTRACE                      00689000
006900         MOVE RPXXX11-ABEIBFN TO COM-ABEIBFN                      00690000
006910         MOVE RPXXX11-ABEIBRCODE TO COM-ABEIBRCODE                00691000
006920         MOVE RPXXX11-ABPROGID TO COM-ABPROGID                    00692000
006930         MOVE RPXXX11-SRBMDB TO COM-SRBMDB                        00693000
006940         MOVE RPXXX11-ABTYPE TO COM-ABTYPE                        00694000
006950         GO TO CICS-ABORT-EXIT.                                   00695000
006960     MOVE RPXXX11-ABORT TO COM-ABORT.                             00696000
006970     MOVE RPXXX11-MSGNBR TO WS-MSGNBR.                            00697000
006980 CRLM-EXIT.                                                       00698000
006990     EXIT.                                                        00699000
007000******************************************************************00700000
007010 CLOSE-PANEL SECTION.                                             00701000
007020 CP-START.                                                        00702000
007030     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00703000
007040     IF COM-RETURN IS EQUAL TO 'E'                                00704000
007050         PERFORM CALL-BISPAN-RPV135K.                             00705000
007060     IF COM-RETURN IS EQUAL TO '1'                                00706000
007070         PERFORM CALL-BISPAN-RPV135.                              00707000
007080 CP-EXIT.                                                         00708000
007090     EXIT.                                                        00709000
007100******************************************************************00710000
007110 CALL-BISPAN-RPV135K SECTION.                                     00711000
007120 CBD1-START.                                                      00712000
007130     CALL 'BISPAN' USING                                          00713000
007140         BICRPSB,                                                 00714000
007150         BICRSRB,                                                 00715000
007160         BICRPAN,                                                 00716000
007170         RPV135K-PANL-DATA-BLOCK,                                 00717000
007180         RPV135K-PANL-DATA-AREA.                                  00718000
007190 CBD1-EXIT.                                                       00719000
007200     EXIT.                                                        00720000
007210******************************************************************00721000
007220 CALL-BISPAN-RPV135 SECTION.                                      00722000
007230 CBD2-START.                                                      00723000
007240     CALL 'BISPAN' USING                                          00724000
007250         BICRPSB,                                                 00725000
007260         BICRSRB,                                                 00726000
007270         BICRPAN,                                                 00727000
007280         RPV135-PANL-DATA-BLOCK,                                  00728000
007290         RPV135-PANL-DATA-AREA.                                   00729000
007300 CBD2-EXIT.                                                       00730000
007310     EXIT.                                                        00731000
007320******************************************************************00732000
007330 PANEL-GET-RPV135 SECTION.                                        00733000
007340 PANEL-GET-RPV135-START.                                          00734000
007350     MOVE 'N' TO RPV135-SW-SET-CURSOR.                            00735000
007360     MOVE PDB-RPV135-NAME TO PAN-NAME.                            00736000
007370     MOVE REQ-GET TO PAN-REQ-VERB.                                00737000
007380     CALL 'BISPAN' USING                                          00738000
007390         BICRPSB                                                  00739000
007400         BICRSRB                                                  00740000
007410         BICRPAN                                                  00741000
007420         RPV135-PANL-DATA-BLOCK,                                  00742000
007430         RPV135-PANL-DATA-AREA.                                   00743000
007440 PANEL-GET-RPV135-EXIT.                                           00744000
007450     EXIT.                                                        00745000
007460******************************************************************00746000
007470 PANEL-PUT-RPV135 SECTION.                                        00747000
007480 PANEL-PUT-RPV135-START.                                          00748000
007490     MOVE PDB-RPV135-NAME TO PAN-NAME.                            00749000
007500     MOVE REQ-PUT TO PAN-REQ-VERB.                                00750000
007510     CALL 'BISPAN' USING                                          00751000
007520         BICRPSB                                                  00752000
007530         BICRSRB                                                  00753000
007540         BICRPAN                                                  00754000
007550         RPV135-PANL-DATA-BLOCK,                                  00755000
007560         RPV135-PANL-DATA-AREA.                                   00756000
007570 PANEL-PUT-RPV135-EXIT.                                           00757000
007580     EXIT.                                                        00758000
007590******************************************************************00759000
007600 PANEL-GET-RPV135K SECTION.                                       00760000
007610 PANEL-GET-RPV135K-START.                                         00761000
007620     MOVE 'N' TO RPV135K-SW-SET-CURSOR.                           00762000
007630     MOVE PDB-RPV135K-NAME TO PAN-NAME.                           00763000
007640     MOVE REQ-GET TO PAN-REQ-VERB.                                00764000
007650     CALL 'BISPAN' USING                                          00765000
007660         BICRPSB                                                  00766000
007670         BICRSRB                                                  00767000
007680         BICRPAN                                                  00768000
007690         RPV135K-PANL-DATA-BLOCK,                                 00769000
007700         RPV135K-PANL-DATA-AREA.                                  00770000
007710 PANEL-GET-RPV135K-EXIT.                                          00771000
007720     EXIT.                                                        00772000
007730******************************************************************00773000
007740 PANEL-PUT-RPV135K SECTION.                                       00774000
007750 PANEL-PUT-RPV135K-START.                                         00775000
007760     MOVE PDB-RPV135K-NAME TO PAN-NAME.                           00776000
007770     MOVE REQ-PUT TO PAN-REQ-VERB.                                00777000
007780     CALL 'BISPAN' USING                                          00778000
007790         BICRPSB                                                  00779000
007800         BICRSRB                                                  00780000
007810         BICRPAN                                                  00781000
007820         RPV135K-PANL-DATA-BLOCK,                                 00782000
007830         RPV135K-PANL-DATA-AREA.                                  00783000
007840 PANEL-PUT-RPV135K-EXIT.                                          00784000
007850     EXIT.                                                        00785000
007860******************************************************************00786000
007870 PANEL-GET-OCCUR-RPV135 SECTION.                                  00787000
007880 PGORPV135-START.                                                 00788000
007890     MOVE PDB-RPV135-NAME TO PAN-NAME.                            00789000
007900     MOVE REQ-GET-OCCUR TO PAN-REQ-VERB.                          00790000
007910     CALL 'BISPAN' USING                                          00791000
007920         BICRPSB                                                  00792000
007930         BICRSRB                                                  00793000
007940         BICRPAN                                                  00794000
007950         RPV135-PANL-DATA-BLOCK,                                  00795000
007960         RPV135-PANL-DATA-AREA.                                   00796000
007970 PGORPV135-EXIT.                                                  00797000
007980     EXIT.                                                        00798000
007990******************************************************************00799000
008000 PANEL-PUT-OCCUR-RPV135 SECTION.                                  00800000
008010 PPORPV135-START.                                                 00801000
008020     MOVE PDB-RPV135-NAME TO PAN-NAME.                            00802000
008030     MOVE REQ-PUT-OCCUR TO PAN-REQ-VERB.                          00803000
008040     CALL 'BISPAN' USING                                          00804000
008050         BICRPSB                                                  00805000
008060         BICRSRB                                                  00806000
008070         BICRPAN                                                  00807000
008080         RPV135-PANL-DATA-BLOCK,                                  00808000
008090         RPV135-PANL-DATA-AREA.                                   00809000
008100 PPORPV135-EXIT.                                                  00810000
008110     EXIT.                                                        00811000
008120******************************************************************00812000
008130 MIC-MST-API SECTION.                                             00813000
000000 COPY MIPMSTA.                                                    00814000
008150******************************************************************00815000
008160 EDIT-ACCOUNT-KEY SECTION.                                        00816000
008170 EAK-START.                                                       00817000
008180     MOVE COM-INST TO RPW130-INST.                                00818000
008190     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 00819000
008200     MOVE COM-SK-PRODCODE TO RPW130-PRODCODE.                     00820000
008210     MOVE COM-SK-ACCOUNT TO RPW130-ACCOUNTINPUT.                  00821000
008220     MOVE 'V' TO RPW130-FUNCTION.                                 00822000
008230     PERFORM ACCOUNT-KEY-EDIT.                                    00823000
008240     MOVE COM-SK-PRODCODE TO COM-PRODCODE.                        00824000
008250     MOVE RPW130-ACCOUNTKEY TO COM-SK-ACCOUNT.                    00825000
008260     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          00826000
008270     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      00827000
008280     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                00828000
008290 EAK-EXIT.                                                        00829000
008300     EXIT.                                                        00830000
008310******************************************************************00831000
008320 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 00832000
000000 COPY RPP033.                                                     00833000
008340******************************************************************00834000
008350 ACCOUNT-KEY-EDIT SECTION.                                        00835000
000000 COPY RPP130.                                                     00836000
008370******************************************************************00837000
008380 LEFT-JUSTIFY SECTION.                                            00838000
000000 COPY SRP025.                                                     00839000
008400******************************************************************00840000
008410 RIGHT-JUSTIFY SECTION.                                           00841000
000000 COPY SRP026.                                                     00842000
008430******************************************************************00843000
008440 PARAMETER-SEARCH SECTION.                                        00844000
000000 COPY SRP030.                                                     00845000
008460******************************************************************00846000
008470 COMPRESS-NEXTKEY SECTION.                                        00847000
000000 COPY SRP070.                                                     00848000
008490******************************************************************00849000
008500 GET-MESSAGE SECTION.                                             00850000
000000 COPY SRP071.                                                     00851000
008520******************************************************************00852000
008530 EXAMINE-FIELD SECTION.                                           00853000
000000 COPY SRP166.                                                     00854000
008550******************************************************************00855000
008560 SRP170-ROUTINE SECTION.                                          00856000
000000 COPY SRP170.                                                     00857000
008580******************************************************************00858000
008590 BUILD-PFKEY-LINE SECTION.                                        00859000
000000 COPY SRP710.                                                     00860000
008610******************************************************************00861000
008620 VALIDATE-PFKEYS SECTION.                                         00862000
000000 COPY SRP711.                                                     00863000
008640******************************************************************00864000
008650 SLP096-GET-2023-RECORD SECTION.                                  00865000
000000 COPY SLP096.                                                     00866000
008670******************************************************************00867000
008680 CICS-XCTL SECTION.                                               00868000
000000 COPY SLP704.                                                     00869000
008700******************************************************************00870000
008710 CICS-RETURN-TRANSID SECTION.                                     00871000
000000 COPY SLP710.                                                     00872000
008730******************************************************************00873000
008740 TSQ-DELETE SECTION.                                              00874000
008750 TSQD-START.                                                      00875000
008760 TSQD-EXIT.                                                       00876000
008770     EXIT.                                                        00877000
008780******************************************************************00878000
008790 CICS-TSQ-READ SECTION.                                           00879000
000000 COPY SLP744.                                                     00880000
008810******************************************************************00881000
008820 CICS-ABORT-EXIT SECTION.                                         00882000
000000 COPY SLP798.                                                     00883000
008840******************************************************************00884000
