000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL380.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL380 - EXPIRATION DATE                                    *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRCONS.                                                    00024000
000000 COPY BICRCONS.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRPAN.                                                     00028000
000000 COPY BICRPAN.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  RPV380K-PANL-DATA-BLOCK.                                     00032000
000000 COPY RPV380KW.                                                   00033000
000340 01  RPV380-PANL-DATA-BLOCK.                                      00034000
000000 COPY RPV380W.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00037000
000380     03  WS-NEXTKEY.                                              00038000
000390         05  WS-EXTID            PIC X(08).                       00039000
000400         05  WS-DELIM1           PIC X(01)       VALUE ','.       00040000
000410         05  WS-DATA.                                             00041000
000420             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00042000
000430             07  WS-DELIM2       PIC X(01)       VALUE ','.       00043000
000440             07  WS-ACCTX.                                        00044000
000450                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00045000
000460             07  WS-DELIM3       PIC X(01)       VALUE ','.       00046000
000470             07  WS-MODEL        PIC X(10)       VALUE SPACES.    00047000
000480         05  FILLER              PIC X(34)       VALUE SPACES.    00048000
000490     03  WS-LNKPROG1             PIC X(08)       VALUE 'RPLXXX13'.00049000
000500     03  WS-LKLGTH               PIC S9(04)      COMP             00050000
000510                                                 VALUE +4088.     00051000
000520     03  WS-DCHG-TEST            PIC X(01)       VALUE SPACE.     00052000
000530         88  WS-DCHG-PROTECT                     VALUE 'P'.       00053000
000540         88  WS-DCHG-EDITERR                     VALUE 'E'.       00054000
000550         88  WS-DCHG-HIDDEN                      VALUE 'H'.       00055000
000560     03  WS-ERROR-COUNT          PIC S9(04)      COMP             00056000
000570                                                 VALUE ZERO.      00057000
000580     03  WS-PDATE                PIC 9(08).                       00058000
000590     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00059000
000600         05  WS-PDATE-YYYY       PIC 9(04).                       00060000
000610         05  WS-PDATE-MM         PIC 9(02).                       00061000
000620         05  WS-PDATE-DD         PIC 9(02).                       00062000
000630     03  WS-SUB1                 PIC S9(04)      COMP             00063000
000640                                                 VALUE +0000.     00064000
000650     03  WS-SUB2                 PIC S9(04)      COMP             00065000
000660                                                 VALUE +0000.     00066000
000670 01  WS-LINKMSG                  PIC X(4500).                     00067000
000680 01  RPXXX13-MESSAGE.                                             00068000
000000 COPY MISCNT00      REPLACING                                     00069000
000700             ==:MICNT:== BY ==RPXXX13==.                          00070000
000000 COPY RPSXXX13.                                                   00071000
000720 01  WS-TSQAREAS.                                                 00072000
000730     03  WS-TSQITEM              PIC S9(04)      COMP             00073000
000740                                                 VALUE +0001.     00074000
000750     03  WS-TSQLGTH              PIC S9(04)      COMP             00075000
000760                                                 VALUE +4096.     00076000
000770     03  WS-TSQKEY.                                               00077000
000780         05  WS-TSQID            PIC X(04).                       00078000
000790         05  WS-TSQTRMID         PIC X(04).                       00079000
000800 01  LS-TSQAREA.                                                  00080000
000810     03  LS-TSQKEY               PIC X(08).                       00081000
000820     03  LS-TSQDATA              PIC X(4088).                     00082000
000830 01  MIWPRI-AREAS.                                                00083000
000000 COPY MIWPRI.                                                     00084000
000850 01  MIWMSTA-AREAS.                                               00085000
000000 COPY MIWMSTA.                                                    00086000
000870 01  MIMST-RECORD.                                                00087000
000000 COPY MISMST.                                                     00088000
000890 01  MI2023-RECORD.                                               00089000
000000 COPY MIS2023A.                                                   00090000
000910 01  WS-ABORTCODES.                                               00091000
000920     03  WS-AB0009               PIC S9(04)      COMP             00092000
000930                                                 VALUE +0009.     00093000
000940     03  WS-AB0106               PIC S9(04)      COMP             00094000
000950                                                 VALUE +0106.     00095000
000960     03  WS-AB2033               PIC S9(04)      COMP             00096000
000970                                                 VALUE +2033.     00097000
000980 01  WS-TRACECODES.                                               00098000
000990     03  WS-TR0001               PIC S9(04)      COMP             00099000
001000                                                 VALUE +0001.     00100000
001010     03  WS-TR0002               PIC S9(04)      COMP             00101000
001020                                                 VALUE +0002.     00102000
001030 01  SLW096-AREAS.                                                00103000
000000 COPY SLW096.                                                     00104000
001050 01  RPW014-AREAS.                                                00105000
000000 COPY RPW014.                                                     00106000
001070 01  RPW033-AREAS.                                                00107000
000000 COPY RPW033.                                                     00108000
001090 01  RPW130-AREAS.                                                00109000
000000 COPY RPW130.                                                     00110000
001110 01  SRW000-AREAS.                                                00111000
000000 COPY SRW000.                                                     00112000
001130 01  SRW025-AREAS.                                                00113000
000000 COPY SRW025.                                                     00114000
001150 01  SRW030-AREAS.                                                00115000
000000 COPY SRW030.                                                     00116000
001170 01  SRW031-AREAS.                                                00117000
000000 COPY SRW031.                                                     00118000
001190 01  SRW067-AREAS.                                                00119000
000000 COPY SRW067.                                                     00120000
001210 01  SRW105-AREAS.                                                00121000
000000 COPY SRW105.                                                     00122000
001230 01  SRW161-AREAS.                                                00123000
000000 COPY SRW161.                                                     00124000
001250 01  SRW166-AREAS.                                                00125000
000000 COPY SRW166.                                                     00126000
001270 01  SRW170-AREAS.                                                00127000
000000 COPY SRW170.                                                     00128000
001290 COPY DFHAID.                                                     00129000
001300******************************************************************00130000
001310 LINKAGE SECTION.                                                 00131000
001320 01  DFHCOMMAREA.                                                 00132000
000000 COPY SLS1112.                                                    00133000
001340     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00134000
001350         05  COM-EDIT-DATE       PIC X(10).                       00135000
001360         05  COM-KEY-FIELDS.                                      00136000
001370             07  COM-KEY-PRODCODE                                 00137000
001380                                 PIC X(06).                       00138000
001390             07  COM-KEY-ACCOUNT PIC X(18).                       00139000
001400             07  COM-KEY-ACCOUNT-N                                00140000
001410                         REDEFINES COM-KEY-ACCOUNT                00141000
001420                                 PIC 9(18).                       00142000
001430             07  COM-KEY-MODEL                                    00143000
001440                                 PIC X(10).                       00144000
001450             07  COM-KEY-IDNBRX  PIC X(18).                       00145000
001460             07  COM-KEY-IDNBR                                    00146000
001470                         REDEFINES COM-KEY-IDNBRX                 00147000
001480                                 PIC 9(18).                       00148000
001490         05  COM-PANEL-ACTION    PIC X(01).                       00149000
001500             88  INITIAL-PANEL                   VALUE ' '.       00150000
001510             88  EDIT-PANEL                      VALUE 'E'.       00151000
001520         05  COM-FROM-PANEL      PIC X(01).                       00152000
001530             88  FROM-KEY-PANEL                  VALUE 'K'.       00153000
001540             88  FROM-MAINT-PANEL                VALUE 'M'.       00154000
001550             88  FROM-HELP                       VALUE 'H'.       00155000
001560             88  FROM-BREAKAWAY                  VALUE 'B'.       00156000
001570         05  COM-KEY-FORMATTEDACCT                                00157000
001580                                 PIC X(22).                       00158000
001590         05  COM-KEY-MSGNBR      PIC X(06).                       00159000
001600         05  COM-KEY-COMMAND     PIC X(50).                       00160000
001610         05  COM-RCIF-KEY.                                        00161000
001620             07  COM-RCIF-CUST-INST                               00162000
001630                                 PIC 9(04).                       00163000
001640             07  COM-RCIF-CUST-TYPE                               00164000
001650                                 PIC X(01).                       00165000
001660             07  COM-RCIF-CUST.                                   00166000
001670                 09  COM-RCIF-ALPHA                               00167000
001680                                 PIC X(14).                       00168000
001690                 09  COM-RCIF-ACCUM                               00169000
001700                                 PIC 9(03).                       00170000
001710                 09  COM-RCIF-TIEBRKR                             00171000
001720                                 PIC 9(04).                       00172000
001730         05  COM-CUST-NAME       PIC X(40).                       00173000
001740         05  COM-REL-STAT        PIC X(01).                       00174000
001750         05  COM-IDNUMBER        PIC X(18).                       00175000
001760         05  COM-MODEL           PIC X(10).                       00176000
001770         05  COM-MODEL-DESC      PIC X(20).                       00177000
001780         05  COM-MAXDT           PIC S9(09)      COMP-3.          00178000
001790         05  COM-EXPMM           PIC X(02).                       00179000
001800         05  COM-EXPDD           PIC X(02).                       00180000
001810         05  COM-EXPYY           PIC X(04).                       00181000
001820         05  COM-DCHG.                                            00182000
001830             07  COM-EXPREDMM-DCHG                                00183000
001840                                 PIC X(01).                       00184000
001850             07  COM-EXPREDDD-DCHG                                00185000
001860                                 PIC X(01).                       00186000
001870             07  COM-EXPREDYY-DCHG                                00187000
001880                                 PIC X(01).                       00188000
001890******************************************************************00189000
001900*01  SLW096-2023RECORDS.                                          00190000
000000 COPY SLW096L.                                                    00191000
001920******************************************************************00192000
001930 PROCEDURE DIVISION.                                              00193000
001940******************************************************************00194000
001950 ENTRY-ROUTINE SECTION.                                           00195000
001960     MOVE 'RPL380' TO COM-ABPROGID.                               00196000
000000 COPY SLP771.                                                     00197000
001980******************************************************************00198000
001990 TRANSACTION-CLEAN-UP SECTION.                                    00199000
002000 TCU-START.                                                       00200000
002010 TCU-EXIT.                                                        00201000
002020     EXIT.                                                        00202000
002030******************************************************************00203000
002040 CICS-HANDLE-CONDITION SECTION.                                   00204000
000000 COPY SLP772.                                                     00205000
002060     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00206000
002070         GO TO CTSRI-EXIT.                                        00207000
002080     MOVE WS-AB2033 TO COM-ABORT.                                 00208000
002090     MOVE WS-TR0001 TO COM-ABTRACE.                               00209000
002100     GO TO ABORT-EXIT.                                            00210000
002110 CHC-EXIT.                                                        00211000
002120     EXIT.                                                        00212000
002130******************************************************************00213000
002140 ROUTING-ROUTINE SECTION.                                         00214000
002150 RR-START.                                                        00215000
002160     MOVE LOW-VALUES TO RPXXX13-MESSAGE.                          00216000
002170     MOVE LOW-VALUES TO RPV380-PANL-DATA-AREA.                    00217000
002180     MOVE LOW-VALUES TO RPV380K-PANL-DATA-AREA.                   00218000
002190     MOVE ALL ZEROS TO WS-MSGNBR.                                 00219000
002200     MOVE 'RP00' TO WS-TSQFILEID.                                 00220000
002210     MOVE 'RPI' TO WS-TSQSYSID.                                   00221000
002220     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00222000
002230     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00223000
002240     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00224000
002250         MOVE COM-PAN TO BICRPAN                                  00225000
002260         MOVE COM-PSB TO BICRPSB                                  00226000
002270         MOVE COM-SRB TO BICRSRB                                  00227000
002280     ELSE                                                         00228000
002290         MOVE '1' TO BPSB-LEVEL.                                  00229000
002300     IF COM-RETURN IS EQUAL TO 'B'                                00230000
002310         GO TO BREAKAWAY-RETURN.                                  00231000
002320     IF COM-RETURN IS EQUAL TO '0'                                00232000
002330         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00233000
002340         MOVE SPACES TO COM-WORKAREAS                             00234000
002350         MOVE '1' TO SRB-VERSION                                  00235000
002360         MOVE 'IPRP' TO SRB-APPL-ID                               00236000
002370         MOVE 'RPL380' TO SRB-PROG-ID                             00237000
002380         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00238000
002390         MOVE 'P' TO PAN-TYPE                                     00239000
002400         MOVE SPACE TO PAN-OVERLAY                                00240000
002410         MOVE SPACE TO PAN-CLOSE                                  00241000
002420         MOVE SPACE TO PAN-ALARM                                  00242000
002430         MOVE SPACE TO PAN-CURSOR-PAN                             00243000
002440         MOVE SPACE TO PAN-CURSOR-FLD                             00244000
002450         MOVE SPACE TO PAN-SET-FLD                                00245000
002460         MOVE SPACE TO PAN-SET-VID                                00246000
002470         MOVE SPACE TO PAN-SET-EMP                                00247000
002480         MOVE PDB-RPV380K-NAME TO PAN-NAME                        00248000
002490         PERFORM PANEL-INIT                                       00249000
002500         MOVE BICRPAN TO COM-PAN                                  00250000
002510         MOVE BICRPSB TO COM-PSB                                  00251000
002520         MOVE BICRSRB TO COM-SRB                                  00252000
002530         PERFORM INITIALIZE-DATE                                  00253000
002540         GO TO PANEL-ROUTER.                                      00254000
002550     PERFORM PANEL-NAME-SET.                                      00255000
002560     IF COM-HELPSW IS EQUAL TO 'Y'                                00256000
002570         GO TO HELP-RETURN.                                       00257000
002580     PERFORM PANEL-RECEIVE.                                       00258000
002590     PERFORM PANEL-DATA-GET.                                      00259000
002600     IF FROM-MAINT-PANEL                                          00260000
002610         PERFORM SET-DCHG-INDICATORS.                             00261000
002620     PERFORM PANEL-PFKEY-SET.                                     00262000
002630     PERFORM VALIDATE-PFKEYS.                                     00263000
002640     IF EIBAID IS EQUAL TO DFHPF1                                 00264000
002650         GO TO GET-HELP.                                          00265000
002660     IF EIBAID IS EQUAL TO DFHPF11                                00266000
002670         GO TO BREAK-AWAY.                                        00267000
002680     IF (COM-RETURN IS EQUAL TO 'E')                              00268000
002690         AND (EIBAID IS EQUAL TO DFHPF2                           00269000
002700         OR EIBAID IS EQUAL TO DFHPF3                             00270000
002710         OR EIBAID IS EQUAL TO DFHPF4                             00271000
002720         OR EIBAID IS EQUAL TO DFHPF7                             00272000
002730         OR EIBAID IS EQUAL TO DFHPF8                             00273000
002740         OR EIBAID IS EQUAL TO DFHPF12)                           00274000
002750         GO TO CLOSE-TRANSACTION.                                 00275000
002760     IF COM-RETURN IS EQUAL TO '1'                                00276000
002770         AND EIBAID IS EQUAL TO DFHPF12                           00277000
002780         GO TO CLOSE-TRANSACTION.                                 00278000
002790     IF COM-RETURN IS EQUAL TO '0'                                00279000
002800         OR COM-RETURN IS EQUAL TO 'E'                            00280000
002810         OR COM-RETURN IS EQUAL TO '1'                            00281000
002820         GO TO PANEL-ROUTER.                                      00282000
002830 RR-END.                                                          00283000
002840     GO TO CLOSE-TRANSACTION.                                     00284000
002850 RR-EXIT.                                                         00285000
002860     EXIT.                                                        00286000
002870******************************************************************00287000
002880 INITIALIZE-DATE SECTION.                                         00288000
002890 ID-START.                                                        00289000
002900     MOVE COM-DATE TO WS-CURDATE8.                                00290000
002910     MOVE '-' TO WS-CD8DSH1.                                      00291000
002920     MOVE '-' TO WS-CD8DSH2.                                      00292000
002930     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00293000
002940 ID-EXIT.                                                         00294000
002950     EXIT.                                                        00295000
002960******************************************************************00296000
002970 PANEL-NAME-SET SECTION.                                          00297000
002980 PNS-START.                                                       00298000
002990     IF COM-RETURN IS EQUAL TO '0'                                00299000
003000         MOVE PDB-RPV380K-NAME TO PAN-NAME.                       00300000
003010     IF COM-RETURN IS EQUAL TO 'E'                                00301000
003020         MOVE PDB-RPV380K-NAME TO PAN-NAME.                       00302000
003030     IF COM-RETURN IS EQUAL TO '1'                                00303000
003040         MOVE PDB-RPV380-NAME TO PAN-NAME.                        00304000
003050 PNS-EXIT.                                                        00305000
003060     EXIT.                                                        00306000
003070******************************************************************00307000
003080 PANEL-DATA-GET SECTION.                                          00308000
003090 PDG-START.                                                       00309000
003100     IF COM-RETURN IS EQUAL TO '0'                                00310000
003110         PERFORM PANEL-GET-RPV380K.                               00311000
003120     IF COM-RETURN IS EQUAL TO 'E'                                00312000
003130         PERFORM PANEL-GET-RPV380K                                00313000
003140         MOVE RPV380K-COMMAND TO WS-NEXTKEY                       00314000
003150         MOVE PDB-RPV380K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00315000
003160     IF COM-RETURN IS EQUAL TO '1'                                00316000
003170         PERFORM PANEL-GET-RPV380                                 00317000
003180         MOVE RPV380-COMMAND TO WS-NEXTKEY                        00318000
003190         MOVE PDB-RPV380-COMMAND-DCHG TO WS-COMMAND-DCHG.         00319000
003200 PDG-EXIT.                                                        00320000
003210     EXIT.                                                        00321000
003220******************************************************************00322000
003230 PANEL-PFKEY-SET SECTION.                                         00323000
003240 PPS-START.                                                       00324000
003250     IF COM-UPDATE IS EQUAL TO 'Y'                                00325000
003260         AND COM-RETURN IS EQUAL TO '1'                           00326000
003270         MOVE 'A' TO WS-PF9-FLG.                                  00327000
003280 PPS-EXIT.                                                        00328000
003290     EXIT.                                                        00329000
003300******************************************************************00330000
003310 PANEL-ROUTER SECTION.                                            00331000
003320 PR-START.                                                        00332000
003330     IF COM-RETURN IS EQUAL TO '0'                                00333000
003340         GO TO PROCESS-KEY-PANEL.                                 00334000
003350     IF COM-RETURN IS EQUAL TO 'E'                                00335000
003360         GO TO PROCESS-KEY-PANEL.                                 00336000
003370     IF COM-RETURN IS EQUAL TO '1'                                00337000
003380         GO TO PROCESS-MAINT-PANEL.                               00338000
003390     GO TO CLOSE-TRANSACTION.                                     00339000
003400 PR-EXIT.                                                         00340000
003410     EXIT.                                                        00341000
003420******************************************************************00342000
003430 HELP-RETURN SECTION.                                             00343000
000000 COPY SRP074.                                                     00344000
003450******************************************************************00345000
003460 HELP-RETURN-FINISH SECTION.                                      00346000
003470 HRF-START.                                                       00347000
003480     PERFORM PANEL-DATA-GET.                                      00348000
003490     MOVE 'H' TO COM-FROM-PANEL.                                  00349000
003500     GO TO PANEL-ROUTER.                                          00350000
003510 HRF-EXIT.                                                        00351000
003520     EXIT.                                                        00352000
003530******************************************************************00353000
003540 HELP-MISSING-FINISH SECTION.                                     00354000
003550 HMF-START.                                                       00355000
003560     MOVE 'H' TO COM-FROM-PANEL.                                  00356000
003570     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00357000
003580     GO TO PANEL-ROUTER.                                          00358000
003590 HMF-EXIT.                                                        00359000
003600     EXIT.                                                        00360000
003610******************************************************************00361000
003620 BREAK-AWAY SECTION.                                              00362000
000000 COPY SRP0752.                                                    00363000
003640******************************************************************00364000
003650 BREAKAWAY-RETURN-FINISH SECTION.                                 00365000
003660 BRF-START.                                                       00366000
003670     PERFORM PANEL-DATA-GET.                                      00367000
003680     MOVE 'B' TO COM-FROM-PANEL.                                  00368000
003690     GO TO PANEL-ROUTER.                                          00369000
003700 BRF-EXIT.                                                        00370000
003710     EXIT.                                                        00371000
003720******************************************************************00372000
003730 PROCESS-KEY-PANEL SECTION.                                       00373000
003740 PKP-START.                                                       00374000
003750     IF INITIAL-PANEL                                             00375000
003760         GO TO PKP-CONTINUE.                                      00376000
003770     IF EDIT-PANEL                                                00377000
003780         AND FROM-MAINT-PANEL                                     00378000
003790         MOVE SPACE TO COM-FROM-PANEL                             00379000
003800         GO TO PKP-RELOAD-PANEL.                                  00380000
003810 PKP-CONTINUE.                                                    00381000
003820     MOVE COM-NEXTKEY TO SR-PSLIST.                               00382000
003830     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00383000
003840         GO TO PKP-SEND-PANEL.                                    00384000
003850 PKP-BEGIN-EDITS.                                                 00385000
003860     IF EDIT-PANEL                                                00386000
003870         MOVE RPV380K-PRODCD TO COM-KEY-PRODCODE                  00387000
003880         MOVE RPV380K-ACCOUNT TO COM-KEY-ACCOUNT                  00388000
003890         MOVE RPV380K-MODEL TO COM-KEY-MODEL                      00389000
003900         MOVE RPV380K-IDNBR TO COM-KEY-IDNBRX                     00390000
003910         GO TO PKP-RETURN-EDITS.                                  00391000
003920     PERFORM PARAMETER-SEARCH.                                    00392000
003930     MOVE SR-PSPARM TO COM-EXTID.                                 00393000
003940     MOVE SR-PSPARM TO COM-EXTERNALID.                            00394000
003950     PERFORM PARAMETER-SEARCH.                                    00395000
003960     MOVE SR-PSPARM TO COM-KEY-PRODCODE.                          00396000
003970     PERFORM PARAMETER-SEARCH.                                    00397000
003980     MOVE SR-PSPARM TO COM-KEY-ACCOUNT.                           00398000
003990     PERFORM PARAMETER-SEARCH.                                    00399000
004000     MOVE SR-PSPARM TO COM-KEY-MODEL.                             00400000
004010     PERFORM PARAMETER-SEARCH.                                    00401000
004020     MOVE SR-PSPARM TO COM-KEY-IDNBRX.                            00402000
004030 PKP-RETURN-EDITS.                                                00403000
004040     MOVE PDB-RPV380-EXPREDMM TO WS-CURSOR-FIELD.                 00404000
004050     IF COM-KEY-PRODCODE IS EQUAL TO SPACE                        00405000
004060         MOVE LOW-VALUE TO COM-KEY-PRODCODE.                      00406000
004070     IF COM-KEY-ACCOUNT IS EQUAL TO SPACE                         00407000
004080         MOVE LOW-VALUE TO COM-KEY-ACCOUNT.                       00408000
004090     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00409000
004100         MOVE LOW-VALUES TO COM-KEY-MODEL.                        00410000
004110     IF COM-KEY-IDNBRX IS EQUAL TO SPACES                         00411000
004120         MOVE LOW-VALUES TO COM-KEY-IDNBRX.                       00412000
004130     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00413000
004140         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00414000
004150         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00415000
004160         AND COM-KEY-IDNBRX IS GREATER THAN LOW-VALUES            00416000
004170         GO TO PKP-RETURN-CONT.                                   00417000
004180     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00418000
004190         MOVE '000002' TO WS-MSGNBR                               00419000
004200         GO TO PKP-RETURN-CONT.                                   00420000
004210     PERFORM EDIT-ACCOUNT-KEY.                                    00421000
004220 PKP-RETURN-CONT.                                                 00422000
004230     IF INITIAL-PANEL                                             00423000
004240         AND COM-KEY-PRODCODE IS EQUAL TO LOW-VALUES              00424000
004250         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUES               00425000
004260         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUES                 00426000
004270         AND COM-KEY-IDNBRX IS EQUAL TO LOW-VALUES                00427000
004280         MOVE '000001' TO WS-MSGNBR                               00428000
004290         GO TO PKP-SEND-PANEL.                                    00429000
004300     MOVE COM-KEY-IDNBRX TO SR-JUSTIFYIN.                         00430000
004310     MOVE +0018 TO SR-JLGTH.                                      00431000
004320     PERFORM RIGHT-JUSTIFY.                                       00432000
004330     IF SR-JUSTIFYOUT IS EQUAL TO SPACE                           00433000
004340         MOVE ZEROS TO COM-KEY-IDNBRX                             00434000
004350     ELSE                                                         00435000
004360         MOVE SR-JUSTIFYOUT TO COM-KEY-IDNBRX.                    00436000
004370     IF COM-KEY-IDNBRX IS NOT NUMERIC                             00437000
004380         MOVE ZEROES TO COM-KEY-IDNBRX.                           00438000
004390     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00439000
004400     MOVE COM-KEY-MODEL TO COM-MODEL.                             00440000
004410     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00441000
004420     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00442000
004430         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00443000
004440     ELSE                                                         00444000
004450         MOVE ZERO TO COM-ACCOUNT.                                00445000
004460     IF FROM-BREAKAWAY                                            00446000
004470         OR FROM-HELP                                             00447000
004480         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00448000
004490         GO TO PKP-RELOAD-PANEL.                                  00449000
004500     IF COM-KEY-PRODCODE IS GREATER THAN SPACES                   00450000
004510         AND COM-KEY-ACCOUNT IS GREATER THAN SPACES               00451000
004520         AND COM-KEY-IDNBRX IS GREATER THAN ZEROS                 00452000
004530         MOVE '000002' TO WS-MSGNBR                               00453000
004540         GO TO PKP-RELOAD-PANEL.                                  00454000
004550 PKP-EDITS-READY.                                                 00455000
004560     MOVE SPACE TO COM-PANEL-ACTION.                              00456000
004570     MOVE '1' TO COM-RETURN.                                      00457000
004580     MOVE 'K' TO COM-FROM-PANEL.                                  00458000
004590     GO TO PANEL-ROUTER.                                          00459000
004600 PKP-RELOAD-PANEL.                                                00460000
004610     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00461000
004620         MOVE LOW-VALUES TO RPV380K-PRODCD                        00462000
004630     ELSE                                                         00463000
004640         MOVE COM-KEY-PRODCODE TO RPV380K-PRODCD.                 00464000
004650     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00465000
004660         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROS                     00466000
004670         MOVE LOW-VALUES TO RPV380K-ACCOUNT                       00467000
004680     ELSE                                                         00468000
004690         MOVE COM-KEY-ACCOUNT TO RPV380K-ACCOUNT.                 00469000
004700*                                                                 00470000
004710     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00471000
004720         MOVE LOW-VALUES TO RPV380K-MODEL                         00472000
004730         ELSE                                                     00473000
004740         MOVE COM-KEY-MODEL TO RPV380K-MODEL.                     00474000
004750     MOVE COM-KEY-IDNBRX TO RPV380K-IDNBR.                        00475000
004760     IF COM-KEY-IDNBRX IS NOT GREATER THAN ZEROS                  00476000
004770         MOVE LOW-VALUES TO RPV380K-IDNBR.                        00477000
004780 PKP-SEND-PANEL.                                                  00478000
004790     MOVE PDB-RPV380K-NAME TO PAN-NAME.                           00479000
004800     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00480000
004810     IF (FROM-HELP                                                00481000
004820         OR FROM-BREAKAWAY)                                       00482000
004830         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00483000
004840         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00484000
004850     ELSE                                                         00485000
004860         MOVE PDB-RPV380K-PRODCD TO PAN-SET-FLD.                  00486000
004870     PERFORM CALL-BISPAN-RPV380K.                                 00487000
004880     MOVE COM-OPERID TO RPV380K-OPERID.                           00488000
004890     MOVE COM-INST TO RPV380K-INST.                               00489000
004900     MOVE COM-EDIT-DATE TO RPV380K-SYSDATE.                       00490000
004910     IF RPV380K-PRODCD IS EQUAL TO SPACES                         00491000
004920         MOVE LOW-VALUES TO RPV380K-PRODCD.                       00492000
004930     MOVE RPV380K-ACCOUNT TO SR-JUSTLONGIN.                       00493000
004940     MOVE +18 TO SR-JLGTH.                                        00494000
004950     PERFORM LEFT-JUSTIFY.                                        00495000
004960     MOVE SR-JUSTLONGOUT TO RPV380K-ACCOUNT.                      00496000
004970     IF RPV380K-ACCOUNT IS EQUAL TO SPACES                        00497000
004980         MOVE LOW-VALUES TO RPV380K-ACCOUNT.                      00498000
004990     IF RPV380K-MODEL IS EQUAL TO SPACES                          00499000
005000         MOVE LOW-VALUES TO RPV380K-MODEL.                        00500000
005010     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00501000
005020         MOVE WS-HELPMSG TO WS-MSGNBR.                            00502000
005030     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00503000
005040         MOVE '000027' TO WS-MSGNBR                               00504000
005050     ELSE                                                         00505000
005060         PERFORM BUILD-NEXTKEY                                    00506000
005070         PERFORM COMPRESS-NEXTKEY                                 00507000
005080         MOVE WS-NEXTKEY TO RPV380K-COMMAND.                      00508000
005090     IF FROM-BREAKAWAY                                            00509000
005100         OR FROM-HELP                                             00510000
005110         MOVE SPACES TO COM-FROM-PANEL                            00511000
005120         MOVE COM-KEY-COMMAND TO RPV380K-COMMAND                  00512000
005130         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00513000
005140     ELSE                                                         00514000
005150         MOVE RPV380K-COMMAND TO COM-KEY-COMMAND                  00515000
005160         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00516000
005170     MOVE 'E' TO COM-RETURN.                                      00517000
005180     PERFORM GET-MESSAGE.                                         00518000
005190     MOVE WS-MESSAGE TO RPV380K-MSGLINE.                          00519000
005200     PERFORM PANEL-PFKEY-SET.                                     00520000
005210     PERFORM BUILD-PFKEY-LINE.                                    00521000
005220     MOVE WS-PFLINE1 TO RPV380K-PFLINE1.                          00522000
005230     MOVE WS-PFLINE2 TO RPV380K-PFLINE2.                          00523000
005240     PERFORM PANEL-PUT-RPV380K.                                   00524000
005250     PERFORM PANEL-SEND.                                          00525000
005260     MOVE 'E' TO COM-PANEL-ACTION.                                00526000
005270     MOVE COM-INTID TO WS-TRANSID.                                00527000
005280     GO TO CICS-RETURN-TRANSID.                                   00528000
005290 PKP-EXIT.                                                        00529000
005300     EXIT.                                                        00530000
005310******************************************************************00531000
005320 PROCESS-MAINT-PANEL SECTION.                                     00532000
005330 PMP-START.                                                       00533000
005340     IF FROM-HELP                                                 00534000
005350         OR FROM-BREAKAWAY                                        00535000
005360         MOVE SPACE TO COM-FROM-PANEL                             00536000
005370         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00537000
005380         MOVE PAN-CURSOR-FLD TO WS-CURSOR-FIELD                   00538000
005390         GO TO PMP-SEND-PANEL.                                    00539000
005400     MOVE 'E' TO COM-END.                                         00540000
005410     IF INITIAL-PANEL                                             00541000
005420         MOVE ALL 'N' TO COM-DCHG                                 00542000
005430         MOVE ALL 'N' TO RPXXX13-DCHG                             00543000
005440         MOVE LOW-VALUES TO RPV380-PANL-DATA-AREA                 00544000
005450         MOVE SPACE TO COM-PANEL-ACTION                           00545000
005460         MOVE 'VKL' TO RPXXX13-APIFUNC                            00546000
005470         GO TO PMP-LINK-TO-RPLXXX13.                              00547000
005480 PMP-PFKEYS.                                                      00548000
005490     MOVE ALL ZEROS TO WS-MSGNBR.                                 00549000
005500     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00550000
005510         MOVE SPACES TO WS-CURSOR-FIELD                           00551000
005520         GO TO PMP-SEND-PANEL.                                    00552000
005530     IF EIBAID IS EQUAL TO DFHPF4                                 00553000
005540         GO TO PMP-CONTINUE.                                      00554000
005550     MOVE COM-NEXTKEY TO WS-NEXTKEY.                              00555000
005560 PMP-CONTINUE.                                                    00556000
005570     MOVE ZERO TO WS-MSGNBR.                                      00557000
005580     MOVE +0 TO WS-ERROR-COUNT.                                   00558000
005590     MOVE COM-DCHG TO SRW166-FIELD.                               00559000
005600     MOVE 'E' TO SRW166-IN.                                       00560000
005610     MOVE 'Y' TO SRW166-OUT.                                      00561000
005620* MOVE THE LENGTH OF THE COM-DCHG FIELD:                          00562000
005630     MOVE +3 TO SRW166-LGTH.                                      00563000
005640     PERFORM EXAMINE-FIELD.                                       00564000
005650     MOVE SRW166-FIELD TO COM-DCHG.                               00565000
005660     MOVE ALL 'N' TO RPXXX13-DCHG.                                00566000
005670* ** *************************************************            00567000
005680     PERFORM MOVE-PANEL-TO-RECORD.                                00568000
005690     IF COM-DCHG IS EQUAL TO SPACES                               00569000
005700         AND (EIBAID IS EQUAL TO DFHPF3                           00570000
005710         OR EIBAID IS EQUAL TO DFHPF4)                            00571000
005720         GO TO CLOSE-TRANSACTION.                                 00572000
005730 PMP-LINK-TO-RPLXXX13.                                            00573000
005740     IF INITIAL-PANEL                                             00574000
005750         MOVE 'VKL' TO RPXXX13-APIFUNC.                           00575000
005760     IF EDIT-PANEL                                                00576000
005770         MOVE 'UPD' TO RPXXX13-APIFUNC.                           00577000
005780     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00578000
005790         OR EIBAID IS EQUAL TO DFHPF9                             00579000
005800         MOVE 'EDT' TO RPXXX13-APIFUNC.                           00580000
005810     PERFORM RPXXX13-LINK-MESSAGE.                                00581000
005820     IF RPXXX13-RETURN IS EQUAL TO 'E'                            00582000
005830         MOVE 'E' TO COM-RETURN                                   00583000
005840         MOVE 'E' TO COM-PANEL-ACTION                             00584000
005850         MOVE 'M' TO COM-FROM-PANEL                               00585000
005860         GO TO PANEL-ROUTER.                                      00586000
005870     IF RPXXX13-APIFUNC IS EQUAL TO 'EDT'                         00587000
005880         GO TO PMP-BUILD-MAINT-PANEL.                             00588000
005890     IF RPXXX13-APIFUNC IS EQUAL TO 'UPD'                         00589000
005900         AND RPXXX13-FUNCTION IS EQUAL TO SPACE                   00590000
005910         GO TO CLOSE-TRANSACTION.                                 00591000
005920     MOVE RPXXX13-RCIF-KEY TO COM-RCIF-KEY.                       00592000
005930     MOVE RPXXX13-CUST-NAME TO COM-CUST-NAME.                     00593000
005940     MOVE RPXXX13-IDNUMBER TO COM-KEY-IDNBR.                      00594000
005950     MOVE RPXXX13-ACCOUNT TO COM-KEY-ACCOUNT.                     00595000
005960     MOVE RPXXX13-PRODCODE TO COM-KEY-PRODCODE.                   00596000
005970     MOVE RPXXX13-MODEL TO COM-KEY-MODEL.                         00597000
005980     MOVE RPXXX13-MODEL-DESC TO COM-MODEL-DESC.                   00598000
005990     MOVE RPXXX13-MAXDT TO COM-MAXDT.                             00599000
006000     MOVE RPXXX13-EXPREMMDT TO COM-EXPMM.                         00600000
006010     MOVE RPXXX13-EXPREDDDT TO COM-EXPDD.                         00601000
006020     MOVE RPXXX13-EXPREYYDT TO COM-EXPYY.                         00602000
006030     MOVE RPXXX13-MODEL-DESC TO COM-EXPDD.                        00603000
006040     IF COM-PRODCODE IS EQUAL TO LOW-VALUES                       00604000
006050         MOVE RPXXX13-KEY-PRODCODE TO COM-KEY-PRODCODE            00605000
006060         MOVE RPXXX13-KEY-ACCOUNT TO COM-KEY-ACCOUNT              00606000
006070         MOVE RPXXX13-KEY-MODEL TO COM-KEY-MODEL.                 00607000
006080 PMP-BUILD-MAINT-PANEL.                                           00608000
006090* **                                                              00609000
006100* **                                                              00610000
006110     PERFORM BUILD-MAINT-PANEL.                                   00611000
006120 PMP-SEND-PANEL.                                                  00612000
006130     IF WS-CURSOR-FIELD IS EQUAL TO SPACE                         00613000
006140         MOVE PDB-RPV380-COMMAND TO PAN-SET-FLD                   00614000
006150     ELSE                                                         00615000
006160         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                     00616000
006170     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00617000
006180     PERFORM CALL-BISPAN-RPV380.                                  00618000
006190     MOVE COM-INST TO RPV380-INST.                                00619000
006200     MOVE COM-OPERID TO RPV380-OPERID.                            00620000
006210     MOVE COM-PRODCODE TO RPV380-PRODCD.                          00621000
006220     MOVE COM-KEY-ACCOUNT TO RPV380-ACCOUNT.                      00622000
006230     MOVE COM-KEY-MODEL TO RPV380-MODEL.                          00623000
006240     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00624000
006250         MOVE ALL 'P' TO COM-DCHG                                 00625000
006260         MOVE PDB-RPV380-COMMAND TO WS-CURSOR-FIELD.              00626000
006270     PERFORM SET-ATTRIBUTES-AND-MESSAGES.                         00627000
006280     IF (FROM-HELP                                                00628000
006290         OR FROM-BREAKAWAY)                                       00629000
006300         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00630000
006310         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00631000
006320         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00632000
006330     ELSE                                                         00633000
006340         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD                      00634000
006350         MOVE WS-CURSOR-OCC TO PAN-SET-OCC.                       00635000
006360     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00636000
006370     PERFORM CALL-BISPAN-RPV380.                                  00637000
006380     MOVE COM-INST TO RPV380-INST.                                00638000
006390     MOVE COM-OPERID TO RPV380-OPERID.                            00639000
006400     MOVE COM-EDIT-DATE TO RPV380-SYSDATE.                        00640000
006410     IF WS-MSGNBR NOT NUMERIC                                     00641000
006420         MOVE ZERO TO WS-MSGNBR.                                  00642000
006430     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00643000
006440         MOVE WS-HELPMSG TO WS-MSGNBR.                            00644000
006450     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00645000
006460         MOVE '000027' TO WS-MSGNBR                               00646000
006470     ELSE                                                         00647000
006480         PERFORM BUILD-NEXTKEY                                    00648000
006490         PERFORM COMPRESS-NEXTKEY                                 00649000
006500         MOVE WS-NEXTKEY TO RPV380-COMMAND.                       00650000
006510     IF FROM-HELP                                                 00651000
006520         OR FROM-BREAKAWAY                                        00652000
006530         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00653000
006540         MOVE COM-KEY-COMMAND TO RPV380-COMMAND                   00654000
006550         MOVE SPACE TO COM-FROM-PANEL                             00655000
006560     ELSE                                                         00656000
006570         MOVE RPV380-COMMAND TO COM-KEY-COMMAND                   00657000
006580         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00658000
006590     PERFORM GET-MESSAGE.                                         00659000
006600     MOVE WS-MESSAGE TO RPV380-MSGLINE.                           00660000
006610     PERFORM PANEL-PFKEY-SET.                                     00661000
006620     MOVE 'E' TO COM-END.                                         00662000
006630     PERFORM BUILD-PFKEY-LINE.                                    00663000
006640     MOVE WS-PFLINE1 TO RPV380-PFLINE1.                           00664000
006650     MOVE WS-PFLINE2 TO RPV380-PFLINE2.                           00665000
006660     PERFORM PANEL-PUT-RPV380.                                    00666000
006670     PERFORM PANEL-SEND.                                          00667000
006680     MOVE '1' TO COM-RETURN.                                      00668000
006690     MOVE 'E' TO COM-PANEL-ACTION.                                00669000
006700     MOVE 'M' TO COM-FROM-PANEL.                                  00670000
006710     MOVE COM-INTID TO WS-TRANSID.                                00671000
006720     GO TO CICS-RETURN-TRANSID.                                   00672000
006730 PMP-EXIT.                                                        00673000
006740     EXIT.                                                        00674000
006750******************************************************************00675000
006760 MOVE-PANEL-TO-RECORD SECTION.                                    00676000
006770 MPTR-START.                                                      00677000
006780     MOVE COM-KEY-PRODCODE TO RPXXX13-KEY-PRODCODE.               00678000
006790     MOVE COM-KEY-ACCOUNT TO RPXXX13-KEY-ACCOUNT.                 00679000
006800     MOVE COM-KEY-MODEL TO RPXXX13-KEY-MODEL.                     00680000
006810     MOVE COM-KEY-IDNBR TO RPXXX13-KEY-IDNUMBER.                  00681000
006820     MOVE COM-RCIF-KEY TO RPXXX13-RCIF-KEY.                       00682000
006830     MOVE COM-CUST-NAME TO RPXXX13-CUST-NAME.                     00683000
006840     MOVE COM-IDNUMBER TO RPXXX13-IDNUMBER.                       00684000
006850     MOVE COM-MAXDT TO RPXXX13-MAXDT.                             00685000
006860     MOVE COM-MODEL TO RPXXX13-MODEL.                             00686000
006870     MOVE COM-MODEL-DESC TO RPXXX13-MODEL-DESC.                   00687000
006880     MOVE COM-EXPMM TO RPXXX13-EXPREMMDT.                         00688000
006890     MOVE COM-EXPDD TO RPXXX13-EXPREDDDT.                         00689000
006900     MOVE COM-EXPYY TO RPXXX13-EXPREYYDT.                         00690000
006910     PERFORM PANEL-GET-RPV380.                                    00691000
006920 MPTR-EXIT.                                                       00692000
006930     EXIT.                                                        00693000
006940******************************************************************00694000
006950 BUILD-MAINT-PANEL SECTION.                                       00695000
006960 BMP-START.                                                       00696000
006970     MOVE COM-CUST-NAME TO RPV380-CUSTNA.                         00697000
006980     MOVE RPXXX13-KEY-ACCOUNT TO RPV380-ACCOUNT.                  00698000
006990     MOVE RPXXX13-KEY-PRODCODE TO RPV380-PRODCD.                  00699000
007000     MOVE RPXXX13-KEY-MODEL TO RPV380-MODEL.                      00700000
007010     MOVE RPXXX13-MODEL-DESC TO RPV380-MODDESC.                   00701000
007020     MOVE RPXXX13-IDNUMBER TO RPV380-IDNBR.                       00702000
007030     MOVE RPXXX13-MAXDT TO SR-CODASYL.                            00703000
007040     PERFORM EDIT-CODASYL-DATE.                                   00704000
007050     MOVE SR-CODASYL-EDITED TO RPV380-MAXDT.                      00705000
007060     MOVE RPXXX13-EXPREMMDT TO RPV380-EXPREDMM.                   00706000
007070     MOVE RPXXX13-EXPREDDDT TO RPV380-EXPREDDD.                   00707000
007080     MOVE RPXXX13-EXPREYYDT TO RPV380-EXPREDYY.                   00708000
007090     IF RPXXX13-EXPREMMDT-DCHG IS EQUAL TO 'E'                    00709000
007100         OR RPXXX13-EXPREDDDT-DCHG IS EQUAL TO 'E'                00710000
007110         OR RPXXX13-EXPREYYDT-DCHG IS EQUAL TO 'E'                00711000
007120         MOVE PDB-RPV380-EXPREDMM TO WS-CURSOR-FIELD.             00712000
007130     MOVE PDB-RPV380-NAME TO PAN-NAME.                            00713000
007140 BMP-EXIT.                                                        00714000
007150     EXIT.                                                        00715000
007160******************************************************************00716000
007170 SET-DCHG-INDICATORS SECTION.                                     00717000
007180 SDI-START.                                                       00718000
007190     IF COM-EXPREDMM-DCHG IS EQUAL TO SPACE                       00719000
007200         MOVE PDB-RPV380-EXPREDMM-DCHG TO COM-EXPREDMM-DCHG.      00720000
007210     IF COM-EXPREDDD-DCHG IS EQUAL TO SPACE                       00721000
007220         MOVE PDB-RPV380-EXPREDDD-DCHG TO COM-EXPREDDD-DCHG.      00722000
007230     IF COM-EXPREDYY-DCHG IS EQUAL TO SPACE                       00723000
007240         MOVE PDB-RPV380-EXPREDYY-DCHG TO COM-EXPREDYY-DCHG.      00724000
007250 SDI-EXIT.                                                        00725000
007260     EXIT.                                                        00726000
007270******************************************************************00727000
007280 SET-ATTRIBUTES-AND-MESSAGES SECTION.                             00728000
007290 SAAM-START.                                                      00729000
007300     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00730000
007310         MOVE PDB-RPV380-COMMAND TO WS-CURSOR-FIELD               00731000
007320         MOVE ALL 'P' TO COM-DCHG.                                00732000
007330     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00733000
007340     MOVE COM-EXPREDMM-DCHG TO WS-DCHG-TEST.                      00734000
007350     MOVE PDB-RPV380-EXPREDMM-VID TO PAN-SET-VID.                 00735000
007360     MOVE PDB-RPV380-EXPREDMM-EL TO PAN-SET-EMP.                  00736000
007370     MOVE PDB-RPV380-EXPREDMM TO PAN-SET-FLD.                     00737000
007380     PERFORM SET-ATTRIBUTE.                                       00738000
007390     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00739000
007400     MOVE COM-EXPREDDD-DCHG TO WS-DCHG-TEST.                      00740000
007410     MOVE PDB-RPV380-EXPREDDD-VID TO PAN-SET-VID.                 00741000
007420     MOVE PDB-RPV380-EXPREDDD-EL TO PAN-SET-EMP.                  00742000
007430     MOVE PDB-RPV380-EXPREDDD TO PAN-SET-FLD.                     00743000
007440     PERFORM SET-ATTRIBUTE.                                       00744000
007450     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00745000
007460     MOVE COM-EXPREDYY-DCHG TO WS-DCHG-TEST.                      00746000
007470     MOVE PDB-RPV380-EXPREDYY-VID TO PAN-SET-VID.                 00747000
007480     MOVE PDB-RPV380-EXPREDYY-EL TO PAN-SET-EMP.                  00748000
007490     MOVE PDB-RPV380-EXPREDYY TO PAN-SET-FLD.                     00749000
007500     PERFORM SET-ATTRIBUTE.                                       00750000
007510 SAAM-EXIT.                                                       00751000
007520     EXIT.                                                        00752000
007530******************************************************************00753000
007540 SET-ATTRIBUTE SECTION.                                           00754000
007550 SA-START.                                                        00755000
007560     IF WS-DCHG-EDITERR                                           00756000
007570         ADD +1 TO WS-ERROR-COUNT                                 00757000
007580         MOVE 'Y' TO WS-ERROR                                     00758000
007590         MOVE VIS-ERROR TO PAN-SET-VID                            00759000
007600         MOVE EMP-ERROR TO PAN-SET-EMP.                           00760000
007610     IF WS-DCHG-EDITERR                                           00761000
007620         AND WS-CURSOR-FIELD IS EQUAL TO SPACES                   00762000
007630         MOVE PAN-SET-FLD TO WS-CURSOR-FIELD                      00763000
007640         MOVE PAN-SET-OCC TO WS-CURSOR-OCC.                       00764000
007650     IF WS-DCHG-PROTECT                                           00765000
007660         MOVE VIS-DISPLAY TO PAN-SET-VID                          00766000
007670         MOVE EMP-NORMAL TO PAN-SET-EMP.                          00767000
007680     IF WS-DCHG-HIDDEN                                            00768000
007690         MOVE VIS-DISPLAY TO PAN-SET-VID                          00769000
007700         MOVE EMP-HIDDEN TO PAN-SET-EMP.                          00770000
007710     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00771000
007720     PERFORM CALL-BISPAN-RPV380.                                  00772000
007730 SA-EXIT.                                                         00773000
007740     EXIT.                                                        00774000
007750******************************************************************00775000
007760 MORE-DATA-PANELS SECTION.                                        00776000
007770 MDP-START.                                                       00777000
007780     GO TO PANEL-ROUTER.                                          00778000
007790 MDP-EXIT.                                                        00779000
007800     EXIT.                                                        00780000
007810******************************************************************00781000
007820 CLOSE-TRANSACTION SECTION.                                       00782000
000000 COPY SRP0722.                                                    00783000
007840******************************************************************00784000
007850 PANEL-INIT SECTION.                                              00785000
000000 COPY SRP073.                                                     00786000
007870******************************************************************00787000
007880 BUILD-NEXTKEY SECTION.                                           00788000
007890 BXN-START.                                                       00789000
007900     MOVE SPACES TO WS-NEXTKEY.                                   00790000
007910     MOVE ',' TO WS-DELIM1.                                       00791000
007920     MOVE ',' TO WS-DELIM2.                                       00792000
007930     MOVE ',' TO WS-DELIM3.                                       00793000
007940     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00794000
007950     MOVE COM-KEY-MODEL TO WS-MODEL.                              00795000
007960     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00796000
007970         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00797000
007980     ELSE                                                         00798000
007990         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00799000
008000     MOVE COM-EXTERNALID TO WS-EXTID.                             00800000
008010 BXN-EXIT.                                                        00801000
008020     EXIT.                                                        00802000
008030******************************************************************00803000
008040 ABORT-EXIT SECTION.                                              00804000
008050 AE-START.                                                        00805000
008060     MOVE EIBFN TO COM-ABEIBFN.                                   00806000
008070     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00807000
008080     GO TO CICS-ABORT-EXIT.                                       00808000
008090 AE-EXIT.                                                         00809000
008100     EXIT.                                                        00810000
008110******************************************************************00811000
008120 RPXXX13-LINK-MESSAGE SECTION.                                    00812000
008130 RP13-START.                                                      00813000
008140     MOVE 'Y' TO RPXXX13-GLOBAL-CLOSE.                            00814000
008150     MOVE WS-FILEOPTIONS TO RPXXX13-FILEOPTS.                     00815000
008160     MOVE COM-RETURN TO RPXXX13-RETURN.                           00816000
008170     MOVE COM-DATE TO RPXXX13-DATE.                               00817000
008180     MOVE COM-MODELID TO RPXXX13-MODELID.                         00818000
008190     MOVE COM-SECALT TO RPXXX13-SECALT.                           00819000
008200     MOVE COM-EXTERNALID TO RPXXX13-EXTERNALID.                   00820000
008210     MOVE COM-EIBTRMID TO RPXXX13-TERMID.                         00821000
008220     MOVE COM-WKUNAME TO RPXXX13-WORKID.                          00822000
008230     MOVE COM-TRANSTART TO RPXXX13-TRANSTART.                     00823000
008240     MOVE COM-UPDATE TO RPXXX13-UPDATE.                           00824000
008250     MOVE COM-APPLSEQ TO RPXXX13-APPLSEQ.                         00825000
008260     MOVE WS-RPSAPPLNBR TO RPXXX13-APPL.                          00826000
008270     MOVE 'M' TO RPXXX13-FUNC.                                    00827000
008280     MOVE COM-INST TO RPXXX13-KEY-INST.                           00828000
008290     MOVE COM-PRODCODE TO RPXXX13-KEY-PRODCODE.                   00829000
008300     MOVE COM-KEY-ACCOUNT TO RPXXX13-KEY-ACCOUNT.                 00830000
008310     MOVE COM-KEY-MODEL TO RPXXX13-KEY-MODEL.                     00831000
008320     IF COM-KEY-IDNBR IS NUMERIC                                  00832000
008330         AND COM-KEY-IDNBR IS GREATER THAN ZEROS                  00833000
008340         MOVE COM-KEY-IDNBR TO RPXXX13-KEY-IDNUMBER               00834000
008350         MOVE 'Y' TO RPXXX13-KEY-IDNUMBER-DCHG.                   00835000
008360     MOVE RPV380-EXPREDMM TO RPXXX13-EXPREMMDT.                   00836000
008370     MOVE RPV380-EXPREDDD TO RPXXX13-EXPREDDDT.                   00837000
008380     MOVE RPV380-EXPREDYY TO RPXXX13-EXPREYYDT.                   00838000
008390     MOVE PDB-RPV380-EXPREDMM-DCHG TO RPXXX13-EXPREMMDT-DCHG.     00839000
008400     MOVE PDB-RPV380-EXPREDDD-DCHG TO RPXXX13-EXPREDDDT-DCHG.     00840000
008410     MOVE PDB-RPV380-EXPREDYY-DCHG TO RPXXX13-EXPREYYDT-DCHG.     00841000
008420     MOVE COM-OPERID TO RPXXX13-OPERID.                           00842000
008430     MOVE COM-LANG TO RPXXX13-COM-LANG.                           00843000
008440     MOVE COM-CURN-CODE TO RPXXX13-COM-CURNCD.                    00844000
008450     MOVE COM-INST-OPTS TO RPXXX13-INST-OPTS.                     00845000
008460     EXEC CICS LINK                                               00846000
008470         PROGRAM('RPLXXX13')                                      00847000
008480         COMMAREA(RPXXX13-MESSAGE)                                00848000
008490         LENGTH(LENGTH OF RPXXX13-MESSAGE)                        00849000
008500         RESP(WS-CICS-RESPONSE)                                   00850000
008510         END-EXEC.                                                00851000
008520     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00852000
008530         MOVE 'RPLXXX13 LINK FAILED' TO COM-ABMSG                 00853000
008540         MOVE WS-TR0002 TO COM-ABTRACE                            00854000
008550         MOVE WS-AB0009 TO COM-ABORT                              00855000
008560         GO TO CICS-ABORT-EXIT.                                   00856000
008570     MOVE RPXXX13-FUNCTION TO WS-FUNCTION.                        00857000
008580     IF RPXXX13-ABORT IS NOT EQUAL TO ZERO                        00858000
008590         MOVE RPXXX13-ABORT TO COM-ABORT                          00859000
008600         MOVE RPXXX13-ABTRACE TO COM-ABTRACE                      00860000
008610         MOVE RPXXX13-ABEIBFN TO COM-ABEIBFN                      00861000
008620         MOVE RPXXX13-ABEIBRCODE TO COM-ABEIBRCODE                00862000
008630         MOVE RPXXX13-ABPROGID TO COM-ABPROGID                    00863000
008640         MOVE RPXXX13-SRBMDB TO COM-SRBMDB                        00864000
008650         MOVE RPXXX13-ABTYPE TO COM-ABTYPE                        00865000
008660         MOVE RPXXX13-ABMSG TO COM-ABMSG                          00866000
008670         GO TO CICS-ABORT-EXIT.                                   00867000
008680     MOVE RPXXX13-FUNC TO COM-FUNC.                               00868000
008690     MOVE RPXXX13-ABORT TO COM-ABORT.                             00869000
008700     MOVE RPXXX13-MSGNBR TO WS-MSGNBR.                            00870000
008710 RP13-EXIT.                                                       00871000
008720     EXIT.                                                        00872000
008730******************************************************************00873000
008740 CLOSE-PANEL SECTION.                                             00874000
008750 CP-START.                                                        00875000
008760     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00876000
008770     IF COM-RETURN IS EQUAL TO 'E'                                00877000
008780         PERFORM CALL-BISPAN-RPV380K.                             00878000
008790     IF COM-RETURN IS EQUAL TO '1'                                00879000
008800         PERFORM CALL-BISPAN-RPV380.                              00880000
008810 CP-EXIT.                                                         00881000
008820     EXIT.                                                        00882000
008830******************************************************************00883000
008840 CALL-BISPAN-RPV380K SECTION.                                     00884000
008850 CBD1-START.                                                      00885000
008860     CALL 'BISPAN' USING                                          00886000
008870         BICRPSB,                                                 00887000
008880         BICRSRB,                                                 00888000
008890         BICRPAN,                                                 00889000
008900         RPV380K-PANL-DATA-BLOCK,                                 00890000
008910         RPV380K-PANL-DATA-AREA.                                  00891000
008920 CBD1-EXIT.                                                       00892000
008930     EXIT.                                                        00893000
008940******************************************************************00894000
008950 CALL-BISPAN-RPV380 SECTION.                                      00895000
008960 CBD2-START.                                                      00896000
008970     CALL 'BISPAN' USING                                          00897000
008980         BICRPSB,                                                 00898000
008990         BICRSRB,                                                 00899000
009000         BICRPAN,                                                 00900000
009010         RPV380-PANL-DATA-BLOCK,                                  00901000
009020         RPV380-PANL-DATA-AREA.                                   00902000
009030 CBD2-EXIT.                                                       00903000
009040     EXIT.                                                        00904000
009050******************************************************************00905000
009060 PANEL-GET-RPV380 SECTION.                                        00906000
009070 PANEL-GET-RPV380-START.                                          00907000
009080     MOVE 'N' TO RPV380-SW-SET-CURSOR.                            00908000
009090     MOVE PDB-RPV380-NAME TO PAN-NAME.                            00909000
009100     MOVE REQ-GET TO PAN-REQ-VERB.                                00910000
009110     CALL 'BISPAN' USING                                          00911000
009120         BICRPSB                                                  00912000
009130         BICRSRB                                                  00913000
009140         BICRPAN                                                  00914000
009150         RPV380-PANL-DATA-BLOCK,                                  00915000
009160         RPV380-PANL-DATA-AREA.                                   00916000
009170 PANEL-GET-RPV380-EXIT.                                           00917000
009180     EXIT.                                                        00918000
009190******************************************************************00919000
009200 PANEL-PUT-RPV380 SECTION.                                        00920000
009210 PANEL-PUT-RPV380-START.                                          00921000
009220     MOVE PDB-RPV380-NAME TO PAN-NAME.                            00922000
009230     MOVE REQ-PUT TO PAN-REQ-VERB.                                00923000
009240     CALL 'BISPAN' USING                                          00924000
009250         BICRPSB                                                  00925000
009260         BICRSRB                                                  00926000
009270         BICRPAN                                                  00927000
009280         RPV380-PANL-DATA-BLOCK,                                  00928000
009290         RPV380-PANL-DATA-AREA.                                   00929000
009300 PANEL-PUT-RPV380-EXIT.                                           00930000
009310     EXIT.                                                        00931000
009320******************************************************************00932000
009330 PANEL-GET-RPV380K SECTION.                                       00933000
009340 PANEL-GET-RPV380K-START.                                         00934000
009350     MOVE 'N' TO RPV380K-SW-SET-CURSOR.                           00935000
009360     MOVE PDB-RPV380K-NAME TO PAN-NAME.                           00936000
009370     MOVE REQ-GET TO PAN-REQ-VERB.                                00937000
009380     CALL 'BISPAN' USING                                          00938000
009390         BICRPSB                                                  00939000
009400         BICRSRB                                                  00940000
009410         BICRPAN                                                  00941000
009420         RPV380K-PANL-DATA-BLOCK,                                 00942000
009430         RPV380K-PANL-DATA-AREA.                                  00943000
009440 PANEL-GET-RPV380K-EXIT.                                          00944000
009450     EXIT.                                                        00945000
009460******************************************************************00946000
009470 PANEL-PUT-RPV380K SECTION.                                       00947000
009480 PANEL-PUT-RPV380K-START.                                         00948000
009490     MOVE PDB-RPV380K-NAME TO PAN-NAME.                           00949000
009500     MOVE REQ-PUT TO PAN-REQ-VERB.                                00950000
009510     CALL 'BISPAN' USING                                          00951000
009520         BICRPSB                                                  00952000
009530         BICRSRB                                                  00953000
009540         BICRPAN                                                  00954000
009550         RPV380K-PANL-DATA-BLOCK,                                 00955000
009560         RPV380K-PANL-DATA-AREA.                                  00956000
009570 PANEL-PUT-RPV380K-EXIT.                                          00957000
009580     EXIT.                                                        00958000
009590******************************************************************00959000
009600 MIC-MST-API SECTION.                                             00960000
000000 COPY MIPMSTA.                                                    00961000
009620******************************************************************00962000
009630 EDIT-ACCOUNT-KEY SECTION.                                        00963000
009640 EAK-START.                                                       00964000
009650     MOVE COM-INST TO RPW130-INST.                                00965000
009660     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 00966000
009670     MOVE COM-KEY-PRODCODE TO RPW130-PRODCODE.                    00967000
009680     MOVE COM-KEY-ACCOUNT TO RPW130-ACCOUNTINPUT.                 00968000
009690     MOVE 'V' TO RPW130-FUNCTION.                                 00969000
009700     PERFORM ACCOUNT-KEY-EDIT.                                    00970000
009710     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00971000
009720         MOVE '500003' TO WS-MSGNBR                               00972000
009730         GO TO EAK-EXIT.                                          00973000
009740     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00974000
009750     MOVE RPW130-ACCOUNTKEY TO COM-KEY-ACCOUNT.                   00975000
009760     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          00976000
009770     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      00977000
009780     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                00978000
009790 EAK-EXIT.                                                        00979000
009800     EXIT.                                                        00980000
009810******************************************************************00981000
009820 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 00982000
000000 COPY RPP033.                                                     00983000
009840******************************************************************00984000
009850 ACCOUNT-KEY-EDIT SECTION.                                        00985000
000000 COPY RPP130.                                                     00986000
009870******************************************************************00987000
009880 LEFT-JUSTIFY SECTION.                                            00988000
000000 COPY SRP068.                                                     00989000
009900******************************************************************00990000
009910 RIGHT-JUSTIFY SECTION.                                           00991000
000000 COPY SRP026.                                                     00992000
009930******************************************************************00993000
009940 PARAMETER-SEARCH SECTION.                                        00994000
000000 COPY SRP030.                                                     00995000
009960******************************************************************00996000
009970 COMPRESS-NEXTKEY SECTION.                                        00997000
000000 COPY SRP070.                                                     00998000
009990******************************************************************00999000
010000 GET-MESSAGE SECTION.                                             01000000
000000 COPY SRP071.                                                     01001000
010020******************************************************************01002000
010030 EDIT-CODASYL-DATE SECTION.                                       01003000
000000 COPY SRP087.                                                     01004000
010050******************************************************************01005000
010060 EXAMINE-FIELD SECTION.                                           01006000
000000 COPY SRP166.                                                     01007000
010080******************************************************************01008000
010090 SRP170-ROUTINE SECTION.                                          01009000
000000 COPY SRP170.                                                     01010000
010110******************************************************************01011000
010120 BUILD-PFKEY-LINE SECTION.                                        01012000
000000 COPY SRP710.                                                     01013000
010140******************************************************************01014000
010150 VALIDATE-PFKEYS SECTION.                                         01015000
000000 COPY SRP711.                                                     01016000
010170******************************************************************01017000
010180 SLP096-GET-2023-RECORD SECTION.                                  01018000
000000 COPY SLP096.                                                     01019000
010200******************************************************************01020000
010210 CICS-XCTL SECTION.                                               01021000
000000 COPY SLP704.                                                     01022000
010230******************************************************************01023000
010240 CICS-RETURN-TRANSID SECTION.                                     01024000
000000 COPY SLP710.                                                     01025000
010260******************************************************************01026000
010270 TSQ-DELETE SECTION.                                              01027000
010280 TSQD-START.                                                      01028000
010290 TSQD-EXIT.                                                       01029000
010300     EXIT.                                                        01030000
010310******************************************************************01031000
010320 CICS-TSQ-READ SECTION.                                           01032000
000000 COPY SLP744.                                                     01033000
010340******************************************************************01034000
010350 CICS-ABORT-EXIT SECTION.                                         01035000
000000 COPY SLP798.                                                     01036000
010370******************************************************************01037000
