000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL320.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL320 - OUTSIDE RELATIONSHIP                               *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW105-AREAS.                                                00016000
000000 COPY SRW105.                                                     00017000
000180*01  BICRSRB.                                                     00018000
000000 COPY BICRSRB.                                                    00019000
000200*01  BICRPSB.                                                     00020000
000000 COPY BICRPSB.                                                    00021000
000220*01  BICRVERB.                                                    00022000
000000 COPY BICRVERB.                                                   00023000
000240*01  BICRSTAT.                                                    00024000
000000 COPY BICRSTAT.                                                   00025000
000260*01  BICRCONS.                                                    00026000
000000 COPY BICRCONS.                                                   00027000
000280*01  BICRDBS.                                                     00028000
000000 COPY BICRDBS.                                                    00029000
000300*01  BICRPAN.                                                     00030000
000000 COPY BICRPAN.                                                    00031000
000320 01  SRW710-AREAS.                                                00032000
000000 COPY SRW710.                                                     00033000
000340 01  RPV320K-PANL-DATA-BLOCK.                                     00034000
000000 COPY RPV320KW.                                                   00035000
000360 01  RPV320-PANL-DATA-BLOCK.                                      00036000
000000 COPY RPV320W.                                                    00037000
000380 01  WS-WORKAREAS.                                                00038000
000390     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00039000
000400     03  WS-ACCOUNT-ERROR        PIC X(01)       VALUE SPACES.    00040000
000410     03  WS-NEXTKEY.                                              00041000
000420         05  WS-EXTID            PIC X(08).                       00042000
000430         05  WS-DELIM1           PIC X(01)       VALUE ','.       00043000
000440         05  WS-DATA.                                             00044000
000450             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00045000
000460             07  WS-DELIM2       PIC X(01)       VALUE ','.       00046000
000470             07  WS-ACCTX.                                        00047000
000480                 09  WS-ACCT     PIC Z(18)       VALUE ZERO.      00048000
000490             07  WS-DELIM3       PIC X(01)       VALUE ','.       00049000
000500             07  WS-RECTYPE      PIC X(01)       VALUE SPACES.    00050000
000510             07  WS-DELIM4       PIC X(01)       VALUE ','.       00051000
000520             07  WS-MODELX.                                       00052000
000530                 09  WS-MODEL    PIC X(10)       VALUE SPACES.    00053000
000540         05  FILLER              PIC X(31)       VALUE SPACES.    00054000
000550     03  WS-SUB1                 PIC S9(04)      COMP             00055000
000560                                                 VALUE +0000.     00056000
000570     03  WS-PDATE                PIC 9(08).                       00057000
000580     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00058000
000590         05  WS-PDATE-YYYY       PIC 9(04).                       00059000
000600         05  WS-PDATE-MM         PIC 9(02).                       00060000
000610         05  WS-PDATE-DD         PIC 9(02).                       00061000
000620     03  WS-DCHG-TEST            PIC X(01)       VALUE SPACES.    00062000
000630         88  WS-DCHG-PROTECT                     VALUE 'P'.       00063000
000640         88  WS-DCHG-EDITERR                     VALUE 'E'.       00064000
000650         88  WS-DCHG-HIDDEN                      VALUE 'N'.       00065000
000660         88  WS-DCHG-BYPASSED                    VALUE 'B'.       00066000
000670     03  WS-ERROR-COUNT          PIC S9(04)      COMP             00067000
000680                                                 VALUE +0000.     00068000
000690 01  WS-LINKMSG                  PIC X(4500).                     00069000
000700 01  RPXXX04-MESSAGE.                                             00070000
000000 COPY MISCNT00      REPLACING                                     00071000
000720             ==:MICNT:== BY ==RPXXX04==.                          00072000
000000 COPY RPSXXX04.                                                   00073000
000740 01  WS-TSQAREAS.                                                 00074000
000750     03  WS-TSQITEM              PIC S9(04)      COMP             00075000
000760                                                 VALUE +0001.     00076000
000770     03  WS-TSQLGTH              PIC S9(04)      COMP             00077000
000780                                                 VALUE +4096.     00078000
000790     03  WS-TSQKEY.                                               00079000
000800         05  WS-TSQID            PIC X(04).                       00080000
000810         05  WS-TSQTRMID         PIC X(04).                       00081000
000820 01  LS-TSQAREA.                                                  00082000
000830     03  LS-TSQKEY               PIC X(08).                       00083000
000840     03  LS-TSQDATA              PIC X(4088).                     00084000
000850 01  MIWPRI-AREAS.                                                00085000
000000 COPY MIWPRI.                                                     00086000
000870 01  MIWMSTA-AREAS.                                               00087000
000000 COPY MIWMSTA.                                                    00088000
000890 01  MIMST-RECORD.                                                00089000
000000 COPY MISMST.                                                     00090000
000910 01  MI2023-RECORD.                                               00091000
000000 COPY MIS2023A.                                                   00092000
000930 01  WS-ABORTCODES.                                               00093000
000940     03  WS-AB0009               PIC S9(04)      COMP             00094000
000950                                                 VALUE +0009.     00095000
000960     03  WS-AB0106               PIC S9(04)      COMP             00096000
000970                                                 VALUE +0106.     00097000
000980     03  WS-AB2033               PIC S9(04)      COMP             00098000
000990                                                 VALUE +2033.     00099000
001000 01  WS-TRACECODES.                                               00100000
001010     03  WS-TR0001               PIC S9(04)      COMP             00101000
001020                                                 VALUE +0001.     00102000
001030     03  WS-TR0002               PIC S9(04)      COMP             00103000
001040                                                 VALUE +0002.     00104000
001050 01  RPW014-AREAS.                                                00105000
000000 COPY RPW014.                                                     00106000
001070 01  RPW033-AREAS.                                                00107000
000000 COPY RPW033.                                                     00108000
001090 01  SLW096-AREAS.                                                00109000
000000 COPY SLW096.                                                     00110000
001110 01  SRW025-AREAS.                                                00111000
000000 COPY SRW025.                                                     00112000
001130 01  SRW030-AREAS.                                                00113000
000000 COPY SRW030.                                                     00114000
001150 01  SRW031-AREAS.                                                00115000
000000 COPY SRW031.                                                     00116000
001170 01  RPW130-AREAS.                                                00117000
000000 COPY RPW130.                                                     00118000
001190 01  SRW161-AREAS.                                                00119000
000000 COPY SRW161.                                                     00120000
001210 01  SRW166-AREAS.                                                00121000
000000 COPY SRW166.                                                     00122000
001230 01  SRW170-AREAS.                                                00123000
000000 COPY SRW170.                                                     00124000
001250 COPY DFHAID.                                                     00125000
001260******************************************************************00126000
001270 LINKAGE SECTION.                                                 00127000
001280 01  DFHCOMMAREA.                                                 00128000
000000 COPY SLS1112.                                                    00129000
001300     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00130000
001310         05  COM-EDIT-DATE       PIC X(10).                       00131000
001320         05  COM-PANEL-ACTION    PIC X(01).                       00132000
001330             88  INITIAL-PANEL                   VALUE ' '.       00133000
001340             88  EDIT-PANEL                      VALUE 'E'.       00134000
001350         05  COM-FROM-PANEL      PIC X(01).                       00135000
001360             88  FROM-KEY-PANEL                  VALUE 'K'.       00136000
001370             88  FROM-MAINT-PANEL                VALUE 'M'.       00137000
001380             88  FROM-BREAKAWAY                  VALUE 'B'.       00138000
001390             88  FROM-HELP                       VALUE 'H'.       00139000
001400         05  COM-KEY-FIELDS.                                      00140000
001410             07  COM-KEY-PRODCODE                                 00141000
001420                                 PIC X(06).                       00142000
001430             07  COM-KEY-ACCOUNT PIC X(18).                       00143000
001440             07  COM-KEY-ACCOUNT-N                                00144000
001450                         REDEFINES COM-KEY-ACCOUNT                00145000
001460                                 PIC 9(18).                       00146000
001470             07  COM-KEY-MODELX  PIC X(10).                       00147000
001480             07  COM-KEY-MODEL                                    00148000
001490                         REDEFINES COM-KEY-MODELX                 00149000
001500                                 PIC X(10).                       00150000
001510             07  COM-KEY-IDNBRX  PIC X(18).                       00151000
001520             07  COM-KEY-IDNBR                                    00152000
001530                         REDEFINES COM-KEY-IDNBRX                 00153000
001540                                 PIC 9(18).                       00154000
001550         05  COM-KEY-FORMATTEDACCT                                00155000
001560                                 PIC X(22).                       00156000
001570         05  COM-KEY-MSGNBR      PIC X(06).                       00157000
001580         05  COM-KEY-COMMAND     PIC X(50).                       00158000
001590         05  COM-MODEL           PIC X(10).                       00159000
001600         05  COM-MODEL-DESC      PIC X(20).                       00160000
001610         05  COM-IDNBR-CHANGE    PIC X(01).                       00161000
001620         05  COM-CUST-TYPE       PIC X(01).                       00162000
001630         05  COM-CUST-NAME       PIC X(40).                       00163000
001640         05  COM-KEY-BRANCH      PIC S9(05)      COMP-3.          00164000
001650         05  COM-KEY-ACCT-TYPE                                    00165000
001660                                 PIC S9(03)      COMP-3.          00166000
001670         05  COM-IDNUMBER        PIC 9(18).                       00167000
001680         05  COM-KEY-INCOPT      PIC X(01).                       00168000
001690         05  COM-KEY-RTOPT       PIC X(01).                       00169000
001700         05  COM-KEY-APPL        PIC 9(02).                       00170000
001710         05  COM-RP-PRODCODE     PIC X(06).                       00171000
001720         05  COM-CURSOR          PIC X(08).                       00172000
001730         05  COM-DCHG.                                            00173000
001740             07  FILLER                          OCCURS 10 TIMES. 00174000
001750                 09  COM-INST2-DCHG                               00175000
001760                                 PIC X(01).                       00176000
001770                 09  COM-PRODCODE-DCHG                            00177000
001780                                 PIC X(01).                       00178000
001790                 09  COM-ACCOUNT-DCHG                             00179000
001800                                 PIC X(01).                       00180000
001810                 09  COM-MODEL-DCHG                               00181000
001820                                 PIC X(01).                       00182000
001830******************************************************************00183000
001840*01  SLW096-2023RECORDS.                                          00184000
000000 COPY SLW096L.                                                    00185000
001860******************************************************************00186000
001870 PROCEDURE DIVISION.                                              00187000
001880******************************************************************00188000
001890 ENTRY-ROUTINE SECTION.                                           00189000
001900     MOVE 'RPL320' TO COM-ABPROGID.                               00190000
000000 COPY SLP771.                                                     00191000
001920******************************************************************00192000
001930 TRANSACTION-CLEAN-UP SECTION.                                    00193000
001940 TCU-START.                                                       00194000
001950 TCU-EXIT.                                                        00195000
001960     EXIT.                                                        00196000
001970******************************************************************00197000
001980 CICS-HANDLE-CONDITION SECTION.                                   00198000
000000 COPY SLP772.                                                     00199000
002000     MOVE WS-AB2033 TO COM-ABORT.                                 00200000
002010     MOVE WS-TR0001 TO COM-ABTRACE.                               00201000
002020     GO TO ABORT-EXIT.                                            00202000
002030 CHC-EXIT.                                                        00203000
002040     EXIT.                                                        00204000
002050******************************************************************00205000
002060 ROUTING-ROUTINE SECTION.                                         00206000
002070 RR-START.                                                        00207000
002080     MOVE LOW-VALUES TO RPXXX04-MESSAGE.                          00208000
002090     MOVE LOW-VALUES TO RPV320K-PANL-DATA-AREA.                   00209000
002100     MOVE LOW-VALUES TO RPV320-PANL-DATA-AREA.                    00210000
002110     MOVE ZERO TO WS-MSGNBR.                                      00211000
002120     MOVE 'RP00' TO WS-TSQFILEID.                                 00212000
002130     MOVE 'RPI' TO WS-TSQSYSID.                                   00213000
002140     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00214000
002150         MOVE COM-PAN TO BICRPAN                                  00215000
002160         MOVE COM-PSB TO BICRPSB                                  00216000
002170         MOVE COM-SRB TO BICRSRB                                  00217000
002180     ELSE                                                         00218000
002190         MOVE '1' TO BPSB-LEVEL.                                  00219000
002200     IF COM-RETURN IS EQUAL TO 'B'                                00220000
002210         GO TO BREAKAWAY-RETURN.                                  00221000
002220     IF COM-RETURN IS EQUAL TO '0'                                00222000
002230         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00223000
002240         MOVE SPACES TO COM-WORKAREAS                             00224000
002250         MOVE '1' TO SRB-VERSION                                  00225000
002260         MOVE 'IPRP' TO SRB-APPL-ID                               00226000
002270         MOVE 'RPL320' TO SRB-PROG-ID                             00227000
002280         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00228000
002290         MOVE 'P' TO PAN-TYPE                                     00229000
002300         MOVE SPACE TO PAN-OVERLAY                                00230000
002310         MOVE SPACE TO PAN-CLOSE                                  00231000
002320         MOVE SPACE TO PAN-ALARM                                  00232000
002330         MOVE SPACE TO PAN-CURSOR-PAN                             00233000
002340         MOVE SPACE TO PAN-CURSOR-FLD                             00234000
002350         MOVE SPACE TO PAN-SET-FLD                                00235000
002360         MOVE SPACE TO PAN-SET-VID                                00236000
002370         MOVE SPACE TO PAN-SET-EMP                                00237000
002380         MOVE PDB-RPV320K-NAME TO PAN-NAME                        00238000
002390         PERFORM PANEL-INIT                                       00239000
002400         MOVE BICRPAN TO COM-PAN                                  00240000
002410         MOVE BICRPSB TO COM-PSB                                  00241000
002420         MOVE BICRSRB TO COM-SRB                                  00242000
002430         PERFORM INITIALIZE-DATES                                 00243000
002440         GO TO PANEL-ROUTER.                                      00244000
002450     PERFORM PANEL-NAME-SET.                                      00245000
002460     IF COM-HELPSW IS EQUAL TO 'Y'                                00246000
002470         GO TO HELP-RETURN.                                       00247000
002480     PERFORM PANEL-RECEIVE.                                       00248000
002490     PERFORM PANEL-DATA-GET.                                      00249000
002500     IF FROM-MAINT-PANEL                                          00250000
002510         PERFORM SET-DCHG-INDICATORS.                             00251000
002520     PERFORM PANEL-PFKEY-SET.                                     00252000
002530     PERFORM VALIDATE-PFKEYS.                                     00253000
002540     IF EIBAID IS EQUAL TO DFHPF1                                 00254000
002550         GO TO GET-HELP.                                          00255000
002560     IF EIBAID IS EQUAL TO DFHPF11                                00256000
002570         GO TO BREAK-AWAY.                                        00257000
002580     IF (COM-RETURN IS EQUAL TO 'E')                              00258000
002590         AND (EIBAID IS EQUAL TO DFHPF2                           00259000
002600         OR EIBAID IS EQUAL TO DFHPF3                             00260000
002610         OR EIBAID IS EQUAL TO DFHPF4                             00261000
002620         OR EIBAID IS EQUAL TO DFHPF7                             00262000
002630         OR EIBAID IS EQUAL TO DFHPF8                             00263000
002640         OR EIBAID IS EQUAL TO DFHPF12)                           00264000
002650         GO TO CLOSE-TRANSACTION.                                 00265000
002660     IF COM-RETURN IS EQUAL TO '1'                                00266000
002670         AND EIBAID IS EQUAL TO DFHPF12                           00267000
002680         GO TO CLOSE-TRANSACTION.                                 00268000
002690     IF COM-RETURN IS EQUAL TO '0'                                00269000
002700         OR COM-RETURN IS EQUAL TO 'E'                            00270000
002710         OR COM-RETURN IS EQUAL TO '1'                            00271000
002720         GO TO PANEL-ROUTER.                                      00272000
002730 RR-END.                                                          00273000
002740     GO TO CLOSE-TRANSACTION.                                     00274000
002750 RR-EXIT.                                                         00275000
002760     EXIT.                                                        00276000
002770******************************************************************00277000
002780 INITIALIZE-DATES SECTION.                                        00278000
002790 ID-START.                                                        00279000
002800     MOVE COM-DATE TO WS-CURDATE8.                                00280000
002810     MOVE '-' TO WS-CD8DSH1.                                      00281000
002820     MOVE '-' TO WS-CD8DSH2.                                      00282000
002830     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00283000
002840 ID-EXIT.                                                         00284000
002850     EXIT.                                                        00285000
002860******************************************************************00286000
002870 PANEL-NAME-SET SECTION.                                          00287000
002880 PNS-START.                                                       00288000
002890     IF COM-RETURN IS EQUAL TO '0'                                00289000
002900         MOVE PDB-RPV320K-NAME TO PAN-NAME.                       00290000
002910     IF COM-RETURN IS EQUAL TO 'E'                                00291000
002920         MOVE PDB-RPV320-NAME TO PAN-NAME.                        00292000
002930     IF COM-RETURN IS EQUAL TO '1'                                00293000
002940         MOVE PDB-RPV320-NAME TO PAN-NAME.                        00294000
002950 PNS-EXIT.                                                        00295000
002960     EXIT.                                                        00296000
002970******************************************************************00297000
002980 PANEL-DATA-GET SECTION.                                          00298000
002990 PDG-START.                                                       00299000
003000     IF COM-RETURN IS EQUAL TO '0'                                00300000
003010         PERFORM PANEL-GET-RPV320K.                               00301000
003020     IF COM-RETURN IS EQUAL TO 'E'                                00302000
003030         PERFORM PANEL-GET-RPV320K                                00303000
003040         MOVE RPV320K-COMMAND TO WS-NEXTKEY                       00304000
003050         MOVE PDB-RPV320K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00305000
003060     IF COM-RETURN IS EQUAL TO '1'                                00306000
003070         PERFORM PANEL-GET-RPV320                                 00307000
003080         MOVE RPV320-COMMAND TO WS-NEXTKEY                        00308000
003090         MOVE PDB-RPV320-COMMAND-DCHG TO WS-COMMAND-DCHG.         00309000
003100 PDG-EXIT.                                                        00310000
003110     EXIT.                                                        00311000
003120******************************************************************00312000
003130 PANEL-PFKEY-SET SECTION.                                         00313000
003140 PPS-START.                                                       00314000
003150 PPS-EXIT.                                                        00315000
003160     EXIT.                                                        00316000
003170******************************************************************00317000
003180 PANEL-ROUTER SECTION.                                            00318000
003190 PR-START.                                                        00319000
003200     IF COM-RETURN IS EQUAL TO '0'                                00320000
003210         GO TO PROCESS-KEY-PANEL.                                 00321000
003220     IF COM-RETURN IS EQUAL TO 'E'                                00322000
003230         GO TO PROCESS-KEY-PANEL.                                 00323000
003240     IF COM-RETURN IS EQUAL TO '1'                                00324000
003250         GO TO PROCESS-MAINT-PANEL.                               00325000
003260     GO TO CLOSE-TRANSACTION.                                     00326000
003270 PR-EXIT.                                                         00327000
003280     EXIT.                                                        00328000
003290******************************************************************00329000
003300 HELP-RETURN SECTION.                                             00330000
000000 COPY SRP074.                                                     00331000
003320******************************************************************00332000
003330 HELP-RETURN-FINISH SECTION.                                      00333000
003340 HRF-START.                                                       00334000
003350     PERFORM PANEL-DATA-GET.                                      00335000
003360     MOVE 'H' TO COM-FROM-PANEL.                                  00336000
003370     GO TO PANEL-ROUTER.                                          00337000
003380 HRF-EXIT.                                                        00338000
003390     EXIT.                                                        00339000
003400******************************************************************00340000
003410 HELP-MISSING-FINISH SECTION.                                     00341000
003420 HMF-START.                                                       00342000
003430     MOVE 'H' TO COM-FROM-PANEL.                                  00343000
003440     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00344000
003450     GO TO PANEL-ROUTER.                                          00345000
003460 HMF-EXIT.                                                        00346000
003470     EXIT.                                                        00347000
003480******************************************************************00348000
003490 BREAK-AWAY SECTION.                                              00349000
000000 COPY SRP0752.                                                    00350000
003510******************************************************************00351000
003520 BREAKAWAY-RETURN-FINISH SECTION.                                 00352000
003530 BRF-START.                                                       00353000
003540     PERFORM PANEL-DATA-GET.                                      00354000
003550     MOVE 'B' TO COM-FROM-PANEL.                                  00355000
003560     GO TO PANEL-ROUTER.                                          00356000
003570 BRF-EXIT.                                                        00357000
003580     EXIT.                                                        00358000
003590******************************************************************00359000
003600 PROCESS-KEY-PANEL SECTION.                                       00360000
003610 PKP-START.                                                       00361000
003620     IF INITIAL-PANEL                                             00362000
003630         GO TO PKP-CONTINUE.                                      00363000
003640     IF EDIT-PANEL                                                00364000
003650         AND FROM-MAINT-PANEL                                     00365000
003660         MOVE SPACE TO COM-FROM-PANEL                             00366000
003670         GO TO PKP-RELOAD-PANEL.                                  00367000
003680 PKP-CONTINUE.                                                    00368000
003690     MOVE COM-NEXTKEY TO SR-PSLIST.                               00369000
003700     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00370000
003710         GO TO PKP-SEND-PANEL.                                    00371000
003720 PKP-BEGIN-EDITS.                                                 00372000
003730     IF EDIT-PANEL                                                00373000
003740         MOVE RPV320K-PRODCD TO COM-KEY-PRODCODE                  00374000
003750         MOVE RPV320K-ACCOUNT TO COM-KEY-ACCOUNT                  00375000
003760         MOVE RPV320K-MODEL TO COM-KEY-MODELX                     00376000
003770         MOVE RPV320K-IDNBR TO COM-KEY-IDNBRX                     00377000
003780         GO TO PKP-RETURN-EDITS.                                  00378000
003790     PERFORM PARAMETER-SEARCH.                                    00379000
003800     MOVE SR-PSPARM TO COM-EXTID.                                 00380000
003810     MOVE SR-PSPARM TO COM-EXTERNALID.                            00381000
003820     PERFORM PARAMETER-SEARCH.                                    00382000
003830     MOVE SR-PSPARM TO COM-KEY-PRODCODE.                          00383000
003840     PERFORM PARAMETER-SEARCH.                                    00384000
003850     MOVE SR-PSPARM TO COM-KEY-ACCOUNT.                           00385000
003860     PERFORM PARAMETER-SEARCH.                                    00386000
003870     MOVE SR-PSPARM TO COM-KEY-MODELX.                            00387000
003880     PERFORM PARAMETER-SEARCH.                                    00388000
003890     MOVE SR-PSPARM TO COM-KEY-IDNBRX.                            00389000
003900 PKP-RETURN-EDITS.                                                00390000
003910     IF COM-KEY-PRODCODE IS EQUAL TO SPACE                        00391000
003920         MOVE LOW-VALUE TO COM-KEY-PRODCODE.                      00392000
003930     IF COM-KEY-ACCOUNT IS EQUAL TO SPACE                         00393000
003940         MOVE LOW-VALUE TO COM-KEY-ACCOUNT.                       00394000
003950     IF COM-KEY-MODELX IS EQUAL TO SPACES                         00395000
003960         MOVE LOW-VALUES TO COM-KEY-MODELX.                       00396000
003970     IF COM-KEY-IDNBRX IS EQUAL TO SPACES                         00397000
003980         MOVE LOW-VALUES TO COM-KEY-IDNBRX.                       00398000
003990     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00399000
004000         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00400000
004010         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00401000
004020         AND COM-KEY-IDNBRX IS GREATER THAN LOW-VALUES            00402000
004030         GO TO PKP-RETURN-CONT.                                   00403000
004040     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00404000
004050         MOVE '000002' TO WS-MSGNBR                               00405000
004060         GO TO PKP-RETURN-CONT.                                   00406000
004070     PERFORM EDIT-ACCOUNT-KEY.                                    00407000
004080 PKP-RETURN-CONT.                                                 00408000
004090     IF INITIAL-PANEL                                             00409000
004100         AND COM-KEY-PRODCODE IS EQUAL TO LOW-VALUES              00410000
004110         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUES               00411000
004120         AND COM-KEY-MODELX IS EQUAL TO LOW-VALUES                00412000
004130         AND COM-KEY-IDNBRX IS EQUAL TO LOW-VALUES                00413000
004140         MOVE '000001' TO WS-MSGNBR                               00414000
004150         GO TO PKP-SEND-PANEL.                                    00415000
004160 PKP-RETURN-MODEL.                                                00416000
004170     MOVE COM-KEY-IDNBRX TO SR-JUSTIFYIN.                         00417000
004180     MOVE +0018 TO SR-JLGTH.                                      00418000
004190     PERFORM RIGHT-JUSTIFY.                                       00419000
004200     IF SR-JUSTIFYOUT IS EQUAL TO SPACE                           00420000
004210         MOVE ZEROS TO COM-KEY-IDNBRX                             00421000
004220     ELSE                                                         00422000
004230         MOVE SR-JUSTIFYOUT TO COM-KEY-IDNBRX.                    00423000
004240     IF COM-KEY-IDNBRX IS NOT NUMERIC                             00424000
004250         MOVE ZEROES TO COM-KEY-IDNBRX.                           00425000
004260     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00426000
004270     MOVE COM-KEY-MODEL TO COM-MODEL.                             00427000
004280     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00428000
004290     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00429000
004300         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00430000
004310     ELSE                                                         00431000
004320         MOVE ZERO TO COM-ACCOUNT.                                00432000
004330     IF FROM-BREAKAWAY                                            00433000
004340         OR FROM-HELP                                             00434000
004350         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00435000
004360         GO TO PKP-RELOAD-PANEL.                                  00436000
004370     IF COM-KEY-PRODCODE IS GREATER THAN SPACES                   00437000
004380         AND COM-KEY-ACCOUNT IS GREATER THAN SPACES               00438000
004390         AND COM-KEY-MODEL IS GREATER THAN SPACES                 00439000
004400         AND COM-KEY-IDNBRX IS GREATER THAN ZEROS                 00440000
004410         MOVE '000002' TO WS-MSGNBR                               00441000
004420         GO TO PKP-RELOAD-PANEL.                                  00442000
004430 PKP-EDITS-READY.                                                 00443000
004440     MOVE SPACE TO COM-PANEL-ACTION.                              00444000
004450     MOVE '1' TO COM-RETURN.                                      00445000
004460     MOVE 'K' TO COM-FROM-PANEL.                                  00446000
004470     GO TO PANEL-ROUTER.                                          00447000
004480 PKP-RELOAD-PANEL.                                                00448000
004490     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00449000
004500         MOVE LOW-VALUES TO RPV320K-PRODCD                        00450000
004510     ELSE                                                         00451000
004520         MOVE COM-KEY-PRODCODE TO RPV320K-PRODCD.                 00452000
004530     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00453000
004540         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROS                     00454000
004550         MOVE LOW-VALUES TO RPV320K-ACCOUNT                       00455000
004560     ELSE                                                         00456000
004570         MOVE COM-KEY-ACCOUNT TO RPV320K-ACCOUNT.                 00457000
004580     MOVE COM-KEY-MODELX TO RPV320K-MODEL.                        00458000
004590     IF COM-KEY-MODELX IS EQUAL TO SPACES                         00459000
004600         MOVE LOW-VALUES TO RPV320K-MODEL.                        00460000
004610     MOVE COM-KEY-IDNBRX TO RPV320K-IDNBR.                        00461000
004620     IF COM-KEY-IDNBRX IS NOT GREATER THAN ZEROS                  00462000
004630         MOVE LOW-VALUES TO RPV320K-IDNBR.                        00463000
004640 PKP-SEND-PANEL.                                                  00464000
004650     MOVE PDB-RPV320K-NAME TO PAN-NAME.                           00465000
004660     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00466000
004670     IF (FROM-HELP                                                00467000
004680         OR FROM-BREAKAWAY)                                       00468000
004690         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00469000
004700         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00470000
004710     ELSE                                                         00471000
004720         IF WS-CURSOR-FIELD IS EQUAL TO SPACE                     00472000
004730             MOVE PDB-RPV320K-PRODCD TO PAN-SET-FLD               00473000
004740         ELSE                                                     00474000
004750             MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                 00475000
004760     PERFORM CALL-BISPAN-RPV320K.                                 00476000
004770     MOVE COM-OPERID TO RPV320K-OPERID.                           00477000
004780     MOVE COM-INST TO RPV320K-INST.                               00478000
004790     MOVE COM-EDIT-DATE TO RPV320K-SYSDATE.                       00479000
004800     IF RPV320K-PRODCD IS EQUAL TO SPACES                         00480000
004810         MOVE LOW-VALUES TO RPV320K-PRODCD.                       00481000
004820     IF RPV320K-MODEL IS EQUAL TO SPACES                          00482000
004830         MOVE LOW-VALUES TO RPV320K-MODEL.                        00483000
004840     MOVE RPV320K-ACCOUNT TO SR-JUSTIFYIN.                        00484000
004850     MOVE +18 TO SR-JLGTH.                                        00485000
004860     PERFORM LEFT-JUSTIFY.                                        00486000
004870     MOVE SR-JUSTIFYOUT TO RPV320K-ACCOUNT.                       00487000
004880     IF RPV320K-ACCOUNT IS EQUAL TO SPACES                        00488000
004890         MOVE LOW-VALUES TO RPV320K-ACCOUNT.                      00489000
004900     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00490000
004910         MOVE WS-HELPMSG TO WS-MSGNBR.                            00491000
004920     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00492000
004930         MOVE '000027' TO WS-MSGNBR                               00493000
004940     ELSE                                                         00494000
004950         PERFORM BUILD-NEXTKEY                                    00495000
004960         PERFORM COMPRESS-NEXTKEY                                 00496000
004970         MOVE WS-NEXTKEY TO RPV320K-COMMAND.                      00497000
004980     IF FROM-BREAKAWAY                                            00498000
004990         OR FROM-HELP                                             00499000
005000         MOVE SPACES TO COM-FROM-PANEL                            00500000
005010         MOVE COM-KEY-COMMAND TO RPV320K-COMMAND                  00501000
005020         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00502000
005030     ELSE                                                         00503000
005040         MOVE RPV320K-COMMAND TO COM-KEY-COMMAND                  00504000
005050         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00505000
005060     MOVE 'E' TO COM-RETURN.                                      00506000
005070     PERFORM GET-MESSAGE.                                         00507000
005080     MOVE WS-MESSAGE TO RPV320K-MSGLINE.                          00508000
005090     PERFORM PANEL-PFKEY-SET.                                     00509000
005100     PERFORM BUILD-PFKEY-LINE.                                    00510000
005110     MOVE WS-PFLINE1 TO RPV320K-PFLINE1.                          00511000
005120     MOVE WS-PFLINE2 TO RPV320K-PFLINE2.                          00512000
005130     PERFORM PANEL-PUT-RPV320K.                                   00513000
005140     PERFORM PANEL-SEND.                                          00514000
005150     MOVE 'E' TO COM-PANEL-ACTION.                                00515000
005160     MOVE COM-INTID TO WS-TRANSID.                                00516000
005170     GO TO CICS-RETURN-TRANSID.                                   00517000
005180 PKP-EXIT.                                                        00518000
005190     EXIT.                                                        00519000
005200******************************************************************00520000
005210 PROCESS-MAINT-PANEL SECTION.                                     00521000
005220 PMP-START.                                                       00522000
005230     IF FROM-BREAKAWAY                                            00523000
005240         OR FROM-HELP                                             00524000
005250         GO TO PMP-SEND-PANEL.                                    00525000
005260     MOVE 'E' TO COM-END.                                         00526000
005270     IF INITIAL-PANEL                                             00527000
005280         MOVE LOW-VALUES TO RPV320-PANL-DATA-AREA                 00528000
005290         MOVE SPACES TO COM-DCHG                                  00529000
005300         MOVE SPACES TO COM-PANEL-ACTION                          00530000
005310         MOVE 'VKL' TO RPXXX04-APIFUNC                            00531000
005320         GO TO PMP-LINK-TO-RPLXXX04.                              00532000
005330 PMP-PFKEYS.                                                      00533000
005340     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00534000
005350         MOVE SPACES TO WS-CURSOR-FIELD                           00535000
005360         GO TO PMP-SEND-PANEL.                                    00536000
005370     IF EIBAID IS EQUAL TO DFHPF4                                 00537000
005380         GO TO PMP-CONTINUE.                                      00538000
005390     MOVE COM-NEXTKEY TO WS-NEXTKEY.                              00539000
005400 PMP-CONTINUE.                                                    00540000
005410     MOVE ZERO TO WS-MSGNBR.                                      00541000
005420     MOVE +0 TO WS-ERROR-COUNT.                                   00542000
005430     MOVE COM-DCHG TO SRW166-FIELD.                               00543000
005440     MOVE 'E' TO SRW166-IN.                                       00544000
005450     MOVE 'Y' TO SRW166-OUT.                                      00545000
005460* MOVE THE LENGTH OF THE COM-DCHG FIELD:                          00546000
005470     MOVE +30 TO SRW166-LGTH.                                     00547000
005480     PERFORM EXAMINE-FIELD.                                       00548000
005490     MOVE SRW166-FIELD TO COM-DCHG.                               00549000
005500     MOVE COM-DCHG TO RPXXX04-DCHG.                               00550000
005510     PERFORM MOVE-PANEL-TO-RECORD.                                00551000
005520     IF WS-ACCOUNT-ERROR IS EQUAL TO 'X'                          00552000
005530         MOVE '500003' TO WS-MSGNBR                               00553000
005540         GO TO PMP-SEND-PANEL.                                    00554000
005550     IF COM-DCHG IS EQUAL TO SPACES                               00555000
005560         AND (EIBAID IS EQUAL TO DFHPF3                           00556000
005570         OR EIBAID IS EQUAL TO DFHPF4)                            00557000
005580         GO TO CLOSE-TRANSACTION.                                 00558000
005590     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00559000
005600         OR COM-IDNBR-CHANGE IS EQUAL TO 'Y'                      00560000
005610         GO TO CLOSE-TRANSACTION.                                 00561000
005620 PMP-LINK-TO-RPLXXX04.                                            00562000
005630     MOVE COM-DCHG TO RPXXX04-DCHG.                               00563000
005640     IF INITIAL-PANEL                                             00564000
005650         MOVE 'VKL' TO RPXXX04-APIFUNC.                           00565000
005660     IF EDIT-PANEL                                                00566000
005670         MOVE 'UPD' TO RPXXX04-APIFUNC.                           00567000
005680     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00568000
005690         MOVE 'EDT' TO RPXXX04-APIFUNC.                           00569000
005700     PERFORM RPXXX04-LINK-MESSAGE.                                00570000
005710     IF RPXXX04-RETURN IS EQUAL TO 'E'                            00571000
005720         MOVE 'E' TO COM-PANEL-ACTION                             00572000
005730         MOVE 'E' TO COM-RETURN                                   00573000
005740         MOVE 'M' TO COM-FROM-PANEL                               00574000
005750         GO TO PANEL-ROUTER.                                      00575000
005760     IF RPXXX04-APIFUNC IS EQUAL TO 'UPD'                         00576000
005770         AND RPXXX04-IDNBR-CHANGE IS NOT EQUAL TO 'Y'             00577000
005780         GO TO CLOSE-TRANSACTION.                                 00578000
005790     MOVE RPXXX04-UPDATE TO COM-UPDATE.                           00579000
005800     IF RPXXX04-APIFUNC IS EQUAL TO 'VKL'                         00580000
005810         MOVE RPXXX04-CUST-NAME TO COM-CUST-NAME.                 00581000
005820 PMP-MOVE-RECORD-TO-PANEL.                                        00582000
005830     MOVE RPXXX04-DCHG TO COM-DCHG.                               00583000
005840     IF COM-PRODCODE IS EQUAL TO LOW-VALUES                       00584000
005850         MOVE RPXXX04-KEY-PRODCODE TO COM-PRODCODE                00585000
005860         MOVE RPXXX04-KEY-PRODCODE TO COM-KEY-PRODCODE            00586000
005870         MOVE RPXXX04-KEY-ACCOUNT TO COM-KEY-ACCOUNT              00587000
005880         MOVE RPXXX04-KEY-MODEL TO COM-KEY-MODEL.                 00588000
005890     MOVE COM-PRODCODE TO RPV320-PRODCD.                          00589000
005900     MOVE COM-KEY-ACCOUNT TO RPV320-ACCOUNT.                      00590000
005910     MOVE COM-KEY-MODEL TO RPV320-MODEL.                          00591000
005920     PERFORM MOVE-RECORD-TO-PANEL.                                00592000
005930 PMP-SEND-PANEL.                                                  00593000
005940     MOVE PDB-RPV320-NAME TO PAN-NAME.                            00594000
005950     MOVE COM-INST TO RPV320-INST.                                00595000
005960     MOVE COM-OPERID TO RPV320-OPERID.                            00596000
005970     MOVE COM-EDIT-DATE TO RPV320-SYSDATE.                        00597000
005980     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00598000
005990         MOVE WS-HELPMSG TO WS-MSGNBR.                            00599000
006000     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00600000
006010         MOVE '000027' TO WS-MSGNBR                               00601000
006020     ELSE                                                         00602000
006030         PERFORM BUILD-NEXTKEY                                    00603000
006040         PERFORM COMPRESS-NEXTKEY                                 00604000
006050         MOVE WS-NEXTKEY TO RPV320-COMMAND.                       00605000
006060     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00606000
006070         OR COM-IDNBR-CHANGE IS EQUAL TO 'Y'                      00607000
006080         MOVE ALL 'P' TO COM-DCHG                                 00608000
006090         MOVE PDB-RPV320-COMMAND TO WS-CURSOR-FIELD.              00609000
006100     IF COM-IDNBR-CHANGE IS EQUAL TO 'Y'                          00610000
006110         MOVE '500002' TO WS-MSGNBR.                              00611000
006120     MOVE SPACES TO RPXXX04-APIFUNC.                              00612000
006130     PERFORM SET-ATTRIBUTES-AND-MESSAGES.                         00613000
006140     IF (FROM-HELP                                                00614000
006150         OR FROM-BREAKAWAY)                                       00615000
006160         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00616000
006170         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00617000
006180         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00618000
006190     ELSE                                                         00619000
006200         IF WS-CURSOR-FIELD IS EQUAL TO SPACE                     00620000
006210             MOVE PDB-RPV320-INSTX TO PAN-SET-FLD                 00621000
006220             MOVE +1 TO PAN-SET-OCC                               00622000
006230         ELSE                                                     00623000
006240             MOVE WS-CURSOR-FIELD TO PAN-SET-FLD                  00624000
006250             MOVE WS-CURSOR-OCC TO PAN-SET-OCC.                   00625000
006260     IF FROM-BREAKAWAY                                            00626000
006270         OR FROM-HELP                                             00627000
006280         MOVE SPACE TO COM-FROM-PANEL                             00628000
006290         MOVE COM-KEY-COMMAND TO RPV320-COMMAND                   00629000
006300         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00630000
006310     ELSE                                                         00631000
006320         MOVE RPV320-COMMAND TO COM-KEY-COMMAND                   00632000
006330         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00633000
006340     PERFORM GET-MESSAGE.                                         00634000
006350     MOVE WS-MESSAGE TO RPV320-MSGLINE.                           00635000
006360     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00636000
006370     PERFORM CALL-BISPAN-RPV320.                                  00637000
006380     PERFORM PANEL-PFKEY-SET.                                     00638000
006390     PERFORM BUILD-PFKEY-LINE.                                    00639000
006400     MOVE WS-PFLINE1 TO RPV320-PFLINE1.                           00640000
006410     MOVE WS-PFLINE2 TO RPV320-PFLINE2.                           00641000
006420     PERFORM PANEL-PUT-RPV320.                                    00642000
006430     PERFORM PANEL-SEND.                                          00643000
006440     MOVE 'M' TO COM-FROM-PANEL.                                  00644000
006450     MOVE '1' TO COM-RETURN.                                      00645000
006460     MOVE 'E' TO COM-PANEL-ACTION.                                00646000
006470     MOVE COM-INTID TO WS-TRANSID.                                00647000
006480     GO TO CICS-RETURN-TRANSID.                                   00648000
006490 PMP-EXIT.                                                        00649000
006500     EXIT.                                                        00650000
006510******************************************************************00651000
006520 MOVE-PANEL-TO-RECORD SECTION.                                    00652000
006530 MPTR-START.                                                      00653000
006540     MOVE SPACES TO RPXXX04-GRP-DATA.                             00654000
006550     MOVE COM-KEY-MODEL TO RPXXX04-KEY-MODEL.                     00655000
006560     MOVE COM-MODEL-DESC TO RPXXX04-MODEL-DESC.                   00656000
006570     MOVE COM-CUST-TYPE TO RPXXX04-CUST-TYPE.                     00657000
006580     MOVE COM-CUST-NAME TO RPXXX04-CUST-NAME.                     00658000
006590     MOVE COM-KEY-BRANCH TO RPXXX04-KEY-BRANCH.                   00659000
006600     MOVE COM-KEY-ACCT-TYPE TO RPXXX04-KEY-ACCT-TYPE.             00660000
006610     MOVE COM-IDNUMBER TO RPXXX04-IDNUMBER.                       00661000
006620     MOVE COM-KEY-INCOPT TO RPXXX04-KEY-INCOPT.                   00662000
006630     MOVE COM-KEY-RTOPT TO RPXXX04-KEY-RTOPT.                     00663000
006640     MOVE COM-KEY-APPL TO RPXXX04-KEY-APPL.                       00664000
006650     MOVE COM-RP-PRODCODE TO RPXXX04-RP-PRODCODE.                 00665000
006660     MOVE +0 TO WS-SUB1.                                          00666000
006670 MPTR-LOOP.                                                       00667000
006680     ADD +0001 TO WS-SUB1.                                        00668000
006690     IF WS-SUB1 IS GREATER THAN +0010                             00669000
006700         GO TO MPTR-EXIT.                                         00670000
006710     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00671000
006720     PERFORM PANEL-GET-OCCUR-RPV320.                              00672000
006730     IF RPV320-INSTX IS EQUAL TO LOW-VALUES                       00673000
006740         MOVE SPACES TO RPV320-INSTX.                             00674000
006750     MOVE RPV320-INSTX TO RPXXX04-INST2 (WS-SUB1).                00675000
006760     IF RPV320-PRODCDX IS EQUAL TO LOW-VALUES                     00676000
006770         MOVE SPACES TO RPV320-PRODCDX.                           00677000
006780     MOVE RPV320-PRODCDX TO RPXXX04-PRODCODE (WS-SUB1).           00678000
006790     IF RPV320-ACCTX IS EQUAL TO LOW-VALUES                       00679000
006800         MOVE SPACES TO RPV320-ACCTX.                             00680000
006810     MOVE RPV320-ACCTX TO RPXXX04-ACCOUNT (WS-SUB1).              00681000
006820     IF RPXXX04-PRODCODE (WS-SUB1) IS EQUAL TO SPACES             00682000
006830         OR RPXXX04-ACCOUNT (WS-SUB1) IS EQUAL TO SPACES          00683000
006840         GO TO MPTR-LOOP.                                         00684000
006850     MOVE COM-INST TO RPW130-INST.                                00685000
006860     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 00686000
006870     MOVE RPXXX04-PRODCODE (WS-SUB1) TO RPW130-PRODCODE.          00687000
006880     MOVE RPXXX04-ACCOUNT (WS-SUB1) TO RPW130-ACCOUNTINPUT.       00688000
006890     MOVE 'V' TO RPW130-FUNCTION.                                 00689000
006900     PERFORM ACCOUNT-KEY-EDIT.                                    00690000
006910     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00691000
006920         MOVE 'X' TO WS-ACCOUNT-ERROR                             00692000
006930         MOVE 'E' TO COM-PRODCODE-DCHG (WS-SUB1)                  00693000
006940         MOVE 'E' TO COM-ACCOUNT-DCHG (WS-SUB1)                   00694000
006950         GO TO MPTR-LOOP.                                         00695000
006960     MOVE RPW130-ACCOUNTKEY TO RPXXX04-ACCOUNT (WS-SUB1).         00696000
006970     GO TO MPTR-LOOP.                                             00697000
006980 MPTR-EXIT.                                                       00698000
006990     EXIT.                                                        00699000
007000******************************************************************00700000
007010 MOVE-RECORD-TO-PANEL SECTION.                                    00701000
007020 MRTP-START.                                                      00702000
007030     MOVE RPXXX04-IDNBR-CHANGE TO COM-IDNBR-CHANGE.               00703000
007040     MOVE RPXXX04-KEY-MODEL TO COM-KEY-MODEL.                     00704000
007050     MOVE COM-KEY-MODEL TO RPV320-MODEL.                          00705000
007060     MOVE RPXXX04-MODEL-DESC TO COM-MODEL-DESC.                   00706000
007070     MOVE COM-MODEL-DESC TO RPV320-MODDESC.                       00707000
007080     MOVE RPXXX04-CUST-NAME TO COM-CUST-NAME.                     00708000
007090     MOVE COM-CUST-NAME TO RPV320-CUSTNA.                         00709000
007100     IF RPXXX04-FUNC IS EQUAL TO 'M'                              00710000
007110         MOVE '* EXISTING RELATIONSHIP *' TO RPV320-RELTYPE.      00711000
007120     MOVE RPXXX04-IDNUMBER TO COM-IDNUMBER.                       00712000
007130     MOVE COM-IDNUMBER TO RPV320-IDNBR.                           00713000
007140     MOVE RPXXX04-CUST-TYPE TO COM-CUST-TYPE.                     00714000
007150     MOVE RPXXX04-KEY-BRANCH TO COM-KEY-BRANCH.                   00715000
007160     MOVE RPXXX04-KEY-ACCT-TYPE TO COM-KEY-ACCT-TYPE.             00716000
007170     MOVE RPXXX04-KEY-INCOPT TO COM-KEY-INCOPT.                   00717000
007180     MOVE RPXXX04-KEY-RTOPT TO COM-KEY-RTOPT.                     00718000
007190     MOVE RPXXX04-KEY-APPL TO COM-KEY-APPL.                       00719000
007200     MOVE RPXXX04-RP-PRODCODE TO COM-RP-PRODCODE.                 00720000
007210     MOVE +0 TO WS-SUB1.                                          00721000
007220 MRTP-LOOP.                                                       00722000
007230     ADD +0001 TO WS-SUB1.                                        00723000
007240     IF WS-SUB1 IS GREATER THAN +0010                             00724000
007250         GO TO MRTP-EXIT.                                         00725000
007260     MOVE RPXXX04-INST2 (WS-SUB1) TO RPV320-INSTX.                00726000
007270     IF RPV320-INSTX IS EQUAL TO SPACES                           00727000
007280         MOVE LOW-VALUES TO RPV320-INSTX.                         00728000
007290 MRTP-PRODCODE.                                                   00729000
007300     MOVE RPXXX04-PRODCODE (WS-SUB1) TO RPV320-PRODCDX.           00730000
007310     IF RPV320-PRODCDX IS EQUAL TO SPACES                         00731000
007320         MOVE LOW-VALUES TO RPV320-PRODCDX.                       00732000
007330 MRTP-ACCT.                                                       00733000
007340     MOVE RPXXX04-ACCOUNT (WS-SUB1) TO RPV320-ACCTX.              00734000
007350     IF RPV320-ACCTX IS EQUAL TO SPACES                           00735000
007360         MOVE LOW-VALUES TO RPV320-ACCTX.                         00736000
007370 MRTP-CONT.                                                       00737000
007380     MOVE PDB-RPV320-NAME TO PAN-NAME.                            00738000
007390     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00739000
007400     PERFORM PANEL-PUT-OCCUR-RPV320.                              00740000
007410     GO TO MRTP-LOOP.                                             00741000
007420 MRTP-EXIT.                                                       00742000
007430     EXIT.                                                        00743000
007440******************************************************************00744000
007450 SET-DCHG-INDICATORS SECTION.                                     00745000
007460 SDI-START.                                                       00746000
007470     MOVE +0 TO WS-SUB1.                                          00747000
007480 SDI-LOOP.                                                        00748000
007490     ADD +0001 TO WS-SUB1.                                        00749000
007500     IF WS-SUB1 IS GREATER THAN +0010                             00750000
007510         GO TO SDI-EXIT.                                          00751000
007520     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00752000
007530     PERFORM PANEL-GET-OCCUR-RPV320.                              00753000
007540     IF COM-INST2-DCHG (WS-SUB1) IS EQUAL TO SPACE                00754000
007550         MOVE PDB-RPV320-INSTX-DCHG                               00755000
007560             TO COM-INST2-DCHG (WS-SUB1).                         00756000
007570     IF COM-PRODCODE-DCHG (WS-SUB1) IS EQUAL TO SPACE             00757000
007580         MOVE PDB-RPV320-PRODCDX-DCHG                             00758000
007590             TO COM-PRODCODE-DCHG (WS-SUB1).                      00759000
007600     IF COM-ACCOUNT-DCHG (WS-SUB1) IS EQUAL TO SPACE              00760000
007610         MOVE PDB-RPV320-ACCTX-DCHG                               00761000
007620             TO COM-ACCOUNT-DCHG (WS-SUB1).                       00762000
007630     IF COM-MODEL-DCHG (WS-SUB1) IS EQUAL TO SPACE                00763000
007640         MOVE PDB-RPV320-MODEL-DCHG                               00764000
007650             TO COM-MODEL-DCHG (WS-SUB1).                         00765000
007660     GO TO SDI-LOOP.                                              00766000
007670 SDI-EXIT.                                                        00767000
007680     EXIT.                                                        00768000
007690******************************************************************00769000
007700 SET-ATTRIBUTES-AND-MESSAGES SECTION.                             00770000
007710 SAAM-START.                                                      00771000
007720     MOVE ZERO TO WS-SUB1.                                        00772000
007730 SAAM-LOOP.                                                       00773000
007740     ADD +1 TO WS-SUB1.                                           00774000
007750     IF WS-SUB1 IS GREATER THAN +0010                             00775000
007760         GO TO SAAM-PROTECT.                                      00776000
007770     MOVE WS-SUB1 TO PAN-SET-OCC.                                 00777000
007780     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00778000
007790     MOVE COM-INST2-DCHG (WS-SUB1) TO WS-DCHG-TEST.               00779000
007800     MOVE PDB-RPV320-INSTX-VID TO PAN-SET-VID.                    00780000
007810     MOVE PDB-RPV320-INSTX-EL TO PAN-SET-EMP.                     00781000
007820     MOVE PDB-RPV320-INSTX TO PAN-SET-FLD.                        00782000
007830     PERFORM SET-ATTRIBUTE.                                       00783000
007840     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00784000
007850     MOVE COM-PRODCODE-DCHG (WS-SUB1) TO WS-DCHG-TEST.            00785000
007860     MOVE PDB-RPV320-PRODCDX-VID TO PAN-SET-VID.                  00786000
007870     MOVE PDB-RPV320-PRODCDX-EL TO PAN-SET-EMP.                   00787000
007880     MOVE PDB-RPV320-PRODCDX TO PAN-SET-FLD.                      00788000
007890     PERFORM SET-ATTRIBUTE.                                       00789000
007900     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00790000
007910     MOVE COM-ACCOUNT-DCHG (WS-SUB1) TO WS-DCHG-TEST.             00791000
007920     MOVE PDB-RPV320-ACCTX-VID TO PAN-SET-VID.                    00792000
007930     MOVE PDB-RPV320-ACCTX-EL TO PAN-SET-EMP.                     00793000
007940     MOVE PDB-RPV320-ACCTX TO PAN-SET-FLD.                        00794000
007950     PERFORM SET-ATTRIBUTE.                                       00795000
007960     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00796000
007970     MOVE COM-MODEL-DCHG (WS-SUB1) TO WS-DCHG-TEST.               00797000
007980     MOVE PDB-RPV320-MODEL-VID TO PAN-SET-VID.                    00798000
007990     MOVE PDB-RPV320-MODEL-EL TO PAN-SET-EMP.                     00799000
008000     MOVE PDB-RPV320-MODEL TO PAN-SET-FLD.                        00800000
008010     PERFORM SET-ATTRIBUTE.                                       00801000
008020     GO TO SAAM-LOOP.                                             00802000
008030 SAAM-PROTECT.                                                    00803000
008040     MOVE VIS-DISPLAY TO PAN-SET-VID.                             00804000
008050     MOVE EMP-HIDDEN TO PAN-SET-EMP.                              00805000
008060     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00806000
008070 SAAM-PROTECT-LOOP.                                               00807000
008080     IF WS-SUB1 IS GREATER THAN +0010                             00808000
008090         GO TO SAAM-EXIT.                                         00809000
008100     MOVE WS-SUB1 TO PAN-SET-OCC.                                 00810000
008110     MOVE PDB-RPV320-INSTX TO PAN-SET-FLD.                        00811000
008120     PERFORM CALL-BISPAN-RPV320.                                  00812000
008130     MOVE PDB-RPV320-PRODCDX TO PAN-SET-FLD.                      00813000
008140     PERFORM CALL-BISPAN-RPV320.                                  00814000
008150     MOVE PDB-RPV320-ACCTX TO PAN-SET-FLD.                        00815000
008160     PERFORM CALL-BISPAN-RPV320.                                  00816000
008170     MOVE PDB-RPV320-MODEL TO PAN-SET-FLD.                        00817000
008180     PERFORM CALL-BISPAN-RPV320.                                  00818000
008190     ADD +1 TO WS-SUB1.                                           00819000
008200     GO TO SAAM-PROTECT-LOOP.                                     00820000
008210 SAAM-EXIT.                                                       00821000
008220     EXIT.                                                        00822000
008230******************************************************************00823000
008240 SET-ATTRIBUTE SECTION.                                           00824000
008250 SA-START.                                                        00825000
008260     IF WS-DCHG-EDITERR                                           00826000
008270         ADD +1 TO WS-ERROR-COUNT                                 00827000
008280         MOVE 'Y' TO WS-ERROR                                     00828000
008290         MOVE VIS-ERROR TO PAN-SET-VID                            00829000
008300         MOVE EMP-ERROR TO PAN-SET-EMP.                           00830000
008310     IF WS-DCHG-EDITERR                                           00831000
008320         AND WS-CURSOR-FIELD IS EQUAL TO SPACES                   00832000
008330         MOVE PAN-SET-FLD TO WS-CURSOR-FIELD                      00833000
008340         MOVE PAN-SET-OCC TO WS-CURSOR-OCC.                       00834000
008350     IF WS-DCHG-PROTECT                                           00835000
008360         MOVE VIS-DISPLAY TO PAN-SET-VID                          00836000
008370         MOVE EMP-NORMAL TO PAN-SET-EMP.                          00837000
008380     IF WS-DCHG-HIDDEN                                            00838000
008390         MOVE VIS-DISPLAY TO PAN-SET-VID                          00839000
008400         MOVE EMP-HIDDEN TO PAN-SET-EMP.                          00840000
008410     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00841000
008420     PERFORM CALL-BISPAN-RPV320.                                  00842000
008430 SA-EXIT.                                                         00843000
008440     EXIT.                                                        00844000
008450******************************************************************00845000
008460 MORE-DATA-PANELS SECTION.                                        00846000
008470 MDP-START.                                                       00847000
008480     GO TO PANEL-ROUTER.                                          00848000
008490 MDP-EXIT.                                                        00849000
008500     EXIT.                                                        00850000
008510******************************************************************00851000
008520 CLOSE-TRANSACTION SECTION.                                       00852000
000000 COPY SRP0722.                                                    00853000
008540******************************************************************00854000
008550 PANEL-INIT SECTION.                                              00855000
000000 COPY SRP073.                                                     00856000
008570******************************************************************00857000
008580 BUILD-NEXTKEY SECTION.                                           00858000
008590 BXN-START.                                                       00859000
008600     MOVE SPACES TO WS-NEXTKEY.                                   00860000
008610     MOVE ',' TO WS-DELIM1.                                       00861000
008620     MOVE ',' TO WS-DELIM2.                                       00862000
008630     MOVE ',' TO WS-DELIM3.                                       00863000
008640     MOVE ',' TO WS-DELIM4.                                       00864000
008650     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00865000
008660     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00866000
008670         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00867000
008680     ELSE                                                         00868000
008690         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00869000
008700     IF COM-KEY-MODELX IS NOT NUMERIC                             00870000
008710         MOVE COM-KEY-MODELX TO WS-MODELX                         00871000
008720     ELSE                                                         00872000
008730         MOVE COM-KEY-MODEL TO WS-MODEL.                          00873000
008740     MOVE COM-EXTERNALID TO WS-EXTID.                             00874000
008750 BXN-EXIT.                                                        00875000
008760     EXIT.                                                        00876000
008770******************************************************************00877000
008780 ABORT-EXIT SECTION.                                              00878000
008790 AE-START.                                                        00879000
008800     MOVE EIBFN TO COM-ABEIBFN.                                   00880000
008810     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00881000
008820     GO TO CICS-ABORT-EXIT.                                       00882000
008830 AE-EXIT.                                                         00883000
008840     EXIT.                                                        00884000
008850******************************************************************00885000
008860 RPXXX04-LINK-MESSAGE SECTION.                                    00886000
008870 CXLM-START.                                                      00887000
008880     MOVE 'Y' TO RPXXX04-GLOBAL-CLOSE.                            00888000
008890     MOVE WS-FILEOPTIONS TO RPXXX04-FILEOPTS.                     00889000
008900     MOVE COM-RETURN TO RPXXX04-RETURN.                           00890000
008910     MOVE COM-MODELID TO RPXXX04-MODELID.                         00891000
008920     MOVE COM-SECALT TO RPXXX04-SECALT.                           00892000
008930     MOVE COM-OPERID TO RPXXX04-OPERID.                           00893000
008940     MOVE COM-DATE TO RPXXX04-DATE.                               00894000
008950     MOVE COM-EXTERNALID TO RPXXX04-EXTERNALID.                   00895000
008960     MOVE COM-EIBTRMID TO RPXXX04-TERMID.                         00896000
008970     MOVE COM-WKUNAME TO RPXXX04-WORKID.                          00897000
008980     MOVE COM-TRANSTART TO RPXXX04-TRANSTART.                     00898000
008990     MOVE COM-APPLSEQ TO RPXXX04-APPLSEQ.                         00899000
009000     MOVE COM-UPDATE TO RPXXX04-UPDATE.                           00900000
009010     MOVE WS-RPSAPPLNBR TO RPXXX04-APPL.                          00901000
009020     MOVE COM-FUNC TO RPXXX04-FUNC.                               00902000
009030     MOVE COM-INST TO RPXXX04-KEY-INST.                           00903000
009040     MOVE COM-PRODCODE TO RPXXX04-KEY-PRODCODE.                   00904000
009050     MOVE COM-KEY-ACCOUNT TO RPXXX04-KEY-ACCOUNT.                 00905000
009060     MOVE COM-KEY-MODEL TO RPXXX04-KEY-MODEL.                     00906000
009070     MOVE COM-KEY-IDNBRX TO RPXXX04-KEY-IDNUMBER.                 00907000
009080     IF COM-KEY-IDNBRX IS EQUAL TO LOW-VALUES                     00908000
009090         MOVE ZEROS TO RPXXX04-KEY-IDNUMBER.                      00909000
009100     MOVE ZERO TO RPXXX04-ERRCNT.                                 00910000
009110     MOVE ZERO TO RPXXX04-MSGNBR.                                 00911000
009120     MOVE COM-LANG TO RPXXX04-COM-LANG.                           00912000
009130     MOVE COM-CURN-CODE TO RPXXX04-COM-CURNCD.                    00913000
009140     MOVE COM-INST-OPTS TO RPXXX04-INST-OPTS.                     00914000
009150     EXEC CICS LINK                                               00915000
009160         PROGRAM('RPLXXX04')                                      00916000
009170         COMMAREA(RPXXX04-MESSAGE)                                00917000
009180         LENGTH(LENGTH OF RPXXX04-MESSAGE)                        00918000
009190         RESP(WS-CICS-RESPONSE)                                   00919000
009200         END-EXEC.                                                00920000
009210     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00921000
009220         MOVE 'RPLXXX04 LINK FAILED' TO COM-ABMSG                 00922000
009230         MOVE WS-TR0002 TO COM-ABTRACE                            00923000
009240         MOVE WS-AB0009 TO COM-ABORT                              00924000
009250         GO TO CICS-ABORT-EXIT.                                   00925000
009260     MOVE RPXXX04-FUNCTION TO WS-FUNCTION.                        00926000
009270     IF RPXXX04-ABORT IS NOT EQUAL TO ZERO                        00927000
009280         MOVE RPXXX04-ABORT TO COM-ABORT                          00928000
009290         MOVE RPXXX04-ABTRACE TO COM-ABTRACE                      00929000
009300         MOVE RPXXX04-ABEIBFN TO COM-ABEIBFN                      00930000
009310         MOVE RPXXX04-ABEIBRCODE TO COM-ABEIBRCODE                00931000
009320         MOVE RPXXX04-ABPROGID TO COM-ABPROGID                    00932000
009330         MOVE RPXXX04-SRBMDB TO COM-SRBMDB                        00933000
009340         MOVE RPXXX04-ABTYPE TO COM-ABTYPE                        00934000
009350         GO TO CICS-ABORT-EXIT.                                   00935000
009360     MOVE RPXXX04-FUNC TO COM-FUNC.                               00936000
009370     MOVE RPXXX04-ABORT TO COM-ABORT.                             00937000
009380     MOVE RPXXX04-MSGNBR TO WS-MSGNBR.                            00938000
009390 CXLM-EXIT.                                                       00939000
009400     EXIT.                                                        00940000
009410******************************************************************00941000
009420 CLOSE-PANEL SECTION.                                             00942000
009430 CP-START.                                                        00943000
009440     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00944000
009450     IF COM-RETURN IS EQUAL TO 'E'                                00945000
009460         PERFORM CALL-BISPAN-RPV320K.                             00946000
009470     IF COM-RETURN IS EQUAL TO '1'                                00947000
009480         PERFORM CALL-BISPAN-RPV320.                              00948000
009490 CP-EXIT.                                                         00949000
009500     EXIT.                                                        00950000
009510******************************************************************00951000
009520 CALL-BISPAN-RPV320K SECTION.                                     00952000
009530 CBD1-START.                                                      00953000
009540     CALL 'BISPAN' USING                                          00954000
009550         BICRPSB,                                                 00955000
009560         BICRSRB,                                                 00956000
009570         BICRPAN,                                                 00957000
009580         RPV320K-PANL-DATA-BLOCK,                                 00958000
009590         RPV320K-PANL-DATA-AREA.                                  00959000
009600 CBD1-EXIT.                                                       00960000
009610     EXIT.                                                        00961000
009620******************************************************************00962000
009630 CALL-BISPAN-RPV320 SECTION.                                      00963000
009640 CBD2-START.                                                      00964000
009650     CALL 'BISPAN' USING                                          00965000
009660         BICRPSB,                                                 00966000
009670         BICRSRB,                                                 00967000
009680         BICRPAN,                                                 00968000
009690         RPV320-PANL-DATA-BLOCK,                                  00969000
009700         RPV320-PANL-DATA-AREA.                                   00970000
009710 CBD2-EXIT.                                                       00971000
009720     EXIT.                                                        00972000
009730******************************************************************00973000
009740 PANEL-GET-RPV320 SECTION.                                        00974000
009750 PANEL-GET-RPV320-START.                                          00975000
009760     MOVE 'N' TO RPV320-SW-SET-CURSOR.                            00976000
009770     MOVE PDB-RPV320-NAME TO PAN-NAME.                            00977000
009780     MOVE REQ-GET TO PAN-REQ-VERB.                                00978000
009790     CALL 'BISPAN' USING                                          00979000
009800         BICRPSB                                                  00980000
009810         BICRSRB                                                  00981000
009820         BICRPAN                                                  00982000
009830         RPV320-PANL-DATA-BLOCK,                                  00983000
009840         RPV320-PANL-DATA-AREA.                                   00984000
009850 PANEL-GET-RPV320-EXIT.                                           00985000
009860     EXIT.                                                        00986000
009870******************************************************************00987000
009880 PANEL-PUT-RPV320 SECTION.                                        00988000
009890 PANEL-PUT-RPV320-START.                                          00989000
009900     MOVE PDB-RPV320-NAME TO PAN-NAME.                            00990000
009910     MOVE REQ-PUT TO PAN-REQ-VERB.                                00991000
009920     CALL 'BISPAN' USING                                          00992000
009930         BICRPSB                                                  00993000
009940         BICRSRB                                                  00994000
009950         BICRPAN                                                  00995000
009960         RPV320-PANL-DATA-BLOCK,                                  00996000
009970         RPV320-PANL-DATA-AREA.                                   00997000
009980 PANEL-PUT-RPV320-EXIT.                                           00998000
009990     EXIT.                                                        00999000
010000******************************************************************01000000
010010 PANEL-GET-RPV320K SECTION.                                       01001000
010020 PANEL-GET-RPV320K-START.                                         01002000
010030     MOVE 'N' TO RPV320K-SW-SET-CURSOR.                           01003000
010040     MOVE PDB-RPV320K-NAME TO PAN-NAME.                           01004000
010050     MOVE REQ-GET TO PAN-REQ-VERB.                                01005000
010060     CALL 'BISPAN' USING                                          01006000
010070         BICRPSB                                                  01007000
010080         BICRSRB                                                  01008000
010090         BICRPAN                                                  01009000
010100         RPV320K-PANL-DATA-BLOCK,                                 01010000
010110         RPV320K-PANL-DATA-AREA.                                  01011000
010120 PANEL-GET-RPV320K-EXIT.                                          01012000
010130     EXIT.                                                        01013000
010140******************************************************************01014000
010150 PANEL-PUT-RPV320K SECTION.                                       01015000
010160 PANEL-PUT-RPV320K-START.                                         01016000
010170     MOVE PDB-RPV320K-NAME TO PAN-NAME.                           01017000
010180     MOVE REQ-PUT TO PAN-REQ-VERB.                                01018000
010190     CALL 'BISPAN' USING                                          01019000
010200         BICRPSB                                                  01020000
010210         BICRSRB                                                  01021000
010220         BICRPAN                                                  01022000
010230         RPV320K-PANL-DATA-BLOCK,                                 01023000
010240         RPV320K-PANL-DATA-AREA.                                  01024000
010250 PANEL-PUT-RPV320K-EXIT.                                          01025000
010260     EXIT.                                                        01026000
010270******************************************************************01027000
010280 PANEL-GET-OCCUR-RPV320 SECTION.                                  01028000
010290 PGORPV320-START.                                                 01029000
010300     MOVE PDB-RPV320-NAME TO PAN-NAME.                            01030000
010310     MOVE REQ-GET-OCCUR TO PAN-REQ-VERB.                          01031000
010320     CALL 'BISPAN' USING                                          01032000
010330         BICRPSB                                                  01033000
010340         BICRSRB                                                  01034000
010350         BICRPAN                                                  01035000
010360         RPV320-PANL-DATA-BLOCK,                                  01036000
010370         RPV320-PANL-DATA-AREA.                                   01037000
010380 PGORPV320-EXIT.                                                  01038000
010390     EXIT.                                                        01039000
010400******************************************************************01040000
010410 PANEL-PUT-OCCUR-RPV320 SECTION.                                  01041000
010420 PPORPV320-START.                                                 01042000
010430     MOVE PDB-RPV320-NAME TO PAN-NAME.                            01043000
010440     MOVE REQ-PUT-OCCUR TO PAN-REQ-VERB.                          01044000
010450     CALL 'BISPAN' USING                                          01045000
010460         BICRPSB                                                  01046000
010470         BICRSRB                                                  01047000
010480         BICRPAN                                                  01048000
010490         RPV320-PANL-DATA-BLOCK,                                  01049000
010500         RPV320-PANL-DATA-AREA.                                   01050000
010510 PPORPV320-EXIT.                                                  01051000
010520     EXIT.                                                        01052000
010530******************************************************************01053000
010540 MIC-MST-API SECTION.                                             01054000
000000 COPY MIPMSTA.                                                    01055000
010560******************************************************************01056000
010570 EDIT-ACCOUNT-KEY SECTION.                                        01057000
010580 EAK-START.                                                       01058000
010590     MOVE COM-INST TO RPW130-INST.                                01059000
010600     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 01060000
010610     MOVE COM-KEY-PRODCODE TO RPW130-PRODCODE.                    01061000
010620     MOVE COM-KEY-ACCOUNT TO RPW130-ACCOUNTINPUT.                 01062000
010630     MOVE 'V' TO RPW130-FUNCTION.                                 01063000
010640     PERFORM ACCOUNT-KEY-EDIT.                                    01064000
010650     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01065000
010660         MOVE '500003' TO WS-MSGNBR                               01066000
010670         GO TO EAK-EXIT.                                          01067000
010680     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       01068000
010690     MOVE RPW130-ACCOUNTKEY TO COM-KEY-ACCOUNT.                   01069000
010700     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          01070000
010710     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      01071000
010720     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                01072000
010730 EAK-EXIT.                                                        01073000
010740     EXIT.                                                        01074000
010750******************************************************************01075000
010760 LEFT-JUSTIFY SECTION.                                            01076000
000000 COPY SRP025.                                                     01077000
010780******************************************************************01078000
010790 RIGHT-JUSTIFY SECTION.                                           01079000
000000 COPY SRP026.                                                     01080000
010810******************************************************************01081000
010820 PARAMETER-SEARCH SECTION.                                        01082000
000000 COPY SRP030.                                                     01083000
010840******************************************************************01084000
010850 COMPRESS-NEXTKEY SECTION.                                        01085000
000000 COPY SRP070.                                                     01086000
010870******************************************************************01087000
010880 GET-MESSAGE SECTION.                                             01088000
000000 COPY SRP071.                                                     01089000
010900******************************************************************01090000
010910 EXAMINE-FIELD SECTION.                                           01091000
000000 COPY SRP166.                                                     01092000
010930******************************************************************01093000
010940 SRP170-ROUTINE SECTION.                                          01094000
000000 COPY SRP170.                                                     01095000
010960******************************************************************01096000
010970 BUILD-PFKEY-LINE SECTION.                                        01097000
000000 COPY SRP710.                                                     01098000
010990******************************************************************01099000
011000 VALIDATE-PFKEYS SECTION.                                         01100000
000000 COPY SRP711.                                                     01101000
011020******************************************************************01102000
011030 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 01103000
000000 COPY RPP033.                                                     01104000
011050******************************************************************01105000
011060 ACCOUNT-KEY-EDIT SECTION.                                        01106000
000000 COPY RPP130.                                                     01107000
011080******************************************************************01108000
011090 SLP096-GET-2023-RECORD SECTION.                                  01109000
000000 COPY SLP096.                                                     01110000
011110******************************************************************01111000
011120 CICS-XCTL SECTION.                                               01112000
000000 COPY SLP704.                                                     01113000
011140******************************************************************01114000
011150 CICS-RETURN-TRANSID SECTION.                                     01115000
000000 COPY SLP710.                                                     01116000
011170******************************************************************01117000
011180 TSQ-DELETE SECTION.                                              01118000
011190 TSQD-START.                                                      01119000
011200 TSQD-EXIT.                                                       01120000
011210     EXIT.                                                        01121000
011220******************************************************************01122000
011230 CICS-ABORT-EXIT SECTION.                                         01123000
000000 COPY SLP798.                                                     01124000
011250******************************************************************01125000
