000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL360.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL360 - CASH REWARDS NEW/MAINTENANCE                       *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRCONS.                                                    00024000
000000 COPY BICRCONS.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRPAN.                                                     00028000
000000 COPY BICRPAN.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  RPV360K-PANL-DATA-BLOCK.                                     00032000
000000 COPY RPV360KW.                                                   00033000
000340 01  RPV360-PANL-DATA-BLOCK.                                      00034000
000000 COPY RPV360W.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00037000
000380     03  WS-NEXTKEY.                                              00038000
000390         05  WS-EXTID            PIC X(08).                       00039000
000400         05  WS-DELIM1           PIC X(01)       VALUE ','.       00040000
000410         05  WS-DATA.                                             00041000
000420             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00042000
000430             07  WS-DELIM2       PIC X(01)       VALUE ','.       00043000
000440             07  WS-ACCTX.                                        00044000
000450                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00045000
000460             07  WS-DELIM3       PIC X(01)       VALUE ','.       00046000
000470             07  WS-MODEL        PIC X(10)       VALUE SPACES.    00047000
000480         05  FILLER              PIC X(33)       VALUE SPACES.    00048000
000490     03  WS-LNKPROG1             PIC X(08)       VALUE 'RPLCRW00'.00049000
000500     03  WS-LKLGTH               PIC S9(04)      COMP             00050000
000510                                                 VALUE +4088.     00051000
000520     03  WS-DCHG-TEST            PIC X(01)       VALUE SPACE.     00052000
000530         88  WS-DCHG-PROTECT                     VALUE 'P'.       00053000
000540         88  WS-DCHG-EDITERR                     VALUE 'E'.       00054000
000550         88  WS-DCHG-HIDDEN                      VALUE 'H'.       00055000
000560     03  WS-ERROR-COUNT          PIC S9(04)      COMP             00056000
000570                                                 VALUE ZERO.      00057000
000580     03  WS-PDATE                PIC 9(08).                       00058000
000590     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00059000
000600         05  WS-PDATE-YYYY       PIC 9(04).                       00060000
000610         05  WS-PDATE-MM         PIC 9(02).                       00061000
000620         05  WS-PDATE-DD         PIC 9(02).                       00062000
000630     03  WS-SUB1                 PIC S9(04)      COMP             00063000
000640                                                 VALUE +0000.     00064000
000650     03  WS-SUB2                 PIC S9(04)      COMP             00065000
000660                                                 VALUE +0000.     00066000
000670 01  WS-LINKMSG                  PIC X(4500).                     00067000
000680 01  RPCRW00-MESSAGE.                                             00068000
000000 COPY MISCNT00      REPLACING                                     00069000
000700             ==:MICNT:== BY ==RPCRW00==.                          00070000
000000 COPY RPSCRW00.                                                   00071000
000720 01  WS-TSQAREAS.                                                 00072000
000730     03  WS-TSQITEM              PIC S9(04)      COMP             00073000
000740                                                 VALUE +0001.     00074000
000750     03  WS-TSQLGTH              PIC S9(04)      COMP             00075000
000760                                                 VALUE +4096.     00076000
000770     03  WS-TSQKEY.                                               00077000
000780         05  WS-TSQID            PIC X(04).                       00078000
000790         05  WS-TSQTRMID         PIC X(04).                       00079000
000800 01  LS-TSQAREA.                                                  00080000
000810     03  LS-TSQKEY               PIC X(08).                       00081000
000820     03  LS-TSQDATA              PIC X(4088).                     00082000
000830 01  MIWPRI-AREAS.                                                00083000
000000 COPY MIWPRI.                                                     00084000
000850 01  MIWMSTA-AREAS.                                               00085000
000000 COPY MIWMSTA.                                                    00086000
000870 01  MIMST-RECORD.                                                00087000
000000 COPY MISMST.                                                     00088000
000890 01  MI2023-RECORD.                                               00089000
000000 COPY MIS2023A.                                                   00090000
000910 01  WS-ABORTCODES.                                               00091000
000920     03  WS-AB0009               PIC S9(04)      COMP             00092000
000930                                                 VALUE +0009.     00093000
000940     03  WS-AB0106               PIC S9(04)      COMP             00094000
000950                                                 VALUE +0106.     00095000
000960     03  WS-AB2033               PIC S9(04)      COMP             00096000
000970                                                 VALUE +2033.     00097000
000980     03  WS-AB6345               PIC S9(04)      COMP             00098000
000990                                                 VALUE +6345.     00099000
001000 01  WS-TRACECODES.                                               00100000
001010     03  WS-TR0001               PIC S9(04)      COMP             00101000
001020                                                 VALUE +0001.     00102000
001030     03  WS-TR0002               PIC S9(04)      COMP             00103000
001040                                                 VALUE +0002.     00104000
001050 01  SLW096-AREAS.                                                00105000
000000 COPY SLW096.                                                     00106000
001070 01  RPW014-AREAS.                                                00107000
000000 COPY RPW014.                                                     00108000
001090 01  RPW033-AREAS.                                                00109000
000000 COPY RPW033.                                                     00110000
001110 01  RPW130-AREAS.                                                00111000
000000 COPY RPW130.                                                     00112000
001130 01  SRW000-AREAS.                                                00113000
000000 COPY SRW000.                                                     00114000
001150 01  SRW025-AREAS.                                                00115000
000000 COPY SRW025.                                                     00116000
001170 01  SRW030-AREAS.                                                00117000
000000 COPY SRW030.                                                     00118000
001190 01  SRW031-AREAS.                                                00119000
000000 COPY SRW031.                                                     00120000
001210 01  SRW067-AREAS.                                                00121000
000000 COPY SRW067.                                                     00122000
001230 01  SRW105-AREAS.                                                00123000
000000 COPY SRW105.                                                     00124000
001250 01  SRW161-AREAS.                                                00125000
000000 COPY SRW161.                                                     00126000
001270 01  SRW166-AREAS.                                                00127000
000000 COPY SRW166.                                                     00128000
001290 01  SRW170-AREAS.                                                00129000
000000 COPY SRW170.                                                     00130000
001310 COPY DFHAID.                                                     00131000
001320******************************************************************00132000
001330 LINKAGE SECTION.                                                 00133000
001340 01  DFHCOMMAREA.                                                 00134000
000000 COPY SLS1112.                                                    00135000
001360     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00136000
001370         05  COM-EDIT-DATE       PIC X(10).                       00137000
001380         05  COM-KEY-FIELDS.                                      00138000
001390             07  COM-KEY-PRODCODE                                 00139000
001400                                 PIC X(06).                       00140000
001410             07  COM-KEY-ACCOUNT PIC X(18).                       00141000
001420             07  COM-KEY-ACCOUNT-N                                00142000
001430                         REDEFINES COM-KEY-ACCOUNT                00143000
001440                                 PIC 9(18).                       00144000
001450             07  COM-KEY-MODEL                                    00145000
001460                                 PIC X(10).                       00146000
001470             07  COM-KEY-IDNBRX  PIC X(18).                       00147000
001480             07  COM-KEY-IDNBR                                    00148000
001490                         REDEFINES COM-KEY-IDNBRX                 00149000
001500                                 PIC 9(18).                       00150000
001510         05  COM-PANEL-ACTION    PIC X(01).                       00151000
001520             88  INITIAL-PANEL                   VALUE ' '.       00152000
001530             88  EDIT-PANEL                      VALUE 'E'.       00153000
001540         05  COM-FROM-PANEL      PIC X(01).                       00154000
001550             88  FROM-KEY-PANEL                  VALUE 'K'.       00155000
001560             88  FROM-MAINT-PANEL                VALUE 'M'.       00156000
001570             88  FROM-HELP                       VALUE 'H'.       00157000
001580             88  FROM-BREAKAWAY                  VALUE 'B'.       00158000
001590         05  COM-KEY-FORMATTEDACCT                                00159000
001600                                 PIC X(22).                       00160000
001610         05  COM-KEY-MSGNBR      PIC X(06).                       00161000
001620         05  COM-KEY-COMMAND     PIC X(50).                       00162000
001630         05  COM-RCIF-KEY.                                        00163000
001640             07  COM-RCIF-CUST-INST                               00164000
001650                                 PIC 9(04).                       00165000
001660             07  COM-RCIF-CUST-TYPE                               00166000
001670                                 PIC X(01).                       00167000
001680             07  COM-RCIF-CUST.                                   00168000
001690                 09  COM-RCIF-ALPHA                               00169000
001700                                 PIC X(14).                       00170000
001710                 09  COM-RCIF-ACCUM                               00171000
001720                                 PIC 9(03).                       00172000
001730                 09  COM-RCIF-TIEBRKR                             00173000
001740                                 PIC 9(04).                       00174000
001750         05  COM-CUST-NAME       PIC X(40).                       00175000
001760         05  COM-REL-STAT        PIC X(01).                       00176000
001770         05  COM-MST-IDNUMBER    PIC X(18).                       00177000
001780         05  COM-MODEL           PIC X(10).                       00178000
001790         05  COM-MODEL-DESC      PIC X(20).                       00179000
001800         05  COM-DCHG.                                            00180000
001810             07  COM-DELETE-DCHG PIC X(01).                       00181000
001820             07  COM-INST2-DCHG  PIC X(01).                       00182000
001830             07  COM-PRODCODE2-DCHG                               00183000
001840                                 PIC X(01).                       00184000
001850             07  COM-ACCOUNT2-DCHG                                00185000
001860                                 PIC X(01).                       00186000
001870             07  COM-FREQ-DCHG   PIC X(01).                       00187000
001880             07  COM-TERM-DCHG   PIC X(01).                       00188000
001890             07  COM-DAY-DCHG    PIC X(01).                       00189000
001900             07  COM-NXTDATE-DCHG                                 00190000
001910                                 PIC X(01).                       00191000
001920******************************************************************00192000
001930*01  SLW096-2023RECORDS.                                          00193000
000000 COPY SLW096L.                                                    00194000
001950******************************************************************00195000
001960 PROCEDURE DIVISION.                                              00196000
001970******************************************************************00197000
001980 ENTRY-ROUTINE SECTION.                                           00198000
001990     MOVE 'RPL360' TO COM-ABPROGID.                               00199000
000000 COPY SLP771.                                                     00200000
002010******************************************************************00201000
002020 TRANSACTION-CLEAN-UP SECTION.                                    00202000
002030 TCU-START.                                                       00203000
002040 TCU-EXIT.                                                        00204000
002050     EXIT.                                                        00205000
002060******************************************************************00206000
002070 CICS-HANDLE-CONDITION SECTION.                                   00207000
000000 COPY SLP772.                                                     00208000
002090     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00209000
002100         GO TO CTSRI-EXIT.                                        00210000
002110     MOVE WS-AB2033 TO COM-ABORT.                                 00211000
002120     MOVE WS-TR0001 TO COM-ABTRACE.                               00212000
002130     GO TO ABORT-EXIT.                                            00213000
002140 CHC-EXIT.                                                        00214000
002150     EXIT.                                                        00215000
002160******************************************************************00216000
002170 ROUTING-ROUTINE SECTION.                                         00217000
002180 RR-START.                                                        00218000
002190     MOVE LOW-VALUES TO RPCRW00-MESSAGE.                          00219000
002200     MOVE LOW-VALUES TO RPV360-PANL-DATA-AREA.                    00220000
002210     MOVE LOW-VALUES TO RPV360K-PANL-DATA-AREA.                   00221000
002220     MOVE ALL ZEROS TO WS-MSGNBR.                                 00222000
002230     MOVE 'RP00' TO WS-TSQFILEID.                                 00223000
002240     MOVE 'RPI' TO WS-TSQSYSID.                                   00224000
002250     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00225000
002260     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00226000
002270     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00227000
002280         MOVE COM-PAN TO BICRPAN                                  00228000
002290         MOVE COM-PSB TO BICRPSB                                  00229000
002300         MOVE COM-SRB TO BICRSRB                                  00230000
002310     ELSE                                                         00231000
002320         MOVE '1' TO BPSB-LEVEL.                                  00232000
002330     IF COM-RETURN IS EQUAL TO 'B'                                00233000
002340         GO TO BREAKAWAY-RETURN.                                  00234000
002350     IF COM-RETURN IS EQUAL TO '0'                                00235000
002360         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00236000
002370         MOVE SPACES TO COM-WORKAREAS                             00237000
002380         MOVE '1' TO SRB-VERSION                                  00238000
002390         MOVE 'IPRP' TO SRB-APPL-ID                               00239000
002400         MOVE 'RPL360' TO SRB-PROG-ID                             00240000
002410         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00241000
002420         MOVE 'P' TO PAN-TYPE                                     00242000
002430         MOVE SPACE TO PAN-OVERLAY                                00243000
002440         MOVE SPACE TO PAN-CLOSE                                  00244000
002450         MOVE SPACE TO PAN-ALARM                                  00245000
002460         MOVE SPACE TO PAN-CURSOR-PAN                             00246000
002470         MOVE SPACE TO PAN-CURSOR-FLD                             00247000
002480         MOVE SPACE TO PAN-SET-FLD                                00248000
002490         MOVE SPACE TO PAN-SET-VID                                00249000
002500         MOVE SPACE TO PAN-SET-EMP                                00250000
002510         MOVE PDB-RPV360K-NAME TO PAN-NAME                        00251000
002520         PERFORM PANEL-INIT                                       00252000
002530         MOVE BICRPAN TO COM-PAN                                  00253000
002540         MOVE BICRPSB TO COM-PSB                                  00254000
002550         MOVE BICRSRB TO COM-SRB                                  00255000
002560         PERFORM INITIALIZE-DATE                                  00256000
002570         GO TO PANEL-ROUTER.                                      00257000
002580     PERFORM PANEL-NAME-SET.                                      00258000
002590     IF COM-HELPSW IS EQUAL TO 'Y'                                00259000
002600         GO TO HELP-RETURN.                                       00260000
002610     PERFORM PANEL-RECEIVE.                                       00261000
002620     PERFORM PANEL-DATA-GET.                                      00262000
002630     IF FROM-MAINT-PANEL                                          00263000
002640         PERFORM SET-DCHG-INDICATORS.                             00264000
002650     PERFORM PANEL-PFKEY-SET.                                     00265000
002660     PERFORM VALIDATE-PFKEYS.                                     00266000
002670     IF EIBAID IS EQUAL TO DFHPF1                                 00267000
002680         GO TO GET-HELP.                                          00268000
002690     IF EIBAID IS EQUAL TO DFHPF11                                00269000
002700         GO TO BREAK-AWAY.                                        00270000
002710     IF (COM-RETURN IS EQUAL TO 'E')                              00271000
002720         AND (EIBAID IS EQUAL TO DFHPF2                           00272000
002730         OR EIBAID IS EQUAL TO DFHPF3                             00273000
002740         OR EIBAID IS EQUAL TO DFHPF4                             00274000
002750         OR EIBAID IS EQUAL TO DFHPF7                             00275000
002760         OR EIBAID IS EQUAL TO DFHPF8                             00276000
002770         OR EIBAID IS EQUAL TO DFHPF12)                           00277000
002780         GO TO CLOSE-TRANSACTION.                                 00278000
002790     IF COM-RETURN IS EQUAL TO '1'                                00279000
002800         AND EIBAID IS EQUAL TO DFHPF12                           00280000
002810         GO TO CLOSE-TRANSACTION.                                 00281000
002820     IF COM-RETURN IS EQUAL TO '0'                                00282000
002830         OR COM-RETURN IS EQUAL TO 'E'                            00283000
002840         OR COM-RETURN IS EQUAL TO '1'                            00284000
002850         GO TO PANEL-ROUTER.                                      00285000
002860 RR-END.                                                          00286000
002870     GO TO CLOSE-TRANSACTION.                                     00287000
002880 RR-EXIT.                                                         00288000
002890     EXIT.                                                        00289000
002900******************************************************************00290000
002910 INITIALIZE-DATE SECTION.                                         00291000
002920 ID-START.                                                        00292000
002930     MOVE COM-DATE TO WS-CURDATE8.                                00293000
002940     MOVE '-' TO WS-CD8DSH1.                                      00294000
002950     MOVE '-' TO WS-CD8DSH2.                                      00295000
002960     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00296000
002970 ID-EXIT.                                                         00297000
002980     EXIT.                                                        00298000
002990******************************************************************00299000
003000 PANEL-NAME-SET SECTION.                                          00300000
003010 PNS-START.                                                       00301000
003020     IF COM-RETURN IS EQUAL TO '0'                                00302000
003030         MOVE PDB-RPV360K-NAME TO PAN-NAME.                       00303000
003040     IF COM-RETURN IS EQUAL TO 'E'                                00304000
003050         MOVE PDB-RPV360K-NAME TO PAN-NAME.                       00305000
003060     IF COM-RETURN IS EQUAL TO '1'                                00306000
003070         MOVE PDB-RPV360-NAME TO PAN-NAME.                        00307000
003080 PNS-EXIT.                                                        00308000
003090     EXIT.                                                        00309000
003100******************************************************************00310000
003110 PANEL-DATA-GET SECTION.                                          00311000
003120 PDG-START.                                                       00312000
003130     IF COM-RETURN IS EQUAL TO '0'                                00313000
003140         PERFORM PANEL-GET-RPV360K.                               00314000
003150     IF COM-RETURN IS EQUAL TO 'E'                                00315000
003160         PERFORM PANEL-GET-RPV360K                                00316000
003170         MOVE RPV360K-COMMAND TO WS-NEXTKEY                       00317000
003180         MOVE PDB-RPV360K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00318000
003190     IF COM-RETURN IS EQUAL TO '1'                                00319000
003200         PERFORM PANEL-GET-RPV360                                 00320000
003210         MOVE RPV360-COMMAND TO WS-NEXTKEY                        00321000
003220         MOVE PDB-RPV360-COMMAND-DCHG TO WS-COMMAND-DCHG.         00322000
003230 PDG-EXIT.                                                        00323000
003240     EXIT.                                                        00324000
003250******************************************************************00325000
003260 PANEL-PFKEY-SET SECTION.                                         00326000
003270 PPS-START.                                                       00327000
003280     IF COM-UPDATE IS EQUAL TO 'Y'                                00328000
003290         AND COM-RETURN IS EQUAL TO '1'                           00329000
003300         MOVE 'A' TO WS-PF9-FLG.                                  00330000
003310 PPS-EXIT.                                                        00331000
003320     EXIT.                                                        00332000
003330******************************************************************00333000
003340 PANEL-ROUTER SECTION.                                            00334000
003350 PR-START.                                                        00335000
003360     IF COM-RETURN IS EQUAL TO '0'                                00336000
003370         GO TO PROCESS-KEY-PANEL.                                 00337000
003380     IF COM-RETURN IS EQUAL TO 'E'                                00338000
003390         GO TO PROCESS-KEY-PANEL.                                 00339000
003400     IF COM-RETURN IS EQUAL TO '1'                                00340000
003410         GO TO PROCESS-MAINT-PANEL.                               00341000
003420     GO TO CLOSE-TRANSACTION.                                     00342000
003430 PR-EXIT.                                                         00343000
003440     EXIT.                                                        00344000
003450******************************************************************00345000
003460 HELP-RETURN SECTION.                                             00346000
000000 COPY SRP074.                                                     00347000
003480******************************************************************00348000
003490 HELP-RETURN-FINISH SECTION.                                      00349000
003500 HRF-START.                                                       00350000
003510     PERFORM PANEL-DATA-GET.                                      00351000
003520     MOVE 'H' TO COM-FROM-PANEL.                                  00352000
003530     GO TO PANEL-ROUTER.                                          00353000
003540 HRF-EXIT.                                                        00354000
003550     EXIT.                                                        00355000
003560******************************************************************00356000
003570 HELP-MISSING-FINISH SECTION.                                     00357000
003580 HMF-START.                                                       00358000
003590     MOVE 'H' TO COM-FROM-PANEL.                                  00359000
003600     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00360000
003610     GO TO PANEL-ROUTER.                                          00361000
003620 HMF-EXIT.                                                        00362000
003630     EXIT.                                                        00363000
003640******************************************************************00364000
003650 BREAK-AWAY SECTION.                                              00365000
000000 COPY SRP0752.                                                    00366000
003670******************************************************************00367000
003680 BREAKAWAY-RETURN-FINISH SECTION.                                 00368000
003690 BRF-START.                                                       00369000
003700     PERFORM PANEL-DATA-GET.                                      00370000
003710     MOVE 'B' TO COM-FROM-PANEL.                                  00371000
003720     GO TO PANEL-ROUTER.                                          00372000
003730 BRF-EXIT.                                                        00373000
003740     EXIT.                                                        00374000
003750******************************************************************00375000
003760 PROCESS-KEY-PANEL SECTION.                                       00376000
003770 PKP-START.                                                       00377000
003780     IF INITIAL-PANEL                                             00378000
003790         GO TO PKP-CONTINUE.                                      00379000
003800     IF EDIT-PANEL                                                00380000
003810         AND FROM-MAINT-PANEL                                     00381000
003820         MOVE SPACE TO COM-FROM-PANEL                             00382000
003830         GO TO PKP-RELOAD-PANEL.                                  00383000
003840 PKP-CONTINUE.                                                    00384000
003850     MOVE COM-NEXTKEY TO SR-PSLIST.                               00385000
003860     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00386000
003870         GO TO PKP-SEND-PANEL.                                    00387000
003880 PKP-BEGIN-EDITS.                                                 00388000
003890     IF EDIT-PANEL                                                00389000
003900         MOVE RPV360K-PRODCD TO COM-KEY-PRODCODE                  00390000
003910         MOVE RPV360K-ACCOUNT TO COM-KEY-ACCOUNT                  00391000
003920         MOVE RPV360K-MODEL TO COM-KEY-MODEL                      00392000
003930         MOVE RPV360K-IDNBR TO COM-KEY-IDNBRX                     00393000
003940         GO TO PKP-RETURN-EDITS.                                  00394000
003950     PERFORM PARAMETER-SEARCH.                                    00395000
003960     MOVE SR-PSPARM TO COM-EXTID.                                 00396000
003970     MOVE SR-PSPARM TO COM-EXTERNALID.                            00397000
003980     PERFORM PARAMETER-SEARCH.                                    00398000
003990     MOVE SR-PSPARM TO COM-KEY-PRODCODE.                          00399000
004000     PERFORM PARAMETER-SEARCH.                                    00400000
004010     MOVE SR-PSPARM TO COM-KEY-ACCOUNT.                           00401000
004020     PERFORM PARAMETER-SEARCH.                                    00402000
004030     MOVE SR-PSPARM TO COM-KEY-MODEL.                             00403000
004040     PERFORM PARAMETER-SEARCH.                                    00404000
004050     MOVE SR-PSPARM TO COM-KEY-IDNBRX.                            00405000
004060 PKP-RETURN-EDITS.                                                00406000
004070     IF COM-KEY-PRODCODE IS EQUAL TO SPACE                        00407000
004080         MOVE LOW-VALUE TO COM-KEY-PRODCODE.                      00408000
004090     IF COM-KEY-ACCOUNT IS EQUAL TO SPACE                         00409000
004100         MOVE LOW-VALUE TO COM-KEY-ACCOUNT.                       00410000
004110     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00411000
004120         MOVE LOW-VALUES TO COM-KEY-MODEL.                        00412000
004130     IF COM-KEY-IDNBRX IS EQUAL TO SPACES                         00413000
004140         MOVE LOW-VALUES TO COM-KEY-IDNBRX.                       00414000
004150     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00415000
004160         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00416000
004170         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00417000
004180         AND COM-KEY-IDNBRX IS GREATER THAN LOW-VALUES            00418000
004190         GO TO PKP-RETURN-CONT.                                   00419000
004200     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00420000
004210         MOVE '000002' TO WS-MSGNBR                               00421000
004220         GO TO PKP-RETURN-CONT.                                   00422000
004230     PERFORM EDIT-ACCOUNT-KEY.                                    00423000
004240 PKP-RETURN-CONT.                                                 00424000
004250     IF INITIAL-PANEL                                             00425000
004260         AND COM-KEY-PRODCODE IS EQUAL TO LOW-VALUES              00426000
004270         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUES               00427000
004280         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUES                 00428000
004290         AND COM-KEY-IDNBRX IS EQUAL TO LOW-VALUES                00429000
004300         MOVE '000001' TO WS-MSGNBR                               00430000
004310         GO TO PKP-SEND-PANEL.                                    00431000
004320     MOVE COM-KEY-IDNBRX TO SR-JUSTIFYIN.                         00432000
004330     MOVE +0018 TO SR-JLGTH.                                      00433000
004340     PERFORM RIGHT-JUSTIFY.                                       00434000
004350     IF SR-JUSTIFYOUT IS EQUAL TO SPACE                           00435000
004360         MOVE ZEROS TO COM-KEY-IDNBRX                             00436000
004370     ELSE                                                         00437000
004380         MOVE SR-JUSTIFYOUT TO COM-KEY-IDNBRX.                    00438000
004390     IF COM-KEY-IDNBRX IS NOT NUMERIC                             00439000
004400         MOVE ZEROES TO COM-KEY-IDNBRX.                           00440000
004410     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00441000
004420     MOVE COM-KEY-MODEL TO COM-MODEL.                             00442000
004430     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00443000
004440     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00444000
004450         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00445000
004460     ELSE                                                         00446000
004470         MOVE ZERO TO COM-ACCOUNT.                                00447000
004480     IF FROM-BREAKAWAY                                            00448000
004490         OR FROM-HELP                                             00449000
004500         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00450000
004510         GO TO PKP-RELOAD-PANEL.                                  00451000
004520     IF COM-KEY-PRODCODE IS GREATER THAN SPACES                   00452000
004530         AND COM-KEY-ACCOUNT IS GREATER THAN SPACES               00453000
004540         AND COM-KEY-MODEL IS GREATER THAN SPACES                 00454000
004550         AND COM-KEY-IDNBRX IS GREATER THAN ZEROS                 00455000
004560         MOVE '000002' TO WS-MSGNBR                               00456000
004570         GO TO PKP-RELOAD-PANEL.                                  00457000
004580 PKP-EDITS-READY.                                                 00458000
004590     MOVE SPACE TO COM-PANEL-ACTION.                              00459000
004600     MOVE '1' TO COM-RETURN.                                      00460000
004610     MOVE 'K' TO COM-FROM-PANEL.                                  00461000
004620     GO TO PANEL-ROUTER.                                          00462000
004630 PKP-RELOAD-PANEL.                                                00463000
004640     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00464000
004650         MOVE LOW-VALUES TO RPV360K-PRODCD                        00465000
004660     ELSE                                                         00466000
004670         MOVE COM-KEY-PRODCODE TO RPV360K-PRODCD.                 00467000
004680     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00468000
004690         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROS                     00469000
004700         MOVE LOW-VALUES TO RPV360K-ACCOUNT                       00470000
004710     ELSE                                                         00471000
004720         MOVE COM-KEY-ACCOUNT TO RPV360K-ACCOUNT.                 00472000
004730     MOVE COM-KEY-MODEL TO RPV360K-MODEL.                         00473000
004740     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00474000
004750         MOVE LOW-VALUES TO RPV360K-MODEL.                        00475000
004760     MOVE COM-KEY-IDNBRX TO RPV360K-IDNBR.                        00476000
004770     IF COM-KEY-IDNBRX IS NOT GREATER THAN ZEROS                  00477000
004780         MOVE LOW-VALUES TO RPV360K-IDNBR.                        00478000
004790 PKP-SEND-PANEL.                                                  00479000
004800     MOVE PDB-RPV360K-NAME TO PAN-NAME.                           00480000
004810     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00481000
004820     IF (FROM-HELP                                                00482000
004830         OR FROM-BREAKAWAY)                                       00483000
004840         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00484000
004850         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00485000
004860     ELSE                                                         00486000
004870         MOVE PDB-RPV360K-PRODCD TO PAN-SET-FLD.                  00487000
004880     PERFORM CALL-BISPAN-RPV360K.                                 00488000
004890     MOVE COM-OPERID TO RPV360K-OPERID.                           00489000
004900     MOVE COM-INST TO RPV360K-INST.                               00490000
004910     MOVE COM-EDIT-DATE TO RPV360K-SYSDATE.                       00491000
004920     IF RPV360K-PRODCD IS EQUAL TO SPACES                         00492000
004930         MOVE LOW-VALUES TO RPV360K-PRODCD.                       00493000
004940     MOVE RPV360K-ACCOUNT TO SR-JUSTLONGIN.                       00494000
004950     MOVE +18 TO SR-JLGTH.                                        00495000
004960     PERFORM LEFT-JUSTIFY.                                        00496000
004970     MOVE SR-JUSTLONGOUT TO RPV360K-ACCOUNT.                      00497000
004980     IF RPV360K-ACCOUNT IS EQUAL TO SPACES                        00498000
004990         MOVE LOW-VALUES TO RPV360K-ACCOUNT.                      00499000
005000     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00500000
005010         MOVE WS-HELPMSG TO WS-MSGNBR.                            00501000
005020     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00502000
005030         MOVE '000027' TO WS-MSGNBR                               00503000
005040     ELSE                                                         00504000
005050         PERFORM BUILD-NEXTKEY                                    00505000
005060         PERFORM COMPRESS-NEXTKEY                                 00506000
005070         MOVE WS-NEXTKEY TO RPV360K-COMMAND.                      00507000
005080     IF FROM-BREAKAWAY                                            00508000
005090         OR FROM-HELP                                             00509000
005100         MOVE SPACES TO COM-FROM-PANEL                            00510000
005110         MOVE COM-KEY-COMMAND TO RPV360K-COMMAND                  00511000
005120         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00512000
005130     ELSE                                                         00513000
005140         MOVE RPV360K-COMMAND TO COM-KEY-COMMAND                  00514000
005150         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00515000
005160     MOVE 'E' TO COM-RETURN.                                      00516000
005170     PERFORM GET-MESSAGE.                                         00517000
005180     MOVE WS-MESSAGE TO RPV360K-MSGLINE.                          00518000
005190     PERFORM PANEL-PFKEY-SET.                                     00519000
005200     PERFORM BUILD-PFKEY-LINE.                                    00520000
005210     MOVE WS-PFLINE1 TO RPV360K-PFLINE1.                          00521000
005220     MOVE WS-PFLINE2 TO RPV360K-PFLINE2.                          00522000
005230     PERFORM PANEL-PUT-RPV360K.                                   00523000
005240     PERFORM PANEL-SEND.                                          00524000
005250     MOVE 'E' TO COM-PANEL-ACTION.                                00525000
005260     MOVE COM-INTID TO WS-TRANSID.                                00526000
005270     GO TO CICS-RETURN-TRANSID.                                   00527000
005280 PKP-EXIT.                                                        00528000
005290     EXIT.                                                        00529000
005300******************************************************************00530000
005310 PROCESS-MAINT-PANEL SECTION.                                     00531000
005320 PMP-START.                                                       00532000
005330     IF FROM-HELP                                                 00533000
005340         OR FROM-BREAKAWAY                                        00534000
005350         MOVE SPACE TO COM-FROM-PANEL                             00535000
005360         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00536000
005370         MOVE PAN-CURSOR-FLD TO WS-CURSOR-FIELD                   00537000
005380         GO TO PMP-SEND-PANEL.                                    00538000
005390     MOVE 'E' TO COM-END.                                         00539000
005400     IF INITIAL-PANEL                                             00540000
005410         MOVE ALL 'N' TO COM-DCHG                                 00541000
005420         MOVE ALL 'N' TO RPCRW00-DCHG                             00542000
005430         MOVE LOW-VALUES TO RPV360-PANL-DATA-AREA                 00543000
005440         MOVE SPACE TO COM-PANEL-ACTION                           00544000
005450         MOVE 'VKL' TO RPCRW00-APIFUNC                            00545000
005460         GO TO PMP-LINK-TO-RPLCRW00.                              00546000
005470 PMP-PFKEYS.                                                      00547000
005480     MOVE ALL ZEROS TO WS-MSGNBR.                                 00548000
005490     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00549000
005500         MOVE SPACES TO WS-CURSOR-FIELD                           00550000
005510         GO TO PMP-SEND-PANEL.                                    00551000
005520     IF EIBAID IS EQUAL TO DFHPF4                                 00552000
005530         GO TO PMP-CONTINUE.                                      00553000
005540     MOVE COM-NEXTKEY TO WS-NEXTKEY.                              00554000
005550 PMP-CONTINUE.                                                    00555000
005560     MOVE ZERO TO WS-MSGNBR.                                      00556000
005570     MOVE +0 TO WS-ERROR-COUNT.                                   00557000
005580     MOVE COM-DCHG TO SRW166-FIELD.                               00558000
005590     MOVE 'E' TO SRW166-IN.                                       00559000
005600     MOVE 'Y' TO SRW166-OUT.                                      00560000
005610* MOVE THE LENGTH OF THE COM-DCHG FIELD:                          00561000
005620     MOVE +8 TO SRW166-LGTH.                                      00562000
005630     PERFORM EXAMINE-FIELD.                                       00563000
005640     MOVE SRW166-FIELD TO COM-DCHG.                               00564000
005650     MOVE ALL 'N' TO RPCRW00-DCHG.                                00565000
005660     MOVE COM-DELETE-DCHG TO RPCRW00-DELETE-DCHG.                 00566000
005670     MOVE COM-INST2-DCHG TO RPCRW00-INST2-DCHG.                   00567000
005680     MOVE COM-PRODCODE2-DCHG TO RPCRW00-PRODCODE2-DCHG.           00568000
005690     MOVE COM-ACCOUNT2-DCHG TO RPCRW00-ACCOUNT2-DCHG.             00569000
005700     MOVE COM-FREQ-DCHG TO RPCRW00-FREQ-DCHG.                     00570000
005710     MOVE COM-TERM-DCHG TO RPCRW00-TERM-DCHG.                     00571000
005720     MOVE COM-DAY-DCHG TO RPCRW00-DAY-DCHG.                       00572000
005730     MOVE COM-NXTDATE-DCHG TO RPCRW00-NXTDATE-DCHG.               00573000
005740     PERFORM MOVE-PANEL-TO-RECORD.                                00574000
005750     IF COM-DCHG IS EQUAL TO SPACES                               00575000
005760         AND (EIBAID IS EQUAL TO DFHPF3                           00576000
005770         OR EIBAID IS EQUAL TO DFHPF4)                            00577000
005780         GO TO CLOSE-TRANSACTION.                                 00578000
005790 PMP-LINK-TO-RPLCRW00.                                            00579000
005800     IF INITIAL-PANEL                                             00580000
005810         MOVE 'VKL' TO RPCRW00-APIFUNC.                           00581000
005820     IF EDIT-PANEL                                                00582000
005830         MOVE 'UPD' TO RPCRW00-APIFUNC.                           00583000
005840     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00584000
005850         OR EIBAID IS EQUAL TO DFHPF9                             00585000
005860         MOVE 'EDT' TO RPCRW00-APIFUNC.                           00586000
005870     PERFORM RPCRW00-LINK-MESSAGE.                                00587000
005880     IF RPCRW00-RETURN IS EQUAL TO 'E'                            00588000
005890         MOVE 'E' TO COM-RETURN                                   00589000
005900         MOVE 'E' TO COM-PANEL-ACTION                             00590000
005910         MOVE 'M' TO COM-FROM-PANEL                               00591000
005920         GO TO PANEL-ROUTER.                                      00592000
005930     IF RPCRW00-APIFUNC IS EQUAL TO 'EDT'                         00593000
005940         GO TO PMP-BUILD-MAINT-PANEL.                             00594000
005950     IF RPCRW00-APIFUNC IS EQUAL TO 'UPD'                         00595000
005960         AND RPCRW00-FUNCTION IS EQUAL TO SPACE                   00596000
005970         GO TO CLOSE-TRANSACTION.                                 00597000
005980     MOVE RPCRW00-RCIF-KEY TO COM-RCIF-KEY.                       00598000
005990     MOVE RPCRW00-CUST-NAME TO COM-CUST-NAME.                     00599000
006000     MOVE RPCRW00-REL-STAT TO COM-REL-STAT.                       00600000
006010     MOVE RPCRW00-MST-IDNUMBER TO COM-MST-IDNUMBER.               00601000
006020     MOVE RPCRW00-MODEL TO COM-MODEL.                             00602000
006030     IF RPCRW00-KEY-MODEL IS NOT EQUAL TO COM-KEY-MODEL           00603000
006040         MOVE RPCRW00-KEY-MODEL TO COM-KEY-MODEL.                 00604000
006050     MOVE RPCRW00-MODEL-DESC TO COM-MODEL-DESC.                   00605000
006060     IF COM-PRODCODE IS EQUAL TO LOW-VALUES                       00606000
006070         MOVE RPCRW00-KEY-PRODCODE TO COM-PRODCODE                00607000
006080         MOVE RPCRW00-KEY-PRODCODE TO COM-KEY-PRODCODE            00608000
006090         MOVE RPCRW00-KEY-ACCOUNT TO COM-KEY-ACCOUNT              00609000
006100         MOVE RPCRW00-KEY-MODEL TO COM-KEY-MODEL.                 00610000
006110 PMP-BUILD-MAINT-PANEL.                                           00611000
006120     MOVE RPCRW00-DELETE-DCHG TO COM-DELETE-DCHG.                 00612000
006130     MOVE RPCRW00-INST2-DCHG TO COM-INST2-DCHG.                   00613000
006140     MOVE RPCRW00-PRODCODE2-DCHG TO COM-PRODCODE2-DCHG.           00614000
006150     MOVE RPCRW00-ACCOUNT2-DCHG TO COM-ACCOUNT2-DCHG.             00615000
006160     MOVE RPCRW00-FREQ-DCHG TO COM-FREQ-DCHG.                     00616000
006170     MOVE RPCRW00-TERM-DCHG TO COM-TERM-DCHG.                     00617000
006180     MOVE RPCRW00-DAY-DCHG TO COM-DAY-DCHG.                       00618000
006190     MOVE RPCRW00-NXTDATE-DCHG TO COM-NXTDATE-DCHG.               00619000
006200     PERFORM BUILD-MAINT-PANEL.                                   00620000
006210 PMP-SEND-PANEL.                                                  00621000
006220     IF WS-CURSOR-FIELD IS EQUAL TO SPACE                         00622000
006230         MOVE PDB-RPV360-COMMAND TO PAN-SET-FLD                   00623000
006240     ELSE                                                         00624000
006250         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                     00625000
006260     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00626000
006270     PERFORM CALL-BISPAN-RPV360.                                  00627000
006280     MOVE COM-INST TO RPV360-INST.                                00628000
006290     MOVE COM-OPERID TO RPV360-OPERID.                            00629000
006300     MOVE COM-PRODCODE TO RPV360-PRODCD.                          00630000
006310     MOVE COM-KEY-ACCOUNT TO RPV360-ACCOUNT.                      00631000
006320     MOVE COM-KEY-MODEL TO RPV360-MODEL.                          00632000
006330     IF RPV360-DELETE IS EQUAL TO SPACES                          00633000
006340         MOVE LOW-VALUES TO RPV360-DELETE.                        00634000
006350     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00635000
006360         MOVE ALL 'P' TO COM-DCHG                                 00636000
006370         MOVE PDB-RPV360-COMMAND TO WS-CURSOR-FIELD.              00637000
006380     PERFORM SET-ATTRIBUTES-AND-MESSAGES.                         00638000
006390     IF (FROM-HELP                                                00639000
006400         OR FROM-BREAKAWAY)                                       00640000
006410         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00641000
006420         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00642000
006430         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00643000
006440     ELSE                                                         00644000
006450         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD                      00645000
006460         MOVE WS-CURSOR-OCC TO PAN-SET-OCC.                       00646000
006470     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00647000
006480     PERFORM CALL-BISPAN-RPV360.                                  00648000
006490     MOVE COM-INST TO RPV360-INST.                                00649000
006500     MOVE COM-OPERID TO RPV360-OPERID.                            00650000
006510     MOVE COM-EDIT-DATE TO RPV360-SYSDATE.                        00651000
006520     IF WS-MSGNBR NOT NUMERIC                                     00652000
006530         MOVE ZERO TO WS-MSGNBR.                                  00653000
006540     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00654000
006550         MOVE WS-HELPMSG TO WS-MSGNBR.                            00655000
006560     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00656000
006570         MOVE '000027' TO WS-MSGNBR                               00657000
006580     ELSE                                                         00658000
006590         PERFORM BUILD-NEXTKEY                                    00659000
006600         PERFORM COMPRESS-NEXTKEY                                 00660000
006610         MOVE WS-NEXTKEY TO RPV360-COMMAND.                       00661000
006620     IF FROM-HELP                                                 00662000
006630         OR FROM-BREAKAWAY                                        00663000
006640         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00664000
006650         MOVE COM-KEY-COMMAND TO RPV360-COMMAND                   00665000
006660         MOVE SPACE TO COM-FROM-PANEL                             00666000
006670     ELSE                                                         00667000
006680         MOVE RPV360-COMMAND TO COM-KEY-COMMAND                   00668000
006690         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00669000
006700     PERFORM GET-MESSAGE.                                         00670000
006710     MOVE WS-MESSAGE TO RPV360-MSGLINE.                           00671000
006720     PERFORM PANEL-PFKEY-SET.                                     00672000
006730     MOVE 'E' TO COM-END.                                         00673000
006740     PERFORM BUILD-PFKEY-LINE.                                    00674000
006750     MOVE WS-PFLINE1 TO RPV360-PFLINE1.                           00675000
006760     MOVE WS-PFLINE2 TO RPV360-PFLINE2.                           00676000
006770     PERFORM PANEL-PUT-RPV360.                                    00677000
006780     PERFORM PANEL-SEND.                                          00678000
006790     MOVE '1' TO COM-RETURN.                                      00679000
006800     MOVE 'E' TO COM-PANEL-ACTION.                                00680000
006810     MOVE 'M' TO COM-FROM-PANEL.                                  00681000
006820     MOVE COM-INTID TO WS-TRANSID.                                00682000
006830     GO TO CICS-RETURN-TRANSID.                                   00683000
006840 PMP-EXIT.                                                        00684000
006850     EXIT.                                                        00685000
006860******************************************************************00686000
006870 MOVE-PANEL-TO-RECORD SECTION.                                    00687000
006880 MPTR-START.                                                      00688000
006890     MOVE COM-KEY-PRODCODE TO RPCRW00-KEY-PRODCODE.               00689000
006900     MOVE COM-KEY-ACCOUNT TO RPCRW00-KEY-ACCOUNT.                 00690000
006910     MOVE COM-KEY-MODEL TO RPCRW00-KEY-MODEL.                     00691000
006920     MOVE COM-KEY-IDNBR TO RPCRW00-KEY-IDNUMBER.                  00692000
006930     MOVE COM-RCIF-KEY TO RPCRW00-RCIF-KEY.                       00693000
006940     MOVE COM-CUST-NAME TO RPCRW00-CUST-NAME.                     00694000
006950     MOVE COM-REL-STAT TO RPCRW00-REL-STAT.                       00695000
006960     MOVE COM-MST-IDNUMBER TO RPCRW00-MST-IDNUMBER.               00696000
006970     MOVE COM-MODEL TO RPCRW00-MODEL.                             00697000
006980     MOVE COM-MODEL-DESC TO RPCRW00-MODEL-DESC.                   00698000
006990     PERFORM PANEL-GET-RPV360.                                    00699000
007000     IF RPV360-DELETE IS EQUAL TO LOW-VALUES                      00700000
007010         MOVE SPACES TO RPV360-DELETE.                            00701000
007020     MOVE RPV360-DELETE TO RPCRW00-DELETE.                        00702000
007030     IF RPV360-CRWINST IS EQUAL TO LOW-VALUES                     00703000
007040         MOVE ZEROS TO RPV360-CRWINST.                            00704000
007050     MOVE RPV360-CRWINST TO RPCRW00-INST2.                        00705000
007060     IF RPV360-CRWPROD IS EQUAL TO LOW-VALUES                     00706000
007070         MOVE SPACES TO RPV360-CRWPROD.                           00707000
007080     MOVE RPV360-CRWPROD TO RPCRW00-PRODCODE2.                    00708000
007090     IF RPV360-CRWACCT IS EQUAL TO LOW-VALUES                     00709000
007100         MOVE SPACES TO RPV360-CRWACCT.                           00710000
007110     MOVE RPV360-CRWACCT TO SR-JUSTIFYIN.                         00711000
007120     MOVE +0018 TO SR-JLGTH.                                      00712000
007130     PERFORM RIGHT-JUSTIFY.                                       00713000
007140     MOVE SR-JUSTIFYOUT TO RPCRW00-ACCOUNT2.                      00714000
007150     IF RPV360-FREQ IS EQUAL TO LOW-VALUES                        00715000
007160         MOVE SPACES TO RPV360-FREQ.                              00716000
007170     MOVE RPV360-FREQ TO RPCRW00-FREQ.                            00717000
007180     IF RPV360-TERM IS EQUAL TO LOW-VALUES                        00718000
007190         MOVE ZEROS TO RPV360-TERM.                               00719000
007200     MOVE RPV360-TERM TO SR-JUSTIFYIN.                            00720000
007210     MOVE +0003 TO SR-JLGTH.                                      00721000
007220     PERFORM RIGHT-JUSTIFY.                                       00722000
007230     IF SR-JUSTIFYOUT IS EQUAL TO SPACES                          00723000
007240         MOVE ZEROS TO RPV360-TERM                                00724000
007250     ELSE                                                         00725000
007260         MOVE SR-JUSTIFYOUT TO RPV360-TERM.                       00726000
007270     IF RPV360-TERM IS NOT NUMERIC                                00727000
007280         MOVE 'E' TO RPCRW00-TERM-DCHG                            00728000
007290         MOVE 'Y' TO WS-NBRERR                                    00729000
007300     ELSE                                                         00730000
007310         MOVE RPV360-TERM TO SR-EDIT03X                           00731000
007320         MOVE SR-EDITAMT03 TO RPCRW00-TERM.                       00732000
007330     IF RPV360-DAY IS EQUAL TO LOW-VALUES                         00733000
007340         MOVE ZEROS TO RPV360-DAY.                                00734000
007350     MOVE RPV360-DAY TO RPCRW00-DAY.                              00735000
007360     IF RPV360-DTENXTMM IS EQUAL TO LOW-VALUES                    00736000
007370         MOVE ZEROS TO RPV360-DTENXTMM.                           00737000
007380     MOVE RPV360-DTENXTMM TO WS-PDATE-MM.                         00738000
007390     IF RPV360-DTENXTDD IS EQUAL TO LOW-VALUES                    00739000
007400         MOVE ZEROS TO RPV360-DTENXTDD.                           00740000
007410     MOVE RPV360-DTENXTDD TO WS-PDATE-DD.                         00741000
007420     IF RPV360-DTENXTYY IS EQUAL TO LOW-VALUES                    00742000
007430         MOVE ZEROS TO RPV360-DTENXTYY.                           00743000
007440     MOVE RPV360-DTENXTYY TO WS-PDATE-YYYY.                       00744000
007450     MOVE WS-PDATE TO RPCRW00-NXTDATE.                            00745000
007460 MPTR-EXIT.                                                       00746000
007470     EXIT.                                                        00747000
007480******************************************************************00748000
007490 BUILD-MAINT-PANEL SECTION.                                       00749000
007500 BMP-START.                                                       00750000
007510     MOVE COM-CUST-NAME TO RPV360-CUSTNA.                         00751000
007520     MOVE RPCRW00-KEY-MODEL TO RPV360-MODEL.                      00752000
007530     MOVE RPCRW00-MODEL-DESC TO RPV360-MODDESC.                   00753000
007540     MOVE RPCRW00-IDNUMBER TO RPV360-IDNBR.                       00754000
007550     IF RPCRW00-REL-STAT IS EQUAL TO 'A'                          00755000
007560         MOVE 'Active' TO RPV360-STATUS.                          00756000
007570     IF RPCRW00-REL-STAT IS EQUAL TO 'E'                          00757000
007580         MOVE 'Expired' TO RPV360-STATUS.                         00758000
007590     IF RPCRW00-REL-STAT IS EQUAL TO 'I'                          00759000
007600         MOVE 'Inactive' TO RPV360-STATUS.                        00760000
007610     MOVE RPCRW00-DELETE TO RPV360-DELETE.                        00761000
007620     IF RPV360-DELETE IS EQUAL TO SPACES                          00762000
007630         OR RPV360-DELETE IS EQUAL TO LOW-VALUES                  00763000
007640         MOVE LOW-VALUES TO RPV360-DELETE.                        00764000
007650     MOVE RPCRW00-INST2 TO RPV360-CRWINST.                        00765000
007660     IF RPV360-CRWINST IS EQUAL TO SPACES                         00766000
007670         MOVE LOW-VALUES TO RPV360-CRWINST.                       00767000
007680     MOVE RPCRW00-PRODCODE2 TO RPV360-CRWPROD.                    00768000
007690     IF RPV360-CRWPROD IS EQUAL TO SPACES                         00769000
007700         MOVE LOW-VALUES TO RPV360-CRWPROD.                       00770000
007710     MOVE RPCRW00-ACCOUNT2 TO RPV360-CRWACCT.                     00771000
007720     IF RPV360-CRWACCT IS EQUAL TO SPACES                         00772000
007730         MOVE LOW-VALUES TO RPV360-CRWACCT.                       00773000
007740     MOVE RPCRW00-FREQ TO RPV360-FREQ.                            00774000
007750     MOVE RPCRW00-AMOUNT TO SR-EDITSGNV02.                        00775000
007760     MOVE SR-EDIT16X TO RPV360-CALCAMT.                           00776000
007770     MOVE RPV360-CALCAMT TO SR-JUSTLONGIN.                        00777000
007780     MOVE 16 TO SR-JLGTH.                                         00778000
007790     PERFORM LEFT-JUSTIFY.                                        00779000
007800     MOVE SR-JUSTLONGOUT TO RPV360-CALCAMT.                       00780000
007810     MOVE RPCRW00-LAST-AMT TO SR-EDITSGNV02.                      00781000
007820     MOVE SR-EDIT16X TO RPV360-LASTAMT.                           00782000
007830     MOVE RPV360-LASTAMT TO SR-JUSTLONGIN.                        00783000
007840     MOVE 16 TO SR-JLGTH.                                         00784000
007850     PERFORM LEFT-JUSTIFY.                                        00785000
007860     MOVE SR-JUSTLONGOUT TO RPV360-LASTAMT.                       00786000
007870     MOVE RPCRW00-TERM TO RPV360-TERM.                            00787000
007880     MOVE RPCRW00-PCT-USED TO SR-EDITMSKV09.                      00788000
007890     MOVE SR-EDIT10X TO RPV360-PERCENT.                           00789000
007900     MOVE RPV360-PERCENT TO SR-JUSTLONGIN.                        00790000
007910     MOVE 10 TO SR-JLGTH.                                         00791000
007920     PERFORM LEFT-JUSTIFY.                                        00792000
007930     MOVE SR-JUSTLONGOUT TO RPV360-PERCENT.                       00793000
007940     MOVE RPCRW00-DAY TO RPV360-DAY.                              00794000
007950     MOVE RPCRW00-LSTCOMBBALUSED TO SR-EDITSGNV02.                00795000
007960     MOVE SR-EDIT20X TO RPV360-CMBUSED.                           00796000
007970     MOVE RPV360-CMBUSED TO SR-JUSTLONGIN.                        00797000
007980     MOVE 20 TO SR-JLGTH.                                         00798000
007990     PERFORM LEFT-JUSTIFY.                                        00799000
008000     MOVE SR-JUSTLONGOUT TO RPV360-CMBUSED.                       00800000
008010     MOVE RPCRW00-NXTDATE TO WS-PDATE.                            00801000
008020     MOVE WS-PDATE-MM TO RPV360-DTENXTMM.                         00802000
008030     MOVE WS-PDATE-DD TO RPV360-DTENXTDD.                         00803000
008040     MOVE WS-PDATE-YYYY TO RPV360-DTENXTYY.                       00804000
008050     MOVE RPCRW00-AMT-YTD TO SR-EDITSGNV02.                       00805000
008060     MOVE SR-EDIT20X TO RPV360-PAIDYTD.                           00806000
008070     MOVE RPV360-PAIDYTD TO SR-JUSTLONGIN.                        00807000
008080     MOVE 20 TO SR-JLGTH.                                         00808000
008090     PERFORM LEFT-JUSTIFY.                                        00809000
008100     MOVE SR-JUSTLONGOUT TO RPV360-PAIDYTD.                       00810000
008110     MOVE RPCRW00-LSTDATE TO WS-PDATE.                            00811000
008120     MOVE WS-PDATE-MM TO RPV360-DTELSTMM.                         00812000
008130     MOVE WS-PDATE-DD TO RPV360-DTELSTDD.                         00813000
008140     MOVE WS-PDATE-YYYY TO RPV360-DTELSTYY.                       00814000
008150     MOVE RPCRW00-DATE-OPEN TO WS-PDATE.                          00815000
008160     MOVE WS-PDATE-MM TO RPV360-DTEOPNMM.                         00816000
008170     MOVE WS-PDATE-DD TO RPV360-DTEOPNDD.                         00817000
008180     MOVE WS-PDATE-YYYY TO RPV360-DTEOPNYY.                       00818000
008190     MOVE PDB-RPV360-NAME TO PAN-NAME.                            00819000
008200 BMP-EXIT.                                                        00820000
008210     EXIT.                                                        00821000
008220******************************************************************00822000
008230 SET-DCHG-INDICATORS SECTION.                                     00823000
008240 SDI-START.                                                       00824000
008250     IF PDB-RPV360-DELETE-DCHG IS EQUAL TO 'Y'                    00825000
008260         MOVE 'Y' TO COM-DELETE-DCHG.                             00826000
008270     IF PDB-RPV360-CRWINST-DCHG IS EQUAL TO 'Y'                   00827000
008280         MOVE 'Y' TO COM-INST2-DCHG.                              00828000
008290     IF PDB-RPV360-CRWPROD-DCHG IS EQUAL TO 'Y'                   00829000
008300         MOVE 'Y' TO COM-PRODCODE2-DCHG.                          00830000
008310     IF PDB-RPV360-CRWACCT-DCHG IS EQUAL TO 'Y'                   00831000
008320         MOVE 'Y' TO COM-ACCOUNT2-DCHG.                           00832000
008330     IF PDB-RPV360-FREQ-DCHG IS EQUAL TO 'Y'                      00833000
008340         MOVE 'Y' TO COM-FREQ-DCHG.                               00834000
008350     IF PDB-RPV360-TERM-DCHG IS EQUAL TO 'Y'                      00835000
008360         MOVE 'Y' TO COM-TERM-DCHG.                               00836000
008370     IF PDB-RPV360-DAY-DCHG IS EQUAL TO 'Y'                       00837000
008380         MOVE 'Y' TO COM-DAY-DCHG.                                00838000
008390     IF PDB-RPV360-DTENXTMM-DCHG IS EQUAL TO 'Y'                  00839000
008400         OR PDB-RPV360-DTENXTDD-DCHG IS EQUAL TO 'Y'              00840000
008410         OR PDB-RPV360-DTENXTYY-DCHG IS EQUAL TO 'Y'              00841000
008420         MOVE 'Y' TO COM-NXTDATE-DCHG.                            00842000
008430     IF PDB-RPV360-DTENXTMM-DCHG IS EQUAL TO 'E'                  00843000
008440         OR PDB-RPV360-DTENXTDD-DCHG IS EQUAL TO 'E'              00844000
008450         OR PDB-RPV360-DTENXTYY-DCHG IS EQUAL TO 'E'              00845000
008460         MOVE 'E' TO COM-NXTDATE-DCHG.                            00846000
008470 SDI-EXIT.                                                        00847000
008480     EXIT.                                                        00848000
008490******************************************************************00849000
008500 SET-ATTRIBUTES-AND-MESSAGES SECTION.                             00850000
008510 SAAM-START.                                                      00851000
008520     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00852000
008530     MOVE COM-DELETE-DCHG TO WS-DCHG-TEST.                        00853000
008540     MOVE PDB-RPV360-DELETE-VID TO PAN-SET-VID.                   00854000
008550     MOVE PDB-RPV360-DELETE-EL TO PAN-SET-EMP.                    00855000
008560     MOVE PDB-RPV360-DELETE TO PAN-SET-FLD.                       00856000
008570     PERFORM SET-ATTRIBUTE.                                       00857000
008580     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00858000
008590     MOVE COM-INST2-DCHG TO WS-DCHG-TEST.                         00859000
008600     MOVE PDB-RPV360-CRWINST-VID TO PAN-SET-VID.                  00860000
008610     MOVE PDB-RPV360-CRWINST-EL TO PAN-SET-EMP.                   00861000
008620     MOVE PDB-RPV360-CRWINST TO PAN-SET-FLD.                      00862000
008630     PERFORM SET-ATTRIBUTE.                                       00863000
008640     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00864000
008650     MOVE COM-PRODCODE2-DCHG TO WS-DCHG-TEST.                     00865000
008660     MOVE PDB-RPV360-CRWPROD-VID TO PAN-SET-VID.                  00866000
008670     MOVE PDB-RPV360-CRWPROD-EL TO PAN-SET-EMP.                   00867000
008680     MOVE PDB-RPV360-CRWPROD TO PAN-SET-FLD.                      00868000
008690     PERFORM SET-ATTRIBUTE.                                       00869000
008700     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00870000
008710     MOVE COM-ACCOUNT2-DCHG TO WS-DCHG-TEST.                      00871000
008720     MOVE PDB-RPV360-CRWACCT-VID TO PAN-SET-VID.                  00872000
008730     MOVE PDB-RPV360-CRWACCT-EL TO PAN-SET-EMP.                   00873000
008740     MOVE PDB-RPV360-CRWACCT TO PAN-SET-FLD.                      00874000
008750     PERFORM SET-ATTRIBUTE.                                       00875000
008760     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00876000
008770     MOVE COM-FREQ-DCHG TO WS-DCHG-TEST.                          00877000
008780     MOVE PDB-RPV360-FREQ-VID TO PAN-SET-VID.                     00878000
008790     MOVE PDB-RPV360-FREQ-EL TO PAN-SET-EMP.                      00879000
008800     MOVE PDB-RPV360-FREQ TO PAN-SET-FLD.                         00880000
008810     PERFORM SET-ATTRIBUTE.                                       00881000
008820     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00882000
008830     MOVE COM-TERM-DCHG TO WS-DCHG-TEST.                          00883000
008840     MOVE PDB-RPV360-TERM-VID TO PAN-SET-VID.                     00884000
008850     MOVE PDB-RPV360-TERM-EL TO PAN-SET-EMP.                      00885000
008860     MOVE PDB-RPV360-TERM TO PAN-SET-FLD.                         00886000
008870     PERFORM SET-ATTRIBUTE.                                       00887000
008880     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00888000
008890     MOVE COM-DAY-DCHG TO WS-DCHG-TEST.                           00889000
008900     MOVE PDB-RPV360-DAY-VID TO PAN-SET-VID.                      00890000
008910     MOVE PDB-RPV360-DAY-EL TO PAN-SET-EMP.                       00891000
008920     MOVE PDB-RPV360-DAY TO PAN-SET-FLD.                          00892000
008930     PERFORM SET-ATTRIBUTE.                                       00893000
008940     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00894000
008950     MOVE COM-NXTDATE-DCHG TO WS-DCHG-TEST.                       00895000
008960     MOVE PDB-RPV360-DTENXTMM-VID TO PAN-SET-VID.                 00896000
008970     MOVE PDB-RPV360-DTENXTMM-EL TO PAN-SET-EMP.                  00897000
008980     MOVE PDB-RPV360-DTENXTMM TO PAN-SET-FLD.                     00898000
008990     PERFORM SET-ATTRIBUTE.                                       00899000
009000     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00900000
009010     MOVE COM-NXTDATE-DCHG TO WS-DCHG-TEST.                       00901000
009020     MOVE PDB-RPV360-DTENXTDD-VID TO PAN-SET-VID.                 00902000
009030     MOVE PDB-RPV360-DTENXTDD-EL TO PAN-SET-EMP.                  00903000
009040     MOVE PDB-RPV360-DTENXTDD TO PAN-SET-FLD.                     00904000
009050     PERFORM SET-ATTRIBUTE.                                       00905000
009060     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00906000
009070     MOVE COM-NXTDATE-DCHG TO WS-DCHG-TEST.                       00907000
009080     MOVE PDB-RPV360-DTENXTYY-VID TO PAN-SET-VID.                 00908000
009090     MOVE PDB-RPV360-DTENXTYY-EL TO PAN-SET-EMP.                  00909000
009100     MOVE PDB-RPV360-DTENXTYY TO PAN-SET-FLD.                     00910000
009110     PERFORM SET-ATTRIBUTE.                                       00911000
009120 SAAM-EXIT.                                                       00912000
009130     EXIT.                                                        00913000
009140******************************************************************00914000
009150 SET-ATTRIBUTE SECTION.                                           00915000
009160 SA-START.                                                        00916000
009170     IF WS-DCHG-EDITERR                                           00917000
009180         ADD +1 TO WS-ERROR-COUNT                                 00918000
009190         MOVE 'Y' TO WS-ERROR                                     00919000
009200         MOVE VIS-ERROR TO PAN-SET-VID                            00920000
009210         MOVE EMP-ERROR TO PAN-SET-EMP.                           00921000
009220     IF WS-DCHG-EDITERR                                           00922000
009230         AND WS-CURSOR-FIELD IS EQUAL TO SPACES                   00923000
009240         MOVE PAN-SET-FLD TO WS-CURSOR-FIELD                      00924000
009250         MOVE PAN-SET-OCC TO WS-CURSOR-OCC.                       00925000
009260     IF WS-DCHG-PROTECT                                           00926000
009270         MOVE VIS-DISPLAY TO PAN-SET-VID                          00927000
009280         MOVE EMP-NORMAL TO PAN-SET-EMP.                          00928000
009290     IF WS-DCHG-HIDDEN                                            00929000
009300         MOVE VIS-DISPLAY TO PAN-SET-VID                          00930000
009310         MOVE EMP-HIDDEN TO PAN-SET-EMP.                          00931000
009320     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00932000
009330     PERFORM CALL-BISPAN-RPV360.                                  00933000
009340 SA-EXIT.                                                         00934000
009350     EXIT.                                                        00935000
009360******************************************************************00936000
009370 MORE-DATA-PANELS SECTION.                                        00937000
009380 MDP-START.                                                       00938000
009390     GO TO PANEL-ROUTER.                                          00939000
009400 MDP-EXIT.                                                        00940000
009410     EXIT.                                                        00941000
009420******************************************************************00942000
009430 CLOSE-TRANSACTION SECTION.                                       00943000
000000 COPY SRP0722.                                                    00944000
009450******************************************************************00945000
009460 PANEL-INIT SECTION.                                              00946000
000000 COPY SRP073.                                                     00947000
009480******************************************************************00948000
009490 BUILD-NEXTKEY SECTION.                                           00949000
009500 BXN-START.                                                       00950000
009510     MOVE SPACES TO WS-NEXTKEY.                                   00951000
009520     MOVE ',' TO WS-DELIM1.                                       00952000
009530     MOVE ',' TO WS-DELIM2.                                       00953000
009540     MOVE ',' TO WS-DELIM3.                                       00954000
009550     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00955000
009560     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00956000
009570         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00957000
009580     ELSE                                                         00958000
009590         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00959000
009600     MOVE COM-KEY-MODEL TO WS-MODEL.                              00960000
009610     MOVE COM-EXTERNALID TO WS-EXTID.                             00961000
009620 BXN-EXIT.                                                        00962000
009630     EXIT.                                                        00963000
009640******************************************************************00964000
009650 ABORT-EXIT SECTION.                                              00965000
009660 AE-START.                                                        00966000
009670     MOVE EIBFN TO COM-ABEIBFN.                                   00967000
009680     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00968000
009690     GO TO CICS-ABORT-EXIT.                                       00969000
009700 AE-EXIT.                                                         00970000
009710     EXIT.                                                        00971000
009720******************************************************************00972000
009730 RPCRW00-LINK-MESSAGE SECTION.                                    00973000
009740 CRLM-START.                                                      00974000
009750     MOVE 'Y' TO RPCRW00-GLOBAL-CLOSE.                            00975000
009760     MOVE WS-FILEOPTIONS TO RPCRW00-FILEOPTS.                     00976000
009770     MOVE COM-RETURN TO RPCRW00-RETURN.                           00977000
009780     MOVE COM-DATE TO RPCRW00-DATE.                               00978000
009790     MOVE COM-MODELID TO RPCRW00-MODELID.                         00979000
009800     MOVE COM-SECALT TO RPCRW00-SECALT.                           00980000
009810     MOVE COM-EXTERNALID TO RPCRW00-EXTERNALID.                   00981000
009820     MOVE COM-EIBTRMID TO RPCRW00-TERMID.                         00982000
009830     MOVE COM-WKUNAME TO RPCRW00-WORKID.                          00983000
009840     MOVE COM-TRANSTART TO RPCRW00-TRANSTART.                     00984000
009850     MOVE COM-UPDATE TO RPCRW00-UPDATE.                           00985000
009860     MOVE COM-APPLSEQ TO RPCRW00-APPLSEQ.                         00986000
009870     MOVE WS-RPSAPPLNBR TO RPCRW00-APPL.                          00987000
009880     MOVE 'M' TO RPCRW00-FUNC.                                    00988000
009890     MOVE COM-INST TO RPCRW00-KEY-INST.                           00989000
009900     MOVE COM-PRODCODE TO RPCRW00-KEY-PRODCODE.                   00990000
009910     MOVE COM-KEY-ACCOUNT TO RPCRW00-KEY-ACCOUNT.                 00991000
009920     MOVE COM-KEY-MODEL TO RPCRW00-KEY-MODEL.                     00992000
009930     IF COM-KEY-MODEL IS EQUAL TO LOW-VALUES                      00993000
009940         MOVE SPACES TO RPCRW00-KEY-MODEL.                        00994000
009950     IF COM-KEY-IDNBR IS NUMERIC                                  00995000
009960         AND COM-KEY-IDNBR IS GREATER THAN ZEROS                  00996000
009970         MOVE COM-KEY-IDNBR TO RPCRW00-KEY-IDNUMBER               00997000
009980         MOVE 'Y' TO RPCRW00-KEY-IDNUMBER-DCHG.                   00998000
009990     MOVE COM-OPERID TO RPCRW00-OPERID.                           00999000
010000     MOVE COM-LANG TO RPCRW00-COM-LANG.                           01000000
010010     MOVE COM-CURN-CODE TO RPCRW00-COM-CURNCD.                    01001000
010020     MOVE COM-INST-OPTS TO RPCRW00-INST-OPTS.                     01002000
010030     EXEC CICS LINK                                               01003000
010040         PROGRAM('RPLCRW00')                                      01004000
010050         COMMAREA(RPCRW00-MESSAGE)                                01005000
010060         LENGTH(LENGTH OF RPCRW00-MESSAGE)                        01006000
010070         RESP(WS-CICS-RESPONSE)                                   01007000
010080         END-EXEC.                                                01008000
010090     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     01009000
010100         MOVE 'RPLCRW00 LINK FAILED' TO COM-ABMSG                 01010000
010110         MOVE WS-TR0002 TO COM-ABTRACE                            01011000
010120         MOVE WS-AB0009 TO COM-ABORT                              01012000
010130         GO TO CICS-ABORT-EXIT.                                   01013000
010140     MOVE RPCRW00-FUNCTION TO WS-FUNCTION.                        01014000
010150     IF RPCRW00-ABORT IS NOT EQUAL TO ZERO                        01015000
010160         MOVE RPCRW00-ABORT TO COM-ABORT                          01016000
010170         MOVE RPCRW00-ABTRACE TO COM-ABTRACE                      01017000
010180         MOVE RPCRW00-ABEIBFN TO COM-ABEIBFN                      01018000
010190         MOVE RPCRW00-ABEIBRCODE TO COM-ABEIBRCODE                01019000
010200         MOVE RPCRW00-ABPROGID TO COM-ABPROGID                    01020000
010210         MOVE RPCRW00-SRBMDB TO COM-SRBMDB                        01021000
010220         MOVE RPCRW00-ABTYPE TO COM-ABTYPE                        01022000
010230         GO TO CICS-ABORT-EXIT.                                   01023000
010240     MOVE RPCRW00-FUNC TO COM-FUNC.                               01024000
010250     MOVE RPCRW00-ABORT TO COM-ABORT.                             01025000
010260     MOVE RPCRW00-MSGNBR TO WS-MSGNBR.                            01026000
010270 CRLM-EXIT.                                                       01027000
010280     EXIT.                                                        01028000
010290******************************************************************01029000
010300 CLOSE-PANEL SECTION.                                             01030000
010310 CP-START.                                                        01031000
010320     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       01032000
010330     IF COM-RETURN IS EQUAL TO 'E'                                01033000
010340         PERFORM CALL-BISPAN-RPV360K.                             01034000
010350     IF COM-RETURN IS EQUAL TO '1'                                01035000
010360         PERFORM CALL-BISPAN-RPV360.                              01036000
010370 CP-EXIT.                                                         01037000
010380     EXIT.                                                        01038000
010390******************************************************************01039000
010400 CALL-BISPAN-RPV360K SECTION.                                     01040000
010410 CBD1-START.                                                      01041000
010420     CALL 'BISPAN' USING                                          01042000
010430         BICRPSB,                                                 01043000
010440         BICRSRB,                                                 01044000
010450         BICRPAN,                                                 01045000
010460         RPV360K-PANL-DATA-BLOCK,                                 01046000
010470         RPV360K-PANL-DATA-AREA.                                  01047000
010480 CBD1-EXIT.                                                       01048000
010490     EXIT.                                                        01049000
010500******************************************************************01050000
010510 CALL-BISPAN-RPV360 SECTION.                                      01051000
010520 CBD2-START.                                                      01052000
010530     CALL 'BISPAN' USING                                          01053000
010540         BICRPSB,                                                 01054000
010550         BICRSRB,                                                 01055000
010560         BICRPAN,                                                 01056000
010570         RPV360-PANL-DATA-BLOCK,                                  01057000
010580         RPV360-PANL-DATA-AREA.                                   01058000
010590 CBD2-EXIT.                                                       01059000
010600     EXIT.                                                        01060000
010610******************************************************************01061000
010620 PANEL-GET-RPV360 SECTION.                                        01062000
010630 PANEL-GET-RPV360-START.                                          01063000
010640     MOVE 'N' TO RPV360-SW-SET-CURSOR.                            01064000
010650     MOVE PDB-RPV360-NAME TO PAN-NAME.                            01065000
010660     MOVE REQ-GET TO PAN-REQ-VERB.                                01066000
010670     CALL 'BISPAN' USING                                          01067000
010680         BICRPSB                                                  01068000
010690         BICRSRB                                                  01069000
010700         BICRPAN                                                  01070000
010710         RPV360-PANL-DATA-BLOCK,                                  01071000
010720         RPV360-PANL-DATA-AREA.                                   01072000
010730 PANEL-GET-RPV360-EXIT.                                           01073000
010740     EXIT.                                                        01074000
010750******************************************************************01075000
010760 PANEL-PUT-RPV360 SECTION.                                        01076000
010770 PANEL-PUT-RPV360-START.                                          01077000
010780     MOVE PDB-RPV360-NAME TO PAN-NAME.                            01078000
010790     MOVE REQ-PUT TO PAN-REQ-VERB.                                01079000
010800     CALL 'BISPAN' USING                                          01080000
010810         BICRPSB                                                  01081000
010820         BICRSRB                                                  01082000
010830         BICRPAN                                                  01083000
010840         RPV360-PANL-DATA-BLOCK,                                  01084000
010850         RPV360-PANL-DATA-AREA.                                   01085000
010860 PANEL-PUT-RPV360-EXIT.                                           01086000
010870     EXIT.                                                        01087000
010880******************************************************************01088000
010890 PANEL-GET-RPV360K SECTION.                                       01089000
010900 PANEL-GET-RPV360K-START.                                         01090000
010910     MOVE 'N' TO RPV360K-SW-SET-CURSOR.                           01091000
010920     MOVE PDB-RPV360K-NAME TO PAN-NAME.                           01092000
010930     MOVE REQ-GET TO PAN-REQ-VERB.                                01093000
010940     CALL 'BISPAN' USING                                          01094000
010950         BICRPSB                                                  01095000
010960         BICRSRB                                                  01096000
010970         BICRPAN                                                  01097000
010980         RPV360K-PANL-DATA-BLOCK,                                 01098000
010990         RPV360K-PANL-DATA-AREA.                                  01099000
011000 PANEL-GET-RPV360K-EXIT.                                          01100000
011010     EXIT.                                                        01101000
011020******************************************************************01102000
011030 PANEL-PUT-RPV360K SECTION.                                       01103000
011040 PANEL-PUT-RPV360K-START.                                         01104000
011050     MOVE PDB-RPV360K-NAME TO PAN-NAME.                           01105000
011060     MOVE REQ-PUT TO PAN-REQ-VERB.                                01106000
011070     CALL 'BISPAN' USING                                          01107000
011080         BICRPSB                                                  01108000
011090         BICRSRB                                                  01109000
011100         BICRPAN                                                  01110000
011110         RPV360K-PANL-DATA-BLOCK,                                 01111000
011120         RPV360K-PANL-DATA-AREA.                                  01112000
011130 PANEL-PUT-RPV360K-EXIT.                                          01113000
011140     EXIT.                                                        01114000
011150******************************************************************01115000
011160 MIC-MST-API SECTION.                                             01116000
000000 COPY MIPMSTA.                                                    01117000
011180******************************************************************01118000
011190 EDIT-ACCOUNT-KEY SECTION.                                        01119000
011200 EAK-START.                                                       01120000
011210     MOVE COM-INST TO RPW130-INST.                                01121000
011220     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 01122000
011230     MOVE COM-KEY-PRODCODE TO RPW130-PRODCODE.                    01123000
011240     MOVE COM-KEY-ACCOUNT TO RPW130-ACCOUNTINPUT.                 01124000
011250     MOVE 'V' TO RPW130-FUNCTION.                                 01125000
011260     PERFORM ACCOUNT-KEY-EDIT.                                    01126000
011270     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01127000
011280         MOVE '500003' TO WS-MSGNBR                               01128000
011290         GO TO EAK-EXIT.                                          01129000
011300     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       01130000
011310     MOVE RPW130-ACCOUNTKEY TO COM-KEY-ACCOUNT.                   01131000
011320     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          01132000
011330     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      01133000
011340     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                01134000
011350 EAK-EXIT.                                                        01135000
011360     EXIT.                                                        01136000
011370******************************************************************01137000
011380 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 01138000
000000 COPY RPP033.                                                     01139000
011400******************************************************************01140000
011410 ACCOUNT-KEY-EDIT SECTION.                                        01141000
000000 COPY RPP130.                                                     01142000
011430******************************************************************01143000
011440 LEFT-JUSTIFY SECTION.                                            01144000
000000 COPY SRP068.                                                     01145000
011460******************************************************************01146000
011470 RIGHT-JUSTIFY SECTION.                                           01147000
000000 COPY SRP026.                                                     01148000
011490******************************************************************01149000
011500 PARAMETER-SEARCH SECTION.                                        01150000
000000 COPY SRP030.                                                     01151000
011520******************************************************************01152000
011530 COMPRESS-NEXTKEY SECTION.                                        01153000
000000 COPY SRP070.                                                     01154000
011550******************************************************************01155000
011560 GET-MESSAGE SECTION.                                             01156000
000000 COPY SRP071.                                                     01157000
011580******************************************************************01158000
011590 EDIT-CODASYL-DATE SECTION.                                       01159000
000000 COPY SRP087.                                                     01160000
011610******************************************************************01161000
011620 EXAMINE-FIELD SECTION.                                           01162000
000000 COPY SRP166.                                                     01163000
011640******************************************************************01164000
011650 SRP170-ROUTINE SECTION.                                          01165000
000000 COPY SRP170.                                                     01166000
011670******************************************************************01167000
011680 BUILD-PFKEY-LINE SECTION.                                        01168000
000000 COPY SRP710.                                                     01169000
011700******************************************************************01170000
011710 VALIDATE-PFKEYS SECTION.                                         01171000
000000 COPY SRP711.                                                     01172000
011730******************************************************************01173000
011740 SLP096-GET-2023-RECORD SECTION.                                  01174000
000000 COPY SLP096.                                                     01175000
011760******************************************************************01176000
011770 CICS-XCTL SECTION.                                               01177000
000000 COPY SLP704.                                                     01178000
011790******************************************************************01179000
011800 CICS-RETURN-TRANSID SECTION.                                     01180000
000000 COPY SLP710.                                                     01181000
011820******************************************************************01182000
011830 TSQ-DELETE SECTION.                                              01183000
011840 TSQD-START.                                                      01184000
011850 TSQD-EXIT.                                                       01185000
011860     EXIT.                                                        01186000
011870******************************************************************01187000
011880 CICS-TSQ-READ SECTION.                                           01188000
000000 COPY SLP744.                                                     01189000
011900******************************************************************01190000
011910 CICS-ABORT-EXIT SECTION.                                         01191000
000000 COPY SLP798.                                                     01192000
011930******************************************************************01193000
