000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL330.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL330 - RELATIONSHIPS NEW REVIEW                           *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRCONS.                                                    00024000
000000 COPY BICRCONS.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRPAN.                                                     00028000
000000 COPY BICRPAN.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  RPV330K-PANL-DATA-BLOCK.                                     00032000
000000 COPY RPV330KW.                                                   00033000
000340 01  RPV330-PANL-DATA-BLOCK.                                      00034000
000000 COPY RPV330W.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00037000
000380     03  WS-NEXTKEY.                                              00038000
000390         05  WS-EXTID            PIC X(08).                       00039000
000400         05  WS-DELIM1           PIC X(01)       VALUE ','.       00040000
000410         05  WS-DATA.                                             00041000
000420             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00042000
000430             07  WS-DELIM2       PIC X(01)       VALUE ','.       00043000
000440             07  WS-ACCTX.                                        00044000
000450                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00045000
000460             07  WS-DELIM3       PIC X(01)       VALUE ','.       00046000
000470             07  WS-MODEL        PIC X(10)       VALUE SPACES.    00047000
000480         05  FILLER              PIC X(33)       VALUE SPACES.    00048000
000490     03  WS-MORE                 PIC X(05)       VALUE 'More:'.   00049000
000500     03  WS-LNKPROG1             PIC X(08)       VALUE 'RPLQUA00'.00050000
000510     03  WS-LKLGTH               PIC S9(04)      COMP             00051000
000520                                                 VALUE +4088.     00052000
000530     03  WS-DCHG-TEST            PIC X(01)       VALUE SPACE.     00053000
000540         88  WS-DCHG-PROTECT                     VALUE 'P'.       00054000
000550         88  WS-DCHG-EDITERR                     VALUE 'E'.       00055000
000560         88  WS-DCHG-HIDDEN                      VALUE 'N'.       00056000
000570     03  WS-ERROR-COUNT          PIC S9(04)      COMP             00057000
000580                                                 VALUE ZERO.      00058000
000590     03  WS-PDATE                PIC 9(08).                       00059000
000600     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00060000
000610         05  WS-PDATE-YYYY       PIC 9(04).                       00061000
000620         05  WS-PDATE-MM         PIC 9(02).                       00062000
000630         05  WS-PDATE-DD         PIC 9(02).                       00063000
000640     03  WS-OPEN-DATE.                                            00064000
000650         05  WS-OD-MM            PIC 9(02).                       00065000
000660         05  FILLER              PIC X(01).                       00066000
000670         05  WS-OD-DD            PIC 9(02).                       00067000
000680         05  FILLER              PIC X(01).                       00068000
000690         05  WS-OD-YYYY          PIC 9(04).                       00069000
000700     03  WS-SUB1                 PIC S9(04)      COMP             00070000
000710                                                 VALUE +0000.     00071000
000720     03  WS-SUB2                 PIC S9(04)      COMP             00072000
000730                                                 VALUE +0000.     00073000
000740 01  WS-LINKMSG                  PIC X(4500).                     00074000
000750 01  RPQUA00-MESSAGE.                                             00075000
000000 COPY MISCNT00      REPLACING                                     00076000
000770             ==:MICNT:== BY ==RPQUA00==.                          00077000
000000 COPY RPSQUA00.                                                   00078000
000790 01  WS-TSQAREAS.                                                 00079000
000800     03  WS-TSQITEM              PIC S9(04)      COMP             00080000
000810                                                 VALUE +0001.     00081000
000820     03  WS-TSQLGTH              PIC S9(04)      COMP             00082000
000830                                                 VALUE +4096.     00083000
000840     03  WS-TSQKEY.                                               00084000
000850         05  WS-TSQID            PIC X(04).                       00085000
000860         05  WS-TSQTRMID         PIC X(04).                       00086000
000870 01  LS-TSQAREA.                                                  00087000
000880     03  LS-TSQKEY               PIC X(08).                       00088000
000890     03  LS-TSQDATA              PIC X(4088).                     00089000
000900 01  MIWPRI-AREAS.                                                00090000
000000 COPY MIWPRI.                                                     00091000
000920 01  MIWMSTA-AREAS.                                               00092000
000000 COPY MIWMSTA.                                                    00093000
000940 01  MIMST-RECORD.                                                00094000
000000 COPY MISMST.                                                     00095000
000960 01  MI2023-RECORD.                                               00096000
000000 COPY MIS2023A.                                                   00097000
000980 01  WS-ABORTCODES.                                               00098000
000990     03  WS-AB0009               PIC S9(04)      COMP             00099000
001000                                                 VALUE +0009.     00100000
001010     03  WS-AB0106               PIC S9(04)      COMP             00101000
001020                                                 VALUE +0106.     00102000
001030     03  WS-AB2033               PIC S9(04)      COMP             00103000
001040                                                 VALUE +2033.     00104000
001050     03  WS-AB6345               PIC S9(04)      COMP             00105000
001060                                                 VALUE +6345.     00106000
001070 01  WS-TRACECODES.                                               00107000
001080     03  WS-TR0001               PIC S9(04)      COMP             00108000
001090                                                 VALUE +0001.     00109000
001100     03  WS-TR0002               PIC S9(04)      COMP             00110000
001110                                                 VALUE +0002.     00111000
001120     03  WS-TR0003               PIC S9(04)      COMP             00112000
001130                                                 VALUE +0003.     00113000
001140 01  SLW096-AREAS.                                                00114000
000000 COPY SLW096.                                                     00115000
001160 01  RPW014-AREAS.                                                00116000
000000 COPY RPW014.                                                     00117000
001180 01  RPW033-AREAS.                                                00118000
000000 COPY RPW033.                                                     00119000
001200 01  RPW130-AREAS.                                                00120000
000000 COPY RPW130.                                                     00121000
001220 01  SRW000-AREAS.                                                00122000
000000 COPY SRW000.                                                     00123000
001240 01  SRW025-AREAS.                                                00124000
000000 COPY SRW025.                                                     00125000
001260 01  SRW030-AREAS.                                                00126000
000000 COPY SRW030.                                                     00127000
001280 01  SRW031-AREAS.                                                00128000
000000 COPY SRW031.                                                     00129000
001300 01  SRW105-AREAS.                                                00130000
000000 COPY SRW105.                                                     00131000
001320 01  SRW161-AREAS.                                                00132000
000000 COPY SRW161.                                                     00133000
001340 01  SRW166-AREAS.                                                00134000
000000 COPY SRW166.                                                     00135000
001360 01  SRW170-AREAS.                                                00136000
000000 COPY SRW170.                                                     00137000
001380 COPY DFHAID.                                                     00138000
001390******************************************************************00139000
001400 LINKAGE SECTION.                                                 00140000
001410 01  DFHCOMMAREA.                                                 00141000
000000 COPY SLS1112.                                                    00142000
001430     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00143000
001440         05  COM-EDIT-DATE       PIC X(10).                       00144000
001450         05  COM-KEY-INFO.                                        00145000
001460             07  COM-KEY-OCCUR   PIC S9(04)      COMP-3.          00146000
001470             07  COM-KEY-DATA                    OCCURS 08 TIMES. 00147000
001480                 09  COM-KD-INST                                  00148000
001490                                 PIC 9(04).                       00149000
001500                 09  COM-KD-PRODCODE                              00150000
001510                                 PIC X(06).                       00151000
001520                 09  COM-KD-ACCOUNT                               00152000
001530                                 PIC X(18).                       00153000
001540                 09  COM-KD-ACCOUNT-N                             00154000
001550                         REDEFINES COM-KD-ACCOUNT                 00155000
001560                                 PIC 9(18).                       00156000
001570                 09  COM-KD-MODEL                                 00157000
001580                                 PIC X(10).                       00158000
001590         05  COM-KEY-FIELDS.                                      00159000
001600             07  COM-KEY-PRODCODE                                 00160000
001610                                 PIC X(06).                       00161000
001620             07  COM-KEY-ACCOUNT PIC X(18).                       00162000
001630             07  COM-KEY-ACCOUNT-N                                00163000
001640                         REDEFINES COM-KEY-ACCOUNT                00164000
001650                                 PIC 9(18).                       00165000
001660             07  COM-KEY-MODEL                                    00166000
001670                                 PIC X(10).                       00167000
001680             07  COM-KEY-IDNBRX  PIC X(18).                       00168000
001690             07  COM-KEY-IDNBR                                    00169000
001700                         REDEFINES COM-KEY-IDNBRX                 00170000
001710                                 PIC 9(18).                       00171000
001720         05  COM-PANEL-ACTION    PIC X(01).                       00172000
001730             88  INITIAL-PANEL                   VALUE ' '.       00173000
001740             88  EDIT-PANEL                      VALUE 'E'.       00174000
001750         05  COM-FROM-PANEL      PIC X(01).                       00175000
001760             88  FROM-KEY-PANEL                  VALUE 'K'.       00176000
001770             88  FROM-INFO-PANEL                 VALUE 'I'.       00177000
001780             88  FROM-HELP                       VALUE 'H'.       00178000
001790             88  FROM-BREAKAWAY                  VALUE 'B'.       00179000
001800         05  COM-KEY-FORMATTEDACCT                                00180000
001810                                 PIC X(22).                       00181000
001820         05  COM-KEY-MSGNBR      PIC X(06).                       00182000
001830         05  COM-KEY-COMMAND     PIC X(50).                       00183000
001840         05  COM-FIRST-KEY       PIC X(38).                       00184000
001850         05  COM-LAST-KEY        PIC X(38).                       00185000
001860         05  COM-MORE            PIC X(01).                       00186000
001870         05  COM-RPQUA00-CURPAGE PIC S9(04)      COMP-3.          00187000
001880         05  COM-DCHG.                                            00188000
001890             07  FILLER                          OCCURS 07 TIMES. 00189000
001900                 09  COM-DEL-DCHG                                 00190000
001910                                 PIC X(01).                       00191000
001920******************************************************************00192000
001930*01  SLW096-2023RECORDS.                                          00193000
000000 COPY SLW096L.                                                    00194000
001950******************************************************************00195000
001960 PROCEDURE DIVISION.                                              00196000
001970******************************************************************00197000
001980 ENTRY-ROUTINE SECTION.                                           00198000
001990     MOVE 'RPL330' TO COM-ABPROGID.                               00199000
000000 COPY SLP771.                                                     00200000
002010******************************************************************00201000
002020 TRANSACTION-CLEAN-UP SECTION.                                    00202000
002030 TCU-START.                                                       00203000
002040 TCU-EXIT.                                                        00204000
002050     EXIT.                                                        00205000
002060******************************************************************00206000
002070 CICS-HANDLE-CONDITION SECTION.                                   00207000
000000 COPY SLP772.                                                     00208000
002090     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00209000
002100         GO TO CTSRI-EXIT.                                        00210000
002110     MOVE WS-AB2033 TO COM-ABORT.                                 00211000
002120     MOVE WS-TR0001 TO COM-ABTRACE.                               00212000
002130     GO TO ABORT-EXIT.                                            00213000
002140 CHC-EXIT.                                                        00214000
002150     EXIT.                                                        00215000
002160******************************************************************00216000
002170 ROUTING-ROUTINE SECTION.                                         00217000
002180 RR-START.                                                        00218000
002190     MOVE LOW-VALUES TO RPQUA00-MESSAGE.                          00219000
002200     MOVE LOW-VALUES TO RPV330-PANL-DATA-AREA.                    00220000
002210     MOVE LOW-VALUES TO RPV330K-PANL-DATA-AREA.                   00221000
002220     MOVE ALL ZEROS TO WS-MSGNBR.                                 00222000
002230     MOVE 'RP00' TO WS-TSQFILEID.                                 00223000
002240     MOVE 'RPI' TO WS-TSQSYSID.                                   00224000
002250     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00225000
002260     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00226000
002270     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00227000
002280         MOVE COM-PAN TO BICRPAN                                  00228000
002290         MOVE COM-PSB TO BICRPSB                                  00229000
002300         MOVE COM-SRB TO BICRSRB                                  00230000
002310     ELSE                                                         00231000
002320         MOVE '1' TO BPSB-LEVEL.                                  00232000
002330     IF COM-RETURN IS EQUAL TO 'B'                                00233000
002340         GO TO BREAKAWAY-RETURN.                                  00234000
002350     IF COM-RETURN IS EQUAL TO '0'                                00235000
002360         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00236000
002370         MOVE SPACES TO COM-WORKAREAS                             00237000
002380         MOVE '1' TO SRB-VERSION                                  00238000
002390         MOVE 'IPRP' TO SRB-APPL-ID                               00239000
002400         MOVE 'RPL330' TO SRB-PROG-ID                             00240000
002410         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00241000
002420         MOVE 'P' TO PAN-TYPE                                     00242000
002430         MOVE SPACE TO PAN-OVERLAY                                00243000
002440         MOVE SPACE TO PAN-CLOSE                                  00244000
002450         MOVE SPACE TO PAN-ALARM                                  00245000
002460         MOVE SPACE TO PAN-CURSOR-PAN                             00246000
002470         MOVE SPACE TO PAN-CURSOR-FLD                             00247000
002480         MOVE SPACE TO PAN-SET-FLD                                00248000
002490         MOVE SPACE TO PAN-SET-VID                                00249000
002500         MOVE SPACE TO PAN-SET-EMP                                00250000
002510         MOVE +0 TO COM-RPQUA00-CURPAGE                           00251000
002520         MOVE +0 TO COM-KEY-OCCUR                                 00252000
002530         MOVE PDB-RPV330K-NAME TO PAN-NAME                        00253000
002540         PERFORM PANEL-INIT                                       00254000
002550         MOVE BICRPAN TO COM-PAN                                  00255000
002560         MOVE BICRPSB TO COM-PSB                                  00256000
002570         MOVE BICRSRB TO COM-SRB                                  00257000
002580         PERFORM INITIALIZE-DATE                                  00258000
002590         GO TO PANEL-ROUTER.                                      00259000
002600     PERFORM PANEL-NAME-SET.                                      00260000
002610     IF COM-HELPSW IS EQUAL TO 'Y'                                00261000
002620         GO TO HELP-RETURN.                                       00262000
002630     PERFORM PANEL-RECEIVE.                                       00263000
002640     PERFORM PANEL-DATA-GET.                                      00264000
002650     IF FROM-INFO-PANEL                                           00265000
002660         PERFORM SET-DCHG-INDICATORS.                             00266000
002670     PERFORM PANEL-PFKEY-SET.                                     00267000
002680     PERFORM VALIDATE-PFKEYS.                                     00268000
002690     IF EIBAID IS EQUAL TO DFHPF1                                 00269000
002700         GO TO GET-HELP.                                          00270000
002710     IF EIBAID IS EQUAL TO DFHPF11                                00271000
002720         GO TO BREAK-AWAY.                                        00272000
002730     IF (COM-RETURN IS EQUAL TO 'E')                              00273000
002740         AND (EIBAID IS EQUAL TO DFHPF2                           00274000
002750         OR EIBAID IS EQUAL TO DFHPF3                             00275000
002760         OR EIBAID IS EQUAL TO DFHPF4                             00276000
002770         OR EIBAID IS EQUAL TO DFHPF7                             00277000
002780         OR EIBAID IS EQUAL TO DFHPF8                             00278000
002790         OR EIBAID IS EQUAL TO DFHPF12)                           00279000
002800         GO TO CLOSE-TRANSACTION.                                 00280000
002810     IF COM-RETURN IS EQUAL TO '1'                                00281000
002820         AND EIBAID IS EQUAL TO DFHPF12                           00282000
002830         GO TO CLOSE-TRANSACTION.                                 00283000
002840     IF COM-RETURN IS EQUAL TO '0'                                00284000
002850         OR COM-RETURN IS EQUAL TO 'E'                            00285000
002860         OR COM-RETURN IS EQUAL TO '1'                            00286000
002870         GO TO PANEL-ROUTER.                                      00287000
002880 RR-END.                                                          00288000
002890     GO TO CLOSE-TRANSACTION.                                     00289000
002900 RR-EXIT.                                                         00290000
002910     EXIT.                                                        00291000
002920******************************************************************00292000
002930 INITIALIZE-DATE SECTION.                                         00293000
002940 ID-START.                                                        00294000
002950     MOVE COM-DATE TO WS-CURDATE8.                                00295000
002960     MOVE '-' TO WS-CD8DSH1.                                      00296000
002970     MOVE '-' TO WS-CD8DSH2.                                      00297000
002980     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00298000
002990 ID-EXIT.                                                         00299000
003000     EXIT.                                                        00300000
003010******************************************************************00301000
003020 PANEL-NAME-SET SECTION.                                          00302000
003030 PNS-START.                                                       00303000
003040     IF COM-RETURN IS EQUAL TO '0'                                00304000
003050         MOVE PDB-RPV330K-NAME TO PAN-NAME.                       00305000
003060     IF COM-RETURN IS EQUAL TO 'E'                                00306000
003070         MOVE PDB-RPV330K-NAME TO PAN-NAME.                       00307000
003080     IF COM-RETURN IS EQUAL TO '1'                                00308000
003090         MOVE PDB-RPV330-NAME TO PAN-NAME.                        00309000
003100 PNS-EXIT.                                                        00310000
003110     EXIT.                                                        00311000
003120******************************************************************00312000
003130 PANEL-DATA-GET SECTION.                                          00313000
003140 PDG-START.                                                       00314000
003150     IF COM-RETURN IS EQUAL TO '0'                                00315000
003160         PERFORM PANEL-GET-RPV330K.                               00316000
003170     IF COM-RETURN IS EQUAL TO 'E'                                00317000
003180         PERFORM PANEL-GET-RPV330K                                00318000
003190         MOVE RPV330K-COMMAND TO WS-NEXTKEY                       00319000
003200         MOVE PDB-RPV330K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00320000
003210     IF COM-RETURN IS EQUAL TO '1'                                00321000
003220         PERFORM PANEL-GET-RPV330                                 00322000
003230         MOVE RPV330-COMMAND TO WS-NEXTKEY                        00323000
003240         MOVE PDB-RPV330-COMMAND-DCHG TO WS-COMMAND-DCHG.         00324000
003250 PDG-EXIT.                                                        00325000
003260     EXIT.                                                        00326000
003270******************************************************************00327000
003280 PANEL-PFKEY-SET SECTION.                                         00328000
003290 PPS-START.                                                       00329000
003300 PPS-EXIT.                                                        00330000
003310     EXIT.                                                        00331000
003320******************************************************************00332000
003330 PANEL-ROUTER SECTION.                                            00333000
003340 PR-START.                                                        00334000
003350     IF COM-RETURN IS EQUAL TO '0'                                00335000
003360         GO TO PROCESS-KEY-PANEL.                                 00336000
003370     IF COM-RETURN IS EQUAL TO 'E'                                00337000
003380         GO TO PROCESS-KEY-PANEL.                                 00338000
003390     IF COM-RETURN IS EQUAL TO '1'                                00339000
003400         GO TO PROCESS-INFO-PANEL.                                00340000
003410     GO TO CLOSE-TRANSACTION.                                     00341000
003420 PR-EXIT.                                                         00342000
003430     EXIT.                                                        00343000
003440******************************************************************00344000
003450 HELP-RETURN SECTION.                                             00345000
000000 COPY SRP074.                                                     00346000
003470******************************************************************00347000
003480 HELP-RETURN-FINISH SECTION.                                      00348000
003490 HRF-START.                                                       00349000
003500     PERFORM PANEL-DATA-GET.                                      00350000
003510     MOVE 'H' TO COM-FROM-PANEL.                                  00351000
003520     GO TO PANEL-ROUTER.                                          00352000
003530 HRF-EXIT.                                                        00353000
003540     EXIT.                                                        00354000
003550******************************************************************00355000
003560 HELP-MISSING-FINISH SECTION.                                     00356000
003570 HMF-START.                                                       00357000
003580     MOVE 'H' TO COM-FROM-PANEL.                                  00358000
003590     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00359000
003600     GO TO PANEL-ROUTER.                                          00360000
003610 HMF-EXIT.                                                        00361000
003620     EXIT.                                                        00362000
003630******************************************************************00363000
003640 BREAK-AWAY SECTION.                                              00364000
000000 COPY SRP0752.                                                    00365000
003660******************************************************************00366000
003670 BREAKAWAY-RETURN-FINISH SECTION.                                 00367000
003680 BRF-START.                                                       00368000
003690     PERFORM PANEL-DATA-GET.                                      00369000
003700     MOVE 'B' TO COM-FROM-PANEL.                                  00370000
003710     GO TO PANEL-ROUTER.                                          00371000
003720 BRF-EXIT.                                                        00372000
003730     EXIT.                                                        00373000
003740******************************************************************00374000
003750 PROCESS-KEY-PANEL SECTION.                                       00375000
003760 PKP-START.                                                       00376000
003770     IF INITIAL-PANEL                                             00377000
003780         MOVE COM-NEXTKEY TO COM-EXTERNALID                       00378000
003790         GO TO PKP-COM-INIT.                                      00379000
003800     IF EDIT-PANEL                                                00380000
003810         AND FROM-INFO-PANEL                                      00381000
003820         MOVE SPACE TO COM-FROM-PANEL                             00382000
003830         GO TO PKP-RELOAD-PANEL.                                  00383000
003840 PKP-COM-INIT.                                                    00384000
003850     MOVE COM-NEXTKEY TO SR-PSLIST.                               00385000
003860     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00386000
003870         GO TO PKP-SEND-PANEL.                                    00387000
003880 PKP-BEGIN-EDITS.                                                 00388000
003890     IF EDIT-PANEL                                                00389000
003900         MOVE RPV330K-PRODCD TO COM-KEY-PRODCODE                  00390000
003910         MOVE RPV330K-ACCOUNT TO COM-KEY-ACCOUNT                  00391000
003920         MOVE SPACES TO COM-KEY-MODEL                             00392000
003930         MOVE RPV330K-IDNBR TO COM-KEY-IDNBRX                     00393000
003940         GO TO PKP-RETURN-EDITS.                                  00394000
003950     PERFORM PARAMETER-SEARCH.                                    00395000
003960     MOVE SR-PSPARM TO COM-EXTID.                                 00396000
003970     MOVE SR-PSPARM TO COM-EXTERNALID.                            00397000
003980     PERFORM PARAMETER-SEARCH.                                    00398000
003990     MOVE SR-PSPARM TO COM-KEY-PRODCODE.                          00399000
004000     PERFORM PARAMETER-SEARCH.                                    00400000
004010     MOVE SR-PSPARM TO COM-KEY-ACCOUNT.                           00401000
004020     PERFORM PARAMETER-SEARCH.                                    00402000
004030     MOVE SR-PSPARM TO COM-KEY-IDNBRX.                            00403000
004040 PKP-RETURN-EDITS.                                                00404000
004050     IF COM-KEY-PRODCODE IS EQUAL TO SPACE                        00405000
004060         MOVE LOW-VALUE TO COM-KEY-PRODCODE.                      00406000
004070     IF COM-KEY-ACCOUNT IS EQUAL TO SPACE                         00407000
004080         MOVE LOW-VALUE TO COM-KEY-ACCOUNT.                       00408000
004090     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00409000
004100         MOVE LOW-VALUES TO COM-KEY-MODEL.                        00410000
004110     IF COM-KEY-IDNBRX IS EQUAL TO SPACES                         00411000
004120         MOVE LOW-VALUES TO COM-KEY-IDNBRX.                       00412000
004130     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00413000
004140         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00414000
004150         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00415000
004160         AND COM-KEY-IDNBRX IS GREATER THAN LOW-VALUE             00416000
004170         GO TO PKP-RETURN-CONT.                                   00417000
004180     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00418000
004190         MOVE '000002' TO WS-MSGNBR                               00419000
004200         GO TO PKP-RETURN-CONT.                                   00420000
004210     PERFORM EDIT-ACCOUNT-KEY.                                    00421000
004220 PKP-RETURN-CONT.                                                 00422000
004230     IF INITIAL-PANEL                                             00423000
004240         AND COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE               00424000
004250         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00425000
004260         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00426000
004270         AND COM-KEY-IDNBRX IS EQUAL TO LOW-VALUE                 00427000
004280         MOVE '000001' TO WS-MSGNBR                               00428000
004290         GO TO PKP-SEND-PANEL.                                    00429000
004300     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00430000
004310     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00431000
004320     IF FROM-BREAKAWAY                                            00432000
004330         OR FROM-HELP                                             00433000
004340         GO TO PKP-RELOAD-PANEL.                                  00434000
004350     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00435000
004360         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00436000
004370         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00437000
004380         AND COM-KEY-IDNBRX IS EQUAL TO LOW-VALUE                 00438000
004390         GO TO PKP-EDITS-READY.                                   00439000
004400     MOVE COM-KEY-IDNBRX TO SR-JUSTIFYIN.                         00440000
004410     MOVE +0018 TO SR-JLGTH.                                      00441000
004420     PERFORM RIGHT-JUSTIFY.                                       00442000
004430     IF SR-JUSTIFYOUT IS EQUAL TO SPACE                           00443000
004440         MOVE ZEROS TO COM-KEY-IDNBRX                             00444000
004450     ELSE                                                         00445000
004460         MOVE SR-JUSTIFYOUT TO COM-KEY-IDNBRX.                    00446000
004470     IF COM-KEY-IDNBRX IS NOT NUMERIC                             00447000
004480         MOVE ZEROES TO COM-KEY-IDNBRX.                           00448000
004490     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00449000
004500         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00450000
004510     ELSE                                                         00451000
004520         MOVE ZERO TO COM-ACCOUNT.                                00452000
004530     IF WS-MSGNBR IS NOT EQUAL TO ZERO                            00453000
004540         GO TO PKP-RELOAD-PANEL.                                  00454000
004550     IF COM-KEY-PRODCODE IS GREATER THAN SPACES                   00455000
004560         AND COM-KEY-ACCOUNT IS GREATER THAN SPACES               00456000
004570         AND COM-KEY-IDNBRX IS GREATER THAN ZEROS                 00457000
004580         MOVE '000002' TO WS-MSGNBR                               00458000
004590         GO TO PKP-RELOAD-PANEL.                                  00459000
004600 PKP-EDITS-READY.                                                 00460000
004610     MOVE SPACE TO COM-PANEL-ACTION.                              00461000
004620     MOVE '1' TO COM-RETURN.                                      00462000
004630     MOVE 'K' TO COM-FROM-PANEL.                                  00463000
004640     GO TO PANEL-ROUTER.                                          00464000
004650 PKP-RELOAD-PANEL.                                                00465000
004660     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00466000
004670         MOVE LOW-VALUES TO RPV330K-PRODCD                        00467000
004680     ELSE                                                         00468000
004690         MOVE COM-KEY-PRODCODE TO RPV330K-PRODCD.                 00469000
004700     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00470000
004710         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROS                     00471000
004720         MOVE LOW-VALUES TO RPV330K-ACCOUNT                       00472000
004730     ELSE                                                         00473000
004740         MOVE COM-KEY-ACCOUNT TO RPV330K-ACCOUNT.                 00474000
004750     MOVE COM-KEY-IDNBRX TO RPV330K-IDNBR.                        00475000
004760     IF COM-KEY-IDNBRX IS NOT GREATER THAN ZEROS                  00476000
004770         MOVE LOW-VALUES TO RPV330K-IDNBR.                        00477000
004780 PKP-SEND-PANEL.                                                  00478000
004790     MOVE PDB-RPV330K-NAME TO PAN-NAME.                           00479000
004800     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00480000
004810     IF FROM-HELP                                                 00481000
004820         OR FROM-BREAKAWAY                                        00482000
004830         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD.                      00483000
004840     IF WS-CURSOR-FIELD IS EQUAL TO SPACE                         00484000
004850         MOVE PDB-RPV330K-PRODCD TO PAN-SET-FLD                   00485000
004860     ELSE                                                         00486000
004870         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                     00487000
004880     PERFORM CALL-BISPAN-RPV330K.                                 00488000
004890     MOVE COM-OPERID TO RPV330K-OPERID.                           00489000
004900     MOVE COM-INST TO RPV330K-INST.                               00490000
004910     MOVE COM-EDIT-DATE TO RPV330K-SYSDATE.                       00491000
004920     IF RPV330K-PRODCD IS EQUAL TO SPACES                         00492000
004930         MOVE LOW-VALUES TO RPV330K-PRODCD.                       00493000
004940     MOVE RPV330K-ACCOUNT TO SR-JUSTIFYIN.                        00494000
004950     MOVE +18 TO SR-JLGTH.                                        00495000
004960     PERFORM LEFT-JUSTIFY.                                        00496000
004970     MOVE SR-JUSTIFYOUT TO RPV330K-ACCOUNT.                       00497000
004980     IF RPV330K-ACCOUNT IS EQUAL TO SPACES                        00498000
004990         MOVE LOW-VALUES TO RPV330K-ACCOUNT.                      00499000
005000     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00500000
005010         MOVE WS-HELPMSG TO WS-MSGNBR.                            00501000
005020     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00502000
005030         MOVE '000027' TO WS-MSGNBR                               00503000
005040     ELSE                                                         00504000
005050         PERFORM BUILD-NEXTKEY                                    00505000
005060         PERFORM COMPRESS-NEXTKEY                                 00506000
005070         MOVE WS-NEXTKEY TO RPV330K-COMMAND.                      00507000
005080     IF FROM-BREAKAWAY                                            00508000
005090         OR FROM-HELP                                             00509000
005100         MOVE SPACE TO COM-FROM-PANEL                             00510000
005110         MOVE COM-KEY-COMMAND TO RPV330K-COMMAND                  00511000
005120         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00512000
005130     ELSE                                                         00513000
005140         MOVE WS-NEXTKEY TO COM-KEY-COMMAND                       00514000
005150         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00515000
005160     MOVE 'E' TO COM-RETURN.                                      00516000
005170     PERFORM GET-MESSAGE.                                         00517000
005180     MOVE WS-MESSAGE TO RPV330K-MSGLINE.                          00518000
005190     PERFORM PANEL-PFKEY-SET.                                     00519000
005200     PERFORM BUILD-PFKEY-LINE.                                    00520000
005210     MOVE WS-PFLINE1 TO RPV330K-PFLINE1.                          00521000
005220     MOVE WS-PFLINE2 TO RPV330K-PFLINE2.                          00522000
005230     PERFORM PANEL-PUT-RPV330K.                                   00523000
005240     PERFORM PANEL-SEND.                                          00524000
005250     MOVE 'E' TO COM-PANEL-ACTION.                                00525000
005260     MOVE COM-INTID TO WS-TRANSID.                                00526000
005270     GO TO CICS-RETURN-TRANSID.                                   00527000
005280 PKP-EXIT.                                                        00528000
005290     EXIT.                                                        00529000
005300******************************************************************00530000
005310 PROCESS-INFO-PANEL SECTION.                                      00531000
005320 PIP-START.                                                       00532000
005330     IF FROM-HELP                                                 00533000
005340         OR FROM-BREAKAWAY                                        00534000
005350         GO TO PIP-SEND-PANEL.                                    00535000
005360     IF INITIAL-PANEL                                             00536000
005370         MOVE COM-INST TO RPQUA00-KEY-INST                        00537000
005380         MOVE COM-PRODCODE TO RPQUA00-KEY-PRODCODE                00538000
005390         MOVE COM-KEY-ACCOUNT TO RPQUA00-KEY-ACCOUNT              00539000
005400         MOVE COM-KEY-MODEL TO RPQUA00-KEY-MODEL                  00540000
005410         MOVE +0 TO RPQUA00-SUB                                   00541000
005420         MOVE SPACES TO COM-DCHG                                  00542000
005430         MOVE +1 TO RPQUA00-PAGES-TO-READ                         00543000
005440         MOVE +1 TO COM-RPQUA00-CURPAGE                           00544000
005450         MOVE COM-RPQUA00-CURPAGE TO RPQUA00-CURPAGE              00545000
005460         MOVE SPACES TO COM-FIRST-KEY                             00546000
005470         MOVE 'VKL' TO RPQUA00-APIFUNC                            00547000
005480         GO TO PIP-RPQUA00-LOOP.                                  00548000
005490 PIP-PFKEYS.                                                      00549000
005500     MOVE ALL ZEROS TO WS-MSGNBR.                                 00550000
005510     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00551000
005520         MOVE PDB-RPV330-COMMAND TO WS-CURSOR-FIELD               00552000
005530         GO TO PIP-SEND-PANEL.                                    00553000
005540     IF EIBAID IS EQUAL TO DFHPF2                                 00554000
005550         AND COM-RPQUA00-CURPAGE IS GREATER THAN +1               00555000
005560         MOVE +1 TO RPQUA00-CURPAGE                               00556000
005570         MOVE +1 TO RPQUA00-PAGES-TO-READ                         00557000
005580         MOVE COM-FIRST-KEY TO RPQUA00-KEY-RECORD                 00558000
005590         GO TO PIP-CONTINUE.                                      00559000
005600     IF EIBAID IS EQUAL TO DFHPF7                                 00560000
005610         AND COM-RPQUA00-CURPAGE IS GREATER THAN +1               00561000
005620         MOVE COM-RPQUA00-CURPAGE TO RPQUA00-CURPAGE              00562000
005630         SUBTRACT +1 FROM RPQUA00-CURPAGE                         00563000
005640         MOVE RPQUA00-CURPAGE TO RPQUA00-PAGES-TO-READ            00564000
005650         MOVE COM-FIRST-KEY TO RPQUA00-KEY-RECORD                 00565000
005660         GO TO PIP-CONTINUE.                                      00566000
005670     IF EIBAID IS EQUAL TO DFHPF8                                 00567000
005680         AND COM-KEY-OCCUR IS LESS THAN +08                       00568000
005690         MOVE '000046' TO WS-MSGNBR                               00569000
005700         GO TO PIP-SEND-PANEL.                                    00570000
005710     IF EIBAID IS EQUAL TO DFHPF8                                 00571000
005720         OR EIBAID IS EQUAL TO DFHENTER                           00572000
005730         MOVE COM-RPQUA00-CURPAGE TO RPQUA00-CURPAGE              00573000
005740         ADD +1 TO RPQUA00-CURPAGE                                00574000
005750         MOVE +1 TO RPQUA00-PAGES-TO-READ                         00575000
005760         MOVE COM-LAST-KEY TO RPQUA00-KEY-RECORD                  00576000
005770         GO TO PIP-CONTINUE.                                      00577000
005780     IF EIBAID IS EQUAL TO DFHPF3                                 00578000
005790         OR EIBAID IS EQUAL TO DFHPF4                             00579000
005800         GO TO PIP-CONTINUE.                                      00580000
005810 PIP-CONTINUE.                                                    00581000
005820     MOVE +0 TO WS-ERROR-COUNT.                                   00582000
005830     MOVE COM-DCHG TO SRW166-FIELD.                               00583000
005840     MOVE 'E' TO SRW166-IN.                                       00584000
005850     MOVE 'Y' TO SRW166-OUT.                                      00585000
005860* MOVE THE LENGTH OF THE COM-DCHG FIELD:                          00586000
005870     MOVE +07 TO SRW166-LGTH.                                     00587000
005880     PERFORM EXAMINE-FIELD.                                       00588000
005890     MOVE SRW166-FIELD TO COM-DCHG.                               00589000
005900     MOVE COM-DCHG TO RPQUA00-DCHG.                               00590000
005910     PERFORM MOVE-PANEL-TO-RECORD.                                00591000
005920     MOVE +0 TO RPQUA00-SUB.                                      00592000
005930     IF COM-DCHG IS EQUAL TO SPACES                               00593000
005940         AND (EIBAID IS EQUAL TO DFHPF3                           00594000
005950         OR EIBAID IS EQUAL TO DFHPF4)                            00595000
005960         GO TO CLOSE-TRANSACTION.                                 00596000
005970     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00597000
005980         AND (EIBAID IS EQUAL TO DFHPF3                           00598000
005990         OR EIBAID IS EQUAL TO DFHPF4)                            00599000
006000         GO TO CLOSE-TRANSACTION.                                 00600000
006010     IF RPQUA00-PAGES-TO-READ IS NOT NUMERIC                      00601000
006020         MOVE +0001 TO RPQUA00-PAGES-TO-READ.                     00602000
006030     IF INITIAL-PANEL                                             00603000
006040         MOVE 'VKL' TO RPQUA00-APIFUNC.                           00604000
006050     IF EDIT-PANEL                                                00605000
006060         MOVE 'UPD' TO RPQUA00-APIFUNC.                           00606000
006070 PIP-RPQUA00-LOOP.                                                00607000
006080     ADD +1 TO RPQUA00-SUB.                                       00608000
006090     IF RPQUA00-SUB IS GREATER THAN RPQUA00-PAGES-TO-READ         00609000
006100         GO TO PIP-RPQUA00-RETURN-CHECK.                          00610000
006110     PERFORM RPQUA00-LINK-MESSAGE.                                00611000
006120     IF RPQUA00-MSGNBR IS NOT EQUAL TO ZEROS                      00612000
006130         AND RPQUA00-SUB IS EQUAL TO +0001                        00613000
006140         MOVE COM-RPQUA00-CURPAGE TO RPQUA00-CURPAGE              00614000
006150         GO TO PIP-RPQUA00-RETURN-CHECK.                          00615000
006160     IF RPQUA00-SUB IS EQUAL TO +0001                             00616000
006170         MOVE RPQUA00-KEY-IDNUMBER TO COM-KEY-IDNBR               00617000
006180         MOVE SPACES TO RPQUA00-DCHG.                             00618000
006190     GO TO PIP-RPQUA00-LOOP.                                      00619000
006200 PIP-RPQUA00-RETURN-CHECK.                                        00620000
006210     IF RPQUA00-RETURN IS EQUAL TO 'E'                            00621000
006220         MOVE 'E' TO COM-RETURN                                   00622000
006230         MOVE 'E' TO COM-PANEL-ACTION                             00623000
006240         MOVE 'I' TO COM-FROM-PANEL                               00624000
006250         GO TO PANEL-ROUTER.                                      00625000
006260     IF RPQUA00-SELECT-RTN IS NOT EQUAL TO '1'                    00626000
006270         AND RPQUA00-SELECT-RTN IS NOT EQUAL TO '2'               00627000
006280         AND RPQUA00-SELECT-RTN IS NOT EQUAL TO '3'               00628000
006290         MOVE WS-AB6345 TO COM-ABORT                              00629000
006300         MOVE WS-TR0002 TO COM-ABTRACE                            00630000
006310         GO TO ABORT-EXIT.                                        00631000
006320     IF RPQUA00-SELECT-RTN IS EQUAL TO '1'                        00632000
006330         AND EDIT-PANEL                                           00633000
006340         MOVE 'X' TO COM-RETURN                                   00634000
006350         GO TO PANEL-ROUTER.                                      00635000
006360     IF RPQUA00-SELECT-RTN IS EQUAL TO '1'                        00636000
006370         MOVE '000003' TO WS-MSGNBR                               00637000
006380         MOVE 'E' TO COM-RETURN                                   00638000
006390         MOVE 'E' TO COM-PANEL-ACTION                             00639000
006400         MOVE 'I' TO COM-FROM-PANEL                               00640000
006410         GO TO PANEL-ROUTER.                                      00641000
006420     IF RPQUA00-APIFUNC IS EQUAL TO 'EDT'                         00642000
006430         GO TO PIP-BUILD-MAINT-PANEL.                             00643000
006440 PIP-PAGING-CONTROLS.                                             00644000
006450     IF EIBAID IS EQUAL TO DFHPF3                                 00645000
006460         OR EIBAID IS EQUAL TO DFHPF4                             00646000
006470         GO TO CLOSE-TRANSACTION.                                 00647000
006480     IF RPQUA00-SELECT-RTN IS LESS THAN '3'                       00648000
006490         AND COM-KEY-OCCUR IS LESS THAN +08                       00649000
006500         AND EIBAID IS NOT EQUAL TO DFHPF7                        00650000
006510         AND EDIT-PANEL                                           00651000
006520         MOVE 'X' TO COM-RETURN                                   00652000
006530         GO TO PANEL-ROUTER.                                      00653000
006540     IF COM-FIRST-KEY IS EQUAL TO SPACES                          00654000
006550         MOVE RPQUA00-GRP-KEY (1) TO COM-FIRST-KEY.               00655000
006560     MOVE RPQUA00-GRP-KEY (RPQUA00-OCCUR) TO COM-LAST-KEY.        00656000
006570     MOVE RPQUA00-CURPAGE TO COM-RPQUA00-CURPAGE.                 00657000
006580     MOVE RPQUA00-OCCUR TO COM-KEY-OCCUR.                         00658000
006590 PIP-BUILD-MAINT-PANEL.                                           00659000
006600     MOVE RPQUA00-DCHG TO COM-DCHG.                               00660000
006610     PERFORM BUILD-MAINT-PANEL.                                   00661000
006620     MOVE +0 TO WS-SUB2.                                          00662000
006630 PIP-LOOP.                                                        00663000
006640     ADD +1 TO WS-SUB2.                                           00664000
006650     IF WS-SUB2 IS GREATER THAN COM-KEY-OCCUR                     00665000
006660         GO TO PIP-SEND-PANEL.                                    00666000
006670     MOVE RPQUA00-GRP-KEY (WS-SUB2) TO                            00667000
006680         COM-KEY-DATA (WS-SUB2).                                  00668000
006690     GO TO PIP-LOOP.                                              00669000
006700 PIP-SEND-PANEL.                                                  00670000
006710     MOVE PDB-RPV330-NAME TO PAN-NAME.                            00671000
006720     MOVE COM-INST TO RPV330-INST.                                00672000
006730     MOVE COM-OPERID TO RPV330-OPERID.                            00673000
006740     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00674000
006750         MOVE ALL 'P' TO COM-DCHG                                 00675000
006760         MOVE PDB-RPV330-COMMAND TO WS-CURSOR-FIELD.              00676000
006770     PERFORM SET-ATTRIBUTES-AND-MESSAGES.                         00677000
006780     IF (FROM-HELP                                                00678000
006790         OR FROM-BREAKAWAY)                                       00679000
006800         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00680000
006810         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00681000
006820         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00682000
006830     ELSE                                                         00683000
006840         IF WS-CURSOR-FIELD IS EQUAL TO SPACE                     00684000
006850             MOVE PDB-RPV330-DELETE TO PAN-SET-FLD                00685000
006860             MOVE +1 TO PAN-SET-OCC                               00686000
006870         ELSE                                                     00687000
006880             MOVE WS-CURSOR-FIELD TO PAN-SET-FLD                  00688000
006890             MOVE WS-CURSOR-OCC TO PAN-SET-OCC.                   00689000
006900     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00690000
006910     PERFORM CALL-BISPAN-RPV330.                                  00691000
006920     MOVE COM-INST TO RPV330-INST.                                00692000
006930     MOVE COM-OPERID TO RPV330-OPERID.                            00693000
006940     MOVE COM-EDIT-DATE TO RPV330-SYSDATE.                        00694000
006950     IF WS-MSGNBR NOT NUMERIC                                     00695000
006960         MOVE ZERO TO WS-MSGNBR.                                  00696000
006970     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00697000
006980         MOVE WS-HELPMSG TO WS-MSGNBR.                            00698000
006990     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00699000
007000         MOVE '000027' TO WS-MSGNBR                               00700000
007010     ELSE                                                         00701000
007020         PERFORM BUILD-NEXTKEY                                    00702000
007030         PERFORM COMPRESS-NEXTKEY                                 00703000
007040         MOVE WS-NEXTKEY TO RPV330-COMMAND.                       00704000
007050     IF FROM-HELP                                                 00705000
007060         OR FROM-BREAKAWAY                                        00706000
007070         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00707000
007080         MOVE COM-KEY-COMMAND TO RPV330-COMMAND                   00708000
007090         MOVE SPACE TO COM-FROM-PANEL                             00709000
007100     ELSE                                                         00710000
007110         MOVE RPV330-COMMAND TO COM-KEY-COMMAND                   00711000
007120         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00712000
007130     PERFORM GET-MESSAGE.                                         00713000
007140     MOVE WS-MESSAGE TO RPV330-MSGLINE.                           00714000
007150     PERFORM PANEL-PFKEY-SET.                                     00715000
007160     MOVE SPACE TO RPV330-MORE.                                   00716000
007170     MOVE 'E' TO COM-END.                                         00717000
007180     IF COM-KEY-OCCUR IS GREATER THAN +07                         00718000
007190         MOVE WS-MORE TO RPV330-MORE                              00719000
007200         MOVE '+' TO RPV330-PLUS                                  00720000
007210         MOVE 'F' TO COM-END                                      00721000
007220     ELSE                                                         00722000
007230         MOVE 'N' TO WS-PF8-FLG                                   00723000
007240         MOVE SPACE TO RPV330-PLUS.                               00724000
007250     IF COM-RPQUA00-CURPAGE IS GREATER THAN +1                    00725000
007260         MOVE WS-MORE TO RPV330-MORE                              00726000
007270         MOVE '-' TO RPV330-MINUS                                 00727000
007280         MOVE 'P' TO COM-END                                      00728000
007290     ELSE                                                         00729000
007300         MOVE 'N' TO WS-PF7-FLG                                   00730000
007310         MOVE SPACE TO RPV330-MINUS.                              00731000
007320     IF COM-KEY-OCCUR IS GREATER THAN +07                         00732000
007330         AND COM-RPQUA00-CURPAGE IS GREATER THAN +1               00733000
007340         MOVE 'B' TO COM-END.                                     00734000
007350     IF COM-WKUCOUNT IS GREATER THAN ZERO                         00735000
007360         AND COM-WKUPOSITION IS GREATER THAN +1                   00736000
007370         AND COM-END IS NOT EQUAL TO 'P'                          00737000
007380         MOVE 'A' TO WS-PF7-FLG.                                  00738000
007390     IF COM-WKUCOUNT IS GREATER THAN ZERO                         00739000
007400         AND COM-WKUPOSITION IS LESS THAN COM-WKUCOUNT            00740000
007410         AND COM-END IS NOT EQUAL TO 'F'                          00741000
007420         MOVE 'A' TO WS-PF8-FLG.                                  00742000
007430     PERFORM BUILD-PFKEY-LINE.                                    00743000
007440     MOVE WS-PFLINE1 TO RPV330-PFLINE1.                           00744000
007450     MOVE WS-PFLINE2 TO RPV330-PFLINE2.                           00745000
007460     PERFORM PANEL-PUT-RPV330.                                    00746000
007470     PERFORM PANEL-SEND.                                          00747000
007480     MOVE '1' TO COM-RETURN.                                      00748000
007490     MOVE 'E' TO COM-PANEL-ACTION.                                00749000
007500     MOVE 'I' TO COM-FROM-PANEL.                                  00750000
007510     MOVE COM-INTID TO WS-TRANSID.                                00751000
007520     GO TO CICS-RETURN-TRANSID.                                   00752000
007530 PIP-EXIT.                                                        00753000
007540     EXIT.                                                        00754000
007550******************************************************************00755000
007560 BUILD-MAINT-PANEL SECTION.                                       00756000
007570 BMP-START.                                                       00757000
007580     MOVE +0 TO WS-SUB1.                                          00758000
007590 BMP-LOOP.                                                        00759000
007600     ADD +0001 TO WS-SUB1.                                        00760000
007610     IF WS-SUB1 IS GREATER THAN +0007                             00761000
007620         GO TO BMP-EXIT.                                          00762000
007630     IF WS-SUB1 IS GREATER THAN RPQUA00-OCCUR                     00763000
007640         PERFORM PANEL-SPACE                                      00764000
007650         GO TO BMP-EXIT.                                          00765000
007660     MOVE RPQUA00-DEL (WS-SUB1) TO RPV330-DELETE.                 00766000
007670     IF RPV330-DELETE IS EQUAL TO SPACES                          00767000
007680         OR RPV330-DELETE IS EQUAL TO LOW-VALUES                  00768000
007690         MOVE LOW-VALUES TO RPV330-DELETE.                        00769000
007700     MOVE RPQUA00-PRODCODE (WS-SUB1) TO RPV330-PRODCD.            00770000
007710     MOVE RPQUA00-ACCOUNT (WS-SUB1) TO RPV330-ACCOUNT.            00771000
007720     MOVE RPQUA00-MODEL (WS-SUB1) TO RPV330-MODEL.                00772000
007730     MOVE RPQUA00-IDNUMBER (WS-SUB1) TO RPV330-IDNBR.             00773000
007740     MOVE RPQUA00-CUST-NAME (WS-SUB1) TO RPV330-CUSTNA.           00774000
007750     MOVE RPQUA00-DATE-OPENED (WS-SUB1) TO SR-CODASYL.            00775000
007760     PERFORM EDIT-CODASYL-DATE.                                   00776000
007770     MOVE SR-CODASYL-EDITED TO RPV330-OPENDT.                     00777000
007780     MOVE RPQUA00-ENROLLATTEMPTS (WS-SUB1) TO RPV330-ATTEMPT.     00778000
007790     MOVE 'N' TO RPV330-ADDON.                                    00779000
007800     IF RPQUA00-ADDON-ACCTS (WS-SUB1) IS GREATER THAN ZEROS       00780000
007810         MOVE 'Y' TO RPV330-ADDON.                                00781000
007820     MOVE PDB-RPV330-NAME TO PAN-NAME.                            00782000
007830     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00783000
007840     PERFORM PANEL-PUT-OCCUR-RPV330.                              00784000
007850     GO TO BMP-LOOP.                                              00785000
007860 BMP-EXIT.                                                        00786000
007870     EXIT.                                                        00787000
007880******************************************************************00788000
007890 PANEL-SPACE SECTION.                                             00789000
007900 PS-START.                                                        00790000
007910     MOVE SPACES TO RPV330-DELETE.                                00791000
007920     MOVE SPACES TO RPV330-PRODCD.                                00792000
007930     MOVE SPACES TO RPV330-ACCOUNT.                               00793000
007940     MOVE SPACES TO RPV330-MODEL.                                 00794000
007950     MOVE SPACES TO RPV330-IDNBR.                                 00795000
007960     MOVE SPACES TO RPV330-CUSTNA.                                00796000
007970     MOVE SPACES TO RPV330-OPENDT.                                00797000
007980     MOVE SPACES TO RPV330-ATTEMPT.                               00798000
007990     MOVE SPACE TO RPV330-ADDON.                                  00799000
008000     PERFORM PANEL-PUT-OCCUR-RPV330.                              00800000
008010     IF PAN-STAT IS EQUAL TO STAT-END                             00801000
008020         GO TO PS-EXIT.                                           00802000
008030     GO TO PS-START.                                              00803000
008040 PS-EXIT.                                                         00804000
008050     EXIT.                                                        00805000
008060******************************************************************00806000
008070 SET-DCHG-INDICATORS SECTION.                                     00807000
008080 SDI-START.                                                       00808000
008090     MOVE +0 TO WS-SUB1.                                          00809000
008100 SDI-LOOP.                                                        00810000
008110     ADD +0001 TO WS-SUB1.                                        00811000
008120     IF WS-SUB1 IS GREATER THAN +07                               00812000
008130         GO TO SDI-EXIT.                                          00813000
008140     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00814000
008150     PERFORM PANEL-GET-OCCUR-RPV330.                              00815000
008160     IF COM-DEL-DCHG (WS-SUB1) IS EQUAL TO SPACE                  00816000
008170         MOVE PDB-RPV330-DELETE-DCHG TO COM-DEL-DCHG (WS-SUB1).   00817000
008180     GO TO SDI-LOOP.                                              00818000
008190 SDI-EXIT.                                                        00819000
008200     EXIT.                                                        00820000
008210******************************************************************00821000
008220 SET-ATTRIBUTES-AND-MESSAGES SECTION.                             00822000
008230 SAAM-START.                                                      00823000
008240     MOVE ZERO TO WS-SUB1.                                        00824000
008250 SAAM-LOOP.                                                       00825000
008260     ADD +1 TO WS-SUB1.                                           00826000
008270     IF WS-SUB1 IS GREATER THAN COM-KEY-OCCUR                     00827000
008280         OR WS-SUB1 IS GREATER THAN +0007                         00828000
008290         GO TO SAAM-PROTECT.                                      00829000
008300     MOVE WS-SUB1 TO PAN-SET-OCC.                                 00830000
008310     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00831000
008320     MOVE COM-DEL-DCHG (WS-SUB1) TO WS-DCHG-TEST.                 00832000
008330     MOVE PDB-RPV330-DELETE-VID TO PAN-SET-VID.                   00833000
008340     MOVE PDB-RPV330-DELETE-EL TO PAN-SET-EMP.                    00834000
008350     MOVE PDB-RPV330-DELETE TO PAN-SET-FLD.                       00835000
008360     PERFORM SET-ATTRIBUTE.                                       00836000
008370     GO TO SAAM-LOOP.                                             00837000
008380 SAAM-PROTECT.                                                    00838000
008390     MOVE VIS-DISPLAY TO PAN-SET-VID.                             00839000
008400     MOVE EMP-HIDDEN TO PAN-SET-EMP.                              00840000
008410     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00841000
008420 SAAM-PROTECT-LOOP.                                               00842000
008430     IF WS-SUB1 IS GREATER THAN +0007                             00843000
008440         GO TO SAAM-EXIT.                                         00844000
008450     MOVE WS-SUB1 TO PAN-SET-OCC.                                 00845000
008460     MOVE PDB-RPV330-DELETE TO PAN-SET-FLD.                       00846000
008470     PERFORM CALL-BISPAN-RPV330.                                  00847000
008480     ADD +1 TO WS-SUB1.                                           00848000
008490     GO TO SAAM-PROTECT-LOOP.                                     00849000
008500 SAAM-EXIT.                                                       00850000
008510     EXIT.                                                        00851000
008520******************************************************************00852000
008530 SET-ATTRIBUTE SECTION.                                           00853000
008540 SA-START.                                                        00854000
008550     IF WS-DCHG-EDITERR                                           00855000
008560         ADD +1 TO WS-ERROR-COUNT                                 00856000
008570         MOVE 'Y' TO WS-ERROR                                     00857000
008580         MOVE VIS-ERROR TO PAN-SET-VID                            00858000
008590         MOVE EMP-ERROR TO PAN-SET-EMP.                           00859000
008600     IF WS-DCHG-EDITERR                                           00860000
008610         AND WS-CURSOR-FIELD IS EQUAL TO SPACES                   00861000
008620         MOVE PAN-SET-FLD TO WS-CURSOR-FIELD                      00862000
008630         MOVE PAN-SET-OCC TO WS-CURSOR-OCC.                       00863000
008640     IF WS-DCHG-PROTECT                                           00864000
008650         MOVE VIS-DISPLAY TO PAN-SET-VID                          00865000
008660         MOVE EMP-NORMAL TO PAN-SET-EMP.                          00866000
008670     IF WS-DCHG-HIDDEN                                            00867000
008680         MOVE VIS-DISPLAY TO PAN-SET-VID                          00868000
008690         MOVE EMP-HIDDEN TO PAN-SET-EMP.                          00869000
008700     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00870000
008710     PERFORM CALL-BISPAN-RPV330.                                  00871000
008720 SA-EXIT.                                                         00872000
008730     EXIT.                                                        00873000
008740******************************************************************00874000
008750 MOVE-PANEL-TO-RECORD SECTION.                                    00875000
008760 MPTR-START.                                                      00876000
008770     MOVE COM-KEY-OCCUR TO RPQUA00-OCCUR.                         00877000
008780     MOVE SPACES TO RPQUA00-DATA-GRP.                             00878000
008790     MOVE +0 TO WS-SUB1.                                          00879000
008800 MPTR-LOOP.                                                       00880000
008810     ADD +0001 TO WS-SUB1.                                        00881000
008820     IF WS-SUB1 IS GREATER THAN COM-KEY-OCCUR                     00882000
008830         OR WS-SUB1 IS GREATER THAN +0007                         00883000
008840         GO TO MPTR-EXIT.                                         00884000
008850     MOVE COM-KEY-DATA (WS-SUB1) TO RPQUA00-GRP-KEY (WS-SUB1).    00885000
008860     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00886000
008870     PERFORM PANEL-GET-OCCUR-RPV330.                              00887000
008880     IF RPV330-DELETE IS EQUAL TO LOW-VALUES                      00888000
008890         MOVE SPACES TO RPV330-DELETE.                            00889000
008900     MOVE RPV330-DELETE TO RPQUA00-DEL (WS-SUB1).                 00890000
008910     MOVE RPV330-MODEL TO RPQUA00-MODEL (WS-SUB1).                00891000
008920     MOVE RPV330-IDNBR TO RPQUA00-IDNUMBER (WS-SUB1).             00892000
008930     MOVE RPV330-CUSTNA TO RPQUA00-CUST-NAME (WS-SUB1).           00893000
008940     MOVE RPV330-OPENDT TO WS-OPEN-DATE.                          00894000
008950     MOVE WS-OD-MM TO SR-CODASYL-MM.                              00895000
008960     MOVE WS-OD-DD TO SR-CODASYL-DD.                              00896000
008970     MOVE WS-OD-YYYY TO SR-CODASYL-YYYY.                          00897000
008980     MOVE SR-CODASYL TO RPQUA00-DATE-OPENED (WS-SUB1).            00898000
008990     MOVE RPV330-ATTEMPT TO RPQUA00-ENROLLATTEMPTS (WS-SUB1).     00899000
009000     IF RPV330-ADDON IS EQUAL TO 'Y'                              00900000
009010         MOVE +1 TO RPQUA00-ADDON-ACCTS (WS-SUB1)                 00901000
009020     ELSE                                                         00902000
009030         MOVE ZEROS TO RPQUA00-ADDON-ACCTS (WS-SUB1).             00903000
009040     GO TO MPTR-LOOP.                                             00904000
009050 MPTR-EXIT.                                                       00905000
009060     EXIT.                                                        00906000
009070******************************************************************00907000
009080 MORE-DATA-PANELS SECTION.                                        00908000
009090 MDP-START.                                                       00909000
009100     GO TO PANEL-ROUTER.                                          00910000
009110 MDP-EXIT.                                                        00911000
009120     EXIT.                                                        00912000
009130******************************************************************00913000
009140 CLOSE-TRANSACTION SECTION.                                       00914000
000000 COPY SRP0722.                                                    00915000
009160******************************************************************00916000
009170 PANEL-INIT SECTION.                                              00917000
000000 COPY SRP073.                                                     00918000
009190******************************************************************00919000
009200 BUILD-NEXTKEY SECTION.                                           00920000
009210 BXN-START.                                                       00921000
009220     MOVE SPACES TO WS-NEXTKEY.                                   00922000
009230     MOVE ',' TO WS-DELIM1.                                       00923000
009240     MOVE ',' TO WS-DELIM2.                                       00924000
009250     MOVE ',' TO WS-DELIM3.                                       00925000
009260     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00926000
009270     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00927000
009280         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00928000
009290     ELSE                                                         00929000
009300         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00930000
009310     MOVE COM-KEY-MODEL TO WS-MODEL.                              00931000
009320     MOVE COM-EXTERNALID TO WS-EXTID.                             00932000
009330 BXN-EXIT.                                                        00933000
009340     EXIT.                                                        00934000
009350******************************************************************00935000
009360 ABORT-EXIT SECTION.                                              00936000
009370 AE-START.                                                        00937000
009380     MOVE EIBFN TO COM-ABEIBFN.                                   00938000
009390     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00939000
009400     GO TO CICS-ABORT-EXIT.                                       00940000
009410 AE-EXIT.                                                         00941000
009420     EXIT.                                                        00942000
009430******************************************************************00943000
009440 RPQUA00-LINK-MESSAGE SECTION.                                    00944000
009450 CRLM-START.                                                      00945000
009460     MOVE 'Y' TO RPQUA00-GLOBAL-CLOSE.                            00946000
009470     MOVE WS-FILEOPTIONS TO RPQUA00-FILEOPTS.                     00947000
009480     MOVE COM-RETURN TO RPQUA00-RETURN.                           00948000
009490     MOVE COM-DATE TO RPQUA00-DATE.                               00949000
009500     MOVE COM-MODELID TO RPQUA00-MODELID.                         00950000
009510     MOVE COM-SECALT TO RPQUA00-SECALT.                           00951000
009520     MOVE COM-EXTERNALID TO RPQUA00-EXTERNALID.                   00952000
009530     MOVE COM-EIBTRMID TO RPQUA00-TERMID.                         00953000
009540     MOVE COM-WKUNAME TO RPQUA00-WORKID.                          00954000
009550     MOVE COM-TRANSTART TO RPQUA00-TRANSTART.                     00955000
009560     MOVE COM-UPDATE TO RPQUA00-UPDATE.                           00956000
009570     MOVE COM-APPLSEQ TO RPQUA00-APPLSEQ.                         00957000
009580     MOVE WS-RPSAPPLNBR TO RPQUA00-APPL.                          00958000
009590     IF COM-KEY-IDNBR IS NUMERIC                                  00959000
009600         AND COM-KEY-IDNBR IS GREATER THAN ZEROS                  00960000
009610         MOVE COM-KEY-IDNBR TO RPQUA00-KEY-IDNUMBER.              00961000
009620     MOVE COM-OPERID TO RPQUA00-OPERID.                           00962000
009630     MOVE COM-LANG TO RPQUA00-COM-LANG.                           00963000
009640     MOVE COM-CURN-CODE TO RPQUA00-COM-CURNCD.                    00964000
009650     MOVE COM-INST-OPTS TO RPQUA00-INST-OPTS.                     00965000
009660     EXEC CICS LINK                                               00966000
009670         PROGRAM('RPLQUA00')                                      00967000
009680         COMMAREA(RPQUA00-MESSAGE)                                00968000
009690         LENGTH(LENGTH OF RPQUA00-MESSAGE)                        00969000
009700         RESP(WS-CICS-RESPONSE)                                   00970000
009710         END-EXEC.                                                00971000
009720     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00972000
009730         MOVE 'RPLQUA00 LINK FAILED' TO COM-ABMSG                 00973000
009740         MOVE WS-TR0003 TO COM-ABTRACE                            00974000
009750         MOVE WS-AB0009 TO COM-ABORT                              00975000
009760         GO TO CICS-ABORT-EXIT.                                   00976000
009770     MOVE RPQUA00-FUNCTION TO WS-FUNCTION.                        00977000
009780     IF RPQUA00-ABORT IS NOT EQUAL TO ZERO                        00978000
009790         MOVE RPQUA00-ABORT TO COM-ABORT                          00979000
009800         MOVE RPQUA00-ABTRACE TO COM-ABTRACE                      00980000
009810         MOVE RPQUA00-ABEIBFN TO COM-ABEIBFN                      00981000
009820         MOVE RPQUA00-ABEIBRCODE TO COM-ABEIBRCODE                00982000
009830         MOVE RPQUA00-ABPROGID TO COM-ABPROGID                    00983000
009840         MOVE RPQUA00-SRBMDB TO COM-SRBMDB                        00984000
009850         MOVE RPQUA00-ABTYPE TO COM-ABTYPE                        00985000
009860         GO TO CICS-ABORT-EXIT.                                   00986000
009870     MOVE RPQUA00-ABORT TO COM-ABORT.                             00987000
009880     MOVE RPQUA00-MSGNBR TO WS-MSGNBR.                            00988000
009890     IF RPQUA00-OCCUR IS EQUAL TO +08                             00989000
009900         AND RPQUA00-SUB IS LESS THAN RPQUA00-PAGES-TO-READ       00990000
009910         MOVE RPQUA00-GRP-KEY (08) TO RPQUA00-KEY-RECORD.         00991000
009920 CRLM-EXIT.                                                       00992000
009930     EXIT.                                                        00993000
009940******************************************************************00994000
009950 CLOSE-PANEL SECTION.                                             00995000
009960 CP-START.                                                        00996000
009970     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00997000
009980     IF COM-RETURN IS EQUAL TO 'E'                                00998000
009990         PERFORM CALL-BISPAN-RPV330K.                             00999000
010000     IF COM-RETURN IS EQUAL TO '1'                                01000000
010010         PERFORM CALL-BISPAN-RPV330.                              01001000
010020 CP-EXIT.                                                         01002000
010030     EXIT.                                                        01003000
010040******************************************************************01004000
010050 CALL-BISPAN-RPV330K SECTION.                                     01005000
010060 CBD1-START.                                                      01006000
010070     CALL 'BISPAN' USING                                          01007000
010080         BICRPSB,                                                 01008000
010090         BICRSRB,                                                 01009000
010100         BICRPAN,                                                 01010000
010110         RPV330K-PANL-DATA-BLOCK,                                 01011000
010120         RPV330K-PANL-DATA-AREA.                                  01012000
010130 CBD1-EXIT.                                                       01013000
010140     EXIT.                                                        01014000
010150******************************************************************01015000
010160 CALL-BISPAN-RPV330 SECTION.                                      01016000
010170 CBD2-START.                                                      01017000
010180     CALL 'BISPAN' USING                                          01018000
010190         BICRPSB,                                                 01019000
010200         BICRSRB,                                                 01020000
010210         BICRPAN,                                                 01021000
010220         RPV330-PANL-DATA-BLOCK,                                  01022000
010230         RPV330-PANL-DATA-AREA.                                   01023000
010240 CBD2-EXIT.                                                       01024000
010250     EXIT.                                                        01025000
010260******************************************************************01026000
010270 PANEL-GET-RPV330 SECTION.                                        01027000
010280 PANEL-GET-RPV330-START.                                          01028000
010290     MOVE 'N' TO RPV330-SW-SET-CURSOR.                            01029000
010300     MOVE PDB-RPV330-NAME TO PAN-NAME.                            01030000
010310     MOVE REQ-GET TO PAN-REQ-VERB.                                01031000
010320     CALL 'BISPAN' USING                                          01032000
010330         BICRPSB                                                  01033000
010340         BICRSRB                                                  01034000
010350         BICRPAN                                                  01035000
010360         RPV330-PANL-DATA-BLOCK,                                  01036000
010370         RPV330-PANL-DATA-AREA.                                   01037000
010380 PANEL-GET-RPV330-EXIT.                                           01038000
010390     EXIT.                                                        01039000
010400******************************************************************01040000
010410 PANEL-PUT-RPV330 SECTION.                                        01041000
010420 PANEL-PUT-RPV330-START.                                          01042000
010430     MOVE PDB-RPV330-NAME TO PAN-NAME.                            01043000
010440     MOVE REQ-PUT TO PAN-REQ-VERB.                                01044000
010450     CALL 'BISPAN' USING                                          01045000
010460         BICRPSB                                                  01046000
010470         BICRSRB                                                  01047000
010480         BICRPAN                                                  01048000
010490         RPV330-PANL-DATA-BLOCK,                                  01049000
010500         RPV330-PANL-DATA-AREA.                                   01050000
010510 PANEL-PUT-RPV330-EXIT.                                           01051000
010520     EXIT.                                                        01052000
010530******************************************************************01053000
010540 PANEL-GET-RPV330K SECTION.                                       01054000
010550 PANEL-GET-RPV330K-START.                                         01055000
010560     MOVE 'N' TO RPV330K-SW-SET-CURSOR.                           01056000
010570     MOVE PDB-RPV330K-NAME TO PAN-NAME.                           01057000
010580     MOVE REQ-GET TO PAN-REQ-VERB.                                01058000
010590     CALL 'BISPAN' USING                                          01059000
010600         BICRPSB                                                  01060000
010610         BICRSRB                                                  01061000
010620         BICRPAN                                                  01062000
010630         RPV330K-PANL-DATA-BLOCK,                                 01063000
010640         RPV330K-PANL-DATA-AREA.                                  01064000
010650 PANEL-GET-RPV330K-EXIT.                                          01065000
010660     EXIT.                                                        01066000
010670******************************************************************01067000
010680 PANEL-PUT-RPV330K SECTION.                                       01068000
010690 PANEL-PUT-RPV330K-START.                                         01069000
010700     MOVE PDB-RPV330K-NAME TO PAN-NAME.                           01070000
010710     MOVE REQ-PUT TO PAN-REQ-VERB.                                01071000
010720     CALL 'BISPAN' USING                                          01072000
010730         BICRPSB                                                  01073000
010740         BICRSRB                                                  01074000
010750         BICRPAN                                                  01075000
010760         RPV330K-PANL-DATA-BLOCK,                                 01076000
010770         RPV330K-PANL-DATA-AREA.                                  01077000
010780 PANEL-PUT-RPV330K-EXIT.                                          01078000
010790     EXIT.                                                        01079000
010800******************************************************************01080000
010810 PANEL-GET-OCCUR-RPV330 SECTION.                                  01081000
010820 PGORPV330-START.                                                 01082000
010830     MOVE PDB-RPV330-NAME TO PAN-NAME.                            01083000
010840     MOVE REQ-GET-OCCUR TO PAN-REQ-VERB.                          01084000
010850     CALL 'BISPAN' USING                                          01085000
010860         BICRPSB                                                  01086000
010870         BICRSRB                                                  01087000
010880         BICRPAN                                                  01088000
010890         RPV330-PANL-DATA-BLOCK,                                  01089000
010900         RPV330-PANL-DATA-AREA.                                   01090000
010910 PGORPV330-EXIT.                                                  01091000
010920     EXIT.                                                        01092000
010930******************************************************************01093000
010940 PANEL-PUT-OCCUR-RPV330 SECTION.                                  01094000
010950 PPORPV330-START.                                                 01095000
010960     MOVE PDB-RPV330-NAME TO PAN-NAME.                            01096000
010970     MOVE REQ-PUT-OCCUR TO PAN-REQ-VERB.                          01097000
010980     CALL 'BISPAN' USING                                          01098000
010990         BICRPSB                                                  01099000
011000         BICRSRB                                                  01100000
011010         BICRPAN                                                  01101000
011020         RPV330-PANL-DATA-BLOCK,                                  01102000
011030         RPV330-PANL-DATA-AREA.                                   01103000
011040 PPORPV330-EXIT.                                                  01104000
011050     EXIT.                                                        01105000
011060******************************************************************01106000
011070 MIC-MST-API SECTION.                                             01107000
000000 COPY MIPMSTA.                                                    01108000
011090******************************************************************01109000
011100 EDIT-ACCOUNT-KEY SECTION.                                        01110000
011110 EAK-START.                                                       01111000
011120     MOVE COM-INST TO RPW130-INST.                                01112000
011130     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 01113000
011140     MOVE COM-KEY-PRODCODE TO RPW130-PRODCODE.                    01114000
011150     MOVE COM-KEY-ACCOUNT TO RPW130-ACCOUNTINPUT.                 01115000
011160     MOVE 'V' TO RPW130-FUNCTION.                                 01116000
011170     PERFORM ACCOUNT-KEY-EDIT.                                    01117000
011180     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       01118000
011190     MOVE RPW130-ACCOUNTKEY TO COM-KEY-ACCOUNT.                   01119000
011200     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          01120000
011210     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      01121000
011220     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                01122000
011230 EAK-EXIT.                                                        01123000
011240     EXIT.                                                        01124000
011250******************************************************************01125000
011260 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 01126000
000000 COPY RPP033.                                                     01127000
011280******************************************************************01128000
011290 ACCOUNT-KEY-EDIT SECTION.                                        01129000
000000 COPY RPP130.                                                     01130000
011310******************************************************************01131000
011320 LEFT-JUSTIFY SECTION.                                            01132000
000000 COPY SRP025.                                                     01133000
011340******************************************************************01134000
011350 RIGHT-JUSTIFY SECTION.                                           01135000
000000 COPY SRP026.                                                     01136000
011370******************************************************************01137000
011380 PARAMETER-SEARCH SECTION.                                        01138000
000000 COPY SRP030.                                                     01139000
011400******************************************************************01140000
011410 COMPRESS-NEXTKEY SECTION.                                        01141000
000000 COPY SRP070.                                                     01142000
011430******************************************************************01143000
011440 GET-MESSAGE SECTION.                                             01144000
000000 COPY SRP071.                                                     01145000
011460******************************************************************01146000
011470 EDIT-CODASYL-DATE SECTION.                                       01147000
000000 COPY SRP087.                                                     01148000
011490******************************************************************01149000
011500 EXAMINE-FIELD SECTION.                                           01150000
000000 COPY SRP166.                                                     01151000
011520******************************************************************01152000
011530 SRP170-ROUTINE SECTION.                                          01153000
000000 COPY SRP170.                                                     01154000
011550******************************************************************01155000
011560 BUILD-PFKEY-LINE SECTION.                                        01156000
000000 COPY SRP710.                                                     01157000
011580******************************************************************01158000
011590 VALIDATE-PFKEYS SECTION.                                         01159000
000000 COPY SRP711.                                                     01160000
011610******************************************************************01161000
011620 SLP096-GET-2023-RECORD SECTION.                                  01162000
000000 COPY SLP096.                                                     01163000
011640******************************************************************01164000
011650 CICS-XCTL SECTION.                                               01165000
000000 COPY SLP704.                                                     01166000
011670******************************************************************01167000
011680 CICS-RETURN-TRANSID SECTION.                                     01168000
000000 COPY SLP710.                                                     01169000
011700******************************************************************01170000
011710 TSQ-DELETE SECTION.                                              01171000
011720 TSQD-START.                                                      01172000
011730 TSQD-EXIT.                                                       01173000
011740     EXIT.                                                        01174000
011750******************************************************************01175000
011760 CICS-TSQ-READ SECTION.                                           01176000
000000 COPY SLP744.                                                     01177000
011780******************************************************************01178000
011790 CICS-ABORT-EXIT SECTION.                                         01179000
000000 COPY SLP798.                                                     01180000
011810******************************************************************01181000
