000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL315.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL315 - VALIDATION FAILURE DATE UPDATE                     *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRCONS.                                                    00024000
000000 COPY BICRCONS.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRPAN.                                                     00028000
000000 COPY BICRPAN.                                                    00029000
000300 01  SRW000-AREAS.                                                00030000
000000 COPY SRW000.                                                     00031000
000320 01  SRW025-AREAS.                                                00032000
000000 COPY SRW025.                                                     00033000
000340 01  SRW030-AREAS.                                                00034000
000000 COPY SRW030.                                                     00035000
000360 01  SRW031-AREAS.                                                00036000
000000 COPY SRW031.                                                     00037000
000380 01  SRW105-AREAS.                                                00038000
000000 COPY SRW105.                                                     00039000
000400 01  SRW161-AREAS.                                                00040000
000000 COPY SRW161.                                                     00041000
000420 01  SRW166-AREAS.                                                00042000
000000 COPY SRW166.                                                     00043000
000440 01  SRW170-AREAS.                                                00044000
000000 COPY SRW170.                                                     00045000
000460 01  SRW710-AREAS.                                                00046000
000000 COPY SRW710.                                                     00047000
000480 01  RPV315K-PANL-DATA-BLOCK.                                     00048000
000000 COPY RPV315KW.                                                   00049000
000500 01  RPV315-PANL-DATA-BLOCK.                                      00050000
000000 COPY RPV315W.                                                    00051000
000520 01  WS-WORKAREAS.                                                00052000
000530     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00053000
000540     03  WS-NEXTKEY.                                              00054000
000550         05  WS-EXTID            PIC X(08).                       00055000
000560         05  WS-DELIM1           PIC X(01)       VALUE ','.       00056000
000570         05  WS-DATA.                                             00057000
000580             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00058000
000590             07  WS-DELIM2       PIC X(01)       VALUE ','.       00059000
000600             07  WS-ACCTX.                                        00060000
000610                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00061000
000620             07  WS-DELIM3       PIC X(01)       VALUE ','.       00062000
000630             07  WS-MODEL        PIC X(10)       VALUE SPACES.    00063000
000640         05  FILLER              PIC X(33)       VALUE SPACES.    00064000
000650     03  WS-SUB1                 PIC S9(04)      COMP             00065000
000660                                                 VALUE +0000.     00066000
000670     03  WS-PDATE                PIC 9(08).                       00067000
000680     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00068000
000690         05  WS-PDATE-YYYY       PIC 9(04).                       00069000
000700         05  WS-PDATE-MM         PIC 9(02).                       00070000
000710         05  WS-PDATE-DD         PIC 9(02).                       00071000
000720     03  WS-DCHG-TEST            PIC X(01)       VALUE SPACES.    00072000
000730     03  WS-DCHG-PROTECT         PIC X(01)       VALUE 'P'.       00073000
000740     03  WS-DCHG-EDITERR         PIC X(01)       VALUE 'E'.       00074000
000750     03  WS-DCHG-HIDDEN          PIC X(01)       VALUE 'N'.       00075000
000760     03  WS-DCHG-BYPASSED        PIC X(01)       VALUE 'B'.       00076000
000770     03  WS-ERROR-COUNT          PIC S9(04)      COMP             00077000
000780                                                 VALUE +0000.     00078000
000790     03  WS-INITIAL-PANEL        PIC X(01)       VALUE ' '.       00079000
000800     03  WS-EDIT-PANEL           PIC X(01)       VALUE 'E'.       00080000
000810     03  WS-FROM-KEY-PANEL       PIC X(01)       VALUE 'K'.       00081000
000820     03  WS-FROM-MAINT-PANEL     PIC X(01)       VALUE 'M'.       00082000
000830     03  WS-FROM-HELP            PIC X(01)       VALUE 'H'.       00083000
000840     03  WS-FROM-BREAKAWAY       PIC X(01)       VALUE 'B'.       00084000
000850 01  WS-LINKMSG                  PIC X(4500).                     00085000
000860 01  RPXXX08-MESSAGE.                                             00086000
000000 COPY MISCNT00      REPLACING                                     00087000
000880             ==:MICNT:== BY ==RPXXX08==.                          00088000
000000 COPY RPSXXX08.                                                   00089000
000900 01  WS-TSQAREAS.                                                 00090000
000910     03  WS-TSQITEM              PIC S9(04)      COMP             00091000
000920                                                 VALUE +0001.     00092000
000930     03  WS-TSQLGTH              PIC S9(04)      COMP             00093000
000940                                                 VALUE +4096.     00094000
000950     03  WS-TSQKEY.                                               00095000
000960         05  WS-TSQID            PIC X(04).                       00096000
000970         05  WS-TSQTRMID         PIC X(04).                       00097000
000980 01  LS-TSQAREA.                                                  00098000
000990     03  LS-TSQKEY               PIC X(08).                       00099000
001000     03  LS-TSQDATA              PIC X(4088).                     00100000
001010 01  MIWPRI-AREAS.                                                00101000
000000 COPY MIWPRI.                                                     00102000
001030 01  MIWMSTA-AREAS.                                               00103000
000000 COPY MIWMSTA.                                                    00104000
001050 01  MIMST-RECORD.                                                00105000
000000 COPY MISMST.                                                     00106000
001070 01  MI2023-RECORD.                                               00107000
000000 COPY MIS2023A.                                                   00108000
001090 01  WS-ABORTCODES.                                               00109000
001100     03  WS-AB0009               PIC S9(04)      COMP             00110000
001110                                                 VALUE +0009.     00111000
001120     03  WS-AB0106               PIC S9(04)      COMP             00112000
001130                                                 VALUE +0106.     00113000
001140     03  WS-AB2033               PIC S9(04)      COMP             00114000
001150                                                 VALUE +2033.     00115000
001160 01  WS-TRACECODES.                                               00116000
001170     03  WS-TR0001               PIC S9(04)      COMP             00117000
001180                                                 VALUE +0001.     00118000
001190     03  WS-TR0002               PIC S9(04)      COMP             00119000
001200                                                 VALUE +0002.     00120000
001210 01  RPW014-AREAS.                                                00121000
000000 COPY RPW014.                                                     00122000
001230 01  RPW033-AREAS.                                                00123000
000000 COPY RPW033.                                                     00124000
001250 01  SLW096-AREAS.                                                00125000
000000 COPY SLW096.                                                     00126000
001270 01  RPW130-AREAS.                                                00127000
000000 COPY RPW130.                                                     00128000
001290 COPY DFHAID.                                                     00129000
001300******************************************************************00130000
001310 LINKAGE SECTION.                                                 00131000
001320 01  DFHCOMMAREA.                                                 00132000
000000 COPY SLS1112.                                                    00133000
001340     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00134000
001350         05  COM-EDIT-DATE       PIC X(10).                       00135000
001360         05  COM-PANEL-ACTION    PIC X(01).                       00136000
001370         05  COM-FROM-PANEL      PIC X(01).                       00137000
001380         05  COM-KEY-FIELDS.                                      00138000
001390             07  COM-KEY-PRODCODE                                 00139000
001400                                 PIC X(06).                       00140000
001410             07  COM-KEY-ACCOUNT PIC X(18).                       00141000
001420             07  COM-KEY-ACCOUNT-N                                00142000
001430                         REDEFINES COM-KEY-ACCOUNT                00143000
001440                                 PIC 9(18).                       00144000
001450             07  COM-KEY-MODEL                                    00145000
001460                                 PIC X(10).                       00146000
001470             07  COM-KEY-IDNBRX  PIC X(18).                       00147000
001480             07  COM-KEY-IDNBR                                    00148000
001490                         REDEFINES COM-KEY-IDNBRX                 00149000
001500                                 PIC 9(18).                       00150000
001510         05  COM-KEY-FORMATTEDACCT                                00151000
001520                                 PIC X(22).                       00152000
001530         05  COM-KEY-MSGNBR      PIC X(06).                       00153000
001540         05  COM-KEY-COMMAND     PIC X(50).                       00154000
001550         05  COM-CUST-TYPE       PIC X(01).                       00155000
001560         05  COM-CUST-NAME       PIC X(40).                       00156000
001570         05  COM-IDNUMBER        PIC 9(18).                       00157000
001580         05  COM-MODEL           PIC X(10).                       00158000
001590         05  COM-DCHG.                                            00159000
001600             07  COM-EXTN-DCHG   PIC X(01).                       00160000
001610******************************************************************00161000
001620*01  SLW096-2023RECORDS.                                          00162000
000000 COPY SLW096L.                                                    00163000
001640******************************************************************00164000
001650 PROCEDURE DIVISION.                                              00165000
001660******************************************************************00166000
001670 ENTRY-ROUTINE SECTION.                                           00167000
001680     MOVE 'RPL315' TO COM-ABPROGID.                               00168000
000000 COPY SLP771.                                                     00169000
001700******************************************************************00170000
001710 TRANSACTION-CLEAN-UP SECTION.                                    00171000
001720 TCU-START.                                                       00172000
001730 TCU-EXIT.                                                        00173000
001740     EXIT.                                                        00174000
001750******************************************************************00175000
001760 CICS-HANDLE-CONDITION SECTION.                                   00176000
000000 COPY SLP772.                                                     00177000
001780     MOVE WS-AB2033 TO COM-ABORT.                                 00178000
001790     MOVE WS-TR0001 TO COM-ABTRACE.                               00179000
001800     GO TO ABORT-EXIT.                                            00180000
001810 CHC-EXIT.                                                        00181000
001820     EXIT.                                                        00182000
001830******************************************************************00183000
001840 ROUTING-ROUTINE SECTION.                                         00184000
001850 RR-START.                                                        00185000
001860     MOVE LOW-VALUES TO RPXXX08-MESSAGE.                          00186000
001870     MOVE LOW-VALUES TO RPV315K-PANL-DATA-AREA.                   00187000
001880     MOVE LOW-VALUES TO RPV315-PANL-DATA-AREA.                    00188000
001890     MOVE ZERO TO WS-MSGNBR.                                      00189000
001900     MOVE 'RP00' TO WS-TSQFILEID.                                 00190000
001910     MOVE 'RPI' TO WS-TSQSYSID.                                   00191000
001920     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00192000
001930     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00193000
001940     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00194000
001950         MOVE COM-PAN TO BICRPAN                                  00195000
001960         MOVE COM-PSB TO BICRPSB                                  00196000
001970         MOVE COM-SRB TO BICRSRB                                  00197000
001980     ELSE                                                         00198000
001990         MOVE '1' TO BPSB-LEVEL.                                  00199000
002000     IF COM-RETURN IS EQUAL TO 'B'                                00200000
002010         GO TO BREAKAWAY-RETURN.                                  00201000
002020     IF COM-RETURN IS EQUAL TO '0'                                00202000
002030         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00203000
002040         MOVE SPACES TO COM-WORKAREAS                             00204000
002050         MOVE '1' TO SRB-VERSION                                  00205000
002060         MOVE 'IPRP' TO SRB-APPL-ID                               00206000
002070         MOVE 'RPL315' TO SRB-PROG-ID                             00207000
002080         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00208000
002090         MOVE 'P' TO PAN-TYPE                                     00209000
002100         MOVE SPACE TO PAN-OVERLAY                                00210000
002110         MOVE SPACE TO PAN-CLOSE                                  00211000
002120         MOVE SPACE TO PAN-ALARM                                  00212000
002130         MOVE SPACE TO PAN-CURSOR-PAN                             00213000
002140         MOVE SPACE TO PAN-CURSOR-FLD                             00214000
002150         MOVE SPACE TO PAN-SET-FLD                                00215000
002160         MOVE SPACE TO PAN-SET-VID                                00216000
002170         MOVE SPACE TO PAN-SET-EMP                                00217000
002180         MOVE PDB-RPV315K-NAME TO PAN-NAME                        00218000
002190         PERFORM PANEL-INIT                                       00219000
002200         MOVE BICRPAN TO COM-PAN                                  00220000
002210         MOVE BICRPSB TO COM-PSB                                  00221000
002220         MOVE BICRSRB TO COM-SRB                                  00222000
002230         PERFORM INITIALIZE-DATES                                 00223000
002240         GO TO PANEL-ROUTER.                                      00224000
002250     PERFORM PANEL-NAME-SET.                                      00225000
002260     IF COM-HELPSW IS EQUAL TO 'Y'                                00226000
002270         GO TO HELP-RETURN.                                       00227000
002280     PERFORM PANEL-RECEIVE.                                       00228000
002290     PERFORM PANEL-DATA-GET.                                      00229000
002300     IF COM-FROM-PANEL IS EQUAL TO WS-FROM-MAINT-PANEL            00230000
002310         PERFORM SET-DCHG-INDICATORS.                             00231000
002320     PERFORM PANEL-PFKEY-SET.                                     00232000
002330     PERFORM VALIDATE-PFKEYS.                                     00233000
002340     IF EIBAID IS EQUAL TO DFHPF1                                 00234000
002350         GO TO GET-HELP.                                          00235000
002360     IF EIBAID IS EQUAL TO DFHPF11                                00236000
002370         GO TO BREAK-AWAY.                                        00237000
002380     IF (COM-RETURN IS EQUAL TO 'E')                              00238000
002390         AND (EIBAID IS EQUAL TO DFHPF2                           00239000
002400         OR EIBAID IS EQUAL TO DFHPF3                             00240000
002410         OR EIBAID IS EQUAL TO DFHPF4                             00241000
002420         OR EIBAID IS EQUAL TO DFHPF7                             00242000
002430         OR EIBAID IS EQUAL TO DFHPF8                             00243000
002440         OR EIBAID IS EQUAL TO DFHPF12)                           00244000
002450         GO TO CLOSE-TRANSACTION.                                 00245000
002460     IF COM-RETURN IS EQUAL TO '1'                                00246000
002470         AND EIBAID IS EQUAL TO DFHPF12                           00247000
002480         GO TO CLOSE-TRANSACTION.                                 00248000
002490     IF COM-RETURN IS EQUAL TO '0'                                00249000
002500         OR COM-RETURN IS EQUAL TO 'E'                            00250000
002510         OR COM-RETURN IS EQUAL TO '1'                            00251000
002520         GO TO PANEL-ROUTER.                                      00252000
002530 RR-END.                                                          00253000
002540     GO TO CLOSE-TRANSACTION.                                     00254000
002550 RR-EXIT.                                                         00255000
002560     EXIT.                                                        00256000
002570******************************************************************00257000
002580 INITIALIZE-DATES SECTION.                                        00258000
002590 ID-START.                                                        00259000
002600     MOVE COM-DATE TO WS-CURDATE8.                                00260000
002610     MOVE '-' TO WS-CD8DSH1.                                      00261000
002620     MOVE '-' TO WS-CD8DSH2.                                      00262000
002630     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00263000
002640 ID-EXIT.                                                         00264000
002650     EXIT.                                                        00265000
002660******************************************************************00266000
002670 PANEL-NAME-SET SECTION.                                          00267000
002680 PNS-START.                                                       00268000
002690     IF COM-RETURN IS EQUAL TO '0'                                00269000
002700         MOVE PDB-RPV315K-NAME TO PAN-NAME.                       00270000
002710     IF COM-RETURN IS EQUAL TO 'E'                                00271000
002720         MOVE PDB-RPV315-NAME TO PAN-NAME.                        00272000
002730     IF COM-RETURN IS EQUAL TO '1'                                00273000
002740         MOVE PDB-RPV315-NAME TO PAN-NAME.                        00274000
002750 PNS-EXIT.                                                        00275000
002760     EXIT.                                                        00276000
002770******************************************************************00277000
002780 PANEL-DATA-GET SECTION.                                          00278000
002790 PDG-START.                                                       00279000
002800     IF COM-RETURN IS EQUAL TO '0'                                00280000
002810         PERFORM PANEL-GET-RPV315K.                               00281000
002820     IF COM-RETURN IS EQUAL TO 'E'                                00282000
002830         PERFORM PANEL-GET-RPV315K                                00283000
002840         MOVE RPV315K-COMMAND TO WS-NEXTKEY                       00284000
002850         MOVE PDB-RPV315K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00285000
002860     IF COM-RETURN IS EQUAL TO '1'                                00286000
002870         PERFORM PANEL-GET-RPV315                                 00287000
002880         MOVE RPV315-COMMAND TO WS-NEXTKEY                        00288000
002890         MOVE PDB-RPV315-COMMAND-DCHG TO WS-COMMAND-DCHG.         00289000
002900 PDG-EXIT.                                                        00290000
002910     EXIT.                                                        00291000
002920******************************************************************00292000
002930 PANEL-PFKEY-SET SECTION.                                         00293000
002940 PPS-START.                                                       00294000
002950 PPS-EXIT.                                                        00295000
002960     EXIT.                                                        00296000
002970******************************************************************00297000
002980 PANEL-ROUTER SECTION.                                            00298000
002990 PR-START.                                                        00299000
003000     IF COM-RETURN IS EQUAL TO '0'                                00300000
003010         GO TO PROCESS-KEY-PANEL.                                 00301000
003020     IF COM-RETURN IS EQUAL TO 'E'                                00302000
003030         GO TO PROCESS-KEY-PANEL.                                 00303000
003040     IF COM-RETURN IS EQUAL TO '1'                                00304000
003050         GO TO PROCESS-MAINT-PANEL.                               00305000
003060     GO TO CLOSE-TRANSACTION.                                     00306000
003070 PR-EXIT.                                                         00307000
003080     EXIT.                                                        00308000
003090******************************************************************00309000
003100 HELP-RETURN SECTION.                                             00310000
000000 COPY SRP074.                                                     00311000
003120******************************************************************00312000
003130 HELP-RETURN-FINISH SECTION.                                      00313000
003140 HRF-START.                                                       00314000
003150     PERFORM PANEL-DATA-GET.                                      00315000
003160     MOVE WS-FROM-HELP TO COM-FROM-PANEL.                         00316000
003170     GO TO PANEL-ROUTER.                                          00317000
003180 HRF-EXIT.                                                        00318000
003190     EXIT.                                                        00319000
003200******************************************************************00320000
003210 HELP-MISSING-FINISH SECTION.                                     00321000
003220 HMF-START.                                                       00322000
003230     MOVE WS-FROM-HELP TO COM-FROM-PANEL.                         00323000
003240     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00324000
003250     GO TO PANEL-ROUTER.                                          00325000
003260 HMF-EXIT.                                                        00326000
003270     EXIT.                                                        00327000
003280******************************************************************00328000
003290 BREAK-AWAY SECTION.                                              00329000
000000 COPY SRP0752.                                                    00330000
003310******************************************************************00331000
003320 BREAKAWAY-RETURN-FINISH SECTION.                                 00332000
003330 BRF-START.                                                       00333000
003340     PERFORM PANEL-DATA-GET.                                      00334000
003350     MOVE WS-FROM-BREAKAWAY TO COM-FROM-PANEL.                    00335000
003360     GO TO PANEL-ROUTER.                                          00336000
003370 BRF-EXIT.                                                        00337000
003380     EXIT.                                                        00338000
003390******************************************************************00339000
003400 PROCESS-KEY-PANEL SECTION.                                       00340000
003410 PKP-START.                                                       00341000
003420     IF COM-PANEL-ACTION IS EQUAL TO WS-INITIAL-PANEL             00342000
003430         MOVE COM-NEXTKEY TO COM-EXTERNALID                       00343000
003440         GO TO PKP-COM-INIT.                                      00344000
003450     IF COM-PANEL-ACTION IS EQUAL TO WS-EDIT-PANEL                00345000
003460         AND COM-FROM-PANEL IS EQUAL TO WS-FROM-MAINT-PANEL       00346000
003470         MOVE SPACE TO COM-FROM-PANEL                             00347000
003480         GO TO PKP-RELOAD-PANEL.                                  00348000
003490 PKP-COM-INIT.                                                    00349000
003500     MOVE COM-NEXTKEY TO SR-PSLIST.                               00350000
003510     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00351000
003520         GO TO PKP-SEND-PANEL.                                    00352000
003530 PKP-BEGIN-EDITS.                                                 00353000
003540     IF COM-PANEL-ACTION IS EQUAL TO WS-EDIT-PANEL                00354000
003550         MOVE RPV315K-PRODCD TO COM-KEY-PRODCODE                  00355000
003560         MOVE RPV315K-ACCOUNT TO COM-KEY-ACCOUNT                  00356000
003570         MOVE RPV315K-MODEL TO COM-KEY-MODEL                      00357000
003580         MOVE RPV315K-IDNBR TO COM-KEY-IDNBRX                     00358000
003590         GO TO PKP-RETURN-EDITS.                                  00359000
003600     PERFORM PARAMETER-SEARCH.                                    00360000
003610     MOVE SR-PSPARM TO COM-EXTID.                                 00361000
003620     MOVE SR-PSPARM TO COM-EXTERNALID.                            00362000
003630     PERFORM PARAMETER-SEARCH.                                    00363000
003640     MOVE SR-PSPARM TO COM-KEY-PRODCODE.                          00364000
003650     PERFORM PARAMETER-SEARCH.                                    00365000
003660     MOVE SR-PSPARM TO COM-KEY-ACCOUNT.                           00366000
003670     PERFORM PARAMETER-SEARCH.                                    00367000
003680     MOVE SR-PSPARM TO COM-KEY-MODEL.                             00368000
003690     PERFORM PARAMETER-SEARCH.                                    00369000
003700     MOVE SR-PSPARM TO COM-KEY-IDNBRX.                            00370000
003710 PKP-RETURN-EDITS.                                                00371000
003720     IF COM-KEY-PRODCODE IS EQUAL TO SPACE                        00372000
003730         MOVE LOW-VALUE TO COM-KEY-PRODCODE.                      00373000
003740     IF COM-KEY-ACCOUNT IS EQUAL TO SPACE                         00374000
003750         MOVE LOW-VALUE TO COM-KEY-ACCOUNT.                       00375000
003760     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00376000
003770         MOVE LOW-VALUES TO COM-KEY-MODEL.                        00377000
003780     IF COM-KEY-IDNBRX IS EQUAL TO SPACES                         00378000
003790         MOVE LOW-VALUES TO COM-KEY-IDNBRX.                       00379000
003800     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00380000
003810         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00381000
003820         AND COM-KEY-IDNBRX IS GREATER THAN LOW-VALUES            00382000
003830         GO TO PKP-RETURN-CONT.                                   00383000
003840     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00384000
003850         MOVE '000002' TO WS-MSGNBR                               00385000
003860         GO TO PKP-RETURN-CONT.                                   00386000
003870     PERFORM EDIT-ACCOUNT-KEY.                                    00387000
003880 PKP-RETURN-CONT.                                                 00388000
003890     IF COM-PANEL-ACTION IS EQUAL TO WS-INITIAL-PANEL             00389000
003900         AND COM-KEY-PRODCODE IS EQUAL TO LOW-VALUES              00390000
003910         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUES               00391000
003920         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUES                 00392000
003930         AND COM-KEY-IDNBRX IS EQUAL TO LOW-VALUES                00393000
003940         MOVE '000001' TO WS-MSGNBR                               00394000
003950         GO TO PKP-SEND-PANEL.                                    00395000
003960     MOVE COM-KEY-IDNBRX TO SR-JUSTIFYIN.                         00396000
003970     MOVE +0018 TO SR-JLGTH.                                      00397000
003980     PERFORM RIGHT-JUSTIFY.                                       00398000
003990     IF SR-JUSTIFYOUT IS EQUAL TO SPACE                           00399000
004000         MOVE ZEROS TO COM-KEY-IDNBRX                             00400000
004010     ELSE                                                         00401000
004020         MOVE SR-JUSTIFYOUT TO COM-KEY-IDNBRX.                    00402000
004030     IF COM-KEY-IDNBRX IS NOT NUMERIC                             00403000
004040         MOVE ZEROES TO COM-KEY-IDNBRX.                           00404000
004050     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00405000
004060     MOVE COM-KEY-MODEL TO COM-MODEL.                             00406000
004070     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00407000
004080     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00408000
004090         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00409000
004100     ELSE                                                         00410000
004110         MOVE ZERO TO COM-ACCOUNT.                                00411000
004120     IF COM-FROM-PANEL IS EQUAL TO WS-FROM-BREAKAWAY              00412000
004130         OR COM-FROM-PANEL IS EQUAL TO WS-FROM-HELP               00413000
004140         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00414000
004150         GO TO PKP-RELOAD-PANEL.                                  00415000
004160     IF COM-KEY-PRODCODE IS GREATER THAN SPACES                   00416000
004170         AND COM-KEY-ACCOUNT IS GREATER THAN SPACES               00417000
004180         AND COM-KEY-MODEL IS GREATER THAN SPACES                 00418000
004190         AND COM-KEY-IDNBRX IS GREATER THAN ZEROS                 00419000
004200         MOVE '000002' TO WS-MSGNBR                               00420000
004210         GO TO PKP-RELOAD-PANEL.                                  00421000
004220 PKP-EDITS-READY.                                                 00422000
004230     MOVE WS-INITIAL-PANEL TO COM-PANEL-ACTION.                   00423000
004240     MOVE '1' TO COM-RETURN.                                      00424000
004250     MOVE WS-FROM-KEY-PANEL TO COM-FROM-PANEL.                    00425000
004260     GO TO PANEL-ROUTER.                                          00426000
004270 PKP-RELOAD-PANEL.                                                00427000
004280     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00428000
004290         MOVE LOW-VALUES TO RPV315K-PRODCD                        00429000
004300     ELSE                                                         00430000
004310         MOVE COM-KEY-PRODCODE TO RPV315K-PRODCD.                 00431000
004320     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00432000
004330         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROS                     00433000
004340         MOVE LOW-VALUES TO RPV315K-ACCOUNT                       00434000
004350     ELSE                                                         00435000
004360         MOVE COM-KEY-ACCOUNT TO RPV315K-ACCOUNT.                 00436000
004370     MOVE COM-KEY-MODEL TO RPV315K-MODEL.                         00437000
004380     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00438000
004390         MOVE LOW-VALUES TO RPV315K-MODEL.                        00439000
004400     MOVE COM-KEY-IDNBRX TO RPV315K-IDNBR.                        00440000
004410     IF COM-KEY-IDNBRX IS NOT GREATER THAN ZEROS                  00441000
004420         MOVE LOW-VALUES TO RPV315K-IDNBR.                        00442000
004430 PKP-SEND-PANEL.                                                  00443000
004440     MOVE PDB-RPV315K-NAME TO PAN-NAME.                           00444000
004450     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00445000
004460     IF COM-FROM-PANEL IS EQUAL TO WS-FROM-HELP                   00446000
004470         OR COM-FROM-PANEL IS EQUAL TO WS-FROM-BREAKAWAY          00447000
004480         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00448000
004490     ELSE                                                         00449000
004500         MOVE PDB-RPV315K-PRODCD TO PAN-SET-FLD.                  00450000
004510     PERFORM CALL-BISPAN-RPV315K.                                 00451000
004520     MOVE COM-OPERID TO RPV315K-OPERID.                           00452000
004530     MOVE COM-INST TO RPV315K-INST.                               00453000
004540     MOVE COM-EDIT-DATE TO RPV315K-SYSDATE.                       00454000
004550     IF RPV315K-PRODCD IS EQUAL TO SPACES                         00455000
004560         MOVE LOW-VALUES TO RPV315K-PRODCD.                       00456000
004570     MOVE RPV315K-ACCOUNT TO SR-JUSTIFYIN.                        00457000
004580     MOVE +18 TO SR-JLGTH.                                        00458000
004590     PERFORM LEFT-JUSTIFY.                                        00459000
004600     MOVE SR-JUSTIFYOUT TO RPV315K-ACCOUNT.                       00460000
004610     IF RPV315K-ACCOUNT IS EQUAL TO SPACES                        00461000
004620         MOVE LOW-VALUES TO RPV315K-ACCOUNT.                      00462000
004630     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00463000
004640         MOVE WS-HELPMSG TO WS-MSGNBR.                            00464000
004650     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00465000
004660         MOVE '000027' TO WS-MSGNBR                               00466000
004670     ELSE                                                         00467000
004680         PERFORM BUILD-NEXTKEY                                    00468000
004690         PERFORM COMPRESS-NEXTKEY                                 00469000
004700         MOVE WS-NEXTKEY TO RPV315K-COMMAND.                      00470000
004710     IF COM-FROM-PANEL IS EQUAL TO WS-FROM-BREAKAWAY              00471000
004720         OR COM-FROM-PANEL IS EQUAL TO WS-FROM-HELP               00472000
004730         MOVE SPACES TO COM-FROM-PANEL                            00473000
004740         MOVE COM-KEY-COMMAND TO RPV315K-COMMAND                  00474000
004750         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00475000
004760     ELSE                                                         00476000
004770         MOVE RPV315K-COMMAND TO COM-KEY-COMMAND                  00477000
004780         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00478000
004790     MOVE 'E' TO COM-RETURN.                                      00479000
004800     PERFORM GET-MESSAGE.                                         00480000
004810     MOVE WS-MESSAGE TO RPV315K-MSGLINE.                          00481000
004820     PERFORM PANEL-PFKEY-SET.                                     00482000
004830     PERFORM BUILD-PFKEY-LINE.                                    00483000
004840     MOVE WS-PFLINE1 TO RPV315K-PFLINE1.                          00484000
004850     MOVE WS-PFLINE2 TO RPV315K-PFLINE2.                          00485000
004860     PERFORM PANEL-PUT-RPV315K.                                   00486000
004870     PERFORM PANEL-SEND.                                          00487000
004880     MOVE WS-EDIT-PANEL TO COM-PANEL-ACTION.                      00488000
004890     MOVE COM-INTID TO WS-TRANSID.                                00489000
004900     GO TO CICS-RETURN-TRANSID.                                   00490000
004910 PKP-EXIT.                                                        00491000
004920     EXIT.                                                        00492000
004930******************************************************************00493000
004940 PROCESS-MAINT-PANEL SECTION.                                     00494000
004950 PMP-START.                                                       00495000
004960     IF COM-FROM-PANEL IS EQUAL TO WS-FROM-BREAKAWAY              00496000
004970         OR COM-FROM-PANEL IS EQUAL TO WS-FROM-HELP               00497000
004980         GO TO PMP-SEND-PANEL.                                    00498000
004990     MOVE 'E' TO COM-END.                                         00499000
005000     IF COM-PANEL-ACTION IS EQUAL TO WS-INITIAL-PANEL             00500000
005010         MOVE LOW-VALUES TO RPV315-PANL-DATA-AREA                 00501000
005020         MOVE SPACES TO COM-DCHG                                  00502000
005030         MOVE WS-INITIAL-PANEL TO COM-PANEL-ACTION                00503000
005040         MOVE 'VKL' TO RPXXX08-APIFUNC                            00504000
005050         GO TO PMP-LINK-TO-RPLXXX08.                              00505000
005060 PMP-PFKEYS.                                                      00506000
005070     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00507000
005080         MOVE SPACES TO WS-CURSOR-FIELD                           00508000
005090         GO TO PMP-SEND-PANEL.                                    00509000
005100     IF EIBAID IS EQUAL TO DFHPF4                                 00510000
005110         GO TO PMP-CONTINUE.                                      00511000
005120     MOVE COM-NEXTKEY TO WS-NEXTKEY.                              00512000
005130 PMP-CONTINUE.                                                    00513000
005140     MOVE ZERO TO WS-MSGNBR.                                      00514000
005150     MOVE +0 TO WS-ERROR-COUNT.                                   00515000
005160     MOVE COM-DCHG TO SRW166-FIELD.                               00516000
005170     MOVE 'E' TO SRW166-IN.                                       00517000
005180     MOVE 'Y' TO SRW166-OUT.                                      00518000
005190* MOVE THE LENGTH OF THE COM-DCHG FIELD:                          00519000
005200     MOVE +1 TO SRW166-LGTH.                                      00520000
005210     PERFORM EXAMINE-FIELD.                                       00521000
005220     MOVE SRW166-FIELD TO COM-DCHG.                               00522000
005230     MOVE COM-DCHG TO RPXXX08-EXTENSION-DCHG.                     00523000
005240     PERFORM MOVE-PANEL-TO-RECORD.                                00524000
005250     IF COM-DCHG IS EQUAL TO SPACES                               00525000
005260         AND (EIBAID IS EQUAL TO DFHPF3                           00526000
005270         OR EIBAID IS EQUAL TO DFHPF4)                            00527000
005280         GO TO CLOSE-TRANSACTION.                                 00528000
005290     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00529000
005300         GO TO CLOSE-TRANSACTION.                                 00530000
005310 PMP-LINK-TO-RPLXXX08.                                            00531000
005320     MOVE COM-DCHG TO RPXXX08-EXTENSION-DCHG.                     00532000
005330     IF COM-PANEL-ACTION IS EQUAL TO WS-INITIAL-PANEL             00533000
005340         MOVE 'VKL' TO RPXXX08-APIFUNC.                           00534000
005350     IF COM-PANEL-ACTION IS EQUAL TO WS-EDIT-PANEL                00535000
005360         MOVE 'UPD' TO RPXXX08-APIFUNC.                           00536000
005370     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00537000
005380         MOVE 'EDT' TO RPXXX08-APIFUNC.                           00538000
005390     PERFORM RPXXX08-LINK-MESSAGE.                                00539000
005400     IF RPXXX08-RETURN IS EQUAL TO 'E'                            00540000
005410         AND RPXXX08-APIFUNC IS EQUAL TO 'UPD'                    00541000
005420         GO TO PMP-MOVE-RECORD-TO-PANEL.                          00542000
005430     IF RPXXX08-RETURN IS EQUAL TO 'E'                            00543000
005440         MOVE WS-EDIT-PANEL TO COM-PANEL-ACTION                   00544000
005450         MOVE 'E' TO COM-RETURN                                   00545000
005460         MOVE WS-FROM-MAINT-PANEL TO COM-FROM-PANEL               00546000
005470         GO TO PANEL-ROUTER.                                      00547000
005480     IF RPXXX08-APIFUNC IS EQUAL TO 'UPD'                         00548000
005490         GO TO CLOSE-TRANSACTION.                                 00549000
005500     MOVE RPXXX08-UPDATE TO COM-UPDATE.                           00550000
005510     IF RPXXX08-APIFUNC IS EQUAL TO 'VKL'                         00551000
005520         MOVE RPXXX08-CUST-NAME TO COM-CUST-NAME.                 00552000
005530 PMP-MOVE-RECORD-TO-PANEL.                                        00553000
005540     MOVE RPXXX08-EXTENSION-DCHG TO COM-DCHG.                     00554000
005550     IF COM-PRODCODE IS EQUAL TO LOW-VALUES                       00555000
005560         MOVE RPXXX08-SK2-PRODCODE TO COM-PRODCODE                00556000
005570         MOVE RPXXX08-SK2-PRODCODE TO COM-KEY-PRODCODE            00557000
005580         MOVE RPXXX08-SK2-ACCOUNT TO COM-KEY-ACCOUNT              00558000
005590         MOVE RPXXX08-SK2-MODEL TO COM-KEY-MODEL.                 00559000
005600     MOVE COM-PRODCODE TO RPV315-PRODCD.                          00560000
005610     MOVE COM-KEY-ACCOUNT TO RPV315-ACCOUNT.                      00561000
005620     MOVE COM-KEY-MODEL TO RPV315-MODEL.                          00562000
005630     PERFORM MOVE-RECORD-TO-PANEL.                                00563000
005640 PMP-SEND-PANEL.                                                  00564000
005650     MOVE PDB-RPV315-NAME TO PAN-NAME.                            00565000
005660     MOVE COM-INST TO RPV315-INST.                                00566000
005670     MOVE COM-OPERID TO RPV315-OPERID.                            00567000
005680     MOVE COM-EDIT-DATE TO RPV315-SYSDATE.                        00568000
005690     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00569000
005700         MOVE WS-HELPMSG TO WS-MSGNBR.                            00570000
005710     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00571000
005720         MOVE '000027' TO WS-MSGNBR                               00572000
005730     ELSE                                                         00573000
005740         PERFORM BUILD-NEXTKEY                                    00574000
005750         PERFORM COMPRESS-NEXTKEY                                 00575000
005760         MOVE WS-NEXTKEY TO RPV315-COMMAND.                       00576000
005770     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00577000
005780         OR COM-EXTN-DCHG IS EQUAL TO 'P'                         00578000
005790         MOVE ALL 'P' TO COM-DCHG                                 00579000
005800         MOVE PDB-RPV315-COMMAND TO WS-CURSOR-FIELD.              00580000
005810     MOVE SPACES TO RPXXX08-APIFUNC.                              00581000
005820     PERFORM SET-ATTRIBUTES-AND-MESSAGES.                         00582000
005830     IF (COM-FROM-PANEL IS EQUAL TO WS-FROM-HELP                  00583000
005840         OR COM-FROM-PANEL IS EQUAL TO WS-FROM-BREAKAWAY)         00584000
005850         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00585000
005860         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00586000
005870     ELSE                                                         00587000
005880         IF WS-CURSOR-FIELD IS EQUAL TO SPACE                     00588000
005890             MOVE PDB-RPV315-EXTN TO PAN-SET-FLD                  00589000
005900         ELSE                                                     00590000
005910             MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                 00591000
005920     IF COM-FROM-PANEL IS EQUAL TO WS-FROM-BREAKAWAY              00592000
005930         OR COM-FROM-PANEL IS EQUAL TO WS-FROM-HELP               00593000
005940         MOVE SPACE TO COM-FROM-PANEL                             00594000
005950         MOVE COM-KEY-COMMAND TO RPV315-COMMAND                   00595000
005960         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00596000
005970     ELSE                                                         00597000
005980         MOVE RPV315-COMMAND TO COM-KEY-COMMAND                   00598000
005990         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00599000
006000     PERFORM GET-MESSAGE.                                         00600000
006010     MOVE WS-MESSAGE TO RPV315-MSGLINE.                           00601000
006020     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00602000
006030     PERFORM CALL-BISPAN-RPV315.                                  00603000
006040     PERFORM PANEL-PFKEY-SET.                                     00604000
006050     PERFORM BUILD-PFKEY-LINE.                                    00605000
006060     MOVE WS-PFLINE1 TO RPV315-PFLINE1.                           00606000
006070     MOVE WS-PFLINE2 TO RPV315-PFLINE2.                           00607000
006080     PERFORM PANEL-PUT-RPV315.                                    00608000
006090     PERFORM PANEL-SEND.                                          00609000
006100     MOVE WS-FROM-MAINT-PANEL TO COM-FROM-PANEL.                  00610000
006110     MOVE '1' TO COM-RETURN.                                      00611000
006120     MOVE WS-EDIT-PANEL TO COM-PANEL-ACTION.                      00612000
006130     MOVE COM-INTID TO WS-TRANSID.                                00613000
006140     GO TO CICS-RETURN-TRANSID.                                   00614000
006150 PMP-EXIT.                                                        00615000
006160     EXIT.                                                        00616000
006170******************************************************************00617000
006180 MOVE-PANEL-TO-RECORD SECTION.                                    00618000
006190 MPTR-START.                                                      00619000
006200     MOVE COM-CUST-TYPE TO RPXXX08-CUST-TYPE.                     00620000
006210     MOVE COM-CUST-NAME TO RPXXX08-CUST-NAME.                     00621000
006220     MOVE COM-IDNUMBER TO RPXXX08-IDNUMBER.                       00622000
006230 MPTR-EXTN.                                                       00623000
006240     MOVE RPV315-EXTN TO RPXXX08-EXTENSION.                       00624000
006250 MPTR-EXIT.                                                       00625000
006260     EXIT.                                                        00626000
006270******************************************************************00627000
006280 MOVE-RECORD-TO-PANEL SECTION.                                    00628000
006290 MRTP-START.                                                      00629000
006300     MOVE RPXXX08-SK2-MODEL TO RPV315-MODEL.                      00630000
006310     MOVE RPXXX08-MODEL-DESC TO RPV315-MODDESC.                   00631000
006320     MOVE RPXXX08-CUST-NAME TO COM-CUST-NAME.                     00632000
006330     MOVE COM-CUST-NAME TO RPV315-CUSTNA.                         00633000
006340     IF RPXXX08-OUT-FLAG IS EQUAL TO 'Y'                          00634000
006350         MOVE '** OUTSIDE RELATIONSHIP **' TO RPV315-RELTYPE.     00635000
006360     MOVE RPXXX08-IDNUMBER TO COM-IDNUMBER.                       00636000
006370     MOVE COM-IDNUMBER TO RPV315-IDNBR.                           00637000
006380     IF RPXXX08-REL-STAT IS EQUAL TO 'A'                          00638000
006390         MOVE 'ACTIVE' TO RPV315-STATUS.                          00639000
006400     IF RPXXX08-REL-STAT IS EQUAL TO 'E'                          00640000
006410         MOVE 'EXPIRED' TO RPV315-STATUS.                         00641000
006420     IF RPXXX08-REL-STAT IS EQUAL TO 'I'                          00642000
006430         MOVE 'INACTIVE' TO RPV315-STATUS.                        00643000
006440     MOVE RPXXX08-CUST-TYPE TO COM-CUST-TYPE.                     00644000
006450 MRTP-EXTN.                                                       00645000
006460     MOVE LOW-VALUES TO RPV315-EXTN.                              00646000
006470     MOVE RPXXX08-EXTENSION-DCHG TO COM-EXTN-DCHG.                00647000
006480     IF COM-EXTN-DCHG IS EQUAL TO 'D'                             00648000
006490         MOVE WS-DCHG-PROTECT TO COM-EXTN-DCHG                    00649000
006500         GO TO MRTP-CONT.                                         00650000
006510     IF RPXXX08-EXTENSION IS GREATER THAN SPACES                  00651000
006520         MOVE RPXXX08-EXTENSION TO RPV315-EXTN                    00652000
006530     ELSE                                                         00653000
006540         MOVE 'N' TO RPV315-EXTN.                                 00654000
006550 MRTP-CONT.                                                       00655000
006560     MOVE RPXXX08-VF-EXP-DATE TO SR-CODASYL.                      00656000
006570     PERFORM EDIT-CODASYL-DATE.                                   00657000
006580     MOVE SR-CODASYL-EDITED TO RPV315-EXTNDT.                     00658000
006590     MOVE RPXXX08-EXTENSION-DAYS TO RPV315-EXTNDAY.               00659000
006600     MOVE RPXXX08-EXTENSIONS TO RPV315-EXTNS.                     00660000
006610     MOVE RPXXX08-MAX-EXTENSIONS TO RPV315-MAXEXTN.               00661000
006620     MOVE RPXXX08-DAYSPEREXT TO RPV315-RETNDAY.                   00662000
006630     MOVE RPXXX08-MAXRETDAYS TO RPV315-MRETNDY.                   00663000
006640 MRTP-EXIT.                                                       00664000
006650     EXIT.                                                        00665000
006660******************************************************************00666000
006670 SET-DCHG-INDICATORS SECTION.                                     00667000
006680 SDI-START.                                                       00668000
006690     IF COM-EXTN-DCHG IS EQUAL TO SPACE                           00669000
006700         MOVE PDB-RPV315-EXTN-DCHG TO COM-EXTN-DCHG.              00670000
006710 SDI-EXIT.                                                        00671000
006720     EXIT.                                                        00672000
006730******************************************************************00673000
006740 SET-ATTRIBUTES-AND-MESSAGES SECTION.                             00674000
006750 SAAM-START.                                                      00675000
006760     MOVE COM-EXTN-DCHG TO WS-DCHG-TEST.                          00676000
006770     MOVE PDB-RPV315-EXTN TO PAN-SET-FLD.                         00677000
006780     MOVE PDB-RPV315-EXTN-VID TO PAN-SET-VID.                     00678000
006790     MOVE PDB-RPV315-EXTN-EL TO PAN-SET-EMP.                      00679000
006800     PERFORM SET-ATTRIBUTE.                                       00680000
006810     MOVE PAN-SET-VID TO PDB-RPV315-EXTN-VID.                     00681000
006820     MOVE PAN-SET-EMP TO PDB-RPV315-EXTN-EL.                      00682000
006830     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00683000
006840     PERFORM CALL-BISPAN-RPV315.                                  00684000
006850 SAAM-EXIT.                                                       00685000
006860     EXIT.                                                        00686000
006870******************************************************************00687000
006880 SET-ATTRIBUTE SECTION.                                           00688000
006890 SA-START.                                                        00689000
006900     IF WS-DCHG-TEST IS EQUAL TO WS-DCHG-EDITERR                  00690000
006910         ADD +1 TO WS-ERROR-COUNT                                 00691000
006920         MOVE 'Y' TO WS-ERROR                                     00692000
006930         MOVE VIS-ERROR TO PAN-SET-VID                            00693000
006940         MOVE EMP-ERROR TO PAN-SET-EMP.                           00694000
006950     IF WS-DCHG-TEST IS EQUAL TO WS-DCHG-EDITERR                  00695000
006960         AND WS-CURSOR-FIELD IS EQUAL TO SPACES                   00696000
006970         MOVE PAN-SET-FLD TO WS-CURSOR-FIELD.                     00697000
006980     IF WS-DCHG-TEST IS EQUAL TO WS-DCHG-PROTECT                  00698000
006990         MOVE VIS-DISPLAY TO PAN-SET-VID                          00699000
007000         MOVE EMP-NORMAL TO PAN-SET-EMP.                          00700000
007010     IF WS-DCHG-TEST IS EQUAL TO WS-DCHG-HIDDEN                   00701000
007020         MOVE VIS-DISPLAY TO PAN-SET-VID                          00702000
007030         MOVE EMP-HIDDEN TO PAN-SET-EMP.                          00703000
007040     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00704000
007050     PERFORM CALL-BISPAN-RPV315.                                  00705000
007060 SA-EXIT.                                                         00706000
007070     EXIT.                                                        00707000
007080******************************************************************00708000
007090 MORE-DATA-PANELS SECTION.                                        00709000
007100 MDP-START.                                                       00710000
007110     GO TO PANEL-ROUTER.                                          00711000
007120 MDP-EXIT.                                                        00712000
007130     EXIT.                                                        00713000
007140******************************************************************00714000
007150 CLOSE-TRANSACTION SECTION.                                       00715000
000000 COPY SRP0722.                                                    00716000
007170******************************************************************00717000
007180 PANEL-INIT SECTION.                                              00718000
000000 COPY SRP073.                                                     00719000
007200******************************************************************00720000
007210 BUILD-NEXTKEY SECTION.                                           00721000
007220 BXN-START.                                                       00722000
007230     MOVE SPACES TO WS-NEXTKEY.                                   00723000
007240     MOVE ',' TO WS-DELIM1.                                       00724000
007250     MOVE ',' TO WS-DELIM2.                                       00725000
007260     MOVE ',' TO WS-DELIM3.                                       00726000
007270     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00727000
007280     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00728000
007290         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00729000
007300     ELSE                                                         00730000
007310         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00731000
007320     MOVE COM-KEY-MODEL TO WS-MODEL.                              00732000
007330     MOVE COM-EXTERNALID TO WS-EXTID.                             00733000
007340 BXN-EXIT.                                                        00734000
007350     EXIT.                                                        00735000
007360******************************************************************00736000
007370 ABORT-EXIT SECTION.                                              00737000
007380 AE-START.                                                        00738000
007390     MOVE EIBFN TO COM-ABEIBFN.                                   00739000
007400     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00740000
007410     GO TO CICS-ABORT-EXIT.                                       00741000
007420 AE-EXIT.                                                         00742000
007430     EXIT.                                                        00743000
007440******************************************************************00744000
007450 RPXXX08-LINK-MESSAGE SECTION.                                    00745000
007460 CXLM-START.                                                      00746000
007470     MOVE 'Y' TO RPXXX08-GLOBAL-CLOSE.                            00747000
007480     MOVE WS-FILEOPTIONS TO RPXXX08-FILEOPTS.                     00748000
007490     MOVE COM-RETURN TO RPXXX08-RETURN.                           00749000
007500     MOVE COM-MODELID TO RPXXX08-MODELID.                         00750000
007510     MOVE COM-SECALT TO RPXXX08-SECALT.                           00751000
007520     MOVE COM-OPERID TO RPXXX08-OPERID.                           00752000
007530     MOVE COM-DATE TO RPXXX08-DATE.                               00753000
007540     MOVE COM-EXTERNALID TO RPXXX08-EXTERNALID.                   00754000
007550     MOVE COM-EIBTRMID TO RPXXX08-TERMID.                         00755000
007560     MOVE COM-WKUNAME TO RPXXX08-WORKID.                          00756000
007570     MOVE COM-TRANSTART TO RPXXX08-TRANSTART.                     00757000
007580     MOVE COM-APPLSEQ TO RPXXX08-APPLSEQ.                         00758000
007590     MOVE COM-UPDATE TO RPXXX08-UPDATE.                           00759000
007600     MOVE WS-RPSAPPLNBR TO RPXXX08-APPL.                          00760000
007610     MOVE 'M' TO RPXXX08-FUNC.                                    00761000
007620     MOVE COM-INST TO RPXXX08-SK2-INST.                           00762000
007630     MOVE 'Y' TO RPXXX08-SK2-INST-DCHG.                           00763000
007640     MOVE COM-PRODCODE TO RPXXX08-SK2-PRODCODE.                   00764000
007650     MOVE 'Y' TO RPXXX08-SK2-PRODCODE-DCHG.                       00765000
007660     MOVE COM-KEY-ACCOUNT TO RPXXX08-SK2-ACCOUNT.                 00766000
007670     MOVE 'Y' TO RPXXX08-SK2-ACCOUNT-DCHG.                        00767000
007680     MOVE COM-KEY-MODEL TO RPXXX08-SK2-MODEL.                     00768000
007690     MOVE 'Y' TO RPXXX08-SK2-MODEL-DCHG.                          00769000
007700     IF RPXXX08-SK2-MODEL IS NOT GREATER THAN SPACES              00770000
007710         MOVE 'N' TO RPXXX08-SK2-MODEL-DCHG.                      00771000
007720     MOVE COM-INST TO RPXXX08-SK1-INST.                           00772000
007730     MOVE 'Y' TO RPXXX08-SK1-INST-DCHG.                           00773000
007740     MOVE COM-KEY-IDNBRX TO RPXXX08-SK1-IDNUMBER.                 00774000
007750     MOVE 'Y' TO RPXXX08-SK1-IDNUMBER-DCHG.                       00775000
007760     IF COM-KEY-IDNBRX IS EQUAL TO LOW-VALUES                     00776000
007770         OR COM-KEY-IDNBRX IS EQUAL TO ZEROS                      00777000
007780         MOVE ALL 'N' TO RPXXX08-SELECT-KEY1-DCHG                 00778000
007790         INITIALIZE RPXXX08-SELECT-KEY1                           00779000
007800     ELSE                                                         00780000
007810         MOVE ALL 'N' TO RPXXX08-SELECT-KEY2-DCHG                 00781000
007820         INITIALIZE RPXXX08-SELECT-KEY2.                          00782000
007830     MOVE ZERO TO RPXXX08-ERRCNT.                                 00783000
007840     MOVE ZERO TO RPXXX08-MSGNBR.                                 00784000
007850     MOVE COM-LANG TO RPXXX08-COM-LANG.                           00785000
007860     MOVE COM-CURN-CODE TO RPXXX08-COM-CURNCD.                    00786000
007870     MOVE COM-INST-OPTS TO RPXXX08-INST-OPTS.                     00787000
007880     EXEC CICS LINK                                               00788000
007890         PROGRAM('RPLXXX08')                                      00789000
007900         COMMAREA(RPXXX08-MESSAGE)                                00790000
007910         LENGTH(LENGTH OF RPXXX08-MESSAGE)                        00791000
007920         RESP(WS-CICS-RESPONSE)                                   00792000
007930         END-EXEC.                                                00793000
007940     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00794000
007950         MOVE 'RPLXXX08 LINK FAILED' TO COM-ABMSG                 00795000
007960         MOVE WS-TR0002 TO COM-ABTRACE                            00796000
007970         MOVE WS-AB0009 TO COM-ABORT                              00797000
007980         GO TO CICS-ABORT-EXIT.                                   00798000
007990     MOVE RPXXX08-FUNCTION TO WS-FUNCTION.                        00799000
008000     IF RPXXX08-ABORT IS NOT EQUAL TO ZERO                        00800000
008010         MOVE RPXXX08-ABORT TO COM-ABORT                          00801000
008020         MOVE RPXXX08-ABTRACE TO COM-ABTRACE                      00802000
008030         MOVE RPXXX08-ABEIBFN TO COM-ABEIBFN                      00803000
008040         MOVE RPXXX08-ABEIBRCODE TO COM-ABEIBRCODE                00804000
008050         MOVE RPXXX08-ABPROGID TO COM-ABPROGID                    00805000
008060         MOVE RPXXX08-SRBMDB TO COM-SRBMDB                        00806000
008070         MOVE RPXXX08-ABTYPE TO COM-ABTYPE                        00807000
008080         GO TO CICS-ABORT-EXIT.                                   00808000
008090     MOVE RPXXX08-FUNC TO COM-FUNC.                               00809000
008100     MOVE RPXXX08-ABORT TO COM-ABORT.                             00810000
008110     MOVE RPXXX08-MSGNBR TO WS-MSGNBR.                            00811000
008120 CXLM-EXIT.                                                       00812000
008130     EXIT.                                                        00813000
008140******************************************************************00814000
008150 CLOSE-PANEL SECTION.                                             00815000
008160 CP-START.                                                        00816000
008170     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00817000
008180     IF COM-RETURN IS EQUAL TO 'E'                                00818000
008190         PERFORM CALL-BISPAN-RPV315K.                             00819000
008200     IF COM-RETURN IS EQUAL TO '1'                                00820000
008210         PERFORM CALL-BISPAN-RPV315.                              00821000
008220 CP-EXIT.                                                         00822000
008230     EXIT.                                                        00823000
008240******************************************************************00824000
008250 CALL-BISPAN-RPV315K SECTION.                                     00825000
008260 CBD1-START.                                                      00826000
008270     CALL 'BISPAN' USING                                          00827000
008280         BICRPSB,                                                 00828000
008290         BICRSRB,                                                 00829000
008300         BICRPAN,                                                 00830000
008310         RPV315K-PANL-DATA-BLOCK,                                 00831000
008320         RPV315K-PANL-DATA-AREA.                                  00832000
008330 CBD1-EXIT.                                                       00833000
008340     EXIT.                                                        00834000
008350******************************************************************00835000
008360 CALL-BISPAN-RPV315 SECTION.                                      00836000
008370 CBD2-START.                                                      00837000
008380     CALL 'BISPAN' USING                                          00838000
008390         BICRPSB,                                                 00839000
008400         BICRSRB,                                                 00840000
008410         BICRPAN,                                                 00841000
008420         RPV315-PANL-DATA-BLOCK,                                  00842000
008430         RPV315-PANL-DATA-AREA.                                   00843000
008440 CBD2-EXIT.                                                       00844000
008450     EXIT.                                                        00845000
008460******************************************************************00846000
008470 PANEL-GET-RPV315 SECTION.                                        00847000
008480 PANEL-GET-RPV315-START.                                          00848000
008490     MOVE 'N' TO RPV315-SW-SET-CURSOR.                            00849000
008500     MOVE PDB-RPV315-NAME TO PAN-NAME.                            00850000
008510     MOVE REQ-GET TO PAN-REQ-VERB.                                00851000
008520     CALL 'BISPAN' USING                                          00852000
008530         BICRPSB                                                  00853000
008540         BICRSRB                                                  00854000
008550         BICRPAN                                                  00855000
008560         RPV315-PANL-DATA-BLOCK,                                  00856000
008570         RPV315-PANL-DATA-AREA.                                   00857000
008580 PANEL-GET-RPV315-EXIT.                                           00858000
008590     EXIT.                                                        00859000
008600******************************************************************00860000
008610 PANEL-PUT-RPV315 SECTION.                                        00861000
008620 PANEL-PUT-RPV315-START.                                          00862000
008630     MOVE PDB-RPV315-NAME TO PAN-NAME.                            00863000
008640     MOVE REQ-PUT TO PAN-REQ-VERB.                                00864000
008650     CALL 'BISPAN' USING                                          00865000
008660         BICRPSB                                                  00866000
008670         BICRSRB                                                  00867000
008680         BICRPAN                                                  00868000
008690         RPV315-PANL-DATA-BLOCK,                                  00869000
008700         RPV315-PANL-DATA-AREA.                                   00870000
008710 PANEL-PUT-RPV315-EXIT.                                           00871000
008720     EXIT.                                                        00872000
008730******************************************************************00873000
008740 PANEL-GET-RPV315K SECTION.                                       00874000
008750 PANEL-GET-RPV315K-START.                                         00875000
008760     MOVE 'N' TO RPV315K-SW-SET-CURSOR.                           00876000
008770     MOVE PDB-RPV315K-NAME TO PAN-NAME.                           00877000
008780     MOVE REQ-GET TO PAN-REQ-VERB.                                00878000
008790     CALL 'BISPAN' USING                                          00879000
008800         BICRPSB                                                  00880000
008810         BICRSRB                                                  00881000
008820         BICRPAN                                                  00882000
008830         RPV315K-PANL-DATA-BLOCK,                                 00883000
008840         RPV315K-PANL-DATA-AREA.                                  00884000
008850 PANEL-GET-RPV315K-EXIT.                                          00885000
008860     EXIT.                                                        00886000
008870******************************************************************00887000
008880 PANEL-PUT-RPV315K SECTION.                                       00888000
008890 PANEL-PUT-RPV315K-START.                                         00889000
008900     MOVE PDB-RPV315K-NAME TO PAN-NAME.                           00890000
008910     MOVE REQ-PUT TO PAN-REQ-VERB.                                00891000
008920     CALL 'BISPAN' USING                                          00892000
008930         BICRPSB                                                  00893000
008940         BICRSRB                                                  00894000
008950         BICRPAN                                                  00895000
008960         RPV315K-PANL-DATA-BLOCK,                                 00896000
008970         RPV315K-PANL-DATA-AREA.                                  00897000
008980 PANEL-PUT-RPV315K-EXIT.                                          00898000
008990     EXIT.                                                        00899000
009000******************************************************************00900000
009010 MIC-MST-API SECTION.                                             00901000
000000 COPY MIPMSTA.                                                    00902000
009030******************************************************************00903000
009040 EDIT-ACCOUNT-KEY SECTION.                                        00904000
009050 EAK-START.                                                       00905000
009060     MOVE COM-INST TO RPW130-INST.                                00906000
009070     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 00907000
009080     MOVE COM-KEY-PRODCODE TO RPW130-PRODCODE.                    00908000
009090     MOVE COM-KEY-ACCOUNT TO RPW130-ACCOUNTINPUT.                 00909000
009100     MOVE 'V' TO RPW130-FUNCTION.                                 00910000
009110     PERFORM ACCOUNT-KEY-EDIT.                                    00911000
009120     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00912000
009130         MOVE '500003' TO WS-MSGNBR                               00913000
009140         GO TO EAK-EXIT.                                          00914000
009150     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00915000
009160     MOVE RPW130-ACCOUNTKEY TO COM-KEY-ACCOUNT.                   00916000
009170     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          00917000
009180     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      00918000
009190     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                00919000
009200 EAK-EXIT.                                                        00920000
009210     EXIT.                                                        00921000
009220******************************************************************00922000
009230 LEFT-JUSTIFY SECTION.                                            00923000
000000 COPY SRP025.                                                     00924000
009250******************************************************************00925000
009260 RIGHT-JUSTIFY SECTION.                                           00926000
000000 COPY SRP026.                                                     00927000
009280******************************************************************00928000
009290 PARAMETER-SEARCH SECTION.                                        00929000
000000 COPY SRP030.                                                     00930000
009310******************************************************************00931000
009320 COMPRESS-NEXTKEY SECTION.                                        00932000
000000 COPY SRP070.                                                     00933000
009340******************************************************************00934000
009350 GET-MESSAGE SECTION.                                             00935000
000000 COPY SRP071.                                                     00936000
009370******************************************************************00937000
009380 EDIT-CODASYL-DATE SECTION.                                       00938000
000000 COPY SRP087.                                                     00939000
009400******************************************************************00940000
009410 EXAMINE-FIELD SECTION.                                           00941000
000000 COPY SRP166.                                                     00942000
009430******************************************************************00943000
009440 SRP170-ROUTINE SECTION.                                          00944000
000000 COPY SRP170.                                                     00945000
009460******************************************************************00946000
009470 BUILD-PFKEY-LINE SECTION.                                        00947000
000000 COPY SRP710.                                                     00948000
009490******************************************************************00949000
009500 VALIDATE-PFKEYS SECTION.                                         00950000
000000 COPY SRP711.                                                     00951000
009520******************************************************************00952000
009530 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 00953000
000000 COPY RPP033.                                                     00954000
009550******************************************************************00955000
009560 ACCOUNT-KEY-EDIT SECTION.                                        00956000
000000 COPY RPP130.                                                     00957000
009580******************************************************************00958000
009590 SLP096-GET-2023-RECORD SECTION.                                  00959000
000000 COPY SLP096.                                                     00960000
009610******************************************************************00961000
009620 CICS-XCTL SECTION.                                               00962000
000000 COPY SLP704.                                                     00963000
009640******************************************************************00964000
009650 CICS-RETURN-TRANSID SECTION.                                     00965000
000000 COPY SLP710.                                                     00966000
009670******************************************************************00967000
009680 TSQ-DELETE SECTION.                                              00968000
009690 TSQD-START.                                                      00969000
009700 TSQD-EXIT.                                                       00970000
009710     EXIT.                                                        00971000
009720******************************************************************00972000
009730 CICS-ABORT-EXIT SECTION.                                         00973000
000000 COPY SLP798.                                                     00974000
009750******************************************************************00975000
