000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLQUA00.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLQUA00 - RELATIONSHIPS NEW REVIEW MODULE                  *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW079-AREAS.                                                00016000
000000 COPY SRW079.                                                     00017000
000180 01  SRW105-AREAS.                                                00018000
000000 COPY SRW105.                                                     00019000
000200*01  BICRSRB.                                                     00020000
000000 COPY BICRSRB.                                                    00021000
000220*01  BICRPSB.                                                     00022000
000000 COPY BICRPSB.                                                    00023000
000240*01  BICRVERB.                                                    00024000
000000 COPY BICRVERB.                                                   00025000
000260*01  BICRSTAT.                                                    00026000
000000 COPY BICRSTAT.                                                   00027000
000280*01  BICRDBS.                                                     00028000
000000 COPY BICRDBS.                                                    00029000
000300*01  BICRLOG.                                                     00030000
000000 COPY BICRLOG.                                                    00031000
000320 01  SRW710-AREAS.                                                00032000
000000 COPY SRW710.                                                     00033000
000340 01  WS-WORKAREAS.                                                00034000
000350     03  WS-MAX-PANEL-ENTRIES    PIC S9(04)      COMP             00035000
000360                                                 VALUE +0008.     00036000
000370     03  COM-ABORT               PIC S9(04)      COMP.            00037000
000380     03  WS-SUB1                 PIC S9(04)      COMP             00038000
000390                                                 VALUE +0000.     00039000
000400     03  WS-SUB2                 PIC S9(04)      COMP             00040000
000410                                                 VALUE +0000.     00041000
000420     03  WS-UPDATESW             PIC X(01)       VALUE SPACES.    00042000
000430     03  WS-UPDATE-QUA           PIC X(01)       VALUE SPACES.    00043000
000440     03  WS-RP-PRODCODE          PIC X(06)       VALUE SPACES.    00044000
000450     03  WS-ERROR-INDICATOR      PIC X(01)       VALUE SPACES.    00045000
000460     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00046000
000470     03  FILLER          REDEFINES WS-CURDATE.                    00047000
000480         05  WS-CURMM            PIC 9(02).                       00048000
000490         05  WS-CURDD            PIC 9(02).                       00049000
000500         05  WS-CURYYYY          PIC 9(04).                       00050000
000510     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00051000
000520     03  FILLER          REDEFINES WS-PDATE.                      00052000
000530         05  WS-PDATE-YYYY       PIC 9(04).                       00053000
000540         05  WS-PDATE-MM         PIC 9(02).                       00054000
000550         05  WS-PDATE-DD         PIC 9(02).                       00055000
000560     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00056000
000570     03  FILLER          REDEFINES WS-PDATE2.                     00057000
000580         05  WS-PDATE2-YYYY      PIC 9(04).                       00058000
000590         05  WS-PDATE2-MM        PIC 9(02).                       00059000
000600         05  WS-PDATE2-DD        PIC 9(02).                       00060000
000610     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00061000
000620                                                 VALUE ZERO.      00062000
000630*----------------------------------------------------------------*00063000
000640 01  MIWPRI-AREAS.                                                00064000
000000 COPY MIWPRI.                                                     00065000
000660 01  MIWMSTA-AREAS.                                               00066000
000000 COPY MIWMSTA.                                                    00067000
000680 01  MIMST-RECORD.                                                00068000
000000 COPY MISMST.                                                     00069000
000700 01  MI2023-RECORD.                                               00070000
000000 COPY MIS2023A.                                                   00071000
000720*----------------------------------------------------------------*00072000
000730 01  RPWCRW-AREA.                                                 00073000
000000 COPY RPWCRWA.                                                    00074000
000750 01  RPCRW-RECORD.                                                00075000
000000 COPY RPSCRW.                                                     00076000
000770 01  RPWIDX-AREA.                                                 00077000
000000 COPY RPWIDXA.                                                    00078000
000790 01  RPIDX-RECORD.                                                00079000
000000 COPY RPSIDX.                                                     00080000
000810 01  RPWQUA-AREA.                                                 00081000
000000 COPY RPWQUAA.                                                    00082000
000830 01  RPQUA-RECORD.                                                00083000
000000 COPY RPSQUA.                                                     00084000
000850 01  RPWREL-AREA.                                                 00085000
000000 COPY RPWRELA.                                                    00086000
000870 01  RPREL-RECORD.                                                00087000
000000 COPY RPSREL.                                                     00088000
000890 01  WS-TRACECODES.                                               00089000
000900     03  WS-TR0001               PIC S9(04)      COMP             00090000
000910                                                 VALUE +0001.     00091000
000920     03  WS-TR0002               PIC S9(04)      COMP             00092000
000930                                                 VALUE +0002.     00093000
000940     03  WS-TR0003               PIC S9(04)      COMP             00094000
000950                                                 VALUE +0003.     00095000
000960     03  WS-TR0004               PIC S9(04)      COMP             00096000
000970                                                 VALUE +0004.     00097000
000980     03  WS-TR0005               PIC S9(04)      COMP             00098000
000990                                                 VALUE +0005.     00099000
001000     03  WS-TR0006               PIC S9(04)      COMP             00100000
001010                                                 VALUE +0006.     00101000
001020     03  WS-TR0007               PIC S9(04)      COMP             00102000
001030                                                 VALUE +0007.     00103000
001040     03  WS-TR0008               PIC S9(04)      COMP             00104000
001050                                                 VALUE +0008.     00105000
001060     03  WS-TR0009               PIC S9(04)      COMP             00106000
001070                                                 VALUE +0009.     00107000
001080     03  WS-TR0010               PIC S9(04)      COMP             00108000
001090                                                 VALUE +0010.     00109000
001100     03  WS-TR0011               PIC S9(04)      COMP             00110000
001110                                                 VALUE +0011.     00111000
001120     03  WS-TR0012               PIC S9(04)      COMP             00112000
001130                                                 VALUE +0012.     00113000
001140     03  WS-TR0013               PIC S9(04)      COMP             00114000
001150                                                 VALUE +0013.     00115000
001160     03  WS-TR0014               PIC S9(04)      COMP             00116000
001170                                                 VALUE +0014.     00117000
001180 01  WS-ABORTCODES.                                               00118000
001190     03  WS-AB2000               PIC S9(04)      COMP             00119000
001200                                                 VALUE +2000.     00120000
001210     03  WS-AB2033               PIC S9(04)      COMP             00121000
001220                                                 VALUE +2033.     00122000
001230     03  WS-AB3051               PIC S9(04)      COMP             00123000
001240                                                 VALUE +3051.     00124000
001250     03  WS-AB6310               PIC S9(04)      COMP             00125000
001260                                                 VALUE +6310.     00126000
001270     03  WS-AB6325               PIC S9(04)      COMP             00127000
001280                                                 VALUE +6325.     00128000
001290     03  WS-AB6330               PIC S9(04)      COMP             00129000
001300                                                 VALUE +6330.     00130000
001310     03  WS-AB6350               PIC S9(04)      COMP             00131000
001320                                                 VALUE +6350.     00132000
001330******************************************************************00133000
001340 01  SLW096-AREAS.                                                00134000
000000 COPY SLW096.                                                     00135000
001360******************************************************************00136000
001370 LINKAGE SECTION.                                                 00137000
001380 01  DFHCOMMAREA.                                                 00138000
000000 COPY MISCNT00      REPLACING                                     00139000
001400             ==:MICNT:== BY ==RPQUA00==.                          00140000
000000 COPY RPSQUA00.                                                   00141000
001420*01  SLW096-2023RECORDS.                                          00142000
000000 COPY SLW096L.                                                    00143000
001440******************************************************************00144000
001450 PROCEDURE DIVISION.                                              00145000
001460******************************************************************00146000
001470 ENTRY-ROUTINE SECTION.                                           00147000
001480 ER-START.                                                        00148000
001490     MOVE 'RPLQUA00' TO SR-APIPROGLIT.                            00149000
001500     MOVE 'RPLQUA00' TO RPQUA00-ABPROGID.                         00150000
001510     PERFORM CICS-HANDLE-CONDITION.                               00151000
001520     IF EIBCALEN IS EQUAL TO +0                                   00152000
001530         MOVE WS-AB2000 TO RPQUA00-ABORT                          00153000
001540         MOVE WS-TR0001 TO RPQUA00-ABTRACE                        00154000
001550         GO TO CICS-RETURN.                                       00155000
001560     MOVE ZERO TO RPQUA00-MSGNBR.                                 00156000
001570     MOVE SPACE TO WS-FUNCTION.                                   00157000
001580     MOVE RPQUA00-FILEOPTS TO WS-FILEOPTS.                        00158000
001590     MOVE RPQUA00-OPERID TO WS-UPD-USER.                          00159000
001600     MOVE RPQUA00-EXTERNALID TO LOG-PANELID.                      00160000
001610     MOVE RPQUA00-TERMID TO LOG-TERMID.                           00161000
001620     MOVE RPQUA00-WORKID TO LOG-WORKID.                           00162000
001630     MOVE RPQUA00-TRANSTART TO LOG-TRANSTART.                     00163000
001640     MOVE RPQUA00-APPLSEQ TO LOG-APPLSEQ.                         00164000
000000 COPY SLP094.                                                     00165000
001660     GO TO VERIFY-KEY.                                            00166000
001670 ER-EXIT.                                                         00167000
001680     EXIT.                                                        00168000
001690******************************************************************00169000
001700 CICS-HANDLE-CONDITION SECTION.                                   00170000
000000 COPY SLP702.                                                     00171000
001720     MOVE WS-AB2033 TO RPQUA00-ABORT.                             00172000
001730     MOVE WS-TR0002 TO RPQUA00-ABTRACE.                           00173000
001740     GO TO CICS-RETURN.                                           00174000
001750 CHC-EXIT.                                                        00175000
001760     EXIT.                                                        00176000
001770******************************************************************00177000
001780 VERIFY-KEY SECTION.                                              00178000
001790 VK-START.                                                        00179000
001800     MOVE ZERO TO COM-ABORT.                                      00180000
001810     MOVE ZERO TO RPQUA00-ABORT.                                  00181000
001820     MOVE ZERO TO RPQUA00-MSGNBR.                                 00182000
001830     MOVE SPACES TO RPQUA00-FUNCTION.                             00183000
001840     MOVE RPQUA00-DATE TO WS-CURDATE.                             00184000
001850     MOVE WS-CURMM TO WS-PDATE-MM.                                00185000
001860     MOVE WS-CURDD TO WS-PDATE-DD.                                00186000
001870     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00187000
001880     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00188000
001890 VK-SECURITY.                                                     00189000
001900     IF RPQUA00-APIFUNC IS NOT EQUAL TO 'VKL'                     00190000
001910         GO TO VK-EXIT.                                           00191000
001920     MOVE RPQUA00-UPDATE TO SR-OPDUPDATE.                         00192000
001930     MOVE RPQUA00-KEY-INST TO SR-OPDINST.                         00193000
001940     MOVE RPQUA00-OPERID TO SR-OPDOPERID.                         00194000
001950     MOVE RPQUA00-MODELID TO SR-OPDMODELID.                       00195000
001960     MOVE RPQUA00-EXTERNALID TO SR-OPDTRANCODE.                   00196000
001970     MOVE RPQUA00-APPL TO SR-OPDAPPL.                             00197000
001980     MOVE RPQUA00-SECALT TO SR-OPDSECALT.                         00198000
001990     MOVE RPQUA00-FUNC TO SR-OPDFUNC.                             00199000
002000     PERFORM OPERATOR-DIALOG-SECURITY.                            00200000
002010     MOVE SR-OPDUPDATE TO RPQUA00-UPDATE.                         00201000
002020     IF SR-OPDMSGNBR IS NOT EQUAL TO ZEROS                        00202000
002030         MOVE SR-OPDMSGNBR TO RPQUA00-MSGNBR                      00203000
002040         GO TO VK-RETURN.                                         00204000
002050     MOVE ZERO TO RPQUA00-OCCUR.                                  00205000
002060 VK-CHECK.                                                        00206000
002070     MOVE SPACES TO RPQUA00-DATA-GRP.                             00207000
002080     IF RPQUA00-KEY-IDNUMBER IS NOT GREATER THAN ZERO             00208000
002090         OR RPQUA00-KEY-IDNUMBER IS NOT NUMERIC                   00209000
002100         GO TO VK-QUA.                                            00210000
002110     PERFORM LOCATE-IDNUMBER-BY-APPL.                             00211000
002120     IF WS-FUNCTION IS EQUAL TO 'N'                               00212000
002130         GO TO VK-RETURN.                                         00213000
002140     PERFORM QUA-GET-GTEQ.                                        00214000
002150     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00215000
002160         OR RPQUA-IDNUMBER IS NOT EQUAL TO RPQUA00-KEY-IDNUMBER   00216000
002170         GO TO VK-RETURN.                                         00217000
002180     MOVE +0001 TO WS-SUB1.                                       00218000
002190     MOVE +0001 TO RPQUA00-OCCUR.                                 00219000
002200     MOVE RPQUA-RECORD TO RPQUA00-RECORD (WS-SUB1).               00220000
002210     GO TO VK-END.                                                00221000
002220 VK-QUA.                                                          00222000
002230     MOVE +0001 TO WS-SUB1.                                       00223000
002240     PERFORM QUA-GET-GTEQ.                                        00224000
002250     IF WS-FUNCTION IS EQUAL TO 'E'                               00225000
002260         OR RPQUA-INST IS NOT EQUAL TO RPQUA00-KEY-INST           00226000
002270         GO TO VK-RETURN.                                         00227000
002280     GO TO VK-QUANEXT.                                            00228000
002290 VK-READ-NEXT.                                                    00229000
002300     ADD +0001 TO WS-SUB1.                                        00230000
002310     PERFORM QUA-GET-NEXT.                                        00231000
002320     IF WS-FUNCTION IS EQUAL TO 'E'                               00232000
002330         OR RPQUA-INST IS NOT EQUAL TO RPQUA00-KEY-INST           00233000
002340         GO TO VK-END.                                            00234000
002350 VK-QUANEXT.                                                      00235000
002360     IF WS-SUB1 IS GREATER THAN WS-MAX-PANEL-ENTRIES              00236000
002370         GO TO VK-END.                                            00237000
002380     MOVE RPQUA-RECORD TO RPQUA00-RECORD (WS-SUB1).               00238000
002390     ADD +1 TO RPQUA00-OCCUR.                                     00239000
002400     GO TO VK-READ-NEXT.                                          00240000
002410 VK-RETURN.                                                       00241000
002420     IF RPQUA00-MSGNBR IS EQUAL TO ZEROS                          00242000
002430         MOVE 500004 TO RPQUA00-MSGNBR.                           00243000
002440     MOVE 'E' TO RPQUA00-RETURN.                                  00244000
002450 VK-END.                                                          00245000
002460     PERFORM SET-RPQUA00-RETURN.                                  00246000
002470     GO TO CICS-RETURN.                                           00247000
002480 VK-EXIT.                                                         00248000
002490     EXIT.                                                        00249000
002500******************************************************************00250000
002510 EDIT-MESSAGE SECTION.                                            00251000
002520 EM-START.                                                        00252000
002530     MOVE ZEROS TO WS-SUB1.                                       00253000
002540     PERFORM CHECK-FOR-ERRORS.                                    00254000
002550     IF WS-ERROR-INDICATOR IS EQUAL TO 'Y'                        00255000
002560         OR RPQUA00-APIFUNC IS NOT EQUAL TO 'UPD'                 00256000
002570         OR WS-UPDATE-QUA IS NOT EQUAL TO 'Y'                     00257000
002580         GO TO EM-EDIT-COMPLETE.                                  00258000
002590     MOVE ZEROS TO WS-SUB1.                                       00259000
002600 EM-LOOP.                                                         00260000
002610     ADD +0001 TO WS-SUB1.                                        00261000
002620     IF WS-SUB1 IS GREATER THAN +0007                             00262000
002630         GO TO EM-EDIT-COMPLETE.                                  00263000
002640     IF RPQUA00-DEL (WS-SUB1) IS NOT GREATER THAN SPACES          00264000
002650         GO TO EM-LOOP.                                           00265000
002660     PERFORM DELETE-QUA-RECORD.                                   00266000
002670     GO TO EM-LOOP.                                               00267000
002680 EM-EDIT-COMPLETE.                                                00268000
002690     IF WS-ERROR-INDICATOR IS EQUAL TO 'Y'                        00269000
002700         AND RPQUA00-MSGNBR IS EQUAL TO ZEROS                     00270000
002710         MOVE 500035 TO RPQUA00-MSGNBR.                           00271000
002720     IF WS-ERROR-INDICATOR IS EQUAL TO 'Y'                        00272000
002730         OR RPQUA00-APIFUNC IS EQUAL TO 'EDT'                     00273000
002740         MOVE 'EDT' TO RPQUA00-APIFUNC                            00274000
002750         PERFORM SET-RPQUA00-RETURN                               00275000
002760         GO TO CICS-RETURN.                                       00276000
002770 EM-LOAD-COMPLETE.                                                00277000
002780     PERFORM SCAN-QUALIFICATION.                                  00278000
002790     PERFORM SET-RPQUA00-RETURN.                                  00279000
002800     GO TO CICS-RETURN.                                           00280000
002810 EM-EXIT.                                                         00281000
002820     EXIT.                                                        00282000
002830******************************************************************00283000
002840 CHECK-FOR-ERRORS SECTION.                                        00284000
002850 CFE-START.                                                       00285000
002860     MOVE +0008 TO WS-SUB1.                                       00286000
002870 CFE-EDIT-LIST-LOOP.                                              00287000
002880     SUBTRACT +1 FROM WS-SUB1.                                    00288000
002890     IF WS-SUB1 IS LESS THAN +1                                   00289000
002900         GO TO CFE-EXIT.                                          00290000
002910     IF RPQUA00-DEL-DCHG (WS-SUB1) IS EQUAL TO SPACES             00291000
002920         GO TO CFE-EDIT-LIST-LOOP.                                00292000
002930     IF RPQUA00-DEL (WS-SUB1) IS EQUAL TO SPACES                  00293000
002940         GO TO CFE-EDIT-LIST-LOOP.                                00294000
002950     IF RPQUA00-DEL (WS-SUB1) IS EQUAL TO 'D'                     00295000
002960         MOVE 'Y' TO WS-UPDATE-QUA                                00296000
002970         GO TO CFE-EDIT-LIST-LOOP.                                00297000
002980 CFE-ERROR.                                                       00298000
002990     MOVE 'E' TO RPQUA00-DEL-DCHG (WS-SUB1).                      00299000
003000     MOVE 'Y' TO WS-ERROR-INDICATOR.                              00300000
003010     GO TO CFE-EDIT-LIST-LOOP.                                    00301000
003020 CFE-EXIT.                                                        00302000
003030     EXIT.                                                        00303000
003040******************************************************************00304000
003050 SCAN-QUALIFICATION SECTION.                                      00305000
003060 SQ-START.                                                        00306000
003070     MOVE SPACES TO RPQUA00-DATA-GRP.                             00307000
003080     MOVE SPACES TO RPQUA00-DEL-GRP.                              00308000
003090     MOVE +1 TO WS-SUB1.                                          00309000
003100     MOVE ZERO TO RPQUA00-OCCUR.                                  00310000
003110     PERFORM QUA-GET-GTEQ.                                        00311000
003120     GO TO SQ-CONTINUE.                                           00312000
003130 SQ-GET-NEXT.                                                     00313000
003140     IF WS-SUB1 IS GREATER THAN WS-MAX-PANEL-ENTRIES              00314000
003150         GO TO SQ-EXIT.                                           00315000
003160     PERFORM QUA-GET-NEXT.                                        00316000
003170 SQ-CONTINUE.                                                     00317000
003180     IF WS-FUNCTION IS EQUAL TO 'E'                               00318000
003190         GO TO SQ-EXIT.                                           00319000
003200     IF RPQUA-INST IS NOT EQUAL TO RPQUA00-KEY-INST               00320000
003210         GO TO SQ-EXIT.                                           00321000
003220 SQ-CHECK-RELATIONSHIP.                                           00322000
003230     MOVE RPQUA-RECORD TO RPQUA00-RECORD (WS-SUB1).               00323000
003240     ADD +1 TO WS-SUB1.                                           00324000
003250     ADD +1 TO RPQUA00-OCCUR.                                     00325000
003260     GO TO SQ-GET-NEXT.                                           00326000
003270 SQ-EXIT.                                                         00327000
003280     EXIT.                                                        00328000
003290******************************************************************00329000
003300 SET-RPQUA00-RETURN SECTION.                                      00330000
003310 SCR-START.                                                       00331000
003320     IF RPQUA00-OCCUR IS EQUAL TO ZERO                            00332000
003330         MOVE '1' TO RPQUA00-SELECT-RTN                           00333000
003340         GO TO SCR-EXIT.                                          00334000
003350     IF RPQUA00-OCCUR IS LESS THAN WS-MAX-PANEL-ENTRIES           00335000
003360         MOVE '2' TO RPQUA00-SELECT-RTN                           00336000
003370         GO TO SCR-EXIT.                                          00337000
003380     IF RPQUA00-OCCUR IS GREATER THAN WS-MAX-PANEL-ENTRIES        00338000
003390         OR RPQUA00-OCCUR IS EQUAL TO WS-MAX-PANEL-ENTRIES        00339000
003400         MOVE '3' TO RPQUA00-SELECT-RTN.                          00340000
003410 SCR-EXIT.                                                        00341000
003420     EXIT.                                                        00342000
003430******************************************************************00343000
003440 LOCATE-IDNUMBER-BY-APPL SECTION.                                 00344000
003450 LIBA-START.                                                      00345000
003460     MOVE ZERO TO WS-SUB1.                                        00346000
003470     MOVE RPQUA00-KEY-INST TO MIM-2023KINST.                      00347000
003480     MOVE 'RP' TO MIM-2023KPRODCODE.                              00348000
003490     MOVE RPQUA00-INST-OPT-1 TO SLW096-BANKS.                     00349000
003500     PERFORM SLP096-GET-2023-RECORD.                              00350000
003510     IF SLW096-FUNCTION IS EQUAL TO SPACES                        00351000
003520         MOVE MIM-2023KPRODCODE TO WS-RP-PRODCODE                 00352000
003530         GO TO LIBA-READ-IDX.                                     00353000
003540 LIBA-FIND-ACT-LOOP.                                              00354000
003550     ADD +1 TO WS-SUB1.                                           00355000
003560     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00356000
003570         MOVE 'N' TO WS-FUNCTION                                  00357000
003580         GO TO LIBA-EXIT.                                         00358000
003590     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00359000
003600         IS NOT EQUAL TO RPQUA00-APPL                             00360000
003610         GO TO LIBA-FIND-ACT-LOOP.                                00361000
003620     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO WS-RP-PRODCODE.       00362000
003630 LIBA-READ-IDX.                                                   00363000
003640     MOVE RPQUA00-KEY-INST TO RPIDX-INST.                         00364000
003650     MOVE WS-RP-PRODCODE TO RPIDX-PRODCODE.                       00365000
003660     MOVE RPQUA00-KEY-IDNUMBER TO RPIDX-IDNUMBER.                 00366000
003670     PERFORM RPS-IDX-GET-REQUEST.                                 00367000
003680     IF WS-FUNCTION IS EQUAL TO 'N'                               00368000
003690         GO TO LIBA-EXIT.                                         00369000
003700     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00370000
003710         MOVE WS-AB6310 TO RPQUA00-ABORT                          00371000
003720         MOVE WS-TR0003 TO RPQUA00-ABTRACE                        00372000
003730         GO TO CICS-ABORT-EXIT.                                   00373000
003740     MOVE RPIDX-ACCT2-KEY TO RPQUA00-KEY-RECORD.                  00374000
003750 LIBA-EXIT.                                                       00375000
003760     EXIT.                                                        00376000
003770******************************************************************00377000
003780 QUA-GET-GTEQ SECTION.                                            00378000
003790 QUA-GG-START.                                                    00379000
003800     MOVE RPQUA00-KEY-RECORD TO RPQUA-GRP-KEY.                    00380000
003810     PERFORM RPS-QUA-GET-GE-REQUEST.                              00381000
003820     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00382000
003830         AND WS-FUNCTION IS NOT EQUAL TO 'E'                      00383000
003840         MOVE WS-AB6325 TO RPQUA00-ABORT                          00384000
003850         MOVE WS-TR0004 TO RPQUA00-ABTRACE                        00385000
003860         GO TO CICS-RETURN.                                       00386000
003870 QUA-GG-EXIT.                                                     00387000
003880     EXIT.                                                        00388000
003890******************************************************************00389000
003900 QUA-GET-NEXT SECTION.                                            00390000
003910 QUA-GN-START.                                                    00391000
003920     PERFORM RPS-QUA-GET-NEXT-REQUEST.                            00392000
003930     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00393000
003940         AND WS-FUNCTION IS NOT EQUAL TO 'E'                      00394000
003950         MOVE WS-AB6325 TO RPQUA00-ABORT                          00395000
003960         MOVE WS-TR0005 TO RPQUA00-ABTRACE                        00396000
003970         GO TO CICS-RETURN.                                       00397000
003980 QUA-GN-EXIT.                                                     00398000
003990     EXIT.                                                        00399000
004000******************************************************************00400000
004010 DELETE-QUA-RECORD SECTION.                                       00401000
004020 DQUA-START.                                                      00402000
004030     INITIALIZE RPQUA-RECORD.                                     00403000
004040     MOVE RPQUA00-GRP-KEY (WS-SUB1) TO RPQUA-GRP-KEY.             00404000
004050     PERFORM RPS-QUA-GET-LOCK-REQUEST.                            00405000
004060     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00406000
004070         MOVE WS-AB6325 TO RPQUA00-ABORT                          00407000
004080         MOVE WS-TR0006 TO RPQUA00-ABTRACE                        00408000
004090         GO TO CICS-ABORT-EXIT.                                   00409000
004100     PERFORM RPS-QUA-DELETE-REQUEST.                              00410000
004110     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00411000
004120         MOVE WS-AB6325 TO RPQUA00-ABORT                          00412000
004130         MOVE WS-TR0007 TO RPQUA00-ABTRACE                        00413000
004140         GO TO CICS-ABORT-EXIT.                                   00414000
004150     MOVE 'Y' TO WS-UPDATESW.                                     00415000
004160     MOVE ZERO TO WS-SUB2.                                        00416000
004170     MOVE RPQUA-INST TO MIM-2023KINST.                            00417000
004180     MOVE 'RP' TO MIM-2023KPRODCODE.                              00418000
004190     MOVE RPQUA00-INST-OPT-1 TO SLW096-BANKS.                     00419000
004200     PERFORM SLP096-GET-2023-RECORD.                              00420000
004210     IF SLW096-FUNCTION IS EQUAL TO SPACES                        00421000
004220         MOVE MIM-2023KPRODCODE TO WS-RP-PRODCODE                 00422000
004230         GO TO DQUA-IDX.                                          00423000
004240 DQUA-LOOP.                                                       00424000
004250     ADD +1 TO WS-SUB2.                                           00425000
004260     IF WS-SUB2 IS GREATER THAN SLW096-2023-COUNT                 00426000
004270         MOVE WS-AB3051 TO RPQUA00-ABORT                          00427000
004280         MOVE WS-TR0008 TO RPQUA00-ABTRACE                        00428000
004290         GO TO CICS-ABORT-EXIT.                                   00429000
004300     IF SLW096-2023INTAPPL211 (WS-SUB2)                           00430000
004310         IS NOT EQUAL TO RPQUA00-APPL                             00431000
004320         GO TO DQUA-LOOP.                                         00432000
004330     MOVE SLW096-2023KPRODCODE (WS-SUB2) TO WS-RP-PRODCODE.       00433000
004340 DQUA-IDX.                                                        00434000
004350     MOVE RPQUA-INST TO RPIDX-INST.                               00435000
004360     MOVE WS-RP-PRODCODE TO RPIDX-PRODCODE.                       00436000
004370     MOVE RPQUA-IDNUMBER TO RPIDX-IDNUMBER.                       00437000
004380     PERFORM RPS-IDX-GET-LOCK-REQUEST.                            00438000
004390     IF WS-FUNCTION IS EQUAL TO 'N'                               00439000
004400         GO TO DQUA-REL.                                          00440000
004410     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00441000
004420         MOVE WS-AB6310 TO RPQUA00-ABORT                          00442000
004430         MOVE WS-TR0009 TO RPQUA00-ABTRACE                        00443000
004440         GO TO CICS-ABORT-EXIT.                                   00444000
004450     PERFORM RPS-IDX-DELETE-REQUEST.                              00445000
004460     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00446000
004470         MOVE WS-AB6310 TO RPQUA00-ABORT                          00447000
004480         MOVE WS-TR0010 TO RPQUA00-ABTRACE                        00448000
004490         GO TO CICS-ABORT-EXIT.                                   00449000
004500     MOVE 'Y' TO WS-UPDATESW.                                     00450000
004510 DQUA-REL.                                                        00451000
004520     IF RPQUA-ADDON-ACCTS IS EQUAL TO ZEROS                       00452000
004530         GO TO DQUA-CRW.                                          00453000
004540     INITIALIZE RPREL-RECORD.                                     00454000
004550     MOVE ZEROS TO RPREL-GRP-KEY.                                 00455000
004560     MOVE RPQUA-GRP-KEY TO RPREL-ACCT1-GRP.                       00456000
004570     PERFORM RPS-REL-GET-GE-LOCK-REQUEST.                         00457000
004580     GO TO DQUA-REL-TEST.                                         00458000
004590 DQUA-REL-NEXT.                                                   00459000
004600     PERFORM RPS-REL-GET-NEXT-LOCK-REQUEST.                       00460000
004610 DQUA-REL-TEST.                                                   00461000
004620     IF WS-FUNCTION IS EQUAL TO 'N'                               00462000
004630         OR WS-FUNCTION IS EQUAL TO 'E'                           00463000
004640         GO TO DQUA-EXIT.                                         00464000
004650     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00465000
004660         MOVE WS-AB6330 TO RPQUA00-ABORT                          00466000
004670         MOVE WS-TR0011 TO RPQUA00-ABTRACE                        00467000
004680         GO TO CICS-ABORT-EXIT.                                   00468000
004690     IF RPREL-ACCT1-GRP IS NOT EQUAL TO RPQUA-GRP-KEY             00469000
004700         PERFORM RPS-REL-UNLOCK-REQUEST                           00470000
004710         GO TO DQUA-EXIT.                                         00471000
004720     PERFORM RPS-REL-DELETE-REQUEST.                              00472000
004730     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00473000
004740         MOVE WS-AB6330 TO RPQUA00-ABORT                          00474000
004750         MOVE WS-TR0012 TO RPQUA00-ABTRACE                        00475000
004760         GO TO CICS-ABORT-EXIT.                                   00476000
004770     GO TO DQUA-REL-NEXT.                                         00477000
004780 DQUA-CRW.                                                        00478000
004790     IF RPQUA-CRW-ACCOUNT IS EQUAL TO SPACES                      00479000
004800         GO TO DQUA-EXIT.                                         00480000
004810     INITIALIZE RPCRW-RECORD.                                     00481000
004820     MOVE RPQUA-GRP-KEY TO RPCRW-ACCT1-GRP.                       00482000
004830     MOVE RPQUA-CRW-INST TO RPCRW-INST2.                          00483000
004840     MOVE RPQUA-CRW-PRODCODE TO RPCRW-PRODCODE2.                  00484000
004850     MOVE RPQUA-CRW-ACCOUNT TO RPCRW-ACCOUNT2.                    00485000
004860     PERFORM RPS-CRW-GET-LOCK-REQUEST.                            00486000
004870     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00487000
004880         MOVE WS-AB6350 TO RPQUA00-ABORT                          00488000
004890         MOVE WS-TR0013 TO RPQUA00-ABTRACE                        00489000
004900         GO TO CICS-ABORT-EXIT.                                   00490000
004910     PERFORM RPS-CRW-DELETE-REQUEST.                              00491000
004920     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00492000
004930         MOVE WS-AB6350 TO RPQUA00-ABORT                          00493000
004940         MOVE WS-TR0014 TO RPQUA00-ABTRACE                        00494000
004950         GO TO CICS-ABORT-EXIT.                                   00495000
004960 DQUA-EXIT.                                                       00496000
004970     EXIT.                                                        00497000
004980******************************************************************00498000
000000 COPY RPPCRWA.                                                    00499000
005000******************************************************************00500000
000000 COPY RPPIDXA.                                                    00501000
005020******************************************************************00502000
000000 COPY RPPQUAA.                                                    00503000
005040******************************************************************00504000
000000 COPY RPPRELA.                                                    00505000
005060******************************************************************00506000
005070 MIC-MST-API SECTION.                                             00507000
000000 COPY MIPMSTA.                                                    00508000
005090******************************************************************00509000
005100 SLP096-GET-2023-RECORD SECTION.                                  00510000
000000 COPY SLP096.                                                     00511000
005120******************************************************************00512000
005130 OPERATOR-DIALOG-SECURITY SECTION.                                00513000
000000 COPY SRP079.                                                     00514000
005150******************************************************************00515000
005160 CICS-ABORT-EXIT SECTION.                                         00516000
005170 CAE-START.                                                       00517000
005180     GO TO CICS-RETURN.                                           00518000
005190 CAE-EXIT.                                                        00519000
005200     EXIT.                                                        00520000
005210******************************************************************00521000
005220 CICS-RETURN SECTION.                                             00522000
005230     IF COM-ABORT IS NOT EQUAL TO ZERO                            00523000
005240         MOVE COM-ABORT TO RPQUA00-ABORT.                         00524000
005250     IF RPQUA00-ABORT IS NOT EQUAL TO ZERO                        00525000
005260         AND WS-UPDATESW IS EQUAL TO 'Y'                          00526000
005270         MOVE 'Y' TO RPQUA00-ABTYPE.                              00527000
005280     IF RPQUA00-ABORT IS NOT EQUAL TO ZERO                        00528000
005290         MOVE WS-FUNCTION TO RPQUA00-FUNCTION                     00529000
005300         MOVE SRB-BMDB TO RPQUA00-SRBMDB                          00530000
005310         MOVE EIBFN TO RPQUA00-ABEIBFN                            00531000
005320         MOVE EIBRESP TO RPQUA00-ABEIBRESP                        00532000
005330         MOVE EIBRESP2 TO RPQUA00-ABEIBRESP2                      00533000
005340         MOVE EIBRCODE TO RPQUA00-ABEIBRCODE.                     00534000
005350     IF RPQUA00-ABTYPE IS NOT EQUAL TO 'Y'                        00535000
005360         PERFORM GLOBAL-CLOSE.                                    00536000
000000 COPY SLP709.                                                     00537000
005380******************************************************************00538000
005390 GLOBAL-CLOSE SECTION.                                            00539000
005400 GC-START.                                                        00540000
005410     IF RPQUA00-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  00541000
005420         PERFORM RPS-QUA-GLOBAL-CLOSE-REQUEST.                    00542000
005430 GC-EXIT.                                                         00543000
005440     EXIT.                                                        00544000
005450******************************************************************00545000
