000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLTRM01.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLTRM01 - TRANSACTION ACCUMULATOR INQUIRY MODULE           *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW079-AREAS.                                                00016000
000000 COPY SRW079.                                                     00017000
000180 01  SRW105-AREAS.                                                00018000
000000 COPY SRW105.                                                     00019000
000200*01  BICRSRB.                                                     00020000
000000 COPY BICRSRB.                                                    00021000
000220*01  BICRPSB.                                                     00022000
000000 COPY BICRPSB.                                                    00023000
000240*01  BICRVERB.                                                    00024000
000000 COPY BICRVERB.                                                   00025000
000260*01  BICRSTAT.                                                    00026000
000000 COPY BICRSTAT.                                                   00027000
000280*01  BICRDBS.                                                     00028000
000000 COPY BICRDBS.                                                    00029000
000300*01  BICRLOG.                                                     00030000
000000 COPY BICRLOG.                                                    00031000
000320 01  SRW710-AREAS.                                                00032000
000000 COPY SRW710.                                                     00033000
000340 01  RPW7110-AREAS.                                               00034000
000000 COPY RPW7110.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  COM-ABORT               PIC S9(04)      COMP.            00037000
000380     03  WS-TASUB1               PIC S9(04)      COMP             00038000
000390                                                 VALUE +0000.     00039000
000400     03  WS-TASUB2               PIC S9(04)      COMP             00040000
000410                                                 VALUE +0000.     00041000
000420     03  WS-TRAN-VAL-SW          PIC 9(01)       VALUE ZEROS.     00042000
000430     03  WS-SUB1                 PIC S9(04)      COMP             00043000
000440                                                 VALUE +0000.     00044000
000450     03  WS-SUB2                 PIC S9(04)      COMP             00045000
000460                                                 VALUE +0000.     00046000
000470     03  WS-RP-PRODCODE          PIC X(06)       VALUE 'RP    '.  00047000
000480     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00048000
000490     03  FILLER          REDEFINES WS-CURDATE.                    00049000
000500         05  WS-CURMM            PIC 9(02).                       00050000
000510         05  WS-CURDD            PIC 9(02).                       00051000
000520         05  WS-CURYYYY          PIC 9(04).                       00052000
000530     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00053000
000540     03  FILLER          REDEFINES WS-PDATE.                      00054000
000550         05  WS-PDATE-YYYY       PIC 9(04).                       00055000
000560         05  WS-PDATE-MM         PIC 9(02).                       00056000
000570         05  WS-PDATE-DD         PIC 9(02).                       00057000
000580     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00058000
000590     03  FILLER          REDEFINES WS-PDATE2.                     00059000
000600         05  WS-PDATE2-YYYY      PIC 9(04).                       00060000
000610         05  WS-PDATE2-MM        PIC 9(02).                       00061000
000620         05  WS-PDATE2-DD        PIC 9(02).                       00062000
000630     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00063000
000640                                                 VALUE ZERO.      00064000
000650     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00065000
000660                                                 VALUE ZERO.      00066000
000670     03  WS-ERRORMODEL           PIC X(01)       VALUE 'N'.       00067000
000680     03  WS-SAVEMASTERGROUP.                                      00068000
000690         05  WS-SAVEMSTINST      PIC 9(04).                       00069000
000700         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00070000
000710         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00071000
000720         05  WS-SAVEMSTMODEL     PIC X(10).                       00072000
000730*----------------------------------------------------------------*00073000
000740 01  MIWPRI-AREAS.                                                00074000
000000 COPY MIWPRI.                                                     00075000
000760 01  MIWMSTA-AREAS.                                               00076000
000000 COPY MIWMSTA.                                                    00077000
000780 01  MIMST-RECORD.                                                00078000
000000 COPY MISMST.                                                     00079000
000800 01  MI2023-RECORD.                                               00080000
000000 COPY MIS2023A.                                                   00081000
000820 01  MI7101-RECORD.                                               00082000
000000 COPY MIS7101.                                                    00083000
000840 01  MI7110-RECORD.                                               00084000
000000 COPY MIS7110.                                                    00085000
000860*----------------------------------------------------------------*00086000
000870 01  RPWPRI-AREAS.                                                00087000
000000 COPY RPWPRI.                                                     00088000
000890 01  RPWMST-AREA.                                                 00089000
000000 COPY RPWMSTA.                                                    00090000
000910 01  RPMST-RECORD.                                                00091000
000000 COPY RPSMST.                                                     00092000
000930 01  RPWIDX-AREA.                                                 00093000
000000 COPY RPWIDXA.                                                    00094000
000950 01  RPIDX-RECORD.                                                00095000
000000 COPY RPSIDX.                                                     00096000
000970 01  RPWTRM-AREA.                                                 00097000
000000 COPY RPWTRMA.                                                    00098000
000990 01  RPTRM-RECORD.                                                00099000
000000 COPY RPSTRM.                                                     00100000
001010*----------------------------------------------------------------*00101000
001020 01  WS-TRACECODES.                                               00102000
001030     03  WS-TR0001               PIC S9(04)      COMP             00103000
001040                                                 VALUE +0001.     00104000
001050     03  WS-TR0002               PIC S9(04)      COMP             00105000
001060                                                 VALUE +0002.     00106000
001070     03  WS-TR0003               PIC S9(04)      COMP             00107000
001080                                                 VALUE +0003.     00108000
001090     03  WS-TR0004               PIC S9(04)      COMP             00109000
001100                                                 VALUE +0004.     00110000
001110     03  WS-TR0005               PIC S9(04)      COMP             00111000
001120                                                 VALUE +0005.     00112000
001130     03  WS-TR0006               PIC S9(04)      COMP             00113000
001140                                                 VALUE +0006.     00114000
001150 01  WS-ABORTCODES.                                               00115000
001160     03  WS-AB2000               PIC S9(04)      COMP             00116000
001170                                                 VALUE +2000.     00117000
001180     03  WS-AB2033               PIC S9(04)      COMP             00118000
001190                                                 VALUE +2033.     00119000
001200     03  WS-AB3051               PIC S9(04)      COMP             00120000
001210                                                 VALUE +3051.     00121000
001220     03  WS-AB6310               PIC S9(04)      COMP             00122000
001230                                                 VALUE +6310.     00123000
001240     03  WS-AB6320               PIC S9(04)      COMP             00124000
001250                                                 VALUE +6320.     00125000
001260     03  WS-AB6330               PIC S9(04)      COMP             00126000
001270                                                 VALUE +6330.     00127000
001280     03  WS-AB6335               PIC S9(04)      COMP             00128000
001290                                                 VALUE +6335.     00129000
001300     03  WS-AB6355               PIC S9(04)      COMP             00130000
001310                                                 VALUE +6355.     00131000
001320******************************************************************00132000
001330 01  SLW096-AREAS.                                                00133000
000000 COPY SLW096.                                                     00134000
001350******************************************************************00135000
001360 LINKAGE SECTION.                                                 00136000
001370 01  DFHCOMMAREA.                                                 00137000
000000 COPY MISCNT00      REPLACING                                     00138000
001390             ==:MICNT:== BY ==RPTRM01==.                          00139000
000000 COPY RPSTRM01.                                                   00140000
001410*01  SLW096-2023RECORDS.                                          00141000
000000 COPY SLW096L.                                                    00142000
001430******************************************************************00143000
001440 PROCEDURE DIVISION.                                              00144000
001450******************************************************************00145000
001460 ENTRY-ROUTINE SECTION.                                           00146000
001470 ER-START.                                                        00147000
001480     MOVE 'RPLTRM01' TO SR-APIPROGLIT.                            00148000
001490     MOVE 'RPLTRM01' TO RPTRM01-ABPROGID.                         00149000
001500     PERFORM CICS-HANDLE-CONDITION.                               00150000
001510     IF EIBCALEN IS EQUAL TO +0                                   00151000
001520         MOVE WS-AB2000 TO RPTRM01-ABORT                          00152000
001530         MOVE WS-TR0001 TO RPTRM01-ABTRACE                        00153000
001540         GO TO CICS-RETURN.                                       00154000
001550     MOVE ZERO TO RPTRM01-MSGNBR.                                 00155000
001560     MOVE SPACE TO WS-FUNCTION.                                   00156000
001570     MOVE RPTRM01-FILEOPTS TO WS-FILEOPTS.                        00157000
001580     MOVE RPTRM01-OPERID TO WS-UPD-USER.                          00158000
001590     MOVE RPTRM01-EXTERNALID TO LOG-PANELID.                      00159000
001600     MOVE RPTRM01-TERMID TO LOG-TERMID.                           00160000
001610     MOVE RPTRM01-WORKID TO LOG-WORKID.                           00161000
001620     MOVE RPTRM01-TRANSTART TO LOG-TRANSTART.                     00162000
001630     MOVE RPTRM01-APPLSEQ TO LOG-APPLSEQ.                         00163000
000000 COPY SLP094.                                                     00164000
001650     GO TO VERIFY-KEY.                                            00165000
001660 ER-EXIT.                                                         00166000
001670     EXIT.                                                        00167000
001680******************************************************************00168000
001690 CICS-HANDLE-CONDITION SECTION.                                   00169000
000000 COPY SLP702.                                                     00170000
001710     MOVE WS-AB2033 TO RPTRM01-ABORT.                             00171000
001720     MOVE WS-TR0002 TO RPTRM01-ABTRACE.                           00172000
001730     GO TO CICS-RETURN.                                           00173000
001740 CHC-EXIT.                                                        00174000
001750     EXIT.                                                        00175000
001760******************************************************************00176000
001770 VERIFY-KEY SECTION.                                              00177000
001780 VK-START.                                                        00178000
001790     MOVE ZERO TO COM-ABORT.                                      00179000
001800     MOVE ZERO TO RPTRM01-ABORT.                                  00180000
001810     MOVE ZERO TO RPTRM01-MSGNBR.                                 00181000
001820     MOVE SPACES TO RPTRM01-FUNCTION.                             00182000
001830     MOVE RPTRM01-DATE TO WS-CURDATE.                             00183000
001840     MOVE WS-CURMM TO WS-PDATE-MM.                                00184000
001850     MOVE WS-CURDD TO WS-PDATE-DD.                                00185000
001860     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00186000
001870     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00187000
001880 VK-NBR-OCCURS.                                                   00188000
001890     IF RPTRM01-NBR-OCCURS-DCHG IS EQUAL TO 'N'                   00189000
001900         OR RPTRM01-NBR-OCCURS-DCHG IS EQUAL TO 'E'               00190000
001910         MOVE 000002 TO RPTRM01-MSGNBR                            00191000
001920         MOVE 'E' TO RPTRM01-NBR-OCCURS-DCHG                      00192000
001930         GO TO VK-ERROR.                                          00193000
001940     IF RPTRM01-NBR-OCCURS IS NOT NUMERIC                         00194000
001950         OR RPTRM01-NBR-OCCURS IS EQUAL TO ZEROS                  00195000
001960         MOVE +12 TO RPTRM01-NBR-OCCURS.                          00196000
001970     IF RPTRM01-NBR-OCCURS IS GREATER THAN +12                    00197000
001980         OR RPTRM01-NBR-OCCURS IS LESS THAN ZEROS                 00198000
001990         MOVE +12 TO RPTRM01-NBR-OCCURS.                          00199000
002000 VK-SELECTKEY.                                                    00200000
002010     IF RPTRM01-SK-INST-DCHG IS EQUAL TO 'N'                      00201000
002020         OR RPTRM01-SK-INST-DCHG IS EQUAL TO 'E'                  00202000
002030         MOVE 000002 TO RPTRM01-MSGNBR                            00203000
002040         MOVE 'E' TO RPTRM01-SK-INST-DCHG                         00204000
002050         GO TO VK-ERROR.                                          00205000
002060     IF RPTRM01-SK-INST IS NOT NUMERIC                            00206000
002070         OR RPTRM01-SK-INST IS EQUAL TO ZEROS                     00207000
002080         MOVE 000002 TO RPTRM01-MSGNBR                            00208000
002090         MOVE 'E' TO RPTRM01-SK-INST-DCHG                         00209000
002100         GO TO VK-ERROR.                                          00210000
002110     IF RPTRM01-SK-PRODCODE-DCHG IS EQUAL TO 'N'                  00211000
002120         AND RPTRM01-SK-ACCOUNT-DCHG IS EQUAL TO 'N'              00212000
002130         AND RPTRM01-SK-MODEL-DCHG IS EQUAL TO 'N'                00213000
002140         GO TO VK-IDX-SELECT.                                     00214000
002150     IF RPTRM01-SK-PRODCODE-DCHG IS EQUAL TO 'N'                  00215000
002160         OR RPTRM01-SK-PRODCODE-DCHG IS EQUAL TO 'E'              00216000
002170         MOVE 000002 TO RPTRM01-MSGNBR                            00217000
002180         MOVE 'E' TO RPTRM01-SK-PRODCODE-DCHG                     00218000
002190         GO TO VK-ERROR.                                          00219000
002200     IF RPTRM01-SK-PRODCODE IS EQUAL TO SPACES                    00220000
002210         OR RPTRM01-SK-PRODCODE IS EQUAL TO LOW-VALUES            00221000
002220         MOVE 000002 TO RPTRM01-MSGNBR                            00222000
002230         MOVE 'E' TO RPTRM01-SK-PRODCODE-DCHG                     00223000
002240         GO TO VK-ERROR.                                          00224000
002250     IF RPTRM01-SK-ACCOUNT-DCHG IS EQUAL TO 'N'                   00225000
002260         OR RPTRM01-SK-ACCOUNT-DCHG IS EQUAL TO 'E'               00226000
002270         MOVE 000002 TO RPTRM01-MSGNBR                            00227000
002280         MOVE 'E' TO RPTRM01-SK-ACCOUNT-DCHG                      00228000
002290         GO TO VK-ERROR.                                          00229000
002300     IF RPTRM01-SK-ACCOUNT IS EQUAL TO SPACES                     00230000
002310         OR RPTRM01-SK-ACCOUNT IS EQUAL TO LOW-VALUES             00231000
002320         MOVE 000002 TO RPTRM01-MSGNBR                            00232000
002330         MOVE 'E' TO RPTRM01-SK-ACCOUNT-DCHG                      00233000
002340         GO TO VK-ERROR.                                          00234000
002350     IF RPTRM01-SK-MODEL-DCHG IS EQUAL TO 'E'                     00235000
002360         MOVE 000002 TO RPTRM01-MSGNBR                            00236000
002370         MOVE 'E' TO RPTRM01-SK-MODEL-DCHG                        00237000
002380         GO TO VK-ERROR.                                          00238000
002390     IF RPTRM01-SK-MODEL-DCHG IS EQUAL TO 'N'                     00239000
002400         OR RPTRM01-SK-MODEL IS EQUAL TO LOW-VALUES               00240000
002410         MOVE SPACE TO RPTRM01-SK-MODEL.                          00241000
002420     GO TO VK-SECURITY.                                           00242000
002430 VK-IDX-SELECT.                                                   00243000
002440     IF RPTRM01-SK-IDNUMBER-DCHG IS EQUAL TO 'N'                  00244000
002450         OR RPTRM01-SK-IDNUMBER-DCHG IS EQUAL TO 'E'              00245000
002460         MOVE 000002 TO RPTRM01-MSGNBR                            00246000
002470         MOVE 'E' TO RPTRM01-SK-IDNUMBER-DCHG                     00247000
002480         MOVE 'E' TO RPTRM01-SK-PRODCODE-DCHG                     00248000
002490         MOVE 'E' TO RPTRM01-SK-ACCOUNT-DCHG                      00249000
002500         MOVE 'E' TO RPTRM01-SK-MODEL-DCHG                        00250000
002510         GO TO VK-ERROR.                                          00251000
002520     IF RPTRM01-SK-IDNUMBER IS NOT GREATER THAN ZEROS             00252000
002530         OR RPTRM01-SK-IDNUMBER IS NOT NUMERIC                    00253000
002540         MOVE 000002 TO RPTRM01-MSGNBR                            00254000
002550         MOVE 'E' TO RPTRM01-SK-IDNUMBER-DCHG                     00255000
002560         GO TO VK-ERROR.                                          00256000
002570 VK-SECURITY.                                                     00257000
002580     MOVE RPTRM01-UPDATE TO SR-OPDUPDATE.                         00258000
002590     MOVE RPTRM01-SK-INST TO SR-OPDINST.                          00259000
002600     MOVE RPTRM01-OPERID TO SR-OPDOPERID.                         00260000
002610     MOVE RPTRM01-MODELID TO SR-OPDMODELID.                       00261000
002620     MOVE RPTRM01-EXTERNALID TO SR-OPDTRANCODE.                   00262000
002630     MOVE RPTRM01-APPL TO SR-OPDAPPL.                             00263000
002640     MOVE RPTRM01-SECALT TO SR-OPDSECALT.                         00264000
002650     MOVE RPTRM01-FUNC TO SR-OPDFUNC.                             00265000
002660     PERFORM OPERATOR-DIALOG-SECURITY.                            00266000
002670     MOVE SR-OPDUPDATE TO RPTRM01-UPDATE.                         00267000
002680     IF SR-OPDMSGNBR IS NOT EQUAL TO ZEROS                        00268000
002690         MOVE SR-OPDMSGNBR TO RPTRM01-MSGNBR                      00269000
002700         GO TO VK-ERROR.                                          00270000
002710 VK-IDX.                                                          00271000
002720     INITIALIZE RPIDX-RECORD.                                     00272000
002730     IF RPTRM01-SK-IDNUMBER-DCHG IS EQUAL TO 'N'                  00273000
002740         OR RPTRM01-SK-IDNUMBER-DCHG IS EQUAL TO 'E'              00274000
002750         GO TO VK-MST.                                            00275000
002760     IF RPTRM01-SK-IDNUMBER IS NOT GREATER THAN ZEROS             00276000
002770         OR RPTRM01-SK-IDNUMBER IS NOT NUMERIC                    00277000
002780         GO TO VK-MST.                                            00278000
002790     PERFORM LOCATE-IDNUMBER-BY-APPL.                             00279000
002800     IF WS-FUNCTION IS EQUAL TO 'N'                               00280000
002810         MOVE 500004 TO RPTRM01-MSGNBR                            00281000
002820         MOVE 'E' TO RPTRM01-SK-IDNUMBER-DCHG                     00282000
002830         GO TO VK-ERROR.                                          00283000
002840     MOVE ZEROS TO RPTRM01-SK-IDNUMBER.                           00284000
002850 VK-MST.                                                          00285000
002860     MOVE SPACE TO RPTRM01-END-FILE-INST.                         00286000
002870     INITIALIZE RPTRM01-DATA-GRP.                                 00287000
002880     MOVE ALL 'N' TO RPTRM01-DATA-GRP-DCHG.                       00288000
002890     MOVE LOW-VALUES TO RPMST-GRP-KEY.                            00289000
002900     IF RPTRM01-SK-MODEL IS EQUAL TO SPACES OR                    00290000
002910         RPTRM01-SK-MODEL IS EQUAL TO LOW-VALUES                  00291000
002920         PERFORM FIND-DEFAULT-MODEL.                              00292000
002930     IF WS-ERRORMODEL IS EQUAL TO 'Y'                             00293000
002940         GO TO VK-ERROR.                                          00294000
002950     MOVE RPTRM01-SK-INST TO RPMST-INST.                          00295000
002960     MOVE RPTRM01-SK-PRODCODE TO RPMST-PRODCODE.                  00296000
002970     MOVE RPTRM01-SK-ACCOUNT TO RPMST-ACCOUNT.                    00297000
002980     MOVE RPTRM01-SK-MODEL TO RPMST-MODEL.                        00298000
002990     PERFORM RPS-MST-GET-REQUEST.                                 00299000
003000     IF WS-FUNCTION IS EQUAL TO 'N'                               00300000
003010         MOVE 500004 TO RPTRM01-MSGNBR                            00301000
003020         MOVE ZEROS TO RPTRM01-NBR-OCCURS                         00302000
003030         MOVE 'Y' TO RPTRM01-NBR-OCCURS-DCHG                      00303000
003040         MOVE 'E' TO RPTRM01-SK-INST-DCHG                         00304000
003050         MOVE 'E' TO RPTRM01-SK-PRODCODE-DCHG                     00305000
003060         MOVE 'E' TO RPTRM01-SK-ACCOUNT-DCHG                      00306000
003070         MOVE 'E' TO RPTRM01-SK-MODEL-DCHG                        00307000
003080         GO TO VK-ERROR.                                          00308000
003090     MOVE 'E' TO RPTRM01-END-FILE-INST.                           00309000
003100     MOVE RPMST-IDNUMBER TO RPTRM01-SK-IDNUMBER.                  00310000
003110 VK-7101.                                                         00311000
003120     MOVE SPACES TO MI7101-RECORD.                                00312000
003130     MOVE RPTRM01-SK-INST TO MIM-7101KINST.                       00313000
003140     MOVE +7101 TO MIM-7101KREC.                                  00314000
003150     MOVE RPMST-MODEL TO MIM-7101KMODEL.                          00315000
003160     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        00316000
003170     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00317000
003180     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00318000
003190     MOVE MI7101-RECORD TO MIMST-RECORD.                          00319000
003200     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00320000
003210     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00321000
003220         MOVE 500006 TO RPTRM01-MSGNBR                            00322000
003230         GO TO VK-ERROR.                                          00323000
003240     MOVE MIMST-RECORD TO MI7101-RECORD.                          00324000
003250     IF MIM-7101KINST IS NOT EQUAL TO RPMST-INST                  00325000
003260         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00326000
003270         OR MIM-7101KMODEL IS NOT EQUAL TO RPMST-MODEL            00327000
003280         MOVE 500006 TO RPTRM01-MSGNBR                            00328000
003290         GO TO VK-ERROR.                                          00329000
003300     IF MIM-7101TRANPROFILE IS NOT GREATER THAN SPACES            00330000
003310         OR MIM-7101TRANPROFILE-I IS EQUAL TO 'N'                 00331000
003320         MOVE 500082 TO RPTRM01-MSGNBR                            00332000
003330         GO TO VK-ERROR.                                          00333000
003340 VK-7110.                                                         00334000
003350     INITIALIZE RPTRM01-7110-DATA.                                00335000
003360     MOVE SPACES TO MI7110-RECORD.                                00336000
003370     MOVE RPTRM01-SK-INST TO MIM-7110KINST.                       00337000
003380     MOVE +7110 TO MIM-7110KREC.                                  00338000
003390     MOVE MIM-7101TRANPROFILE TO MIM-7110KTRANPROFILE.            00339000
003400     MOVE MIC-RPS-7110-PRI TO MIC-MST-REC-PRI.                    00340000
003410     MOVE MI7110-RECORD TO MIMST-RECORD.                          00341000
003420     PERFORM MIC-MST-GET-REQUEST.                                 00342000
003430     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00343000
003440         MOVE 500081 TO RPTRM01-MSGNBR                            00344000
003450         GO TO VK-ERROR.                                          00345000
003460     MOVE MIMST-RECORD TO MI7110-RECORD.                          00346000
003470     MOVE MIM-7110DESCRIPTION TO RPTRM01-7110DESCRIPTION.         00347000
003480     MOVE ZERO TO WS-SUB1.                                        00348000
003490 VK-7110-LOOP.                                                    00349000
003500     ADD +1 TO WS-SUB1.                                           00350000
003510     IF WS-SUB1 IS GREATER THAN +12                               00351000
003520         GO TO VK-TRM.                                            00352000
003530     IF MIM-7110ACCUM (WS-SUB1) IS EQUAL TO ZEROS                 00353000
003540         OR MIM-7110COND (WS-SUB1) IS EQUAL TO 'N'                00354000
003550         GO TO VK-TRM.                                            00355000
003560     MOVE MIM-7110ACCUM (WS-SUB1) TO WS-SUB2.                     00356000
003570     MOVE MIM-7110ACCUM (WS-SUB1)                                 00357000
003580         TO RPTRM01-7110ACCUM (WS-SUB1).                          00358000
003590     MOVE MIM-7110COND (WS-SUB1) TO RPTRM01-7110COND (WS-SUB1).   00359000
003600     MOVE MIM-7110REL (WS-SUB1) TO RPTRM01-7110REL (WS-SUB1).     00360000
003610     MOVE MIM-7110OPTION (WS-SUB1)                                00361000
003620         TO RPTRM01-7110OPTION (WS-SUB1).                         00362000
003630     MOVE MIM-7110COUNT (WS-SUB1) TO RPTRM01-7110COUNT (WS-SUB1). 00363000
003640     MOVE MIM-7110AMOUNT (WS-SUB1)                                00364000
003650         TO RPTRM01-7110AMOUNT (WS-SUB1).                         00365000
003660     GO TO VK-7110-LOOP.                                          00366000
003670 VK-TRM.                                                          00367000
003680     MOVE RPMST-GRP-KEY TO RPTRM-GRP-KEY.                         00368000
003690     PERFORM RPS-TRM-GET-REQUEST.                                 00369000
003700     IF WS-FUNCTION IS EQUAL TO 'N'                               00370000
003710         MOVE 500082 TO RPTRM01-MSGNBR                            00371000
003720         GO TO VK-ERROR.                                          00372000
003730     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00373000
003740         MOVE WS-AB6355 TO RPTRM01-ABORT                          00374000
003750         MOVE WS-TR0003 TO RPTRM01-ABTRACE                        00375000
003760         GO TO VK-ERROR.                                          00376000
003770 VK-STATUS.                                                       00377000
003780     MOVE RPTRM-GRACE-EXPIRATION-DATE TO RPTRM01-GRACE-EXPIRDATE. 00378000
003790     MOVE RPTRM-TRAN-INFO TO RPTRM01-TRM-DATA.                    00379000
003800     MOVE ZERO TO RPTRM01-TRAN-VAL-SW.                            00380000
003810     MOVE ZERO TO WS-TASUB1.                                      00381000
003820     MOVE ZERO TO WS-TASUB2.                                      00382000
003830     PERFORM TRANSACTION-VALIDATION.                              00383000
003840     MOVE WS-TRAN-VAL-SW TO RPTRM01-TRAN-VAL-SW.                  00384000
003850     GO TO VK-END.                                                00385000
003860 VK-ERROR.                                                        00386000
003870     MOVE 'E' TO RPTRM01-RETURN.                                  00387000
003880 VK-END.                                                          00388000
003890     GO TO CICS-RETURN.                                           00389000
003900 VK-EXIT.                                                         00390000
003910     EXIT.                                                        00391000
003920******************************************************************00392000
003930 LOCATE-IDNUMBER-BY-APPL SECTION.                                 00393000
003940 LIBA-START.                                                      00394000
003950     MOVE ZERO TO WS-SUB1.                                        00395000
003960     MOVE RPTRM01-SK-INST TO MIM-2023KINST.                       00396000
003970     MOVE 'RP' TO MIM-2023KPRODCODE.                              00397000
003980     MOVE RPTRM01-INST-OPT-1 TO SLW096-BANKS.                     00398000
003990     PERFORM SLP096-GET-2023-RECORD.                              00399000
004000     IF SLW096-FUNCTION IS EQUAL TO SPACES                        00400000
004010         MOVE MIM-2023KPRODCODE TO WS-RP-PRODCODE                 00401000
004020         GO TO LIBA-READ-IDX.                                     00402000
004030 LIBA-FIND-ACT-LOOP.                                              00403000
004040     ADD +1 TO WS-SUB1.                                           00404000
004050     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00405000
004060         MOVE 'N' TO WS-FUNCTION                                  00406000
004070         GO TO LIBA-EXIT.                                         00407000
004080     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00408000
004090         IS NOT EQUAL TO RPTRM01-APPL                             00409000
004100         GO TO LIBA-FIND-ACT-LOOP.                                00410000
004110     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO WS-RP-PRODCODE.       00411000
004120 LIBA-READ-IDX.                                                   00412000
004130     MOVE RPTRM01-SK-INST TO RPIDX-INST.                          00413000
004140     MOVE WS-RP-PRODCODE TO RPIDX-PRODCODE.                       00414000
004150     MOVE RPTRM01-SK-IDNUMBER TO RPIDX-IDNUMBER.                  00415000
004160     PERFORM RPS-IDX-GET-REQUEST.                                 00416000
004170     IF WS-FUNCTION IS EQUAL TO 'N'                               00417000
004180         GO TO LIBA-EXIT.                                         00418000
004190     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00419000
004200         MOVE WS-AB6310 TO RPTRM01-ABORT                          00420000
004210         MOVE WS-TR0004 TO RPTRM01-ABTRACE                        00421000
004220         GO TO CICS-ABORT-EXIT.                                   00422000
004230     MOVE RPIDX-ACCT2-KEY TO RPTRM01-SELECTKEY.                   00423000
004240     MOVE 'Y' TO RPTRM01-SK-PRODCODE-DCHG.                        00424000
004250     MOVE 'Y' TO RPTRM01-SK-ACCOUNT-DCHG.                         00425000
004260     MOVE 'Y' TO RPTRM01-SK-MODEL-DCHG.                           00426000
004270 LIBA-EXIT.                                                       00427000
004280     EXIT.                                                        00428000
004290******************************************************************00429000
004300 FIND-DEFAULT-MODEL SECTION.                                      00430000
004310 FDM-START.                                                       00431000
004320     MOVE 'N' TO WS-ERRORMODEL.                                   00432000
004330     MOVE RPTRM01-SK-INST TO RPMST-INST.                          00433000
004340     MOVE RPTRM01-SK-PRODCODE TO RPMST-PRODCODE.                  00434000
004350     MOVE RPTRM01-SK-ACCOUNT TO RPMST-ACCOUNT.                    00435000
004360     IF RPTRM01-SK-MODEL IS EQUAL TO LOW-VALUE                    00436000
004370         MOVE SPACES TO RPTRM01-SK-MODEL.                         00437000
004380     MOVE RPTRM01-SK-MODEL TO RPMST-MODEL.                        00438000
004390     PERFORM RPS-MST-GET-GE-REQUEST.                              00439000
004400     IF WS-FUNCTION IS EQUAL TO 'N'                               00440000
004410         OR WS-FUNCTION IS EQUAL TO 'E'                           00441000
004420         GO TO FDM-RECORD-NOT-FOUND.                              00442000
004430     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00443000
004440         MOVE WS-AB6320 TO RPTRM01-ABORT                          00444000
004450         MOVE WS-TR0005 TO RPTRM01-ABTRACE                        00445000
004460         MOVE 'Y' TO WS-ERRORMODEL                                00446000
004470         GO TO FDM-EXIT.                                          00447000
004480     IF RPMST-INST IS EQUAL TO RPTRM01-SK-INST                    00448000
004490         AND RPMST-PRODCODE IS EQUAL TO RPTRM01-SK-PRODCODE       00449000
004500         AND RPMST-ACCOUNT IS EQUAL TO RPTRM01-SK-ACCOUNT         00450000
004510         GO TO FDM-GET-NEXT-MST.                                  00451000
004520     GO TO FDM-RECORD-NOT-FOUND.                                  00452000
004530 FDM-GET-NEXT-MST.                                                00453000
004540     MOVE RPMST-MODEL TO RPTRM01-SK-MODEL.                        00454000
004550     MOVE RPTRM01-SK-INST TO WS-SAVEMSTINST.                      00455000
004560     MOVE RPTRM01-SK-PRODCODE TO WS-SAVEMSTPRODCODE.              00456000
004570     MOVE RPTRM01-SK-ACCOUNT TO WS-SAVEMSTACCOUNT.                00457000
004580     MOVE RPTRM01-SK-MODEL TO WS-SAVEMSTMODEL.                    00458000
004590     PERFORM RPS-MST-GET-NEXT-REQUEST.                            00459000
004600     IF WS-FUNCTION IS EQUAL TO 'E'                               00460000
004610         GO TO FDM-GOOD-RECORD.                                   00461000
004620     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00462000
004630         MOVE WS-AB6320 TO RPTRM01-ABORT                          00463000
004640         MOVE WS-TR0006 TO RPTRM01-ABTRACE                        00464000
004650         MOVE 'Y' TO WS-ERRORMODEL                                00465000
004660         GO TO FDM-EXIT.                                          00466000
004670     IF RPMST-INST IS EQUAL TO RPTRM01-SK-INST                    00467000
004680         AND RPMST-PRODCODE IS EQUAL TO RPTRM01-SK-PRODCODE       00468000
004690         AND RPMST-ACCOUNT IS EQUAL TO RPTRM01-SK-ACCOUNT         00469000
004700         GO TO FDM-MULTIPLE-PRIM.                                 00470000
004710 FDM-GOOD-RECORD.                                                 00471000
004720     MOVE WS-SAVEMSTINST TO RPTRM01-SK-INST.                      00472000
004730     MOVE WS-SAVEMSTPRODCODE TO RPTRM01-SK-PRODCODE.              00473000
004740     MOVE WS-SAVEMSTACCOUNT TO RPTRM01-SK-ACCOUNT.                00474000
004750     MOVE WS-SAVEMSTMODEL TO RPTRM01-SK-MODEL.                    00475000
004760     GO TO FDM-EXIT.                                              00476000
004770 FDM-RECORD-NOT-FOUND.                                            00477000
004780     MOVE 'Y' TO WS-ERRORMODEL.                                   00478000
004790     MOVE 500004 TO RPTRM01-MSGNBR.                               00479000
004800     GO TO FDM-EXIT.                                              00480000
004810 FDM-MULTIPLE-PRIM.                                               00481000
004820     MOVE 'Y' TO WS-ERRORMODEL.                                   00482000
004830     MOVE 500090 TO RPTRM01-MSGNBR.                               00483000
004840 FDM-EXIT.                                                        00484000
004850     EXIT.                                                        00485000
004860******************************************************************00486000
000000 COPY RPP002.                                                     00487000
004880******************************************************************00488000
000000 COPY RPPIDXA.                                                    00489000
004900******************************************************************00490000
000000 COPY RPPMSTA.                                                    00491000
004920******************************************************************00492000
000000 COPY RPPTRMA.                                                    00493000
004940******************************************************************00494000
004950 MIC-MST-API SECTION.                                             00495000
000000 COPY MIPMSTA.                                                    00496000
004970******************************************************************00497000
004980 SLP096-GET-2023-RECORD SECTION.                                  00498000
000000 COPY SLP096.                                                     00499000
005000******************************************************************00500000
005010 OPERATOR-DIALOG-SECURITY SECTION.                                00501000
000000 COPY SRP079.                                                     00502000
005030******************************************************************00503000
005040 CICS-ABORT-EXIT SECTION.                                         00504000
005050 CAE-START.                                                       00505000
005060     GO TO CICS-RETURN.                                           00506000
005070 CAE-EXIT.                                                        00507000
005080     EXIT.                                                        00508000
005090******************************************************************00509000
005100 CICS-RETURN SECTION.                                             00510000
005110     IF COM-ABORT IS NOT EQUAL TO ZERO                            00511000
005120         MOVE COM-ABORT TO RPTRM01-ABORT.                         00512000
005130     IF RPTRM01-ABORT IS NOT EQUAL TO ZERO                        00513000
005140         MOVE 'Y' TO RPTRM01-ABTYPE.                              00514000
005150     IF RPTRM01-ABORT IS NOT EQUAL TO ZERO                        00515000
005160         MOVE WS-FUNCTION TO RPTRM01-FUNCTION                     00516000
005170         MOVE SRB-BMDB TO RPTRM01-SRBMDB                          00517000
005180         MOVE EIBFN TO RPTRM01-ABEIBFN                            00518000
005190         MOVE EIBRESP TO RPTRM01-ABEIBRESP                        00519000
005200         MOVE EIBRESP2 TO RPTRM01-ABEIBRESP2                      00520000
005210         MOVE EIBRCODE TO RPTRM01-ABEIBRCODE.                     00521000
005220     IF RPTRM01-ABTYPE IS NOT EQUAL TO 'Y'                        00522000
005230         PERFORM GLOBAL-CLOSE.                                    00523000
000000 COPY SLP709.                                                     00524000
005250******************************************************************00525000
005260 GLOBAL-CLOSE SECTION.                                            00526000
005270 GC-START.                                                        00527000
005280     IF RPTRM01-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  00528000
005290         PERFORM RPS-MST-GLOBAL-CLOSE-REQUEST.                    00529000
005300 GC-EXIT.                                                         00530000
005310     EXIT.                                                        00531000
005320******************************************************************00532000
