000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLTRM00.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLTRM00 - TRANSACTION ACCUMULATOR UPDATE MODULE            *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW079-AREAS.                                                00016000
000000 COPY SRW079.                                                     00017000
000180 01  SRW105-AREAS.                                                00018000
000000 COPY SRW105.                                                     00019000
000200*01  BICRSRB.                                                     00020000
000000 COPY BICRSRB.                                                    00021000
000220*01  BICRPSB.                                                     00022000
000000 COPY BICRPSB.                                                    00023000
000240*01  BICRVERB.                                                    00024000
000000 COPY BICRVERB.                                                   00025000
000260*01  BICRSTAT.                                                    00026000
000000 COPY BICRSTAT.                                                   00027000
000280*01  BICRDBS.                                                     00028000
000000 COPY BICRDBS.                                                    00029000
000300*01  BICRLOG.                                                     00030000
000000 COPY BICRLOG.                                                    00031000
000320 01  SRW710-AREAS.                                                00032000
000000 COPY SRW710.                                                     00033000
000340 01  RPW7110-AREAS.                                               00034000
000000 COPY RPW7110.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  COM-ABORT               PIC S9(04)      COMP.            00037000
000380     03  WS-SUB1                 PIC S9(04)      COMP             00038000
000390                                                 VALUE +0000.     00039000
000400     03  WS-SUB2                 PIC S9(04)      COMP             00040000
000410                                                 VALUE +0000.     00041000
000420     03  WS-RP-PRODCODE          PIC X(06)       VALUE 'RP    '.  00042000
000430     03  WS-UPDATESW             PIC X(01)       VALUE SPACES.    00043000
000440     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00044000
000450     03  FILLER          REDEFINES WS-CURDATE.                    00045000
000460         05  WS-CURMM            PIC 9(02).                       00046000
000470         05  WS-CURDD            PIC 9(02).                       00047000
000480         05  WS-CURYYYY          PIC 9(04).                       00048000
000490     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00049000
000500     03  FILLER          REDEFINES WS-PDATE.                      00050000
000510         05  WS-PDATE-YYYY       PIC 9(04).                       00051000
000520         05  WS-PDATE-MM         PIC 9(02).                       00052000
000530         05  WS-PDATE-DD         PIC 9(02).                       00053000
000540     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00054000
000550     03  FILLER          REDEFINES WS-PDATE2.                     00055000
000560         05  WS-PDATE2-YYYY      PIC 9(04).                       00056000
000570         05  WS-PDATE2-MM        PIC 9(02).                       00057000
000580         05  WS-PDATE2-DD        PIC 9(02).                       00058000
000590     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00059000
000600                                                 VALUE ZERO.      00060000
000610     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00061000
000620                                                 VALUE ZERO.      00062000
000630     03  WS-ERRORMODEL           PIC X(01)       VALUE 'N'.       00063000
000640     03  WS-SAVEMASTERGROUP.                                      00064000
000650         05  WS-SAVEMSTINST      PIC 9(04).                       00065000
000660         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00066000
000670         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00067000
000680         05  WS-SAVEMSTMODEL     PIC X(10).                       00068000
000690*----------------------------------------------------------------*00069000
000700 01  MIWPRI-AREAS.                                                00070000
000000 COPY MIWPRI.                                                     00071000
000720 01  MIWMSTA-AREAS.                                               00072000
000000 COPY MIWMSTA.                                                    00073000
000740 01  MIMST-RECORD.                                                00074000
000000 COPY MISMST.                                                     00075000
000760 01  MI2023-RECORD.                                               00076000
000000 COPY MIS2023A.                                                   00077000
000780 01  MI7101-RECORD.                                               00078000
000000 COPY MIS7101.                                                    00079000
000800 01  MI7110-RECORD.                                               00080000
000000 COPY MIS7110.                                                    00081000
000820*----------------------------------------------------------------*00082000
000830 01  RPWPRI-AREAS.                                                00083000
000000 COPY RPWPRI.                                                     00084000
000850 01  RPWMST-AREA.                                                 00085000
000000 COPY RPWMSTA.                                                    00086000
000870 01  RPMST-RECORD.                                                00087000
000000 COPY RPSMST.                                                     00088000
000890 01  RPWIDX-AREA.                                                 00089000
000000 COPY RPWIDXA.                                                    00090000
000910 01  RPIDX-RECORD.                                                00091000
000000 COPY RPSIDX.                                                     00092000
000930 01  RPWTRM-AREA.                                                 00093000
000000 COPY RPWTRMA.                                                    00094000
000950 01  RPTRM-RECORD.                                                00095000
000000 COPY RPSTRM.                                                     00096000
000970*----------------------------------------------------------------*00097000
000980 01  RPRF21-MESSAGE.                                              00098000
000000 COPY MISCNT00      REPLACING                                     00099000
001000             ==:MICNT:== BY ==RPRF21==.                           00100000
000000 COPY RPSRF21.                                                    00101000
001020***************************************************************** 00102000
001030 01  WS-TRACECODES.                                               00103000
001040     03  WS-TR0001               PIC S9(04)      COMP             00104000
001050                                                 VALUE +0001.     00105000
001060     03  WS-TR0002               PIC S9(04)      COMP             00106000
001070                                                 VALUE +0002.     00107000
001080     03  WS-TR0003               PIC S9(04)      COMP             00108000
001090                                                 VALUE +0003.     00109000
001100     03  WS-TR0004               PIC S9(04)      COMP             00110000
001110                                                 VALUE +0004.     00111000
001120     03  WS-TR0005               PIC S9(04)      COMP             00112000
001130                                                 VALUE +0005.     00113000
001140     03  WS-TR0006               PIC S9(04)      COMP             00114000
001150                                                 VALUE +0006.     00115000
001160     03  WS-TR0007               PIC S9(04)      COMP             00116000
001170                                                 VALUE +0007.     00117000
001180     03  WS-TR0008               PIC S9(04)      COMP             00118000
001190                                                 VALUE +0008.     00119000
001200 01  WS-ABORTCODES.                                               00120000
001210     03  WS-AB2000               PIC S9(04)      COMP             00121000
001220                                                 VALUE +2000.     00122000
001230     03  WS-AB2033               PIC S9(04)      COMP             00123000
001240                                                 VALUE +2033.     00124000
001250     03  WS-AB3051               PIC S9(04)      COMP             00125000
001260                                                 VALUE +3051.     00126000
001270     03  WS-AB6310               PIC S9(04)      COMP             00127000
001280                                                 VALUE +6310.     00128000
001290     03  WS-AB6320               PIC S9(04)      COMP             00129000
001300                                                 VALUE +6320.     00130000
001310     03  WS-AB6330               PIC S9(04)      COMP             00131000
001320                                                 VALUE +6330.     00132000
001330     03  WS-AB6335               PIC S9(04)      COMP             00133000
001340                                                 VALUE +6335.     00134000
001350     03  WS-AB6355               PIC S9(04)      COMP             00135000
001360                                                 VALUE +6355.     00136000
001370******************************************************************00137000
001380 01  SLW096-AREAS.                                                00138000
000000 COPY SLW096.                                                     00139000
001400******************************************************************00140000
001410 LINKAGE SECTION.                                                 00141000
001420 01  DFHCOMMAREA.                                                 00142000
000000 COPY MISCNT00      REPLACING                                     00143000
001440             ==:MICNT:== BY ==RPTRM00==.                          00144000
000000 COPY RPSTRM00.                                                   00145000
001460*01  SLW096-2023RECORDS.                                          00146000
000000 COPY SLW096L.                                                    00147000
001480******************************************************************00148000
001490 PROCEDURE DIVISION.                                              00149000
001500******************************************************************00150000
001510 ENTRY-ROUTINE SECTION.                                           00151000
001520 ER-START.                                                        00152000
001530     MOVE 'RPLTRM00' TO SR-APIPROGLIT.                            00153000
001540     MOVE 'RPLTRM00' TO RPTRM00-ABPROGID.                         00154000
001550     PERFORM CICS-HANDLE-CONDITION.                               00155000
001560     IF EIBCALEN IS EQUAL TO +0                                   00156000
001570         MOVE WS-AB2000 TO RPTRM00-ABORT                          00157000
001580         MOVE WS-TR0001 TO RPTRM00-ABTRACE                        00158000
001590         GO TO CICS-RETURN.                                       00159000
001600     MOVE ZERO TO RPTRM00-MSGNBR.                                 00160000
001610     MOVE SPACE TO WS-FUNCTION.                                   00161000
001620     MOVE RPTRM00-FILEOPTS TO WS-FILEOPTS.                        00162000
001630     MOVE RPTRM00-OPERID TO WS-UPD-USER.                          00163000
001640     MOVE RPTRM00-EXTERNALID TO LOG-PANELID.                      00164000
001650     MOVE RPTRM00-TERMID TO LOG-TERMID.                           00165000
001660     MOVE RPTRM00-WORKID TO LOG-WORKID.                           00166000
001670     MOVE RPTRM00-TRANSTART TO LOG-TRANSTART.                     00167000
001680     MOVE RPTRM00-APPLSEQ TO LOG-APPLSEQ.                         00168000
000000 COPY SLP094.                                                     00169000
001700     GO TO VERIFY-KEY.                                            00170000
001710 ER-EXIT.                                                         00171000
001720     EXIT.                                                        00172000
001730******************************************************************00173000
001740 CICS-HANDLE-CONDITION SECTION.                                   00174000
000000 COPY SLP702.                                                     00175000
001760     MOVE WS-AB2033 TO RPTRM00-ABORT.                             00176000
001770     MOVE WS-TR0002 TO RPTRM00-ABTRACE.                           00177000
001780     GO TO CICS-RETURN.                                           00178000
001790 CHC-EXIT.                                                        00179000
001800     EXIT.                                                        00180000
001810******************************************************************00181000
001820 VERIFY-KEY SECTION.                                              00182000
001830 VK-START.                                                        00183000
001840     MOVE ZERO TO COM-ABORT.                                      00184000
001850     MOVE ZERO TO RPTRM00-ABORT.                                  00185000
001860     MOVE ZERO TO RPTRM00-MSGNBR.                                 00186000
001870     MOVE SPACES TO RPTRM00-FUNCTION.                             00187000
001880     MOVE RPTRM00-DATE TO WS-CURDATE.                             00188000
001890     MOVE WS-CURMM TO WS-PDATE-MM.                                00189000
001900     MOVE WS-CURDD TO WS-PDATE-DD.                                00190000
001910     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00191000
001920     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00192000
001930 VK-NBR-OCCURS.                                                   00193000
001940     IF RPTRM00-NBR-OCCURS-DCHG IS EQUAL TO 'E'                   00194000
001950         MOVE 000002 TO RPTRM00-MSGNBR                            00195000
001960         MOVE 'E' TO RPTRM00-NBR-OCCURS-DCHG                      00196000
001970         GO TO VK-ERROR.                                          00197000
001980     IF RPTRM00-NBR-OCCURS IS NOT NUMERIC                         00198000
001990         OR RPTRM00-NBR-OCCURS IS EQUAL TO ZEROS                  00199000
002000         MOVE +1 TO RPTRM00-NBR-OCCURS.                           00200000
002010     IF RPTRM00-NBR-OCCURS IS GREATER THAN +1                     00201000
002020         OR RPTRM00-NBR-OCCURS IS LESS THAN ZEROS                 00202000
002030         MOVE +1 TO RPTRM00-NBR-OCCURS.                           00203000
002040 VK-SELECTKEY.                                                    00204000
002050     IF RPTRM00-SK-INST-DCHG IS EQUAL TO 'N'                      00205000
002060         OR RPTRM00-SK-INST-DCHG IS EQUAL TO 'E'                  00206000
002070         MOVE 000002 TO RPTRM00-MSGNBR                            00207000
002080         MOVE 'E' TO RPTRM00-SK-INST-DCHG                         00208000
002090         GO TO VK-ERROR.                                          00209000
002100     IF RPTRM00-SK-INST IS NOT NUMERIC                            00210000
002110         OR RPTRM00-SK-INST IS EQUAL TO ZEROS                     00211000
002120         MOVE 000002 TO RPTRM00-MSGNBR                            00212000
002130         MOVE 'E' TO RPTRM00-SK-INST-DCHG                         00213000
002140         GO TO VK-ERROR.                                          00214000
002150     IF RPTRM00-SK-ACCUM-DCHG IS EQUAL TO 'N'                     00215000
002160         OR RPTRM00-SK-ACCUM-DCHG IS EQUAL TO 'E'                 00216000
002170         MOVE 000002 TO RPTRM00-MSGNBR                            00217000
002180         MOVE 'E' TO RPTRM00-SK-ACCUM-DCHG                        00218000
002190         GO TO VK-ERROR.                                          00219000
002200     IF RPTRM00-SK-ACCUM IS NOT NUMERIC                           00220000
002210         OR RPTRM00-SK-ACCUM IS EQUAL TO ZEROS                    00221000
002220         OR RPTRM00-SK-ACCUM IS GREATER THAN 12                   00222000
002230         MOVE 000002 TO RPTRM00-MSGNBR                            00223000
002240         MOVE 'E' TO RPTRM00-SK-ACCUM-DCHG                        00224000
002250         GO TO VK-ERROR.                                          00225000
002260     IF RPTRM00-SK-PRODCODE-DCHG IS EQUAL TO 'N'                  00226000
002270         AND RPTRM00-SK-ACCOUNT-DCHG IS EQUAL TO 'N'              00227000
002280         AND RPTRM00-SK-MODEL-DCHG IS EQUAL TO 'N'                00228000
002290         GO TO VK-IDX-SELECT.                                     00229000
002300     IF RPTRM00-SK-PRODCODE-DCHG IS EQUAL TO 'N'                  00230000
002310         OR RPTRM00-SK-PRODCODE-DCHG IS EQUAL TO 'E'              00231000
002320         MOVE 000002 TO RPTRM00-MSGNBR                            00232000
002330         MOVE 'E' TO RPTRM00-SK-PRODCODE-DCHG                     00233000
002340         GO TO VK-ERROR.                                          00234000
002350     IF RPTRM00-SK-PRODCODE IS EQUAL TO SPACES                    00235000
002360         OR RPTRM00-SK-PRODCODE IS EQUAL TO LOW-VALUES            00236000
002370         MOVE 000002 TO RPTRM00-MSGNBR                            00237000
002380         MOVE 'E' TO RPTRM00-SK-PRODCODE-DCHG                     00238000
002390         GO TO VK-ERROR.                                          00239000
002400     IF RPTRM00-SK-ACCOUNT-DCHG IS EQUAL TO 'N'                   00240000
002410         OR RPTRM00-SK-ACCOUNT-DCHG IS EQUAL TO 'E'               00241000
002420         MOVE 000002 TO RPTRM00-MSGNBR                            00242000
002430         MOVE 'E' TO RPTRM00-SK-ACCOUNT-DCHG                      00243000
002440         GO TO VK-ERROR.                                          00244000
002450     IF RPTRM00-SK-ACCOUNT IS EQUAL TO SPACES                     00245000
002460         OR RPTRM00-SK-ACCOUNT IS EQUAL TO LOW-VALUES             00246000
002470         MOVE 000002 TO RPTRM00-MSGNBR                            00247000
002480         MOVE 'E' TO RPTRM00-SK-ACCOUNT-DCHG                      00248000
002490         GO TO VK-ERROR.                                          00249000
002500     IF RPTRM00-SK-MODEL-DCHG IS EQUAL TO 'E'                     00250000
002510         MOVE 000002 TO RPTRM00-MSGNBR                            00251000
002520         MOVE 'E' TO RPTRM00-SK-MODEL-DCHG                        00252000
002530         GO TO VK-ERROR.                                          00253000
002540     IF RPTRM00-SK-MODEL-DCHG IS EQUAL TO 'N'                     00254000
002550         OR RPTRM00-SK-MODEL IS EQUAL TO LOW-VALUES               00255000
002560         MOVE SPACES TO RPTRM00-SK-MODEL.                         00256000
002570     GO TO VK-SECURITY.                                           00257000
002580 VK-IDX-SELECT.                                                   00258000
002590     IF RPTRM00-SK-IDNUMBER-DCHG IS EQUAL TO 'N'                  00259000
002600         OR RPTRM00-SK-IDNUMBER-DCHG IS EQUAL TO 'E'              00260000
002610         MOVE 000002 TO RPTRM00-MSGNBR                            00261000
002620         MOVE 'E' TO RPTRM00-SK-IDNUMBER-DCHG                     00262000
002630         MOVE 'E' TO RPTRM00-SK-PRODCODE-DCHG                     00263000
002640         MOVE 'E' TO RPTRM00-SK-ACCOUNT-DCHG                      00264000
002650         MOVE 'E' TO RPTRM00-SK-MODEL-DCHG                        00265000
002660         GO TO VK-ERROR.                                          00266000
002670     IF RPTRM00-SK-IDNUMBER IS NOT GREATER THAN ZEROS             00267000
002680         OR RPTRM00-SK-IDNUMBER IS NOT NUMERIC                    00268000
002690         MOVE 000002 TO RPTRM00-MSGNBR                            00269000
002700         MOVE 'E' TO RPTRM00-SK-IDNUMBER-DCHG                     00270000
002710         GO TO VK-ERROR.                                          00271000
002720 VK-SECURITY.                                                     00272000
002730     IF RPTRM00-APIFUNC IS NOT EQUAL TO 'VKL'                     00273000
002740         GO TO VK-MST.                                            00274000
002750     INITIALIZE RPTRM00-DATA-GRP.                                 00275000
002760     MOVE ALL 'N' TO RPTRM00-DATA-GRP-DCHG.                       00276000
002770     MOVE RPTRM00-UPDATE TO SR-OPDUPDATE.                         00277000
002780     MOVE RPTRM00-SK-INST TO SR-OPDINST.                          00278000
002790     MOVE RPTRM00-OPERID TO SR-OPDOPERID.                         00279000
002800     MOVE RPTRM00-MODELID TO SR-OPDMODELID.                       00280000
002810     MOVE RPTRM00-EXTERNALID TO SR-OPDTRANCODE.                   00281000
002820     MOVE RPTRM00-APPL TO SR-OPDAPPL.                             00282000
002830     MOVE RPTRM00-SECALT TO SR-OPDSECALT.                         00283000
002840     MOVE RPTRM00-FUNC TO SR-OPDFUNC.                             00284000
002850     PERFORM OPERATOR-DIALOG-SECURITY.                            00285000
002860     MOVE SR-OPDUPDATE TO RPTRM00-UPDATE.                         00286000
002870     IF SR-OPDMSGNBR IS NOT EQUAL TO ZEROS                        00287000
002880         MOVE SR-OPDMSGNBR TO RPTRM00-MSGNBR                      00288000
002890         GO TO VK-ERROR.                                          00289000
002900 VK-IDX.                                                          00290000
002910     INITIALIZE RPIDX-RECORD.                                     00291000
002920     IF RPTRM00-SK-IDNUMBER-DCHG IS EQUAL TO 'N'                  00292000
002930         OR RPTRM00-SK-IDNUMBER-DCHG IS EQUAL TO 'E'              00293000
002940         GO TO VK-MST.                                            00294000
002950     IF RPTRM00-SK-IDNUMBER IS NOT GREATER THAN ZEROS             00295000
002960         OR RPTRM00-SK-IDNUMBER IS NOT NUMERIC                    00296000
002970         GO TO VK-MST.                                            00297000
002980     PERFORM LOCATE-IDNUMBER-BY-APPL.                             00298000
002990     IF WS-FUNCTION IS EQUAL TO 'N'                               00299000
003000         MOVE 500004 TO RPTRM00-MSGNBR                            00300000
003010         MOVE 'E' TO RPTRM00-SK-IDNUMBER-DCHG                     00301000
003020         GO TO VK-ERROR.                                          00302000
003030     MOVE ZEROS TO RPTRM00-SK-IDNUMBER.                           00303000
003040 VK-MST.                                                          00304000
003050     MOVE SPACE TO RPTRM00-END-FILE-INST.                         00305000
003060     IF RPTRM00-SK-MODEL IS EQUAL TO SPACES OR                    00306000
003070         RPTRM00-SK-MODEL IS EQUAL TO LOW-VALUES                  00307000
003080         PERFORM FIND-DEFAULT-MODEL.                              00308000
003090     IF WS-ERRORMODEL IS EQUAL TO 'Y'                             00309000
003100         GO TO VK-ERROR.                                          00310000
003110     MOVE LOW-VALUES TO RPMST-GRP-KEY.                            00311000
003120     MOVE RPTRM00-SK-INST TO RPMST-INST.                          00312000
003130     MOVE RPTRM00-SK-PRODCODE TO RPMST-PRODCODE.                  00313000
003140     MOVE RPTRM00-SK-ACCOUNT TO RPMST-ACCOUNT.                    00314000
003150     MOVE RPTRM00-SK-MODEL TO RPMST-MODEL.                        00315000
003160     PERFORM RPS-MST-GET-REQUEST.                                 00316000
003170     IF WS-FUNCTION IS EQUAL TO 'N'                               00317000
003180         MOVE 500004 TO RPTRM00-MSGNBR                            00318000
003190         MOVE ZEROS TO RPTRM00-NBR-OCCURS                         00319000
003200         MOVE 'Y' TO RPTRM00-NBR-OCCURS-DCHG                      00320000
003210         MOVE 'E' TO RPTRM00-END-FILE-INST                        00321000
003220         MOVE 'Y' TO RPTRM00-END-FILE-INST-DCHG                   00322000
003230         MOVE 'E' TO RPTRM00-SK-INST-DCHG                         00323000
003240         MOVE 'E' TO RPTRM00-SK-PRODCODE-DCHG                     00324000
003250         MOVE 'E' TO RPTRM00-SK-ACCOUNT-DCHG                      00325000
003260         MOVE 'E' TO RPTRM00-SK-MODEL-DCHG                        00326000
003270         GO TO VK-ERROR.                                          00327000
003280     MOVE RPMST-MODEL TO RPTRM00-SK-MODEL.                        00328000
003290     MOVE RPMST-REL-STAT TO RPTRM00-REL-STAT.                     00329000
003300     MOVE RPMST-IDNUMBER TO RPTRM00-SK-IDNUMBER.                  00330000
003310 VK-7101.                                                         00331000
003320     MOVE SPACES TO MI7101-RECORD.                                00332000
003330     MOVE RPTRM00-SK-INST TO MIM-7101KINST.                       00333000
003340     MOVE +7101 TO MIM-7101KREC.                                  00334000
003350     MOVE RPMST-MODEL TO MIM-7101KMODEL.                          00335000
003360     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        00336000
003370     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00337000
003380     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00338000
003390     MOVE MI7101-RECORD TO MIMST-RECORD.                          00339000
003400     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00340000
003410     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00341000
003420         MOVE 500006 TO RPTRM00-MSGNBR                            00342000
003430         GO TO VK-ERROR.                                          00343000
003440     MOVE MIMST-RECORD TO MI7101-RECORD.                          00344000
003450     IF MIM-7101KINST IS NOT EQUAL TO RPMST-INST                  00345000
003460         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00346000
003470         OR MIM-7101KMODEL IS NOT EQUAL TO RPMST-MODEL            00347000
003480         MOVE 500006 TO RPTRM00-MSGNBR                            00348000
003490         GO TO VK-ERROR.                                          00349000
003500     IF MIM-7101TRANPROFILE IS NOT GREATER THAN SPACES            00350000
003510         OR MIM-7101TRANPROFILE-I IS EQUAL TO 'N'                 00351000
003520         MOVE 500082 TO RPTRM00-MSGNBR                            00352000
003530         GO TO VK-ERROR.                                          00353000
003540     MOVE MIM-7101DESC TO RPTRM00-MODEL-DESC.                     00354000
003550 VK-7110.                                                         00355000
003560     MOVE SPACES TO MI7110-RECORD.                                00356000
003570     MOVE RPTRM00-SK-INST TO MIM-7110KINST.                       00357000
003580     MOVE +7110 TO MIM-7110KREC.                                  00358000
003590     MOVE MIM-7101TRANPROFILE TO MIM-7110KTRANPROFILE.            00359000
003600     MOVE MIC-RPS-7110-PRI TO MIC-MST-REC-PRI.                    00360000
003610     MOVE MI7110-RECORD TO MIMST-RECORD.                          00361000
003620     PERFORM MIC-MST-GET-REQUEST.                                 00362000
003630     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00363000
003640         MOVE 500081 TO RPTRM00-MSGNBR                            00364000
003650         GO TO VK-ERROR.                                          00365000
003660     MOVE MIMST-RECORD TO MI7110-RECORD.                          00366000
003670     MOVE 'Accum Not Used ' TO RPTRM00-7110-DESC.                 00367000
003680     MOVE ZERO TO WS-SUB1.                                        00368000
003690 VK-7110-LOOP.                                                    00369000
003700     ADD +1 TO WS-SUB1.                                           00370000
003710     IF WS-SUB1 IS GREATER THAN +12                               00371000
003720         GO TO VK-TRM.                                            00372000
003730     IF MIM-7110ACCUM (WS-SUB1) IS EQUAL TO ZEROS                 00373000
003740         GO TO VK-7110-LOOP.                                      00374000
003750     IF MIM-7110ACCUM (WS-SUB1) IS NOT EQUAL TO RPTRM00-SK-ACCUM  00375000
003760         GO TO VK-7110-LOOP.                                      00376000
003770     MOVE MIM-7110ACCUMDESC (WS-SUB1) TO RPTRM00-7110-DESC.       00377000
003780 VK-TRM.                                                          00378000
003790     MOVE RPMST-GRP-KEY TO RPTRM-GRP-KEY.                         00379000
003800     PERFORM RPS-TRM-GET-REQUEST.                                 00380000
003810     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00381000
003820         MOVE WS-AB6355 TO RPTRM00-ABORT                          00382000
003830         MOVE WS-TR0003 TO RPTRM00-ABTRACE                        00383000
003840         GO TO VK-ERROR.                                          00384000
003850     IF RPTRM00-APIFUNC IS NOT EQUAL TO 'VKL'                     00385000
003860         GO TO VK-EXIT.                                           00386000
003870     MOVE RPTRM-TRAN-COUNT (RPTRM00-SK-ACCUM)                     00387000
003880         TO RPTRM00-TRAN-COUNT.                                   00388000
003890     MOVE RPTRM-TRAN-AMOUNT (RPTRM00-SK-ACCUM)                    00389000
003900         TO RPTRM00-TRAN-AMOUNT.                                  00390000
003910 VK-NAME.                                                         00391000
003920     MOVE 'A' TO RPRF21-FUNC.                                     00392000
003930     MOVE RPTRM00-SK-INST TO RPRF21-BASE-ACCT-INST.               00393000
003940     MOVE RPTRM00-SK-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.       00394000
003950     MOVE RPTRM00-SK-ACCOUNT TO RPRF21-BASE-ACCT.                 00395000
003960     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          00396000
003970     PERFORM REQUEST-CUSTOMER.                                    00397000
003980     MOVE WS-MSGNBR TO RPTRM00-MSGNBR.                            00398000
003990     IF WS-FUNCTION IS EQUAL TO 'B'                               00399000
004000         MOVE SPACES TO WS-FUNCTION.                              00400000
004010     IF WS-FUNCTION IS EQUAL TO SPACES                            00401000
004020         MOVE RPRF21-NAME TO RPTRM00-CUST-NAME                    00402000
004030         GO TO VK-END.                                            00403000
004040     IF RPTRM00-MSGNBR IS EQUAL TO ZEROS                          00404000
004050         MOVE 500016 TO RPTRM00-MSGNBR.                           00405000
004060 VK-ERROR.                                                        00406000
004070     MOVE 'E' TO RPTRM00-RETURN.                                  00407000
004080 VK-END.                                                          00408000
004090     GO TO CICS-RETURN.                                           00409000
004100 VK-EXIT.                                                         00410000
004110     EXIT.                                                        00411000
004120******************************************************************00412000
004130 EDIT-DATA SECTION.                                               00413000
004140 ED-START.                                                        00414000
004150     MOVE ZEROS TO RPTRM00-MSGNBR.                                00415000
004160     MOVE +0000 TO RPTRM00-ABORT.                                 00416000
004170     MOVE +0000 TO RPTRM00-ERRCNT.                                00417000
004180 ED-TRAN-COUNT.                                                   00418000
004190     IF RPTRM00-TRAN-COUNT-DCHG IS EQUAL TO 'E'                   00419000
004200         ADD +1 TO RPTRM00-ERRCNT                                 00420000
004210         MOVE 'Y' TO WS-ERROR                                     00421000
004220         GO TO ED-TRAN-AMOUNT.                                    00422000
004230     IF RPTRM00-TRAN-COUNT-DCHG IS EQUAL TO 'N'                   00423000
004240         MOVE RPTRM-TRAN-COUNT (RPTRM00-SK-ACCUM)                 00424000
004250             TO RPTRM00-TRAN-COUNT                                00425000
004260     ELSE                                                         00426000
004270         MOVE 'Y' TO WS-UPDTSW.                                   00427000
004280     IF RPTRM00-TRAN-COUNT IS NOT NUMERIC                         00428000
004290         ADD +1 TO RPTRM00-ERRCNT                                 00429000
004300         MOVE 'Y' TO WS-ERROR                                     00430000
004310         MOVE 'E' TO RPTRM00-TRAN-COUNT-DCHG.                     00431000
004320 ED-TRAN-AMOUNT.                                                  00432000
004330     IF RPTRM00-TRAN-AMOUNT-DCHG IS EQUAL TO 'E'                  00433000
004340         ADD +1 TO RPTRM00-ERRCNT                                 00434000
004350         MOVE 'Y' TO WS-ERROR                                     00435000
004360         GO TO ED-END.                                            00436000
004370     IF RPTRM00-TRAN-AMOUNT-DCHG IS EQUAL TO 'N'                  00437000
004380         MOVE RPTRM-TRAN-AMOUNT (RPTRM00-SK-ACCUM)                00438000
004390             TO RPTRM00-TRAN-AMOUNT                               00439000
004400     ELSE                                                         00440000
004410         MOVE 'Y' TO WS-UPDTSW.                                   00441000
004420     IF RPTRM00-TRAN-AMOUNT IS NOT NUMERIC                        00442000
004430         ADD +1 TO RPTRM00-ERRCNT                                 00443000
004440         MOVE 'Y' TO WS-ERROR                                     00444000
004450         MOVE 'E' TO RPTRM00-TRAN-AMOUNT-DCHG.                    00445000
004460 ED-END.                                                          00446000
004470     IF RPTRM00-UPDATE IS NOT EQUAL TO 'Y'                        00447000
004480         GO TO CICS-RETURN.                                       00448000
004490     IF WS-ERROR IS EQUAL TO 'Y'                                  00449000
004500         AND RPTRM00-MSGNBR IS EQUAL TO ZEROS                     00450000
004510         MOVE 500035 TO RPTRM00-MSGNBR.                           00451000
004520     IF RPTRM00-APIFUNC IS EQUAL TO 'EDT'                         00452000
004530         OR WS-ERROR IS EQUAL TO 'Y'                              00453000
004540         MOVE 'EDT' TO RPTRM00-APIFUNC                            00454000
004550         GO TO CICS-RETURN.                                       00455000
004560     IF WS-UPDTSW IS NOT EQUAL TO 'Y'                             00456000
004570         GO TO CICS-RETURN.                                       00457000
004580 ED-EXIT.                                                         00458000
004590     EXIT.                                                        00459000
004600******************************************************************00460000
004610 UPDATE-RECORD SECTION.                                           00461000
004620 UR-START.                                                        00462000
004630     MOVE 'Y' TO WS-UPDATESW.                                     00463000
004640     MOVE LOW-VALUES TO RPTRM-GRP-KEY.                            00464000
004650     MOVE RPTRM00-SK-INST TO RPTRM-INST.                          00465000
004660     MOVE RPTRM00-SK-PRODCODE TO RPTRM-PRODCODE.                  00466000
004670     MOVE RPTRM00-SK-ACCOUNT TO RPTRM-ACCOUNT.                    00467000
004680     MOVE RPTRM00-SK-MODEL TO RPTRM-MODEL.                        00468000
004690     PERFORM RPS-TRM-GET-LOCK-REQUEST.                            00469000
004700     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00470000
004710         MOVE WS-AB6355 TO RPTRM00-ABORT                          00471000
004720         MOVE WS-TR0004 TO RPTRM00-ABTRACE                        00472000
004730         GO TO CICS-RETURN.                                       00473000
004740 UR-LOAD-RECORD.                                                  00474000
004750     IF RPTRM00-TRAN-COUNT-DCHG IS EQUAL TO 'Y'                   00475000
004760         MOVE RPTRM00-TRAN-COUNT                                  00476000
004770             TO RPTRM-TRAN-COUNT (RPTRM00-SK-ACCUM).              00477000
004780     IF RPTRM00-TRAN-AMOUNT-DCHG IS EQUAL TO 'Y'                  00478000
004790         MOVE RPTRM00-TRAN-AMOUNT                                 00479000
004800             TO RPTRM-TRAN-AMOUNT (RPTRM00-SK-ACCUM).             00480000
004810     PERFORM RPS-TRM-REPUT-REQUEST.                               00481000
004820     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00482000
004830         MOVE WS-AB6355 TO RPTRM00-ABORT                          00483000
004840         MOVE WS-TR0005 TO RPTRM00-ABTRACE                        00484000
004850         GO TO CICS-RETURN.                                       00485000
004860     GO TO CICS-RETURN.                                           00486000
004870 UR-EXIT.                                                         00487000
004880     EXIT.                                                        00488000
004890******************************************************************00489000
004900 LOCATE-IDNUMBER-BY-APPL SECTION.                                 00490000
004910 LIBA-START.                                                      00491000
004920     MOVE ZERO TO WS-SUB1.                                        00492000
004930     MOVE RPTRM00-SK-INST TO MIM-2023KINST.                       00493000
004940     MOVE 'RP' TO MIM-2023KPRODCODE.                              00494000
004950     MOVE RPTRM00-INST-OPT-1 TO SLW096-BANKS.                     00495000
004960     PERFORM SLP096-GET-2023-RECORD.                              00496000
004970     IF SLW096-FUNCTION IS EQUAL TO SPACES                        00497000
004980         MOVE MIM-2023KPRODCODE TO WS-RP-PRODCODE                 00498000
004990         GO TO LIBA-READ-IDX.                                     00499000
005000 LIBA-FIND-ACT-LOOP.                                              00500000
005010     ADD +1 TO WS-SUB1.                                           00501000
005020     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00502000
005030         MOVE 'N' TO WS-FUNCTION                                  00503000
005040         GO TO LIBA-EXIT.                                         00504000
005050     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00505000
005060         IS NOT EQUAL TO RPTRM00-APPL                             00506000
005070         GO TO LIBA-FIND-ACT-LOOP.                                00507000
005080     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO WS-RP-PRODCODE.       00508000
005090 LIBA-READ-IDX.                                                   00509000
005100     MOVE RPTRM00-SK-INST TO RPIDX-INST.                          00510000
005110     MOVE WS-RP-PRODCODE TO RPIDX-PRODCODE.                       00511000
005120     MOVE RPTRM00-SK-IDNUMBER TO RPIDX-IDNUMBER.                  00512000
005130     PERFORM RPS-IDX-GET-REQUEST.                                 00513000
005140     IF WS-FUNCTION IS EQUAL TO 'N'                               00514000
005150         GO TO LIBA-EXIT.                                         00515000
005160     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00516000
005170         MOVE WS-AB6310 TO RPTRM00-ABORT                          00517000
005180         MOVE WS-TR0006 TO RPTRM00-ABTRACE                        00518000
005190         GO TO CICS-ABORT-EXIT.                                   00519000
005200     MOVE RPIDX-INST2 TO RPTRM00-SK-INST.                         00520000
005210     MOVE RPIDX-PRODCODE2 TO RPTRM00-SK-PRODCODE.                 00521000
005220     MOVE RPIDX-ACCT2 TO RPTRM00-SK-ACCOUNT.                      00522000
005230     MOVE RPIDX-MODEL2 TO RPTRM00-SK-MODEL.                       00523000
005240     MOVE 'Y' TO RPTRM00-SK-PRODCODE-DCHG.                        00524000
005250     MOVE 'Y' TO RPTRM00-SK-ACCOUNT-DCHG.                         00525000
005260     MOVE 'Y' TO RPTRM00-SK-MODEL-DCHG.                           00526000
005270 LIBA-EXIT.                                                       00527000
005280     EXIT.                                                        00528000
005290******************************************************************00529000
005300 REQUEST-CUSTOMER SECTION.                                        00530000
005310 RC-START.                                                        00531000
005320     MOVE SPACES TO RPRF21-FUNCTION.                              00532000
005330     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             00533000
005340     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         00534000
005350     EXEC CICS LINK                                               00535000
005360         PROGRAM('RPO0RF21')                                      00536000
005370         COMMAREA(RPRF21-MESSAGE)                                 00537000
005380         LENGTH(LENGTH OF RPRF21-MESSAGE)                         00538000
005390         RESP(WS-CICS-RESPONSE)                                   00539000
005400         END-EXEC.                                                00540000
005410     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         00541000
005420     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00542000
005430         MOVE 'L' TO WS-FUNCTION                                  00543000
005440         MOVE 500036 TO WS-MSGNBR                                 00544000
005450         GO TO RC-EXIT.                                           00545000
005460     IF WS-FUNCTION IS EQUAL TO 'B'                               00546000
005470         MOVE 500045 TO WS-MSGNBR                                 00547000
005480         GO TO RC-EXIT.                                           00548000
005490     IF WS-FUNCTION IS EQUAL TO 'C'                               00549000
005500         MOVE 500037 TO WS-MSGNBR                                 00550000
005510         GO TO RC-EXIT.                                           00551000
005520     IF WS-FUNCTION IS EQUAL TO 'I'                               00552000
005530         MOVE 500038 TO WS-MSGNBR.                                00553000
005540 RC-EXIT.                                                         00554000
005550     EXIT.                                                        00555000
005560******************************************************************00556000
005570 FIND-DEFAULT-MODEL SECTION.                                      00557000
005580 FDM-START.                                                       00558000
005590     MOVE 'N' TO WS-ERRORMODEL.                                   00559000
005600     MOVE RPTRM00-SK-INST TO RPMST-INST.                          00560000
005610     MOVE RPTRM00-SK-PRODCODE TO RPMST-PRODCODE.                  00561000
005620     MOVE RPTRM00-SK-ACCOUNT TO RPMST-ACCOUNT.                    00562000
005630     IF RPTRM00-SK-MODEL IS EQUAL TO LOW-VALUE                    00563000
005640         MOVE SPACES TO RPTRM00-SK-MODEL.                         00564000
005650     MOVE RPTRM00-SK-MODEL TO RPMST-MODEL.                        00565000
005660     PERFORM RPS-MST-GET-GE-REQUEST.                              00566000
005670     IF WS-FUNCTION IS EQUAL TO 'N'                               00567000
005680         OR WS-FUNCTION IS EQUAL TO 'E'                           00568000
005690         GO TO FDM-RECORD-NOT-FOUND.                              00569000
005700     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00570000
005710         MOVE WS-AB6320 TO RPTRM00-ABORT                          00571000
005720         MOVE WS-TR0007 TO RPTRM00-ABTRACE                        00572000
005730         MOVE 'Y' TO WS-ERRORMODEL                                00573000
005740         GO TO FDM-EXIT.                                          00574000
005750     IF RPMST-INST IS EQUAL TO RPTRM00-SK-INST                    00575000
005760         AND RPMST-PRODCODE IS EQUAL TO RPTRM00-SK-PRODCODE       00576000
005770         AND RPMST-ACCOUNT IS EQUAL TO RPTRM00-SK-ACCOUNT         00577000
005780         GO TO FDM-GET-NEXT-MST.                                  00578000
005790     GO TO FDM-RECORD-NOT-FOUND.                                  00579000
005800 FDM-GET-NEXT-MST.                                                00580000
005810     MOVE RPMST-MODEL TO RPTRM00-SK-MODEL.                        00581000
005820     MOVE RPTRM00-SK-INST TO WS-SAVEMSTINST.                      00582000
005830     MOVE RPTRM00-SK-PRODCODE TO WS-SAVEMSTPRODCODE.              00583000
005840     MOVE RPTRM00-SK-ACCOUNT TO WS-SAVEMSTACCOUNT.                00584000
005850     MOVE RPTRM00-SK-MODEL TO WS-SAVEMSTMODEL.                    00585000
005860     PERFORM RPS-MST-GET-NEXT-REQUEST.                            00586000
005870     IF WS-FUNCTION IS EQUAL TO 'E'                               00587000
005880         GO TO FDM-GOOD-RECORD.                                   00588000
005890     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00589000
005900         MOVE WS-AB6320 TO RPTRM00-ABORT                          00590000
005910         MOVE WS-TR0008 TO RPTRM00-ABTRACE                        00591000
005920         MOVE 'Y' TO WS-ERRORMODEL                                00592000
005930         GO TO FDM-EXIT.                                          00593000
005940     IF RPMST-INST IS EQUAL TO RPTRM00-SK-INST                    00594000
005950         AND RPMST-PRODCODE IS EQUAL TO RPTRM00-SK-PRODCODE       00595000
005960         AND RPMST-ACCOUNT IS EQUAL TO RPTRM00-SK-ACCOUNT         00596000
005970         GO TO FDM-MULTIPLE-PRIM.                                 00597000
005980 FDM-GOOD-RECORD.                                                 00598000
005990     MOVE WS-SAVEMSTINST TO RPTRM00-SK-INST.                      00599000
006000     MOVE WS-SAVEMSTPRODCODE TO RPTRM00-SK-PRODCODE.              00600000
006010     MOVE WS-SAVEMSTACCOUNT TO RPTRM00-SK-ACCOUNT.                00601000
006020     MOVE WS-SAVEMSTMODEL TO RPTRM00-SK-MODEL.                    00602000
006030     GO TO FDM-EXIT.                                              00603000
006040 FDM-RECORD-NOT-FOUND.                                            00604000
006050     MOVE 'Y' TO WS-ERRORMODEL.                                   00605000
006060     MOVE 500004 TO RPTRM00-MSGNBR.                               00606000
006070     GO TO FDM-EXIT.                                              00607000
006080 FDM-MULTIPLE-PRIM.                                               00608000
006090     MOVE 'Y' TO WS-ERRORMODEL.                                   00609000
006100     MOVE 500090 TO RPTRM00-MSGNBR.                               00610000
006110 FDM-EXIT.                                                        00611000
006120     EXIT.                                                        00612000
006130******************************************************************00613000
000000 COPY RPPIDXA.                                                    00614000
006150******************************************************************00615000
000000 COPY RPPMSTA.                                                    00616000
006170******************************************************************00617000
000000 COPY RPPTRMA.                                                    00618000
006190******************************************************************00619000
006200 MIC-MST-API SECTION.                                             00620000
000000 COPY MIPMSTA.                                                    00621000
006220******************************************************************00622000
006230 SLP096-GET-2023-RECORD SECTION.                                  00623000
000000 COPY SLP096.                                                     00624000
006250******************************************************************00625000
006260 OPERATOR-DIALOG-SECURITY SECTION.                                00626000
000000 COPY SRP079.                                                     00627000
006280******************************************************************00628000
006290 CICS-ABORT-EXIT SECTION.                                         00629000
006300 CAE-START.                                                       00630000
006310     GO TO CICS-RETURN.                                           00631000
006320 CAE-EXIT.                                                        00632000
006330     EXIT.                                                        00633000
006340******************************************************************00634000
006350 CICS-RETURN SECTION.                                             00635000
006360     IF COM-ABORT IS NOT EQUAL TO ZERO                            00636000
006370         MOVE COM-ABORT TO RPTRM00-ABORT.                         00637000
006380     IF RPTRM00-ABORT IS NOT EQUAL TO ZERO                        00638000
006390         MOVE 'Y' TO RPTRM00-ABTYPE.                              00639000
006400     IF RPTRM00-ABORT IS NOT EQUAL TO ZERO                        00640000
006410         MOVE WS-FUNCTION TO RPTRM00-FUNCTION                     00641000
006420         MOVE SRB-BMDB TO RPTRM00-SRBMDB                          00642000
006430         MOVE EIBFN TO RPTRM00-ABEIBFN                            00643000
006440         MOVE EIBRESP TO RPTRM00-ABEIBRESP                        00644000
006450         MOVE EIBRESP2 TO RPTRM00-ABEIBRESP2                      00645000
006460         MOVE EIBRCODE TO RPTRM00-ABEIBRCODE.                     00646000
006470     IF RPTRM00-ABTYPE IS NOT EQUAL TO 'Y'                        00647000
006480         PERFORM GLOBAL-CLOSE.                                    00648000
000000 COPY SLP709.                                                     00649000
006500******************************************************************00650000
006510 GLOBAL-CLOSE SECTION.                                            00651000
006520 GC-START.                                                        00652000
006530     IF RPTRM00-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  00653000
006540         PERFORM RPS-MST-GLOBAL-CLOSE-REQUEST.                    00654000
006550 GC-EXIT.                                                         00655000
006560     EXIT.                                                        00656000
006570******************************************************************00657000
