000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX39.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX39 - REAL TIME RELATIONSHIP MAINTENANCE INQUIRY       *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW105-AREAS.                                                00016000
000000 COPY SRW105.                                                     00017000
000180*01  BICRSRB.                                                     00018000
000000 COPY BICRSRB.                                                    00019000
000200*01  BICRPSB.                                                     00020000
000000 COPY BICRPSB.                                                    00021000
000220*01  BICRVERB.                                                    00022000
000000 COPY BICRVERB.                                                   00023000
000240*01  BICRSTAT.                                                    00024000
000000 COPY BICRSTAT.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRLOG.                                                     00028000
000000 COPY BICRLOG.                                                    00029000
000300*----------------------------------------------------------------*00030000
000310 01  SRW000-AREAS.                                                00031000
000000 COPY SRW000.                                                     00032000
000330 01  SRW060-AREAS.                                                00033000
000000 COPY SRW060.                                                     00034000
000350 01  SRW096-AREAS.                                                00035000
000000 COPY SLW096.                                                     00036000
000370 01  SRW710-AREAS.                                                00037000
000000 COPY SRW710.                                                     00038000
000390*----------------------------------------------------------------*00039000
000400 01  MIWMSTA-AREAS.                                               00040000
000000 COPY MIWMSTA.                                                    00041000
000420 01  MIMST-RECORD.                                                00042000
000000 COPY MISMST.                                                     00043000
000440 01  MI0237-RECORD.                                               00044000
000000 COPY MIS0237A.                                                   00045000
000460 01  MI2023-RECORD.                                               00046000
000000 COPY MIS2023A.                                                   00047000
000480 01  MIWHST-RECORD.                                               00048000
000000 COPY MIWHSTA.                                                    00049000
000500 01  MI7100-RECORD.                                               00050000
000000 COPY MIS7100.                                                    00051000
000520 01  MI7101-RECORD.                                               00052000
000000 COPY MIS7101.                                                    00053000
000540 01  MI7102-RECORD.                                               00054000
000000 COPY MIS7102.                                                    00055000
000560*----------------------------------------------------------------*00056000
000570 01  RPWPRI-AREAS.                                                00057000
000000 COPY RPWPRI.                                                     00058000
000590 01  RPWBNK-AREAS.                                                00059000
000000 COPY RPWBNKA.                                                    00060000
000610 01  RPBNK-RECORD.                                                00061000
000000 COPY RPSBNK.                                                     00062000
000630*----------------------------------------------------------------*00063000
000640*----------------------------------------------------------------*00064000
000650 01  WS-WORKAREAS.                                                00065000
000660     03  WS-MAX-PANEL-ENTRIES    PIC S9(04)      COMP             00066000
000670                                                 VALUE +0006.     00067000
000680     03  WS-MORELIT              PIC X(06)       VALUE SPACE.     00068000
000690     03  WS-HELPRETURN           PIC X(01)       VALUE 'N'.       00069000
000700     03  WS-ERR-PRODCD           PIC X(01)       VALUE 'N'.       00070000
000710     03  WS-ERR-ACCOUNT          PIC X(01)       VALUE 'N'.       00071000
000720     03  WS-ERR-RECID            PIC X(01)       VALUE 'N'.       00072000
000730     03  WS-ERR-MTYPE            PIC X(01)       VALUE 'N'.       00073000
000740     03  WS-ERR-RECTYPE          PIC X(01)       VALUE 'N'.       00074000
000750     03  WS-ERR-DATE             PIC X(01)       VALUE 'N'.       00075000
000760     03  WS-DATE-OPT             PIC X(01)       VALUE 'N'.       00076000
000770     03  WS-MANAGER              PIC X(02)       VALUE '50'.      00077000
000780     03  WS-APPLREC              PIC X(03)       VALUE 'RPS'.     00078000
000790     03  WS-STARTKEY             PIC X(84)       VALUE SPACES.    00079000
000800     03  WS-START-DATE           PIC S9(08)      VALUE ZEROS.     00080000
000810     03  WS-CODASYL-DATE         PIC S9(08)      VALUE ZEROS.     00081000
000820     03  WS-MICMDATE             PIC S9(08)      VALUE ZEROS.     00082000
000830     03  WS-FORWARD              PIC X(01)       VALUE SPACE.     00083000
000840     03  WS-HST-RPS-RECKEY.                                       00084000
000850         05  WS-HST-RPS-PRODCD   PIC X(06).                       00085000
000860         05  WS-HST-RPS-ACCOUNT  PIC X(18).                       00086000
000870         05  WS-HST-RPS-MODEL    PIC X(10).                       00087000
000880         05  WS-HST-RPS-FILLER   PIC X(18).                       00088000
000890     03  WS-BREAKDOWN.                                            00089000
000900         05  WSHST-INST          PIC 9(04).                       00090000
000910         05  WSHST-MANAGER       PIC 9(02).                       00091000
000920         05  WSHST-APPLREC       PIC X(03).                       00092000
000930         05  WSHST-RECKEY        PIC X(52).                       00093000
000940         05  WSHST-DATE          PIC S9(08).                      00094000
000950         05  WSHST-TIME          PIC 9(06).                       00095000
000960         05  WSHST-TIEBR         PIC 9(05).                       00096000
000970         05  WSHST-RECID         PIC X(04).                       00097000
000980     03  WS-PRIMARY-APPL         PIC 9(02).                       00098000
000990     03  WS-MAINPROGID           PIC X(08)       VALUE 'RPLXXX30'.00099000
001000     03  WS-MINQUIREPROGID       PIC X(08)       VALUE 'RPLXXX39'.00100000
001010     03  WS-MAX-CATEGORY         PIC S9(04)      COMP             00101000
001020                                                 VALUE +0020.     00102000
001030     03  WS-RP-PRODCODE          PIC X(06)       VALUE 'RP'.      00103000
001040     03  WS-CAT-INST             PIC 9(04)       VALUE ZERO.      00104000
001050     03  WS-CAT-NBR              PIC X(06)       VALUE SPACES.    00105000
001060     03  WS-SAVE-ACCT-TYPE       PIC 9(03)       VALUE ZERO.      00106000
001070     03  WS-SAVE-PRODCODE        PIC X(06)       VALUE SPACES.    00107000
001080     03  WS-CLOSE-FLAG           PIC X(01)       VALUE SPACES.    00108000
001090     03  WS-COMPLETE-MST-KEY-FL  PIC X(01)       VALUE 'N'.       00109000
001100     03  WS-7102-DEF-FLAG        PIC X(01)       VALUE 'N'.       00110000
001110     03  WS-7102-DEF-RECORD      PIC X(125)      VALUE SPACES.    00111000
001120     03  WS-SAVE-MSGNBR          PIC 9(06)       VALUE ZEROS.     00112000
001130     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00113000
001140     03  FILLER          REDEFINES WS-CURDATE.                    00114000
001150         05  WS-CURMM            PIC 9(02).                       00115000
001160         05  WS-CURDD            PIC 9(02).                       00116000
001170         05  WS-CURYYYY          PIC 9(04).                       00117000
001180     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00118000
001190     03  FILLER          REDEFINES WS-PDATE.                      00119000
001200         05  WS-PDATE-YYYY       PIC 9(04).                       00120000
001210         05  WS-PDATE-MM         PIC 9(02).                       00121000
001220         05  WS-PDATE-DD         PIC 9(02).                       00122000
001230     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00123000
001240     03  FILLER          REDEFINES WS-PDATE2.                     00124000
001250         05  WS-PDATE2-YYYY      PIC 9(04).                       00125000
001260         05  WS-PDATE2-MM        PIC 9(02).                       00126000
001270         05  WS-PDATE2-DD        PIC 9(02).                       00127000
001280     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00128000
001290                                                 VALUE ZERO.      00129000
001300     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00130000
001310                                                 VALUE ZERO.      00131000
001320     03  WS-ERRORMODEL           PIC X(01)       VALUE 'N'.       00132000
001330     03  WS-ERRORPRODCODE        PIC X(01)       VALUE 'N'.       00133000
001340     03  WS-NOTPRESENT           PIC X(40)       VALUE            00134000
001350         'NO CUSTOMER FOUND IN RCIF               '.              00135000
001360     03  WS-TERM                 PIC S9(05)      COMP-3           00136000
001370                                                 VALUE ZEROS.     00137000
001380     03  WS-SAVEMASTERGROUP.                                      00138000
001390         05  WS-SAVEMSTINST      PIC 9(04).                       00139000
001400         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00140000
001410         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00141000
001420         05  WS-SAVEMSTMODEL     PIC X(10).                       00142000
001430     03  WS-SAVESECGRPAIX1.                                       00143000
001440         05  WS-SAVSECAINST      PIC 9(04).                       00144000
001450         05  WS-SAVSECAACCOUNT   PIC X(18).                       00145000
001460         05  WS-SAVSECAPRODCODE  PIC X(06).                       00146000
001470*----------------------------------------------------------------*00147000
001480     03  WS-SUB1                 PIC S9(04)      COMP             00148000
001490                                                 VALUE +0000.     00149000
001500     03  WS-SUB2                 PIC S9(04)      COMP             00150000
001510                                                 VALUE +0000.     00151000
001520     03  WS-SUB3                 PIC S9(04)      COMP             00152000
001530                                                 VALUE +0000.     00153000
001540     03  WS-SUB4                 PIC S9(04)      COMP             00154000
001550                                                 VALUE +0000.     00155000
001560     03  WS-7114-SUB             PIC S9(04)      COMP             00156000
001570                                                 VALUE +0.        00157000
001580*----------------------------------------------------------------*00158000
001590     03  COM-HST-PRODCD          PIC X(06).                       00159000
001600     03  COM-HST-RECID           PIC X(04).                       00160000
001610     03  COM-INST                PIC 9(04).                       00161000
001620     03  COM-HST-ACCOUNT         PIC X(18).                       00162000
001630     03  COM-HST-MODEL           PIC X(10).                       00163000
001640     03  COM-HST-MTYPE           PIC X(01).                       00164000
001650     03  COM-ABORT               PIC S9(04)      COMP.            00165000
001660     03  WS-MIHSTCOUNT           PIC S9(03)      VALUE ZEROS.     00166000
001670     03  WS-FULLPAGE             PIC S9(03)      VALUE +8.        00167000
001680     03  WS-X9                   PIC 999.                         00168000
001690     03  WS-9TOX         REDEFINES WS-X9.                         00169000
001700         05  WS-FILL9            PIC X.                           00170000
001710         05  WS-9X               PIC XX.                          00171000
001720     03  WS-MICM-GRPKEY.                                          00172000
001730         05  WS-MIHST-INST       PIC 9(04).                       00173000
001740         05  WS-MIHST-MANAGER    PIC 9(02).                       00174000
001750         05  WS-MIHST-APPLREC    PIC X(03).                       00175000
001760         05  WS-MIHST-RECKEY     PIC X(52).                       00176000
001770         05  WS-MIHST-DATE       PIC S9(08).                      00177000
001780         05  WS-MIHST-TIME       PIC 9(06).                       00178000
001790         05  WS-MIHST-TIEBR      PIC 9(05).                       00179000
001800         05  WS-MIHST-RECID      PIC X(04).                       00180000
001810     03  COM-ABTRACEX.                                            00181000
001820         05  COM-ABTRACE         PIC 9(04)       COMP.            00182000
001830     03  COM-TSQWKKEY            PIC X(08).                       00183000
001840                                                                  00184000
001850     03  WS-HST-GRP-KEY.                                          00185000
001860         05  WS-HST-MANAGER      PIC 9(02).                       00186000
001870         05  FILLER              PIC X(01)       VALUE ','.       00187000
001880         05  WS-HST-APPLREC      PIC X(03).                       00188000
001890         05  FILLER              PIC X(01)       VALUE ','.       00189000
001900         05  WS-HST-RECKEY       PIC X(52).                       00190000
001910         05  FILLER              PIC X(01)       VALUE ','.       00191000
001920         05  WS-HST-DATE         PIC S9(08).                      00192000
001930         05  FILLER              PIC X(01)       VALUE ','.       00193000
001940         05  WS-HST-TIME         PIC 9(06).                       00194000
001950         05  FILLER              PIC X(01)       VALUE ','.       00195000
001960         05  WS-HST-TIEBR        PIC 9(05).                       00196000
001970         05  FILLER              PIC X(01)       VALUE ','.       00197000
001980         05  WS-HST-RECID        PIC X(04).                       00198000
001990 01  WS-TSQAREAS.                                                 00199000
002000     03  WS-TSQITEM              PIC S9(04)      COMP             00200000
002010                                                 VALUE +0001.     00201000
002020     03  WS-TSQLGTH              PIC S9(04)      COMP             00202000
002030                                                 VALUE +4096.     00203000
002040     03  WS-TSQKEY.                                               00204000
002050         05  WS-TSQID            PIC X(04).                       00205000
002060         05  WS-TSQTRMID         PIC X(04).                       00206000
002070 01  SLW720-AREAS.                                                00207000
000000 COPY SLW720.                                                     00208000
002090 01  SLS720-RECORD.                                               00209000
000000 COPY SLS720.                                                     00210000
002110 01  LS-TSQAREA.                                                  00211000
002120     03  LS-TSQKEY               PIC X(08).                       00212000
002130     03  LS-TSQDATA              PIC X(4088).                     00213000
002140 01  MIWPRI-AREAS.                                                00214000
000000 COPY MIWPRI.                                                     00215000
002160 01  MIHST-RECORD.                                                00216000
000000 COPY MISHST         SUPPRESS.                                    00217000
002180                             COPY DFHAID.                         00218000
002190 01  WS-ABORT-CODES.                                              00219000
002200     03  WS-AB2000               PIC S9(04)      COMP             00220000
002210                                                 VALUE +2000.     00221000
002220     03  WS-AB2033               PIC S9(04)      COMP             00222000
002230                                                 VALUE +2033.     00223000
002240     03  WS-AB3073               PIC S9(04)      COMP             00224000
002250                                                 VALUE +3073.     00225000
002260     03  WS-AB6305               PIC S9(04)      COMP             00226000
002270                                                 VALUE +6305.     00227000
002280*----------------------------------------------------------------*00228000
002290 01  WS-TRACE-CODES.                                              00229000
002300     03  WS-TR0001               PIC S9(04)      COMP             00230000
002310                                                 VALUE +0001.     00231000
002320     03  WS-TR0002               PIC S9(04)      COMP             00232000
002330                                                 VALUE +0002.     00233000
002340     03  WS-TR0003               PIC S9(04)      COMP             00234000
002350                                                 VALUE +0003.     00235000
002360     03  WS-TR0004               PIC S9(04)      COMP             00236000
002370                                                 VALUE +0004.     00237000
002380*----------------------------------------------------------------*00238000
002390*----------------------------------------------------------------*00239000
002400 01  WS-LINKAPPL.                                                 00240000
000000 COPY MISCNT00      REPLACING                                     00241000
002420     ==:MICNT:== BY ==RPINF00==.                                  00242000
000000 COPY RPSINF00.                                                   00243000
002440*----------------------------------------------------------------*00244000
002450******************************************************************00245000
002460 LINKAGE SECTION.                                                 00246000
002470 01  DFHCOMMAREA.                                                 00247000
000000 COPY MISCNT00      REPLACING                                     00248000
002490             ==:MICNT:== BY ==RPXXX30==.                          00249000
000000 COPY RPSXXX30.                                                   00250000
002510*01  SLW096-2023RECORDS.                                          00251000
002520*++IMBED  SLW096L   COBOL     *  - PD=MI  RL=51  RP=N  SP=N       00252000
002530******************************************************************00253000
002540 PROCEDURE DIVISION.                                              00254000
002550******************************************************************00255000
002560 ENTRY-ROUTINE SECTION.                                           00256000
002570 ER-START.                                                        00257000
002580     MOVE WS-MINQUIREPROGID TO SR-APIPROGLIT.                     00258000
002590     MOVE WS-MINQUIREPROGID TO RPXXX30-ABPROGID.                  00259000
002600     MOVE WS-MINQUIREPROGID TO RPXXX30-RESP-PROGRAM.              00260000
002610     PERFORM CICS-HANDLE-CONDITION.                               00261000
002620     IF EIBCALEN IS EQUAL TO +0                                   00262000
002630         MOVE WS-AB2000 TO RPXXX30-ABORT                          00263000
002640         MOVE WS-AB2000 TO RPXXX30-RESP-ABORT                     00264000
002650         MOVE WS-TR0001 TO RPXXX30-ABTRACE                        00265000
002660         MOVE WS-TR0001 TO RPXXX30-RESP-TRACE                     00266000
002670         GO TO CICS-RETURN.                                       00267000
002680     MOVE ZERO TO RPXXX30-RESP-MSG-NBR.                           00268000
002690     MOVE SPACE TO WS-FUNCTION.                                   00269000
002700     MOVE ZEROS TO WS-SAVE-MSGNBR.                                00270000
002710     MOVE SPACE TO RPXXX30-FILEOPTS.                              00271000
002720     MOVE RPXXX30-FILEOPTS TO WS-FILEOPTS.                        00272000
002730     MOVE RPXXX30-OPERID TO WS-UPD-USER.                          00273000
000000 COPY SLP094.                                                     00274000
002750     GO TO VERIFY-KEY.                                            00275000
002760 ER-EXIT.                                                         00276000
002770     EXIT.                                                        00277000
002780******************************************************************00278000
002790 CICS-HANDLE-CONDITION SECTION.                                   00279000
000000 COPY SLP702.                                                     00280000
002810     MOVE WS-AB2033 TO RPXXX30-ABORT.                             00281000
002820     MOVE WS-AB2033 TO RPXXX30-RESP-ABORT.                        00282000
002830     MOVE WS-TR0002 TO RPXXX30-ABTRACE.                           00283000
002840     MOVE WS-TR0002 TO RPXXX30-RESP-TRACE.                        00284000
002850     GO TO CICS-RETURN.                                           00285000
002860 CHC-EXIT.                                                        00286000
002870     EXIT.                                                        00287000
002880******************************************************************00288000
002890 VERIFY-KEY SECTION.                                              00289000
002900 VK-START.                                                        00290000
002910     PERFORM INITIALIZE-MSG.                                      00291000
002920     MOVE ZERO TO RPXXX30-ABORT.                                  00292000
002930     MOVE ZERO TO RPXXX30-RESP-ABORT.                             00293000
002940     MOVE ZERO TO COM-ABORT.                                      00294000
002950     MOVE RPXXX30-DATE TO WS-CURDATE.                             00295000
002960     MOVE WS-CURMM TO WS-PDATE-MM.                                00296000
002970     MOVE WS-CURDD TO WS-PDATE-DD.                                00297000
002980     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00298000
002990     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00299000
003000     MOVE RPXXX30-PRIMARY-INST TO COM-INST.                       00300000
003010     IF RPXXX30-PRIMARY-PROD-CODE IS EQUAL TO SPACES              00301000
003020         OR RPXXX30-PRIMARY-PROD-CODE IS EQUAL TO LOW-VALUES      00302000
003030         MOVE SPACES TO RPXXX30-PRIMARY-PROD-CODE.                00303000
003040     MOVE RPXXX30-PRIMARY-PROD-CODE TO COM-HST-PRODCD.            00304000
003050     IF RPXXX30-PRIMARY-ACCT-NBR IS EQUAL TO SPACES               00305000
003060         OR RPXXX30-PRIMARY-ACCT-NBR  IS EQUAL TO LOW-VALUES      00306000
003070         MOVE SPACES TO RPXXX30-PRIMARY-ACCT-NBR.                 00307000
003080     MOVE RPXXX30-PRIMARY-ACCT-NBR TO COM-HST-ACCOUNT.            00308000
003090     IF RPXXX30-HST-MODEL IS EQUAL TO SPACES                      00309000
003100         OR RPXXX30-HST-MODEL IS EQUAL TO LOW-VALUES              00310000
003110         MOVE SPACES TO RPXXX30-HST-MODEL.                        00311000
003120     MOVE RPXXX30-HST-MODEL TO COM-HST-MODEL.                     00312000
003130* ****************************************************            00313000
003140     IF RPXXX30-HST-RECORD-CODE IS EQUAL TO LOW-VALUE             00314000
003150         OR RPXXX30-HST-RECORD-CODE IS EQUAL TO ZEROS             00315000
003160         MOVE SPACES TO RPXXX30-HST-RECORD-CODE.                  00316000
003170     MOVE RPXXX30-HST-RECORD-CODE TO COM-HST-RECID.               00317000
003180 VK-MTYPE.                                                        00318000
003190     IF RPXXX30-HST-MAINT-TYPE IS EQUAL TO LOW-VALUE              00319000
003200         MOVE SPACES TO RPXXX30-HST-MAINT-TYPE.                   00320000
003210     MOVE RPXXX30-HST-MAINT-TYPE TO COM-HST-MTYPE.                00321000
003220 VK-DATE.                                                         00322000
003230     MOVE ZEROS TO WS-START-DATE.                                 00323000
003240     MOVE ZEROS TO WS-CODASYL-DATE.                               00324000
003250     IF RPXXX30-HST-STARTDATE IS NOT EQUAL TO SPACES              00325000
003260         AND RPXXX30-HST-STARTDATE IS NOT EQUAL TO LOW-VALUE      00326000
003270         AND RPXXX30-HST-STARTDATE IS NOT EQUAL TO ZEROS          00327000
003280         MOVE RPXXX30-HST-STARTDATE TO SR-CODASYL-EDITED          00328000
003290         PERFORM DEEDIT-CODASYL-DATE                              00329000
003300         IF SR-CDERROR IS NOT EQUAL TO SPACE                      00330000
003310             MOVE 'Y' TO WS-ERR-DATE                              00331000
003320             MOVE 000002 TO WS-MSGNBR                             00332000
003330             END-IF                                               00333000
003340         MOVE SR-CODASYL TO WS-START-DATE                         00334000
003350         MOVE SR-CODASYL TO WS-CODASYL-DATE                       00335000
003360         SUBTRACT 99999999 FROM WS-START-DATE                     00336000
003370         MOVE 'Y' TO WS-DATE-OPT.                                 00337000
003380*                                                                 00338000
003390     IF RPXXX30-HST-NEXTKEY IS NOT EQUAL TO SPACES                00339000
003400         AND RPXXX30-HST-NEXTKEY IS NOT EQUAL TO LOW-VALUE        00340000
003410         AND RPXXX30-HST-NEXTKEY IS NOT EQUAL TO ZEROS            00341000
003420         MOVE RPXXX30-PRIMARY-INST TO COM-INST                    00342000
003430         MOVE RPXXX30-PRIMARY-PROD-CODE TO COM-HST-PRODCD         00343000
003440         MOVE RPXXX30-PRIMARY-ACCT-NBR TO COM-HST-ACCOUNT         00344000
003450         MOVE 'Y' TO WS-FORWARD                                   00345000
003460         MOVE RPXXX30-HST-NEXTKEY TO WS-STARTKEY                  00346000
003470         GO TO VK-EXIT.                                           00347000
003480     IF RPXXX30-PRIMARY-INST IS EQUAL TO SPACE                    00348000
003490         MOVE LOW-VALUE TO RPXXX30-PRIMARY-INST.                  00349000
003500     IF RPXXX30-PRIMARY-PROD-CODE IS EQUAL TO SPACE               00350000
003510         MOVE LOW-VALUE TO RPXXX30-PRIMARY-PROD-CODE.             00351000
003520     IF RPXXX30-PRIMARY-ACCT-NBR IS EQUAL TO SPACE                00352000
003530         MOVE LOW-VALUE TO RPXXX30-PRIMARY-ACCT-NBR.              00353000
003540     IF RPXXX30-PRIMARY-PROD-CODE IS EQUAL TO LOW-VALUE           00354000
003550         AND RPXXX30-PRIMARY-ACCT-NBR IS EQUAL TO LOW-VALUE       00355000
003560         AND RPXXX30-PRIMARY-INST IS EQUAL TO LOW-VALUE           00356000
003570         AND RPXXX30-HST-MODEL IS EQUAL TO LOW-VALUE              00357000
003580         AND RPXXX30-HST-RECORD-CODE IS EQUAL TO LOW-VALUE        00358000
003590         AND RPXXX30-HST-MAINT-TYPE IS EQUAL TO LOW-VALUE         00359000
003600         AND RPXXX30-HST-STARTDATE IS EQUAL TO LOW-VALUE          00360000
003610         MOVE 'Y' TO WS-ERR-ACCOUNT                               00361000
003620         MOVE 000001 TO WS-MSGNBR.                                00362000
003630     IF WS-ERR-ACCOUNT IS EQUAL TO 'Y'                            00363000
003640         OR WS-ERR-PRODCD IS EQUAL TO 'Y'                         00364000
003650         OR WS-ERR-RECID IS EQUAL TO 'Y'                          00365000
003660         OR WS-ERR-MTYPE IS EQUAL TO 'Y'                          00366000
003670         OR WS-ERR-RECTYPE IS EQUAL TO 'Y'                        00367000
003680         OR WS-ERR-DATE IS EQUAL TO 'Y'                           00368000
003690         MOVE WS-MSGNBR TO RPXXX30-RESP-MSG-NBR                   00369000
003700         GO TO VK-RETURN.                                         00370000
003710     GO TO VK-EXIT.                                               00371000
003720 VK-RETURN.                                                       00372000
003730     MOVE 'E' TO RPXXX30-RETURN.                                  00373000
003740     GO TO CICS-RETURN.                                           00374000
003750 VK-EXIT.                                                         00375000
003760     EXIT.                                                        00376000
003770******************************************************************00377000
003780 ROUTING-ROUTINE SECTION.                                         00378000
003790 RR-START.                                                        00379000
003800* CHECK HERE FOR NEW REQUEST OR FORWARD REQUEST.                  00380000
003810* IF NEW SAVE ORIGINAL REQUEST KEYS.                              00381000
003820     IF RPXXX30-HST-NEXTKEY IS EQUAL TO SPACES                    00382000
003830         OR RPXXX30-HST-NEXTKEY IS EQUAL TO LOW-VALUE             00383000
003840         OR RPXXX30-HST-NEXTKEY IS EQUAL TO ZEROS                 00384000
003850         PERFORM SET-REQ-KEY                                      00385000
003860         MOVE 'N' TO WS-FORWARD                                   00386000
003870         PERFORM LOAD-MICM-MAINT-RECORD                           00387000
003880         ELSE                                                     00388000
003890         MOVE RPXXX30-HST-NEXTKEY TO WS-STARTKEY                  00389000
003900         PERFORM SET-REQ-KEY-AGAIN                                00390000
003910         MOVE 'Y' TO WS-FORWARD                                   00391000
003920         PERFORM LOAD-MICM-MAINT-RECORD.                          00392000
003930 RR-RETURN.                                                       00393000
003940     GO TO CICS-RETURN.                                           00394000
003950 RR-EXIT.                                                         00395000
003960     EXIT.                                                        00396000
003970******************************************************************00397000
003980* ** ** MICM HISTORY RETRIEVE                                     00398000
003990 LOAD-MICM-MAINT-RECORD SECTION.                                  00399000
004000 LMMR-START.                                                      00400000
004010     PERFORM CREATE-MICMHST.                                      00401000
004020 LMMR-EXIT.                                                       00402000
004030     EXIT.                                                        00403000
004040 CREATE-MICMHST SECTION.                                          00404000
004050 CRT-START.                                                       00405000
004060     MOVE ZERO TO WS-MIHSTCOUNT.                                  00406000
004070     IF WS-FORWARD IS EQUAL TO 'Y'                                00407000
004080         GO TO CRT-NEXT.                                          00408000
004090     MOVE LOW-VALUE TO MIHST-GRP-KEY.                             00409000
004100     MOVE COM-INST TO MIHST-INST.                                 00410000
004110     MOVE WS-MANAGER TO MIHST-MANAGER.                            00411000
004120     IF WS-DATE-OPT IS EQUAL TO 'Y'                               00412000
004130         MOVE WS-START-DATE TO MIHST-DATE.                        00413000
004140     MOVE WS-APPLREC TO MIHST-APPLREC.                            00414000
004150     MOVE RPXXX30-PRIMARY-PROD-CODE  TO WS-HST-RPS-PRODCD.        00415000
004160     MOVE RPXXX30-PRIMARY-ACCT-NBR TO WS-HST-RPS-ACCOUNT.         00416000
004170     MOVE RPXXX30-HST-MODEL TO WS-HST-RPS-MODEL.                  00417000
004180     MOVE RPXXX30-HST-MODEL TO COM-HST-MODEL.                     00418000
004190     MOVE SPACES TO WS-HST-RPS-FILLER.                            00419000
004200     MOVE WS-HST-RPS-RECKEY TO MIHST-RECKEY.                      00420000
004210     MOVE WS-START-DATE TO MIHST-DATE.                            00421000
004220     MOVE ZEROS TO MIHST-TIME.                                    00422000
004230     MOVE ZEROS TO MIHST-TIEBR.                                   00423000
004240     MOVE COM-HST-RECID TO MIHST-RECID.                           00424000
004250 CRT-NEXT.                                                        00425000
004260     PERFORM MIC-HST-GET-EQUAL-REQUEST.                           00426000
004270     MOVE MIHST-RECKEY TO RPXXX30-HST-NEXTKEY.                    00427000
004280     IF WS-FUNCTION IS EQUAL TO 'N'                               00428000
004290         OR WS-FUNCTION IS EQUAL TO 'E'                           00429000
004300         GO TO CRT-HSTDONE.                                       00430000
004310     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00431000
004320         MOVE WS-AB3073 TO COM-ABORT                              00432000
004330         MOVE WS-TR0003 TO COM-ABTRACE                            00433000
004340         GO TO CICS-ABORT-EXIT.                                   00434000
004350     MOVE MIHST-RECKEY TO WS-HST-RPS-RECKEY.                      00435000
004360***                                                               00436000
004370     IF RPXXX30-PRIMARY-INST IS NOT EQUAL TO MIHST-INST           00437000
004380         OR MIHST-MANAGER IS NOT EQUAL TO WS-MANAGER              00438000
004390         OR MIHST-APPLREC IS NOT EQUAL TO WS-APPLREC              00439000
004400         OR RPXXX30-PRIMARY-PROD-CODE IS NOT EQUAL TO             00440000
004410             WS-HST-RPS-PRODCD                                    00441000
004420         OR RPXXX30-PRIMARY-ACCT-NBR IS NOT EQUAL TO              00442000
004430             WS-HST-RPS-ACCOUNT                                   00443000
004440         MOVE 004550 TO RPXXX30-HST-STARTDATE                     00444000
004450         GO TO CRT-HSTDONE.                                       00445000
004460     GO TO CRT-HST-TEST.                                          00446000
004470 CRT-HSTLOOP.                                                     00447000
004480     PERFORM MIC-HST-GET-NEXT-REQUEST.                            00448000
004490     IF WS-FUNCTION IS EQUAL TO 'N'                               00449000
004500         OR WS-FUNCTION IS EQUAL TO 'E'                           00450000
004510         GO TO CRT-HSTDONE.                                       00451000
004520     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00452000
004530         MOVE WS-AB3073 TO COM-ABORT                              00453000
004540         MOVE WS-TR0004 TO COM-ABTRACE                            00454000
004550         GO TO CICS-ABORT-EXIT.                                   00455000
004560     MOVE MIHST-RECKEY TO WS-HST-RPS-RECKEY.                      00456000
004570     IF RPXXX30-PRIMARY-INST IS NOT EQUAL TO MIHST-INST           00457000
004580         OR MIHST-MANAGER IS NOT EQUAL TO WS-MANAGER              00458000
004590         OR MIHST-APPLREC IS NOT EQUAL TO WS-APPLREC              00459000
004600         OR RPXXX30-PRIMARY-PROD-CODE IS NOT EQUAL TO             00460000
004610             WS-HST-RPS-PRODCD                                    00461000
004620         OR RPXXX30-PRIMARY-ACCT-NBR IS NOT EQUAL TO              00462000
004630             WS-HST-RPS-ACCOUNT                                   00463000
004640         GO TO CRT-HSTDONE.                                       00464000
004650*****************************************************             00465000
004660 CRT-HST-TEST.                                                    00466000
004670     IF RPXXX30-HST-RECORD-CODE IS NOT EQUAL TO SPACE             00467000
004680         AND RPXXX30-HST-RECORD-CODE IS NOT EQUAL TO ZERO         00468000
004690         AND RPXXX30-HST-RECORD-CODE IS NOT EQUAL TO LOW-VALUE    00469000
004700         AND RPXXX30-HST-RECORD-CODE IS NOT EQUAL TO MIHST-RECID  00470000
004710         GO TO CRT-HSTLOOP.                                       00471000
004720     IF RPXXX30-HST-MODEL IS NOT EQUAL TO SPACE                   00472000
004730         AND RPXXX30-HST-MODEL IS NOT EQUAL TO ZERO               00473000
004740         AND RPXXX30-HST-MODEL IS NOT EQUAL TO LOW-VALUE          00474000
004750         AND RPXXX30-HST-MODEL IS NOT EQUAL TO                    00475000
004760             WS-HST-RPS-MODEL                                     00476000
004770         GO TO CRT-HSTLOOP.                                       00477000
004780     IF RPXXX30-HST-MAINT-TYPE IS NOT EQUAL TO SPACE              00478000
004790         AND RPXXX30-HST-MAINT-TYPE IS NOT EQUAL TO ZERO          00479000
004800         AND RPXXX30-HST-MAINT-TYPE IS NOT EQUAL TO LOW-VALUE     00480000
004810         AND RPXXX30-HST-MAINT-TYPE IS NOT EQUAL TO MIHST-TYPE    00481000
004820         GO TO CRT-HSTLOOP.                                       00482000
004830     IF WS-DATE-OPT IS NOT EQUAL TO 'Y'                           00483000
004840         GO TO CRT-HSTLOOP-STAT.                                  00484000
004850     MOVE MIHST-DATE TO WS-MICMDATE.                              00485000
004860     ADD +99999999 TO WS-MICMDATE.                                00486000
004870     IF WS-MICMDATE IS GREATER THAN WS-CODASYL-DATE               00487000
004880         OR WS-MICMDATE IS EQUAL TO WS-CODASYL-DATE               00488000
004890         GO TO CRT-HSTLOOP-STAT.                                  00489000
004900     GO TO CRT-HSTLOOP.                                           00490000
004910 CRT-HSTLOOP-STAT.                                                00491000
004920     IF WS-MIHSTCOUNT IS EQUAL TO WS-FULLPAGE                     00492000
004930         OR WS-MIHSTCOUNT IS GREATER THAN WS-FULLPAGE             00493000
004940         PERFORM SET-MHST-EXIT                                    00494000
004950         GO TO CRT-EXIT.                                          00495000
004960     ADD 1 TO WS-MIHSTCOUNT.                                      00496000
004970     MOVE MIHST-MANAGER TO WS-HST-MANAGER.                        00497000
004980     MOVE MIHST-APPLREC TO WS-HST-APPLREC.                        00498000
004990     MOVE MIHST-RECKEY TO WS-HST-RECKEY.                          00499000
005000     MOVE MIHST-DATE TO WS-HST-DATE.                              00500000
005010     ADD +99999999 TO WS-HST-DATE.                                00501000
005020     MOVE MIHST-TIME TO WS-HST-TIME.                              00502000
005030     MOVE MIHST-TIEBR TO WS-HST-TIEBR.                            00503000
005040     MOVE MIHST-RECID TO WS-HST-RECID.                            00504000
005050* * ***************************************************           00505000
005060*    SEND BACK                                                    00506000
005070     MOVE WS-HST-DATE TO RPXXX30-MIHST-DATE (WS-MIHSTCOUNT).      00507000
005080     MOVE WS-HST-TIME TO RPXXX30-MIHST-TIME (WS-MIHSTCOUNT).      00508000
005090     MOVE MIHST-RECCD TO RPXXX30-MIHST-RECCD (WS-MIHSTCOUNT).     00509000
005100     MOVE MIHST-APPLCD TO RPXXX30-MIHST-APPLCD (WS-MIHSTCOUNT).   00510000
005110     MOVE MIHST-FLDNBR TO RPXXX30-MIHST-FLDNBR (WS-MIHSTCOUNT).   00511000
005120     MOVE MIHST-FLDNAME TO RPXXX30-MIHST-FLDNAME (WS-MIHSTCOUNT). 00512000
005130     MOVE MIHST-2NDKEY TO RPXXX30-MIHST-2NDKEY (WS-MIHSTCOUNT).   00513000
005140     MOVE MIHST-OPERID TO RPXXX30-MIHST-OPERID (WS-MIHSTCOUNT).   00514000
005150     MOVE MIHST-USER TO RPXXX30-MIHST-USER (WS-MIHSTCOUNT).       00515000
005160     MOVE MIHST-BEFORE TO RPXXX30-MIHST-BEFORE (WS-MIHSTCOUNT).   00516000
005170     MOVE MIHST-AFTER TO RPXXX30-MIHST-AFTER (WS-MIHSTCOUNT).     00517000
005180     MOVE MIHST-TYPE TO RPXXX30-MIHST-TYPE (WS-MIHSTCOUNT).       00518000
005190     GO TO CRT-HSTLOOP.                                           00519000
005200 CRT-HSTDONE.                                                     00520000
005210     MOVE SPACES TO RPXXX30-HST-NEXTKEY.                          00521000
005220     MOVE 'E' TO RPXXX30-MIHST-STATUS.                            00522000
005230     MOVE WS-MIHSTCOUNT TO WS-X9.                                 00523000
005240     MOVE WS-9X TO RPXXX30-MIHST-RETURNED.                        00524000
005250     MOVE ZERO TO WS-MIHSTCOUNT.                                  00525000
005260* ****************************************************            00526000
005270 CRT-EXIT.                                                        00527000
005280     EXIT.                                                        00528000
005290******************************************************************00529000
005300 SET-MHST-EXIT SECTION.                                           00530000
005310     MOVE MIHST-INST TO WS-MIHST-INST.                            00531000
005320     MOVE MIHST-MANAGER TO WS-MIHST-MANAGER.                      00532000
005330     MOVE MIHST-APPLREC TO WS-MIHST-APPLREC.                      00533000
005340     MOVE MIHST-RECKEY TO WS-MIHST-RECKEY.                        00534000
005350     MOVE MIHST-DATE TO WS-MIHST-DATE.                            00535000
005360     MOVE MIHST-TIME TO WS-MIHST-TIME.                            00536000
005370     MOVE MIHST-TIEBR TO WS-MIHST-TIEBR.                          00537000
005380     MOVE MIHST-RECID TO WS-MIHST-RECID.                          00538000
005390     MOVE WS-MICM-GRPKEY TO RPXXX30-HST-NEXTKEY.                  00539000
005400     MOVE 'M' TO RPXXX30-MIHST-STATUS.                            00540000
005410     MOVE '08' TO RPXXX30-MIHST-RETURNED.                         00541000
005420     MOVE ZERO TO WS-MIHSTCOUNT.                                  00542000
005430 SHE-EXIT.                                                        00543000
005440     EXIT.                                                        00544000
005450 SET-REQ-KEY SECTION.                                             00545000
005460* * *********************************************************     00546000
005470* * SET UP KEY FOR MICM HISTORY                                   00547000
005480* **********************************************************      00548000
005490     MOVE LOW-VALUE TO MIHST-GRP-KEY.                             00549000
005500     MOVE COM-INST TO MIHST-INST.                                 00550000
005510     MOVE WS-MANAGER TO MIHST-MANAGER.                            00551000
005520     IF WS-DATE-OPT IS EQUAL TO 'Y'                               00552000
005530         MOVE WS-START-DATE TO MIHST-DATE.                        00553000
005540     MOVE WS-APPLREC TO MIHST-APPLREC.                            00554000
005550     MOVE COM-HST-PRODCD TO WS-HST-RPS-PRODCD.                    00555000
005560     MOVE COM-HST-ACCOUNT TO WS-HST-RPS-ACCOUNT.                  00556000
005570     MOVE COM-HST-MODEL TO WS-HST-RPS-MODEL.                      00557000
005580     MOVE SPACES TO WS-HST-RPS-FILLER.                            00558000
005590     MOVE WS-HST-RPS-RECKEY TO MIHST-RECKEY.                      00559000
005600     MOVE ZEROS TO MIHST-TIME.                                    00560000
005610     MOVE ZEROS TO MIHST-TIEBR.                                   00561000
005620     MOVE COM-HST-RECID TO MIHST-RECID.                           00562000
005630 SRK-EXIT.                                                        00563000
005640     EXIT.                                                        00564000
005650 SET-REQ-KEY-AGAIN SECTION.                                       00565000
005660* * *********************************************************     00566000
005670* * SET UP KEY FOR RETURNING MICM HISTORY                         00567000
005680* **********************************************************      00568000
005690     MOVE LOW-VALUE TO MIHST-GRP-KEY.                             00569000
005700     MOVE WS-STARTKEY TO WS-BREAKDOWN.                            00570000
005710     MOVE WSHST-INST TO MIHST-INST.                               00571000
005720     MOVE WSHST-MANAGER TO MIHST-MANAGER.                         00572000
005730     MOVE WSHST-DATE TO MIHST-DATE.                               00573000
005740     MOVE WSHST-APPLREC TO MIHST-APPLREC.                         00574000
005750     MOVE WSHST-RECKEY TO MIHST-RECKEY.                           00575000
005760     MOVE WSHST-TIME TO MIHST-TIME.                               00576000
005770     MOVE WSHST-TIEBR TO MIHST-TIEBR.                             00577000
005780     MOVE WSHST-RECID TO MIHST-RECID.                             00578000
005790 SRK-EXIT.                                                        00579000
005800     EXIT.                                                        00580000
005810******************************************************************00581000
005820 INITIALIZE-MSG SECTION.                                          00582000
005830 IM-START.                                                        00583000
005840     MOVE ZEROS TO RPXXX30-RESP-MSG-NBR.                          00584000
005850     MOVE +0000 TO RPXXX30-ABORT.                                 00585000
005860     MOVE +0000 TO RPXXX30-RESP-ABORT.                            00586000
005870     MOVE +0000 TO RPXXX30-ERRCNT.                                00587000
005880     MOVE +0000 TO RPXXX30-INQ-OCCUR.                             00588000
005890     MOVE +0000 TO RPXXX30-INQ-TABLE-OCCURS.                      00589000
005900     INITIALIZE RPXXX30-MIHST-ITEM (1).                           00590000
005910     INITIALIZE RPXXX30-MIHST-ITEM (2).                           00591000
005920     INITIALIZE RPXXX30-MIHST-ITEM (3).                           00592000
005930     INITIALIZE RPXXX30-MIHST-ITEM (4).                           00593000
005940     INITIALIZE RPXXX30-MIHST-ITEM (5).                           00594000
005950     INITIALIZE RPXXX30-MIHST-ITEM (6).                           00595000
005960     INITIALIZE RPXXX30-MIHST-ITEM (7).                           00596000
005970     INITIALIZE RPXXX30-MIHST-ITEM (8).                           00597000
005980 IM-EXIT.                                                         00598000
005990     EXIT.                                                        00599000
006000******************************************************************00600000
006010 MIC-MST-API SECTION.                                             00601000
000000 COPY MIPMSTA.                                                    00602000
006030******************************************************************00603000
006040 CALL-MIC-HST SECTION.                                            00604000
000000 COPY MIPHSTA.                                                    00605000
006060******************************************************************00606000
006070 DEEDIT-CODASYL-DATE SECTION.                                     00607000
000000 COPY SRP086.                                                     00608000
006090******************************************************************00609000
006100 CICS-ABORT-EXIT SECTION.                                         00610000
006110 CAE-START.                                                       00611000
006120     GO TO CICS-RETURN.                                           00612000
006130 CAE-EXIT.                                                        00613000
006140     EXIT.                                                        00614000
006150******************************************************************00615000
006160 CICS-RETURN SECTION.                                             00616000
006170     IF COM-ABORT IS NOT EQUAL TO ZERO                            00617000
006180         MOVE COM-ABORT TO RPXXX30-ABORT.                         00618000
006190     IF RPXXX30-ABORT IS NOT EQUAL TO ZERO                        00619000
006200         MOVE WS-MINQUIREPROGID TO RPXXX30-RESP-PROGRAM           00620000
006210         MOVE WS-FUNCTION TO RPXXX30-FUNCTION                     00621000
006220         MOVE SRB-BMDB TO RPXXX30-SRBMDB                          00622000
006230         MOVE EIBFN TO RPXXX30-ABEIBFN                            00623000
006240         MOVE EIBRESP TO RPXXX30-ABEIBRESP                        00624000
006250         MOVE EIBRESP2 TO RPXXX30-ABEIBRESP2                      00625000
006260         MOVE EIBRCODE TO RPXXX30-ABEIBRCODE.                     00626000
006270     IF RPXXX30-RESP-MSG-NBR IS NOT EQUAL TO ZERO                 00627000
006280         AND RPXXX30-RESP-PROGRAM IS NOT EQUAL TO SPACES          00628000
006290         MOVE WS-MINQUIREPROGID TO RPXXX30-RESP-PROGRAM.          00629000
000000 COPY SLP709.                                                     00630000
006310******************************************************************00631000
