000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX32.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX32 - REAL TIME QUALIFY MODULE                         *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRDBS.                                                     00024000
000000 COPY BICRDBS.                                                    00025000
000260*01  BICRLOG.                                                     00026000
000000 COPY BICRLOG.                                                    00027000
000280*----------------------------------------------------------------*00028000
000290 01  SLS140-RECORD.                                               00029000
000000 COPY SLS140.                                                     00030000
000310 01  SLW096-AREAS.                                                00031000
000000 COPY SLW096.                                                     00032000
000330 01  SRW000-AREAS.                                                00033000
000000 COPY SRW000.                                                     00034000
000350 01  SRW009-AREAS.                                                00035000
000000 COPY SRW009.                                                     00036000
000370 01  SRW060-AREAS.                                                00037000
000000 COPY SRW060.                                                     00038000
000390 01  SRW105-AREAS.                                                00039000
000000 COPY SRW105.                                                     00040000
000410 01  SRW710-AREAS.                                                00041000
000000 COPY SRW710.                                                     00042000
000430*----------------------------------------------------------------*00043000
000440 01  RPWPRI-AREAS.                                                00044000
000000 COPY RPWPRI.                                                     00045000
000460 01  RPACTA-AREA.                                                 00046000
000000 COPY RPWACTA.                                                    00047000
000480 01  RPACT-RECORD.                                                00048000
000000 COPY RPSACT.                                                     00049000
000500 01  RPWBNK-AREAS.                                                00050000
000000 COPY RPWBNKA.                                                    00051000
000520 01  RPBNK-RECORD.                                                00052000
000000 COPY RPSBNK.                                                     00053000
000540 01  RPWENR-AREA.                                                 00054000
000000 COPY RPWENRA.                                                    00055000
000560 01  RPENR-RECORD.                                                00056000
000000 COPY RPSENR.                                                     00057000
P0022  01  RPWIDX-AREA.                                                 00057200
000000 COPY RPWIDXA.                                                    00057400
P0022  01  RPIDX-RECORD.                                                00057600
000000 COPY RPSIDX.                                                     00057800
000580 01  RPWMST-AREA.                                                 00058000
000000 COPY RPWMSTA.                                                    00059000
000600 01  RPMST-RECORD.                                                00060000
000000 COPY RPSMST.                                                     00061000
000620 01  RPWREL-AREA.                                                 00062000
000000 COPY RPWRELA.                                                    00063000
000640 01  RPREL-RECORD.                                                00064000
000000 COPY RPSREL.                                                     00065000
000660 01  RPWTRM-AREA.                                                 00066000
000000 COPY RPWTRMA.                                                    00067000
000680 01  RPTRM-RECORD.                                                00068000
000000 COPY RPSTRM.                                                     00069000
000700*----------------------------------------------------------------*00070000
000710 01  MIWPRI-AREAS.                                                00071000
000000 COPY MIWPRI.                                                     00072000
000730 01  MIWMSTA-AREAS.                                               00073000
000000 COPY MIWMSTA.                                                    00074000
000750 01  FILLER                      PIC X(08)       VALUE '*MISMST*'.00075000
000760 01  MIMST-RECORD.                                                00076000
000000 COPY MISMST.                                                     00077000
000780 01  FILLER                      PIC X(08)       VALUE '*MISCSF*'.00078000
000790 01  MICSF-RECORD.                                                00079000
000000 COPY MISCSF.                                                     00080000
000810 01  FILLER                      PIC X(08)       VALUE '*MI0237*'.00081000
000820 01  MI0237-RECORD.                                               00082000
000000 COPY MIS0237A.                                                   00083000
000840 01  FILLER                      PIC X(08)       VALUE '*MI2001*'.00084000
000850 01  MI2001-RECORD.                                               00085000
000000 COPY MIS2001A.                                                   00086000
000870 01  FILLER                      PIC X(08)       VALUE '*MI2023*'.00087000
000880 01  MI2023-RECORD.                                               00088000
000000 COPY MIS2023A.                                                   00089000
000900 01  FILLER                      PIC X(08)       VALUE '*MI2024*'.00090000
000910 01  MI2024-RECORD.                                               00091000
000000 COPY MIS2024A.                                                   00092000
000930 01  FILLER                      PIC X(08)       VALUE '*MI7100*'.00093000
000940 01  MI7100-RECORD.                                               00094000
000000 COPY MIS7100.                                                    00095000
000960 01  FILLER                      PIC X(08)       VALUE '*MI7101*'.00096000
000970 01  MI7101-RECORD.                                               00097000
000000 COPY MIS7101.                                                    00098000
000990 01  FILLER                      PIC X(08)       VALUE '*MI7102*'.00099000
001000 01  MI7102-RECORD.                                               00100000
000000 COPY MIS7102.                                                    00101000
001020 01  FILLER                      PIC X(08)       VALUE '*MI7103*'.00102000
001030 01  MI7103-RECORD.                                               00103000
000000 COPY MIS7103.                                                    00104000
001050 01  FILLER                      PIC X(08)       VALUE '*MI7104*'.00105000
001060 01  MI7104-RECORD.                                               00106000
000000 COPY MIS7104.                                                    00107000
001080 01  FILLER                      PIC X(08)       VALUE '*MI7105*'.00108000
001090 01  MI7105-RECORD.                                               00109000
000000 COPY MIS7105.                                                    00110000
001110 01  FILLER                      PIC X(08)       VALUE '*MI7106*'.00111000
001120 01  MI7106-RECORD.                                               00112000
000000 COPY MIS7106.                                                    00113000
001140 01  FILLER                      PIC X(08)       VALUE '*MI7107*'.00114000
001150 01  MI7107-RECORD.                                               00115000
000000 COPY MIS7107.                                                    00116000
001170 01  FILLER                      PIC X(08)       VALUE '*MI7110*'.00117000
001180 01  MI7110-RECORD.                                               00118000
000000 COPY MIS7110.                                                    00119000
001200 01  FILLER                      PIC X(08)       VALUE '*MI7114*'.00120000
001210 01  MI7114-RECORD.                                               00121000
000000 COPY MIS7114.                                                    00122000
001230*----------------------------------------------------------------*00123000
001240 01  WS-RPMIM2001AREAS.                                           00124000
000000 COPY RPW2001.                                                    00125000
001260 01  WS-RPMIM2023AREAS.                                           00126000
000000 COPY RPW2023.                                                    00127000
001280 01  WS-RPMIM7101AREAS.                                           00128000
000000 COPY RPW7101.                                                    00129000
001300 01  WS-RPMIM7102AREAS.                                           00130000
000000 COPY RPW7102.                                                    00131000
001320 01  WS-RPMIM7103AREAS.                                           00132000
000000 COPY RPW7103.                                                    00133000
001340 01  WS-RPMIM7104AREAS.                                           00134000
000000 COPY RPW7104.                                                    00135000
001360 01  WS-RPMIM7105AREAS.                                           00136000
000000 COPY RPW7105.                                                    00137000
001380 01  WS-RPMIM7106AREAS.                                           00138000
000000 COPY RPW7106.                                                    00139000
001400 01  WS-RPMIM7107AREAS.                                           00140000
000000 COPY RPW7107.                                                    00141000
001420 01  WS-RPMIM7110AREAS.                                           00142000
000000 COPY RPW7110.                                                    00143000
001440 01  WS-RPMIM7114AREAS.                                           00144000
000000 COPY RPW7114.                                                    00145000
001460*----------------------------------------------------------------*00146000
P0110  01  WS-PRIMRELCD-WORKAREA.                                       00146300
000000 COPY RPW007.                                                     00146600
001470 01  RPW015-AREAS.                                                00147000
000000 COPY RPW015.                                                     00148000
001490 01  RPW138-AREAS.                                                00149000
000000 COPY RPW138.                                                     00150000
001510*----------------------------------------------------------------*00151000
P0022 *         WORK AREAS TO DETERMINE MILI SECONDS                   *00151200
P0022 *----------------------------------------------------------------*00151400
000000 COPY RPW005.                                                     00151600
P0022 *----------------------------------------------------------------*00151800
001520 01  WS-WORKAREAS.                                                00152000
001530     03  COM-ABORT               PIC S9(04)      COMP.            00153000
001540     03  WS-MAINPROGID           PIC X(08)       VALUE 'RPLXXX30'.00154000
001550     03  WS-VALIDPROGID          PIC X(08)       VALUE 'RPLXXX32'.00155000
001560     03  WS-WORK-PRODCD          PIC X(06)       VALUE SPACES.    00156000
001570     03  WS-MODEL                PIC X(10)       VALUE SPACES.    00157000
001580     03  WS-ACT-FOUND            PIC X(01)       VALUE SPACES.    00158000
001590     03  WS-KEEP-FLAG            PIC X(01)       VALUE SPACES.    00159000
P0045      03  WS-PRIMOPT-FAIL         PIC X(01)       VALUE SPACES.    00159200
P0045      03  WS-SAVE-ACCT-TYPE       PIC 9(03)       VALUE ZERO.      00159400
P0045      03  WS-SAVE-PRODCODE        PIC X(06)       VALUE SPACES.    00159600
001600     03  WS-PRIM-FATAL-ERROR     PIC X(01).                       00160000
001610     03  WS-PRIM-CUST-EXISTS     PIC X(01).                       00161000
P0084      03  WS-RATEMODEL            PIC X(10)       VALUE SPACE.     00161500
001620     03  WS-IDNBR                PIC 9(18)       VALUE ZERO.      00162000
001630     03  FILLER          REDEFINES WS-IDNBR.                      00163000
001640         05  WS-IDNBR-DATE       PIC 9(08).                       00164000
001650         05  WS-IDNBR-TIME       PIC 9(06).                       00165000
P0022          05  WS-IDNBR-DECSEC     PIC 9(02).                       00166000
P0022          05  WS-IDNBR-SEQ        PIC 9(02).                       00166290
001670     03  WS-NUMOFACCOUNTS        PIC S9(05)      COMP-3           00167000
001680                                                 VALUE ZEROS.     00168000
001690     03  WS-NUMOFPRODUCTS        PIC S9(05)      COMP-3           00169000
001700                                                 VALUE ZEROS.     00170000
001710     03  WS-LAST-PRODCD          PIC X(06)       VALUE SPACES.    00171000
001720     03  WS-PRIMARY-APPL         PIC 9(02).                       00172000
001730     03  WS-WORK-APPL            PIC 9(02)       VALUE ZEROS.     00173000
001740     03  WS-MODEL-REQS           PIC X(01)       VALUE 'N'.       00174000
001750     03  WS-MIN-MAX-PROD-REQS    PIC X(01)       VALUE 'N'.       00175000
001760     03  WS-MIN-MAX-ACCT-REQS    PIC X(01)       VALUE 'N'.       00176000
001770     03  WS-PROD-GROUPS-REQS     PIC X(01)       VALUE 'N'.       00177000
001780     03  WS-7102-FOUND           PIC X(01)       VALUE 'N'.       00178000
001790     03  WS-PRODCODE-SEARCH      PIC X(06)       VALUE SPACES.    00179000
001800     03  WS-FOUND-PRODCODE       PIC X(01)       VALUE SPACE.     00180000
001810     03  WS-WORK-TYPE            PIC 9(03)       VALUE ZEROS.     00181000
001820     03  WS-RATE-OPTION          PIC X(01).                       00182000
001830     03  WS-RF21-RETURN          PIC X(01)       VALUE SPACE.     00183000
001840     03  WSRF21-BASE-RCIF-KEY.                                    00184000
001850         05  WSRF21-BASE-CUST-INST                                00185000
001860                                 PIC 9(04).                       00186000
001870         05  WSRF21-BASE-CUST-TYPE                                00187000
001880                                 PIC X(01).                       00188000
001890         05  WSRF21-BASE-CUST.                                    00189000
001900             07  WSRF21-BASE-ALPHA                                00190000
001910                                 PIC X(14).                       00191000
001920             07  WSRF21-BASE-ACCUM                                00192000
001930                                 PIC 9(03).                       00193000
001940             07  WSRF21-BASE-TIEBRKR                              00194000
001950                                 PIC 9(04).                       00195000
001960     03  WS-7102-DEF-FLAG        PIC X(01)       VALUE 'N'.       00196000
001970     03  WS-7102-DEF-RECORD      PIC X(125)      VALUE SPACES.    00197000
001980     03  WS-SAVE-MSGNBR          PIC 9(06)       VALUE ZEROS.     00198000
001990     03  WS-COBOLTIME.                                            00199000
002000         05  WS-COB-HHMMSS.                                       00200000
002010             07  WS-COB-HH       PIC 9(02).                       00201000
002020             07  WS-COB-MM       PIC 9(02).                       00202000
002030             07  WS-COB-SS       PIC 9(02).                       00203000
002040     03  WS-CURDTYYYYMMDD        PIC 9(08)       VALUE ZEROS.     00204000
002050     03  FILLER          REDEFINES WS-CURDTYYYYMMDD.              00205000
002060         05  WS-CURDTYYYY        PIC 9(04).                       00206000
002070         05  WS-CURDTMMDD        PIC 9(04).                       00207000
002080         05  FILLER      REDEFINES WS-CURDTMMDD.                  00208000
002090             07  WS-CURDTMM      PIC 9(02).                       00209000
002100             07  WS-CURDTDD      PIC 9(02).                       00210000
002110     03  WS-DATEMMDDYYYY         PIC 9(08)       VALUE ZEROS.     00211000
002120     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00212000
002130     03  FILLER          REDEFINES WS-PDATE.                      00213000
002140         05  WS-PDATE-YYYY       PIC 9(04).                       00214000
002150         05  WS-PDATE-MM         PIC 9(02).                       00215000
002160         05  WS-PDATE-DD         PIC 9(02).                       00216000
P0022      03  WS-EXPDATE              PIC 9(08)       VALUE ZERO.      00216100
P0022      03  FILLER          REDEFINES WS-EXPDATE.                    00216200
P0022          05  WS-EXPDATE-YYYY     PIC 9(04).                       00216300
P0022          05  WS-EXPDATE-MM       PIC 9(02).                       00216400
P0022          05  WS-EXPDATE-DD       PIC 9(02).                       00216500
002170     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00217000
002180                                                 VALUE ZERO.      00218000
002190     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00219000
002200     03  FILLER          REDEFINES WS-CURDATE.                    00220000
002210         05  WS-CURMM            PIC 9(02).                       00221000
002220         05  WS-CURDD            PIC 9(02).                       00222000
002230         05  WS-CURYYYY          PIC 9(04).                       00223000
002240     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00224000
002250                                                 VALUE ZERO.      00225000
002260     03  WS-7106-TABLE.                                           00226000
002270         05  WS-7106-ENTRIES                     OCCURS 20 TIMES. 00227000
002280             07  WS-7106-INST    PIC 9(04).                       00228000
002290             07  WS-7106-CAT     PIC X(06).                       00229000
002300             07  WS-7106-BALREQ  PIC S9(09)V99   COMP-3.          00230000
002310     03  WS-ERRORMODEL           PIC X(01)       VALUE 'N'.       00231000
002320     03  WS-ERRORPRODCODE        PIC X(01)       VALUE 'N'.       00232000
002330     03  WS-MODEL-ERROR          PIC X(01)       VALUE 'N'.       00233000
002340     03  WS-SAVEMASTERGROUP.                                      00234000
002350         05  WS-SAVEMSTINST      PIC 9(04).                       00235000
002360         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00236000
002370         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00237000
002380         05  WS-SAVEMSTMODEL     PIC X(10).                       00238000
002390     03  WS-SAVESECGRPAIX1.                                       00239000
002400         05  WS-SAVSECAINST      PIC 9(04).                       00240000
002410         05  WS-SAVSECAACCOUNT   PIC X(18).                       00241000
002420         05  WS-SAVSECAPRODCODE  PIC X(06).                       00242000
002430     03  WS-EXPIRED-RELATIONSHIP PIC X(01)       VALUE 'N'.       00243000
002440     03  WS-ACCTRELCD-O          PIC S9(03)      COMP-3           00244000
002450                                                 VALUE ZEROS.     00245000
002460     03  WS-PRIMARY-ENROLL       PIC X(01)       VALUE 'N'.       00246000
002470     03  WS-EXPIRATION-DATE      PIC S9(09)      COMP-3.          00247000
P0110      03  WS-EXPIRED-MODEL        PIC X(10)       VALUE SPACES.    00248000
P0110      03  WS-EXPIRED-STATUS       PIC X(01)       VALUE 'N'.       00248190
P0110      03  WS-EXPIRED-FLAG         PIC X(01)       VALUE 'N'.       00248380
002490     03  WS-WORK-COMBBALCD       PIC 9(02)       VALUE ZEROS.     00249000
002500     03  WS-7101COMBBALCD1       PIC 9(02)       VALUE ZEROS.     00250000
002510     03  WS-7101COMBBALREQ1      PIC S9(13)V99   COMP-3           00251000
002520                                                 VALUE ZEROS.     00252000
002530     03  WS-7101COMBBALCD2       PIC 9(02)       VALUE ZEROS.     00253000
002540     03  WS-7101COMBBALREQ2      PIC S9(13)V99   COMP-3           00254000
002550                                                 VALUE ZEROS.     00255000
002560     03  WS-7101COMBBALCD3       PIC 9(02)       VALUE ZEROS.     00256000
002570     03  WS-7101COMBBALREQ3      PIC S9(13)V99   COMP-3           00257000
002580                                                 VALUE ZEROS.     00258000
002590     03  WS-7101COMBBALCD4       PIC 9(02)       VALUE ZEROS.     00259000
002600     03  WS-7101COMBBALREQ4      PIC S9(13)V99   COMP-3           00260000
002610                                                 VALUE ZEROS.     00261000
002620     03  WS-PRIMCATBAL           PIC S9(13)V99   COMP-3           00262000
002630                                                 VALUE ZEROS.     00263000
002640     03  WS-MINACCTS             PIC S9(03)      COMP-3           00264000
002650                                                 VALUE ZEROS.     00265000
002660     03  WS-MINACCTS-PG          PIC S9(03)      COMP-3           00266000
002670                                                 VALUE ZEROS.     00267000
002680     03  WS-MAXSECACCTS          PIC S9(03)      COMP-3           00268000
002690                                                 VALUE ZEROS.     00269000
002700     03  WS-MINPRODS             PIC S9(03)      COMP-3           00270000
002710                                                 VALUE ZEROS.     00271000
002720     03  WS-MAXPRODS             PIC S9(03)      COMP-3           00272000
002730                                                 VALUE ZEROS.     00273000
002740     03  WS-MINACCTS-2           PIC S9(03)      COMP-3           00274000
002750                                                 VALUE ZEROS.     00275000
002760     03  WS-MAXACCTS-2           PIC S9(03)      COMP-3           00276000
002770                                                 VALUE ZEROS.     00277000
002780     03  WS-MINPROD-GRP          PIC S9(03)      COMP-3           00278000
002790                                                 VALUE ZEROS.     00279000
002800     03  WS-MAXPROD-GRP          PIC S9(03)      COMP-3           00280000
002810                                                 VALUE ZEROS.     00281000
002820     03  WS-ACT-SEQNBR           PIC S9(03)      COMP-3           00282000
002830                                                 VALUE ZEROS.     00283000
002840     03  WS-MST-SEQNBR           PIC S9(03)      COMP-3           00284000
002850                                                 VALUE ZEROS.     00285000
002860     03  WS-REL-SEQNBR           PIC S9(03)      COMP-3           00286000
002870                                                 VALUE ZEROS.     00287000
002880     03  WS-TRM-SEQNBR           PIC S9(03)      COMP-3           00288000
002890                                                 VALUE ZEROS.     00289000
002900     03  WS-SAV7102-RATETYPE     PIC X(01)       VALUE SPACES.    00290000
002910     03  WS-RATE-BAL             PIC S9(13)V99   COMP-3           00291000
002920                                                 VALUE ZEROS.     00292000
002930     03  WS-RATE-PCT             PIC SV9(05)     COMP-3           00293000
002940                                                 VALUE ZEROS.     00294000
002950     03  WS-TERM                 PIC S9(05)      COMP-3           00295000
002960                                                 VALUE ZEROS.     00296000
002970     03  WS-RPACT-RATEINC-QUAL   PIC X(01)       VALUE SPACES.    00297000
002980*----------------------------------------------------------------*00298000
P0045      03  WS-SAVE-MIM7104REC      PIC X(101).                      00298200
P0045      03  WS-SAVE-PRIM-RELCD      PIC 9(02).                       00298400
P0045 *----------------------------------------------------------------*00298600
002990     03  WS-RELATIONSHIP-TABLE.                                   00299000
003000         05  WS-REL-INST         PIC 9(04).                       00300000
003010         05  WS-REL-INST2        PIC 9(04).                       00301000
003020         05  WS-REL-PRODCODE     PIC X(06).                       00302000
003030         05  WS-REL-ACCOUNT      PIC X(18).                       00303000
003040         05  WS-REL-BRANCH       PIC S9(05)      COMP-3.          00304000
003050         05  WS-REL-ACCT-TYPE                                     00305000
003060                                 PIC S9(03)      COMP-3.          00306000
003070         05  WS-REL-TERM         PIC S9(05)      COMP-3.          00307000
003080         05  WS-REL-NAME         PIC X(40).                       00308000
003090         05  WS-REL-APPL         PIC 9(02).                       00309000
003100         05  WS-REL-SCINCOPT                                      00310000
003110                                 PIC X(01).                       00311000
003120         05  WS-REL-SCDISCAMT                                     00312000
003130                                 PIC S9(03)V99   COMP-3.          00313000
003140         05  WS-REL-SCDISCPCT                                     00314000
003150                                 PIC SV9(05)     COMP-3.          00315000
003160         05  WS-REL-SCCATCODE                                     00316000
003170                                 PIC X(06).                       00317000
003180         05  WS-REL-DISCAMT-OVRD-FLAG                             00318000
003190                                 PIC X(01).                       00319000
003200         05  WS-REL-DISCPCT-OVRD-FLAG                             00320000
003210                                 PIC X(01).                       00321000
003220         05  WS-REL-DISCAMT-OVRD                                  00322000
003230                                 PIC S9(03)V99   COMP-3.          00323000
003240         05  WS-REL-DISCPCT-OVRD                                  00324000
003250                                 PIC SV9(05)     COMP-3.          00325000
003260         05  WS-REL-RATEINCOPT                                    00326000
003270                                 PIC X(01).                       00327000
003280         05  WS-REL-RATEOPTION                                    00328000
003290                                 PIC X(01).                       00329000
003300         05  WS-REL-RATETYPE     PIC X(01).                       00330000
003310         05  WS-REL-RATEPCT      PIC SV9(09)     COMP-3.          00331000
003320         05  WS-REL-RATECATCODE                                   00332000
003330                                 PIC X(06).                       00333000
003340         05  WS-REL-TIMEPROCOPT                                   00334000
003350                                 PIC X(01).                       00335000
003360         05  WS-REL-RATEPCT-OVRD-FLAG                             00336000
003370                                 PIC X(01).                       00337000
003380         05  WS-REL-RATEPCT-OVRD                                  00338000
003390                                 PIC SV9(05)     COMP-3.          00339000
003400         05  WS-REL-ACCTDEL      PIC X(01).                       00340000
003410         05  WS-REL-PRIMCATCODE                                   00341000
003420                                 PIC X(06).                       00342000
003430         05  WS-REL-PRIMBAL      PIC S9(13)V99   COMP-3.          00343000
003440         05  WS-REL-PRIMBALREQ                                    00344000
003450                                 PIC S9(13)V99   COMP-3.          00345000
003460         05  WS-REL-BALCATCODE1                                   00346000
003470                                 PIC X(06).                       00347000
003480         05  WS-REL-BAL1         PIC S9(13)V99   COMP-3.          00348000
003490         05  WS-REL-BALREQ1      PIC S9(13)V99   COMP-3.          00349000
003500         05  WS-REL-BALCATCODE2                                   00350000
003510                                 PIC X(06).                       00351000
003520         05  WS-REL-BAL2         PIC S9(13)V99   COMP-3.          00352000
003530         05  WS-REL-BALREQ2      PIC S9(13)V99   COMP-3.          00353000
003540         05  WS-REL-ACCTRATEBAL                                   00354000
003550                                 PIC S9(13)V99   COMP-3.          00355000
003560         05  WS-REL-SCBAL        PIC S9(13)V99   COMP-3.          00356000
003570         05  WS-REL-SECSVCBAL                                     00357000
003580                                 PIC S9(13)V99   COMP-3.          00358000
003590         05  WS-REL-SECSVCPLAN                                    00359000
003600                                 PIC X(06).                       00360000
003610         05  WS-REL-SECSVCTABLE                                   00361000
003620                                 PIC X(06).                       00362000
003630         05  WS-REL-ACCT-STATUS                                   00363000
003640                                 PIC X(01).                       00364000
003650         05  WS-REL-SEC-SERVICE                                   00365000
003660                                 PIC X(01).                       00366000
003670         05  WS-REL-SECSVCOPT                                     00367000
003680                                 PIC X(01).                       00368000
003690         05  WS-REL-BONUSRATEOPT                                  00369000
003700                                 PIC X(01).                       00370000
003710*----------------------------------------------------------------*00371000
003720     03  WS-SUB1                 PIC S9(04)      COMP             00372000
003730                                                 VALUE +0000.     00373000
003740     03  WS-SUB2                 PIC S9(04)      COMP             00374000
003750                                                 VALUE +0000.     00375000
003760     03  WS-SUB3                 PIC S9(04)      COMP             00376000
003770                                                 VALUE +0000.     00377000
003780     03  WS-SUB4                 PIC S9(04)      COMP             00378000
003790                                                 VALUE +0000.     00379000
003800     03  WS-SUB5                 PIC S9(04)      COMP             00380000
003810                                                 VALUE +0000.     00381000
003820     03  WS-SUB6                 PIC S9(04)      COMP             00382000
003830                                                 VALUE +0000.     00383000
003840     03  WS-SUB7                 PIC S9(04)      COMP             00384000
003850                                                 VALUE +0000.     00385000
003860     03  WS-SUB8                 PIC S9(04)      COMP             00386000
003870                                                 VALUE +0000.     00387000
003880     03  WS-SUBAUTO              PIC S9(04)      COMP             00388000
003890                                                 VALUE +0.        00389000
003900     03  WS-SUBINST              PIC S9(04)      COMP             00390000
003910                                                 VALUE +0.        00391000
003920     03  WS-SUBSEC               PIC S9(04)      COMP             00392000
003930                                                 VALUE +0.        00393000
P0110      03  WS-SUBSEC2              PIC S9(04)      COMP             00393300
P0110                                                  VALUE +0.        00393600
003940     03  WS-SUBPROD              PIC S9(04)      COMP             00394000
003950                                                 VALUE +0.        00395000
003960     03  WS-SUBPG                PIC S9(04)      COMP             00396000
003970                                                 VALUE +0.        00397000
003980     03  WS-SUBADD               PIC S9(04)      COMP             00398000
003990                                                 VALUE +0.        00399000
004000     03  WS-SUBPCODE             PIC S9(04)      COMP             00400000
004010                                                 VALUE +0.        00401000
004020     03  WS-SUBRATE              PIC S9(04)      COMP             00402000
004030                                                 VALUE +0.        00403000
004040     03  WS-SUBINDR              PIC S9(04)      COMP             00404000
004050                                                 VALUE +0.        00405000
004060     03  WS-TIER-SUB             PIC S9(04)      COMP             00406000
004070                                                 VALUE +0.        00407000
004080     03  WS-7114-SUB             PIC S9(04)      COMP             00408000
004090                                                 VALUE +0.        00409000
004100*----------------------------------------------------------------*00410000
004110     03  WS-WORK-BALCD           PIC 9(02)       VALUE ZEROS.     00411000
004120     03  WS-WORK-BALANCE         PIC S9(13)V99   COMP-3           00412000
004130                                                 VALUE ZEROS.     00413000
004140     03  WS-SECCATBAL            PIC S9(13)V99   COMP-3           00414000
004150                                                 VALUE ZEROS.     00415000
004160     03  WS-COMBINEBAL1          PIC S9(15)V99   COMP-3           00416000
004170                                                 VALUE ZEROS.     00417000
004180     03  WS-COMBINEBAL2          PIC S9(15)V99   COMP-3           00418000
004190                                                 VALUE ZEROS.     00419000
004200     03  WS-COMBINEBAL3          PIC S9(15)V99   COMP-3           00420000
004210                                                 VALUE ZEROS.     00421000
004220     03  WS-COMBINEBAL4          PIC S9(15)V99   COMP-3           00422000
004230                                                 VALUE ZEROS.     00423000
004240*----------------------------------------------------------------*00424000
004250     03  WS-PRIMARY-TABLE.                                        00425000
004260         05  WS-PRIM-INFO.                                        00426000
004270             07  WS-PRIM-PRODCD  PIC X(06).                       00427000
004280             07  WS-PRIM-APPL    PIC 9(02).                       00428000
004290             07  WS-PRIM-BRANCH  PIC 9(05).                       00429000
004300             07  WS-PRIM-TYPE    PIC 9(03).                       00430000
004310             07  WS-PRIM-ACCT    PIC X(18).                       00431000
004320             07  WS-PRIM-SCNXT   PIC S9(09)      COMP-3.          00432000
004330             07  WS-PRIM-7102    PIC X(01).                       00433000
004340             07  WS-PRIM-MODEL   PIC X(10).                       00434000
004350             07  WS-PRIM-SCINCOPT                                 00435000
004360                                 PIC X(01).                       00436000
004370             07  WS-PRIM-RATEINCOPT                               00437000
004380                                 PIC X(01).                       00438000
004390             07  WS-PRIM-RATEINCTABLE                             00439000
004400                                 PIC X(06).                       00440000
004410             07  WS-PRIM-RATETYPE                                 00441000
004420                                 PIC X(01).                       00442000
004430             07  WS-PRIM-RATEPCT                                  00443000
004440                                 PIC SV9(09)     COMP-3.          00444000
004450             07  WS-PRIM-TIMEPROCOPT                              00445000
004460                                 PIC X(01).                       00446000
004470             07  WS-PRIM-PROD-GROUP                               00447000
004480                                 PIC 9(01).                       00448000
004490     03  WS-SECONDARY-MAX        PIC S9(04)      COMP             00449000
004500                                                 VALUE +1000.     00450000
004510     03  WS-SECONDARY-TABLE.                                      00451000
004520         05  WS-SEC-INFO                         OCCURS           00452000
004530                                                 1000 TIMES.      00453000
004540             07  WS-SEC-PRODCD   PIC X(06).                       00454000
004550             07  WS-SEC-APPL     PIC 9(02).                       00455000
004560             07  WS-SEC-BRANCH   PIC 9(05).                       00456000
004570             07  WS-SEC-TYPE     PIC 9(03).                       00457000
004580             07  WS-SEC-INST     PIC 9(04).                       00458000
004590             07  WS-SEC-ACCT     PIC X(18).                       00459000
004600             07  WS-SEC-RELNBR   PIC 9(02).                       00460000
P0110              07  WS-SEC-PRIMCUSTRELNBR                            00461000
004620                                 PIC 9(02).                       00462000
004630             07  WS-SEC-RPOPT    PIC X(01).                       00463000
004640     03  WS-SECONDARY-TABLE1.                                     00464000
004650         05  WS-SEC-INFO1                        OCCURS           00465000
004660                                                 1000 TIMES.      00466000
004670             07  WS-SEC-SECACCT  PIC X(01).                       00467000
004680             07  WS-SEC-QUAL     PIC X(01).                       00468000
004690             07  WS-SEC-SCINCOPT                                  00469000
004700                                 PIC X(01).                       00470000
004710             07  WS-SEC-RATEINCOPT                                00471000
004720                                 PIC X(01).                       00472000
004730             07  WS-SEC-RATEINCTABLE                              00473000
004740                                 PIC X(06).                       00474000
004750             07  WS-SEC-RATETYPE PIC X(01).                       00475000
004760             07  WS-SEC-TIMEPROCOPT                               00476000
004770                                 PIC X(01).                       00477000
004780             07  WS-SEC-BAL1     PIC S9(15)V99   COMP-3.          00478000
004790             07  WS-SEC-BAL2     PIC S9(15)V99   COMP-3.          00479000
004800             07  WS-SEC-BAL3     PIC S9(15)V99   COMP-3.          00480000
004810             07  WS-SEC-BAL4     PIC S9(15)V99   COMP-3.          00481000
004820             07  WS-SEC-PROD-GROUP                                00482000
004830                                 PIC 9(01).                       00483000
004840             07  WS-SEC-7102     PIC X(01).                       00484000
004850*----------------------------------------------------------------*00485000
004860     03  WS-APPLICATION-TABLE.                                    00486000
004870         05  WS-APPLTBL-INTRFACEX.                                00487000
004880             07  WS-INTRFACE     PIC X(08)       OCCURS 100 TIMES.00488000
004890     03  WS-CAC-MAX              PIC S9(04)      COMP             00489000
004900                                                 VALUE +33.       00490000
004910     03  WS-CAC-TABLE.                                            00491000
004920         05  WS-CAC-INFO                         OCCURS 33 TIMES. 00492000
004930             07  WS-CAC-INST     PIC 9(04).                       00493000
004940             07  WS-CAC-PRODCD   PIC X(06).                       00494000
004950             07  WS-CAC-ACCT     PIC X(18).                       00495000
004960             07  WS-CAC-RELNBR   PIC 9(02).                       00496000
004970         05 FILLER               PIC X(10)       VALUE SPACES.    00497000
004980     03  WS-PGSEARCH-MAX         PIC S9(04)      COMP             00498000
004990                                                 VALUE +99.       00499000
005000     03  WS-PGSEARCH-TABLE.                                       00500000
005010         05  WS-PGSEARCH                         OCCURS 99 TIMES. 00501000
005020             07  WS-PG-PRODCD    PIC X(06).                       00502000
005030             07  WS-PG-TYPE      PIC 9(03).                       00503000
005040             07  WS-PG-7102      PIC X(01).                       00504000
005050     03  WS-RPXXX30-CSTTBL-MAX   PIC S9(04)      COMP             00505000
005060                                                 VALUE +05.       00506000
005070     03  WS-RPXXX30-CUST-TABLE.                                   00507000
005080         05  WS-RPXXX30-CUSTOMERS                OCCURS 5 TIMES.  00508000
P0015              07  WS-RPXXX30-CUST-NO                               00509000
P0015                                  PIC 9(13).                       00509390
P0015              07  WS-RPXXX30-CUST-NA                               00509780
P0015                                  PIC X(40).                       00510170
005110             07  WS-RPXXX30-CUST-TYPE                             00511000
005120                                 PIC X(01).                       00512000
005130             07  WS-RPXXX30-TIE-BRKR                              00513000
005140                                 PIC 9(04).                       00514000
005150             07  WS-RPXXX30-REL-CODE                              00515000
005160                                 PIC X(02).                       00516000
005170             07  WS-RPXXX30-CUST-KEY.                             00517000
005180                 09  WS-RPXXX30-CUST-KEY-ALPHA                    00518000
005190                                 PIC X(14).                       00519000
005200                 09  WS-RPXXX30-ACCUM-VALUE                       00520000
005210                                 PIC 9(03).                       00521000
005220                 09  WS-RPXXX30-TIE-BREAKER                       00522000
005230                                 PIC 9(04).                       00523000
005240             07  WS-RPXXX30-FOUND-FLAG                            00524000
005250                                 PIC X(01).                       00525000
P0022 *----------------------------------------------------------------*00525200
P0022  01  RPW004-AREAS.                                                00525400
000000 COPY RPW004.                                                     00525600
005260*----------------------------------------------------------------*00526000
005310     03  WS-0237-MAX             PIC S9(04)      COMP             00531000
005320                                                 VALUE +1000.     00532000
005330     03  WS-0237-TABLE.                                           00533000
005340         05  WS-0237-INTRFACE                    OCCURS           00534000
005350                                                 1000 TIMES       00535000
005360                                 ASCENDING KEY IS WS-0237-KEY     00536000
005370                                 INDEXED BY INDX-0237.            00537000
005380             07  WS-0237-KEY.                                     00538000
005390                 09  WS-0237-INST                                 00539000
005400                                 PIC 9(04).                       00540000
005410                 09  WS-0237-APPL                                 00541000
005420                                 PIC 9(02).                       00542000
005430             07  WS-0237-INTF    PIC X(08).                       00543000
005440     03  WS-0237TEST-KEY.                                         00544000
005450         05  WS-0237TEST-INST    PIC 9(04).                       00545000
005460         05  WS-0237TEST-APPL    PIC 9(02).                       00546000
005470*----------------------------------------------------------------*00547000
005480     03  WS-PRODCODE-MAX         PIC S9(04)      COMP             00548000
005490                                                 VALUE +1000.     00549000
005500     03  WS-PRODCODE-TABLE.                                       00550000
005510         05  WS-PRODCODE-INFO                    OCCURS           00551000
005520                                                 1000 TIMES.      00552000
005530             07  WS-PRODCODE     PIC X(06).                       00553000
005540*----------------------------------------------------------------*00554000
005550 01  WS-ABORT-CODES.                                              00555000
005560     03  WS-AB0009               PIC S9(04)      COMP             00556000
005570                                                 VALUE +0009.     00557000
005580     03  WS-AB2000               PIC S9(04)      COMP             00558000
005590                                                 VALUE +2000.     00559000
005600     03  WS-AB2033               PIC S9(04)      COMP             00560000
005610                                                 VALUE +2033.     00561000
005620     03  WS-AB3051               PIC S9(04)      COMP             00562000
005630                                                 VALUE +3051.     00563000
005640     03  WS-AB6305               PIC S9(04)      COMP             00564000
005650                                                 VALUE +6305.     00565000
005660     03  WS-AB6310               PIC S9(04)      COMP             00566000
005670                                                 VALUE +6310.     00567000
005680     03  WS-AB6320               PIC S9(04)      COMP             00568000
005690                                                 VALUE +6320.     00569000
005700     03  WS-AB6330               PIC S9(04)      COMP             00570000
005710                                                 VALUE +6330.     00571000
005720     03  WS-AB6335               PIC S9(04)      COMP             00572000
005730                                                 VALUE +6335.     00573000
005740     03  WS-AB6350               PIC S9(04)      COMP             00574000
005750                                                 VALUE +6350.     00575000
005760     03  WS-AB6355               PIC S9(04)      COMP             00576000
005770                                                 VALUE +6355.     00577000
005780     03  WS-AB6365               PIC S9(04)      COMP             00578000
005790                                                 VALUE +6365.     00579000
005800     03  WS-AB7103               PIC S9(04)      COMP             00580000
005810                                                 VALUE +7103.     00581000
005820*----------------------------------------------------------------*00582000
005830 01  WS-TRACE-CODES.                                              00583000
005840     03  WS-TR0001               PIC S9(04)      COMP             00584000
005850                                                 VALUE +0001.     00585000
005860     03  WS-TR0002               PIC S9(04)      COMP             00586000
005870                                                 VALUE +0002.     00587000
005880     03  WS-TR0003               PIC S9(04)      COMP             00588000
005890                                                 VALUE +0003.     00589000
005900     03  WS-TR0004               PIC S9(04)      COMP             00590000
005910                                                 VALUE +0004.     00591000
005920     03  WS-TR0005               PIC S9(04)      COMP             00592000
005930                                                 VALUE +0005.     00593000
005940     03  WS-TR0006               PIC S9(04)      COMP             00594000
005950                                                 VALUE +0006.     00595000
005960     03  WS-TR0007               PIC S9(04)      COMP             00596000
005970                                                 VALUE +0007.     00597000
005980     03  WS-TR0008               PIC S9(04)      COMP             00598000
005990                                                 VALUE +0008.     00599000
006000     03  WS-TR0009               PIC S9(04)      COMP             00600000
006010                                                 VALUE +0009.     00601000
006020     03  WS-TR0010               PIC S9(04)      COMP             00602000
006030                                                 VALUE +0010.     00603000
006040     03  WS-TR0011               PIC S9(04)      COMP             00604000
006050                                                 VALUE +0011.     00605000
006060     03  WS-TR0012               PIC S9(04)      COMP             00606000
006070                                                 VALUE +0012.     00607000
006080     03  WS-TR0013               PIC S9(04)      COMP             00608000
006090                                                 VALUE +0013.     00609000
P0022      03  WS-TR0014               PIC S9(04)      COMP             00609200
P0022                                                  VALUE +0014.     00609400
P0022      03  WS-TR0015               PIC S9(04)      COMP             00609600
P0022                                                  VALUE +0015.     00609800
006100*----------------------------------------------------------------*00610000
006110 01  WS-LINKAPPL.                                                 00611000
000000 COPY MISCNT00      REPLACING                                     00612000
006130     ==:MICNT:== BY ==RPINF00==.                                  00613000
000000 COPY RPSINF00.                                                   00614000
006150*----------------------------------------------------------------*00615000
006160 01  RPRF21-MESSAGE.                                              00616000
000000 COPY MISCNT00      REPLACING                                     00617000
006180             ==:MICNT:== BY ==RPRF21==.                           00618000
000000 COPY RPSRF21.                                                    00619000
006200*----------------------------------------------------------------*00620000
006210 01  WS-LINKUSER.                                                 00621000
000000 COPY MISCNT00      REPLACING                                     00622000
006230     ==:MICNT:== BY ==RPUSER==.                                   00623000
000000 COPY RPWUSER.                                                    00624000
006250******************************************************************00625000
006260 LINKAGE SECTION.                                                 00626000
006270 01  DFHCOMMAREA.                                                 00627000
000000 COPY MISCNT00      REPLACING                                     00628000
006290             ==:MICNT:== BY ==RPXXX30==.                          00629000
000000 COPY RPSXXX30.                                                   00630000
006310*01  SLW096-2023RECORDS.                                          00631000
000000 COPY SLW096L.                                                    00632000
006330******************************************************************00633000
006340 PROCEDURE DIVISION.                                              00634000
006350******************************************************************00635000
006360 ENTRY-ROUTINE SECTION.                                           00636000
006370 ER-START.                                                        00637000
006380     MOVE WS-VALIDPROGID TO SR-APIPROGLIT.                        00638000
006390     MOVE WS-VALIDPROGID TO RPXXX30-ABPROGID.                     00639000
006400     PERFORM CICS-HANDLE-CONDITION.                               00640000
006410     IF EIBCALEN IS EQUAL TO +0                                   00641000
006420         MOVE WS-AB2000 TO RPXXX30-ABORT                          00642000
006430         MOVE WS-AB2000 TO RPXXX30-RESP-ABORT                     00643000
006440         MOVE WS-TR0001 TO RPXXX30-ABTRACE                        00644000
006450         MOVE WS-TR0001 TO RPXXX30-RESP-TRACE                     00645000
006460         GO TO CICS-RETURN.                                       00646000
006470     MOVE ZERO TO RPXXX30-RESP-MSG-NBR.                           00647000
006480     MOVE SPACE TO WS-FUNCTION.                                   00648000
006490     MOVE ZEROS TO WS-SAVE-MSGNBR.                                00649000
006500     MOVE RPXXX30-FILEOPTS TO WS-FILEOPTS.                        00650000
006510     MOVE RPXXX30-OPERID TO WS-UPD-USER.                          00651000
000000 COPY SLP094.                                                     00652000
006530     GO TO VERIFY-KEY.                                            00653000
006540 ER-EXIT.                                                         00654000
006550     EXIT.                                                        00655000
006560******************************************************************00656000
006570 CICS-HANDLE-CONDITION SECTION.                                   00657000
000000 COPY SLP702.                                                     00658000
006590     MOVE WS-AB2033 TO RPXXX30-ABORT.                             00659000
006600     MOVE WS-AB2033 TO RPXXX30-RESP-ABORT.                        00660000
006610     MOVE WS-TR0002 TO RPXXX30-ABTRACE.                           00661000
006620     MOVE WS-TR0002 TO RPXXX30-RESP-TRACE.                        00662000
006630     GO TO CICS-RETURN.                                           00663000
006640 CHC-EXIT.                                                        00664000
006650     EXIT.                                                        00665000
006660******************************************************************00666000
006670 VERIFY-KEY SECTION.                                              00667000
006680 VK-START.                                                        00668000
006690     INITIALIZE WS-ACC-TABLE.                                     00669000
006700     MOVE ZERO TO COM-ABORT.                                      00670000
006710     MOVE 'N' TO RPXXX30-DELETE-REL.                              00671000
006720     MOVE ZERO TO RPXXX30-ABORT.                                  00672000
006730     MOVE ZERO TO RPXXX30-MSGNBR.                                 00673000
006740     MOVE SPACES TO RPXXX30-FUNCTION.                             00674000
006750     MOVE RPXXX30-DATE TO WS-CURDATE.                             00675000
006760     MOVE WS-CURMM TO WS-PDATE-MM.                                00676000
006770     MOVE WS-CURDD TO WS-PDATE-DD.                                00677000
006780     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00678000
006790     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00679000
006800     MOVE RPXXX30-PRIMARY-INST TO RPBNK-INST.                     00680000
006810     PERFORM RPS-BNK-GET-REQUEST.                                 00681000
006820     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00682000
006830         MOVE WS-TR0003 TO RPXXX30-ABTRACE                        00683000
006840         MOVE WS-TR0003 TO RPXXX30-RESP-TRACE                     00684000
006850         MOVE WS-AB6305 TO RPXXX30-ABORT                          00685000
006860         MOVE WS-AB6305 TO RPXXX30-RESP-ABORT                     00686000
006870         GO TO VK-RETURN.                                         00687000
P0022      MOVE RPBNK-CURDT TO WS-CURDTYYYYMMDD.                        00687500
006880 VK-KEY.                                                          00688000
006890     IF RPXXX30-PRIMARY-INST IS NOT NUMERIC                       00689000
006900         OR RPXXX30-PRIMARY-INST IS EQUAL TO ZEROS                00690000
006910         MOVE 000002 TO RPXXX30-MSGNBR                            00691000
006920         MOVE 000002 TO RPXXX30-RESP-MSG-NBR                      00692000
006930         GO TO VK-RETURN.                                         00693000
006940     IF RPXXX30-PRIMARY-PROD-CODE IS EQUAL TO SPACES              00694000
006950         OR RPXXX30-PRIMARY-PROD-CODE IS EQUAL TO LOW-VALUES      00695000
006960         MOVE 000002 TO RPXXX30-MSGNBR                            00696000
006970         MOVE 000002 TO RPXXX30-RESP-MSG-NBR                      00697000
006980         GO TO VK-RETURN.                                         00698000
006990     IF RPXXX30-PRIMARY-ACCT-NBR IS EQUAL TO SPACES               00699000
007000         OR RPXXX30-PRIMARY-ACCT-NBR IS EQUAL TO LOW-VALUES       00700000
007010         MOVE 000002 TO RPXXX30-MSGNBR                            00701000
007020         MOVE 000002 TO RPXXX30-RESP-MSG-NBR                      00702000
007030         GO TO VK-RETURN.                                         00703000
007040 VK-7100.                                                         00704000
007050     PERFORM READ-MICM-7100.                                      00705000
007060     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00706000
007070         MOVE 500005 TO RPXXX30-MSGNBR                            00707000
007080         MOVE 500005 TO RPXXX30-RESP-MSG-NBR                      00708000
007090         GO TO VK-RETURN.                                         00709000
007100 VK-LOAD-RPXXX30-CUST-TABLE.                                      00710000
007110     MOVE +0 TO WS-SUB5.                                          00711000
007120     MOVE +0 TO WS-SUB6.                                          00712000
007130     INITIALIZE WS-RPXXX30-CUST-TABLE.                            00713000
P0110      IF RPXXX30-REL-CODE (1) IS NOT EQUAL TO SPACES               00713300
P0110          MOVE RPXXX30-REL-CODE (1) TO WS-RPXXX30-REL-CODE (1).    00713600
007140 VK-LRCUST-TABLE-LOOP.                                            00714000
007150     ADD +1 TO WS-SUB6.                                           00715000
007160     IF WS-SUB6 IS GREATER THAN WS-RPXXX30-CSTTBL-MAX             00716000
007170         GO TO VK-CHECK-PRIMARY-CUSTOMER.                         00717000
007180     IF RPXXX30-CUST-NA (WS-SUB6) IS EQUAL TO SPACES              00718000
P0015          AND RPXXX30-CUST-NO (WS-SUB6) IS EQUAL TO ZEROS          00718500
P0186          AND RPXXX30-REL-CODE (WS-SUB6) IS EQUAL TO SPACES        00718700
007190         GO TO VK-LRCUST-TABLE-LOOP.                              00719000
007200     ADD +1 TO WS-SUB5.                                           00720000
007210     MOVE RPXXX30-CUSTOMER-DATA (WS-SUB6)                         00721000
007220         TO WS-RPXXX30-CUSTOMERS (WS-SUB5).                       00722000
007230     MOVE 'N' TO WS-RPXXX30-FOUND-FLAG (WS-SUB5).                 00723000
007240     GO TO VK-LRCUST-TABLE-LOOP.                                  00724000
007250 VK-CHECK-PRIMARY-CUSTOMER.                                       00725000
007260     MOVE 'N' TO WS-PRIM-CUST-EXISTS.                             00726000
007270     MOVE 'G' TO RPRF21-FUNC.                                     00727000
007280     MOVE 'N' TO MIM-7101CLOSEDACCTOPT.                           00728000
007290     MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST.          00729000
007300     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00730000
007310         AND MIM-7100ENTERPRISEINST IS GREATER THAN ZEROS         00731000
007320         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00732000
007330     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPRF21-BASE-ACCT-PRODCODE. 00733000
007340     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPRF21-BASE-ACCT.           00734000
007350     PERFORM REQUEST-CUSTOMER.                                    00735000
007360     IF RPXXX30-MSGNBR IS NOT EQUAL TO ZEROS                      00736000
007370         GO TO VK-RETURN.                                         00737000
007430     IF WS-FUNCTION IS EQUAL TO 'N'                               00743000
007440         GO TO VK-7101.                                           00744000
007450     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00745000
007460         MOVE 500622 TO RPXXX30-MSGNBR                            00746000
007470         MOVE 500622 TO RPXXX30-RESP-MSG-NBR                      00747000
007480         GO TO VK-RETURN.                                         00748000
007490     MOVE 'Y' TO WS-PRIM-CUST-EXISTS.                             00749000
007500 VK-7101.                                                         00750000
007510     PERFORM READ-MICM-7101.                                      00751000
007520     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00752000
007530         MOVE 500006 TO RPXXX30-MSGNBR                            00753000
007540         MOVE 500006 TO RPXXX30-RESP-MSG-NBR                      00754000
007550         GO TO VK-RETURN.                                         00755000
007560     MOVE RPXXX30-PRIMARY-MODEL TO WS-MODEL.                      00756000
007570 VK-7102.                                                         00757000
007580     MOVE RPBNK-INST TO WS-RPMIM7102INST.                         00758000
007590     PERFORM LOAD-RPS-7102.                                       00759000
007600     IF WS-RPMIM7102ERROR IS EQUAL TO 'Y'                         00760000
007610         MOVE 500007 TO RPXXX30-MSGNBR                            00761000
007620         MOVE 500007 TO RPXXX30-RESP-MSG-NBR                      00762000
007630         GO TO VK-RETURN.                                         00763000
007640 VK-7103.                                                         00764000
007650     MOVE RPBNK-INST TO WS-RPMIM7103INST.                         00765000
007660     COMPUTE WS-RPMIM7103EFFDT = RPBNK-CURDT - 99999999.          00766000
007670     PERFORM LOAD-RPS-7103.                                       00767000
007680     IF WS-RPMIM7103ERROR IS EQUAL TO 'Y'                         00768000
007690         MOVE 500008 TO RPXXX30-MSGNBR                            00769000
007700         MOVE 500008 TO RPXXX30-RESP-MSG-NBR                      00770000
007710         GO TO VK-RETURN.                                         00771000
007720 VK-7104.                                                         00772000
007730     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7104INST.               00773000
007740     PERFORM LOAD-RPS-7104.                                       00774000
007750     IF WS-RPMIM7104ERROR IS EQUAL TO 'Y'                         00775000
007760         OR (MIM-7104KINST IS NOT EQUAL TO RPXXX30-PRIMARY-INST   00776000
007770             AND INDX-7104 IS EQUAL TO +1)                        00777000
007780         MOVE 500009 TO RPXXX30-MSGNBR                            00778000
007790         MOVE 500009 TO RPXXX30-RESP-MSG-NBR                      00779000
007800         GO TO VK-RETURN.                                         00780000
007810 VK-7106.                                                         00781000
007820     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7106INST.               00782000
007830     PERFORM LOAD-RPS-7106.                                       00783000
007840     IF WS-RPMIM7106ERROR IS EQUAL TO 'Y'                         00784000
007850         MOVE 500011 TO RPXXX30-MSGNBR                            00785000
007860         MOVE 500011 TO RPXXX30-RESP-MSG-NBR                      00786000
007870         GO TO VK-RETURN.                                         00787000
007880 VK-7110.                                                         00788000
007890     MOVE RPBNK-INST TO WS-RPMIM7110INST.                         00789000
007900     PERFORM LOAD-RPS-7110.                                       00790000
007910     IF WS-RPMIM7110ERROR IS EQUAL TO 'Y'                         00791000
007920         MOVE 500081 TO RPXXX30-MSGNBR                            00792000
007930         MOVE 500081 TO RPXXX30-RESP-MSG-NBR                      00793000
007940         GO TO VK-RETURN.                                         00794000
007950 VK-REC0237.                                                      00795000
007960     MOVE SPACES TO WS-APPLICATION-TABLE.                         00796000
007970     MOVE SPACES TO MI0237-RECORD.                                00797000
007980     MOVE RPBNK-INST TO MIM-0237KINST.                            00798000
007990     MOVE +0237 TO MIM-0237KREC.                                  00799000
008000     MOVE 50 TO MIM-0237KPROCMGR.                                 00800000
008010     MOVE ZEROS TO MIM-0237KINTAPPL.                              00801000
008020     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    00802000
008030     MOVE MI0237-RECORD TO MIMST-RECORD.                          00803000
008040     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00804000
008050     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00805000
008060         MOVE 500024 TO RPXXX30-MSGNBR                            00806000
008070         MOVE 500024 TO RPXXX30-RESP-MSG-NBR                      00807000
008080         GO TO VK-RETURN.                                         00808000
008090     GO TO VK-REC0237CONT.                                        00809000
008100 VK-REC0237READ.                                                  00810000
008110     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00811000
008120     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00812000
008130         GO TO VK-2023.                                           00813000
008140 VK-REC0237CONT.                                                  00814000
008150     MOVE MIMST-RECORD TO MI0237-RECORD.                          00815000
008160     IF MIM-0237KINST IS NOT EQUAL TO RPBNK-INST                  00816000
008170         OR MIM-0237KPROCMGR IS NOT EQUAL TO 50                   00817000
008180         GO TO VK-2023.                                           00818000
008190     IF MIM-0237KINTAPPL IS EQUAL TO ZEROS                        00819000
008200         MOVE MIM-237OLINTFC TO WS-INTRFACE (100)                 00820000
008210     ELSE                                                         00821000
008220         MOVE MIM-237OLINTFC TO WS-INTRFACE (MIM-0237KINTAPPL).   00822000
008230     GO TO VK-REC0237READ.                                        00823000
008240 VK-2023.                                                         00824000
008250     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM2023INST.               00825000
008260     PERFORM LOAD-RPS-2023.                                       00826000
008270     MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-RPMIM2023PRODCD.        00827000
008280     PERFORM SEARCH-RPS-2023.                                     00828000
008290     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         00829000
008300         MOVE 500001 TO RPXXX30-MSGNBR                            00830000
008310         MOVE 500001 TO RPXXX30-RESP-MSG-NBR                      00831000
008320         GO TO VK-RETURN.                                         00832000
008330     IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO ' '              00833000
008340         OR WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'N'          00834000
008350         MOVE 500015 TO RPXXX30-MSGNBR                            00835000
008360         MOVE 500015 TO RPXXX30-RESP-MSG-NBR                      00836000
008370         GO TO VK-RETURN.                                         00837000
008380     MOVE MIM-2023INTAPPL211 TO WS-PRIMARY-APPL.                  00838000
P0022  VK-2024.                                                         00839000
P0022      MOVE SPACES TO WS-2024INSTS.                                 00839990
P0022      MOVE SPACES TO WS-SEARCH-TABLE.                              00840980
P0022      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'N'                     00841970
P0022          GO TO VK-EXIT.                                           00842960
P0022      MOVE +1 TO WS-SSUB.                                          00843950
P0022      MOVE 'Y' TO WS-2024-EXISTS (RPBNK-INST).                     00844940
P0022      MOVE 1 TO WS-STBL-SUB (RPBNK-INST).                          00845930
P0022      MOVE RPXXX30-FILEOPTS TO WS-SEARCH-OPT (1).                  00846920
P0022      MOVE ZEROS TO MIM-2024KINST.                                 00847910
P0022      MOVE 2024 TO MIM-2024KREC.                                   00848900
P0156      MOVE RPXXX30-PRIMARY-INST TO MIM-2024KGROUP-INST.            00849890
P0022      MOVE ZEROS TO MIM-2024KACCESS-INST.                          00850880
P0022      MOVE MIC-MST-2024-PRI TO MIC-MST-REC-PRI.                    00851870
P0022      MOVE 50 TO MIM-2024KMANGER.                                  00852860
P0022      MOVE MI2024-RECORD TO MIMST-RECORD.                          00853850
P0156      PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00854150
P0156      GO TO VK-2024-CONT.                                          00854450
P0022  VK-2024-READ.                                                    00854840
P0022      PERFORM MIC-MST-GET-NEXT-REQUEST.                            00855830
P0022  VK-2024-CONT.                                                    00856820
P0022      IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00857810
P0022          GO TO VK-EXIT.                                           00858800
P0022      MOVE MIMST-RECORD TO MI2024-RECORD.                          00859790
P0022      IF MIM-2024KINST IS NOT EQUAL TO ZEROS                       00860780
P0022          GO TO VK-EXIT.                                           00861770
P0022      IF MIM-2024KMANGER IS NOT EQUAL TO 50                        00862760
P0022          OR MIM-2024KGROUP-INST                                   00863750
P0022              IS NOT EQUAL TO RPXXX30-PRIMARY-INST                 00864740
P0022          GO TO VK-EXIT.                                           00865730
P0022      IF MIM-2024KACCESS-INST IS EQUAL TO ZEROS                    00866720
P0022          OR MIM-2024KGROUP-INST                                   00867710
P0022              IS EQUAL TO MIM-2024KACCESS-INST                     00868700
P0022          GO TO VK-2024-READ.                                      00869690
P0022      ADD +1 TO WS-SSUB.                                           00870680
P0022      MOVE 'Y' TO WS-2024-EXISTS (MIM-2024KACCESS-INST).           00871670
P0022      MOVE WS-SSUB TO WS-STBL-SUB (MIM-2024KACCESS-INST).          00872660
P0022  VK-2024-CONTINUE.                                                00873650
P0022      MOVE RPXXX30-OPERID TO WS-ACCESS-OPERID.                     00874640
P0022      MOVE RPXXX30-PROFILE TO WS-ACCESS-PROFILE.                   00875630
P0022      MOVE RPXXX30-EXTERNALID TO WS-ACCESS-EXTERNALID.             00876620
P0156      MOVE RPXXX30-PRIMARY-INST TO WS-ACCESS-PRIM-INST.            00877610
P0022      MOVE MIM-2024KACCESS-INST TO WS-ACCESS-ALT-INST.             00878600
P0022      PERFORM CROSS-INSTITUTION.                                   00879590
P0022      IF WS-RPP004-ERROR IS EQUAL TO 'Y'                           00880580
P0022          MOVE 500088 TO RPXXX30-MSGNBR                            00881570
P0022          MOVE 500088 TO RPXXX30-RESP-MSG-NBR                      00882560
P0022          GO TO VK-RETURN.                                         00883550
P0022      MOVE WS-ACCESS-FILEOPTS TO WS-SEARCH-OPT (WS-SSUB).          00884540
P0022      GO TO VK-2024-READ.                                          00885530
009060 VK-RETURN.                                                       00906000
009070     MOVE 'E' TO RPXXX30-RETURN.                                  00907000
009080     GO TO CICS-RETURN.                                           00908000
009090 VK-EXIT.                                                         00909000
009100     EXIT.                                                        00910000
009110******************************************************************00911000
009120 MAIN-LOGIC SECTION.                                              00912000
009130 ML-START.                                                        00913000
009140     PERFORM LOAD-ENTERPRISE-INTERFACE.                           00914000
009150 ML-READ-NEXT.                                                    00915000
009160     PERFORM INITIALIZE-WORK-AREA.                                00916000
009170 ML-7101-CLOSEDT.                                                 00917000
009180     IF MIM-7101CLOSEDT IS EQUAL TO ZEROS                         00918000
009190         GO TO ML-7101-EXPDT.                                     00919000
P0022      IF WS-CURDT-YYYYMMDD IS NOT GREATER THAN MIM-7101CLOSEDT     00920000
009210         GO TO ML-7101-EXPDT.                                     00921000
P0150      MOVE 500019 TO RPXXX30-MSGNBR.                               00922000
P0150      MOVE 500019 TO RPXXX30-RESP-MSG-NBR.                         00922590
009240     GO TO CICS-RETURN.                                           00924000
009250 ML-7101-EXPDT.                                                   00925000
009260     MOVE ZEROS TO WS-EXPIRATION-DATE.                            00926000
009270     IF MIM-7101EXPDT IS EQUAL TO ZEROS                           00927000
009280         GO TO ML-CALC-EXPDATE.                                   00928000
P0022      IF MIM-7101EXPDT IS GREATER THAN RPBNK-CURDT                 00929000
009300         MOVE MIM-7101EXPDT TO WS-EXPIRATION-DATE                 00930000
009310         GO TO ML-PASSED-EXPDATE.                                 00931000
P0150      MOVE 500018 TO RPXXX30-MSGNBR.                               00932000
P0150      MOVE 500018 TO RPXXX30-RESP-MSG-NBR.                         00932590
009340     GO TO CICS-RETURN.                                           00934000
009350 ML-CALC-EXPDATE.                                                 00935000
009360     IF MIM-7101EXPFREQ IS EQUAL TO 'N'                           00936000
009370         GO TO ML-VALIDATE.                                       00937000
009380     MOVE MIM-7101EXPFREQ TO SR-PERIOD.                           00938000
009390     MOVE MIM-7101EXPTERM TO SR-FREQ.                             00939000
009400     IF MIM-7101EXPFREQ IS EQUAL TO 'M'                           00940000
009410         AND MIM-7101ENDOFMONTH IS EQUAL TO 'Y'                   00941000
009420         MOVE 31 TO SR-DAY                                        00942000
009430     ELSE                                                         00943000
009440         MOVE ZEROS TO SR-DAY.                                    00944000
009450     MOVE WS-CURDTYYYY TO SR-FCYR.                                00945000
009460     MOVE WS-CURDTMM TO SR-FCMON.                                 00946000
009470     MOVE WS-CURDTDD TO SR-FCDAY.                                 00947000
009480     PERFORM JULIAN-365.                                          00948000
009490     MOVE SR-TOJUL TO SR-FROMJUL.                                 00949000
009500     PERFORM NEXT-DATE-365.                                       00950000
009510     MOVE SR-TOJUL TO SR-FROMJUL.                                 00951000
009520     PERFORM CALENDAR-365.                                        00952000
P0022      MOVE SR-TCMON TO WS-EXPDATE-MM.                              00953000
P0022      MOVE SR-TCDAY TO WS-EXPDATE-DD.                              00953790
P0022      MOVE SR-TCYR TO WS-EXPDATE-YYYY.                             00954580
P0022      IF WS-EXPDATE IS GREATER THAN RPBNK-CURDT                    00955370
P0022          MOVE WS-EXPDATE TO WS-EXPIRATION-DATE                    00956160
009580         GO TO ML-PASSED-EXPDATE.                                 00958000
P0150      MOVE 500018 TO RPXXX30-MSGNBR.                               00959000
P0150      MOVE 500018 TO RPXXX30-RESP-MSG-NBR.                         00959590
009610     GO TO CICS-RETURN.                                           00961000
009620 ML-PASSED-EXPDATE.                                               00962000
009630     IF RPXXX30-NEW-EXPIRE-DATE IS EQUAL TO ZEROS                 00963000
009640         GO TO ML-VALIDATE.                                       00964000
P0022      IF RPXXX30-NEW-EXPIRE-DATE IS NOT GREATER THAN RPBNK-CURDT   00965000
P0150          MOVE 501023 TO RPXXX30-MSGNBR                            00966000
P0150          MOVE 501023 TO RPXXX30-RESP-MSG-NBR                      00966590
009680         GO TO CICS-RETURN.                                       00968000
009690     IF RPXXX30-NEW-EXPIRE-DATE IS GREATER THAN ZEROS             00969000
009700         AND WS-EXPIRATION-DATE IS EQUAL TO ZEROS                 00970000
009710         MOVE RPXXX30-NEW-EXPIRE-DATE TO WS-EXPIRATION-DATE       00971000
009720         GO TO ML-VALIDATE.                                       00972000
009730     IF RPXXX30-NEW-EXPIRE-DATE                                   00973000
009740         IS GREATER THAN WS-EXPIRATION-DATE                       00974000
009750         MOVE 'E' TO RPXXX30-RETURN                               00975000
P0150          MOVE 501023 TO RPXXX30-MSGNBR                            00976000
P0150          MOVE 501023 TO RPXXX30-RESP-MSG-NBR                      00976590
009780         GO TO CICS-RETURN.                                       00978000
009790 ML-VALIDATE.                                                     00979000
009800     PERFORM INITIALIZE-WORK-AREA1.                               00980000
009810     PERFORM VALIDATE-PRIMARY-ACCOUNT.                            00981000
009820     IF WS-PRIM-FATAL-ERROR IS EQUAL TO 'Y'                       00982000
009830         AND RPXXX30-RETURN IS EQUAL TO 'E'                       00983000
009840         GO TO CICS-RETURN.                                       00984000
009850     IF WS-PRIM-FATAL-ERROR IS EQUAL TO 'Y'                       00985000
009860         MOVE 'E' TO RPXXX30-RETURN                               00986000
009870         MOVE 500615 TO RPXXX30-MSGNBR                            00987000
009880         MOVE 500615 TO RPXXX30-RESP-MSG-NBR                      00988000
009890         GO TO CICS-RETURN.                                       00989000
009900     PERFORM VALIDATE-SECONDARY-ACCOUNTS.                         00990000
009910     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        00991000
009920         AND MIM-7101ACCTRELCD-Q IS EQUAL TO 'E'                  00992000
009930         AND WS-ACCTRELCD-O IS EQUAL TO ZERO                      00993000
009940         MOVE 500617 TO RPXXX30-MSGNBR                            00994000
009950         MOVE 500617 TO RPXXX30-RESP-MSG-NBR                      00995000
009960         GO TO CICS-RETURN.                                       00996000
009970 ML-MODEL-REQ.                                                    00997000
009980     PERFORM VALIDATE-MODEL-REQUIREMENTS.                         00998000
009990     IF WS-MODEL-REQS IS EQUAL TO 'N'                             00999000
P0084          MOVE 501020 TO RPXXX30-MSGNBR                            01000000
P0084          MOVE 501020 TO RPXXX30-RESP-MSG-NBR                      01000590
010020         GO TO CICS-RETURN.                                       01002000
010030 ML-MIN-MAX-PRODS-REQ.                                            01003000
010040     PERFORM VALIDATE-PRODUCTS-REQUIREMENTS.                      01004000
010050     IF WS-MIN-MAX-PROD-REQS IS EQUAL TO 'N'                      01005000
010060         MOVE 500059 TO RPXXX30-MSGNBR                            01006000
010070         MOVE 500059 TO RPXXX30-RESP-MSG-NBR                      01007000
010080         GO TO CICS-RETURN.                                       01008000
010090 ML-MIN-MAX-ACCTS-REQ.                                            01009000
010100     PERFORM VALIDATE-ACCOUNTS-REQUIREMENTS.                      01010000
010110     IF WS-MIN-MAX-ACCT-REQS IS EQUAL TO 'N'                      01011000
010120         MOVE 500058 TO RPXXX30-MSGNBR                            01012000
010130         MOVE 500058 TO RPXXX30-RESP-MSG-NBR                      01013000
010140         GO TO CICS-RETURN.                                       01014000
010150 ML-PRODUCT-GROUPS-REQ.                                           01015000
010160     PERFORM VALIDATE-PRODUCT-GROUPS.                             01016000
010170     IF WS-PROD-GROUPS-REQS IS EQUAL TO 'N'                       01017000
010180         MOVE 500618 TO RPXXX30-MSGNBR                            01018000
010190         MOVE 500618 TO RPXXX30-RESP-MSG-NBR                      01019000
010200         GO TO CICS-RETURN.                                       01020000
010210     IF WS-MODEL-REQS IS EQUAL TO 'N'                             01021000
010220         MOVE 500618 TO RPXXX30-MSGNBR                            01022000
010230         MOVE 500618 TO RPXXX30-RESP-MSG-NBR                      01023000
010240         GO TO CICS-RETURN.                                       01024000
010250     IF WS-MIN-MAX-PROD-REQS IS EQUAL TO 'N'                      01025000
010260         MOVE 500059 TO RPXXX30-MSGNBR                            01026000
010270         MOVE 500059 TO RPXXX30-RESP-MSG-NBR                      01027000
010280         GO TO CICS-RETURN.                                       01028000
010290 ML-COMBINEBAL-REQ.                                               01029000
010300     IF MIM-7101COMBCATCD1-Q IS NOT EQUAL TO 'E'                  01030000
010310         AND MIM-7101COMBCATCD2-Q IS NOT EQUAL TO 'E'             01031000
010320         AND MIM-7101COMBCATCD3-Q IS NOT EQUAL TO 'E'             01032000
010330         AND MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'             01033000
010340         GO TO ML-EXPIRATION-DATE.                                01034000
010350     MOVE ZEROS TO WS-SUBSEC.                                     01035000
010360 ML-COMBINEBAL-NEXT.                                              01036000
010370     ADD +1 TO WS-SUBSEC.                                         01037000
010380     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                01038000
010390         GO TO ML-COMBINEBAL1-TEST.                               01039000
010400     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                01040000
010410         GO TO ML-COMBINEBAL1-TEST.                               01041000
010420     ADD WS-SEC-BAL1 (WS-SUBSEC) TO WS-COMBINEBAL1.               01042000
010430     ADD WS-SEC-BAL2 (WS-SUBSEC) TO WS-COMBINEBAL2.               01043000
010440     ADD WS-SEC-BAL3 (WS-SUBSEC) TO WS-COMBINEBAL3.               01044000
010450     ADD WS-SEC-BAL4 (WS-SUBSEC) TO WS-COMBINEBAL4.               01045000
010460     GO TO ML-COMBINEBAL-NEXT.                                    01046000
010470 ML-COMBINEBAL1-TEST.                                             01047000
010480     IF MIM-7101COMBCATCD1-Q IS NOT EQUAL TO 'E'                  01048000
010490         GO TO ML-COMBINEBAL2-TEST.                               01049000
010500     MOVE MIM-7101COMBCATCD1 TO WS-RPMIM7106RPREC.                01050000
010510     PERFORM SEARCH-RPS-7106.                                     01051000
010520     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01052000
010530         AND MIM-7101COMBBALOPT IS EQUAL TO 'A'                   01053000
010540         GO TO ML-COMBINEBAL-FAIL.                                01054000
010550     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01055000
010560         GO TO ML-COMBINEBAL2-TEST.                               01056000
010570     IF WS-COMBINEBAL1 IS NOT LESS THAN MIM-7106BALREQ-E          01057000
010580         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   01058000
010590         GO TO ML-EXPIRATION-DATE.                                01059000
010600     IF WS-COMBINEBAL1 IS NOT LESS THAN MIM-7106BALREQ-E          01060000
010610         GO TO ML-COMBINEBAL2-TEST.                               01061000
010620     IF MIM-7101COMBBALOPT IS EQUAL TO 'O'                        01062000
010630         GO TO ML-COMBINEBAL2-TEST.                               01063000
010640     GO TO ML-COMBINEBAL-FAIL.                                    01064000
010650 ML-COMBINEBAL2-TEST.                                             01065000
010660     IF MIM-7101COMBCATCD2-Q IS NOT EQUAL TO 'E'                  01066000
010670         GO TO ML-COMBINEBAL3-TEST.                               01067000
010680     MOVE MIM-7101COMBCATCD2 TO WS-RPMIM7106RPREC.                01068000
010690     PERFORM SEARCH-RPS-7106.                                     01069000
010700     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01070000
010710         AND MIM-7101COMBBALOPT IS EQUAL TO 'A'                   01071000
010720         GO TO ML-COMBINEBAL-FAIL.                                01072000
010730     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01073000
010740         GO TO ML-COMBINEBAL3-TEST.                               01074000
010750     IF WS-COMBINEBAL2 IS NOT LESS THAN MIM-7106BALREQ-E          01075000
010760         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   01076000
010770         GO TO ML-EXPIRATION-DATE.                                01077000
010780     IF WS-COMBINEBAL2 IS NOT LESS THAN MIM-7106BALREQ-E          01078000
010790         GO TO ML-COMBINEBAL3-TEST.                               01079000
010800     IF MIM-7101COMBBALOPT IS EQUAL TO 'O'                        01080000
010810         GO TO ML-COMBINEBAL3-TEST.                               01081000
010820     GO TO ML-COMBINEBAL-FAIL.                                    01082000
010830 ML-COMBINEBAL3-TEST.                                             01083000
010840     IF MIM-7101COMBCATCD3-Q IS NOT EQUAL TO 'E'                  01084000
010850         GO TO ML-COMBINEBAL4-TEST.                               01085000
010860     MOVE MIM-7101COMBCATCD3 TO WS-RPMIM7106RPREC.                01086000
010870     PERFORM SEARCH-RPS-7106.                                     01087000
010880     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01088000
010890         AND MIM-7101COMBBALOPT IS EQUAL TO 'A'                   01089000
010900         GO TO ML-COMBINEBAL-FAIL.                                01090000
010910     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01091000
010920         GO TO ML-COMBINEBAL4-TEST.                               01092000
010930     IF WS-COMBINEBAL3 IS NOT LESS THAN MIM-7106BALREQ-E          01093000
010940         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   01094000
010950         GO TO ML-EXPIRATION-DATE.                                01095000
010960     IF WS-COMBINEBAL3 IS NOT LESS THAN MIM-7106BALREQ-E          01096000
010970         GO TO ML-COMBINEBAL4-TEST.                               01097000
010980     IF MIM-7101COMBBALOPT IS EQUAL TO 'O'                        01098000
010990         GO TO ML-COMBINEBAL4-TEST.                               01099000
011000     GO TO ML-COMBINEBAL-FAIL.                                    01100000
011010 ML-COMBINEBAL4-TEST.                                             01101000
011020     IF MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'                  01102000
011030         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   01103000
011040         GO TO ML-COMBINEBAL-FAIL.                                01104000
011050     IF MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'                  01105000
011060         GO TO ML-EXPIRATION-DATE.                                01106000
011070     MOVE MIM-7101COMBCATCD4 TO WS-RPMIM7106RPREC.                01107000
011080     PERFORM SEARCH-RPS-7106.                                     01108000
011090     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01109000
011100         GO TO ML-COMBINEBAL-FAIL.                                01110000
011110     IF WS-COMBINEBAL4 IS NOT LESS THAN MIM-7106BALREQ-E          01111000
011120         GO TO ML-EXPIRATION-DATE.                                01112000
011130 ML-COMBINEBAL-FAIL.                                              01113000
011140     MOVE 501019 TO RPXXX30-MSGNBR.                               01114000
011150     MOVE 501019 TO RPXXX30-RESP-MSG-NBR.                         01115000
011160     GO TO CICS-RETURN.                                           01116000
011170 ML-EXPIRATION-DATE.                                              01117000
011180     IF RPXXX30-NEW-EXPIRE-DATE IS NOT EQUAL TO ZEROS             01118000
011190         MOVE RPXXX30-NEW-EXPIRE-DATE TO WS-EXPIRATION-DATE.      01119000
011200 ML-ENROLL.                                                       01120000
011210     PERFORM ADD-NEW-RELATIONSHIP.                                01121000
011220 ML-END.                                                          01122000
011230     GO TO CICS-RETURN.                                           01123000
011240 ML-EXIT.                                                         01124000
011250     EXIT.                                                        01125000
011260******************************************************************01126000
011270 VALIDATE-PRIMARY-ACCOUNT SECTION.                                01127000
011280 VPA-START.                                                       01128000
011290     MOVE 'N' TO WS-PRIM-FATAL-ERROR.                             01129000
011300     MOVE RPXXX30-PRIMARY-INST TO RPMST-INST.                     01130000
011310     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPMST-PRODCODE.            01131000
011320     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPMST-ACCOUNT.              01132000
011330     MOVE WS-MODEL TO RPMST-MODEL.                                01133000
011340     PERFORM RPS-MST-GET-REQUEST.                                 01134000
011350     IF WS-FUNCTION IS EQUAL TO 'N'                               01135000
011360         GO TO VPA-RCIF.                                          01136000
011370     IF RPMST-REL-STAT IS EQUAL TO 'E'                            01137000
011380         MOVE 'E' TO WS-EXPIRED-STATUS                            01138000
011390         GO TO VPA-RCIF.                                          01139000
P0022      IF RPMST-EXPIRATION-DATE IS NOT GREATER THAN RPBNK-CURDT     01140000
011410         AND RPMST-EXPIRATION-DATE IS NOT EQUAL TO ZEROS          01141000
P0110          MOVE 'P' TO WS-EXPIRED-STATUS                            01142000
011430         GO TO VPA-RCIF.                                          01143000
011440     MOVE 'Y' TO WS-PRIM-FATAL-ERROR.                             01144000
011450     MOVE 'E' TO  RPXXX30-RETURN.                                 01145000
011460     MOVE 500098 TO RPXXX30-MSGNBR.                               01146000
011470     MOVE 500098 TO RPXXX30-RESP-MSG-NBR.                         01147000
011480     GO TO VPA-EXIT.                                              01148000
011490 VPA-RCIF.                                                        01149000
011500     MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-PRIM-PRODCD.            01150000
011510     MOVE RPXXX30-NEW-BR TO WS-PRIM-BRANCH.                       01151000
011520     MOVE RPXXX30-NEW-ACCT-TYPE TO WS-PRIM-TYPE.                  01152000
011530     MOVE RPXXX30-PRIMARY-ACCT-NBR TO WS-PRIM-ACCT.               01153000
011540     MOVE WS-MODEL TO WS-PRIM-MODEL.                              01154000
011550     IF WS-INTRFACE (47) IS EQUAL TO SPACES                       01155000
011560         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01156000
011570         MOVE 'E' TO RPXXX30-RETURN                               01157000
011580         MOVE 500024 TO RPXXX30-MSGNBR                            01158000
011590         MOVE 500024 TO RPXXX30-RESP-MSG-NBR                      01159000
011600         GO TO VPA-EXIT.                                          01160000
011610     PERFORM CALL-RCIF.                                           01161000
011620     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01162000
011630         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01163000
011640         MOVE 'E' TO RPXXX30-RETURN                               01164000
011650         MOVE 500016 TO RPXXX30-MSGNBR                            01165000
011660         MOVE 500016 TO RPXXX30-RESP-MSG-NBR                      01166000
011670         GO TO VPA-EXIT.                                          01167000
P0110  VPA-7104-PRIMRELCD.                                              01167100
P0110      IF WS-PRIMRELCD-ERROR IS EQUAL TO 'Y'                        01167200
P0110          AND WS-NUMOFSECCUSTS IS EQUAL TO ZEROS                   01167300
P0110          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01167400
P0110          MOVE 'E' TO RPXXX30-RETURN                               01167500
P0110          MOVE 500099 TO RPXXX30-MSGNBR                            01167600
P0110          MOVE 500099 TO RPXXX30-RESP-MSG-NBR                      01167700
P0110          GO TO VPA-EXIT.                                          01167800
011680 VPA-7104-CUSTRELCD.                                              01168000
011690     IF MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'B'                   01169000
011700         AND MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'E'              01170000
P0110          GO TO VPA-CALC-PRODACCT.                                 01171000
011720     MOVE MIM-7101CUSTRELCD TO WS-RPMIM7104RPREC.                 01172000
011730     PERFORM SEARCH-RPS-7104.                                     01173000
P0110      IF WS-CUSTRELCD-SKIP IS EQUAL TO 'Y'                         01173100
P0110          AND WS-RPMIM7104FOUND IS NOT EQUAL TO 'N'                01173200
P0110          MOVE MIM-REC7104 TO WS-SAVE-MIM7104REC                   01173300
P0110          GO TO VPA-CALC-PRODACCT.                                 01173400
P0110      IF WS-CUSTRELCD-SKIP IS EQUAL TO 'Y'                         01173500
P0110          AND WS-RPMIM7104FOUND IS EQUAL TO 'N'                    01173600
P0110          GO TO VPA-CALC-PRODACCT.                                 01173700
011740     IF WS-RPMIM7104FOUND IS NOT EQUAL TO 'N'                     01174000
P0045          MOVE MIM-REC7104 TO WS-SAVE-MIM7104REC                   01174500
011750         GO TO VPA-7104-FOUND.                                    01175000
011760     MOVE 'Y' TO WS-PRIM-FATAL-ERROR.                             01176000
011770     GO TO VPA-EXIT.                                              01177000
011780 VPA-7104-FOUND.                                                  01178000
011790     MOVE +1 TO WS-SUB4.                                          01179000
011800     IF MIM-7104OPT IS EQUAL TO 'I'                               01180000
011810         GO TO VPA-7104-CUSTRELCDI.                               01181000
011820 VPA-7104-CUSTRELCDE.                                             01182000
P0066      IF WS-SUB4 IS GREATER THAN 50                                01183000
P0110          GO TO VPA-CALC-PRODACCT.                                 01184000
P0045      IF MIM-7104RLSP (WS-SUB4) IS NOT EQUAL TO WS-SAVE-PRIM-RELCD 01185000
011860         ADD +1 TO WS-SUB4                                        01186000
011870         GO TO VPA-7104-CUSTRELCDE.                               01187000
011880     MOVE 'Y' TO WS-PRIM-FATAL-ERROR.                             01188000
011890     GO TO VPA-EXIT.                                              01189000
011900 VPA-7104-CUSTRELCDI.                                             01190000
P0045      IF MIM-7104RLSP (WS-SUB4) IS EQUAL TO WS-SAVE-PRIM-RELCD     01191000
P0110          GO TO VPA-CALC-PRODACCT.                                 01192000
011930     ADD +1 TO WS-SUB4.                                           01193000
011940     IF WS-SUB4 IS NOT GREATER THAN 50                            01194000
011950         GO TO VPA-7104-CUSTRELCDI.                               01195000
011960     MOVE 'Y' TO WS-PRIM-FATAL-ERROR.                             01196000
011970     GO TO VPA-EXIT.                                              01197000
012470 VPA-CALC-PRODACCT.                                               01247000
012480     MOVE ZEROS TO WS-SUB4.                                       01248000
012490     MOVE ZEROS TO WS-NUMOFACCOUNTS.                              01249000
012500     MOVE ZEROS TO WS-NUMOFPRODUCTS.                              01250000
012510     MOVE SPACES TO WS-PRODCODE-TABLE.                            01251000
012520 VPA-CALC-PRODACCT-LOOP.                                          01252000
012530     ADD +1 TO WS-SUB4.                                           01253000
012540     IF WS-SUB4 IS GREATER THAN WS-SECONDARY-MAX                  01254000
012550         GO TO VPA-7101-ACCOUNTS.                                 01255000
012560     IF WS-SUB4 IS GREATER THAN WS-SECCUSTACCT-END                01256000
012570         GO TO VPA-7101-ACCOUNTS.                                 01257000
012580     ADD +1 TO WS-NUMOFACCOUNTS.                                  01258000
012590     MOVE ZEROS TO WS-SUB3.                                       01259000
012600 VPA-PRODCODE-LOOP.                                               01260000
012610     ADD +1 TO WS-SUB3.                                           01261000
012620     IF WS-SUB3 IS GREATER THAN WS-PRODCODE-MAX                   01262000
012630         GO TO VPA-CALC-PRODACCT-LOOP.                            01263000
012640     IF WS-SEC-PRODCD (WS-SUB4) IS EQUAL TO WS-PRODCODE (WS-SUB3) 01264000
012650         GO TO VPA-CALC-PRODACCT-LOOP.                            01265000
012660     IF WS-PRODCODE (WS-SUB3) IS EQUAL TO SPACES                  01266000
012670         MOVE WS-SEC-PRODCD (WS-SUB4) TO WS-PRODCODE (WS-SUB3)    01267000
012680         ADD +1 TO WS-NUMOFPRODUCTS                               01268000
012690         GO TO VPA-CALC-PRODACCT-LOOP.                            01269000
012700     GO TO VPA-PRODCODE-LOOP.                                     01270000
012710 VPA-7101-ACCOUNTS.                                               01271000
012720     IF MIM-7101ACCTS-Q IS NOT EQUAL TO 'B'                       01272000
012730         AND MIM-7101ACCTS-Q IS NOT EQUAL TO 'E'                  01273000
012740         GO TO VPA-7101-PRODUCTS.                                 01274000
012750     IF WS-NUMOFACCOUNTS IS LESS THAN MIM-7101ACCTS               01275000
012760         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01276000
012770         GO TO VPA-EXIT.                                          01277000
012780 VPA-7101-PRODUCTS.                                               01278000
012790     IF MIM-7101PROD-Q IS NOT EQUAL TO 'B'                        01279000
012800         AND MIM-7101PROD-Q IS NOT EQUAL TO 'E'                   01280000
P0045          GO TO VPA-INTERFACE.                                     01281000
012820     IF WS-NUMOFPRODUCTS IS LESS THAN MIM-7101PROD                01282000
012830         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01283000
012840         GO TO VPA-EXIT.                                          01284000
P0045  VPA-INTERFACE.                                                   01284010
P0045      MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-RPMIM2023PRODCD.        01284020
P0045      PERFORM SEARCH-RPS-2023.                                     01284030
P0045      IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         01284040
P0045          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01284050
P0045          GO TO VPA-EXIT.                                          01284060
P0045      MOVE WS-2023-INTAPPL (INDX-2023) TO WS-PRIM-APPL.            01284070
P0045      IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'P'              01284080
P0135          MOVE ZEROS TO WS-PRIM-BRANCH                             01284090
P0135          MOVE ZEROS TO WS-PRIM-TYPE                               01284096
P0045          MOVE ZEROS TO WS-PRIM-SCNXT                              01284110
P0135          GO TO VPA-PRIMARY-OPTION.                                01284120
P0045      IF WS-PRIM-APPL IS EQUAL TO ZEROS                            01284130
P0045          MOVE WS-INTRFACE (100) TO SR-060CALLNAME                 01284140
P0045      ELSE                                                         01284150
P0045          MOVE WS-INTRFACE (WS-PRIM-APPL) TO SR-060CALLNAME.       01284160
P0045      IF SR-060CALLNAME IS EQUAL TO SPACES                         01284170
P0045          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01284180
P0045          MOVE 'E' TO RPXXX30-RETURN                               01284190
P0045          MOVE 500016 TO RPXXX30-MSGNBR                            01284200
P0045          MOVE 500016 TO RPXXX30-RESP-MSG-NBR                      01284210
P0045          GO TO VPA-EXIT.                                          01284220
P0045      MOVE RPXXX30-CONTROLS TO RPINF00-CONTROLS.                   01284230
P0045      MOVE RPXXX30-PRIMARY-INST TO RPINF00-INST.                   01284240
P0045      MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPINF00-ACCOUNT.            01284250
P0045      MOVE RPXXX30-PRIMARY-PROD-CODE TO RPINF00-PRODCODE.          01284260
P0045      MOVE WS-PRIM-APPL TO RPINF00-APPLR.                          01284270
P0045      MOVE MIM-7101CLOSEDACCTOPT TO RPINF00-CLOSEDACCTOPT.         01284280
P0045      MOVE 'R' TO RPINF00-FUNC.                                    01284290
P0045      EXEC CICS LINK                                               01284300
P0045          PROGRAM(SR-060CALLNAME)                                  01284310
P0045          COMMAREA(WS-LINKAPPL)                                    01284320
P0045          LENGTH(LENGTH OF WS-LINKAPPL)                            01284330
P0045          NOHANDLE                                                 01284340
P0045          END-EXEC.                                                01284350
P0045      IF RPINF00-FUNCTION IS NOT EQUAL TO SPACE                    01284360
P0045          AND RPINF00-FUNCTION IS NOT EQUAL TO 'N'                 01284370
P0045          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01284380
P0045          GO TO VPA-EXIT.                                          01284390
P0045      IF RPINF00-FUNCTION IS EQUAL TO 'N'                          01284400
P0135          MOVE ZEROS TO WS-PRIM-SCNXT                              01284410
P0045          MOVE RPXXX30-NEW-BR TO RPINF00-BRANCH                    01284420
P0084          MOVE RPXXX30-NEW-TERM TO RPINF00-TERM                    01284425
P0045          MOVE RPXXX30-NEW-ACCT-TYPE TO RPINF00-ACCT-TYPE          01284430
P0045          MOVE RPXXX30-NEW-CURBAL TO RPINF00-CURBAL                01284440
P0045          MOVE RPXXX30-NEW-CURCUSTCOL TO RPINF00-CURCUSTCOL        01284450
P0045          MOVE RPXXX30-NEW-CURBANKCOL TO RPINF00-CURBANKCOL        01284460
P0045          MOVE RPXXX30-NEW-LOWBAL TO RPINF00-LOWBAL                01284470
P0045          MOVE RPXXX30-NEW-AVGBAL TO RPINF00-AVGBAL                01284480
P0045          MOVE RPXXX30-NEW-AVGCOLBAL TO RPINF00-AVGCOLBAL          01284490
P0045          MOVE RPXXX30-NEW-COMMAMT TO RPINF00-COMMAMT              01284500
P0135          MOVE RPXXX30-NEW-CREDIT-LIMIT TO RPINF00-CREDIT-LIMIT    01284510
P0135          GO TO VPA-PRIMARY-OPTION.                                01284512
P0135      IF RPXXX30-NEW-BR IS GREATER THAN ZEROS                      01284514
P0135          MOVE RPXXX30-NEW-BR TO RPINF00-BRANCH.                   01284516
P0135      IF RPXXX30-NEW-ACCT-TYPE IS GREATER THAN ZEROS               01284518
P0135          MOVE RPXXX30-NEW-ACCT-TYPE TO RPINF00-ACCT-TYPE.         01284520
P0135      IF RPXXX30-NEW-TERM IS GREATER THAN ZEROS                    01284522
P0135          MOVE RPXXX30-NEW-TERM TO RPINF00-TERM.                   01284524
P0135      IF RPXXX30-NEW-CURBAL IS GREATER THAN ZEROS                  01284526
P0135          MOVE RPXXX30-NEW-CURBAL TO RPINF00-CURBAL.               01284528
P0135      IF RPXXX30-NEW-CURCUSTCOL IS GREATER THAN ZEROS              01284530
P0135          MOVE RPXXX30-NEW-CURCUSTCOL TO RPINF00-CURCUSTCOL.       01284532
P0135      IF RPXXX30-NEW-CURBANKCOL IS GREATER THAN ZEROS              01284534
P0135          MOVE RPXXX30-NEW-CURBANKCOL TO RPINF00-CURBANKCOL.       01284536
P0135      IF RPXXX30-NEW-LOWBAL IS GREATER THAN ZEROS                  01284538
P0135          MOVE RPXXX30-NEW-LOWBAL TO RPINF00-LOWBAL.               01284540
P0135      IF RPXXX30-NEW-AVGBAL IS GREATER THAN ZEROS                  01284542
P0135          MOVE RPXXX30-NEW-AVGBAL TO RPINF00-AVGBAL.               01284544
P0135      IF RPXXX30-NEW-AVGCOLBAL IS GREATER THAN ZEROS               01284546
P0135          MOVE RPXXX30-NEW-AVGCOLBAL TO RPINF00-AVGCOLBAL.         01284548
P0135      IF RPXXX30-NEW-COMMAMT IS GREATER THAN ZEROS                 01284550
P0135          MOVE RPXXX30-NEW-COMMAMT TO RPINF00-COMMAMT.             01284552
P0135      IF RPXXX30-NEW-CREDIT-LIMIT IS GREATER THAN ZEROS            01284554
P0135          MOVE RPXXX30-NEW-CREDIT-LIMIT TO RPINF00-CREDIT-LIMIT.   01284556
P0135      MOVE RPINF00-SCNXT TO WS-PRIM-SCNXT.                         01284558
P0135      MOVE RPINF00-BRANCH TO WS-PRIM-BRANCH.                       01284560
P0135      MOVE RPINF00-ACCT-TYPE TO WS-PRIM-TYPE.                      01284562
P0135      IF RPINF00-TERM IS NOT NUMERIC                               01284564
P0135          MOVE ZEROS TO WS-TERM                                    01284566
P0135      ELSE                                                         01284568
P0135          MOVE RPINF00-TERM TO RPXXX30-NEW-TERM                    01284570
P0135          MOVE RPINF00-TERM TO WS-TERM.                            01284572
P0135  VPA-PRIMARY-OPTION.                                              01284574
P0135      PERFORM VALIDATE-PRIMARY-OPTION.                             01284576
P0045      IF WS-PRIMOPT-FAIL IS EQUAL TO 'Y'                           01284580
P0045          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01284590
P0045          MOVE 'E' TO RPXXX30-RETURN                               01284600
P0045          MOVE 500089 TO RPXXX30-MSGNBR                            01284610
P0045          MOVE 500089 TO RPXXX30-RESP-MSG-NBR                      01284620
P0045          GO TO VPA-EXIT.                                          01284630
012850 VPA-7102.                                                        01285000
012860     MOVE RPXXX30-PRIMARY-MODEL TO WS-RPMIM7102MODEL.             01286000
012870     MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-RPMIM7102PRODCODE.      01287000
P0045      MOVE WS-PRIM-TYPE TO WS-RPMIM7102TYPE.                       01288000
012890 VPA-7102-SEARCH.                                                 01289000
012900     PERFORM SEARCH-RPS-7102.                                     01290000
012910     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01291000
012920         MOVE 'B' TO WS-PRIM-7102                                 01292000
012930         MOVE MIM-7102RATETYPE TO WS-SAV7102-RATETYPE             01293000
012940         GO TO VPA-7102-FOUND.                                    01294000
P0045  VPA-7102-TYPEZERO.                                               01295000
P0045      MOVE ZERO TO WS-RPMIM7102TYPE.                               01295590
P0045      PERFORM SEARCH-RPS-7102.                                     01296180
P0045      IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01296770
P0045          MOVE 'P' TO WS-PRIM-7102                                 01297360
P0045          GO TO VPA-7102-FOUND.                                    01297950
P0045  VPA-7102-MODELONLY.                                              01298540
P0045      MOVE SPACES TO WS-RPMIM7102PRODCODE.                         01299130
P0045      PERFORM SEARCH-RPS-7102.                                     01299720
P0045      IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01300310
P0045          MOVE 'M' TO WS-PRIM-7102                                 01300900
P0045          GO TO VPA-7102-FOUND.                                    01301490
P0045      MOVE 'Y' TO WS-PRIM-FATAL-ERROR.                             01302080
P0045      MOVE 'E' TO RPXXX30-RETURN.                                  01302670
P0045      MOVE 500007 TO RPXXX30-MSGNBR.                               01303260
P0045      MOVE 500007 TO RPXXX30-RESP-MSG-NBR.                         01303850
P0045      GO TO VPA-EXIT.                                              01304440
013060 VPA-7102-FOUND.                                                  01306000
013070     MOVE 'Y' TO WS-7102-FOUND.                                   01307000
013080     MOVE MIM-7102PRIMSCINCOPT TO WS-REL-SCINCOPT.                01308000
013090     MOVE MIM-7102DISCAMT TO WS-REL-SCDISCAMT.                    01309000
013100     MOVE MIM-7102DISCPCT TO WS-REL-SCDISCPCT.                    01310000
013110     MOVE MIM-7102SCINCTABLE TO WS-REL-SCCATCODE.                 01311000
013120     MOVE MIM-7102PRIMRATEINCOPT TO WS-REL-RATEINCOPT.            01312000
013130     MOVE MIM-7102RATETYPE TO WS-REL-RATETYPE.                    01313000
013140     MOVE MIM-7102RATEPCT TO WS-REL-RATEPCT.                      01314000
013150     MOVE MIM-7102RATEINCTABLE TO WS-REL-RATECATCODE.             01315000
013160     MOVE MIM-7102TIMEPROCOPT TO WS-REL-TIMEPROCOPT.              01316000
013170     IF MIM-7102SECSVCPLAN IS NOT EQUAL TO SPACES                 01317000
013180         OR MIM-7102SECSVCTABLE IS NOT EQUAL TO SPACES            01318000
013190         MOVE 'Y' TO WS-REL-SEC-SERVICE.                          01319000
013200     MOVE MIM-7102SECSVCOPT TO WS-REL-SECSVCOPT.                  01320000
013210     MOVE MIM-7102SECSVCPLAN TO WS-REL-SECSVCPLAN.                01321000
013220     MOVE MIM-7102SECSVCTABLE TO WS-REL-SECSVCTABLE.              01322000
013230     MOVE MIM-7102BONUSRATEOPT TO WS-REL-BONUSRATEOPT.            01323000
013240 VPA-READ-ACT.                                                    01324000
013250     MOVE RPXXX30-PRIMARY-INST TO RPACT-INST.                     01325000
013260     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPACT-PRODCODE.            01326000
013270     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPACT-ACCOUNT.              01327000
013280     PERFORM RPS-ACT-GET-REQUEST.                                 01328000
013290     IF WS-FUNCTION IS EQUAL TO 'N'                               01329000
013300         GO TO VPA-7102-ACCTINFO.                                 01330000
013310     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      01331000
013320         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01332000
013330         MOVE 500021 TO RPXXX30-MSGNBR                            01333000
013340         MOVE 500021 TO RPXXX30-RESP-MSG-NBR                      01334000
013350         MOVE 'E' TO RPXXX30-RETURN                               01335000
013360         GO TO VPA-EXIT.                                          01336000
013370 VPA-ACT-CHECK.                                                   01337000
013380     IF WS-EXPIRED-STATUS IS EQUAL TO 'P'                         01338000
013390         AND RPACT-RATE-MODEL IS EQUAL TO RPXXX30-PRIMARY-MODEL   01339000
013400         GO TO VPA-SC-CHECK.                                      01340000
P0110      IF MIM-7102PRIMRATEINCOPT IS EQUAL TO 'N'                    01340100
P0110          OR RPACT-RATE-INC-OPTION IS EQUAL TO 'N'                 01340200
P0110          GO TO VPA-SC-CHECK.                                      01340300
P0110      MOVE RPACT-RATE-MODEL TO WS-EXPIRED-MODEL.                   01340400
P0110      PERFORM CHECK-EXPIRED-MODEL.                                 01340500
P0110      IF WS-EXPIRED-FLAG IS EQUAL TO 'Y'                           01340600
P0110          GO TO VPA-SC-CHECK.                                      01340700
013410     IF RPACT-RATE-INC-OPTION IS EQUAL TO 'Y'                     01341000
013420         AND MIM-7102PRIMRATEINCOPT IS EQUAL TO 'Y'               01342000
013430         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01343000
013440         MOVE 'E' TO RPXXX30-RETURN                               01344000
013450         MOVE 501012 TO RPXXX30-MSGNBR                            01345000
013460         MOVE 501012 TO RPXXX30-RESP-MSG-NBR                      01346000
013470         GO TO VPA-EXIT.                                          01347000
013480 VPA-SC-CHECK.                                                    01348000
013490     IF MIM-7100DUPINCOPT IS EQUAL TO 'Y'                         01349000
013500         GO TO VPA-7102-ACCTINFO.                                 01350000
013510     IF WS-EXPIRED-STATUS IS EQUAL TO 'P'                         01351000
013520         AND RPACT-SC-MODEL IS EQUAL TO RPXXX30-PRIMARY-MODEL     01352000
013530         GO TO VPA-7102-ACCTINFO.                                 01353000
P0110      IF MIM-7102PRIMSCINCOPT IS EQUAL TO 'N'                      01353100
P0110          OR RPACT-SC-INC-OPTION IS EQUAL TO 'N'                   01353200
P0110          GO TO VPA-7102-ACCTINFO.                                 01353300
P0110      MOVE RPACT-SC-MODEL TO WS-EXPIRED-MODEL.                     01353400
P0110      PERFORM CHECK-EXPIRED-MODEL.                                 01353500
P0110      IF WS-EXPIRED-FLAG IS EQUAL TO 'Y'                           01353600
P0110          GO TO VPA-7102-ACCTINFO.                                 01353700
013540     IF RPACT-SC-INC-OPTION IS EQUAL TO 'Y'                       01354000
013550         AND MIM-7102PRIMSCINCOPT IS EQUAL TO 'Y'                 01355000
013560         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01356000
013570         MOVE 'E' TO RPXXX30-RETURN                               01357000
013580         MOVE 501011 TO RPXXX30-MSGNBR                            01358000
013590         MOVE 501011 TO RPXXX30-RESP-MSG-NBR                      01359000
013600         GO TO VPA-EXIT.                                          01360000
013610 VPA-7102-ACCTINFO.                                               01361000
013620     MOVE MIM-7102PRIMSCINCOPT TO WS-PRIM-SCINCOPT.               01362000
013630     MOVE MIM-7102PRIMRATEINCOPT TO WS-PRIM-RATEINCOPT.           01363000
013640     MOVE MIM-7102RATEPCT TO WS-PRIM-RATEPCT.                     01364000
013650     IF MIM-7102PRIMRATEINCOPT IS EQUAL TO 'Y'                    01365000
013660         AND MIM-7102RATEINCTABLE IS NOT EQUAL TO SPACES          01366000
013670         MOVE MIM-7102RATEINCTABLE TO WS-PRIM-RATEINCTABLE        01367000
013680     ELSE                                                         01368000
013690         MOVE SPACES TO WS-PRIM-RATEINCTABLE.                     01369000
013700     MOVE MIM-7102RATETYPE TO WS-PRIM-RATETYPE.                   01370000
013710     MOVE MIM-7102TIMEPROCOPT TO WS-PRIM-TIMEPROCOPT.             01371000
013720     MOVE MIM-7102PRODUCTGROUP TO WS-PRIM-PROD-GROUP.             01372000
P0045      IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'P'              01373000
P0045          GO TO VPA-PRIMARY-ACCT-VALID.                            01382990
014250 VPA-7102-BRANCH.                                                 01425000
014260     IF MIM-7102BRCHREGIONCD IS EQUAL TO SPACES                   01426000
014270         OR (MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'B'           01427000
014280         AND MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'E')          01428000
P0135          GO TO VPA-7102-MINTERM.                                  01429000
014300     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7107INST.               01430000
014310     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7107INST2.              01431000
014320     MOVE WS-PRIM-BRANCH TO WS-RPMIM7107BRCHREGION.               01432000
014330     MOVE MIM-7102BRCHREGIONCD TO WS-RPMIM7107RPREC.              01433000
014340     PERFORM VALIDATE-BRANCH.                                     01434000
014350     IF WS-RPMIM7107ERROR IS EQUAL TO '2'                         01435000
014360         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01436000
014370         MOVE 'E' TO RPXXX30-RETURN                               01437000
014380         MOVE 500012 TO RPXXX30-MSGNBR                            01438000
014390         MOVE 500012 TO RPXXX30-RESP-MSG-NBR                      01439000
014400         GO TO VPA-EXIT.                                          01440000
014410     IF WS-RPMIM7107ERROR IS NOT EQUAL TO SPACES                  01441000
014420         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01442000
014430         MOVE 'E' TO RPXXX30-RETURN                               01443000
014440         MOVE 500030 TO RPXXX30-MSGNBR                            01444000
014450         MOVE 500030 TO RPXXX30-RESP-MSG-NBR                      01445000
014460         GO TO VPA-EXIT.                                          01446000
P0135  VPA-7102-MINTERM.                                                01446040
P0135      IF MIM-7102MINTERM-Q IS NOT EQUAL TO 'B'                     01446080
P0135          AND MIM-7102MINTERM-Q IS NOT EQUAL TO 'E'                01446120
P0135          GO TO VPA-7102-MAXTERM.                                  01446160
P0135      IF RPINF00-TERM IS LESS THAN MIM-7102MINTERM                 01446200
P0135          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01446240
P0135          MOVE 'E' TO RPXXX30-RETURN                               01446280
P0135          MOVE 500047 TO RPXXX30-MSGNBR                            01446320
P0135          MOVE 500047 TO RPXXX30-RESP-MSG-NBR                      01446360
P0135          GO TO VPA-EXIT.                                          01446400
P0135  VPA-7102-MAXTERM.                                                01446440
P0135      IF MIM-7102MAXTERM-Q IS NOT EQUAL TO 'B'                     01446480
P0135          AND MIM-7102MAXTERM-Q IS NOT EQUAL TO 'E'                01446520
P0135          GO TO VPA-7102-USEROPT1.                                 01446560
P0135      IF RPINF00-TERM IS GREATER THAN MIM-7102MAXTERM              01446600
P0135          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01446640
P0135          MOVE 'E' TO RPXXX30-RETURN                               01446680
P0135          MOVE 500048 TO RPXXX30-MSGNBR                            01446720
P0135          MOVE 500048 TO RPXXX30-RESP-MSG-NBR                      01446760
P0135          GO TO VPA-EXIT.                                          01446800
014470 VPA-7102-USEROPT1.                                               01447000
014480     IF MIM-7102USERTYPE1 IS EQUAL TO 'S'                         01448000
014490         GO TO VPA-7102-USEROPT2.                                 01449000
014500     IF MIM-7102USEROPT1-Q IS NOT EQUAL TO 'B'                    01450000
014510         AND MIM-7102USEROPT1-Q IS NOT EQUAL TO 'E'               01451000
014520         GO TO VPA-7102-USEROPT2.                                 01452000
014530     IF (MIM-7102USEROPTREL1 IS EQUAL TO 'EQ'                     01453000
014540         AND RPINF00-USEROPT1 IS NOT EQUAL TO MIM-7102USEROPT1)   01454000
014550         OR (MIM-7102USEROPTREL1 IS EQUAL TO 'NE'                 01455000
014560         AND RPINF00-USEROPT1 IS EQUAL TO MIM-7102USEROPT1)       01456000
014570         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01457000
014580         MOVE 'E' TO RPXXX30-RETURN                               01458000
014590         MOVE 500083 TO RPXXX30-MSGNBR                            01459000
014600         MOVE 500083 TO RPXXX30-RESP-MSG-NBR                      01460000
014610         GO TO VPA-EXIT.                                          01461000
014620 VPA-7102-USEROPT2.                                               01462000
014630     IF MIM-7102USERTYPE2 IS EQUAL TO 'S'                         01463000
014640         GO TO VPA-7102-USEROPT3.                                 01464000
014650     IF MIM-7102USEROPT2-Q IS NOT EQUAL TO 'B'                    01465000
014660         AND MIM-7102USEROPT2-Q IS NOT EQUAL TO 'E'               01466000
014670         GO TO VPA-7102-USEROPT3.                                 01467000
014680     IF (MIM-7102USEROPTREL2 IS EQUAL TO 'EQ'                     01468000
014690         AND RPINF00-USEROPT2 IS NOT EQUAL TO MIM-7102USEROPT2)   01469000
014700         OR (MIM-7102USEROPTREL2 IS EQUAL TO 'NE'                 01470000
014710         AND RPINF00-USEROPT2 IS EQUAL TO MIM-7102USEROPT2)       01471000
014720         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01472000
014730         MOVE 'E' TO RPXXX30-RETURN                               01473000
014740         MOVE 500084 TO RPXXX30-MSGNBR                            01474000
014750         MOVE 500084 TO RPXXX30-RESP-MSG-NBR                      01475000
014760         GO TO VPA-EXIT.                                          01476000
014770 VPA-7102-USEROPT3.                                               01477000
014780     IF MIM-7102USERTYPE3 IS EQUAL TO 'S'                         01478000
014790         GO TO VPA-7102-USEROPT4.                                 01479000
014800     IF MIM-7102USEROPT3-Q IS NOT EQUAL TO 'B'                    01480000
014810         AND MIM-7102USEROPT3-Q IS NOT EQUAL TO 'E'               01481000
014820         GO TO VPA-7102-USEROPT4.                                 01482000
014830     IF (MIM-7102USEROPTREL3 IS EQUAL TO 'EQ'                     01483000
014840         AND RPINF00-USEROPT3 IS NOT EQUAL TO MIM-7102USEROPT3)   01484000
014850         OR (MIM-7102USEROPTREL3 IS EQUAL TO 'NE'                 01485000
014860         AND RPINF00-USEROPT3 IS EQUAL TO MIM-7102USEROPT3)       01486000
014870         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01487000
014880         MOVE 'E' TO RPXXX30-RETURN                               01488000
014890         MOVE 500085 TO RPXXX30-MSGNBR                            01489000
014900         MOVE 500085 TO RPXXX30-RESP-MSG-NBR                      01490000
014910         GO TO VPA-EXIT.                                          01491000
014920 VPA-7102-USEROPT4.                                               01492000
014930     IF MIM-7102USERTYPE4 IS EQUAL TO 'S'                         01493000
014940         GO TO VPA-7102-RATE-BALANCE.                             01494000
014950     IF MIM-7102USEROPT4-Q IS NOT EQUAL TO 'B'                    01495000
014960         AND MIM-7102USEROPT4-Q IS NOT EQUAL TO 'E'               01496000
014970         GO TO VPA-7102-RATE-BALANCE.                             01497000
014980     IF (MIM-7102USEROPTREL4 IS EQUAL TO 'EQ'                     01498000
014990         AND RPINF00-USEROPT4 IS NOT EQUAL TO MIM-7102USEROPT4)   01499000
015000         OR (MIM-7102USEROPTREL4 IS EQUAL TO 'NE'                 01500000
015010         AND RPINF00-USEROPT4 IS EQUAL TO MIM-7102USEROPT4)       01501000
015020         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01502000
015030         MOVE 'E' TO RPXXX30-RETURN                               01503000
015040         MOVE 500086 TO RPXXX30-MSGNBR                            01504000
015050         MOVE 500086 TO RPXXX30-RESP-MSG-NBR                      01505000
015060         GO TO VPA-EXIT.                                          01506000
015070 VPA-7102-RATE-BALANCE.                                           01507000
015080     MOVE ZEROS TO WS-REL-ACCTRATEBAL.                            01508000
015090     IF MIM-7102ACCTRATEBALCD IS EQUAL TO ZEROS                   01509000
015100         GO TO VPA-7102-BALANCE.                                  01510000
015110     MOVE MIM-7102ACCTRATEBALCD TO WS-WORK-COMBBALCD.             01511000
015120     PERFORM GET-BALANCE.                                         01512000
015130     MOVE WS-WORK-BALANCE TO WS-REL-ACCTRATEBAL.                  01513000
015140 VPA-7102-BALANCE.                                                01514000
015150     IF MIM-7102PRIMCATCD-Q IS NOT EQUAL TO 'E'                   01515000
015160         GO TO VPA-7101-PRIMBALOPT.                               01516000
015170     IF MIM-7102PRIMCATCD IS EQUAL TO SPACES                      01517000
015180         GO TO VPA-7101-PRIMBALOPT.                               01518000
015190     MOVE MIM-7102PRIMCATCD TO WS-RPMIM7106RPREC.                 01519000
015200     PERFORM SEARCH-RPS-7106.                                     01520000
015210     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01521000
015220         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01522000
015230         GO TO VPA-EXIT.                                          01523000
015240     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01524000
015250     PERFORM GET-BALANCE.                                         01525000
015260     MOVE WS-WORK-BALANCE TO WS-PRIMCATBAL.                       01526000
015270     IF WS-PRIMCATBAL IS LESS THAN MIM-7106BALREQ-E               01527000
015280         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01528000
015290         MOVE 'E' TO RPXXX30-RETURN                               01529000
015300         MOVE 501017 TO RPXXX30-MSGNBR                            01530000
015310         MOVE 501017 TO RPXXX30-RESP-MSG-NBR                      01531000
015320         GO TO VPA-EXIT.                                          01532000
015330 VPA-7101-PRIMBALOPT.                                             01533000
015340     IF MIM-7101PRIMBALOPT-Q IS NOT EQUAL TO 'E'                  01534000
015350         GO TO VPA-7101-PRIMCOMBOPT.                              01535000
015360     IF MIM-7101PRIMBALOPT IS EQUAL TO 'N'                        01536000
015370         GO TO VPA-7101-PRIMCOMBOPT.                              01537000
015380 VPA-IND-BALANCES.                                                01538000
015390     MOVE ZEROS TO WS-REL-BAL1.                                   01539000
015400     MOVE ZEROS TO WS-REL-BALREQ1.                                01540000
015410     MOVE ZEROS TO WS-REL-BAL2.                                   01541000
015420     MOVE ZEROS TO WS-REL-BALREQ2.                                01542000
015430     MOVE SPACES TO WS-REL-BALCATCODE1.                           01543000
015440     MOVE SPACES TO WS-REL-BALCATCODE2.                           01544000
015450     IF MIM-7101PRIMBALOPT-I IS NOT EQUAL TO 'Y'                  01545000
015460         GO TO VPA-7101-PRIMCOMBOPT.                              01546000
015470     IF MIM-7101PRIMBALOPT IS NOT EQUAL TO 'Y'                    01547000
015480         GO TO VPA-7101-PRIMCOMBOPT.                              01548000
015490     IF MIM-7101ACCTRELCD-I IS NOT EQUAL TO 'Y'                   01549000
015500         GO TO VPA-7101-PRIMCOMBOPT.                              01550000
015510 VPA-7102-BALCATCD1.                                              01551000
015520     IF MIM-7101ACCTRELCD-Q IS NOT EQUAL TO 'E'                   01552000
015530         GO TO VPA-7101-PRIMCOMBOPT.                              01553000
015540     IF MIM-7102BALCATCD1-Q IS NOT EQUAL TO 'E'                   01554000
015550         GO TO VPA-7102-BALCATCD2.                                01555000
015560     IF MIM-7102BALCATCD1 IS EQUAL TO SPACES                      01556000
015570         GO TO VPA-7102-BALCATCD2.                                01557000
015580     MOVE MIM-7102BALCATCD1 TO WS-RPMIM7106RPREC.                 01558000
015590     PERFORM SEARCH-RPS-7106.                                     01559000
015600     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01560000
015610         GO TO VPA-7102-BALCATCD2.                                01561000
015620     MOVE MIM-7102BALCATCD1 TO WS-REL-BALCATCODE1.                01562000
015630     MOVE MIM-7106BALREQ-E TO WS-REL-BALREQ1.                     01563000
015640     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01564000
015650*    MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01565000
015660     PERFORM GET-BALANCE.                                         01566000
015670     MOVE WS-WORK-BALANCE TO WS-REL-BAL1.                         01567000
015680     IF WS-WORK-BALANCE IS LESS THAN MIM-7106BALREQ-E             01568000
015690         GO TO VPA-7102-BALCATCD2.                                01569000
015700     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        01570000
015710         ADD +1 TO WS-ACCTRELCD-O.                                01571000
015720     GO TO VPA-7101-PRIMCOMBOPT.                                  01572000
015730 VPA-7102-BALCATCD2.                                              01573000
015740     IF MIM-7102BALCATCD2-Q IS NOT EQUAL TO 'E'                   01574000
015750         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01575000
015760             GO TO VPA-7101-PRIMCOMBOPT                           01576000
015770         ELSE                                                     01577000
015780             MOVE 'Y' TO WS-PRIM-FATAL-ERROR                      01578000
015790             GO TO VPA-EXIT.                                      01579000
015800     IF MIM-7102BALCATCD2 IS EQUAL TO SPACES                      01580000
015810         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01581000
015820             GO TO VPA-7101-PRIMCOMBOPT                           01582000
015830         ELSE                                                     01583000
015840             MOVE 'Y' TO WS-PRIM-FATAL-ERROR                      01584000
015850             GO TO VPA-EXIT.                                      01585000
015860     MOVE MIM-7102BALCATCD2 TO WS-REL-BALCATCODE2.                01586000
015870     MOVE MIM-7102BALCATCD2 TO WS-RPMIM7106RPREC.                 01587000
015880     PERFORM SEARCH-RPS-7106.                                     01588000
015890     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01589000
015900         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01590000
015910             GO TO VPA-7101-PRIMCOMBOPT                           01591000
015920         ELSE                                                     01592000
015930             MOVE 'Y' TO WS-PRIM-FATAL-ERROR                      01593000
015940             GO TO VPA-EXIT.                                      01594000
015950     MOVE MIM-7106BALREQ-E TO WS-REL-BALREQ2.                     01595000
015960     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01596000
015970     PERFORM GET-BALANCE.                                         01597000
015980     MOVE WS-WORK-BALANCE TO WS-PRIMCATBAL.                       01598000
015990     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'A'                        01599000
016000         AND WS-PRIMCATBAL IS LESS THAN MIM-7106BALREQ-E          01600000
016010         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01601000
016020         MOVE 'E' TO RPXXX30-RETURN                               01602000
016030         MOVE 501018 TO RPXXX30-MSGNBR                            01603000
016040         MOVE 501018 TO RPXXX30-RESP-MSG-NBR                      01604000
016050         GO TO VPA-EXIT.                                          01605000
016060     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        01606000
016070         AND WS-PRIMCATBAL IS NOT LESS THAN MIM-7106BALREQ-E      01607000
016080         ADD +1 TO WS-ACCTRELCD-O.                                01608000
016090  VPA-7101-PRIMCOMBOPT.                                           01609000
016100     IF MIM-7101PRIMCOMBOPT1-Q IS NOT EQUAL TO 'E'                01610000
016110         GO TO VPA-7101-PRIMCOMBOPT2.                             01611000
016120     IF MIM-7101PRIMCOMBOPT1 IS NOT EQUAL TO 'Y'                  01612000
016130         GO TO VPA-7101-PRIMCOMBOPT2.                             01613000
016140     IF MIM-7101COMBCATCD1-Q IS NOT EQUAL TO 'E'                  01614000
016150         GO TO VPA-7101-PRIMCOMBOPT2.                             01615000
016160     IF MIM-7101COMBCATCD1 IS EQUAL TO SPACES                     01616000
016170         GO TO VPA-7101-PRIMCOMBOPT2.                             01617000
016180     IF MIM-7102COMBBALCD1-Q IS EQUAL TO 'E'                      01618000
016190         MOVE MIM-7102COMBBALCD1 TO WS-WORK-BALCD                 01619000
016200         GO TO VPA-7101-PRIMCOMBOPT1-CONT.                        01620000
016210     MOVE MIM-7101COMBCATCD1 TO WS-RPMIM7106RPREC.                01621000
016220     PERFORM SEARCH-RPS-7106.                                     01622000
016230     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01623000
016240         GO TO VPA-7101-PRIMCOMBOPT2.                             01624000
P0045      MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01625000
016260     MOVE MIM-7106BALCD TO WS-7101COMBBALCD1.                     01626000
016270     MOVE MIM-7106BALREQ-E TO WS-7101COMBBALREQ1.                 01627000
016280 VPA-7101-PRIMCOMBOPT1-CONT.                                      01628000
016290     PERFORM GET-BALANCE.                                         01629000
016300     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL1.                      01630000
016310 VPA-7101-PRIMCOMBOPT2.                                           01631000
016320     IF MIM-7101PRIMCOMBOPT2-Q IS NOT EQUAL TO 'E'                01632000
016330         GO TO VPA-7101-PRIMCOMBOPT3.                             01633000
016340     IF MIM-7101PRIMCOMBOPT2 IS NOT EQUAL TO 'Y'                  01634000
016350         GO TO VPA-7101-PRIMCOMBOPT3.                             01635000
016360     IF MIM-7101COMBCATCD2-Q IS NOT EQUAL TO 'E'                  01636000
016370         GO TO VPA-7101-PRIMCOMBOPT3.                             01637000
016380     IF MIM-7101COMBCATCD2 IS EQUAL TO SPACES                     01638000
016390         GO TO VPA-7101-PRIMCOMBOPT3.                             01639000
016400     IF MIM-7102COMBBALCD2-Q IS EQUAL TO 'E'                      01640000
016410         MOVE MIM-7102COMBBALCD2 TO WS-WORK-BALCD                 01641000
016420         GO TO VPA-7101-PRIMCOMBOPT2-CONT.                        01642000
016430     MOVE MIM-7101COMBCATCD2 TO WS-RPMIM7106RPREC.                01643000
016440     PERFORM SEARCH-RPS-7106.                                     01644000
016450     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01645000
016460         GO TO VPA-7101-PRIMCOMBOPT3.                             01646000
016470     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01647000
016480     MOVE MIM-7106BALCD TO WS-7101COMBBALCD2.                     01648000
016490     MOVE MIM-7106BALREQ-E TO WS-7101COMBBALREQ2.                 01649000
016500 VPA-7101-PRIMCOMBOPT2-CONT.                                      01650000
016510     PERFORM GET-BALANCE.                                         01651000
016520     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL2.                      01652000
016530 VPA-7101-PRIMCOMBOPT3.                                           01653000
016540     IF MIM-7101PRIMCOMBOPT3-Q IS NOT EQUAL TO 'E'                01654000
016550         GO TO VPA-7101-PRIMCOMBOPT4.                             01655000
016560     IF MIM-7101PRIMCOMBOPT3 IS NOT EQUAL TO 'Y'                  01656000
016570         GO TO VPA-7101-PRIMCOMBOPT4.                             01657000
016580     IF MIM-7101COMBCATCD3-Q IS NOT EQUAL TO 'E'                  01658000
016590         GO TO VPA-7101-PRIMCOMBOPT4.                             01659000
016600     IF MIM-7101COMBCATCD3 IS EQUAL TO SPACES                     01660000
016610         GO TO VPA-7101-PRIMCOMBOPT4.                             01661000
016620     IF MIM-7102COMBBALCD3-Q IS EQUAL TO 'E'                      01662000
016630         MOVE MIM-7102COMBBALCD3 TO WS-WORK-BALCD                 01663000
016640         GO TO VPA-7101-PRIMCOMBOPT3-CONT.                        01664000
016650     MOVE MIM-7101COMBCATCD3 TO WS-RPMIM7106RPREC.                01665000
016660     PERFORM SEARCH-RPS-7106.                                     01666000
016670     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01667000
016680         GO TO VPA-7101-PRIMCOMBOPT4.                             01668000
016690     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01669000
016700     MOVE MIM-7106BALCD TO WS-7101COMBBALCD3.                     01670000
016710     MOVE MIM-7106BALREQ-E TO WS-7101COMBBALREQ3.                 01671000
016720 VPA-7101-PRIMCOMBOPT3-CONT.                                      01672000
016730     PERFORM GET-BALANCE.                                         01673000
016740     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL3.                      01674000
016750 VPA-7101-PRIMCOMBOPT4.                                           01675000
016760     IF MIM-7101PRIMCOMBOPT4 IS NOT EQUAL TO 'Y'                  01676000
016770         GO TO VPA-PRIMARY-ACCT-VALID.                            01677000
016780     IF MIM-7101PRIMCOMBOPT4-Q IS NOT EQUAL TO 'E'                01678000
016790         GO TO VPA-PRIMARY-ACCT-VALID.                            01679000
016800     IF MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'                  01680000
016810         GO TO VPA-PRIMARY-ACCT-VALID.                            01681000
016820     IF MIM-7101COMBCATCD4 IS EQUAL TO SPACES                     01682000
016830         GO TO VPA-PRIMARY-ACCT-VALID.                            01683000
016840     IF MIM-7102COMBBALCD4-Q IS EQUAL TO 'E'                      01684000
016850         MOVE MIM-7102COMBBALCD4 TO WS-WORK-BALCD                 01685000
016860         GO TO VPA-7101-PRIMCOMBOPT4-CONT.                        01686000
016870     MOVE MIM-7101COMBCATCD4 TO WS-RPMIM7106RPREC.                01687000
016880     PERFORM SEARCH-RPS-7106.                                     01688000
016890     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01689000
016900         GO TO VPA-PRIMARY-ACCT-VALID.                            01690000
016910     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01691000
016920     MOVE MIM-7106BALCD TO WS-7101COMBBALCD4.                     01692000
016930     MOVE MIM-7106BALREQ-E TO WS-7101COMBBALREQ4.                 01693000
016940 VPA-7101-PRIMCOMBOPT4-CONT.                                      01694000
016950     PERFORM GET-BALANCE.                                         01695000
016960     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL4.                      01696000
016970 VPA-PRIMARY-ACCT-VALID.                                          01697000
016980     MOVE 'Y' TO WS-PRIMARY-ENROLL.                               01698000
016990 VPA-EXIT.                                                        01699000
017000     EXIT.                                                        01700000
017010******************************************************************01701000
P0045  VALIDATE-PRIMARY-OPTION SECTION.                                 01701020
P0045  VPO-START.                                                       01701040
P0045      MOVE 'N' TO WS-PRIMOPT-FAIL.                                 01701060
P0045      MOVE SPACES TO WS-FUNCTION.                                  01701080
P0045      MOVE SPACES TO MI7102-RECORD.                                01701100
P0045      MOVE LOW-VALUES TO MIM-7102GRP-KEY.                          01701120
P0045      MOVE RPXXX30-PRIMARY-INST TO MIM-7102KINST.                  01701140
P0045      MOVE +7102 TO MIM-7102KREC.                                  01701160
P0045      MOVE WS-MODEL TO MIM-7102KMODEL.                             01701180
P0045      MOVE MIC-RPS-7102-PRI TO MIC-MST-REC-PRI.                    01701200
P0045      MOVE MI7102-RECORD TO MIMST-RECORD.                          01701220
P0045      PERFORM MIC-MST-GET-EQUAL-REQUEST.                           01701240
P0045      GO TO VPO-TEST.                                              01701260
P0045  VPO-FIND-NEXT.                                                   01701280
P0045      PERFORM MIC-MST-GET-NEXT-REQUEST.                            01701300
P0045  VPO-TEST.                                                        01701320
P0045      MOVE MIMST-RECORD TO MI7102-RECORD.                          01701340
P0045      IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01701360
P0045          GO TO VPO-EXIT.                                          01701380
P0045      IF MIM-7102KMODEL IS GREATER THAN WS-MODEL                   01701400
P0045          OR MIM-7102KINST IS NOT EQUAL TO RPXXX30-PRIMARY-INST    01701420
P0045          GO TO VPO-EXIT.                                          01701440
P0045      IF MIM-7102PRIMARY IS NOT EQUAL TO 'Y'                       01701460
P0045          GO TO VPO-FIND-NEXT.                                     01701480
P0045      IF MIM-7102KPRODCODE IS EQUAL TO SPACES                      01701500
P0045          AND MIM-7102KACCTTYPE IS EQUAL TO ZEROS                  01701520
P0045          GO TO VPO-EXIT.                                          01701540
P0045      MOVE WS-PRIM-PRODCD TO WS-SAVE-PRODCODE.                     01701560
P0045      MOVE WS-PRIM-TYPE TO WS-SAVE-ACCT-TYPE.                      01701580
P0045      IF MIM-7102KPRODCODE IS EQUAL TO WS-PRIM-PRODCD              01701600
P0045          AND (MIM-7102KACCTTYPE IS EQUAL TO ZEROS                 01701620
P0045          OR MIM-7102KACCTTYPE IS EQUAL TO WS-PRIM-TYPE)           01701640
P0045          GO TO VPO-EXIT.                                          01701660
P0045      MOVE 'Y' TO WS-PRIMOPT-FAIL.                                 01701680
P0045  VPO-EXIT.                                                        01701700
P0045      EXIT.                                                        01701720
P0045 ******************************************************************01701740
017020 VALIDATE-SECONDARY-ACCOUNTS SECTION.                             01702000
017030 VSA-START.                                                       01703000
017040     MOVE ZEROS TO WS-SUBSEC.                                     01704000
017050 VSA-NEXT.                                                        01705000
017060     ADD +1 TO WS-SUBSEC.                                         01706000
017070     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                01707000
017080         GO TO VSA-EXIT.                                          01708000
017090     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                01709000
017100         GO TO VSA-EXIT.                                          01710000
017110     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X'                   01711000
017120         GO TO VSA-NEXT.                                          01712000
017130     IF WS-SEC-SECACCT (WS-SUBSEC) IS EQUAL TO 'N'                01713000
017140         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01714000
017150         GO TO VSA-NEXT.                                          01715000
P0110      MOVE ZEROS TO WS-SECCATBAL.                                  01716000
P0110      MOVE ZEROS TO WS-SUBSEC2.                                    01716040
P0110  VSA-DUPLICATE-ACCOUNT-LOOP.                                      01716080
P0110      ADD +1 TO WS-SUBSEC2.                                        01716120
P0110      IF WS-SUBSEC2 IS NOT LESS THAN WS-SUBSEC                     01716160
P0110          GO TO VSA-READ-ACT.                                      01716200
P0110      IF WS-SEC-INST (WS-SUBSEC)                                   01716240
P0110          IS EQUAL TO WS-SEC-INST (WS-SUBSEC2)                     01716280
P0110          AND WS-SEC-PRODCD (WS-SUBSEC)                            01716320
P0110          IS EQUAL TO WS-SEC-PRODCD (WS-SUBSEC2)                   01716360
P0110          AND WS-SEC-ACCT (WS-SUBSEC)                              01716400
P0110          IS EQUAL TO WS-SEC-ACCT (WS-SUBSEC2)                     01716440
P0110          AND (WS-SEC-QUAL (WS-SUBSEC2) IS EQUAL TO SPACES         01716480
P0110          OR WS-SEC-QUAL (WS-SUBSEC2) IS EQUAL TO 'Y')             01716520
P0110          MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01716560
P0110          GO TO VSA-NEXT.                                          01716600
P0110      GO TO VSA-DUPLICATE-ACCOUNT-LOOP.                            01716640
017170 VSA-READ-ACT.                                                    01717000
017180     MOVE 'N' TO WS-ACT-FOUND.                                    01718000
017190     MOVE WS-SEC-INST (WS-SUBSEC) TO RPACT-INST.                  01719000
017200     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPACT-PRODCODE.            01720000
017210     MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPACT-ACCOUNT.               01721000
017220     MOVE 'R  ' TO SR-APIFUNC.                                    01722000
017230     PERFORM RPS-ACT-GET-REQUEST.                                 01723000
017240     IF WS-FUNCTION IS EQUAL TO 'N'                               01724000
017250         GO TO VSA-7101-CUSTRELCD.                                01725000
017260     MOVE 'Y' TO WS-ACT-FOUND.                                    01726000
017270     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      01727000
017280         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01728000
017290         GO TO VSA-NEXT.                                          01729000
017300 VSA-7101-CUSTRELCD.                                              01730000
017310     IF MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'B'                   01731000
017320         AND MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'E'              01732000
017330         GO TO VSA-ACCTINTERFACE.                                 01733000
017340     IF WS-RPMIM7104FOUND IS EQUAL TO 'N'                         01734000
017350         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01735000
017360         GO TO VSA-NEXT.                                          01736000
017370     MOVE +1 TO WS-SUB1.                                          01737000
P0045      MOVE WS-SAVE-MIM7104REC TO MIM-REC7104.                      01737500
017380     IF MIM-7104OPT IS EQUAL TO 'I'                               01738000
017390         GO TO VSA-7101-CUSTRELCDI.                               01739000
017400 VSA-7101-CUSTRELCDE.                                             01740000
017410     IF MIM-7104RLSP (WS-SUB1) IS EQUAL TO                        01741000
017420         WS-SEC-RELNBR (WS-SUBSEC)                                01742000
017430         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01743000
017440         GO TO VSA-NEXT.                                          01744000
017450     ADD +1 TO WS-SUB1.                                           01745000
017460     IF WS-SUB1 IS GREATER THAN 50                                01746000
017470         GO TO VSA-ACCTINTERFACE.                                 01747000
017480     GO TO VSA-7101-CUSTRELCDE.                                   01748000
017490 VSA-7101-CUSTRELCDI.                                             01749000
017500     IF MIM-7104RLSP (WS-SUB1) IS EQUAL TO                        01750000
017510         WS-SEC-RELNBR (WS-SUBSEC)                                01751000
017520         GO TO VSA-ACCTINTERFACE.                                 01752000
017530     ADD +1 TO WS-SUB1.                                           01753000
017540     IF WS-SUB1 IS GREATER THAN 50                                01754000
017550         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01755000
017560         GO TO VSA-NEXT.                                          01756000
017570     GO TO VSA-7101-CUSTRELCDI.                                   01757000
017580 VSA-ACCTINTERFACE.                                               01758000
017590     IF WS-SEC-RPOPT (WS-SUBSEC) IS EQUAL TO 'P'                  01759000
017600         MOVE ZEROS TO WS-SEC-BRANCH (WS-SUBSEC)                  01760000
017610         MOVE ZEROS TO WS-SEC-TYPE (WS-SUBSEC)                    01761000
017620         GO TO VSA-7102.                                          01762000
017630     IF WS-SEC-APPL (WS-SUBSEC) IS EQUAL TO ZEROS                 01763000
017640         MOVE WS-INTRFACE (100) TO SR-060CALLNAME                 01764000
017650     ELSE                                                         01765000
017660         MOVE WS-SEC-APPL (WS-SUBSEC) TO WS-WORK-APPL             01766000
017670         MOVE WS-INTRFACE (WS-WORK-APPL) TO SR-060CALLNAME.       01767000
P0156 *    IF WS-SEC-INST (WS-SUBSEC) IS NOT EQUAL TO RPBNK-INST        01768000
P0156 *        AND WS-SEC-APPL (WS-SUBSEC) IS NOT EQUAL TO ZEROS        01768690
P0156 *        PERFORM FIND-CROSS-INST-INTERFACE.                       01769380
017710     IF SR-060CALLNAME IS EQUAL TO SPACES                         01771000
017720         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01772000
017730         GO TO VSA-NEXT.                                          01773000
017740     MOVE WS-SEC-INST (WS-SUBSEC) TO RPINF00-INST.                01774000
P0022      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     01774200
P0022          AND WS-2024-EXISTS (RPINF00-INST) IS EQUAL TO 'Y'        01774400
P0022          MOVE WS-STBL-SUB (RPINF00-INST) TO WS-SSUB               01774600
P0022          MOVE WS-SEARCH-OPT (WS-SSUB) TO RPINF00-FILEOPTS.        01774800
017750     MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPINF00-ACCOUNT.             01775000
017760     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPINF00-PRODCODE.          01776000
017770     MOVE WS-SEC-APPL (WS-SUBSEC) TO RPINF00-APPLR.               01777000
017780     MOVE MIM-7101CLOSEDACCTOPT TO RPINF00-CLOSEDACCTOPT.         01778000
017790     MOVE 'R' TO RPINF00-FUNC.                                    01779000
017800     EXEC CICS LINK                                               01780000
017810         PROGRAM(SR-060CALLNAME)                                  01781000
017820         COMMAREA(WS-LINKAPPL)                                    01782000
017830         LENGTH(LENGTH OF WS-LINKAPPL)                            01783000
017840         NOHANDLE                                                 01784000
017850         END-EXEC.                                                01785000
P0022      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     01785300
P0022          MOVE WS-FILEOPTS TO RPINF00-FILEOPTS.                    01785600
017860     IF RPINF00-FUNCTION IS NOT EQUAL TO SPACE                    01786000
017870         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01787000
017880         GO TO VSA-NEXT.                                          01788000
017890     MOVE RPINF00-BRANCH TO WS-SEC-BRANCH (WS-SUBSEC).            01789000
017900     MOVE RPINF00-ACCT-TYPE TO WS-SEC-TYPE (WS-SUBSEC).           01790000
017910 VSA-7102.                                                        01791000
017920     MOVE WS-MODEL TO WS-RPMIM7102MODEL.                          01792000
017930     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO WS-RPMIM7102PRODCODE.      01793000
017940     IF WS-SEC-RPOPT (WS-SUBSEC) IS EQUAL TO 'P'                  01794000
017950         GO TO VSA-7102-TYPEZERO.                                 01795000
017960     MOVE WS-SEC-TYPE (WS-SUBSEC) TO WS-RPMIM7102TYPE.            01796000
017970     PERFORM SEARCH-RPS-7102.                                     01797000
017980     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01798000
017990         MOVE 'B' TO WS-SEC-7102 (WS-SUBSEC)                      01799000
018000         GO TO VSA-7102-TEST.                                     01800000
018010 VSA-7102-TYPEZERO.                                               01801000
018020     MOVE ZEROS TO WS-RPMIM7102TYPE.                              01802000
018030     PERFORM SEARCH-RPS-7102.                                     01803000
018040     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01804000
018050         MOVE 'P' TO WS-SEC-7102 (WS-SUBSEC)                      01805000
018060         GO TO VSA-7102-TEST.                                     01806000
018070 VSA-7102-MODELONLY.                                              01807000
018080     MOVE SPACES TO WS-RPMIM7102PRODCODE.                         01808000
018090     MOVE ZEROS TO WS-RPMIM7102TYPE.                              01809000
018100     PERFORM SEARCH-RPS-7102.                                     01810000
018110     IF WS-RPMIM7102FOUND IS EQUAL TO 'N'                         01811000
018120         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01812000
018130         GO TO VSA-NEXT.                                          01813000
018140     MOVE 'M' TO WS-SEC-7102 (WS-SUBSEC).                         01814000
018150 VSA-7102-TEST.                                                   01815000
018160     IF WS-ACT-FOUND IS EQUAL TO 'N'                              01816000
018170         GO TO VSA-7102-USERROUTINE.                              01817000
018180     IF RPACT-RATE-INC-OPTION IS EQUAL TO 'Y'                     01818000
018190         AND MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                01819000
018200         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01820000
018210         GO TO VSA-NEXT.                                          01821000
018220     IF MIM-7100DUPINCOPT IS EQUAL TO 'Y'                         01822000
018230         GO TO VSA-7102-USERROUTINE.                              01823000
018240     IF RPACT-SC-INC-OPTION IS EQUAL TO 'Y'                       01824000
018250         AND MIM-7102SECSCINCOPT IS EQUAL TO 'Y'                  01825000
018260         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01826000
018270         GO TO VSA-NEXT.                                          01827000
018280 VSA-7102-USERROUTINE.                                            01828000
018290     MOVE MIM-7102SECSCINCOPT TO WS-SEC-SCINCOPT (WS-SUBSEC).     01829000
018300     MOVE MIM-7102SECRATEINCOPT TO WS-SEC-RATEINCOPT (WS-SUBSEC). 01830000
018310     MOVE MIM-7102TIMEPROCOPT TO WS-SEC-TIMEPROCOPT (WS-SUBSEC).  01831000
018320     MOVE MIM-7102PRODUCTGROUP TO WS-SEC-PROD-GROUP (WS-SUBSEC).  01832000
018330     IF (MIM-7102USERRTN-Q IS NOT EQUAL TO 'B'                    01833000
018340         AND MIM-7102USERRTN-Q IS NOT EQUAL TO 'E')               01834000
018350         OR MIM-7102USERRTN IS NOT EQUAL TO 'Y'                   01835000
018360         GO TO VSA-7102-BRANCH.                                   01836000
018370     IF WS-SEC-RPOPT (WS-SUBSEC) IS EQUAL TO 'P'                  01837000
018380         MOVE WS-SEC-INST (WS-SUBSEC) TO RPUSER-INST              01838000
018390         MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPUSER-ACCOUNT           01839000
018400         MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPUSER-PRODCODE        01840000
018410         MOVE WS-SEC-APPL (WS-SUBSEC) TO RPUSER-APPLR             01841000
018420         INITIALIZE RPUSER-GRP-DATA                               01842000
018430     ELSE                                                         01843000
018440         MOVE RPINF00-INST TO RPUSER-INST                         01844000
018450         MOVE RPINF00-ACCOUNT TO RPUSER-ACCOUNT                   01845000
018460         MOVE RPINF00-PRODCODE TO RPUSER-PRODCODE                 01846000
018470         MOVE RPINF00-APPLR TO RPUSER-APPLR                       01847000
018480         MOVE RPINF00-USER-INFO TO RPUSER-USER-INFO               01848000
018490         MOVE RPINF00-MISC-INFO TO RPUSER-MISC-INFO               01849000
018500         MOVE RPINF00-BAL-INFO TO RPUSER-BAL-INFO                 01850000
018510     END-IF.                                                      01851000
018520     MOVE 'RPBUSER ' TO SR-060CALLNAME.                           01852000
018530     EXEC CICS LINK                                               01853000
018540         PROGRAM(SR-060CALLNAME)                                  01854000
018550         COMMAREA(WS-LINKUSER)                                    01855000
018560         LENGTH(LENGTH OF WS-LINKUSER)                            01856000
018570         NOHANDLE                                                 01857000
018580         END-EXEC.                                                01858000
018590     IF RPUSER-FUNCTION IS NOT EQUAL TO SPACES                    01859000
018600         OR RPUSER-PASSED IS EQUAL TO 'N'                         01860000
018610         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01861000
018620         GO TO VSA-NEXT.                                          01862000
018630 VSA-7102-BRANCH.                                                 01863000
018640     IF MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'B'                01864000
018650         AND MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'E'           01865000
018660         GO TO VSA-7102-MINTERM.                                  01866000
018670     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7107INST.               01867000
018680     MOVE WS-SEC-INST (WS-SUBSEC) TO WS-RPMIM7107INST2.           01868000
018690     MOVE WS-SEC-BRANCH (WS-SUBSEC) TO WS-RPMIM7107BRCHREGION.    01869000
018700     MOVE MIM-7102BRCHREGIONCD TO WS-RPMIM7107RPREC.              01870000
018710     PERFORM VALIDATE-BRANCH.                                     01871000
018720     IF WS-RPMIM7107ERROR IS NOT EQUAL TO SPACES                  01872000
018730         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01873000
018740         GO TO VSA-NEXT.                                          01874000
018750 VSA-7102-MINTERM.                                                01875000
018760     IF WS-SEC-RPOPT (WS-SUBSEC) IS EQUAL TO 'P'                  01876000
018770         GO TO VSA-SECONDARY-ACCT-VALID.                          01877000
018780     IF MIM-7102MINTERM-Q IS NOT EQUAL TO 'B'                     01878000
018790         AND MIM-7102MINTERM-Q IS NOT EQUAL TO 'E'                01879000
018800         GO TO VSA-7102-MAXTERM.                                  01880000
018810     IF RPINF00-TERM IS LESS THAN MIM-7102MINTERM                 01881000
018820         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01882000
018830         GO TO VSA-NEXT.                                          01883000
018840 VSA-7102-MAXTERM.                                                01884000
018850     IF MIM-7102MAXTERM-Q IS NOT EQUAL TO 'B'                     01885000
018860         AND MIM-7102MAXTERM-Q IS NOT EQUAL TO 'E'                01886000
018870         GO TO VSA-7102-USEROPT1.                                 01887000
018880     IF RPINF00-TERM IS GREATER THAN MIM-7102MAXTERM              01888000
018890         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01889000
018900         GO TO VSA-NEXT.                                          01890000
018910 VSA-7102-USEROPT1.                                               01891000
018920     IF MIM-7102USERTYPE1 IS EQUAL TO 'P'                         01892000
018930         GO TO VSA-7102-USEROPT2.                                 01893000
018940     IF MIM-7102USEROPT1-Q IS NOT EQUAL TO 'B'                    01894000
018950         AND MIM-7102USEROPT1-Q IS NOT EQUAL TO 'E'               01895000
018960         GO TO VSA-7102-USEROPT2.                                 01896000
018970     IF (MIM-7102USEROPTREL1 IS EQUAL TO 'EQ'                     01897000
018980         AND RPINF00-USEROPT1 IS NOT EQUAL TO MIM-7102USEROPT1)   01898000
018990         OR (MIM-7102USEROPTREL1 IS EQUAL TO 'NE'                 01899000
019000         AND RPINF00-USEROPT1 IS EQUAL TO MIM-7102USEROPT1)       01900000
019010         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01901000
019020         GO TO VSA-NEXT.                                          01902000
019030 VSA-7102-USEROPT2.                                               01903000
019040     IF MIM-7102USERTYPE2 IS EQUAL TO 'P'                         01904000
019050         GO TO VSA-7102-USEROPT3.                                 01905000
019060     IF MIM-7102USEROPT2-Q IS NOT EQUAL TO 'B'                    01906000
019070         AND MIM-7102USEROPT2-Q IS NOT EQUAL TO 'E'               01907000
019080         GO TO VSA-7102-USEROPT3.                                 01908000
019090     IF (MIM-7102USEROPTREL2 IS EQUAL TO 'EQ'                     01909000
019100         AND RPINF00-USEROPT2 IS NOT EQUAL TO MIM-7102USEROPT2)   01910000
019110         OR (MIM-7102USEROPTREL2 IS EQUAL TO 'NE'                 01911000
019120         AND RPINF00-USEROPT2 IS EQUAL TO MIM-7102USEROPT2)       01912000
019130         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01913000
019140         GO TO VSA-NEXT.                                          01914000
019150 VSA-7102-USEROPT3.                                               01915000
019160     IF MIM-7102USERTYPE3 IS EQUAL TO 'P'                         01916000
019170         GO TO VSA-7102-USEROPT4.                                 01917000
019180     IF MIM-7102USEROPT3-Q IS NOT EQUAL TO 'B'                    01918000
019190         AND MIM-7102USEROPT3-Q IS NOT EQUAL TO 'E'               01919000
019200         GO TO VSA-7102-USEROPT4.                                 01920000
019210     IF (MIM-7102USEROPTREL3 IS EQUAL TO 'EQ'                     01921000
019220         AND RPINF00-USEROPT3 IS NOT EQUAL TO MIM-7102USEROPT3)   01922000
019230         OR (MIM-7102USEROPTREL3 IS EQUAL TO 'NE'                 01923000
019240         AND RPINF00-USEROPT3 IS EQUAL TO MIM-7102USEROPT3)       01924000
019250         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01925000
019260         GO TO VSA-NEXT.                                          01926000
019270 VSA-7102-USEROPT4.                                               01927000
019280     IF MIM-7102USERTYPE4 IS EQUAL TO 'P'                         01928000
019290         GO TO VSA-RATE-BALANCE.                                  01929000
019300     IF MIM-7102USEROPT4-Q IS NOT EQUAL TO 'B'                    01930000
019310         AND MIM-7102USEROPT4-Q IS NOT EQUAL TO 'E'               01931000
019320         GO TO VSA-7102-BALCATCD1.                                01932000
019330     IF (MIM-7102USEROPTREL4 IS EQUAL TO 'EQ'                     01933000
019340         AND RPINF00-USEROPT4 IS NOT EQUAL TO MIM-7102USEROPT4)   01934000
019350         OR (MIM-7102USEROPTREL4 IS EQUAL TO 'NE'                 01935000
019360         AND RPINF00-USEROPT4 IS EQUAL TO MIM-7102USEROPT4)       01936000
019370         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01937000
019380         GO TO VSA-NEXT.                                          01938000
019390 VSA-RATE-BALANCE.                                                01939000
019400     MOVE ZEROS TO WS-REL-ACCTRATEBAL.                            01940000
019410     IF MIM-7102ACCTRATEBALCD IS EQUAL TO ZEROS                   01941000
019420         GO TO VSA-7102-BALCATCD1.                                01942000
019430     MOVE MIM-7102ACCTRATEBALCD TO WS-WORK-BALCD.                 01943000
019440     PERFORM GET-BALANCE.                                         01944000
019450     MOVE WS-WORK-BALANCE TO WS-REL-ACCTRATEBAL.                  01945000
019460 VSA-7102-BALCATCD1.                                              01946000
019470     IF MIM-7101ACCTRELCD-Q IS NOT EQUAL TO 'E'                   01947000
019480         GO TO VSA-7101-COMBCATCD.                                01948000
019490     IF MIM-7102BALCATCD1-Q IS NOT EQUAL TO 'E'                   01949000
019500         GO TO VSA-7102-BALCATCD2.                                01950000
019510     IF MIM-7102BALCATCD1 IS EQUAL TO SPACES                      01951000
019520         GO TO VSA-7102-BALCATCD2.                                01952000
019530     MOVE MIM-7102BALCATCD1 TO WS-RPMIM7106RPREC.                 01953000
019540     PERFORM SEARCH-RPS-7106.                                     01954000
019550     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01955000
019560         GO TO VSA-7102-BALCATCD2.                                01956000
019570     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01957000
019580     PERFORM GET-BALANCE.                                         01958000
019590     MOVE WS-WORK-BALANCE TO WS-SECCATBAL.                        01959000
019600     IF WS-SECCATBAL IS LESS THAN MIM-7106BALREQ-E                01960000
019610         GO TO VSA-7102-BALCATCD2.                                01961000
019620     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        01962000
019630         ADD +1 TO WS-ACCTRELCD-O.                                01963000
019640     GO TO VSA-7101-COMBCATCD.                                    01964000
019650 VSA-7102-BALCATCD2.                                              01965000
019660     IF MIM-7102BALCATCD2-Q IS NOT EQUAL TO 'E'                   01966000
019670         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01967000
019680             GO TO VSA-7101-COMBCATCD                             01968000
019690         ELSE                                                     01969000
019700             MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                  01970000
019710             GO TO VSA-NEXT.                                      01971000
019720     IF MIM-7102BALCATCD2 IS EQUAL TO SPACES                      01972000
019730         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01973000
019740             GO TO VSA-7101-COMBCATCD                             01974000
019750         ELSE                                                     01975000
019760             MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                  01976000
019770             GO TO VSA-NEXT.                                      01977000
019780     MOVE MIM-7102BALCATCD2 TO WS-RPMIM7106RPREC.                 01978000
019790     PERFORM SEARCH-RPS-7106.                                     01979000
019800     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01980000
019810         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01981000
019820             GO TO VSA-7101-COMBCATCD                             01982000
019830         ELSE                                                     01983000
019840             MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                  01984000
019850             GO TO VSA-NEXT.                                      01985000
019860     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01986000
019870     PERFORM GET-BALANCE.                                         01987000
019880     MOVE WS-WORK-BALANCE TO WS-SECCATBAL.                        01988000
019890     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'A'                        01989000
019900         AND WS-SECCATBAL IS LESS THAN MIM-7106BALREQ-E           01990000
019910         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01991000
019920         GO TO VSA-EXIT.                                          01992000
019930     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        01993000
019940         AND WS-SECCATBAL IS NOT LESS THAN MIM-7106BALREQ-E       01994000
019950         ADD +1 TO WS-ACCTRELCD-O.                                01995000
019960 VSA-7101-COMBCATCD.                                              01996000
019970     IF MIM-7101COMBCATCD1-Q IS NOT EQUAL TO 'E'                  01997000
019980         GO TO VSA-7101-COMBCATCD2.                               01998000
019990     IF MIM-7101COMBCATCD1 IS EQUAL TO SPACES                     01999000
020000         GO TO VSA-7101-COMBCATCD2.                               02000000
020010     IF MIM-7102COMBBALCD1-Q IS EQUAL TO 'E'                      02001000
020020         MOVE MIM-7102COMBBALCD1 TO WS-WORK-COMBBALCD             02002000
020030         GO TO VSA-7101-COMBCATCD1-CONT.                          02003000
020040     MOVE MIM-7101COMBCATCD1 TO WS-RPMIM7106RPREC.                02004000
020050     PERFORM SEARCH-RPS-7106.                                     02005000
020060     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02006000
020070         GO TO VSA-7101-COMBCATCD2.                               02007000
020080     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02008000
020090 VSA-7101-COMBCATCD1-CONT.                                        02009000
020100     PERFORM GET-BALANCE.                                         02010000
020110     MOVE WS-WORK-BALANCE TO WS-SEC-BAL1 (WS-SUBSEC).             02011000
020120 VSA-7101-COMBCATCD2.                                             02012000
020130     IF MIM-7101COMBCATCD2-Q IS NOT EQUAL TO 'E'                  02013000
020140         GO TO VSA-7101-COMBCATCD3.                               02014000
020150     IF MIM-7101COMBCATCD2 IS EQUAL TO SPACES                     02015000
020160         GO TO VSA-7101-COMBCATCD3.                               02016000
020170     IF MIM-7102COMBBALCD2-Q IS EQUAL TO 'E'                      02017000
020180         MOVE MIM-7102COMBBALCD2 TO WS-WORK-COMBBALCD             02018000
020190         GO TO VSA-7101-COMBCATCD2-CONT.                          02019000
020200     MOVE MIM-7101COMBCATCD2 TO WS-RPMIM7106RPREC.                02020000
020210     PERFORM SEARCH-RPS-7106.                                     02021000
020220     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02022000
020230         GO TO VSA-7101-COMBCATCD3.                               02023000
020240     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02024000
020250 VSA-7101-COMBCATCD2-CONT.                                        02025000
020260     PERFORM GET-BALANCE.                                         02026000
020270     MOVE WS-WORK-BALANCE TO WS-SEC-BAL2 (WS-SUBSEC).             02027000
020280 VSA-7101-COMBCATCD3.                                             02028000
020290     IF MIM-7101COMBCATCD3-Q IS NOT EQUAL TO 'E'                  02029000
020300         GO TO VSA-7101-COMBCATCD4.                               02030000
020310     IF MIM-7101COMBCATCD3 IS EQUAL TO SPACES                     02031000
020320         GO TO VSA-7101-COMBCATCD4.                               02032000
020330     IF MIM-7102COMBBALCD3-Q IS EQUAL TO 'E'                      02033000
020340         MOVE MIM-7102COMBBALCD3 TO WS-WORK-COMBBALCD             02034000
020350         GO TO VSA-7101-COMBCATCD3-CONT.                          02035000
020360     MOVE MIM-7101COMBCATCD3 TO WS-RPMIM7106RPREC.                02036000
020370     PERFORM SEARCH-RPS-7106.                                     02037000
020380     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02038000
020390         GO TO VSA-7101-COMBCATCD4.                               02039000
020400     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02040000
020410 VSA-7101-COMBCATCD3-CONT.                                        02041000
020420     PERFORM GET-BALANCE.                                         02042000
020430     MOVE WS-WORK-BALANCE TO WS-SEC-BAL3 (WS-SUBSEC).             02043000
020440 VSA-7101-COMBCATCD4.                                             02044000
020450     MOVE ZEROS TO WS-SECCATBAL.                                  02045000
020460     IF MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'                  02046000
020470         GO TO VSA-SECONDARY-ACCT-VALID.                          02047000
020480     IF MIM-7101COMBCATCD4 IS EQUAL TO SPACES                     02048000
020490         GO TO VSA-SECONDARY-ACCT-VALID.                          02049000
020500     IF MIM-7102COMBBALCD4-Q IS EQUAL TO 'E'                      02050000
020510         MOVE MIM-7102COMBBALCD4 TO WS-WORK-COMBBALCD             02051000
020520         GO TO VSA-7101-COMBCATCD4-CONT.                          02052000
020530     MOVE MIM-7101COMBCATCD4 TO WS-RPMIM7106RPREC.                02053000
020540     PERFORM SEARCH-RPS-7106.                                     02054000
020550     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02055000
020560         GO TO VSA-SECONDARY-ACCT-VALID.                          02056000
020570     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02057000
020580 VSA-7101-COMBCATCD4-CONT.                                        02058000
020590     PERFORM GET-BALANCE.                                         02059000
020600     MOVE WS-WORK-BALANCE TO WS-SEC-BAL4 (WS-SUBSEC).             02060000
020610 VSA-SECONDARY-ACCT-VALID.                                        02061000
020620     MOVE 'Y' TO WS-SEC-QUAL (WS-SUBSEC).                         02062000
020630     GO TO VSA-NEXT.                                              02063000
020640 VSA-EXIT.                                                        02064000
020650     EXIT.                                                        02065000
020660******************************************************************02066000
020670 READ-MICM-7100 SECTION.                                          02067000
020680 RM7100-START.                                                    02068000
020690     MOVE SPACES TO WS-FUNCTION.                                  02069000
020700     MOVE SPACES TO MI7100-RECORD.                                02070000
020710     MOVE RPXXX30-PRIMARY-INST TO MIM-7100KINST.                  02071000
020720 RM7100-LOOP.                                                     02072000
020730     MOVE +7100 TO MIM-7100KREC.                                  02073000
020740     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    02074000
020750     MOVE MI7100-RECORD TO MIMST-RECORD.                          02075000
020760     PERFORM MIC-MST-GET-REQUEST.                                 02076000
020770     MOVE MIMST-RECORD TO MI7100-RECORD.                          02077000
020780     IF WS-FUNCTION IS EQUAL TO 'N'                               02078000
020790         AND MIM-7100KINST IS GREATER THAN ZEROS                  02079000
020800         GO TO RM7100-ZERO.                                       02080000
020810     GO TO RM7100-EXIT.                                           02081000
020820 RM7100-ZERO.                                                     02082000
020830     MOVE SPACES TO MI7100-RECORD.                                02083000
020840     MOVE ZEROS TO MIM-7100KINST.                                 02084000
020850     GO TO RM7100-LOOP.                                           02085000
020860 RM7100-EXIT.                                                     02086000
020870     EXIT.                                                        02087000
020880******************************************************************02088000
020890 VALIDATE-MODEL-REQUIREMENTS SECTION.                             02089000
020900 VMR-START.                                                       02090000
020910     MOVE 'Y' TO WS-MODEL-REQS.                                   02091000
020920     SET INDX-7102 TO +1.                                         02092000
020930 VMR-FIND-7102S.                                                  02093000
020940     IF INDX-7102 IS GREATER THAN WS-RPMIM7102MAXSIZE             02094000
020950         GO TO VMR-EXIT.                                          02095000
020960     IF WS-7102-MODEL (INDX-7102) IS GREATER THAN WS-MODEL        02096000
020970         GO TO VMR-EXIT.                                          02097000
020980     IF WS-7102-MODEL (INDX-7102) IS EQUAL TO WS-MODEL            02098000
020990         GO TO VMR-TEST-7102S.                                    02099000
021000     SET INDX-7102 UP BY +1.                                      02100000
021010     GO TO VMR-FIND-7102S.                                        02101000
021020 VMR-TEST-7102S.                                                  02102000
021030     IF WS-7102-PRODCODE (INDX-7102) IS EQUAL TO SPACES           02103000
021040         AND WS-7102-TYPE (INDX-7102) IS EQUAL TO ZEROS           02104000
021050         GO TO VMR-CONTINUE.                                      02105000
021060     MOVE WS-7102-MODEL (INDX-7102) TO MIM-7102KMODEL.            02106000
021070     MOVE WS-7102-PRODCODE (INDX-7102) TO MIM-7102KPRODCODE.      02107000
021080     MOVE WS-7102-TYPE (INDX-7102) TO MIM-7102KACCTTYPE.          02108000
021090     MOVE WS-RPMIM7102 (INDX-7102) TO MIM-REC7102.                02109000
021100     IF MIM-7102MINACCTS-Q IS NOT EQUAL TO 'B'                    02110000
021110         AND MIM-7102MINACCTS-Q IS NOT EQUAL TO 'E'               02111000
021120         AND MIM-7102MAXSECACCTS-Q IS NOT EQUAL TO 'B'            02112000
021130         AND MIM-7102MAXSECACCTS-Q IS NOT EQUAL TO 'E'            02113000
021140         GO TO VMR-CONTINUE.                                      02114000
021150     IF MIM-7102MINACCTS-Q IS NOT EQUAL TO 'B'                    02115000
021160         AND MIM-7102MINACCTS-Q IS NOT EQUAL TO 'E'               02116000
021170         MOVE ZEROS TO WS-MINACCTS                                02117000
021180     ELSE                                                         02118000
021190         MOVE MIM-7102MINACCTS TO WS-MINACCTS.                    02119000
021200     IF MIM-7102MAXSECACCTS-Q IS NOT EQUAL TO 'B'                 02120000
021210         AND MIM-7102MAXSECACCTS-Q IS NOT EQUAL TO 'E'            02121000
021220         MOVE 999 TO WS-MAXSECACCTS                               02122000
021230     ELSE                                                         02123000
021240         MOVE MIM-7102MAXSECACCTS TO WS-MAXSECACCTS.              02124000
021250     IF MIM-7102KACCTTYPE IS EQUAL TO ZEROS                       02125000
021260         PERFORM VALIDATE-MINMAX-PRODCD                           02126000
021270     ELSE                                                         02127000
021280         PERFORM VALIDATE-MINMAX-TYPEPROD.                        02128000
021290 VMR-CONTINUE.                                                    02129000
021300     IF WS-MODEL-REQS IS EQUAL TO 'N'                             02130000
021310         GO TO VMR-EXIT.                                          02131000
021320     SET INDX-7102 UP BY +1.                                      02132000
021330     GO TO VMR-FIND-7102S.                                        02133000
021340 VMR-EXIT.                                                        02134000
021350     EXIT.                                                        02135000
021360******************************************************************02136000
021370 VALIDATE-MINMAX-PRODCD SECTION.                                  02137000
021380 VMP-START.                                                       02138000
021390     MOVE ZEROS TO WS-SUBSEC.                                     02139000
021400 VMP-NEXT.                                                        02140000
021410     ADD +1 TO WS-SUBSEC.                                         02141000
021420     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02142000
021430         GO TO VMP-TEST.                                          02143000
021440     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02144000
021450         GO TO VMP-TEST.                                          02145000
021460     IF WS-SEC-PRODCD (WS-SUBSEC) IS NOT EQUAL TO                 02146000
021470         MIM-7102KPRODCODE                                        02147000
021480         GO TO VMP-NEXT.                                          02148000
021490     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   02149000
P0045          OR WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X'               02149500
021500         GO TO VMP-NEXT.                                          02150000
021510** MOVE AN 'M' SEC-QUAL FOR ACCOUNT THAT SATISFY THE MINIMUM      02151000
021520** REQUIREMENT SO THOSE ACCOUNTS CAN BE COUNTED FIRST WHEN        02152000
021530** TESTING MINIMUM AND MAXIMUM 7101 ACOUNTS                       02153000
021540     IF WS-MAXSECACCTS IS EQUAL TO ZEROS                          02154000
021550         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02155000
021560         MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC)                    02156000
021570         MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC)                    02157000
021580         GO TO VMP-NEXT                                           02158000
021590     ELSE                                                         02159000
021600         SUBTRACT +1 FROM WS-MAXSECACCTS.                         02160000
021610     IF WS-MINACCTS IS GREATER THAN ZEROS                         02161000
021620         MOVE 'M' TO WS-SEC-QUAL (WS-SUBSEC)                      02162000
021630         SUBTRACT +1 FROM WS-MINACCTS.                            02163000
021640     GO TO VMP-NEXT.                                              02164000
021650 VMP-TEST.                                                        02165000
021660     IF WS-MINACCTS IS GREATER THAN ZEROS                         02166000
021670         AND WS-PRIM-PRODCD IS EQUAL TO MIM-7102KPRODCODE         02167000
021680         SUBTRACT +1 FROM WS-MINACCTS.                            02168000
021690     IF WS-MINACCTS IS GREATER THAN ZEROS                         02169000
021700         MOVE 'N' TO WS-MODEL-REQS.                               02170000
021710 VMP-EXIT.                                                        02171000
021720     EXIT.                                                        02172000
021730******************************************************************02173000
021740 VALIDATE-MINMAX-TYPEPROD SECTION.                                02174000
021750 VMT-START.                                                       02175000
021760     MOVE ZEROS TO WS-SUBSEC.                                     02176000
021770 VMT-NEXT.                                                        02177000
021780     ADD +1 TO WS-SUBSEC.                                         02178000
021790     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02179000
021800         GO TO VMT-TEST.                                          02180000
021810     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02181000
021820         GO TO VMT-TEST.                                          02182000
021830     IF WS-SEC-PRODCD (WS-SUBSEC) IS NOT EQUAL TO                 02183000
021840             MIM-7102KPRODCODE                                    02184000
021850         OR WS-SEC-TYPE (WS-SUBSEC) IS NOT EQUAL TO               02185000
021860             MIM-7102KACCTTYPE                                    02186000
021870         GO TO VMT-NEXT.                                          02187000
021880     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   02188000
P0045          OR WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X'               02188500
021890         GO TO VMT-NEXT.                                          02189000
021900** MOVE AN 'M' SEC-QUAL FOR ACCOUNT THAT SATISFY THE MINIMUM      02190000
021910** REQUIREMENT SO THOSE ACCOUNTS CAN BE COUNTED FIRST WHEN        02191000
021920** TESTING MINIMUM AND MAXIMUM 7101 ACOUNTS                       02192000
021930     IF WS-MAXSECACCTS IS EQUAL TO ZEROS                          02193000
021940         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02194000
021950         MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC)                    02195000
021960         MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC)                    02196000
021970         GO TO VMT-NEXT                                           02197000
021980     ELSE                                                         02198000
021990         SUBTRACT +1 FROM WS-MAXSECACCTS.                         02199000
022000     IF WS-MINACCTS IS GREATER THAN ZEROS                         02200000
022010         MOVE 'M' TO WS-SEC-QUAL (WS-SUBSEC)                      02201000
022020         SUBTRACT +1 FROM WS-MINACCTS.                            02202000
022030     GO TO VMT-NEXT.                                              02203000
022040 VMT-TEST.                                                        02204000
022050     IF WS-MINACCTS IS GREATER THAN ZEROS                         02205000
022060         AND WS-PRIM-PRODCD IS EQUAL TO MIM-7102KPRODCODE         02206000
022070         AND WS-PRIM-TYPE IS EQUAL TO MIM-7102KACCTTYPE           02207000
022080         SUBTRACT +1 FROM WS-MINACCTS.                            02208000
022090     IF WS-MINACCTS IS GREATER THAN ZEROS                         02209000
022100         MOVE 'N' TO WS-MODEL-REQS.                               02210000
022110 VMT-EXIT.                                                        02211000
022120     EXIT.                                                        02212000
022130******************************************************************02213000
022140 VALIDATE-PRODUCTS-REQUIREMENTS SECTION.                          02214000
022150 VPR-START.                                                       02215000
022160     MOVE 'Y' TO WS-MIN-MAX-PROD-REQS.                            02216000
022170     IF (MIM-7101MINPRODS-Q IS EQUAL TO 'N'                       02217000
022180         OR MIM-7101MINPRODS-Q IS EQUAL TO 'V')                   02218000
022190         AND (MIM-7101MAXPRODS-Q IS EQUAL TO 'N'                  02219000
022200         OR MIM-7101MAXPRODS-Q IS EQUAL TO 'V')                   02220000
022210         GO TO VPR-EXIT.                                          02221000
022220     MOVE SPACES TO WS-PRODCODE-TABLE.                            02222000
022230     IF MIM-7101MINPRODS-Q IS EQUAL TO 'N'                        02223000
022240         OR MIM-7101MINPRODS-Q IS EQUAL TO 'V'                    02224000
022250         MOVE ZEROS TO WS-MINPRODS                                02225000
022260     ELSE                                                         02226000
022270         MOVE MIM-7101MINPRODS TO WS-MINPRODS.                    02227000
022280     IF MIM-7101MAXPRODS-Q IS EQUAL TO 'N'                        02228000
022290         OR MIM-7101MAXPRODS-Q IS EQUAL TO 'V'                    02229000
022300         MOVE 999 TO WS-MAXPRODS                                  02230000
022310     ELSE                                                         02231000
022320         MOVE MIM-7101MAXPRODS TO WS-MAXPRODS.                    02232000
022330     MOVE WS-PRIM-PRODCD TO WS-PRODCODE-SEARCH.                   02233000
022340     PERFORM SEARCH-PRODUCT-CODES.                                02234000
022350     IF WS-MINPRODS IS GREATER THAN ZEROS                         02235000
022360         SUBTRACT +1 FROM WS-MINPRODS.                            02236000
022370     IF WS-MAXPRODS IS GREATER THAN ZEROS                         02237000
022380         SUBTRACT +1 FROM WS-MAXPRODS.                            02238000
022390     MOVE ZEROS TO WS-SUBSEC.                                     02239000
022400 VPR-NEXT.                                                        02240000
022410     ADD +1 TO WS-SUBSEC.                                         02241000
022420     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02242000
022430         GO TO VPR-TEST.                                          02243000
022440     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02244000
022450         GO TO VPR-TEST.                                          02245000
022460     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   02246000
P0045          OR WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X'               02246500
022470         GO TO VPR-NEXT.                                          02247000
022480     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO WS-PRODCODE-SEARCH.        02248000
022490     PERFORM SEARCH-PRODUCT-CODES.                                02249000
022500     IF WS-FOUND-PRODCODE IS EQUAL TO 'Y'                         02250000
022510         GO TO VPR-NEXT.                                          02251000
022520     IF WS-MAXPRODS IS EQUAL TO ZEROS                             02252000
022530         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02253000
022540         MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC)                    02254000
022550         MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC)                    02255000
022560         GO TO VPR-NEXT                                           02256000
022570     ELSE                                                         02257000
022580         SUBTRACT +1 FROM WS-MAXPRODS.                            02258000
022590     IF WS-MINPRODS IS GREATER THAN ZEROS                         02259000
022600         SUBTRACT +1 FROM WS-MINPRODS.                            02260000
022610     GO TO VPR-NEXT.                                              02261000
022620 VPR-TEST.                                                        02262000
022630     IF WS-MINPRODS IS GREATER THAN ZEROS                         02263000
022640         MOVE 'N' TO WS-MIN-MAX-PROD-REQS.                        02264000
022650 VPR-EXIT.                                                        02265000
022660     EXIT.                                                        02266000
022670******************************************************************02267000
022680 VALIDATE-ACCOUNTS-REQUIREMENTS SECTION.                          02268000
022690 VAR-START.                                                       02269000
022700     MOVE 'Y' TO WS-MIN-MAX-ACCT-REQS.                            02270000
022710     IF (MIM-7101MINACCTS-Q IS EQUAL TO 'N'                       02271000
022720         OR MIM-7101MINACCTS-Q IS EQUAL TO 'V')                   02272000
022730         AND (MIM-7101MAXACCTS-Q IS EQUAL TO 'N'                  02273000
022740         OR MIM-7101MAXACCTS-Q IS EQUAL TO 'V')                   02274000
022750         GO TO VAR-EXIT.                                          02275000
022760     IF MIM-7101MINACCTS-Q IS EQUAL TO 'N'                        02276000
022770         OR MIM-7101MINACCTS-Q IS EQUAL TO 'V'                    02277000
022780         MOVE ZEROS TO WS-MINACCTS-2                              02278000
022790     ELSE                                                         02279000
022800         MOVE MIM-7101MINACCTS TO WS-MINACCTS-2.                  02280000
022810     IF MIM-7101MAXACCTS-Q IS EQUAL TO 'N'                        02281000
022820         OR MIM-7101MAXACCTS-Q IS EQUAL TO 'V'                    02282000
022830         MOVE 999 TO WS-MAXACCTS-2                                02283000
022840     ELSE                                                         02284000
022850         MOVE MIM-7101MAXACCTS TO WS-MAXACCTS-2.                  02285000
022860***  SUBTRACT 1 FROM COUNTS TO ACCOUNT FOR PRIMARY ACCOUNT        02286000
022870     IF WS-MINACCTS-2 IS GREATER THAN ZEROS                       02287000
022880         SUBTRACT +1 FROM WS-MINACCTS-2.                          02288000
022890     IF WS-MAXACCTS-2 IS GREATER THAN ZEROS                       02289000
022900         SUBTRACT +1 FROM WS-MAXACCTS-2.                          02290000
022910     MOVE ZEROS TO WS-SUBSEC.                                     02291000
022920 VAR-FIRST.                                                       02292000
022930     ADD +1 TO WS-SUBSEC.                                         02293000
022940     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02294000
022950         GO TO VAR-SECOND.                                        02295000
022960     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02296000
022970         GO TO VAR-SECOND.                                        02297000
022980     IF WS-SEC-QUAL (WS-SUBSEC) IS NOT EQUAL TO 'M'               02298000
022990         GO TO VAR-FIRST.                                         02299000
023000     IF WS-MINACCTS-2 IS GREATER THAN ZEROS                       02300000
023010         SUBTRACT +1 FROM WS-MINACCTS-2.                          02301000
023020     IF WS-MAXACCTS-2 IS EQUAL TO ZEROS                           02302000
023030         MOVE 'N' TO WS-MIN-MAX-ACCT-REQS                         02303000
023040         GO TO VAR-EXIT                                           02304000
023050     ELSE                                                         02305000
023060         SUBTRACT +1 FROM WS-MAXACCTS-2.                          02306000
023070     GO TO VAR-FIRST.                                             02307000
023080 VAR-SECOND.                                                      02308000
023090     MOVE ZEROS TO WS-SUBSEC.                                     02309000
023100 VAR-NEXT.                                                        02310000
023110     ADD +1 TO WS-SUBSEC.                                         02311000
023120     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02312000
023130         GO TO VAR-TEST.                                          02313000
023140     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02314000
023150         GO TO VAR-TEST.                                          02315000
023160     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   02316000
P0045          OR WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X'               02316500
023170         GO TO VAR-NEXT.                                          02317000
023180     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'M'                   02318000
023190         MOVE 'Y' TO WS-SEC-QUAL (WS-SUBSEC)                      02319000
023200         GO TO VAR-NEXT.                                          02320000
023210     IF WS-MAXACCTS-2 IS EQUAL TO ZEROS                           02321000
023220         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02322000
023230         MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC)                    02323000
023240         MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC)                    02324000
023250         GO TO VAR-NEXT                                           02325000
023260     ELSE                                                         02326000
023270         SUBTRACT +1 FROM WS-MAXACCTS-2.                          02327000
023280     IF WS-MINACCTS-2 IS GREATER THAN ZEROS                       02328000
023290         SUBTRACT +1 FROM WS-MINACCTS-2.                          02329000
023300     GO TO VAR-NEXT.                                              02330000
023310 VAR-TEST.                                                        02331000
023320     IF WS-MINACCTS-2 IS GREATER THAN ZEROS                       02332000
023330         MOVE 'N' TO WS-MIN-MAX-ACCT-REQS.                        02333000
023340 VAR-EXIT.                                                        02334000
023350     EXIT.                                                        02335000
023360******************************************************************02336000
023370 VALIDATE-PRODUCT-GROUPS SECTION.                                 02337000
023380 VPG-START.                                                       02338000
023390     MOVE 'Y' TO WS-PROD-GROUPS-REQS.                             02339000
023400     IF (MIM-7101PG1-Q IS EQUAL TO 'N'                            02340000
023410         OR MIM-7101PG1-Q IS EQUAL TO 'V')                        02341000
023420         AND (MIM-7101PG2-Q IS EQUAL TO 'N'                       02342000
023430         OR MIM-7101PG2-Q IS EQUAL TO 'V')                        02343000
023440         AND (MIM-7101PG3-Q IS EQUAL TO 'N'                       02344000
023450         OR MIM-7101PG3-Q IS EQUAL TO 'V')                        02345000
023460         AND (MIM-7101PG4-Q IS EQUAL TO 'N'                       02346000
023470         OR MIM-7101PG4-Q IS EQUAL TO 'V')                        02347000
023480         AND (MIM-7101PG5-Q IS EQUAL TO 'N'                       02348000
023490         OR MIM-7101PG5-Q IS EQUAL TO 'V')                        02349000
023500         GO TO VPG-EXIT.                                          02350000
023510     MOVE ZEROS TO WS-SUBPROD.                                    02351000
023520     MOVE +1 TO WS-MINACCTS-PG.                                   02352000
023530     MOVE ZEROS TO WS-SUBSEC.                                     02353000
023540 VPG-ADD-NON-PG-ACCTS.                                            02354000
023550     ADD +1 TO WS-SUBSEC.                                         02355000
023560     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02356000
023570         GO TO VPG-NEXT-GROUP.                                    02357000
023580     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   02358000
023590         OR WS-SEC-PROD-GROUP (WS-SUBSEC) IS NOT EQUAL TO ZEROS   02359000
023600         GO TO VPG-ADD-NON-PG-ACCTS.                              02360000
023610     ADD +1 TO WS-MINACCTS-PG.                                    02361000
023620     IF WS-SUBSEC IS NOT GREATER THAN WS-SECONDARY-MAX            02362000
023630         GO TO VPG-ADD-NON-PG-ACCTS.                              02363000
023640 VPG-NEXT-GROUP.                                                  02364000
023650     ADD +1 TO WS-SUBPROD.                                        02365000
023660     IF WS-SUBPROD IS GREATER THAN +5                             02366000
023670         GO TO VPG-MINACCT-MODEL-REQ.                             02367000
023680     IF MIM-7101PG-Q (WS-SUBPROD) IS EQUAL TO 'N'                 02368000
023690         OR MIM-7101PG-Q (WS-SUBPROD) IS EQUAL TO 'V'             02369000
023700         GO TO VPG-NEXT-GROUP.                                    02370000
023710     INITIALIZE WS-PGSEARCH-TABLE.                                02371000
023720     MOVE MIM-7101PGMIN (WS-SUBPROD) TO WS-MINPROD-GRP.           02372000
023730     MOVE MIM-7101PGMAX (WS-SUBPROD) TO WS-MAXPROD-GRP.           02373000
023740     IF WS-MAXPROD-GRP IS EQUAL TO ZEROS                          02374000
023750         MOVE +999 TO WS-MAXPROD-GRP.                             02375000
023760     IF WS-PRIM-PROD-GROUP IS EQUAL TO WS-SUBPROD                 02376000
023770         AND WS-PRIM-7102 IS EQUAL TO 'B'                         02377000
023780         MOVE WS-PRIM-PRODCD TO WS-PG-PRODCD (1)                  02378000
023790         MOVE WS-PRIM-TYPE TO WS-PG-TYPE (1)                      02379000
023800         MOVE WS-PRIM-7102 TO WS-PG-7102 (1).                     02380000
023810     IF WS-PRIM-PROD-GROUP IS EQUAL TO WS-SUBPROD                 02381000
023820         AND WS-PRIM-7102 IS EQUAL TO 'P'                         02382000
023830         MOVE WS-PRIM-PRODCD TO WS-PG-PRODCD (1)                  02383000
023840         MOVE ZEROS TO WS-PG-TYPE (1)                             02384000
023850         MOVE WS-PRIM-7102 TO WS-PG-7102 (1).                     02385000
023860     IF WS-PRIM-PROD-GROUP IS EQUAL TO WS-SUBPROD                 02386000
023870         AND WS-PRIM-7102 IS EQUAL TO 'M'                         02387000
023880         MOVE SPACES TO WS-PG-PRODCD (1)                          02388000
023890         MOVE ZEROS TO WS-PG-TYPE (1)                             02389000
023900         MOVE WS-PRIM-7102 TO WS-PG-7102 (1).                     02390000
023910     IF WS-PRIM-PROD-GROUP IS EQUAL TO WS-SUBPROD                 02391000
023920         IF WS-MINPROD-GRP IS GREATER THAN ZEROS                  02392000
023930             SUBTRACT +1 FROM WS-MINPROD-GRP                      02393000
023940         END-IF                                                   02394000
023950         IF WS-MAXPROD-GRP IS GREATER THAN ZEROS                  02395000
023960             SUBTRACT +1 FROM WS-MAXPROD-GRP                      02396000
023970         END-IF                                                   02397000
023980     END-IF.                                                      02398000
023990 VPG-SECOND.                                                      02399000
024000     MOVE ZEROS TO WS-SUBSEC.                                     02400000
024010 VPG-NEXT.                                                        02401000
024020     ADD +1 TO WS-SUBSEC.                                         02402000
024030     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02403000
024040         GO TO VPG-TEST.                                          02404000
024050     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02405000
024060         GO TO VPG-TEST.                                          02406000
024070     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   02407000
024080         GO TO VPG-NEXT.                                          02408000
024090     IF WS-SEC-PROD-GROUP (WS-SUBSEC) IS NOT EQUAL TO WS-SUBPROD  02409000
024100         GO TO VPG-NEXT.                                          02410000
024110     MOVE ZEROS TO WS-SUBPG.                                      02411000
024120 VPG-SEARCH-NEXT.                                                 02412000
024130     ADD +1 TO WS-SUBPG.                                          02413000
024140     IF WS-SUBPG IS GREATER THAN WS-PGSEARCH-MAX                  02414000
024150         PERFORM VALIDATE-MINACCT-PROD-REQ                        02415000
024160         IF WS-MODEL-REQS IS EQUAL TO 'N'                         02416000
024170             GO TO VPG-EXIT                                       02417000
024180         ELSE                                                     02418000
024190             GO TO VPG-ACCT-NOT-QUAL                              02419000
024200         END-IF                                                   02420000
024210     END-IF.                                                      02421000
024220     IF WS-SEC-7102 (WS-SUBSEC) IS NOT EQUAL TO 'B'               02422000
024230         AND WS-SEC-7102 (WS-SUBSEC) IS NOT EQUAL TO 'P'          02423000
024240         AND WS-SEC-7102 (WS-SUBSEC) IS NOT EQUAL TO 'M'          02424000
024250         PERFORM VALIDATE-MINACCT-PROD-REQ                        02425000
024260         IF WS-MODEL-REQS IS EQUAL TO 'N'                         02426000
024270             GO TO VPG-EXIT                                       02427000
024280         ELSE                                                     02428000
024290             GO TO VPG-ACCT-NOT-QUAL                              02429000
024300         END-IF                                                   02430000
024310     END-IF.                                                      02431000
024320     IF WS-PG-7102 (WS-SUBPG) IS EQUAL TO SPACE                   02432000
024330         GO TO VPG-CHECK-NEW-PROD.                                02433000
024340     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'B'                   02434000
024350         AND WS-SEC-PRODCD (WS-SUBSEC) IS EQUAL TO                02435000
024360             WS-PG-PRODCD (WS-SUBPG)                              02436000
024370         AND WS-SEC-TYPE (WS-SUBSEC) IS EQUAL TO                  02437000
024380             WS-PG-TYPE (WS-SUBPG)                                02438000
024390         AND WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO                  02439000
024400             WS-PG-7102 (WS-SUBPG)                                02440000
024410         ADD +1 TO WS-MINACCTS-PG                                 02441000
024420         GO TO VPG-NEXT.                                          02442000
024430     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'P'                   02443000
024440         AND WS-SEC-PRODCD (WS-SUBSEC) IS EQUAL TO                02444000
024450             WS-PG-PRODCD (WS-SUBPG)                              02445000
024460         AND WS-PG-TYPE (WS-SUBPG) IS EQUAL TO ZEROS              02446000
024470         AND WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO                  02447000
024480             WS-PG-7102 (WS-SUBPG)                                02448000
024490         ADD +1 TO WS-MINACCTS-PG                                 02449000
024500         GO TO VPG-NEXT.                                          02450000
024510     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'M'                   02451000
024520         AND WS-PG-PRODCD (WS-SUBPG) IS EQUAL TO SPACES           02452000
024530         AND WS-PG-TYPE (WS-SUBPG) IS EQUAL TO ZEROS              02453000
024540         AND WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO                  02454000
024550             WS-PG-7102 (WS-SUBPG)                                02455000
024560         ADD +1 TO WS-MINACCTS-PG                                 02456000
024570         GO TO VPG-NEXT.                                          02457000
024580     GO TO VPG-SEARCH-NEXT.                                       02458000
024590 VPG-CHECK-NEW-PROD.                                              02459000
024600     IF WS-MAXPROD-GRP IS GREATER THAN ZEROS                      02460000
024610         GO TO VPG-ADD-NEW-PROD.                                  02461000
024620     PERFORM VALIDATE-MINACCT-PROD-REQ.                           02462000
024630     IF WS-MODEL-REQS IS EQUAL TO 'N'                             02463000
024640         GO TO VPG-EXIT.                                          02464000
024650     GO TO VPG-ACCT-NOT-QUAL.                                     02465000
024660 VPG-ADD-NEW-PROD.                                                02466000
024670     ADD +1 TO WS-MINACCTS-PG.                                    02467000
024680     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'B'                   02468000
024690         MOVE WS-SEC-PRODCD (WS-SUBSEC)                           02469000
024700             TO WS-PG-PRODCD (WS-SUBPG)                           02470000
024710         MOVE WS-SEC-TYPE (WS-SUBSEC) TO WS-PG-TYPE (WS-SUBPG)    02471000
024720         MOVE WS-SEC-7102 (WS-SUBSEC) TO WS-PG-7102 (WS-SUBPG)    02472000
024730         SUBTRACT +1 FROM WS-MAXPROD-GRP                          02473000
024740         IF WS-MINPROD-GRP IS GREATER THAN ZEROS                  02474000
024750             SUBTRACT +1 FROM WS-MINPROD-GRP                      02475000
024760         END-IF                                                   02476000
024770         GO TO VPG-NEXT                                           02477000
024780     END-IF.                                                      02478000
024790     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'P'                   02479000
024800         MOVE WS-SEC-PRODCD (WS-SUBSEC)                           02480000
024810             TO WS-PG-PRODCD (WS-SUBPG)                           02481000
024820         MOVE ZEROS TO WS-PG-TYPE (WS-SUBPG)                      02482000
024830         MOVE WS-SEC-7102 (WS-SUBSEC) TO WS-PG-7102 (WS-SUBPG)    02483000
024840         SUBTRACT +1 FROM WS-MAXPROD-GRP                          02484000
024850         IF WS-MINPROD-GRP IS GREATER THAN ZEROS                  02485000
024860             SUBTRACT +1 FROM WS-MINPROD-GRP                      02486000
024870         END-IF                                                   02487000
024880         GO TO VPG-NEXT                                           02488000
024890     END-IF.                                                      02489000
024900* WS-SEC-7102 MUST BE AN 'M'                                      02490000
024910     MOVE SPACES TO WS-PG-PRODCD (WS-SUBPG).                      02491000
024920     MOVE ZEROS TO WS-PG-TYPE (WS-SUBPG).                         02492000
024930     MOVE WS-SEC-7102 (WS-SUBSEC) TO WS-PG-7102 (WS-SUBPG).       02493000
024940     SUBTRACT +1 FROM WS-MAXPROD-GRP.                             02494000
024950     IF WS-MINPROD-GRP IS GREATER THAN ZEROS                      02495000
024960         SUBTRACT +1 FROM WS-MINPROD-GRP.                         02496000
024970     GO TO VPG-NEXT.                                              02497000
024980 VPG-ACCT-NOT-QUAL.                                               02498000
024990     MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC).                         02499000
025000     MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC).                       02500000
025010     MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC).                       02501000
025020     GO TO VPG-NEXT.                                              02502000
025030 VPG-TEST.                                                        02503000
025040     IF WS-MINPROD-GRP IS GREATER THAN ZERO                       02504000
025050         MOVE 'N' TO WS-PROD-GROUPS-REQS                          02505000
025060         GO TO VPG-EXIT.                                          02506000
025070     GO TO VPG-NEXT-GROUP.                                        02507000
025080 VPG-MINACCT-MODEL-REQ.                                           02508000
025090     IF MIM-7101MINACCTS-Q IS EQUAL TO 'N'                        02509000
025100         OR MIM-7101MINACCTS-Q IS EQUAL TO 'V'                    02510000
025110         GO TO VPG-EXIT.                                          02511000
025120     IF WS-MINACCTS-PG IS LESS THAN MIM-7101MINACCTS              02512000
025130         MOVE 'N' TO WS-MIN-MAX-ACCT-REQS.                        02513000
025140 VPG-EXIT.                                                        02514000
025150     EXIT.                                                        02515000
025160******************************************************************02516000
025170 VALIDATE-MINACCT-PROD-REQ SECTION.                               02517000
025180 VMPR-START.                                                      02518000
025190     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'B'                   02519000
025200         MOVE WS-SEC-PRODCD (WS-SUBSEC) TO WS-WORK-PRODCD         02520000
025210         MOVE WS-SEC-TYPE (WS-SUBSEC) TO WS-WORK-TYPE.            02521000
025220     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'P'                   02522000
025230         MOVE WS-SEC-PRODCD (WS-SUBSEC) TO WS-WORK-PRODCD         02523000
025240         MOVE ZEROS TO WS-WORK-TYPE.                              02524000
025250     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'M'                   02525000
025260         MOVE SPACES TO WS-WORK-PRODCD                            02526000
025270         MOVE ZEROS TO WS-WORK-TYPE.                              02527000
025280     SET INDX-7102 TO +1.                                         02528000
025290 VMPR-FIND-7102S.                                                 02529000
025300     IF INDX-7102 IS GREATER THAN WS-RPMIM7102MAXSIZE             02530000
025310         GO TO VMPR-EXIT.                                         02531000
025320     IF WS-7102-MODEL (INDX-7102) IS GREATER THAN WS-PRIM-MODEL   02532000
025330         GO TO VMPR-EXIT.                                         02533000
025340     IF WS-7102-MODEL (INDX-7102) IS EQUAL TO WS-PRIM-MODEL       02534000
025350         AND WS-7102-PRODCODE (INDX-7102)                         02535000
025360             IS EQUAL TO WS-WORK-PRODCD                           02536000
025370         AND WS-7102-TYPE (INDX-7102)                             02537000
025380             IS EQUAL TO WS-WORK-TYPE                             02538000
025390         MOVE WS-RPMIM7102 (INDX-7102) TO MIM-REC7102             02539000
025400         GO TO VMPR-TEST-7102S.                                   02540000
025410     SET INDX-7102 UP BY +1.                                      02541000
025420     GO TO VMPR-FIND-7102S.                                       02542000
025430 VMPR-TEST-7102S.                                                 02543000
025440     IF MIM-7102MINACCTS-Q IS NOT EQUAL TO 'B'                    02544000
025450         AND MIM-7102MINACCTS-Q IS NOT EQUAL TO 'E'               02545000
025460         GO TO VMPR-EXIT.                                         02546000
025470     IF MIM-7102MINACCTS IS GREATER THAN ZEROS                    02547000
025480         MOVE 'N' TO WS-MODEL-REQS.                               02548000
025490 VMPR-EXIT.                                                       02549000
025500     EXIT.                                                        02550000
P0110 ******************************************************************02550040
P0110  CHECK-EXPIRED-MODEL SECTION.                                     02550080
P0110  CEM-START.                                                       02550120
P0110      MOVE 'Y' TO WS-EXPIRED-FLAG.                                 02550160
P0110      IF WS-EXPIRED-MODEL IS EQUAL TO SPACES                       02550200
P0110          GO TO CEM-EXIT.                                          02550240
P0110      MOVE RPXXX30-PRIMARY-INST TO RPMST-INST.                     02550280
P0110      MOVE RPXXX30-PRIMARY-PROD-CODE TO RPMST-PRODCODE.            02550320
P0110      MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPMST-ACCOUNT.              02550360
P0110      MOVE WS-EXPIRED-MODEL TO RPMST-MODEL.                        02550400
P0110      PERFORM RPS-MST-GET-REQUEST.                                 02550440
P0110      IF WS-FUNCTION IS EQUAL TO 'N'                               02550480
P0110          GO TO CEM-EXIT.                                          02550520
P0110      IF RPMST-REL-STAT IS EQUAL TO 'E'                            02550560
P0110          GO TO CEM-EXIT.                                          02550600
P0110      IF RPMST-EXPIRATION-DATE IS NOT GREATER THAN RPBNK-CURDT     02550640
P0110          AND RPMST-EXPIRATION-DATE IS NOT EQUAL TO ZEROS          02550680
P0110          GO TO CEM-EXIT.                                          02550720
P0110      MOVE 'N' TO WS-EXPIRED-FLAG.                                 02550760
P0110  CEM-EXIT.                                                        02550800
P0110      EXIT.                                                        02550840
025510******************************************************************02551000
025520 SEARCH-PRODUCT-CODES SECTION.                                    02552000
025530 SPC-START.                                                       02553000
025540     MOVE 'N' TO WS-FOUND-PRODCODE.                               02554000
025550     MOVE ZEROS TO WS-SUBPCODE.                                   02555000
025560 SPC-NEXT.                                                        02556000
025570     ADD +1 TO WS-SUBPCODE.                                       02557000
025580     IF WS-SUBPCODE IS GREATER THAN WS-PRODCODE-MAX               02558000
025590         GO TO SPC-EXIT.                                          02559000
025600     IF WS-PRODCODE (WS-SUBPCODE) IS EQUAL TO SPACES              02560000
025610         MOVE WS-PRODCODE-SEARCH TO WS-PRODCODE (WS-SUBPCODE)     02561000
025620         GO TO SPC-EXIT.                                          02562000
025630     IF WS-PRODCODE-SEARCH IS EQUAL TO WS-PRODCODE (WS-SUBPCODE)  02563000
025640         MOVE 'Y' TO WS-FOUND-PRODCODE                            02564000
025650         GO TO SPC-EXIT.                                          02565000
025660     GO TO SPC-NEXT.                                              02566000
025670 SPC-EXIT.                                                        02567000
025680     EXIT.                                                        02568000
025690******************************************************************02569000
025700 INITIALIZE-WORK-AREA SECTION.                                    02570000
025710 IWA-START.                                                       02571000
025720     INITIALIZE WS-PRIMARY-TABLE.                                 02572000
025730     INITIALIZE WS-SECONDARY-TABLE.                               02573000
025740     INITIALIZE WS-SECONDARY-TABLE1.                              02574000
025750     MOVE ZERO TO WS-EXPIRATION-DATE.                             02575000
025760 IWA-EXIT.                                                        02576000
025770     EXIT.                                                        02577000
025780******************************************************************02578000
025790 INITIALIZE-WORK-AREA1 SECTION.                                   02579000
025800 IWA1-START.                                                      02580000
025810     INITIALIZE WS-SECONDARY-TABLE1.                              02581000
025820     MOVE ZEROS TO WS-PRIMCATBAL.                                 02582000
025830     MOVE ZEROS TO WS-COMBINEBAL1.                                02583000
025840     MOVE ZEROS TO WS-COMBINEBAL2.                                02584000
025850     MOVE ZEROS TO WS-COMBINEBAL3.                                02585000
025860     MOVE ZEROS TO WS-COMBINEBAL4.                                02586000
025870     MOVE ZEROS TO WS-WORK-COMBBALCD.                             02587000
025880     MOVE ZEROS TO WS-ACCTRELCD-O.                                02588000
025890     MOVE 'N' TO WS-PRIM-FATAL-ERROR.                             02589000
025900     MOVE 'N' TO WS-EXPIRED-STATUS.                               02590000
025910     MOVE 'N' TO WS-PRIMARY-ENROLL.                               02591000
025920     MOVE 'N' TO WS-MODEL-REQS.                                   02592000
025930     MOVE 'N' TO WS-MIN-MAX-PROD-REQS.                            02593000
025940     MOVE 'N' TO WS-MIN-MAX-ACCT-REQS.                            02594000
025950     MOVE 'N' TO WS-PROD-GROUPS-REQS.                             02595000
025960     MOVE SPACES TO WS-PRIM-SCINCOPT.                             02596000
025970     MOVE SPACES TO WS-PRIM-RATEINCOPT.                           02597000
025980     MOVE SPACES TO WS-PRIM-RATEINCTABLE.                         02598000
025990     MOVE 'I' TO WS-PRIM-RATETYPE.                                02599000
026000     MOVE SPACES TO WS-PRIM-TIMEPROCOPT.                          02600000
026010     MOVE ZEROS TO WS-PRIM-PROD-GROUP.                            02601000
026020 IWA1-EXIT.                                                       02602000
026030     EXIT.                                                        02603000
026040******************************************************************02604000
026050 ADD-NEW-RELATIONSHIP SECTION.                                    02605000
026060 ANR-START.                                                       02606000
026070     MOVE +0 TO WS-ACT-SEQNBR.                                    02607000
026080     MOVE +0 TO WS-MST-SEQNBR.                                    02608000
026090     MOVE +0 TO WS-REL-SEQNBR.                                    02609000
026100     MOVE +0 TO WS-TRM-SEQNBR.                                    02610000
026110     MOVE '0' TO WS-RATE-OPTION.                                  02611000
026120     PERFORM INITIALIZE-VALIDATION-RESPONSE.                      02612000
P0084      MOVE  ZERO TO RPXXX30-RATE-OPTION.                           02613000
P0150      MOVE WS-PRIM-RATETYPE TO RPXXX30-RATE-TYPE.                  02614000
P0150      IF WS-PRIM-RATEPCT IS GREATER THAN ZERO                      02614690
P0150          MOVE WS-PRIM-RATEPCT TO RPXXX30-VALID-RATE               02615380
026170         GO TO ANR-PRIM-MST.                                      02617000
026180     IF WS-PRIM-RATEINCTABLE IS EQUAL TO SPACES                   02618000
026190         GO TO ANR-PRIM-MST.                                      02619000
026200     MOVE WS-PRIM-RATEINCTABLE TO WS-RPMIM7103RATETABLE.          02620000
026210     PERFORM SEARCH-RPS-7103.                                     02621000
026220     IF WS-RPMIM7103FOUND IS EQUAL TO 'N'                         02622000
026230         MOVE 500620 TO RPXXX30-MSGNBR                            02623000
026240         MOVE 500620 TO RPXXX30-RESP-MSG-NBR                      02624000
026250         GO TO CICS-RETURN.                                       02625000
026260     IF MIM-7103RATEOPT IS NOT EQUAL TO '4'                       02626000
026270         GO TO ANR-RATE-INCENTIVES.                               02627000
026280     MOVE RPBNK-INST TO WS-RPMIM7114INST.                         02628000
026290     PERFORM LOAD-RPS-7114.                                       02629000
026300     IF WS-RPMIM7114ERROR IS EQUAL TO 'Y'                         02630000
026310         MOVE 500092 TO RPXXX30-MSGNBR                            02631000
026320         MOVE 500092 TO RPXXX30-RESP-MSG-NBR                      02632000
026330         GO TO CICS-RETURN.                                       02633000
026340     IF MIM-7103TERMBALTABLE IS EQUAL TO SPACES                   02634000
P0084          MOVE WS-RPMIM7103RATETABLE TO WS-RPMIM7114RATETABLE      02635000
026360     ELSE                                                         02636000
026370         MOVE MIM-7103TERMBALTABLE TO WS-RPMIM7114RATETABLE.      02637000
026380     PERFORM SEARCH-RPS-7114.                                     02638000
026390     IF WS-RPMIM7114FOUND IS EQUAL TO 'N'                         02639000
026400         MOVE 500092 TO RPXXX30-MSGNBR                            02640000
026410         MOVE 500092 TO RPXXX30-RESP-MSG-NBR                      02641000
026420         GO TO CICS-RETURN.                                       02642000
026430 ANR-RATE-INCENTIVES.                                             02643000
026440     MOVE RPXXX30-NEW-TERM TO WS-REL-TERM.                        02644000
026450     PERFORM RATE-INCENTIVES.                                     02645000
026460     MOVE MIM-7103RATEOPT TO WS-RATE-OPTION.                      02646000
026470     MOVE MIM-7103RATEOPT TO RPXXX30-RATE-OPTION.                 02647000
026480 ANR-PRIM-MST.                                                    02648000
026490     INITIALIZE RPMST-RECORD.                                     02649000
026500     MOVE RPXXX30-PRIMARY-INST TO RPMST-INST.                     02650000
026510     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPMST-PRODCODE.            02651000
026520     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPMST-ACCOUNT.              02652000
026530     MOVE RPXXX30-PRIMARY-MODEL TO RPMST-MODEL.                   02653000
026540     MOVE 'A' TO RPMST-REL-STAT.                                  02654000
026550     MOVE 'N' TO RPMST-QUAL-STAT.                                 02655000
P0045      MOVE WS-CURDT-YYYYMMDD TO RPMST-LMNTDT.                      02656000
026570     MOVE ZEROS TO RPMST-IQUALDT.                                 02657000
026580     MOVE ZEROS TO RPMST-VQUALDT.                                 02658000
026590     MOVE WS-PRIM-SCNXT TO RPMST-SCNXTDT.                         02659000
P0022      MOVE WS-PDATE TO RPMST-DATE-OPENED.                          02660000
026610     MOVE WS-EXPIRATION-DATE TO RPMST-EXPIRATION-DATE.            02661000
P0003      MOVE WS-EXPIRATION-DATE TO RPXXX30-EXPIRATION-DATE.          02661500
026620     MOVE 'N' TO RPMST-SCTODAYFLAG.                               02662000
026630     MOVE ZEROES TO WS-IDNBR.                                     02663000
026640     EXEC CICS ASKTIME                                            02664000
026650         END-EXEC.                                                02665000
026660     MOVE WS-PDATE TO WS-IDNBR-DATE.                              02666000
026670     MOVE EIBTIME TO WS-IDNBR-TIME.                               02667000
026680     MOVE ZEROES TO WS-IDNBR-SEQ.                                 02668000
P0022      MOVE RPXXX30-PRIMARY-INST TO WS-RPIDX-INST.                  02668030
P0022      PERFORM CALCULATE-MIL-SECOND.                                02668060
P0022      IF WS-RPIDX-ERROR IS EQUAL TO 'Y'                            02668090
P0022          MOVE WS-AB6310 TO RPXXX30-ABORT                          02668120
P0022          MOVE WS-AB6310 TO RPXXX30-RESP-ABORT                     02668150
P0022          MOVE WS-TR0014 TO RPXXX30-ABTRACE                        02668180
P0022          MOVE WS-TR0014 TO RPXXX30-RESP-TRACE                     02668210
P0022          GO TO CICS-RETURN.                                       02668240
P0022      INITIALIZE RPIDX-RECORD.                                     02668270
P0022      MOVE RPXXX30-PRIMARY-INST TO RPIDX-INST.                     02668300
P0022      MOVE WS-RPMIM2023-RPS TO RPIDX-PRODCODE.                     02668330
P0022      MOVE RPXXX30-PRIMARY-INST TO RPIDX-INST2.                    02668360
P0022      MOVE RPXXX30-PRIMARY-PROD-CODE TO RPIDX-PRODCODE2.           02668390
P0022      MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPIDX-ACCT2.                02668420
P0022      MOVE RPXXX30-PRIMARY-MODEL TO RPIDX-MODEL2.                  02668450
P0022      MOVE SPACE TO RPIDX-RCIF-STATUS.                             02668480
P0022      MOVE SPACES TO RPIDX-RESERVED.                               02668510
P0022      MOVE WS-IDNBR TO RPIDX-IDNUMBER.                             02668540
P0022      PERFORM RPS-IDX-PUT-REQUEST.                                 02668570
P0022      IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02668600
P0022          MOVE WS-AB6310 TO RPXXX30-ABORT                          02668630
P0022          MOVE WS-AB6310 TO RPXXX30-RESP-ABORT                     02668660
P0022          MOVE WS-TR0015 TO RPXXX30-ABTRACE                        02668690
P0022          MOVE WS-TR0015 TO RPXXX30-RESP-TRACE                     02668720
P0022          GO TO CICS-RETURN.                                       02668750
026690     MOVE WS-IDNBR TO RPMST-IDNUMBER.                             02669000
026700     MOVE WS-IDNBR TO RPXXX30-PRIMARY-IDNUM.                      02670000
026710     MOVE ZEROS TO RPMST-COMBBAL1.                                02671000
026720     MOVE ZEROS TO RPMST-COMBBAL2.                                02672000
026730     MOVE ZEROS TO RPMST-COMBBAL3.                                02673000
026740     MOVE ZEROS TO RPMST-COMBBAL4.                                02674000
026750     MOVE ZEROS TO RPMST-RSV-BAL2.                                02675000
026760     MOVE ZEROS TO RPMST-RSV-BAL3.                                02676000
026770     MOVE 'N' TO RPMST-OUT-FLAG.                                  02677000
026780     MOVE ZEROS TO RPMST-VF-EXP-DATE.                             02678000
026790     MOVE ZEROS TO RPMST-EXTENSIONS.                              02679000
026800     MOVE ZEROS TO RPMST-RETENTION-DAYS.                          02680000
026810     MOVE ZEROS TO RPMST-VF-MSGNBR.                               02681000
026820     MOVE ZEROS TO RPMST-IQ-MSGNBR.                               02682000
026830     MOVE ZEROS TO RPMST-CUST-NO.                                 02683000
026840     MOVE SPACES TO RPMST-RESERVED.                               02684000
026850     INITIALIZE RPENR-RECORD.                                     02685000
026860     MOVE RPMST-INST TO RPENR-INST.                               02686000
026870     MOVE RPMST-IDNUMBER TO RPENR-IDNUMBER.                       02687000
026880     MOVE '0' TO RPENR-RELEXISTS.                                 02688000
026890     IF WS-EXPIRED-STATUS IS EQUAL TO 'E'                         02689000
026900         MOVE '1' TO RPENR-RELEXISTS.                             02690000
026910     IF WS-EXPIRED-STATUS IS EQUAL TO 'P'                         02691000
026920         MOVE '2' TO RPENR-RELEXISTS.                             02692000
026930     MOVE 'MST' TO RPENR-RECID.                                   02693000
026940     MOVE WS-MST-SEQNBR TO RPENR-RECSEQ.                          02694000
026950     MOVE RPMST-RECORD TO RPENR-GRP-DATA.                         02695000
P0022  ANR-ENR-RETRY.                                                   02695500
026960     PERFORM RPS-ENR-PUT-REQUEST.                                 02696000
P0022      IF WS-FUNCTION IS EQUAL TO "="                               02696100
P0022          AND WS-IDNBR-SEQ IS LESS THAN 99                         02696200
P0022          ADD +0001 TO WS-IDNBR-SEQ                                02696300
P0022          MOVE WS-IDNBR TO RPMST-IDNUMBER                          02696400
P0022          MOVE WS-IDNBR TO RPXXX30-PRIMARY-IDNUM                   02696500
P0022          MOVE RPMST-IDNUMBER TO RPENR-IDNUMBER                    02696600
P0022          MOVE RPMST-RECORD TO RPENR-GRP-DATA                      02696700
P0022          GO TO ANR-ENR-RETRY.                                     02696800
026970     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02697000
026980         MOVE WS-AB6365 TO RPXXX30-ABORT                          02698000
026990         MOVE WS-AB6365 TO RPXXX30-RESP-ABORT                     02699000
027000         MOVE WS-TR0005 TO RPXXX30-ABTRACE                        02700000
027010         MOVE WS-TR0005 TO RPXXX30-RESP-TRACE                     02701000
027020         GO TO ANR-EXIT.                                          02702000
027030 ANR-REL-REC.                                                     02703000
027040     INITIALIZE RPREL-RECORD.                                     02704000
027050     MOVE RPXXX30-PRIMARY-INST TO RPREL-INST.                     02705000
027060     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPREL-PRODCODE.            02706000
027070     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPREL-ACCOUNT.              02707000
027080     MOVE RPXXX30-PRIMARY-MODEL TO RPREL-MODEL.                   02708000
027090     MOVE ZEROS TO RPREL-INST2.                                   02709000
027100     MOVE SPACES TO RPREL-PRODCODE2.                              02710000
027110     MOVE SPACES TO RPREL-ACCOUNT2.                               02711000
027120     MOVE 'A' TO RPREL-ACCT-STATUS.                               02712000
027130     MOVE WS-PRIM-BRANCH TO RPREL-BRANCH.                         02713000
027140     MOVE WS-PRIM-TYPE TO RPREL-ACCT-TYPE.                        02714000
027150     MOVE WS-PRIM-SCINCOPT TO RPREL-SC-INC-OPTION.                02715000
027160     MOVE WS-PRIM-RATEINCOPT TO RPREL-RATE-INC-OPTION.            02716000
027170     MOVE WS-PRIM-APPL TO RPREL-APPL.                             02717000
027180     MOVE ZEROS TO RPREL-ACCTBAL-1.                               02718000
027190     MOVE ZEROS TO RPREL-ACCTBAL-2.                               02719000
027200     MOVE ZEROS TO RPREL-PRIMEBAL.                                02720000
027210     MOVE ZEROS TO RPREL-ACCT-COMBBAL1.                           02721000
027220     MOVE ZEROS TO RPREL-ACCT-COMBBAL2.                           02722000
027230     MOVE ZEROS TO RPREL-ACCT-COMBBAL3.                           02723000
027240     MOVE ZEROS TO RPREL-ACCT-COMBBAL4.                           02724000
027250     MOVE ZEROS TO RPREL-CASH-RW-BAL.                             02725000
027260     MOVE ZEROS TO RPREL-ACCT-RATE-BAL.                           02726000
027270     MOVE ZEROS TO RPREL-SC-BAL.                                  02727000
027280     MOVE ZEROS TO RPREL-SECSVC-BAL.                              02728000
027290     MOVE ZEROS TO RPREL-DISCAMT-OVRD.                            02729000
027300     MOVE ZEROS TO RPREL-DISCPCT-OVRD.                            02730000
027310     MOVE ZEROS TO RPREL-RATEPCT-OVRD.                            02731000
027320     MOVE 'N' TO RPREL-DISCAMT-OVRD-FLAG.                         02732000
027330     MOVE 'N' TO RPREL-DISCPCT-OVRD-FLAG.                         02733000
027340     MOVE 'N' TO RPREL-RATEPCT-OVRD-FLAG.                         02734000
027350     MOVE SPACES TO RPREL-RESERVED.                               02735000
027360     INITIALIZE RPENR-RECORD.                                     02736000
027370     MOVE RPREL-INST TO RPENR-INST.                               02737000
027380     MOVE RPXXX30-PRIMARY-IDNUM TO RPENR-IDNUMBER.                02738000
027390     MOVE '3' TO RPENR-RELEXISTS.                                 02739000
027400     MOVE 'REL' TO RPENR-RECID.                                   02740000
027410     MOVE WS-REL-SEQNBR TO RPENR-RECSEQ.                          02741000
027420     MOVE RPREL-RECORD TO RPENR-GRP-DATA.                         02742000
027430     PERFORM RPS-ENR-PUT-REQUEST.                                 02743000
027440     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02744000
027450         MOVE WS-AB6365 TO RPXXX30-ABORT                          02745000
027460         MOVE WS-AB6365 TO RPXXX30-RESP-ABORT                     02746000
027470         MOVE WS-TR0006 TO RPXXX30-ABTRACE                        02747000
027480         MOVE WS-TR0006 TO RPXXX30-RESP-TRACE                     02748000
027490         GO TO ANR-EXIT.                                          02749000
027500     INITIALIZE RPACT-RECORD.                                     02750000
027510     MOVE RPMST-INST TO RPACT-INST.                               02751000
027520     MOVE RPMST-PRODCODE TO RPACT-PRODCODE.                       02752000
027530     MOVE RPMST-ACCOUNT TO RPACT-ACCOUNT.                         02753000
027540     IF WS-PRIM-SCINCOPT IS EQUAL TO 'Y'                          02754000
027550         MOVE RPXXX30-PRIMARY-MODEL TO RPACT-SC-MODEL.            02755000
027560     MOVE WS-PRIM-SCINCOPT TO RPACT-SC-INC-OPTION.                02756000
027570     MOVE 'N' TO RPACT-SC-INC-QUAL.                               02757000
027580     IF WS-PRIM-SCINCOPT IS EQUAL TO 'Y'                          02758000
027590         MOVE RPMST-MODEL TO RPACT-SC-MODEL.                      02759000
027600     MOVE ZEROS TO RPACT-DISCOUNT-AMOUNT.                         02760000
027610     MOVE ZEROS TO RPACT-DISCOUNT-PERCENT.                        02761000
027620     MOVE WS-PRIM-RATEINCOPT TO RPACT-RATE-INC-OPTION.            02762000
027630     MOVE 'N' TO RPACT-RATE-INC-QUAL.                             02763000
027640     IF WS-PRIM-RATEINCOPT IS EQUAL TO 'Y'                        02764000
027650         MOVE RPMST-MODEL TO RPACT-RATE-MODEL.                    02765000
P0084      MOVE RPXXX30-RATE-OPTION TO RPACT-RATE-OPTION.               02766000
P0084      MOVE RPXXX30-RATE-TYPE TO RPACT-RATE-TYPE.                   02766690
P0084      MOVE RPXXX30-VALID-RATE TO RPACT-RATE-PERCENT.               02767380
027690     MOVE WS-PRIM-TIMEPROCOPT TO RPACT-PROCOPT.                   02769000
027700     MOVE WS-PRIM-APPL TO RPACT-APPL.                             02770000
027710     MOVE SPACE TO RPACT-RSV-FLAG.                                02771000
027720     MOVE SPACE TO RPACT-RSV-FLAG1.                               02772000
027730     MOVE SPACE TO RPACT-RSV-FLAG2.                               02773000
027740     MOVE SPACE TO RPACT-RSV-FLAG3.                               02774000
027750     MOVE SPACES TO RPACT-RESERVED.                               02775000
027760     INITIALIZE RPENR-RECORD.                                     02776000
027770     MOVE RPMST-INST TO RPENR-INST.                               02777000
027780     MOVE RPMST-IDNUMBER TO RPENR-IDNUMBER.                       02778000
027790     MOVE '3' TO RPENR-RELEXISTS.                                 02779000
027800     MOVE 'ACT' TO RPENR-RECID.                                   02780000
027810     MOVE WS-ACT-SEQNBR TO RPENR-RECSEQ.                          02781000
027820     MOVE RPACT-RECORD TO RPENR-GRP-DATA.                         02782000
027830     PERFORM RPS-ENR-PUT-REQUEST.                                 02783000
027840     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02784000
027850         MOVE WS-AB6365 TO RPXXX30-ABORT                          02785000
027860         MOVE WS-AB6365 TO RPXXX30-RESP-ABORT                     02786000
027870         MOVE WS-TR0007 TO RPXXX30-ABTRACE                        02787000
027880         MOVE WS-TR0007 TO RPXXX30-RESP-TRACE                     02788000
027890         GO TO ANR-EXIT.                                          02789000
027900     MOVE ZERO TO WS-SUBSEC.                                      02790000
027910 ANR-SECONDARY.                                                   02791000
027920     ADD +1 TO WS-SUBSEC.                                         02792000
027930     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02793000
027940         GO TO ANR-END.                                           02794000
027950     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02795000
027960         GO TO ANR-END.                                           02796000
027970     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   02797000
P0045          OR WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X'               02797500
027980         GO TO ANR-SECONDARY.                                     02798000
027990     MOVE '0' TO WS-RATE-OPTION.                                  02799000
028000     IF WS-SEC-RATEINCTABLE (WS-SUBSEC) IS EQUAL TO SPACES        02800000
028010         GO TO ANR-SEC-REL.                                       02801000
028020     MOVE WS-SEC-RATEINCTABLE (WS-SUBSEC)                         02802000
028030         TO WS-RPMIM7103RATETABLE.                                02803000
028040     PERFORM SEARCH-RPS-7103.                                     02804000
028050     IF WS-RPMIM7103FOUND IS EQUAL TO 'N'                         02805000
028060         GO TO ANR-SEC-REL.                                       02806000
028070     MOVE MIM-7103RATEOPT TO WS-RATE-OPTION.                      02807000
028080 ANR-SEC-REL.                                                     02808000
028090     INITIALIZE RPREL-RECORD.                                     02809000
028100     MOVE RPXXX30-PRIMARY-INST TO RPREL-INST.                     02810000
028110     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPREL-PRODCODE.            02811000
028120     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPREL-ACCOUNT.              02812000
028130     MOVE RPXXX30-PRIMARY-MODEL TO RPREL-MODEL.                   02813000
028140     MOVE WS-SEC-INST (WS-SUBSEC) TO RPREL-INST2.                 02814000
028150     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPREL-PRODCODE2.           02815000
028160     MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPREL-ACCOUNT2.              02816000
028170     MOVE 'A' TO RPREL-ACCT-STATUS.                               02817000
028180     MOVE WS-SEC-BRANCH (WS-SUBSEC) TO RPREL-BRANCH.              02818000
028190     MOVE WS-SEC-TYPE (WS-SUBSEC) TO RPREL-ACCT-TYPE.             02819000
028200     MOVE WS-SEC-SCINCOPT (WS-SUBSEC) TO RPREL-SC-INC-OPTION.     02820000
028210     MOVE WS-SEC-RATEINCOPT (WS-SUBSEC) TO RPREL-RATE-INC-OPTION. 02821000
028220     MOVE WS-SEC-APPL (WS-SUBSEC) TO RPREL-APPL.                  02822000
028230     MOVE ZEROS TO RPREL-ACCTBAL-1.                               02823000
028240     MOVE ZEROS TO RPREL-ACCTBAL-2.                               02824000
028250     MOVE ZEROS TO RPREL-PRIMEBAL.                                02825000
028260     MOVE ZEROS TO RPREL-ACCT-COMBBAL1.                           02826000
028270     MOVE ZEROS TO RPREL-ACCT-COMBBAL2.                           02827000
028280     MOVE ZEROS TO RPREL-CASH-RW-BAL.                             02828000
028290     MOVE ZEROS TO RPREL-ACCT-RATE-BAL.                           02829000
028300     MOVE ZEROS TO RPREL-SC-BAL.                                  02830000
028310     MOVE ZEROS TO RPREL-DISCAMT-OVRD.                            02831000
028320     MOVE ZEROS TO RPREL-DISCPCT-OVRD.                            02832000
028330     MOVE ZEROS TO RPREL-RATEPCT-OVRD.                            02833000
028340     MOVE 'N' TO RPREL-DISCAMT-OVRD-FLAG.                         02834000
028350     MOVE 'N' TO RPREL-DISCPCT-OVRD-FLAG.                         02835000
028360     MOVE 'N' TO RPREL-RATEPCT-OVRD-FLAG.                         02836000
028370     MOVE SPACES TO RPREL-RESERVED.                               02837000
028380     MOVE '3' TO RPENR-RELEXISTS.                                 02838000
028390     MOVE 'REL' TO RPENR-RECID.                                   02839000
028400     ADD +1 TO WS-REL-SEQNBR.                                     02840000
028410     MOVE WS-REL-SEQNBR TO RPENR-RECSEQ.                          02841000
028420     MOVE RPREL-RECORD TO RPENR-GRP-DATA.                         02842000
028430     PERFORM RPS-ENR-PUT-REQUEST.                                 02843000
028440     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02844000
028450         MOVE WS-AB6365 TO RPXXX30-ABORT                          02845000
028460         MOVE WS-AB6365 TO RPXXX30-RESP-ABORT                     02846000
028470         MOVE WS-TR0008 TO RPXXX30-ABTRACE                        02847000
028480         MOVE WS-TR0008 TO RPXXX30-RESP-TRACE                     02848000
028490         GO TO ANR-EXIT.                                          02849000
028500     INITIALIZE RPACT-RECORD.                                     02850000
028510     MOVE WS-SEC-INST (WS-SUBSEC) TO RPACT-INST.                  02851000
028520     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPACT-PRODCODE.            02852000
028530     MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPACT-ACCOUNT.               02853000
028540     MOVE WS-SEC-SCINCOPT (WS-SUBSEC) TO RPACT-SC-INC-OPTION.     02854000
028550     MOVE 'N' TO RPACT-SC-INC-QUAL.                               02855000
028560     MOVE ZEROS TO RPACT-DISCOUNT-AMOUNT.                         02856000
028570     MOVE ZEROS TO RPACT-DISCOUNT-PERCENT.                        02857000
028580     MOVE WS-SEC-RATEINCOPT (WS-SUBSEC) TO RPACT-RATE-INC-OPTION. 02858000
028590     MOVE 'N' TO RPACT-RATE-INC-QUAL.                             02859000
028630     MOVE WS-SEC-TIMEPROCOPT (WS-SUBSEC) TO RPACT-PROCOPT.        02863000
028640     MOVE WS-SEC-APPL (WS-SUBSEC) TO RPACT-APPL.                  02864000
028650     MOVE SPACE TO RPACT-RSV-FLAG.                                02865000
028660     MOVE SPACE TO RPACT-RSV-FLAG1.                               02866000
028670     MOVE SPACE TO RPACT-RSV-FLAG2.                               02867000
028680     MOVE SPACE TO RPACT-RSV-FLAG3.                               02868000
028690     MOVE SPACES TO RPACT-RESERVED.                               02869000
028700     ADD +1 TO WS-ACT-SEQNBR.                                     02870000
028710     MOVE WS-ACT-SEQNBR TO RPENR-RECSEQ.                          02871000
028720     MOVE '3' TO RPENR-RELEXISTS.                                 02872000
028730     MOVE 'ACT' TO RPENR-RECID.                                   02873000
028740     MOVE RPACT-RECORD TO RPENR-GRP-DATA.                         02874000
028750     PERFORM RPS-ENR-PUT-REQUEST.                                 02875000
028760     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02876000
028770         MOVE WS-AB6365 TO RPXXX30-ABORT                          02877000
028780         MOVE WS-AB6365 TO RPXXX30-RESP-ABORT                     02878000
028790         MOVE WS-TR0009 TO RPXXX30-ABTRACE                        02879000
028800         MOVE WS-TR0009 TO RPXXX30-RESP-TRACE                     02880000
028810         GO TO CICS-RETURN.                                       02881000
028820     GO TO ANR-SECONDARY.                                         02882000
028830 ANR-END.                                                         02883000
028840     IF MIM-7101TRANPROFILE IS EQUAL TO SPACES                    02884000
028850         OR MIM-7101TRANPROFILE-I IS NOT EQUAL TO 'Y'             02885000
028860         GO TO ANR-EXIT.                                          02886000
028870     PERFORM ADD-TRAN-MASTER.                                     02887000
028880 ANR-EXIT.                                                        02888000
028890     EXIT.                                                        02889000
028900******************************************************************02890000
028910 ADD-TRAN-MASTER SECTION.                                         02891000
028920 ATM-START.                                                       02892000
028930     MOVE ZEROS TO WS-SUB1.                                       02893000
028940 ATM-MOVE-KEY.                                                    02894000
028950     INITIALIZE RPMST-RECORD.                                     02895000
028960     MOVE RPMST-INST TO RPTRM-INST.                               02896000
028970     MOVE RPMST-PRODCODE TO RPTRM-PRODCODE.                       02897000
028980     MOVE RPMST-ACCOUNT TO RPTRM-ACCOUNT.                         02898000
028990     MOVE RPMST-MODEL TO RPTRM-MODEL.                             02899000
029000 ATM-GRACE-DAYS.                                                  02900000
029010     MOVE MIM-7101TRANPROFILE TO WS-RPMIM7110TRANPROFILE.         02901000
029020     PERFORM SEARCH-RPS-7110.                                     02902000
029030     IF WS-RPMIM7110FOUND IS EQUAL TO 'N'                         02903000
029040         MOVE ZEROS TO RPTRM-GRACE-EXPIRATION-DATE                02904000
029050         GO TO ATM-LOOP.                                          02905000
029060     IF MIM-7110GRACE-DAYS IS EQUAL TO ZEROS                      02906000
029070         MOVE ZEROS TO RPTRM-GRACE-EXPIRATION-DATE                02907000
029080         GO TO ATM-LOOP.                                          02908000
029090     MOVE 'D' TO SR-PERIOD.                                       02909000
029100     MOVE MIM-7110GRACE-DAYS TO SR-FREQ.                          02910000
029110     MOVE ZEROS TO SR-DAY.                                        02911000
029120     MOVE WS-CURDTYYYY TO SR-FCYR.                                02912000
029130     MOVE WS-CURDTMM TO SR-FCMON.                                 02913000
029140     MOVE WS-CURDTDD TO SR-FCDAY.                                 02914000
029150     PERFORM JULIAN-365.                                          02915000
029160     MOVE SR-TOJUL TO SR-FROMJUL.                                 02916000
029170     PERFORM NEXT-DATE-365.                                       02917000
029180     MOVE SR-TOJUL TO SR-FROMJUL.                                 02918000
029190     PERFORM CALENDAR-365.                                        02919000
029200     MOVE SR-TCMON TO WS-PDATE-MM.                                02920000
029210     MOVE SR-TCDAY TO WS-PDATE-DD.                                02921000
029220     MOVE SR-TCYR TO WS-PDATE-YYYY.                               02922000
029230     MOVE WS-PDATE TO RPTRM-GRACE-EXPIRATION-DATE.                02923000
029240 ATM-LOOP.                                                        02924000
029250     ADD +1 TO WS-SUB1.                                           02925000
029260     IF WS-SUB1 IS GREATER THAN WS-RPMIM7110MAXOCCURS             02926000
029270         GO TO ATM-ADD-TRM.                                       02927000
029280     MOVE ZEROS TO RPTRM-TRAN-DATE (WS-SUB1).                     02928000
029290     MOVE ZEROS TO RPTRM-TRAN-COUNT (WS-SUB1).                    02929000
029300     MOVE ZEROS TO RPTRM-TRAN-AMOUNT (WS-SUB1).                   02930000
029310     GO TO ATM-LOOP.                                              02931000
029320 ATM-ADD-TRM.                                                     02932000
029330     INITIALIZE RPENR-RECORD.                                     02933000
029340     MOVE RPMST-INST TO RPENR-INST.                               02934000
029350     MOVE RPMST-IDNUMBER TO RPENR-IDNUMBER.                       02935000
029360     MOVE '3' TO RPENR-RELEXISTS.                                 02936000
029370     MOVE 'TRM' TO RPENR-RECID.                                   02937000
029380     MOVE WS-TRM-SEQNBR TO RPENR-RECSEQ.                          02938000
029390     MOVE RPTRM-RECORD TO RPENR-GRP-DATA.                         02939000
029400     PERFORM RPS-ENR-PUT-REQUEST.                                 02940000
029410     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02941000
029420         MOVE WS-AB6365 TO RPXXX30-ABORT                          02942000
029430         MOVE WS-AB6365 TO RPXXX30-RESP-ABORT                     02943000
029440         MOVE WS-TR0010 TO RPXXX30-ABTRACE                        02944000
029450         MOVE WS-TR0010 TO RPXXX30-RESP-TRACE                     02945000
029460         GO TO CICS-RETURN.                                       02946000
029470 ATM-EXIT.                                                        02947000
029480     EXIT.                                                        02948000
029490******************************************************************02949000
029500 INITIALIZE-VALIDATION-RESPONSE SECTION.                          02950000
029510 IVR-START.                                                       02951000
029520     MOVE ZERO TO WS-SUBRATE.                                     02952000
029530     MOVE ZEROS TO RPXXX30-VALID-RATE.                            02953000
029540     MOVE SPACE TO RPXXX30-RATE-TYPE.                             02954000
029550     MOVE SPACE TO RPXXX30-RATE-OPTION.                           02955000
029560     MOVE ZEROS TO RPXXX30-TABLE-OCCURS.                          02956000
029570 IVR-LOOP.                                                        02957000
029580     ADD +1 TO WS-SUBRATE.                                        02958000
029590     IF WS-SUBRATE IS GREATER THAN 15                             02959000
029600         GO TO IVR-EXIT.                                          02960000
029610     MOVE ZERO TO RPXXX30-RATE-TERM (WS-SUBRATE).                 02961000
029620     MOVE ZERO TO RPXXX30-RATE-BALANCE (WS-SUBRATE).              02962000
029630     MOVE ZERO TO RPXXX30-RATE (WS-SUBRATE).                      02963000
029640     GO TO IVR-LOOP.                                              02964000
029650 IVR-EXIT.                                                        02965000
029660     EXIT.                                                        02966000
029670******************************************************************02967000
029680 RATE-INCENTIVES SECTION.                                         02968000
029690 RI-START.                                                        02969000
029700     MOVE ZEROS TO WS-RATE-PCT.                                   02970000
029740     MOVE MIM-7103RATEOPT TO WS-REL-RATEOPTION.                   02974000
029750     MOVE ZEROS TO WS-SUB3.                                       02975000
029760     MOVE ZEROS TO WS-RATE-BAL.                                   02976000
P0084      MOVE MIM-7103KRATETABLE TO WS-RATEMODEL.                     02976500
029770     IF MIM-7103RATEOPT IS EQUAL TO '2'                           02977000
029780         GO TO RI-SPLIT-RATE-TABLE.                               02978000
029790     IF MIM-7103RATEOPT IS EQUAL TO '3'                           02979000
029800         MOVE WS-REL-TERM TO WS-TERM                              02980000
029810         GO TO RI-TERM-TABLE.                                     02981000
029820     IF MIM-7103BALOPT IS EQUAL TO 'C'                            02982000
029830         MOVE WS-COMBINEBAL1 TO WS-RATE-BAL                       02983000
029840         GO TO RI-CHECK-RATE-OPTION.                              02984000
029850     IF MIM-7103BALOPT IS EQUAL TO 'D'                            02985000
029860         MOVE WS-COMBINEBAL2 TO WS-RATE-BAL                       02986000
029870         GO TO RI-CHECK-RATE-OPTION.                              02987000
029880     IF MIM-7103BALOPT IS EQUAL TO 'E'                            02988000
029890         MOVE WS-COMBINEBAL3 TO WS-RATE-BAL                       02989000
029900         GO TO RI-CHECK-RATE-OPTION.                              02990000
029910     IF MIM-7103BALOPT IS EQUAL TO 'F'                            02991000
029920         MOVE WS-COMBINEBAL4 TO WS-RATE-BAL                       02992000
029930         GO TO RI-CHECK-RATE-OPTION.                              02993000
029940     IF MIM-7103BALOPT IS NOT EQUAL TO 'G'                        02994000
029950         GO TO RI-INDIVIDUAL-RATE.                                02995000
029960     MOVE WS-COMBINEBAL1 TO WS-RATE-BAL.                          02996000
029970     IF WS-COMBINEBAL2 IS GREATER THAN WS-RATE-BAL                02997000
029980         MOVE WS-COMBINEBAL2 TO WS-RATE-BAL.                      02998000
029990     IF WS-COMBINEBAL3 IS GREATER THAN WS-RATE-BAL                02999000
030000         MOVE WS-COMBINEBAL3 TO WS-RATE-BAL.                      03000000
030010     IF WS-COMBINEBAL4 IS GREATER THAN WS-RATE-BAL                03001000
030020         MOVE WS-COMBINEBAL4 TO WS-RATE-BAL.                      03002000
030030     GO TO RI-CHECK-RATE-OPTION.                                  03003000
030040 RI-INDIVIDUAL-RATE.                                              03004000
030050     IF WS-REL-ACCTRATEBAL IS NOT NUMERIC                         03005000
030060         GO TO RI-CHECK-RATE-OPTION.                              03006000
030070     IF MIM-7103BALOPT IS EQUAL TO 'I'                            03007000
030080         MOVE WS-REL-ACCTRATEBAL TO WS-RATE-BAL.                  03008000
030090 RI-CHECK-RATE-OPTION.                                            03009000
030100     IF MIM-7103RATEOPT IS EQUAL TO '4'                           03010000
030110         GO TO RI-TERM-BALANCE-TABLE.                             03011000
030120     IF MIM-7103BALORDER IS EQUAL TO 'LE'                         03012000
030130         GO TO RI-TABLE-LOOP-LE.                                  03013000
030140 RI-TABLE-LOOP-GE.                                                03014000
030150     ADD +1 TO WS-SUB3.                                           03015000
030160     IF WS-SUB3 IS GREATER THAN +15                               03016000
030170         MOVE ZERO TO WS-SUB3                                     03017000
030180         GO TO RI-TABLELOOP-GE-CONTD.                             03018000
030190     MOVE MIM-7103RATEAMT (WS-SUB3) TO                            03019000
030200         RPXXX30-RATE-BALANCE (WS-SUB3).                          03020000
030210     MOVE MIM-7103RATEPCT (WS-SUB3) TO RPXXX30-RATE (WS-SUB3).    03021000
P0066      IF MIM-7103RATEPCT (WS-SUB3) IS GREATER THAN ZERO            03021300
P0179          OR MIM-7103RATEAMT (WS-SUB3) IS GREATER THAN ZERO        03021400
P0066          MOVE WS-SUB3 TO RPXXX30-TABLE-OCCURS.                    03021600
030220     GO TO RI-TABLE-LOOP-GE.                                      03022000
030230 RI-TABLELOOP-GE-CONTD.                                           03023000
030240     ADD +1 TO WS-SUB3.                                           03024000
030250     IF WS-SUB3 IS GREATER THAN +15                               03025000
P0022          GO TO RI-END.                                            03026000
030270     IF WS-SUB3 IS EQUAL TO +1                                    03027000
030280         GO TO RI-TABLE-CONT-GE.                                  03028000
030290     IF MIM-7103RATEAMT (WS-SUB3) IS NOT GREATER THAN ZEROS       03029000
P0022          GO TO RI-END.                                            03030000
030310 RI-TABLE-CONT-GE.                                                03031000
030320     IF WS-RATE-BAL IS NOT LESS THAN MIM-7103RATEAMT (WS-SUB3)    03032000
030330         MOVE MIM-7103RATEPCT (WS-SUB3) TO WS-RATE-PCT            03033000
030340         GO TO RI-TABLELOOP-GE-CONTD.                             03034000
P0022      GO TO RI-END.                                                03035000
030360 RI-TABLE-LOOP-LE.                                                03036000
030370     ADD +1 TO WS-SUB3.                                           03037000
030380     IF WS-SUB3 IS GREATER THAN +15                               03038000
030390         MOVE ZERO TO WS-SUB3                                     03039000
030400         GO TO RI-TABLELOOP-LE-CONTD.                             03040000
030410     MOVE MIM-7103RATEAMT (WS-SUB3) TO                            03041000
030420         RPXXX30-RATE-BALANCE (WS-SUB3).                          03042000
030430     MOVE MIM-7103RATEPCT (WS-SUB3) TO RPXXX30-RATE (WS-SUB3).    03043000
P0066      IF MIM-7103RATEPCT (WS-SUB3) IS GREATER THAN ZERO            03043300
P0179          OR MIM-7103RATEAMT (WS-SUB3) IS GREATER THAN ZERO        03043400
P0066          MOVE WS-SUB3 TO RPXXX30-TABLE-OCCURS.                    03043600
030440     GO TO RI-TABLE-LOOP-LE.                                      03044000
030450 RI-TABLELOOP-LE-CONTD.                                           03045000
030460     ADD +1 TO WS-SUB3.                                           03046000
030470     IF WS-SUB3 IS GREATER THAN +15                               03047000
P0022          GO TO RI-END.                                            03048000
030490     IF WS-RATE-BAL IS NOT GREATER THAN MIM-7103RATEAMT (WS-SUB3) 03049000
030500         MOVE MIM-7103RATEPCT (WS-SUB3) TO WS-RATE-PCT            03050000
P0022          GO TO RI-END.                                            03051000
030520     GO TO RI-TABLELOOP-LE-CONTD.                                 03052000
030530 RI-SPLIT-RATE-TABLE.                                             03053000
030540     ADD +1 TO WS-SUB3.                                           03054000
030550     MOVE MIM-7103RATEAMT (WS-SUB3) TO                            03055000
030560         RPXXX30-RATE-BALANCE (WS-SUB3).                          03056000
030570     MOVE MIM-7103RATEPCT (WS-SUB3) TO RPXXX30-RATE (WS-SUB3).    03057000
P0066      IF MIM-7103RATEPCT (WS-SUB3) IS GREATER THAN ZERO            03057300
P0179          OR MIM-7103RATEAMT (WS-SUB3) IS GREATER THAN ZERO        03057400
P0066          MOVE WS-SUB3 TO RPXXX30-TABLE-OCCURS.                    03057600
030580     IF WS-SUB3 IS LESS THAN +15                                  03058000
030590         GO TO RI-SPLIT-RATE-TABLE.                               03059000
030600     GO TO RI-EXIT.                                               03060000
030610 RI-TERM-TABLE.                                                   03061000
030620     ADD +1 TO WS-SUB3.                                           03062000
030630     IF WS-SUB3 IS GREATER THAN +15                               03063000
030640         MOVE ZERO TO WS-SUB3                                     03064000
030650         GO TO RI-TERMTABLE-CONTD.                                03065000
030660     MOVE MIM-7103TERM (WS-SUB3) TO RPXXX30-RATE-TERM (WS-SUB3).  03066000
030670     MOVE MIM-7103RATEPCT (WS-SUB3) TO RPXXX30-RATE (WS-SUB3).    03067000
P0066      IF MIM-7103RATEPCT (WS-SUB3) IS GREATER THAN ZERO            03067300
P0179          OR MIM-7103TERM (WS-SUB3) IS GREATER THAN ZERO           03067400
P0066          MOVE WS-SUB3 TO RPXXX30-TABLE-OCCURS.                    03067600
030680     GO TO RI-TERM-TABLE.                                         03068000
030690 RI-TERMTABLE-CONTD.                                              03069000
030700     ADD +1 TO WS-SUB3.                                           03070000
030710     IF WS-SUB3 IS GREATER THAN +15                               03071000
P0022          GO TO RI-END.                                            03072000
030730     IF WS-TERM IS NOT GREATER THAN MIM-7103TERM (WS-SUB3)        03073000
030740         MOVE MIM-7103RATEPCT (WS-SUB3) TO WS-RATE-PCT            03074000
P0022          GO TO RI-END.                                            03075000
030760     GO TO RI-TERMTABLE-CONTD.                                    03076000
030770 RI-TERM-BALANCE-TABLE.                                           03077000
030780     MOVE WS-REL-TERM TO WS-TERM.                                 03078000
P0022      MOVE ZEROS TO WS-SUB3.                                       03079000
P0022      MOVE ZEROS TO WS-7114-SUB.                                   03079290
030800 RI-TERM-LOOP.                                                    03080000
030810     ADD +1 TO WS-7114-SUB.                                       03081000
P0022      IF WS-7114-SUB IS GREATER THAN +99                           03082000
P0022          GO TO RI-END.                                            03082590
030840     IF WS-7114-WORK-RATETABLE (WS-7114-SUB) IS EQUAL TO SPACES   03084000
030850         AND WS-7114-SUB IS EQUAL TO +1                           03085000
P0022          GO TO RI-END.                                            03086000
030870     IF WS-7114-WORK-RATETABLE (WS-7114-SUB) IS EQUAL TO SPACES   03087000
030880         AND WS-7114-SUB IS GREATER THAN +1                       03088000
030890         SUBTRACT +1 FROM WS-7114-SUB                             03089000
030900         MOVE WS-7114-WORK-RPMIM7114 (WS-7114-SUB) TO MIM-REC7114 03090000
P0022          GO TO RI-TERM-BAL-MOVE.                                  03091000
030920     MOVE WS-7114-WORK-RPMIM7114 (WS-7114-SUB) TO MIM-REC7114.    03092000
030930     IF WS-TERM IS GREATER THAN WS-7114-WORK-TERM (WS-7114-SUB)   03093000
030940         GO TO RI-TERM-LOOP.                                      03094000
P0022  RI-TERM-BAL-MOVE.                                                03094100
P0022      ADD +1 TO WS-SUB3.                                           03094200
P0022      IF WS-SUB3 IS GREATER THAN +15                               03094300
P0022          MOVE ZERO TO WS-SUB3                                     03094400
P0022          GO TO RI-TERM-BAL-ORDER.                                 03094500
P0022      MOVE MIM-7114RATEAMT (WS-SUB3) TO                            03094600
P0022          RPXXX30-RATE-BALANCE (WS-SUB3).                          03094700
P0022      MOVE MIM-7114RATEPCT (WS-SUB3) TO RPXXX30-RATE (WS-SUB3).    03094800
P0066      IF MIM-7114RATEPCT (WS-SUB3) IS GREATER THAN ZERO            03094830
P0179          OR MIM-7114RATEAMT (WS-SUB3) IS GREATER THAN ZERO        03094840
P0066          MOVE WS-SUB3 TO RPXXX30-TABLE-OCCURS.                    03094860
P0022      GO TO RI-TERM-BAL-MOVE.                                      03094900
030950 RI-TERM-BAL-ORDER.                                               03095000
030960     IF MIM-7103BALORDER IS EQUAL TO 'LE'                         03096000
030970         GO TO RI-TABLE-LOOP-LE.                                  03097000
030980 RI-TERM-BAL-GE.                                                  03098000
030990     ADD +1 TO WS-SUB3.                                           03099000
031000     IF WS-SUB3 IS GREATER THAN +15                               03100000
P0022          GO TO RI-END.                                            03101000
031020     IF WS-SUB3 IS EQUAL TO +1                                    03102000
031030         GO TO RI-TERM-BAL-GE-CONT.                               03103000
031040     IF MIM-7114RATEAMT (WS-SUB3) IS NOT GREATER THAN ZEROS       03104000
P0022          GO TO RI-END.                                            03105000
031060 RI-TERM-BAL-GE-CONT.                                             03106000
031070     IF WS-RATE-BAL IS NOT LESS THAN MIM-7114RATEAMT (WS-SUB3)    03107000
031080         MOVE MIM-7114RATEPCT (WS-SUB3) TO WS-RATE-PCT            03108000
031090         GO TO RI-TERM-BAL-GE.                                    03109000
P0022      GO TO RI-END.                                                03110000
031110 RI-TERM-BAL-LE.                                                  03111000
031120     ADD +1 TO WS-SUB3.                                           03112000
031130     IF WS-SUB3 IS GREATER THAN +15                               03113000
P0022          GO TO RI-END.                                            03114000
031150     IF WS-RATE-BAL IS NOT GREATER THAN MIM-7114RATEAMT (WS-SUB3) 03115000
031160         MOVE MIM-7114RATEPCT (WS-SUB3) TO WS-RATE-PCT            03116000
P0022          GO TO RI-END.                                            03117000
P0066      IF MIM-7114RATEPCT (WS-SUB3) IS GREATER THAN ZERO            03117300
P0179          OR MIM-7114RATEAMT (WS-SUB3) IS GREATER THAN ZERO        03117400
P0066          MOVE WS-SUB3 TO RPXXX30-TABLE-OCCURS.                    03117600
031180     GO TO RI-TERM-BAL-LE.                                        03118000
P0022  RI-END.                                                          03119000
031200     MOVE WS-RATE-PCT TO RPXXX30-VALID-RATE.                      03120000
P0084      MOVE WS-RATE-BAL TO RPXXX30-TRATE-BAL.                       03120300
P0084      MOVE WS-TERM TO RPXXX30-TRATE-TERM.                          03120600
031210 RI-EXIT.                                                         03121000
031220     EXIT.                                                        03122000
031230******************************************************************03123000
031240 CALL-RCIF SECTION.                                               03124000
031250 CR-START.                                                        03125000
P0156      MOVE ZEROS TO WS-SUB4.                                       03125500
031260     MOVE WS-INTRFACE (47) TO SR-060CALLNAME.                     03126000
031270     MOVE SPACES TO WS-FUNCTION.                                  03127000
031280     MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST.          03128000
031290     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPRF21-BASE-ACCT-PRODCODE. 03129000
031300     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPRF21-BASE-ACCT.           03130000
031310     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          03131000
031320     MOVE SPACES TO RPRF21-BASE-CUSTOMER.                         03132000
031330     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     03133000
031340         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        03134000
031350         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    03135000
031360     IF WS-PRIM-CUST-EXISTS IS NOT EQUAL TO 'Y'                   03136000
031370         MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-CUST-INST       03137000
031380         MOVE WS-RPXXX30-CUST-TYPE (1) TO RPRF21-BASE-CUST-TYPE   03138000
031390         MOVE WS-RPXXX30-CUST-KEY (1) TO RPRF21-BASE-CUST         03139000
P0110          MOVE WS-RPXXX30-REL-CODE (1) TO RPRF21-REL               03139100
P0082          IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                 03139200
P0082              MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-CUST-INST 03139400
P0082          END-IF                                                   03139600
P0110          GO TO CR-PRIM-RELCODE.                                   03140000
031410     MOVE 'R' TO RPRF21-FUNC.                                     03141000
031420     EXEC CICS LINK                                               03142000
031430         PROGRAM('RPO0RF21')                                      03143000
031440         COMMAREA(RPRF21-MESSAGE)                                 03144000
031450         LENGTH(LENGTH OF RPRF21-MESSAGE)                         03145000
031460         RESP(WS-CICS-RESPONSE)                                   03146000
031470         END-EXEC.                                                03147000
031480     IF RPRF21-FUNCTION IS EQUAL TO 'N'                           03148000
031490         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          03149000
031500         MOVE SPACES TO RPRF21-NAME                               03150000
031510         GO TO CR-EXIT.                                           03151000
031520     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     03152000
031530         MOVE RPRF21-FUNCTION TO WS-FUNCTION                      03153000
031540         GO TO CR-EXIT.                                           03154000
P0110  CR-PRIM-RELCODE.                                                 03154050
P0110      MOVE SPACES TO WS-PRIMRELCD-OPTION.                          03154100
P0110      MOVE RPRF21-REL TO WS-RPW007-RELNBR.                         03154150
P0110      PERFORM VALIDATE-PRIM-RELCD.                                 03154200
P0110      IF WS-PRIMRELCD-ERROR IS EQUAL TO 'Y'                        03154250
P0110          MOVE ZEROS TO WS-SUBADD                                  03154300
P0110          MOVE SPACE TO WS-RF21-RETURN                             03154350
P0110          MOVE SPACES TO WS-LAST-PRODCD                            03154400
P0110          MOVE SPACES TO WS-RPMIM2023PRODCD                        03154450
P0110          GO TO CR-SECONDARY-CUST-ACCOUNTS.                        03154500
P0156 *    MOVE RPXXX30-PRIMARY-INST TO WS-SEC-INST (1).                03154550
P0156 *    MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-SEC-PRODCD (1).         03154590
P0156 *    MOVE RPXXX30-PRIMARY-ACCT-NBR TO WS-SEC-ACCT (1).            03154630
P0156 *    MOVE RPRF21-REL TO WS-SEC-RELNBR (1).                        03154670
P0156 *    MOVE RPRF21-REL TO WS-SEC-PRIMCUSTRELNBR (1).                03154710
P0156 *    MOVE 'N' TO WS-SEC-QUAL (1).                                 03154750
P0156 *    MOVE +1 TO WS-SUB4.                                          03154790
031550 CR-GET-CAC.                                                      03155000
031560     MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE.                    03156000
031570     MOVE ZEROS TO RPRF21-BASE-ACCT.                              03157000
031590     MOVE ZEROS TO WS-SUBADD.                                     03159000
031600 CR-GET-RCIF-INFO.                                                03160000
031610     MOVE SPACE TO WS-RF21-RETURN.                                03161000
031620     MOVE SPACES TO WS-LAST-PRODCD.                               03162000
031630     MOVE SPACES TO WS-RPMIM2023PRODCD.                           03163000
031640     MOVE SPACES TO WS-FUNCTION.                                  03164000
031650     IF RPXXX30-PRIMARY-MODEL IS EQUAL TO SPACES                  03165000
031660         MOVE 'N' TO RPRF21-CLOSEDACCTOPT                         03166000
031670     ELSE                                                         03167000
031680         MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.      03168000
031690     MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST.          03169000
031700     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     03170000
031710         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        03171000
031720         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    03172000
031730     MOVE 'N' TO RPRF21-FUNC.                                     03173000
031740     EXEC CICS LINK                                               03174000
031750         PROGRAM(SR-060CALLNAME)                                  03175000
031760         COMMAREA(RPRF21-MESSAGE)                                 03176000
031770         LENGTH(LENGTH OF RPRF21-MESSAGE)                         03177000
031780         NOHANDLE                                                 03178000
031790         END-EXEC.                                                03179000
031800     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     03180000
031810         MOVE RPRF21-FUNCTION TO WS-FUNCTION                      03181000
031820         GO TO CR-SECONDARY-CUST-ACCOUNTS.                        03182000
031830     MOVE RPRF21-RETURN TO WS-RF21-RETURN.                        03183000
031840     MOVE RPRF21-RETURNED-OBJECT TO WS-CAC-TABLE.                 03184000
031850     MOVE ZEROS TO WS-SUB3.                                       03185000
031860 CR-CHECK-PRODCODE.                                               03186000
031870     ADD +1 TO WS-SUB3.                                           03187000
031880     IF WS-SUB3 IS GREATER THAN WS-CAC-MAX                        03188000
031890         GO TO CR-CHECK-MORE-SEC.                                 03189000
031900     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO SPACES                03190000
031910         GO TO CR-SECONDARY-CUST-ACCOUNTS.                        03191000
031920     IF WS-CAC-ACCT (WS-SUB3) IS EQUAL TO SPACES                  03192000
031930         GO TO CR-CHECK-PRODCODE.                                 03193000
031940     MOVE WS-CAC-INST (WS-SUB3) TO WS-SUBINST.                    03194000
P0022      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     03195000
P0022          AND WS-2024-EXISTS (WS-SUBINST) IS NOT EQUAL TO 'Y'      03195490
P0022          GO TO CR-CHECK-PRODCODE.                                 03195980
031970     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-LAST-PRODCD        03197000
031980         GO TO CR-VALID-SECACCT.                                  03198000
031990     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-RPMIM2023PRODCD    03199000
032000         GO TO CR-CHECK-PRODCODE.                                 03200000
032010     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-RPMIM2023PRODCD.          03201000
032020     PERFORM SEARCH-RPS-2023.                                     03202000
032030     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         03203000
032040         GO TO CR-CHECK-PRODCODE.                                 03204000
032050     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-LAST-PRODCD.              03205000
032060 CR-VALID-SECACCT.                                                03206000
032070     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO                       03207000
032080             RPXXX30-PRIMARY-PROD-CODE                            03208000
032090         AND WS-CAC-ACCT (WS-SUB3) IS EQUAL TO                    03209000
032100             RPXXX30-PRIMARY-ACCT-NBR                             03210000
032110         AND WS-CAC-INST (WS-SUB3) IS EQUAL TO                    03211000
032120             RPXXX30-PRIMARY-INST                                 03212000
P0045          MOVE WS-CAC-RELNBR (WS-SUB3) TO WS-SAVE-PRIM-RELCD       03212500
032130         GO TO CR-CHECK-PRODCODE.                                 03213000
032140     ADD +1 TO WS-SUB4.                                           03214000
032150     IF WS-SUB4 IS GREATER THAN WS-SECONDARY-MAX                  03215000
032160         GO TO CR-CHECK-PRODCODE.                                 03216000
032170     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SEC-PRODCD (WS-SUB4).     03217000
032180     MOVE WS-2023-INTAPPL (INDX-2023) TO WS-SEC-APPL (WS-SUB4).   03218000
032190     MOVE WS-2023-RPOPTION (INDX-2023) TO WS-SEC-RPOPT (WS-SUB4). 03219000
032200     MOVE ZEROS TO WS-SEC-BRANCH (WS-SUB4).                       03220000
032210     MOVE ZEROS TO WS-SEC-TYPE (WS-SUB4).                         03221000
032220     MOVE WS-CAC-INST (WS-SUB3) TO WS-SEC-INST (WS-SUB4).         03222000
032230     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SEC-ACCT (WS-SUB4).         03223000
032240     MOVE WS-CAC-RELNBR (WS-SUB3) TO WS-SEC-RELNBR (WS-SUB4).     03224000
P0110      MOVE ZEROS TO WS-SEC-PRIMCUSTRELNBR (WS-SUB4).               03225000
032260     GO TO CR-CHECK-PRODCODE.                                     03226000
032270 CR-CHECK-MORE-SEC.                                               03227000
032280     IF WS-RF21-RETURN IS NOT EQUAL TO 'M'                        03228000
032290         GO TO CR-SECONDARY-CUST-ACCOUNTS.                        03229000
P0110      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     03230000
P0110          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        03230090
P0110          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST     03230180
P0110      ELSE                                                         03230270
P0110          MOVE WS-CAC-INST (WS-CAC-MAX) TO RPRF21-BASE-ACCT-INST.  03230360
032310     MOVE WS-CAC-PRODCD (WS-CAC-MAX) TO RPRF21-BASE-ACCT-PRODCODE.03231000
032320     MOVE WS-CAC-ACCT (WS-CAC-MAX) TO RPRF21-BASE-ACCT.           03232000
032330     IF RPXXX30-PRIMARY-MODEL IS EQUAL TO SPACES                  03233000
032340         MOVE 'N' TO RPRF21-CLOSEDACCTOPT                         03234000
032350     ELSE                                                         03235000
032360         MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.      03236000
032370     GO TO CR-GET-RCIF-INFO.                                      03237000
032380 CR-SECONDARY-CUST-ACCOUNTS.                                      03238000
P0110      IF WS-PRIMRELCD-SKIP IS EQUAL TO 'Y'                         03238300
P0110          GO TO CR-EXIT.                                           03238600
032390     PERFORM GET-MY-SECONDARY-ACCOUNTS.                           03239000
032400 CR-EXIT.                                                         03240000
032410     EXIT.                                                        03241000
032420******************************************************************03242000
032430 GET-MY-SECONDARY-ACCOUNTS SECTION.                               03243000
032440* ***********************************************************     03244000
032450*   THE PURPOSE OF THIS SECTION IS TO FIND THE ACCOUNTS           03245000
032460*   BELONGING TO SECONDARY CUSTOMERS OF THE PRIMARY ACCOUNT       03246000
032470*   AND ADD THESE ADDITIONAL ACCOUNTS TO THE TABLE                03247000
032480*   OF ACCOUNTS FROM THE PRIMARY CUSTOMER                         03248000
032490* ***********************************************************     03249000
032500 GM-START.                                                        03250000
032510     MOVE WS-SUB4 TO WS-PRIMCUSTACCT-END.                         03251000
P0110      MOVE ZEROS TO WS-NUMOFSECCUSTS.                              03251500
032520     MOVE ZERO TO WS-SECTABLE.                                    03252000
032530     MOVE SPACES TO WS-FUNCTION.                                  03253000
032540     MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST.          03254000
032550     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     03255000
032560         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        03256000
032570         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    03257000
032580     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPRF21-BASE-ACCT-PRODCODE. 03258000
032590     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPRF21-BASE-ACCT.           03259000
032600     MOVE SPACES TO RPRF21-BASE-CUSTOMER.                         03260000
032610 GM-SEC-AGAIN.                                                    03261000
032620     IF RPXXX30-PRIMARY-MODEL IS EQUAL TO SPACES                  03262000
032630         MOVE 'N' TO RPRF21-CLOSEDACCTOPT                         03263000
032640     ELSE                                                         03264000
032650         MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.      03265000
032660     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     03266000
032670         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        03267000
032680         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    03268000
032690     MOVE 'X' TO RPRF21-FUNC.                                     03269000
032700     EXEC CICS LINK                                               03270000
032710         PROGRAM(SR-060CALLNAME)                                  03271000
032720         COMMAREA(RPRF21-MESSAGE)                                 03272000
032730         LENGTH(LENGTH OF RPRF21-MESSAGE)                         03273000
032740         NOHANDLE                                                 03274000
032750         END-EXEC.                                                03275000
032760     MOVE 'N' TO WS-MORE-SECONDARYCUST.                           03276000
032770     IF RPRF21-RETURN IS EQUAL TO 'M'                             03277000
032780         MOVE 'Y' TO WS-MORE-SECONDARYCUST                        03278000
032790         MOVE SPACE TO RPRF21-RETURN.                             03279000
032800*                                                                 03280000
032810     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     03281000
032820         GO TO GM-CHECK-ADDL-CUSTOMERS.                           03282000
032830*  HERE I HAVE THE FIRST GROUP OF SECONDARY CUSTOMERS             03283000
032840     MOVE RPRF21-RETURNED-OBJECT TO WS-ACC-TABLE.                 03284000
032850 GM-CHECK-ADDL-CUSTOMERS.                                         03285000
032860     PERFORM CHECK-FOR-ADDITIONAL-CUSTOMERS.                      03286000
032870     IF WS-SUB7 IS GREATER THAN +1                                03287000
032880         MOVE 'Y' TO WS-MORE-SECONDARYCUST.                       03288000
032890     MOVE +1 TO WS-SECCUSTSUB.                                    03289000
032900 GM-LOAD-SECONDARY.                                               03290000
032910     IF WS-SECCUSTSUB IS GREATER THAN WS-ACC-MAX                  03291000
032920         AND WS-MORE-SECONDARYCUST IS EQUAL TO 'Y'                03292000
032930         MOVE WS-ACC-CUST (WS-ACC-MAX) TO RPRF21-BASE-CUST        03293000
032940         MOVE WS-ACC-CUST-TYPE (WS-ACC-MAX) TO                    03294000
032950         RPRF21-BASE-CUST-TYPE                                    03295000
032960         MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST       03296000
032970         MOVE RPXXX30-PRIMARY-PROD-CODE TO                        03297000
032980             RPRF21-BASE-ACCT-PRODCODE                            03298000
032990         MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPRF21-BASE-ACCT        03299000
033000         MOVE WS-ACC-INST (WS-ACC-MAX) TO WS-NEXTCINST            03300000
033010         MOVE WS-ACC-CUST-TYPE (WS-ACC-MAX) TO WS-NEXTCTYPE       03301000
033020         MOVE WS-ACC-CUST (WS-ACC-MAX) TO WS-NEXTCCUST            03302000
033030         MOVE WS-ACC-PRIM (WS-ACC-MAX) TO WS-NEXTPRIM             03303000
033040         MOVE WS-ACC-RELNBR (WS-ACC-MAX) TO WS-NEXTRELN           03304000
033050         MOVE 'M' TO RPRF21-RETURN                                03305000
033060         MOVE WS-NEXTACC TO RPRF21-RETURNED-OBJECT                03306000
033070         GO TO GM-SEC-AGAIN.                                      03307000
033080* **                                                              03308000
033090     IF WS-SECCUSTSUB IS GREATER THAN WS-ACC-MAX                  03309000
033100         AND WS-MORE-SECONDARYCUST IS EQUAL TO 'N'                03310000
033110         GO TO GM-MORE-ACCTS.                                     03311000
033120* ** DONE LOADING CUSTOMERS NOW GET ACCOUNTS                      03312000
033130     IF WS-ACC-CUST (WS-SECCUSTSUB) IS EQUAL TO SPACES            03313000
033140         AND                                                      03314000
033150         WS-ACC-INST (WS-SECCUSTSUB) IS EQUAL TO ZEROS            03315000
033160         GO TO GM-MORE-ACCTS.                                     03316000
033170* ** EXCLUDE PRIMARY CUSTOMER                                     03317000
033180     IF WS-ACC-PRIM (WS-SECCUSTSUB) IS EQUAL TO ZERO              03318000
033190         ADD +1 TO WS-SECCUSTSUB                                  03319000
033200         GO TO GM-LOAD-SECONDARY.                                 03320000
033210* ** DONE LOADING CUSTOMERS NOW GET ACCOUNTS                      03321000
P0110 * ** CHECK FOR ADJUSTMENT BY RELATE CODE                          03321100
P0110      IF WS-PRIMRELCD-SKIP IS EQUAL TO 'Y'                         03321200
P0110          GO TO GM-LOAD-SEC-CUST.                                  03321300
P0110      MOVE WS-ACC-RELNBR (WS-SECCUSTSUB) TO WS-VALIDREL.           03321400
P0110      PERFORM CHECK-SECCUSTACCT-RELNBR.                            03321500
P0110      IF WS-BADRELNBR IS EQUAL TO 'Y'                              03321600
P0110          ADD +1 TO WS-SECCUSTSUB                                  03321700
P0110          GO TO GM-LOAD-SECONDARY.                                 03321800
P0110      ADD +1 TO WS-NUMOFSECCUSTS.                                  03321900
033220* **                                                              03322000
033230 GM-LOAD-SEC-CUST.                                                03323000
033240     ADD +1 TO WS-SECTABLE.                                       03324000
033250* **                                                              03325000
033260* ** MAXIMUM 198 CUSTOMERS                                        03326000
033270* **                                                              03327000
033280     IF WS-SECTABLE IS GREATER THAN WS-SECCUSTMAX                 03328000
033290         MOVE WS-SECCUSTMAX TO WS-SECTABLE                        03329000
033300         GO TO GM-MORE-ACCTS.                                     03330000
033310     MOVE WS-ACC-INST (WS-SECCUSTSUB)                             03331000
033320         TO WS-SECUST-INST (WS-SECTABLE).                         03332000
033330     MOVE WS-ACC-CUST-TYPE (WS-SECCUSTSUB)                        03333000
033340         TO WS-SECUST-CUST-TYPE (WS-SECTABLE).                    03334000
033350     MOVE WS-ACC-CUST (WS-SECCUSTSUB)                             03335000
033360         TO WS-SECUST-CUST (WS-SECTABLE).                         03336000
033370     MOVE WS-ACC-PRIM (WS-SECCUSTSUB)                             03337000
033380         TO WS-SECUST-PRIM (WS-SECTABLE).                         03338000
033390     MOVE WS-ACC-RELNBR (WS-SECCUSTSUB)                           03339000
033400         TO WS-SECUST-RELNBR (WS-SECTABLE).                       03340000
033410     ADD 1 TO WS-SECCUSTSUB.                                      03341000
033420     GO TO GM-LOAD-SECONDARY.                                     03342000
033430* **                                                              03343000
033440 GM-MORE-ACCTS.                                                   03344000
033450     MOVE ZERO TO WS-SECCUSTSUB.                                  03345000
033460 GM-FIND-SEC-ACCTS.                                               03346000
033470     ADD 1 TO WS-SECCUSTSUB.                                      03347000
033480     IF WS-SECCUSTSUB IS GREATER THAN WS-SECTABLE                 03348000
033490         GO TO GM-END.                                            03349000
033500     IF WS-SECCUSTSUB IS GREATER THAN WS-SECMAX                   03350000
033510         GO TO GM-END.                                            03351000
033520     MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST.          03352000
P0186      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     03352200
P0186          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        03352400
P0186          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    03352600
033530     MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE.                    03353000
033540     MOVE ZEROS TO RPRF21-BASE-ACCT.                              03354000
033550     MOVE WS-SECUST-INST (WS-SECCUSTSUB)                          03355000
033560         TO RPRF21-BASE-CUST-INST.                                03356000
P0186      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     03356200
P0186          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        03356400
P0186          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-CUST-INST.    03356600
033570     MOVE WS-SECUST-CUST-TYPE (WS-SECCUSTSUB)                     03357000
033580         TO RPRF21-BASE-CUST-TYPE.                                03358000
033590     MOVE WS-SECUST-CUST (WS-SECCUSTSUB)                          03359000
033600         TO RPRF21-BASE-CUST.                                     03360000
033610 GM-MORE-SECONDARY-ACCTS.                                         03361000
033620     MOVE 'N' TO RPRF21-FUNC.                                     03362000
033630     EXEC CICS LINK                                               03363000
033640         PROGRAM(SR-060CALLNAME)                                  03364000
033650         COMMAREA(RPRF21-MESSAGE)                                 03365000
033660         LENGTH(LENGTH OF RPRF21-MESSAGE)                         03366000
033670         NOHANDLE                                                 03367000
033680         END-EXEC.                                                03368000
033690     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     03369000
033700         MOVE RPRF21-FUNCTION TO WS-FUNCTION                      03370000
033710         GO TO GM-FIND-SEC-ACCTS.                                 03371000
033720* ** A BAD RETURN CODE FROM GET ACCOUNTS GO TO NEXT CUSTOMER      03372000
033730     MOVE RPRF21-RETURNED-OBJECT TO WS-CAC-TABLE.                 03373000
033740     MOVE ZEROS TO WS-SUB3.                                       03374000
033750 GM-CHECK-PRODCODE.                                               03375000
033760     ADD +1 TO WS-SUB3.                                           03376000
033770     IF WS-SUB3 IS GREATER THAN WS-CAC-MAX                        03377000
033780         GO TO GM-CHECK-MORE-SEC.                                 03378000
033790     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO SPACES                03379000
033800         GO TO GM-CHECK-MORE-SEC.                                 03380000
033810     IF WS-CAC-ACCT (WS-SUB3) IS EQUAL TO SPACES                  03381000
033820         GO TO GM-CHECK-MORE-SEC.                                 03382000
033830     MOVE WS-CAC-INST (WS-SUB3) TO WS-SUBINST.                    03383000
P0022      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     03384000
P0022          AND WS-2024-EXISTS (WS-SUBINST) IS NOT EQUAL TO 'Y'      03384490
P0022          GO TO GM-CHECK-PRODCODE.                                 03384980
033860     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-LAST-PRODCD        03386000
033870         GO TO GM-VALID-SECACCT.                                  03387000
033880     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-RPMIM2023PRODCD    03388000
033890         GO TO GM-VALID-SECACCT.                                  03389000
033900     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-RPMIM2023PRODCD.          03390000
033910     PERFORM SEARCH-RPS-2023.                                     03391000
033920     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         03392000
033930         GO TO GM-CHECK-PRODCODE.                                 03393000
P0186      MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-LAST-PRODCD.              03393500
033940 GM-VALID-SECACCT.                                                03394000
033950     MOVE WS-CAC-INST (WS-SUB3) TO WS-DUPINST.                    03395000
033960     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-DUPPRODCD.                03396000
033970     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-DUPACCOUNT.                 03397000
P0110      MOVE 'N' TO WS-DUPSECACCT.                                   03398000
P0110      IF (MIM-7101CUSTRELCD-Q IS EQUAL TO 'B'                      03398190
P0110          OR MIM-7101CUSTRELCD-Q IS EQUAL TO 'E')                  03398380
P0110          AND MIM-7101CUSTRELCD IS NOT EQUAL TO SPACES             03398570
P0110          GO TO GM-VALID-ADD.                                      03398760
P0110      PERFORM GM-CHECKFORDUP.                                      03398950
034000     IF WS-DUPSECACCT IS EQUAL TO 'Y'                             03400000
034010         GO TO GM-CHECK-PRODCODE.                                 03401000
034020* ****************************************************            03402000
034030 GM-VALID-ADD.                                                    03403000
034040     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO                       03404000
034050             RPXXX30-PRIMARY-PROD-CODE                            03405000
034060         AND WS-CAC-ACCT (WS-SUB3) IS EQUAL TO                    03406000
034070             RPXXX30-PRIMARY-ACCT-NBR                             03407000
034080         AND WS-CAC-INST (WS-SUB3) IS EQUAL TO                    03408000
034090             RPXXX30-PRIMARY-INST                                 03409000
034100         GO TO GM-CHECK-PRODCODE.                                 03410000
034110     ADD +1 TO WS-SUB4.                                           03411000
034120     IF WS-SUB4 IS GREATER THAN WS-SECONDARY-MAX                  03412000
034130         GO TO GM-END.                                            03413000
034140* SAVE BEFORE LOAD                                                03414000
034150     ADD +1 TO WS-ALLSEC.                                         03415000
034160     IF WS-ALLSEC IS GREATER THAN WS-SECMAX                       03416000
034170         MOVE WS-SECMAX TO WS-ALLSEC                              03417000
034180         GO TO GM-VALID-AD2.                                      03418000
034190     MOVE WS-CAC-INST (WS-SUB3) TO WS-SECINST (WS-ALLSEC).        03419000
034200     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SECPRODCD (WS-ALLSEC).    03420000
034210     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SECACCOUNT (WS-ALLSEC).     03421000
034220 GM-VALID-AD2.                                                    03422000
034230     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SEC-PRODCD (WS-SUB4).     03423000
034240     MOVE WS-2023-INTAPPL (INDX-2023) TO WS-SEC-APPL (WS-SUB4).   03424000
034250     MOVE WS-2023-RPOPTION (INDX-2023) TO WS-SEC-RPOPT (WS-SUB4). 03425000
034260     MOVE ZEROS TO WS-SEC-BRANCH (WS-SUB4).                       03426000
034270     MOVE ZEROS TO WS-SEC-TYPE (WS-SUB4).                         03427000
034280     MOVE WS-CAC-INST (WS-SUB3) TO WS-SEC-INST (WS-SUB4).         03428000
034290     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SEC-ACCT (WS-SUB4).         03429000
034300     MOVE WS-CAC-RELNBR (WS-SUB3) TO WS-SEC-RELNBR (WS-SUB4).     03430000
P0110      MOVE ZEROS TO WS-SEC-PRIMCUSTRELNBR (WS-SUB4).               03431000
034330     GO TO GM-CHECK-PRODCODE.                                     03433000
034340 GM-CHECK-MORE-SEC.                                               03434000
034350     IF RPRF21-RETURN IS NOT EQUAL TO 'M'                         03435000
034360         GO TO GM-FIND-SEC-ACCTS.                                 03436000
034370* ** CHECK FOR MORE ACCOUNTS FOR THIS SECONDARY CUSTOMER          03437000
P0110      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     03438000
P0110          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        03438090
P0110          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST     03438180
P0110      ELSE                                                         03438270
P0110          MOVE WS-CAC-INST (WS-CAC-MAX) TO RPRF21-BASE-ACCT-INST.  03438360
034390     MOVE WS-CAC-PRODCD (WS-CAC-MAX) TO RPRF21-BASE-ACCT-PRODCODE.03439000
034400     MOVE WS-CAC-ACCT (WS-CAC-MAX) TO RPRF21-BASE-ACCT.           03440000
034410     GO TO GM-MORE-SECONDARY-ACCTS.                               03441000
034420 GM-END.                                                          03442000
034430     MOVE WS-SUB4 TO WS-SECCUSTACCT-END.                          03443000
034440* **                                                              03444000
034450 GM-EXIT.                                                         03445000
034460     EXIT.                                                        03446000
034470* **                                                              03447000
034480 GM-CHECKFORDUP SECTION.                                          03448000
034490* *********************************************************       03449000
034500* DETERMINE IF THE NEW SECONDARY ACCOUNT IS ALREADY               03450000
034510* PART OF THE LIST OF SECONDARY ACCOUNTS                          03451000
034520* *********************************************************       03452000
034530 GM-DUPSTART.                                                     03453000
034540     MOVE +1 TO WS-DUPTEST.                                       03454000
034550     MOVE 'N' TO WS-DUPSECACCT.                                   03455000
034560 GMCFD-START.                                                     03456000
034570     IF WS-DUPTEST IS GREATER THAN WS-SECMAX                      03457000
034580         GO TO GMCFD-EXIT.                                        03458000
034590     IF WS-SEC-ACCT (WS-DUPTEST) IS EQUAL TO SPACE                03459000
034600         GO TO GMCFD-EXIT.                                        03460000
034610     IF WS-DUPINST IS EQUAL TO WS-SEC-INST (WS-DUPTEST)           03461000
034620         AND WS-DUPPRODCD IS EQUAL TO                             03462000
034630             WS-SEC-PRODCD (WS-DUPTEST)                           03463000
034640         AND WS-DUPACCOUNT IS EQUAL TO                            03464000
034650         WS-SEC-ACCT (WS-DUPTEST)                                 03465000
034660         MOVE 'Y' TO WS-DUPSECACCT                                03466000
034670         GO TO GMCFD-EXIT.                                        03467000
034680     ADD +1 TO WS-DUPTEST.                                        03468000
034690     GO TO GMCFD-START.                                           03469000
034700 GMCFD-EXIT.                                                      03470000
034710     EXIT.                                                        03471000
034720******************************************************************03472000
034730 CHECK-SECCUSTACCT-RELNBR SECTION.                                03473000
034740* *********************************************************       03474000
034750* DETERMINE IF THE ACCOUNT SHOULD BE INCLUDED BASED ON            03475000
034760* THE RELATIONSHIP CODE WITH THE PRIMARY ACCOUNT                  03476000
034770* *********************************************************       03477000
034780 CSR-START.                                                       03478000
034790     MOVE +1 TO WS-RELSUB.                                        03479000
034800 CSR-CHECKIT.                                                     03480000
034810     IF WS-RELSUB IS GREATER THAN WS-RELMAX                       03481000
034820         GO TO CSR-NOMATCH.                                       03482000
P0110      IF MIM-7104RLSP (WS-RELSUB) IS EQUAL TO ZEROS                03483000
034840         GO TO CSR-NOMATCH.                                       03484000
P0110      IF WS-VALIDREL IS EQUAL TO MIM-7104RLSP (WS-RELSUB)          03485000
034870         GO TO CSR-MATCH.                                         03487000
034880     ADD +1 TO WS-RELSUB.                                         03488000
034890     GO TO CSR-CHECKIT.                                           03489000
034900 CSR-MATCH.                                                       03490000
034910     IF WS-INCLUDEREL IS EQUAL TO 'Y'                             03491000
034920         MOVE 'N' TO WS-BADRELNBR                                 03492000
034930         GO TO CSR-EXIT.                                          03493000
P0110      MOVE 'Y' TO WS-BADRELNBR.                                    03494000
034950     GO TO CSR-EXIT.                                              03495000
034960 CSR-NOMATCH.                                                     03496000
034970     IF WS-INCLUDEREL IS EQUAL TO 'Y'                             03497000
034980         MOVE 'Y' TO WS-BADRELNBR                                 03498000
034990         GO TO CSR-EXIT.                                          03499000
035000     MOVE 'N' TO WS-BADRELNBR.                                    03500000
035010 CSR-EXIT.                                                        03501000
035020     EXIT.                                                        03502000
035030******************************************************************03503000
035040 CHECK-FOR-ADDITIONAL-CUSTOMERS SECTION.                          03504000
035050 CFAC-START.                                                      03505000
035060     MOVE +0 TO WS-SUB7.                                          03506000
035070     MOVE +0 TO WS-SUB8.                                          03507000
P0015      IF WS-PRIM-CUST-EXISTS IS EQUAL TO 'Y'                       03508000
035090         MOVE +0 TO WS-SUB7                                       03509000
035100     ELSE                                                         03510000
035110         MOVE +1 TO WS-SUB7.                                      03511000
035120 CFAC-RPXXX30-LOOP.                                               03512000
035130     ADD +1 TO WS-SUB7.                                           03513000
035140     IF WS-SUB7 IS GREATER THAN WS-RPXXX30-CSTTBL-MAX             03514000
035150         GO TO CFAC-EXIT.                                         03515000
P0186      IF WS-SUB4 IS NOT LESS THAN WS-SECONDARY-MAX                 03515050
P0186          GO TO CFAC-EXIT.                                         03515100
P0186      IF WS-RPXXX30-CUST-NA (WS-SUB7) IS EQUAL TO SPACES           03515150
P0186          AND WS-RPXXX30-CUST-NO (WS-SUB7) IS EQUAL TO ZEROS       03515200
P0186          AND WS-RPXXX30-REL-CODE (WS-SUB7)                        03515250
P0186              IS NOT EQUAL TO ZEROS                                03515300
P0186          ADD +1 TO WS-NUMOFSECCUSTS                               03515350
P0186          ADD +1 TO WS-SUB4                                        03515400
P0186          MOVE RPXXX30-PRIMARY-INST TO WS-SEC-INST (WS-SUB4)       03515450
P0186          MOVE RPXXX30-PRIMARY-PROD-CODE                           03515500
P0186              TO WS-SEC-PRODCD (WS-SUB4)                           03515550
P0186          MOVE RPXXX30-PRIMARY-ACCT-NBR                            03515600
P0186              TO WS-SEC-ACCT (WS-SUB4)                             03515650
P0186          MOVE WS-RPXXX30-REL-CODE (WS-SUB7)                       03515700
P0186              TO WS-SEC-RELNBR (WS-SUB4)                           03515750
P0186          MOVE WS-RPXXX30-REL-CODE (WS-SUB7)                       03515800
P0186              TO WS-SEC-PRIMCUSTRELNBR (WS-SUB4)                   03515850
P0186          MOVE 'N' TO WS-SEC-QUAL (WS-SUB4)                        03515900
P0186          GO TO CFAC-RPXXX30-LOOP.                                 03515950
035160     IF WS-RPXXX30-CUST-NA (WS-SUB7) IS EQUAL TO SPACES           03516000
P0015          AND WS-RPXXX30-CUST-NO (WS-SUB7) IS EQUAL TO ZEROS       03516500
035170         GO TO CFAC-EXIT.                                         03517000
035180     IF WS-RPXXX30-FOUND-FLAG (WS-SUB7) IS EQUAL TO 'F'           03518000
035190         GO TO CFAC-RPXXX30-LOOP.                                 03519000
035200 CFAC-ACC-LOOP.                                                   03520000
035210     ADD +1 TO WS-SUB8.                                           03521000
035220     IF WS-SUB8 IS GREATER THAN WS-ACC-MAX                        03522000
035230         GO TO CFAC-RPXXX30-LOOP.                                 03523000
035240     IF WS-ACC-CUST (WS-SUB8) IS EQUAL TO SPACES                  03524000
035250         AND WS-RPXXX30-CUST-KEY (WS-SUB7) IS NOT EQUAL TO SPACES 03525000
035260         MOVE RPXXX30-PRIMARY-INST TO WS-ACC-INST (WS-SUB8)       03526000
035270         MOVE WS-RPXXX30-CUST-TYPE (WS-SUB7)                      03527000
035280             TO WS-ACC-CUST-TYPE (WS-SUB8)                        03528000
035290         MOVE WS-RPXXX30-REL-CODE (WS-SUB7)                       03529000
035300             TO WS-ACC-RELNBR (WS-SUB8)                           03530000
035310         MOVE WS-RPXXX30-CUST-KEY (WS-SUB7)                       03531000
035320             TO WS-ACC-CUST (WS-SUB8)                             03532000
035330         MOVE '1' TO WS-ACC-PRIM (WS-SUB8).                       03533000
035340     IF WS-ACC-CUST (WS-SUB8) IS EQUAL TO SPACES                  03534000
035350         GO TO CFAC-RPXXX30-LOOP.                                 03535000
035360     IF WS-RPXXX30-CUST-KEY (WS-SUB7) IS EQUAL TO                 03536000
035370         WS-ACC-CUST (WS-SUB8)                                    03537000
035380         MOVE 'F' TO WS-RPXXX30-FOUND-FLAG (WS-SUB7)              03538000
035390         GO TO CFAC-RPXXX30-LOOP.                                 03539000
035400     GO TO CFAC-ACC-LOOP.                                         03540000
035410 CFAC-EXIT.                                                       03541000
035420     EXIT.                                                        03542000
P0110 ******************************************************************03542200
P0110  VALIDATE-PRIM-RELCD SECTION.                                     03542400
000000 COPY RPP007.                                                     03542600
035430******************************************************************03543000
035440 LOAD-ENTERPRISE-INTERFACE SECTION.                               03544000
035450 LEI-START.                                                       03545000
035460     MOVE HIGH-VALUES TO WS-0237-TABLE.                           03546000
035470     SET INDX-0237 TO +1.                                         03547000
035480     SET INDX-0237 DOWN BY +1.                                    03548000
035490     MOVE SPACES TO MI0237-RECORD.                                03549000
035500     MOVE ZEROS TO MIM-0237KINST.                                 03550000
035510     MOVE +0237 TO MIM-0237KREC.                                  03551000
035520     MOVE 99 TO MIM-0237KPROCMGR.                                 03552000
035530     MOVE 99 TO MIM-0237KINTAPPL.                                 03553000
035540     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    03554000
035550     MOVE MI0237-RECORD TO MIMST-RECORD.                          03555000
035560     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           03556000
035570     GO TO LEI-TEST0237.                                          03557000
035580 LEI-READ0237.                                                    03558000
035590     PERFORM MIC-MST-GET-NEXT-REQUEST.                            03559000
035600 LEI-TEST0237.                                                    03560000
035610     IF WS-FUNCTION IS EQUAL TO 'E'                               03561000
035620         GO TO LEI-EXIT.                                          03562000
035630     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        03563000
035640         MOVE WS-AB6320 TO RPXXX30-ABORT                          03564000
035650         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     03565000
035660         MOVE WS-TR0011 TO RPXXX30-ABTRACE                        03566000
035670         MOVE WS-TR0011 TO RPXXX30-RESP-TRACE                     03567000
035680         GO TO CICS-RETURN.                                       03568000
035690     MOVE MIMST-RECORD TO MI0237-RECORD.                          03569000
035700     IF MIM-0237KINST IS EQUAL TO ZEROS                           03570000
035710         OR MIM-0237KPROCMGR IS NOT EQUAL TO 50                   03571000
035720         OR MIM-0237KINTAPPL IS EQUAL TO ZEROS                    03572000
035730         GO TO LEI-READ0237.                                      03573000
035740     SET INDX-0237 UP BY +1.                                      03574000
035750     IF INDX-0237 IS GREATER THAN WS-0237-MAX                     03575000
035760         MOVE 500625 TO RPXXX30-MSGNBR                            03576000
035770         MOVE 500625 TO RPXXX30-RESP-MSG-NBR                      03577000
035780         GO TO CICS-RETURN.                                       03578000
035790     MOVE MIM-0237KINST TO WS-0237-INST (INDX-0237).              03579000
035800     MOVE MIM-0237KINTAPPL TO WS-0237-APPL (INDX-0237).           03580000
035810     MOVE MIM-237BATINTFC TO WS-0237-INTF (INDX-0237).            03581000
035820     GO TO LEI-READ0237.                                          03582000
035830 LEI-EXIT.                                                        03583000
035840     EXIT.                                                        03584000
035850******************************************************************03585000
035860 FIND-CROSS-INST-INTERFACE SECTION.                               03586000
035870 FCII-START.                                                      03587000
035880     MOVE WS-SEC-INST (WS-SUBSEC) TO WS-0237TEST-INST.            03588000
035890     MOVE WS-SEC-APPL (WS-SUBSEC) TO WS-0237TEST-APPL.            03589000
035900     SEARCH ALL WS-0237-INTRFACE                                  03590000
035910         AT END                                                   03591000
035920             GO TO FCII-EXIT                                      03592000
035930         WHEN WS-0237-KEY (INDX-0237) IS EQUAL TO WS-0237TEST-KEY 03593000
035940             MOVE WS-0237-INTF (INDX-0237) TO SR-060CALLNAME.     03594000
035950 FCII-EXIT.                                                       03595000
035960     EXIT.                                                        03596000
035970******************************************************************03597000
035980 REQUEST-CUSTOMER SECTION.                                        03598000
035990 RC-START.                                                        03599000
036000     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          03600000
036010     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             03601000
036020     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         03602000
036030     EXEC CICS LINK                                               03603000
036040         PROGRAM('RPO0RF21')                                      03604000
036050         COMMAREA(RPRF21-MESSAGE)                                 03605000
036060         LENGTH(LENGTH OF RPRF21-MESSAGE)                         03606000
036070         RESP(WS-CICS-RESPONSE)                                   03607000
036080         END-EXEC.                                                03608000
036090     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         03609000
036100     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     03610000
036110         MOVE 'L' TO WS-FUNCTION                                  03611000
036120         MOVE 500036 TO RPXXX30-RESP-MSG-NBR                      03612000
036130         MOVE 500036 TO RPXXX30-MSGNBR                            03613000
036140         GO TO RC-EXIT.                                           03614000
036150     IF WS-FUNCTION IS EQUAL TO 'B'                               03615000
036160         GO TO RC-EXIT.                                           03616000
036170     IF WS-FUNCTION IS EQUAL TO 'C'                               03617000
036180         MOVE 500037 TO RPXXX30-RESP-MSG-NBR                      03618000
036190         MOVE 500037 TO RPXXX30-MSGNBR                            03619000
036200         GO TO RC-EXIT.                                           03620000
036210     IF WS-FUNCTION IS EQUAL TO 'I'                               03621000
036220         MOVE 500038 TO RPXXX30-MSGNBR                            03622000
036230         MOVE 500038 TO RPXXX30-RESP-MSG-NBR.                     03623000
036240 RC-EXIT.                                                         03624000
036250     EXIT.                                                        03625000
036260******************************************************************03626000
036270 FIND-DEFAULT-MODEL SECTION.                                      03627000
036280 FDM-START.                                                       03628000
036290     MOVE 'N' TO WS-ERRORMODEL.                                   03629000
036300     MOVE RPXXX30-PRIMARY-INST TO RPMST-INST.                     03630000
036310     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPMST-PRODCODE.            03631000
036320     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPMST-ACCOUNT.              03632000
036330     MOVE RPXXX30-PRIMARY-MODEL TO RPMST-MODEL.                   03633000
036340     PERFORM RPS-MST-GET-GE-REQUEST.                              03634000
036350     IF WS-FUNCTION IS EQUAL TO 'N'                               03635000
036360         GO TO FDM-500BAD.                                        03636000
036370     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         03637000
036380         MOVE WS-AB6320 TO RPXXX30-ABORT                          03638000
036390         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     03639000
036400         MOVE WS-TR0012 TO RPXXX30-ABTRACE                        03640000
036410         MOVE WS-TR0012 TO RPXXX30-RESP-TRACE                     03641000
036420         GO TO VK-RETURN.                                         03642000
036430* USE THIS IS THERE IS ONLY ONE                                   03643000
036440     IF RPMST-INST IS EQUAL TO RPXXX30-PRIMARY-INST               03644000
036450         AND RPMST-PRODCODE IS EQUAL TO RPXXX30-PRIMARY-PROD-CODE 03645000
036460         AND RPMST-ACCOUNT IS EQUAL TO RPXXX30-PRIMARY-ACCT-NBR   03646000
036470         GO TO FDM-200.                                           03647000
036480* IF THE FOUND RECORD DOES NOT MATCH SEND MESSAGE                 03648000
036490     GO TO FDM-500BAD.                                            03649000
036500 FDM-200.                                                         03650000
036510     MOVE RPMST-MODEL TO RPXXX30-PRIMARY-MODEL.                   03651000
036520     MOVE RPXXX30-PRIMARY-INST TO WS-SAVEMSTINST.                 03652000
036530     MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-SAVEMSTPRODCODE.        03653000
036540     MOVE RPXXX30-PRIMARY-ACCT-NBR TO WS-SAVEMSTACCOUNT.          03654000
036550     MOVE RPXXX30-PRIMARY-MODEL TO WS-SAVEMSTMODEL.               03655000
036560     PERFORM RPS-MST-GET-NEXT-REQUEST.                            03656000
036570     IF WS-FUNCTION IS EQUAL TO 'E'                               03657000
036580         GO TO FDM-500GOOD.                                       03658000
036590     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         03659000
036600         MOVE WS-AB6320 TO RPXXX30-ABORT                          03660000
036610         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     03661000
036620         MOVE WS-TR0013 TO RPXXX30-ABTRACE                        03662000
036630         MOVE WS-TR0013 TO RPXXX30-RESP-TRACE                     03663000
036640         GO TO VK-RETURN.                                         03664000
036650     IF RPMST-INST IS EQUAL TO RPXXX30-PRIMARY-INST               03665000
036660         AND RPMST-PRODCODE IS EQUAL TO RPXXX30-PRIMARY-PROD-CODE 03666000
036670         AND RPMST-ACCOUNT IS EQUAL TO RPXXX30-PRIMARY-ACCT-NBR   03667000
036680         GO TO FDM-500MULTIPLE.                                   03668000
036690 FDM-500GOOD.                                                     03669000
036700     MOVE WS-SAVEMSTINST TO                                       03670000
036710         RPXXX30-PRIMARY-INST.                                    03671000
036720     MOVE WS-SAVEMSTPRODCODE TO                                   03672000
036730         RPXXX30-PRIMARY-PROD-CODE.                               03673000
036740     MOVE WS-SAVEMSTACCOUNT TO                                    03674000
036750         RPXXX30-PRIMARY-ACCT-NBR.                                03675000
036760     MOVE WS-SAVEMSTMODEL TO                                      03676000
036770         RPXXX30-PRIMARY-MODEL.                                   03677000
036780     GO TO FDM-EXIT.                                              03678000
036790 FDM-500BAD.                                                      03679000
036800     MOVE 'Y' TO WS-ERRORMODEL.                                   03680000
036810     MOVE 500004 TO RPXXX30-RESP-MSG-NBR.                         03681000
036820     MOVE 500004 TO RPXXX30-MSGNBR.                               03682000
036830     GO TO FDM-EXIT.                                              03683000
036840 FDM-500MULTIPLE.                                                 03684000
036850     MOVE 'Y' TO WS-ERRORMODEL.                                   03685000
036860     MOVE 500090 TO RPXXX30-RESP-MSG-NBR.                         03686000
036870     MOVE 500090 TO RPXXX30-MSGNBR.                               03687000
036880     GO TO FDM-EXIT.                                              03688000
036890 FDM-EXIT.                                                        03689000
036900     EXIT.                                                        03690000
036910******************************************************************03691000
036920 GET-BALANCE SECTION.                                             03692000
036930 GB-START.                                                        03693000
036940     MOVE ZEROS TO WS-WORK-BALANCE.                               03694000
036950     IF WS-WORK-COMBBALCD IS EQUAL TO ZEROS                       03695000
036960         OR WS-WORK-COMBBALCD IS GREATER THAN 20                  03696000
036970         GO TO GB-EXIT.                                           03697000
036980     MOVE RPINF00-BAL (WS-WORK-COMBBALCD) TO WS-WORK-BALANCE.     03698000
036990 GB-EXIT.                                                         03699000
037000     EXIT.                                                        03700000
037010******************************************************************03701000
037020 READ-MICM-7101 SECTION.                                          03702000
037030 RM7101-START.                                                    03703000
037040     MOVE SPACES TO WS-FUNCTION.                                  03704000
037050     MOVE SPACES TO MI7101-RECORD.                                03705000
037060     MOVE RPXXX30-PRIMARY-INST TO MIM-7101KINST.                  03706000
037070     MOVE +7101 TO MIM-7101KREC.                                  03707000
037080     MOVE RPXXX30-PRIMARY-MODEL TO MIM-7101KMODEL.                03708000
037090     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        03709000
037100     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        03710000
037110     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    03711000
037120     MOVE MI7101-RECORD TO MIMST-RECORD.                          03712000
037130     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           03713000
037140     MOVE MIMST-RECORD TO MI7101-RECORD.                          03714000
037150     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        03715000
037160         GO TO RM7101-EXIT.                                       03716000
037170     IF MIM-7101KINST IS NOT EQUAL TO RPXXX30-PRIMARY-INST        03717000
037180         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   03718000
037190         OR MIM-7101KMODEL IS NOT EQUAL TO RPXXX30-PRIMARY-MODEL  03719000
037200         MOVE 'N' TO WS-FUNCTION                                  03720000
037210         GO TO RM7101-EXIT.                                       03721000
037220 RM7101-EXIT.                                                     03722000
037230     EXIT.                                                        03723000
037240******************************************************************03724000
037250 READ-MICM-7104 SECTION.                                          03725000
037260 RM7104-START.                                                    03726000
037270     MOVE 'N' TO WS-KEEP-FLAG.                                    03727000
037280     MOVE SPACES TO WS-FUNCTION.                                  03728000
037290     MOVE SPACES TO MI7104-RECORD.                                03729000
037300     MOVE RPXXX30-PRIMARY-INST TO MIM-7104KINST.                  03730000
037310     MOVE +7104 TO MIM-7104KREC.                                  03731000
037320     MOVE MIM-7101CUSTRELCD TO MIM-7104KRPREC.                    03732000
037330     MOVE MIC-RPS-7104-PRI TO MIC-MST-REC-PRI.                    03733000
037340     MOVE MI7104-RECORD TO MIMST-RECORD.                          03734000
037350     PERFORM MIC-MST-GET-REQUEST.                                 03735000
037360     MOVE MIMST-RECORD TO MI7104-RECORD.                          03736000
037370 RM7104-EXIT.                                                     03737000
037380     EXIT.                                                        03738000
P0022 ******************************************************************03739000
P0022  CROSS-INSTITUTION SECTION.                                       03739090
000000 COPY RPP004.                                                     03739180
P0022 ******************************************************************03739270
P0022  CALCULATE-MIL-SECOND SECTION.                                    03739360
000000 COPY RPP005.                                                     03739450
P0022 ******************************************************************03739540
037400 VALIDATE-BRANCH SECTION.                                         03740000
000000 COPY RPP7107A.                                                   03741000
037420******************************************************************03742000
037430 LOAD-RPS-2023 SECTION.                                           03743000
000000 COPY RPP2023A.                                                   03744000
037450******************************************************************03745000
037460 LOAD-RPS-7102 SECTION.                                           03746000
000000 COPY RPP7102A.                                                   03747000
037480******************************************************************03748000
037490 LOAD-RPS-7103 SECTION.                                           03749000
000000 COPY RPP7103A.                                                   03750000
037510******************************************************************03751000
037520 LOAD-RPS-7104 SECTION.                                           03752000
000000 COPY RPP7104A.                                                   03753000
037540******************************************************************03754000
037550 LOAD-RPS-7106 SECTION.                                           03755000
000000 COPY RPP7106A.                                                   03756000
037570******************************************************************03757000
037580 LOAD-RPS-7110 SECTION.                                           03758000
000000 COPY RPP7110.                                                    03759000
037600******************************************************************03760000
037610 LOAD-RPS-7114 SECTION.                                           03761000
000000 COPY RPP7114.                                                    03762000
037630******************************************************************03763000
037640 SEARCH-RPS-2023 SECTION.                                         03764000
000000 COPY RPP2023S.                                                   03765000
037660******************************************************************03766000
037670 SEARCH-RPS-7102 SECTION.                                         03767000
000000 COPY RPP7102S.                                                   03768000
037690******************************************************************03769000
037700 SEARCH-RPS-7103 SECTION.                                         03770000
000000 COPY RPP7103S.                                                   03771000
037720******************************************************************03772000
037730 SEARCH-RPS-7104 SECTION.                                         03773000
000000 COPY RPP7104S.                                                   03774000
037750******************************************************************03775000
037760 SEARCH-RPS-7106 SECTION.                                         03776000
000000 COPY RPP7106S.                                                   03777000
037780******************************************************************03778000
037790 SEARCH-RPS-7110 SECTION.                                         03779000
000000 COPY RPP7110S.                                                   03780000
037810******************************************************************03781000
037820 SEARCH-RPS-7114 SECTION.                                         03782000
000000 COPY RPP7114S.                                                   03783000
037840******************************************************************03784000
000000 COPY RPPACTA.                                                    03785000
037860******************************************************************03786000
000000 COPY RPPBNKA.                                                    03787000
037880******************************************************************03788000
000000 COPY RPPENRA.                                                    03789000
037900******************************************************************03790000
000000 COPY RPPIDXA.                                                    03791000
037920******************************************************************03792000
000000 COPY RPPMSTA.                                                    03792300
P0022 ******************************************************************03792600
000000 COPY RPPRELA.                                                    03793000
037940******************************************************************03794000
000000 COPY RPPTRMA.                                                    03795000
037960******************************************************************03796000
037970 MIC-MST-API SECTION.                                             03797000
000000 COPY MIPMSTA.                                                    03798000
037990******************************************************************03799000
038000 SLP096-GET-2023-RECORD SECTION.                                  03800000
000000 COPY SLP096.                                                     03801000
038020******************************************************************03802000
038030 JULIAN-365 SECTION.                                              03803000
000000 COPY SRP001.                                                     03804000
038050******************************************************************03805000
038060 CALENDAR-365 SECTION.                                            03806000
000000 COPY SRP003.                                                     03807000
038080******************************************************************03808000
038090 NEXT-DATE-365 SECTION.                                           03809000
000000 COPY SRP009.                                                     03810000
038110******************************************************************03811000
038120 CICS-ABORT-EXIT SECTION.                                         03812000
038130 CAE-START.                                                       03813000
038140     GO TO CICS-RETURN.                                           03814000
038150 CAE-EXIT.                                                        03815000
038160     EXIT.                                                        03816000
038170******************************************************************03817000
038180 CICS-RETURN SECTION.                                             03818000
038190     IF COM-ABORT IS NOT EQUAL TO ZERO                            03819000
038200         MOVE COM-ABORT TO RPXXX30-ABORT.                         03820000
038210     IF RPXXX30-ABORT IS NOT EQUAL TO ZERO                        03821000
038220         MOVE WS-VALIDPROGID TO RPXXX30-RESP-PROGRAM              03822000
038230         MOVE WS-FUNCTION TO RPXXX30-FUNCTION                     03823000
038240         MOVE SRB-BMDB TO RPXXX30-SRBMDB                          03824000
038250         MOVE EIBFN TO RPXXX30-ABEIBFN                            03825000
038260         MOVE EIBRESP TO RPXXX30-ABEIBRESP                        03826000
038270         MOVE EIBRESP2 TO RPXXX30-ABEIBRESP2                      03827000
038280         MOVE EIBRCODE TO RPXXX30-ABEIBRCODE.                     03828000
038290     IF RPXXX30-RESP-MSG-NBR IS NOT EQUAL TO ZERO                 03829000
038300         AND RPXXX30-RESP-PROGRAM IS NOT EQUAL TO SPACES          03830000
038310         MOVE WS-VALIDPROGID TO RPXXX30-RESP-PROGRAM.             03831000
000000 COPY SLP709.                                                     03834000
038420******************************************************************03842000
