000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX36.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX36 - REAL TIME PROCESSING                             *00005000
000060*    ADD ACCOUNTS, DELETE ACCOUNTS, DELETE RELATIONSHIPS         *00006000
000070******************************************************************00007000
000080 ENVIRONMENT DIVISION.                                            00008000
000090 DATA DIVISION.                                                   00009000
000100******************************************************************00010000
000110 WORKING-STORAGE SECTION.                                         00011000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00012000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00012001
000130 01  RPS-RLSELIT.                                                 00013000
000000 COPY RPWRLSE.                                                    00014000
000150 01  MIC-RLSELIT.                                                 00015000
000000 COPY MIWRLSE.                                                    00016000
000170 01  SRW079-AREAS.                                                00017000
000000 COPY SRW079.                                                     00018000
000190 01  SRW105-AREAS.                                                00019000
000000 COPY SRW105.                                                     00020000
000210*01  BICRSRB.                                                     00021000
000000 COPY BICRSRB.                                                    00022000
000230*01  BICRPSB.                                                     00023000
000000 COPY BICRPSB.                                                    00024000
000250*01  BICRVERB.                                                    00025000
000000 COPY BICRVERB.                                                   00026000
000270*01  BICRSTAT.                                                    00027000
000000 COPY BICRSTAT.                                                   00028000
000290*01  BICRDBS.                                                     00029000
000000 COPY BICRDBS.                                                    00030000
000310*01  BICRLOG.                                                     00031000
000000 COPY BICRLOG.                                                    00032000
000330 01  SRW710-AREAS.                                                00033000
000000 COPY SRW710.                                                     00034000
000350*----------------------------------------------------------------*00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  WS-MAX-PANEL-ENTRIES    PIC S9(04)      COMP             00037000
000380                                                 VALUE +0009.     00038000
000390     03  COM-ABORT               PIC S9(04)      COMP.            00039000
000400     03  WS-SUB1                 PIC S9(04)      COMP             00040000
000410                                                 VALUE +0000.     00041000
000420     03  WS-SUB2                 PIC S9(04)      COMP             00042000
000430                                                 VALUE +0000.     00043000
P0111      03  WS-NOTPRESENT           PIC X(30)       VALUE            00043300
P0111          'NO CUSTOMER FOUND IN RCIF     '.                        00043600
000440     03  WS-UPDATESW             PIC X(01)       VALUE SPACES.    00044000
000450     03  WS-INTERFACE            PIC X(01)       VALUE SPACES.    00045000
000460     03  WS-UPDATE-RP            PIC X(01)       VALUE SPACES.    00046000
000470     03  WS-ACT-FLAG             PIC X(01)       VALUE SPACES.    00047000
000480     03  WS-SEC-FLAG             PIC X(01)       VALUE SPACES.    00048000
000490     03  WS-KEEP-FLAG            PIC X(01)       VALUE SPACES.    00049000
000500     03  WS-CLOSE-FLAG           PIC X(01)       VALUE SPACES.    00050000
000510     03  WS-OUT-FLAG             PIC X(01)       VALUE SPACES.    00051000
000530     03  WS-EXPIRE-FLAG          PIC X(01)       VALUE SPACES.    00053000
P0111      03  WS-REL-NOTFOUND         PIC X(01)       VALUE SPACES.    00054000
P0111      03  WS-PRIM-RECORD          PIC X(01)       VALUE SPACES.    00054290
000550     03  WS-7104-REL             PIC X(06)       VALUE SPACES.    00055000
000560     03  WS-ACCT-TYPE            PIC 9(03)       VALUE ZEROES.    00056000
000570     03  WS-BRANCH               PIC 9(05)       VALUE ZEROES.    00057000
P0111      03  WS-PRIM-ONLY            PIC X(01)       VALUE 'N'.       00057500
000580     03  WS-SAVE-GROUP.                                           00058000
000590         05  WS-SAVE-APPL        PIC 9(02).                       00059000
000600         05  WS-SAVE-PRODCODE    PIC X(06).                       00060000
000610         05  WS-SAVE-ACCT-TYPE   PIC 9(03).                       00061000
000620         05  WS-SAVE-7104KRPREC  PIC X(06).                       00062000
000630         05  WS-SAVE-7107KRPREC  PIC X(06).                       00063000
000640     03  WS-ERROR-INDICATOR      PIC X(01)       VALUE SPACES.    00064000
000650     03  WS-INF-KEY.                                              00065000
000660         05  WS-INF-GRP-KEY.                                      00066000
000670             07  WS-INF-INST     PIC 9(04).                       00067000
000680             07  WS-INF-ACCOUNT  PIC 9(18).                       00068000
000690         05  WS-INF-APPL-INFO.                                    00069000
000700             07  WS-INF-PRODCODE PIC X(06).                       00070000
000710             07  WS-INF-APPLR    PIC 9(02).                       00071000
000720     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00072000
000730                                                 VALUE ZERO.      00073000
000740     03  WS-7102-FLAG            PIC X(01)       VALUE SPACES.    00074000
000750     03  WS-7102-DEF-FLAG        PIC X(01)       VALUE 'N'.       00075000
000760     03  WS-7102-DEF-RECORD      PIC X(125)      VALUE SPACES.    00076000
000770     03  WS-7107-FLAG            PIC X(01)       VALUE SPACES.    00077000
000780     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00078000
000790     03  FILLER          REDEFINES WS-CURDATE.                    00079000
000800         05  WS-CURMM            PIC 9(02).                       00080000
000810         05  WS-CURDD            PIC 9(02).                       00081000
000820         05  WS-CURYYYY          PIC 9(04).                       00082000
000830     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00083000
000840     03  FILLER          REDEFINES WS-PDATE.                      00084000
000850         05  WS-PDATE-YYYY       PIC 9(04).                       00085000
000860         05  WS-PDATE-MM         PIC 9(02).                       00086000
000870         05  WS-PDATE-DD         PIC 9(02).                       00087000
000880     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00088000
000890     03  FILLER          REDEFINES WS-PDATE2.                     00089000
000900         05  WS-PDATE2-YYYY      PIC 9(04).                       00090000
000910         05  WS-PDATE2-MM        PIC 9(02).                       00091000
000920         05  WS-PDATE2-DD        PIC 9(02).                       00092000
000930     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00093000
000940                                                 VALUE ZERO.      00094000
000950     03  WS-LAST-GOOD-INST       PIC 9(04)       VALUE ZEROES.    00095000
000960     03  WS-LAST-INST-TRIED      PIC 9(04)       VALUE ZEROES.    00096000
000970     03  WS-ACT-CNT              PIC 9(04)       VALUE ZEROES.    00097000
000980     03  WS-ERRORMODEL           PIC X(01)       VALUE 'N'.       00098000
000990     03  WS-ERRORPRODCODE        PIC X(01)       VALUE 'N'.       00099000
001000     03  WS-REL-UPDATESW         PIC X(01)       VALUE 'N'.       00100000
001010****************                                                  00101000
001020     03  WS-RELCHECK             PIC X(01)       VALUE 'N'.       00102000
001030     03  WS-VALIDREL             PIC 9(02)       VALUE ZERO.      00103000
001040     03  WS-INCLUDEREL           PIC X(01)       VALUE 'N'.       00104000
001050     03  WS-RELMAX               PIC S9(05)      VALUE 50.        00105000
001060     03  WS-RELSUB               PIC S9(05)      VALUE ZERO.      00106000
001070     03  WS-RELCODETABLE.                                         00107000
001080         05  WS-RELCODE                          OCCURS           00108000
001090                                                 50 TIMES.        00109000
001100             07  WS-SECRELCODE   PIC 9(02).                       00110000
001110     03  WS-RPMIM7104SC          PIC X(06).                       00111000
001120     03  WS-SCSUB                PIC S9(04)      COMP             00112000
001130                                                 VALUE ZERO.      00113000
001140     03  WS-SECONDARY-CUST       PIC S9(04)      COMP             00114000
001150                                                 VALUE ZERO.      00115000
001160     03  WS-SECONDARY-CUSTAREA.                                   00116000
001170         05  WS-SEC-INFO                         OCCURS 33 TIMES. 00117000
001180             07  WS-SEC-INST     PIC 9(04).                       00118000
001190             07  WS-SEC-CUST-TYPE                                 00119000
001200                                 PIC X(01).                       00120000
001210             07  WS-SEC-CUST     PIC X(21).                       00121000
001220             07  WS-SEC-RELNBR   PIC 9(02).                       00122000
001230             07  WS-SEC-PRIM     PIC 9(01).                       00123000
001240             07  WS-SEC-FILL     PIC X(01).                       00124000
001250         05  WS-SEC-FILLER       PIC X(10).                       00125000
001260     03  WS-NEW-CUSTKEY.                                          00126000
001270         05  WS-NEW-INST         PIC 9(04).                       00127000
001280         05  WS-NEW-CUST-TYPE    PIC X(01).                       00128000
001290         05  WS-NEW-CUST         PIC X(21).                       00129000
001300     03  WS-ACC-MAX              PIC S9(04)      COMP             00130000
001310                                                 VALUE +33.       00131000
001320     03  WS-ACC-TABLE.                                            00132000
001330         05  WS-ACC-INFO                         OCCURS 33 TIMES. 00133000
001340             07  WS-ACC-INST     PIC 9(04).                       00134000
001350             07  WS-ACC-CUST-TYPE                                 00135000
001360                                 PIC X(01).                       00136000
001370             07  WS-ACC-CUST     PIC X(21).                       00137000
001380             07  WS-ACC-RELNBR   PIC 9(02).                       00138000
001390             07  WS-ACC-PRIM     PIC 9(01).                       00139000
001400             07  WS-ACC-FILL     PIC X(01).                       00140000
001410         05  WS-ACC-FILLER       PIC X(10).                       00141000
001420     03  WS-BADRELNBR            PIC X(01)       VALUE SPACE.     00142000
001430     03  WS-SUBSEC1              PIC S9(03)      COMP-3           00143000
001440                                                 VALUE ZERO.      00144000
001450     03  WS-SUBSEC2              PIC S9(03)      COMP-3           00145000
001460                                                 VALUE ZERO.      00146000
001470****************                                                  00147000
001480     03  WS-SAVEMASTERGROUP.                                      00148000
001490         05  WS-SAVEMSTINST      PIC 9(04).                       00149000
001500         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00150000
001510         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00151000
001520         05  WS-SAVEMSTMODEL     PIC X(10).                       00152000
001530     03  WS-SAVESECGRPAIX1.                                       00153000
001540         05  WS-SAVSECAINST      PIC 9(04).                       00154000
001550         05  WS-SAVSECAACCOUNT   PIC X(18).                       00155000
001560         05  WS-SAVSECAPRODCODE  PIC X(06).                       00156000
001570     03  WS-RCIF-KEY.                                             00157000
001580         05  WS-RCIF-CUST-INST   PIC 9(04).                       00158000
001590         05  WS-RCIF-CUST-TYPE   PIC X(01).                       00159000
001600         05  WS-RCIF-CUST.                                        00160000
001610             07  WS-RCIF-ALPHA   PIC X(14).                       00161000
001620             07  WS-RCIF-ACCUM   PIC 9(03).                       00162000
001630             07  WS-RCIF-TIEBRKR PIC 9(04).                       00163000
001640     03  WS-BALCATCD1-FAIL       PIC X(01)       VALUE SPACES.    00164000
001650     03  WS-WORK-CATCD           PIC X(06)       VALUE SPACES.    00165000
001660     03  WS-WORK-BALCD           PIC 9(02)       VALUE ZEROS.     00166000
001670     03  WS-WORK-BALANCE         PIC S9(13)V99   COMP-3           00167000
001680                                                 VALUE ZEROS.     00168000
P0025 *----------------------------------------------------------------*00169000
P0025  01  RPW004-AREAS.                                                00169190
000000 COPY RPW004.                                                     00169380
P0111  01  WS-PRIMRELCD-WORKAREA.                                       00169440
000000 COPY RPW008.                                                     00169500
P0025 *----------------------------------------------------------------*00169570
001700 01  MIWPRI-AREAS.                                                00170000
000000 COPY MIWPRI.                                                     00171000
001720 01  MIWMSTA-AREAS.                                               00172000
000000 COPY MIWMSTA.                                                    00173000
001740 01  MIMST-RECORD.                                                00174000
000000 COPY MISMST.                                                     00175000
001760 01  MI0237-RECORD.                                               00176000
000000 COPY MIS0237A.                                                   00177000
001780 01  MI2001-RECORD.                                               00178000
000000 COPY MIS2001A.                                                   00179000
001800 01  MI2023-RECORD.                                               00180000
000000 COPY MIS2023A.                                                   00181000
001820 01  MI2024-RECORD.                                               00182000
000000 COPY MIS2024A.                                                   00183000
001840 01  MI7100-RECORD.                                               00184000
000000 COPY MIS7100.                                                    00185000
001860 01  MI7101-RECORD.                                               00186000
000000 COPY MIS7101.                                                    00187000
001880 01  MI7102-RECORD.                                               00188000
000000 COPY MIS7102.                                                    00189000
001900 01  MI7104-RECORD.                                               00190000
000000 COPY MIS7104.                                                    00191000
001920 01  MI7106-RECORD.                                               00192000
000000 COPY MIS7106.                                                    00193000
001940 01  MI7107-RECORD.                                               00194000
000000 COPY MIS7107.                                                    00195000
001960*----------------------------------------------------------------*00196000
001970 01  WS-RPMIM2001AREAS.                                           00197000
000000 COPY RPW2001.                                                    00198000
001990 01  WS-RPMIM7107AREAS.                                           00199000
000000 COPY RPW7107.                                                    00200000
002010*----------------------------------------------------------------*00201000
002020 01  RPWPRI-AREAS.                                                00202000
000000 COPY RPWPRI.                                                     00203000
002040 01  RPWACT-AREA.                                                 00204000
000000 COPY RPWACTA.                                                    00205000
002060 01  RPACT-RECORD.                                                00206000
000000 COPY RPSACT.                                                     00207000
002080 01  RPWCRW-AREA.                                                 00208000
000000 COPY RPWCRWA.                                                    00209000
002100 01  RPCRW-RECORD.                                                00210000
000000 COPY RPSCRW.                                                     00211000
002120 01  RPWEVT-AREA.                                                 00212000
000000 COPY RPWEVTA.                                                    00213000
002140 01  RPEVT-RECORD.                                                00214000
000000 COPY RPSEVT.                                                     00215000
002160 01  RPWIDX-AREA.                                                 00216000
000000 COPY RPWIDXA.                                                    00217000
002180 01  RPIDX-RECORD.                                                00218000
000000 COPY RPSIDX.                                                     00219000
002200 01  RPWMST-AREA.                                                 00220000
000000 COPY RPWMSTA.                                                    00221000
002220 01  RPMST-RECORD.                                                00222000
000000 COPY RPSMST.                                                     00223000
002240 01  RPWQUA-AREA.                                                 00224000
000000 COPY RPWQUAA.                                                    00225000
002260 01  RPQUA-RECORD.                                                00226000
000000 COPY RPSQUA.                                                     00227000
002280 01  RPWREL-AREA.                                                 00228000
000000 COPY RPWRELA.                                                    00229000
002300 01  RPREL-RECORD.                                                00230000
000000 COPY RPSREL.                                                     00231000
002320 01  RPWSEC-AREA.                                                 00232000
000000 COPY RPWSECA.                                                    00233000
002340 01  RPSEC-RECORD.                                                00234000
000000 COPY RPSSEC.                                                     00235000
002360 01  RPWTRM-AREA.                                                 00236000
000000 COPY RPWTRMA.                                                    00237000
002380 01  RPTRM-RECORD.                                                00238000
000000 COPY RPSTRM.                                                     00239000
002400*----------------------------------------------------------------*00240000
002410 01  RPRF21-MESSAGE.                                              00241000
000000 COPY MISCNT00      REPLACING                                     00242000
002430             ==:MICNT:== BY ==RPRF21==.                           00243000
000000 COPY RPSRF21.                                                    00244000
002450*----------------------------------------------------------------*00245000
002460 01  RPINF00-MESSAGE.                                             00246000
000000 COPY MISCNT00      REPLACING                                     00247000
002480             ==:MICNT:== BY ==RPINF00==.                          00248000
000000 COPY RPSINF00.                                                   00249000
002500*----------------------------------------------------------------*00250000
002510 01  RPUSER-MESSAGE.                                              00251000
000000 COPY MISCNT00      REPLACING                                     00252000
002530     ==:MICNT:== BY ==RPUSER==.                                   00253000
000000 COPY RPWUSER.                                                    00254000
002550***************************************************************** 00255000
002560 01  WS-TRACECODES.                                               00256000
002570     03  WS-TR0001               PIC S9(04)      COMP             00257000
002580                                                 VALUE +0001.     00258000
002590     03  WS-TR0002               PIC S9(04)      COMP             00259000
002600                                                 VALUE +0002.     00260000
002610     03  WS-TR0003               PIC S9(04)      COMP             00261000
002620                                                 VALUE +0003.     00262000
002630     03  WS-TR0004               PIC S9(04)      COMP             00263000
002640                                                 VALUE +0004.     00264000
002650     03  WS-TR0005               PIC S9(04)      COMP             00265000
002660                                                 VALUE +0005.     00266000
002670     03  WS-TR0006               PIC S9(04)      COMP             00267000
002680                                                 VALUE +0006.     00268000
002690     03  WS-TR0007               PIC S9(04)      COMP             00269000
002700                                                 VALUE +0007.     00270000
002710     03  WS-TR0008               PIC S9(04)      COMP             00271000
002720                                                 VALUE +0008.     00272000
002730     03  WS-TR0009               PIC S9(04)      COMP             00273000
002740                                                 VALUE +0009.     00274000
002750     03  WS-TR0010               PIC S9(04)      COMP             00275000
002760                                                 VALUE +0010.     00276000
002770     03  WS-TR0011               PIC S9(04)      COMP             00277000
002780                                                 VALUE +0011.     00278000
002790     03  WS-TR0012               PIC S9(04)      COMP             00279000
002800                                                 VALUE +0012.     00280000
002810     03  WS-TR0013               PIC S9(04)      COMP             00281000
002820                                                 VALUE +0013.     00282000
002830     03  WS-TR0014               PIC S9(04)      COMP             00283000
002840                                                 VALUE +0014.     00284000
002850     03  WS-TR0015               PIC S9(04)      COMP             00285000
002860                                                 VALUE +0015.     00286000
002870     03  WS-TR0016               PIC S9(04)      COMP             00287000
002880                                                 VALUE +0016.     00288000
002890     03  WS-TR0017               PIC S9(04)      COMP             00289000
002900                                                 VALUE +0017.     00290000
002910     03  WS-TR0018               PIC S9(04)      COMP             00291000
002920                                                 VALUE +0018.     00292000
002930     03  WS-TR0019               PIC S9(04)      COMP             00293000
002940                                                 VALUE +0019.     00294000
002950     03  WS-TR0020               PIC S9(04)      COMP             00295000
002960                                                 VALUE +0020.     00296000
002970     03  WS-TR0021               PIC S9(04)      COMP             00297000
002980                                                 VALUE +0021.     00298000
002990     03  WS-TR0022               PIC S9(04)      COMP             00299000
003000                                                 VALUE +0022.     00300000
003010     03  WS-TR0023               PIC S9(04)      COMP             00301000
003020                                                 VALUE +0023.     00302000
003030     03  WS-TR0024               PIC S9(04)      COMP             00303000
003040                                                 VALUE +0024.     00304000
003050     03  WS-TR0025               PIC S9(04)      COMP             00305000
003060                                                 VALUE +0025.     00306000
003070     03  WS-TR0026               PIC S9(04)      COMP             00307000
003080                                                 VALUE +0026.     00308000
003090     03  WS-TR0027               PIC S9(04)      COMP             00309000
003100                                                 VALUE +0027.     00310000
003110     03  WS-TR0028               PIC S9(04)      COMP             00311000
003120                                                 VALUE +0028.     00312000
003130     03  WS-TR0029               PIC S9(04)      COMP             00313000
003140                                                 VALUE +0029.     00314000
003150     03  WS-TR0030               PIC S9(04)      COMP             00315000
003160                                                 VALUE +0030.     00316000
003170     03  WS-TR0031               PIC S9(04)      COMP             00317000
003180                                                 VALUE +0031.     00318000
003190     03  WS-TR0032               PIC S9(04)      COMP             00319000
003200                                                 VALUE +0032.     00320000
003210     03  WS-TR0033               PIC S9(04)      COMP             00321000
003220                                                 VALUE +0033.     00322000
003230     03  WS-TR0034               PIC S9(04)      COMP             00323000
003240                                                 VALUE +0034.     00324000
003250     03  WS-TR0035               PIC S9(04)      COMP             00325000
003260                                                 VALUE +0035.     00326000
003270     03  WS-TR0036               PIC S9(04)      COMP             00327000
003280                                                 VALUE +0036.     00328000
003290     03  WS-TR0037               PIC S9(04)      COMP             00329000
003300                                                 VALUE +0037.     00330000
003310     03  WS-TR0038               PIC S9(04)      COMP             00331000
003320                                                 VALUE +0038.     00332000
003330     03  WS-TR0039               PIC S9(04)      COMP             00333000
003340                                                 VALUE +0039.     00334000
003350     03  WS-TR0040               PIC S9(04)      COMP             00335000
003360                                                 VALUE +0040.     00336000
003370     03  WS-TR0041               PIC S9(04)      COMP             00337000
003380                                                 VALUE +0041.     00338000
003390     03  WS-TR0042               PIC S9(04)      COMP             00339000
003400                                                 VALUE +0042.     00340000
003410     03  WS-TR0043               PIC S9(04)      COMP             00341000
003420                                                 VALUE +0043.     00342000
003430     03  WS-TR0044               PIC S9(04)      COMP             00343000
003440                                                 VALUE +0044.     00344000
003450     03  WS-TR0045               PIC S9(04)      COMP             00345000
003460                                                 VALUE +0045.     00346000
003470     03  WS-TR0046               PIC S9(04)      COMP             00347000
003480                                                 VALUE +0046.     00348000
003490     03  WS-TR0047               PIC S9(04)      COMP             00349000
003500                                                 VALUE +0047.     00350000
003510     03  WS-TR0048               PIC S9(04)      COMP             00351000
003520                                                 VALUE +0048.     00352000
003530     03  WS-TR0049               PIC S9(04)      COMP             00353000
003540                                                 VALUE +0049.     00354000
003550     03  WS-TR0050               PIC S9(04)      COMP             00355000
003560                                                 VALUE +0050.     00356000
003570     03  WS-TR0051               PIC S9(04)      COMP             00357000
003580                                                 VALUE +0051.     00358000
003590     03  WS-TR0052               PIC S9(04)      COMP             00359000
003600                                                 VALUE +0052.     00360000
003610     03  WS-TR0053               PIC S9(04)      COMP             00361000
003620                                                 VALUE +0053.     00362000
003630     03  WS-TR0054               PIC S9(04)      COMP             00363000
003640                                                 VALUE +0054.     00364000
003650     03  WS-TR0055               PIC S9(04)      COMP             00365000
003660                                                 VALUE +0055.     00366000
003670     03  WS-TR0056               PIC S9(04)      COMP             00367000
003680                                                 VALUE +0056.     00368000
003690     03  WS-TR0057               PIC S9(04)      COMP             00369000
003700                                                 VALUE +0057.     00370000
003710     03  WS-TR0058               PIC S9(04)      COMP             00371000
003720                                                 VALUE +0058.     00372000
003730     03  WS-TR0059               PIC S9(04)      COMP             00373000
003740                                                 VALUE +0059.     00374000
003750 01  WS-ABORTCODES.                                               00375000
003760     03  WS-AB0009               PIC S9(04)      COMP             00376000
003770                                                 VALUE +0009.     00377000
003780     03  WS-AB2000               PIC S9(04)      COMP             00378000
003790                                                 VALUE +2000.     00379000
003800     03  WS-AB2033               PIC S9(04)      COMP             00380000
003810                                                 VALUE +2033.     00381000
003820     03  WS-AB3051               PIC S9(04)      COMP             00382000
003830                                                 VALUE +3051.     00383000
003840     03  WS-AB6300               PIC S9(04)      COMP             00384000
003850                                                 VALUE +6300.     00385000
003860     03  WS-AB6310               PIC S9(04)      COMP             00386000
003870                                                 VALUE +6310.     00387000
003880     03  WS-AB6320               PIC S9(04)      COMP             00388000
003890                                                 VALUE +6320.     00389000
003900     03  WS-AB6325               PIC S9(04)      COMP             00390000
003910                                                 VALUE +6325.     00391000
003920     03  WS-AB6330               PIC S9(04)      COMP             00392000
003930                                                 VALUE +6330.     00393000
003940     03  WS-AB6335               PIC S9(04)      COMP             00394000
003950                                                 VALUE +6335.     00395000
003960     03  WS-AB6350               PIC S9(04)      COMP             00396000
003970                                                 VALUE +6350.     00397000
003980     03  WS-AB6355               PIC S9(04)      COMP             00398000
003990                                                 VALUE +6355.     00399000
004000     03  WS-AB6360               PIC S9(04)      COMP             00400000
004010                                                 VALUE +6360.     00401000
004020******************************************************************00402000
004030 01  SLW096-AREAS.                                                00403000
000000 COPY SLW096.                                                     00404000
004050 01  SLS140-RECORD.                                               00405000
000000 COPY SLS140.                                                     00406000
004070******************************************************************00407000
004080 LINKAGE SECTION.                                                 00408000
004090 01  DFHCOMMAREA.                                                 00409000
000000 COPY MISCNT00      REPLACING                                     00410000
004110             ==:MICNT:== BY ==RPXXX30==.                          00411000
000000 COPY RPSXXX30.                                                   00412000
004130*01  SLW096-2023RECORDS.                                          00413000
000000 COPY SLW096L.                                                    00414000
004150******************************************************************00415000
004160 PROCEDURE DIVISION.                                              00416000
004170******************************************************************00417000
004180 ENTRY-ROUTINE SECTION.                                           00418000
004190 ER-START.                                                        00419000
004200     MOVE 'RPLXXX36' TO SR-APIPROGLIT.                            00420000
004210     MOVE 'RPLXXX36' TO RPXXX30-ABPROGID.                         00421000
004220     MOVE 'RPLXXX36' TO RPXXX30-RESP-PROGRAM.                     00422000
004230     PERFORM CICS-HANDLE-CONDITION.                               00423000
004240     IF EIBCALEN IS EQUAL TO +0                                   00424000
004250         MOVE WS-AB2000 TO RPXXX30-ABORT                          00425000
004260         MOVE WS-AB2000 TO RPXXX30-RESP-ABORT                     00426000
004270         MOVE WS-TR0001 TO RPXXX30-ABTRACE                        00427000
004280         MOVE WS-TR0001 TO RPXXX30-RESP-TRACE                     00428000
004290         GO TO CICS-RETURN.                                       00429000
004300     MOVE ZERO TO RPXXX30-RESP-MSG-NBR.                           00430000
004310     MOVE SPACE TO WS-FUNCTION.                                   00431000
004320     MOVE 'N' TO WS-ERROR.                                        00432000
004330     MOVE RPXXX30-FILEOPTS TO WS-FILEOPTS.                        00433000
004340     MOVE RPXXX30-OPERID TO WS-UPD-USER.                          00434000
004350     INITIALIZE RPRF21-MESSAGE.                                   00435000
000000 COPY SLP094.                                                     00436000
004370     GO TO VERIFY-KEY.                                            00437000
004380 ER-EXIT.                                                         00438000
004390     EXIT.                                                        00439000
004400******************************************************************00440000
004410 CICS-HANDLE-CONDITION SECTION.                                   00441000
000000 COPY SLP702.                                                     00442000
004430     MOVE WS-AB2033 TO RPXXX30-ABORT.                             00443000
004440     MOVE WS-AB2033 TO RPXXX30-RESP-ABORT.                        00444000
004450     MOVE WS-TR0002 TO RPXXX30-ABTRACE.                           00445000
004460     MOVE WS-TR0002 TO RPXXX30-RESP-TRACE.                        00446000
004470     GO TO CICS-RETURN.                                           00447000
004480 CHC-EXIT.                                                        00448000
004490     EXIT.                                                        00449000
004500******************************************************************00450000
004510 VERIFY-KEY SECTION.                                              00451000
004520 VK-START.                                                        00452000
004530     MOVE ZERO TO COM-ABORT.                                      00453000
004540     MOVE ZERO TO RPXXX30-ABORT.                                  00454000
004550     MOVE ZERO TO RPXXX30-RESP-ABORT.                             00455000
004560     MOVE ZERO TO RPXXX30-MSGNBR.                                 00456000
004570     MOVE ZERO TO RPXXX30-RESP-MSG-NBR.                           00457000
004580     MOVE ZERO TO WS-MSGNBR.                                      00458000
004590     MOVE SPACES TO RPXXX30-FUNCTION.                             00459000
004600     MOVE RPXXX30-DATE TO WS-CURDATE.                             00460000
004610     MOVE WS-CURMM TO WS-PDATE-MM.                                00461000
004620     MOVE WS-CURDD TO WS-PDATE-DD.                                00462000
004630     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00463000
004640     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00464000
004800 VK-IDX.                                                          00480000
004810     INITIALIZE RPIDX-RECORD.                                     00481000
004820     IF RPXXX30-PRIMARY-IDNUM IS NOT GREATER THAN ZEROS           00482000
004830         OR RPXXX30-PRIMARY-IDNUM IS NOT NUMERIC                  00483000
004840         GO TO VK-MST.                                            00484000
004850     PERFORM LOCATE-IDNUMBER-BY-APPL.                             00485000
004860     IF WS-FUNCTION IS EQUAL TO 'N'                               00486000
004870         MOVE 500004 TO RPXXX30-RESP-MSG-NBR                      00487000
004880         GO TO VK-RETURN.                                         00488000
004890     MOVE ZEROS TO RPXXX30-PRIMARY-IDNUM.                         00489000
004900 VK-MST.                                                          00490000
004910     IF RPXXX30-PRIMARY-PROD-CODE IS EQUAL TO SPACES              00491000
004920         OR RPXXX30-PRIMARY-PROD-CODE IS EQUAL TO LOW-VALUES      00492000
004930         PERFORM FIND-PROD-CODE                                   00493000
004940         MOVE '0' TO RPS-SEC-REC-ALT.                             00494000
004950     IF WS-ERRORPRODCODE IS EQUAL TO 'Y'                          00495000
004960         GO TO VK-RETURN.                                         00496000
004970     IF RPXXX30-PRIMARY-MODEL IS EQUAL TO SPACES                  00497000
004980         OR RPXXX30-PRIMARY-MODEL IS EQUAL TO LOW-VALUES          00498000
004990         PERFORM FIND-DEFAULT-MODEL.                              00499000
005000     IF WS-ERRORMODEL IS EQUAL TO 'Y'                             00500000
005010         GO TO VK-RETURN.                                         00501000
005020     MOVE RPXXX30-PRIMARY-INST TO RPMST-INST.                     00502000
005030     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPMST-PRODCODE.            00503000
005040     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPMST-ACCOUNT.              00504000
005050     MOVE RPXXX30-PRIMARY-MODEL TO RPMST-MODEL.                   00505000
005060     PERFORM RPS-MST-GET-REQUEST.                                 00506000
005070     IF WS-FUNCTION IS EQUAL TO 'N'                               00507000
005080         AND RPIDX-IDNUMBER IS GREATER THAN SPACES                00508000
005090         MOVE 500022 TO RPXXX30-RESP-MSG-NBR                      00509000
005100         MOVE 500022 TO RPXXX30-MSGNBR                            00510000
005110         GO TO VK-RETURN.                                         00511000
005120     IF WS-FUNCTION IS EQUAL TO 'N'                               00512000
005130         MOVE 500004 TO RPXXX30-RESP-MSG-NBR                      00513000
005140         MOVE 500004 TO RPXXX30-MSGNBR                            00514000
005150         GO TO VK-RETURN.                                         00515000
005160     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00516000
005170         MOVE WS-AB6320 TO RPXXX30-ABORT                          00517000
005180         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     00518000
005190         MOVE WS-TR0003 TO RPXXX30-ABTRACE                        00519000
005200         MOVE WS-TR0003 TO RPXXX30-RESP-TRACE                     00520000
005210         GO TO VK-RETURN.                                         00521000
005220     MOVE RPMST-IDNUMBER TO RPXXX30-PRIMARY-IDNUM.                00522000
005230     MOVE RPMST-REL-STAT TO RPXXX30-REL-STAT.                     00523000
005240     MOVE RPMST-OUT-FLAG TO RPXXX30-OUT-FLAG.                     00524000
005250 VK-7100.                                                         00525000
005260     PERFORM READ-MICM-7100.                                      00526000
005270     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00527000
005280         MOVE 500005 TO RPXXX30-RESP-MSG-NBR                      00528000
005290         MOVE 500005 TO RPXXX30-MSGNBR                            00529000
005300         GO TO VK-RETURN.                                         00530000
005310 VK-7101.                                                         00531000
005320     MOVE SPACES TO MI7101-RECORD.                                00532000
005330     MOVE RPXXX30-PRIMARY-INST TO MIM-7101KINST.                  00533000
005340     MOVE +7101 TO MIM-7101KREC.                                  00534000
005350     MOVE RPMST-MODEL TO MIM-7101KMODEL.                          00535000
005360     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        00536000
005370     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00537000
005380     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00538000
005390     MOVE MI7101-RECORD TO MIMST-RECORD.                          00539000
005400     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00540000
005410     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00541000
005420         MOVE 500006 TO RPXXX30-RESP-MSG-NBR                      00542000
005430         MOVE 500006 TO RPXXX30-MSGNBR                            00543000
005440         GO TO VK-RETURN.                                         00544000
005450     MOVE MIMST-RECORD TO MI7101-RECORD.                          00545000
005460     IF MIM-7101KINST IS NOT EQUAL TO RPMST-INST                  00546000
005470         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00547000
005480         OR MIM-7101KMODEL IS NOT EQUAL TO RPMST-MODEL            00548000
005490         MOVE 500006 TO RPXXX30-RESP-MSG-NBR                      00549000
005500         MOVE 500006 TO RPXXX30-MSGNBR                            00550000
005510         GO TO VK-RETURN.                                         00551000
005520     MOVE MIM-7101KMODEL TO RPXXX30-PRIMARY-MODEL.                00552000
P0086      MOVE MIM-7101DESC TO RPXXX30-MODEL-LONG-DESC.                00553000
005540     IF MIM-7101EXPDT IS EQUAL TO WS-CURDT-YYYYMMDD               00554000
005550         AND MIM-7101EXPDT IS GREATER THAN ZEROS                  00555000
005560         MOVE 'T' TO WS-EXPIRE-FLAG.                              00556000
005570     IF MIM-7101EXPDT IS LESS THAN WS-CURDT-YYYYMMDD              00557000
005580         AND MIM-7101EXPDT IS GREATER THAN ZEROS                  00558000
005590         MOVE 'E' TO WS-EXPIRE-FLAG.                              00559000
P0111      MOVE SPACES TO WS-7104-REL.                                  00559500
005600     IF MIM-7101CUSTRELCD IS GREATER THAN SPACES                  00560000
005610         AND (MIM-7101CUSTRELCD-Q IS EQUAL TO 'B'                 00561000
005620         OR MIM-7101CUSTRELCD-Q IS EQUAL TO 'E')                  00562000
005630         MOVE MIM-7101CUSTRELCD TO WS-7104-REL.                   00563000
005640     MOVE 'N' TO WS-RELCHECK.                                     00564000
005650     MOVE SPACES TO WS-RPMIM7104SC.                               00565000
P0111      IF MIM-7101PRIMRELCD-Q IS NOT EQUAL TO 'B'                   00566000
P0111          AND MIM-7101PRIMRELCD-Q IS NOT EQUAL TO 'E'              00566590
005680         GO TO VK-NAME.                                           00568000
P0111      IF MIM-7101PRIMRELCD IS EQUAL TO SPACES                      00569000
P0111          GO TO VK-NAME.                                           00569490
P0111      MOVE 'Y' TO WS-RELCHECK.                                     00569980
P0111      MOVE MIM-7101PRIMRELCD TO WS-RPMIM7104SC.                    00570470
P0111      PERFORM READ-MICM-7104SECUST.                                00570960
005720 VK-NAME.                                                         00572000
005730     MOVE 'A' TO RPRF21-FUNC.                                     00573000
005740     MOVE RPMST-INST TO RPRF21-BASE-ACCT-INST.                    00574000
005750     MOVE RPMST-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.            00575000
005760     MOVE RPMST-ACCOUNT TO RPRF21-BASE-ACCT.                      00576000
005770     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00577000
005780         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00578000
005790         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00579000
005800     PERFORM REQUEST-CUSTOMER.                                    00580000
005810     MOVE WS-MSGNBR TO RPXXX30-RESP-MSG-NBR.                      00581000
005820     MOVE WS-MSGNBR TO RPXXX30-MSGNBR.                            00582000
005830     IF WS-FUNCTION IS EQUAL TO 'B'                               00583000
005840         MOVE SPACES TO WS-FUNCTION                               00584000
005850         MOVE 'Y' TO WS-CLOSE-FLAG.                               00585000
005860     IF WS-FUNCTION IS EQUAL TO SPACES                            00586000
005870         MOVE RPRF21-BASE-RCIF-KEY TO WS-RCIF-KEY                 00587000
005880         MOVE RPRF21-NAME TO RPXXX30-CUST-NAME                    00588000
005890         GO TO VK-EXIT.                                           00589000
P0111      IF RPXXX30-MSGNBR IS EQUAL TO ZEROS                          00589100
P0111          AND WS-FUNCTION IS EQUAL TO 'N'                          00589200
P0111          MOVE SPACE TO WS-FUNCTION                                00589300
P0111          MOVE 'N' TO WS-RELCHECK                                  00589400
P0111          MOVE 'Y' TO WS-PRIM-ONLY                                 00589500
P0111          MOVE WS-NOTPRESENT TO RPXXX30-CUST-NAME                  00589600
P0111          INITIALIZE WS-RCIF-KEY                                   00589700
P0111          GO TO VK-EXIT.                                           00589800
005900     IF RPXXX30-RESP-MSG-NBR IS EQUAL TO ZEROS                    00590000
P0111          MOVE 500016 TO RPXXX30-RESP-MSG-NBR                      00591000
005920         MOVE 500016 TO RPXXX30-MSGNBR.                           00592000
005930 VK-RETURN.                                                       00593000
005940     MOVE 'E' TO RPXXX30-RETURN.                                  00594000
005950     GO TO CICS-RETURN.                                           00595000
005960 VK-EXIT.                                                         00596000
005970     EXIT.                                                        00597000
005980******************************************************************00598000
005990 ROUTING-ROUTINE SECTION.                                         00599000
006000 RR-START.                                                        00600000
006010* ****** DELETES THE ENTIRE RELATIONSHIP FOR THE ACCOUNT *****    00601000
006020     IF RPXXX30-REQUEST-CODE IS EQUAL TO 'D'                      00602000
006030         PERFORM DELETE-RELATIONSHIP                              00603000
006040         GO TO RR-RETURN.                                         00604000
006050*   ****** READS SECONDARY ACCOUNT *****                          00605000
006060     PERFORM READ-SECONDARY-ACCOUNT.                              00606000
006070     IF WS-ERROR IS NOT EQUAL TO 'N'                              00607000
006080         GO TO RR-RETURN.                                         00608000
006090     IF RPXXX30-ABORT IS GREATER THAN ZERO                        00609000
006100         OR RPXXX30-RESP-MSG-NBR IS GREATER THAN ZERO             00610000
006110         GO TO RR-RETURN.                                         00611000
006120* ****** ADDS A SECONDARY ACCOUNT ******                          00612000
P0111      IF RPXXX30-REQUEST-CODE IS EQUAL TO 'A'                      00612100
P0111          AND WS-PRIM-ONLY IS EQUAL TO 'Y'                         00612200
P0111          MOVE 500100 TO RPXXX30-MSGNBR                            00612300
P0111          MOVE 500100 TO RPXXX30-RESP-MSG-NBR                      00612400
P0111          MOVE 'E' TO RPXXX30-RETURN                               00612500
P0111          GO TO RR-RETURN.                                         00612600
006130     IF RPXXX30-REQUEST-CODE IS EQUAL TO 'A'                      00613000
006140         PERFORM ADD-SECONDARY-ACCOUNT                            00614000
006150         IF WS-ERROR IS EQUAL TO 'N'                              00615000
006160             PERFORM UPDATE-RECORD                                00616000
006170         END-IF                                                   00617000
006180         GO TO RR-RETURN                                          00618000
006190     END-IF.                                                      00619000
006200* ****** REMOVES A SECONDARY ACCOUNT ******                       00620000
006210     IF RPXXX30-REQUEST-CODE IS EQUAL TO 'R'                      00621000
006220         PERFORM REMOVE-SECONDARY-ACCOUNT                         00622000
006230         GO TO RR-RETURN.                                         00623000
006240 RR-RETURN.                                                       00624000
006250     GO TO CICS-RETURN.                                           00625000
006260 RR-EXIT.                                                         00626000
006270     EXIT.                                                        00627000
006280******************************************************************00628000
006290 READ-SECONDARY-ACCOUNT SECTION.                                  00629000
006300 RSA-START.                                                       00630000
006310     INITIALIZE RPREL-RECORD.                                     00631000
006320     MOVE RPMST-GRP-KEY TO RPREL-ACCT1-GRP.                       00632000
006330     MOVE RPXXX30-SECONDARY-ACCT TO RPREL-ACCT2-GRP.              00633000
006340     PERFORM RPS-REL-GET-GE-REQUEST.                              00634000
006350     IF WS-FUNCTION IS EQUAL TO 'N'                               00635000
006360         AND RPXXX30-REQUEST-CODE IS EQUAL TO 'R'                 00636000
006370         MOVE 500605 TO RPXXX30-RESP-MSG-NBR                      00637000
006380         GO TO RSA-EXIT.                                          00638000
006390     IF WS-FUNCTION IS EQUAL TO 'N'                               00639000
006400         AND RPXXX30-REQUEST-CODE IS EQUAL TO 'A'                 00640000
006410         MOVE 'Y' TO WS-REL-NOTFOUND                              00641000
006420         MOVE 'Y' TO WS-UPDTSW                                    00642000
006430         GO TO RSA-EXIT.                                          00643000
006440     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00644000
006450         MOVE WS-AB6330 TO RPXXX30-ABORT                          00645000
006460         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     00646000
006470         MOVE WS-TR0004 TO RPXXX30-ABTRACE                        00647000
006480         MOVE WS-TR0004 TO RPXXX30-RESP-TRACE                     00648000
006490         GO TO CICS-ABORT-EXIT.                                   00649000
006500     IF RPXXX30-REQUEST-CODE IS EQUAL TO 'R'                      00650000
006510         AND RPXXX30-PRIMARY-ACCT IS EQUAL TO RPREL-ACCT1-GRP     00651000
006520         AND RPXXX30-SECONDARY-ACCT IS NOT EQUAL TO               00652000
006530             RPREL-ACCT2-GRP                                      00653000
006540         MOVE 500605 TO RPXXX30-RESP-MSG-NBR                      00654000
006550         GO TO RSA-EXIT.                                          00655000
006560     IF RPXXX30-REQUEST-CODE IS EQUAL TO 'R'                      00656000
006570         AND RPREL-ACCT-STATUS IS NOT EQUAL TO 'R'                00657000
006580         MOVE 'Y' TO WS-REL-UPDATESW                              00658000
006590         GO TO RSA-EXIT.                                          00659000
006600     IF RPXXX30-PRIMARY-ACCT IS EQUAL TO RPREL-ACCT1-GRP          00660000
006610         AND RPXXX30-SECONDARY-ACCT IS EQUAL TO RPREL-ACCT2-GRP   00661000
006620         MOVE 'Y' TO WS-REL-UPDATESW                              00662000
006630         GO TO RSA-FOUND.                                         00663000
006640     MOVE 'Y' TO WS-REL-NOTFOUND.                                 00664000
006650     GO TO RSA-EXIT.                                              00665000
006660 RSA-FOUND.                                                       00666000
006670     MOVE 'E' TO RPXXX30-RETURN.                                  00667000
006680     MOVE 500095 TO RPXXX30-MSGNBR.                               00668000
006690     MOVE 500095 TO RPXXX30-RESP-MSG-NBR.                         00669000
006700 RSA-EXIT.                                                        00670000
006710     EXIT.                                                        00671000
006720******************************************************************00672000
006730 ADD-SECONDARY-ACCOUNT SECTION.                                   00673000
006740 ASA-START.                                                       00674000
006750     MOVE RPXXX30-SEC-INST TO RPRF21-BASE-ACCT-INST.              00675000
006760     MOVE RPXXX30-SEC-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.      00676000
006770     MOVE RPXXX30-SEC-ACCOUNT TO RPRF21-BASE-ACCT.                00677000
006780     PERFORM READ-MICM-2023.                                      00678000
006790 ASA-PRODACCT-2023.                                               00679000
006800     IF MIM-2023RPOPTION IS EQUAL TO ' '                          00680000
006810         OR MIM-2023RPOPTION IS EQUAL TO 'N'                      00681000
006820         MOVE 'N' TO MIM-2023RPOPTION.                            00682000
006830     IF MIM-2023RPOPTION IS EQUAL TO 'N'                          00683000
006840         MOVE 'Y' TO WS-ERROR                                     00684000
006850         MOVE 500015 TO RPXXX30-MSGNBR                            00685000
006860         MOVE 500015 TO RPXXX30-RESP-MSG-NBR                      00686000
006870         GO TO ASA-END.                                           00687000
006880 ASA-2023.                                                        00688000
006890     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'N'                     00689000
006900         AND RPXXX30-PRIMARY-INST IS NOT EQUAL TO                 00690000
006910             RPXXX30-SEC-INST                                     00691000
006920         MOVE 'Y' TO WS-ERROR                                     00692000
006930         MOVE 500088 TO RPXXX30-MSGNBR                            00693000
006940         MOVE 500088 TO RPXXX30-RESP-MSG-NBR                      00694000
006950         GO TO ASA-END.                                           00695000
P0025      IF MIM-7100ENTERPRISEOPT IS NOT EQUAL TO 'Y'                 00696000
P0025          OR RPXXX30-PRIMARY-INST IS EQUAL TO RPXXX30-SEC-INST     00696290
006970         GO TO ASA-CUSTOMER.                                      00697000
P0025      MOVE ZEROS TO MIM-2024KINST.                                 00698000
P0025      MOVE 2024 TO MIM-2024KREC.                                   00699990
P0025      MOVE MIM-7100ENTERPRISEINST TO MIM-2024KGROUP-INST.          00701980
P0025      MOVE RPXXX30-SEC-INST TO MIM-2024KACCESS-INST.               00703970
P0025      MOVE MIC-MST-2024-PRI TO MIC-MST-REC-PRI.                    00705960
P0025      MOVE 50 TO MIM-2024KMANGER.                                  00707950
P0025      MOVE MI2024-RECORD TO MIMST-RECORD.                          00709940
P0025      PERFORM MIC-MST-GET-REQUEST.                                 00711930
P0025      IF WS-FUNCTION IS EQUAL TO 'N'                               00713920
P0025          MOVE 'Y' TO WS-ERROR                                     00715910
P0025          MOVE 500088 TO RPXXX30-MSGNBR                            00717900
P0025          MOVE 500088 TO RPXXX30-RESP-MSG-NBR                      00719890
P0025          GO TO ASA-END.                                           00721880
P0025      IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00723870
P0025          MOVE 'Y' TO WS-ERROR                                     00725860
P0025          MOVE WS-TR0005 TO RPXXX30-ABTRACE                        00727850
P0025          MOVE WS-TR0005 TO RPXXX30-RESP-TRACE                     00729840
P0025          MOVE WS-AB3051 TO RPXXX30-ABORT                          00731830
P0025          MOVE WS-AB3051 TO RPXXX30-RESP-ABORT                     00733820
P0025          GO TO ASA-END.                                           00735810
P0025      MOVE MIMST-RECORD TO MI2024-RECORD.                          00737800
P0025      MOVE RPXXX30-OPERID TO WS-ACCESS-OPERID.                     00739790
P0025      MOVE RPXXX30-PROFILE TO WS-ACCESS-PROFILE.                   00741780
P0025      MOVE RPXXX30-EXTERNALID TO WS-ACCESS-EXTERNALID.             00743770
P0025      MOVE MIM-7100ENTERPRISEINST TO WS-ACCESS-PRIM-INST.          00745760
P0025      MOVE RPXXX30-SEC-INST TO WS-ACCESS-ALT-INST.                 00747750
P0025      PERFORM CROSS-INSTITUTION.                                   00749740
P0025      IF WS-RPP004-ERROR IS EQUAL TO 'Y'                           00751730
P0025          MOVE 'Y' TO WS-ERROR                                     00753720
P0025          MOVE 500088 TO RPXXX30-MSGNBR                            00755710
P0025          MOVE 500088 TO RPXXX30-RESP-MSG-NBR                      00757700
P0025          GO TO ASA-END.                                           00759690
007650 ASA-CUSTOMER.                                                    00765000
007660     MOVE 'F' TO RPRF21-FUNC.                                     00766000
007670     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00767000
007680         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00768000
007690         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00769000
007700     PERFORM REQUEST-CUSTOMER.                                    00770000
007710     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00771000
007720         MOVE 'Y' TO WS-ERROR                                     00772000
007730         MOVE 500016 TO RPXXX30-MSGNBR                            00773000
007740         MOVE 500016 TO RPXXX30-RESP-MSG-NBR                      00774000
007750         GO TO ASA-END.                                           00775000
007760     MOVE SPACE TO WS-ACT-FLAG.                                   00776000
007770     INITIALIZE RPACT-RECORD.                                     00777000
007780     MOVE RPXXX30-SEC-INST TO RPACT-INST.                         00778000
007790     MOVE RPXXX30-SEC-PRODCODE TO RPACT-PRODCODE.                 00779000
007800     MOVE RPXXX30-SEC-ACCOUNT TO RPACT-ACCOUNT.                   00780000
007810     PERFORM RPS-ACT-GET-REQUEST.                                 00781000
007820     IF WS-FUNCTION IS EQUAL TO 'N'                               00782000
007830         GO TO ASA-END.                                           00783000
007840     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00784000
007850         MOVE 'Y' TO WS-ERROR                                     00785000
007860         MOVE WS-AB6300 TO RPXXX30-ABORT                          00786000
007870         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     00787000
007880         MOVE WS-TR0007 TO RPXXX30-RESP-TRACE                     00788000
007890         MOVE WS-TR0007 TO RPXXX30-ABTRACE                        00789000
007900         GO TO ASA-END.                                           00790000
007910     PERFORM READ-MICM-7100.                                      00791000
007920     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00792000
007930         MOVE 'Y' TO WS-ERROR                                     00793000
007940         MOVE 500005 TO RPXXX30-MSGNBR                            00794000
007950         MOVE 500005 TO RPXXX30-RESP-MSG-NBR                      00795000
007960         GO TO ASA-END.                                           00796000
007970     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      00797000
007980         MOVE 'Y' TO WS-ERROR                                     00798000
007990         MOVE 500021 TO RPXXX30-MSGNBR                            00799000
008000         MOVE 500021 TO RPXXX30-RESP-MSG-NBR                      00800000
008010         GO TO ASA-END.                                           00801000
008020     MOVE 'Y' TO WS-ACT-FLAG.                                     00802000
008030 ASA-END.                                                         00803000
008040     IF RPXXX30-UPDATE IS NOT EQUAL TO 'Y'                        00804000
008050         GO TO CICS-RETURN.                                       00805000
008060     IF WS-ERROR IS NOT EQUAL TO 'Y'                              00806000
008070         PERFORM CHECK-EXISTING-RELATIONSHIP.                     00807000
008080     IF WS-ERROR IS NOT EQUAL TO 'Y'                              00808000
008090         PERFORM VALIDATE-MODEL-REQUIREMENTS.                     00809000
008100 ASA-EXIT.                                                        00810000
008110     EXIT.                                                        00811000
008120******************************************************************00812000
008130 UPDATE-RECORD SECTION.                                           00813000
008140 UR-START.                                                        00814000
008150     MOVE 'Y' TO WS-UPDATESW.                                     00815000
008160     INITIALIZE RPREL-RECORD.                                     00816000
008170     MOVE RPXXX30-PRIMARY-INST TO RPREL-INST.                     00817000
008180     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPREL-PRODCODE.            00818000
008190     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPREL-ACCOUNT.              00819000
008200     MOVE RPXXX30-PRIMARY-MODEL TO RPREL-MODEL.                   00820000
008210     MOVE RPXXX30-SEC-INST TO RPREL-INST2.                        00821000
008220     MOVE RPXXX30-SEC-PRODCODE TO RPREL-PRODCODE2.                00822000
008230     MOVE RPXXX30-SEC-ACCOUNT TO RPREL-ACCOUNT2.                  00823000
008240     MOVE 'A' TO RPREL-ACCT-STATUS.                               00824000
008250     IF RPINF00-BRANCH IS NOT NUMERIC                             00825000
008260         MOVE ZEROS TO RPREL-BRANCH                               00826000
008270     ELSE                                                         00827000
008280         MOVE RPINF00-BRANCH TO RPREL-BRANCH.                     00828000
008290     IF RPINF00-ACCT-TYPE IS NOT NUMERIC                          00829000
008300         MOVE ZEROS TO RPREL-ACCT-TYPE                            00830000
008310     ELSE                                                         00831000
008320         MOVE RPINF00-ACCT-TYPE TO RPREL-ACCT-TYPE.               00832000
008330     IF RPINF00-APPLR IS NOT NUMERIC                              00833000
008340         MOVE ZEROS TO RPREL-APPL                                 00834000
008350     ELSE                                                         00835000
008360         MOVE RPINF00-APPLR TO RPREL-APPL.                        00836000
008370     PERFORM RPS-REL-PUT-REQUEST.                                 00837000
008380     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00838000
008390         MOVE 'Y' TO WS-ERROR                                     00839000
008400         MOVE WS-AB6330 TO RPXXX30-ABORT                          00840000
008410         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     00841000
008420         MOVE WS-TR0008 TO RPXXX30-ABTRACE                        00842000
008430         MOVE WS-TR0008 TO RPXXX30-RESP-TRACE                     00843000
008440         GO TO UR-EXIT.                                           00844000
008450 UR-MASTER.                                                       00845000
008460     MOVE RPXXX30-PRIMARY-INST TO RPQUA-INST.                     00846000
008470     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPQUA-PRODCODE.            00847000
008480     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPQUA-ACCOUNT.              00848000
008490     MOVE RPXXX30-PRIMARY-MODEL TO RPQUA-MODEL.                   00849000
008500     PERFORM RPS-QUA-GET-LOCK-REQUEST.                            00850000
008510     IF WS-FUNCTION IS EQUAL TO 'N'                               00851000
008520         GO TO UR-SEC.                                            00852000
008530     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00853000
008540         MOVE 'Y' TO WS-ERROR                                     00854000
008550         MOVE WS-AB6325 TO RPXXX30-ABORT                          00855000
008560         MOVE WS-AB6325 TO RPXXX30-RESP-ABORT                     00856000
008570         MOVE WS-TR0009 TO RPXXX30-ABTRACE                        00857000
008580         MOVE WS-TR0009 TO RPXXX30-RESP-TRACE                     00858000
008590         GO TO UR-EXIT.                                           00859000
008600     ADD +1 TO RPQUA-ADDON-ACCTS.                                 00860000
008610     PERFORM RPS-QUA-REPUT-REQUEST.                               00861000
008620     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00862000
008630         MOVE 'Y' TO WS-ERROR                                     00863000
008640         MOVE WS-AB6325 TO RPXXX30-ABORT                          00864000
008650         MOVE WS-AB6325 TO RPXXX30-ABORT                          00865000
008660         MOVE WS-TR0010 TO RPXXX30-ABTRACE                        00866000
008670         MOVE WS-TR0010 TO RPXXX30-ABTRACE                        00867000
008680         GO TO UR-EXIT.                                           00868000
008690     GO TO UR-SET-MSGNBR.                                         00869000
008700 UR-SEC.                                                          00870000
008710     INITIALIZE RPSEC-RECORD.                                     00871000
008720     MOVE RPREL-INST2 TO RPSEC-INST.                              00872000
008730     MOVE RPREL-PRODCODE2 TO RPSEC-PRODCODE.                      00873000
008740     MOVE RPREL-ACCOUNT2 TO RPSEC-ACCOUNT.                        00874000
008750     MOVE RPREL-MODEL TO RPSEC-MODEL2.                            00875000
008760     MOVE RPREL-INST TO RPSEC-INST2.                              00876000
008770     MOVE RPREL-PRODCODE TO RPSEC-PRODCODE2.                      00877000
008780     MOVE RPREL-ACCOUNT TO RPSEC-ACCOUNT2.                        00878000
008790     MOVE RPSEC-INST TO RPSEC-ALT-INST.                           00879000
008800     MOVE RPSEC-PRODCODE TO RPSEC-ALT-PRODCODE.                   00880000
008810     MOVE RPSEC-ACCOUNT TO RPSEC-ALT-ACCOUNT.                     00881000
008820     PERFORM RPS-SEC-PUT-REQUEST.                                 00882000
008830     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00883000
008840         MOVE 'Y' TO WS-ERROR                                     00884000
008850         MOVE WS-AB6335 TO RPXXX30-ABORT                          00885000
008860         MOVE WS-AB6335 TO RPXXX30-RESP-ABORT                     00886000
008870         MOVE WS-TR0011 TO RPXXX30-ABTRACE                        00887000
008880         MOVE WS-TR0011 TO RPXXX30-RESP-TRACE                     00888000
008890         GO TO UR-EXIT.                                           00889000
008900     IF WS-ACT-FLAG IS NOT EQUAL TO 'Y'                           00890000
008910         GO TO UR-ACT.                                            00891000
008920     INITIALIZE RPACT-RECORD.                                     00892000
008930     MOVE RPSEC-ACCT1-GRP TO RPACT-GRP-KEY.                       00893000
008940     PERFORM RPS-ACT-GET-LOCK-REQUEST.                            00894000
008950     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00895000
008960         MOVE 'Y' TO WS-ERROR                                     00896000
008970         MOVE WS-AB6300 TO RPXXX30-ABORT                          00897000
008980         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     00898000
008990         MOVE WS-TR0012 TO RPXXX30-ABTRACE                        00899000
009000         MOVE WS-TR0012 TO RPXXX30-RESP-TRACE                     00900000
009010         GO TO UR-EXIT.                                           00901000
009020     GO TO UR-A-ACT.                                              00902000
009030 UR-ACT.                                                          00903000
009040     INITIALIZE RPACT-RECORD.                                     00904000
009050     MOVE RPSEC-ACCT1-GRP TO RPACT-GRP-KEY.                       00905000
009060     MOVE RPREL-APPL TO RPACT-APPL.                               00906000
009070     MOVE 'N' TO RPACT-SC-INC-QUAL.                               00907000
009080     MOVE 'N' TO RPACT-SC-INC-OPTION.                             00908000
009090     MOVE 'N' TO RPACT-RATE-INC-QUAL.                             00909000
009100     MOVE 'N' TO RPACT-RATE-INC-OPTION.                           00910000
009110     MOVE 'N' TO RPACT-PROCOPT.                                   00911000
009120 UR-A-ACT.                                                        00912000
009130     IF MIM-7102SECSCINCOPT IS EQUAL TO 'Y'                       00913000
009140         MOVE 'Y' TO RPACT-SC-INC-OPTION.                         00914000
009150     IF MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                     00915000
009160         MOVE 'Y' TO RPACT-RATE-INC-OPTION.                       00916000
009170     IF WS-ACT-FLAG IS EQUAL TO 'Y'                               00917000
009180         PERFORM RPS-ACT-REPUT-REQUEST                            00918000
009190     ELSE                                                         00919000
009200         PERFORM RPS-ACT-PUT-REQUEST.                             00920000
009210     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00921000
009220         MOVE 'Y' TO WS-ERROR                                     00922000
009230         MOVE WS-AB6300 TO RPXXX30-ABORT                          00923000
009240         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     00924000
009250         MOVE WS-TR0013 TO RPXXX30-ABTRACE                        00925000
009260         MOVE WS-TR0013 TO RPXXX30-RESP-TRACE                     00926000
009270         GO TO UR-EXIT.                                           00927000
009280 UR-EVT.                                                          00928000
009290     IF MIM-7100EVENTHISTORYOPT IS NOT EQUAL TO 'Y'               00929000
009300         GO TO UR-SET-MSGNBR.                                     00930000
009310     MOVE 07 TO RPS-EVT-EVENT-CODE.                               00931000
009320     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   00932000
009330     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   00933000
009340     MOVE RPXXX30-PRIMARY-IDNUM TO RPS-EVT-IDNUMBER.              00934000
009350     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        00935000
009360     PERFORM ADD-EVENT-HISTORY.                                   00936000
009370     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00937000
009380         MOVE WS-AB6360 TO RPXXX30-ABORT                          00938000
009390         MOVE WS-AB6360 TO RPXXX30-RESP-ABORT                     00939000
009400         MOVE WS-TR0014 TO RPXXX30-ABTRACE                        00940000
009410         MOVE WS-TR0014 TO RPXXX30-RESP-TRACE                     00941000
009420         GO TO CICS-RETURN.                                       00942000
009430 UR-SET-MSGNBR.                                                   00943000
009440     MOVE 500604 TO RPXXX30-RESP-MSG-NBR.                         00944000
009450 UR-EXIT.                                                         00945000
009460     EXIT.                                                        00946000
009470******************************************************************00947000
009480 REMOVE-SECONDARY-ACCOUNT SECTION.                                00948000
009490 RESA-START.                                                      00949000
009500     INITIALIZE RPREL-RECORD.                                     00950000
009510     MOVE RPMST-GRP-KEY TO RPREL-ACCT1-GRP.                       00951000
009520     MOVE RPXXX30-SECONDARY-ACCT TO RPREL-ACCT2-GRP.              00952000
009530     PERFORM RPS-REL-GET-LOCK-REQUEST.                            00953000
009540     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00954000
009550         MOVE 'Y' TO WS-ERROR                                     00955000
009560         MOVE WS-AB6330 TO RPXXX30-ABORT                          00956000
009570         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     00957000
009580         MOVE WS-TR0015 TO RPXXX30-ABTRACE                        00958000
009590         MOVE WS-TR0015 TO RPXXX30-RESP-TRACE                     00959000
009600         GO TO RESA-EXIT.                                         00960000
009610     IF RPREL-ACCT-STATUS IS NOT EQUAL TO 'U'                     00961000
009620         AND RPMST-OUT-FLAG IS EQUAL TO 'N'                       00962000
009630         GO TO RESA-SET-R.                                        00963000
009640     PERFORM RPS-REL-DELETE-REQUEST.                              00964000
009650     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00965000
009660         MOVE 'Y' TO WS-ERROR                                     00966000
009670         MOVE WS-AB6330 TO RPXXX30-ABORT                          00967000
009680         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     00968000
009690         MOVE WS-TR0016 TO RPXXX30-ABTRACE                        00969000
009700         MOVE WS-TR0016 TO RPXXX30-RESP-TRACE                     00970000
009710         GO TO RESA-EXIT.                                         00971000
009720     GO TO RESA-R-SEC.                                            00972000
009730 RESA-SET-R.                                                      00973000
009740     MOVE 'R' TO RPREL-ACCT-STATUS.                               00974000
009750     PERFORM RPS-REL-REPUT-REQUEST.                               00975000
009760     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00976000
009770         MOVE 'Y' TO WS-ERROR                                     00977000
009780         MOVE WS-AB6330 TO RPXXX30-ABORT                          00978000
009790         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     00979000
009800         MOVE WS-TR0017 TO RPXXX30-ABTRACE                        00980000
009810         MOVE WS-TR0017 TO RPXXX30-RESP-TRACE                     00981000
009820         GO TO RESA-EXIT.                                         00982000
009830 RESA-R-SEC.                                                      00983000
009840     INITIALIZE RPSEC-RECORD.                                     00984000
009850     MOVE RPREL-INST2 TO RPSEC-INST.                              00985000
009860     MOVE RPREL-PRODCODE2 TO RPSEC-PRODCODE.                      00986000
009870     MOVE RPREL-ACCOUNT2 TO RPSEC-ACCOUNT.                        00987000
009880     MOVE RPREL-MODEL TO RPSEC-MODEL2.                            00988000
009890     MOVE RPREL-INST TO RPSEC-INST2.                              00989000
009900     MOVE RPREL-PRODCODE TO RPSEC-PRODCODE2.                      00990000
009910     MOVE RPREL-ACCOUNT TO RPSEC-ACCOUNT2.                        00991000
009920     PERFORM RPS-SEC-GET-LOCK-REQUEST.                            00992000
009930     IF WS-FUNCTION IS EQUAL TO 'N'                               00993000
009940         AND RPREL-ACCT-STATUS IS EQUAL TO 'U'                    00994000
009950         GO TO RESA-R-SET-MSG.                                    00995000
009960     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00996000
009970         MOVE 'Y' TO WS-ERROR                                     00997000
009980         MOVE WS-AB6335 TO RPXXX30-ABORT                          00998000
009990         MOVE WS-AB6335 TO RPXXX30-RESP-ABORT                     00999000
010000         MOVE WS-TR0018 TO RPXXX30-ABTRACE                        01000000
010010         MOVE WS-TR0018 TO RPXXX30-RESP-TRACE                     01001000
010020         GO TO RESA-EXIT.                                         01002000
010030     PERFORM RPS-SEC-DELETE-REQUEST.                              01003000
010040     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01004000
010050         MOVE 'Y' TO WS-ERROR                                     01005000
010060         MOVE WS-AB6335 TO RPXXX30-ABORT                          01006000
010070         MOVE WS-AB6335 TO RPXXX30-RESP-ABORT                     01007000
010080         MOVE WS-TR0019 TO RPXXX30-ABTRACE                        01008000
010090         MOVE WS-TR0019 TO RPXXX30-RESP-TRACE                     01009000
010100         GO TO RESA-EXIT.                                         01010000
010110     MOVE 'Y' TO WS-UPDATESW.                                     01011000
010120     MOVE 'N' TO WS-SEC-FLAG.                                     01012000
010130     INITIALIZE RPACT-RECORD.                                     01013000
010140     MOVE RPSEC-ACCT1-GRP TO RPACT-GRP-KEY.                       01014000
010150     MOVE LOW-VALUES TO RPSEC-MODEL2.                             01015000
010160     MOVE LOW-VALUES TO RPSEC-ACCT2-GRP.                          01016000
010170     PERFORM RPS-SEC-GET-GE-REQUEST.                              01017000
010180     IF WS-FUNCTION IS EQUAL TO 'E'                               01018000
010190         GO TO RESA-R-7102.                                       01019000
010200     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01020000
010210         MOVE 'Y' TO WS-ERROR                                     01021000
010220         MOVE WS-AB6335 TO RPXXX30-ABORT                          01022000
010230         MOVE WS-AB6335 TO RPXXX30-RESP-ABORT                     01023000
010240         MOVE WS-TR0020 TO RPXXX30-ABTRACE                        01024000
010250         MOVE WS-TR0020 TO RPXXX30-RESP-TRACE                     01025000
010260         GO TO RESA-EXIT.                                         01026000
010270     IF RPSEC-ACCT1-GRP IS EQUAL TO RPACT-GRP-KEY                 01027000
010280         MOVE 'Y' TO WS-SEC-FLAG.                                 01028000
010290 RESA-R-7102.                                                     01029000
010300     MOVE RPREL-INST2 TO RPRF21-BASE-ACCT-INST.                   01030000
010310     MOVE RPREL-PRODCODE2 TO RPRF21-BASE-ACCT-PRODCODE.           01031000
010320     MOVE RPREL-ACCT-TYPE TO WS-ACCT-TYPE.                        01032000
010330     PERFORM READ-MICM-7102.                                      01033000
010340     IF WS-7102-FLAG IS EQUAL TO 'N'                              01034000
010350         AND MIM-7100ACCTLIMITOPT IS NOT EQUAL TO 'Y'             01035000
010360         MOVE SPACES TO WS-SEC-FLAG                               01036000
010370         GO TO RESA-R-SET-MSG.                                    01037000
010380 RESA-R-ACT.                                                      01038000
010390     PERFORM RPS-ACT-GET-LOCK-REQUEST.                            01039000
010400     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01040000
010410         MOVE 'Y' TO WS-ERROR                                     01041000
010420         MOVE WS-AB6300 TO RPXXX30-ABORT                          01042000
010430         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     01043000
010440         MOVE WS-TR0021 TO RPXXX30-ABTRACE                        01044000
010450         MOVE WS-TR0021 TO RPXXX30-RESP-TRACE                     01045000
010460         GO TO RESA-EXIT.                                         01046000
010470     IF WS-7102-FLAG IS EQUAL TO 'N'                              01047000
010480         MOVE 'N' TO WS-SEC-FLAG                                  01048000
010490         GO TO RESA-R-ACT-CONT.                                   01049000
010500     MOVE 'Y' TO WS-SEC-FLAG.                                     01050000
010510     IF MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                     01051000
010520         MOVE 'N' TO RPACT-RATE-INC-OPTION.                       01052000
010530     IF MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                     01053000
010540         AND MIM-7102TIMEPROCOPT IS EQUAL TO 'Y'                  01054000
010550         MOVE 'Y' TO RPACT-PROCOPT.                               01055000
010560     IF MIM-7100DUPINCOPT IS EQUAL TO 'Y'                         01056000
010570         GO TO RESA-R-ACT-CONT.                                   01057000
010580     IF MIM-7102SECSCINCOPT IS EQUAL TO 'Y'                       01058000
010590         MOVE 'N' TO RPACT-SC-INC-OPTION.                         01059000
010600 RESA-R-ACT-CONT.                                                 01060000
010610     IF WS-SEC-FLAG IS EQUAL TO 'Y'                               01061000
010620         PERFORM RPS-ACT-REPUT-REQUEST                            01062000
010630     ELSE                                                         01063000
010640         PERFORM RPS-ACT-DELETE-REQUEST.                          01064000
010650     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01065000
010660         MOVE 'Y' TO WS-ERROR                                     01066000
010670         MOVE WS-AB6300 TO RPXXX30-ABORT                          01067000
010680         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     01068000
010690         MOVE WS-TR0022 TO RPXXX30-ABTRACE                        01069000
010700         MOVE WS-TR0022 TO RPXXX30-RESP-TRACE                     01070000
010710         GO TO RESA-EXIT.                                         01071000
010720     MOVE SPACES TO WS-SEC-FLAG.                                  01072000
010730     MOVE 'Y' TO WS-UPDATESW.                                     01073000
010740 RESA-EVT.                                                        01074000
010750     IF MIM-7100EVENTHISTORYOPT IS NOT EQUAL TO 'Y'               01075000
010760         GO TO RESA-R-SET-MSG.                                    01076000
010770     MOVE 08 TO RPS-EVT-EVENT-CODE.                               01077000
010780     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   01078000
010790     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   01079000
010800     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        01080000
010810     MOVE RPXXX30-PRIMARY-IDNUM TO RPS-EVT-IDNUMBER.              01081000
010820     PERFORM ADD-EVENT-HISTORY.                                   01082000
010830     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01083000
010840         MOVE WS-AB6360 TO RPXXX30-ABORT                          01084000
010850         MOVE WS-AB6360 TO RPXXX30-RESP-ABORT                     01085000
010860         MOVE WS-TR0023 TO RPXXX30-ABTRACE                        01086000
010870         MOVE WS-TR0023 TO RPXXX30-RESP-TRACE                     01087000
010880         GO TO CICS-RETURN.                                       01088000
010890 RESA-R-SET-MSG.                                                  01089000
010900     MOVE 500605 TO RPXXX30-RESP-MSG-NBR.                         01090000
010910 RESA-EXIT.                                                       01091000
010920     EXIT.                                                        01092000
010930******************************************************************01093000
010940 VALIDATE-SECONDARY-ACCT SECTION.                                 01094000
010950 VSA-START.                                                       01095000
010960     MOVE RPXXX30-SEC-INST TO RPRF21-BASE-ACCT-INST.              01096000
010970     MOVE RPXXX30-SEC-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.      01097000
010980     MOVE RPXXX30-SEC-ACCOUNT TO RPRF21-BASE-ACCT.                01098000
010990*    IF RPRF21-BASE-ACCT-PRODCODE IS EQUAL TO MIM-2023KPRODCODE   01099000
011000*        GO TO VSA-PRODACCT-2023.                                 01100000
011010     PERFORM READ-MICM-2023.                                      01101000
011020 VSA-PRODACCT-2023.                                               01102000
011030     IF MIM-2023RPOPTION IS EQUAL TO ' '                          01103000
011040         OR MIM-2023RPOPTION IS EQUAL TO 'N'                      01104000
011050         MOVE 'N' TO MIM-2023RPOPTION.                            01105000
011060     IF MIM-2023RPOPTION IS EQUAL TO 'N'                          01106000
011070         MOVE 500015 TO RPXXX30-RESP-MSG-NBR                      01107000
011080         MOVE 500015 TO RPXXX30-MSGNBR                            01108000
011090         GO TO VSA-END.                                           01109000
011100 VSA-2023.                                                        01110000
011110     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'N'                     01111000
011120         AND RPXXX30-PRIMARY-INST IS NOT EQUAL TO RPXXX30-SEC-INST01112000
011130         MOVE 'Y' TO WS-ERROR                                     01113000
011140         MOVE 500088 TO RPXXX30-MSGNBR                            01114000
011150         MOVE 500088 TO RPXXX30-RESP-MSG-NBR                      01115000
011160         GO TO VSA-END.                                           01116000
P0025      IF MIM-7100ENTERPRISEOPT IS NOT EQUAL TO 'Y'                 01117000
P0025          OR RPXXX30-PRIMARY-INST IS EQUAL TO RPXXX30-SEC-INST     01117290
011180         GO TO VSA-CUSTOMER.                                      01118000
P0025      MOVE ZEROS TO MIM-2024KINST.                                 01119000
P0025      MOVE 2024 TO MIM-2024KREC.                                   01119990
P0025      MOVE MIM-7100ENTERPRISEINST TO MIM-2024KGROUP-INST.          01120980
P0025      MOVE RPXXX30-SEC-INST TO MIM-2024KACCESS-INST.               01121970
P0025      MOVE MIC-MST-2024-PRI TO MIC-MST-REC-PRI.                    01122960
P0025      MOVE 50 TO MIM-2024KMANGER.                                  01123950
P0025      MOVE MI2024-RECORD TO MIMST-RECORD.                          01124940
P0025      PERFORM MIC-MST-GET-REQUEST.                                 01125930
P0025      IF WS-FUNCTION IS EQUAL TO 'N'                               01126920
P0025          MOVE 'Y' TO WS-ERROR                                     01127910
P0025          MOVE 500088 TO RPXXX30-MSGNBR                            01128900
P0025          MOVE 500088 TO RPXXX30-RESP-MSG-NBR                      01129890
P0025          GO TO VSA-END.                                           01130880
P0025      IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01131870
P0025          MOVE 'Y' TO WS-ERROR                                     01132860
P0025          MOVE WS-TR0005 TO RPXXX30-ABTRACE                        01133850
P0025          MOVE WS-TR0005 TO RPXXX30-RESP-TRACE                     01134840
P0025          MOVE WS-AB3051 TO RPXXX30-ABORT                          01135830
P0025          MOVE WS-AB3051 TO RPXXX30-RESP-ABORT                     01136820
P0025          GO TO VSA-END.                                           01137810
P0025      MOVE MIMST-RECORD TO MI2024-RECORD.                          01138800
P0025      MOVE RPXXX30-OPERID TO WS-ACCESS-OPERID.                     01139790
P0025      MOVE RPXXX30-PROFILE TO WS-ACCESS-PROFILE.                   01140780
P0025      MOVE RPXXX30-EXTERNALID TO WS-ACCESS-EXTERNALID.             01141770
P0025      MOVE MIM-7100ENTERPRISEINST TO WS-ACCESS-PRIM-INST.          01142760
P0025      MOVE RPXXX30-SEC-INST TO WS-ACCESS-ALT-INST.                 01143750
P0025      PERFORM CROSS-INSTITUTION.                                   01144740
P0025      IF WS-RPP004-ERROR IS EQUAL TO 'Y'                           01145730
P0025          MOVE 'Y' TO WS-ERROR                                     01146720
P0025          MOVE 500088 TO RPXXX30-MSGNBR                            01147710
P0025          MOVE 500088 TO RPXXX30-RESP-MSG-NBR                      01148700
P0025          GO TO VSA-END.                                           01149690
011830 VSA-CUSTOMER.                                                    01183000
011840     MOVE 'F' TO RPRF21-FUNC.                                     01184000
011850     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     01185000
011860         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        01186000
011870         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    01187000
011880     PERFORM REQUEST-CUSTOMER.                                    01188000
011890     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01189000
011900         MOVE 'Y' TO WS-ERROR                                     01190000
011910         MOVE 500016 TO RPXXX30-MSGNBR                            01191000
011920         MOVE 500016 TO RPXXX30-RESP-MSG-NBR                      01192000
011930         GO TO VSA-END.                                           01193000
011940     MOVE SPACE TO WS-ACT-FLAG.                                   01194000
011950     INITIALIZE RPACT-RECORD.                                     01195000
011960     MOVE RPXXX30-SEC-INST TO RPACT-INST.                         01196000
011970     MOVE RPXXX30-SEC-PRODCODE TO RPACT-PRODCODE.                 01197000
011980     MOVE RPXXX30-SEC-ACCOUNT TO RPACT-ACCOUNT.                   01198000
011990     PERFORM RPS-ACT-GET-REQUEST.                                 01199000
012000     IF WS-FUNCTION IS EQUAL TO 'N'                               01200000
012010         GO TO VSA-END.                                           01201000
012020     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01202000
012030         MOVE 'Y' TO WS-ERROR                                     01203000
012040         MOVE WS-AB6300 TO RPXXX30-ABORT                          01204000
012050         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     01205000
012060         MOVE WS-TR0026 TO RPXXX30-ABTRACE                        01206000
012070         MOVE WS-TR0026 TO RPXXX30-RESP-TRACE                     01207000
012080         GO TO VSA-EXIT.                                          01208000
012090     PERFORM READ-MICM-7100.                                      01209000
012100     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01210000
012110         MOVE 'Y' TO WS-ERROR                                     01211000
012120         MOVE 500005 TO RPXXX30-MSGNBR                            01212000
012130         MOVE 500005 TO RPXXX30-RESP-MSG-NBR                      01213000
012140         GO TO VSA-END.                                           01214000
012150     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      01215000
012160         MOVE 500021 TO RPXXX30-MSGNBR                            01216000
012170         MOVE 500021 TO RPXXX30-RESP-MSG-NBR                      01217000
012180         GO TO VSA-END.                                           01218000
012190     MOVE 'Y' TO WS-ACT-FLAG.                                     01219000
012200 VSA-END.                                                         01220000
012210     IF RPXXX30-UPDATE IS NOT EQUAL TO 'Y'                        01221000
012220         GO TO CICS-RETURN.                                       01222000
012230     IF WS-ERROR IS NOT EQUAL TO 'Y'                              01223000
012240         PERFORM CHECK-EXISTING-RELATIONSHIP.                     01224000
012250     IF WS-ERROR IS NOT EQUAL TO 'Y'                              01225000
012260         PERFORM VALIDATE-MODEL-REQUIREMENTS.                     01226000
012270     IF RPXXX30-APIFUNC IS EQUAL TO 'EDT'                         01227000
012280         OR WS-ERROR IS EQUAL TO 'Y'                              01228000
012290         MOVE 'EDT' TO RPXXX30-APIFUNC                            01229000
012300         GO TO CICS-RETURN.                                       01230000
012310     IF WS-UPDTSW IS NOT EQUAL TO 'Y'                             01231000
012320         GO TO CICS-RETURN.                                       01232000
012330 VSA-EXIT.                                                        01233000
012340     EXIT.                                                        01234000
012350******************************************************************01235000
012360 CHECK-EXISTING-RELATIONSHIP SECTION.                             01236000
012370 CER-START.                                                       01237000
012380     MOVE LOW-VALUES TO RPREL-GRP-KEY.                            01238000
012390     MOVE RPXXX30-PRIMARY-INST TO RPREL-INST.                     01239000
012400     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPREL-PRODCODE.            01240000
012410     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPREL-ACCOUNT.              01241000
012420     MOVE RPXXX30-PRIMARY-MODEL TO RPREL-MODEL.                   01242000
012430     PERFORM RPS-REL-GET-GE-REQUEST.                              01243000
012440     GO TO CER-TEST.                                              01244000
012450 CER-READ-NEXT.                                                   01245000
012460     PERFORM RPS-REL-GET-NEXT-REQUEST.                            01246000
012470 CER-TEST.                                                        01247000
012480     IF WS-FUNCTION IS EQUAL TO 'E'                               01248000
012490         OR WS-FUNCTION IS EQUAL TO 'N'                           01249000
012500         GO TO CER-RCIF.                                          01250000
012510     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01251000
012520         MOVE WS-AB6330 TO RPXXX30-ABORT                          01252000
012530         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     01253000
012540         MOVE WS-TR0027 TO RPXXX30-ABTRACE                        01254000
012550         MOVE WS-TR0027 TO RPXXX30-RESP-TRACE                     01255000
012560         MOVE 'EDT' TO RPXXX30-APIFUNC                            01256000
012570         GO TO CICS-RETURN.                                       01257000
012580     IF RPXXX30-PRIMARY-INST IS NOT EQUAL TO RPREL-INST           01258000
012590         OR RPXXX30-PRIMARY-PROD-CODE IS NOT EQUAL TO             01259000
012600             RPREL-PRODCODE                                       01260000
012610         OR RPXXX30-PRIMARY-ACCT-NBR IS NOT EQUAL TO RPREL-ACCOUNT01261000
012620         GO TO CER-RCIF.                                          01262000
012630     IF RPXXX30-SEC-INST IS EQUAL TO RPREL-INST2                  01263000
012640         AND RPXXX30-SEC-PRODCODE IS EQUAL TO RPREL-PRODCODE2     01264000
012650         AND RPXXX30-SEC-ACCOUNT IS EQUAL TO RPREL-ACCOUNT2       01265000
012660         MOVE 'Y' TO WS-ERROR                                     01266000
012670         MOVE 500021 TO RPXXX30-MSGNBR                            01267000
012680         MOVE 500021 TO RPXXX30-RESP-MSG-NBR                      01268000
012690         GO TO CER-EXIT.                                          01269000
012700     GO TO CER-READ-NEXT.                                         01270000
012710 CER-RCIF.                                                        01271000
P0111      IF WS-RELCHECK IS EQUAL TO 'N'                               01271100
P0111          GO TO CER-RCIF-CONT.                                     01271200
P0111      MOVE RPXXX30-PRIMARY-INST TO WS-RPW008-INST.                 01271300
P0111      MOVE RPRF21-REL TO WS-RPW008-RELNBR.                         01271400
P0111      MOVE WS-RPMIM7104SC TO WS-RPW008-RELCODE.                    01271500
P0111      PERFORM VALIDATE-PRIM-RELCD.                                 01271600
P0111      IF WS-PRIMRELCD-ERROR IS EQUAL TO 'Y'                        01271700
P0111          GO TO CER-SECONDARY.                                     01271800
P0111  CER-RCIF-CONT.                                                   01271900
012720     INITIALIZE RPRF21-MESSAGE.                                   01272000
012730     MOVE 'B' TO RPRF21-FUNC.                                     01273000
012740     MOVE WS-RCIF-KEY TO RPRF21-BASE-RCIF-KEY.                    01274000
012750     MOVE LOW-VALUES TO RPRF21-BASE-ACCOUNT.                      01275000
012760     PERFORM REQUEST-CUSTOMER.                                    01276000
012770     IF WS-MSGNBR IS NOT EQUAL TO ZERO                            01277000
012780         MOVE WS-MSGNBR TO RPXXX30-MSGNBR                         01278000
012790         MOVE WS-MSGNBR TO RPXXX30-RESP-MSG-NBR.                  01279000
012800     GO TO CER-RCIF-TEST.                                         01280000
012810 CER-RCIF-NEXT.                                                   01281000
012820     MOVE 'C' TO RPRF21-FUNC.                                     01282000
012830     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     01283000
012840         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        01284000
012850         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    01285000
012860     PERFORM REQUEST-CUSTOMER.                                    01286000
012870 CER-RCIF-TEST.                                                   01287000
012880     IF WS-FUNCTION IS EQUAL TO 'N'                               01288000
012890         AND WS-RELCHECK IS EQUAL TO 'Y'                          01289000
012900         GO TO CER-SECONDARY.                                     01290000
012910     IF WS-FUNCTION IS EQUAL TO 'N'                               01291000
012920         ADD +3 TO RPXXX30-ERRCNT                                 01292000
012930         MOVE 'Y' TO WS-ERROR                                     01293000
012940         MOVE 500094 TO RPXXX30-MSGNBR                            01294000
012950         MOVE 500094 TO RPXXX30-RESP-MSG-NBR                      01295000
012960         GO TO CER-EXIT.                                          01296000
012970     IF WS-FUNCTION IS EQUAL TO 'C'                               01297000
012980         MOVE 'Y' TO WS-ERROR                                     01298000
012990         MOVE 500037 TO RPXXX30-MSGNBR                            01299000
013000         MOVE 500037 TO RPXXX30-RESP-MSG-NBR                      01300000
013010         GO TO CER-EXIT.                                          01301000
013020     IF WS-FUNCTION IS EQUAL TO 'I'                               01302000
013030         MOVE 'Y' TO WS-ERROR                                     01303000
013040         MOVE 500038 TO RPXXX30-MSGNBR                            01304000
013050         MOVE 500038 TO RPXXX30-RESP-MSG-NBR                      01305000
013060         GO TO CER-EXIT.                                          01306000
013070     IF RPXXX30-SEC-INST IS EQUAL TO RPRF21-ACCT-ALT-INST         01307000
013080         AND RPXXX30-SEC-PRODCODE IS EQUAL TO                     01308000
013090             RPRF21-BASE-ACCT-PRODCODE                            01309000
013100         AND RPXXX30-SEC-ACCOUNT IS EQUAL TO RPRF21-BASE-ACCT     01310000
P0111          GO TO CER-CUSTRELCD.                                     01311000
013120     GO TO CER-RCIF-NEXT.                                         01312000
P0111  CER-CUSTRELCD.                                                   01312100
P0111      IF WS-7104-REL IS EQUAL TO SPACES                            01312200
P0111          GO TO CER-EXIT.                                          01312300
P0111      PERFORM READ-MICM-7104.                                      01312400
P0111      IF WS-KEEP-FLAG IS EQUAL TO 'N'                              01312500
P0111          GO TO CER-SECONDARY.                                     01312600
P0111      GO TO CER-EXIT.                                              01312700
013130* CHECK TO SECONDARY ACCOUNTS AND SEND ERROR MESSAGE IF           01313000
013140* MATCH IS FOUND WITH ACCOUNT BEING ADDED.                        01314000
013150 CER-SECONDARY.                                                   01315000
P0111      IF WS-RELCHECK IS EQUAL TO 'N'                               01315100
P0111          ADD +3 TO RPXXX30-ERRCNT                                 01315200
P0111          MOVE 'Y' TO WS-ERROR                                     01315300
P0111          MOVE 500094 TO RPXXX30-MSGNBR                            01315400
P0111          MOVE 500094 TO RPXXX30-RESP-MSG-NBR                      01315500
P0111          GO TO CER-EXIT.                                          01315600
013160     MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST.          01316000
013170     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPRF21-BASE-ACCT-PRODCODE. 01317000
013180     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPRF21-BASE-ACCT.           01318000
013190     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     01319000
013200         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        01320000
013210         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    01321000
013220     MOVE ZERO TO WS-SECONDARY-CUST.                              01322000
013230     PERFORM REQUEST-SECONDARY-CUSTOMER.                          01323000
013240 CSER-NEXT-SECONDARY.                                             01324000
013250     ADD +1 TO WS-SCSUB.                                          01325000
013260     IF WS-SCSUB IS GREATER THAN WS-SECONDARY-CUST                01326000
013270         ADD +3 TO RPXXX30-ERRCNT                                 01327000
013280         MOVE 'Y' TO WS-ERROR                                     01328000
013290         MOVE 500094 TO RPXXX30-MSGNBR                            01329000
013300         MOVE 500094 TO RPXXX30-RESP-MSG-NBR                      01330000
013310         GO TO CER-EXIT.                                          01331000
013320     MOVE WS-SEC-INST (WS-SCSUB) TO WS-NEW-INST.                  01332000
013330     MOVE WS-SEC-CUST-TYPE (WS-SCSUB) TO WS-NEW-CUST-TYPE.        01333000
013340     MOVE WS-SEC-CUST (WS-SCSUB) TO WS-NEW-CUST.                  01334000
013350     MOVE WS-NEW-CUSTKEY TO RPRF21-BASE-CUSTOMER.                 01335000
013360     MOVE WS-NEW-CUSTKEY TO WS-RCIF-KEY.                          01336000
013370 CSER-RCIF.                                                       01337000
013380     INITIALIZE RPRF21-MESSAGE.                                   01338000
013390     MOVE 'B' TO RPRF21-FUNC.                                     01339000
013400     MOVE WS-RCIF-KEY TO RPRF21-BASE-RCIF-KEY.                    01340000
013410     MOVE LOW-VALUES TO RPRF21-BASE-ACCOUNT.                      01341000
013420     PERFORM REQUEST-CUSTOMER.                                    01342000
013430     GO TO CSER-RCIF-TEST.                                        01343000
013440 CSER-RCIF-NEXT.                                                  01344000
013450     MOVE 'C' TO RPRF21-FUNC.                                     01345000
013460     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     01346000
013470         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        01347000
013480         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    01348000
013490     PERFORM REQUEST-CUSTOMER.                                    01349000
013500 CSER-RCIF-TEST.                                                  01350000
013510     IF WS-FUNCTION IS EQUAL TO 'N'                               01351000
013520         GO TO CSER-NEXT-SECONDARY.                               01352000
013530     IF WS-FUNCTION IS EQUAL TO 'C'                               01353000
013540         OR WS-FUNCTION IS EQUAL TO 'I'                           01354000
013550         ADD +3 TO RPXXX30-ERRCNT                                 01355000
013560         MOVE 'Y' TO WS-ERROR                                     01356000
013570         MOVE WS-MSGNBR TO RPXXX30-MSGNBR                         01357000
013580         MOVE WS-MSGNBR TO RPXXX30-RESP-MSG-NBR                   01358000
013590         GO TO CER-EXIT.                                          01359000
013600* TEST IF ACCOUNT TO ADD IS A SECONDARY ACCOUNT                   01360000
013610     IF RPXXX30-SEC-INST IS EQUAL TO RPRF21-ACCT-ALT-INST         01361000
013620         AND RPXXX30-SEC-PRODCODE IS EQUAL TO                     01362000
013630             RPRF21-BASE-ACCT-PRODCODE                            01363000
013640         AND RPXXX30-SEC-ACCOUNT IS EQUAL TO RPRF21-BASE-ACCT     01364000
P0111          GO TO CER-CUSTRELCD1.                                    01365000
013660     GO TO CSER-RCIF-NEXT.                                        01366000
P0111  CER-CUSTRELCD1.                                                  01366100
P0111      IF WS-7104-REL IS EQUAL TO SPACES                            01366200
P0111          GO TO CER-EXIT.                                          01366300
P0111      PERFORM READ-MICM-7104.                                      01366400
P0111      IF WS-KEEP-FLAG IS EQUAL TO 'N'                              01366500
P0111          GO TO CSER-RCIF-NEXT.                                    01366600
013670 CER-EXIT.                                                        01367000
013680     EXIT.                                                        01368000
013690******************************************************************01369000
013700 REQUEST-SECONDARY-CUSTOMER SECTION.                              01370000
013710 RSC-START.                                                       01371000
013720     MOVE 'X' TO RPRF21-FUNC.                                     01372000
013730     MOVE SPACES TO RPRF21-FUNCTION.                              01373000
013740     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             01374000
013750     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         01375000
013760     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          01376000
013770     EXEC CICS LINK                                               01377000
013780         PROGRAM('RPO0RF21')                                      01378000
013790         COMMAREA(RPRF21-MESSAGE)                                 01379000
013800         LENGTH(LENGTH OF RPRF21-MESSAGE)                         01380000
013810         RESP(WS-CICS-RESPONSE)                                   01381000
013820         END-EXEC.                                                01382000
013830     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         01383000
013840     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     01384000
013850         MOVE 'L' TO WS-FUNCTION                                  01385000
013860         MOVE 500036 TO WS-MSGNBR                                 01386000
013870         GO TO RSC-EXIT.                                          01387000
013880     IF WS-FUNCTION IS EQUAL TO 'B'                               01388000
013890         MOVE 500045 TO WS-MSGNBR                                 01389000
013900         GO TO RSC-EXIT.                                          01390000
013910     IF WS-FUNCTION IS EQUAL TO 'C'                               01391000
013920         MOVE 500037 TO WS-MSGNBR                                 01392000
013930         GO TO RSC-EXIT.                                          01393000
013940     IF WS-FUNCTION IS EQUAL TO 'I'                               01394000
013950         MOVE 500038 TO WS-MSGNBR.                                01395000
013960     MOVE RPRF21-RETURNED-OBJECT TO WS-ACC-TABLE.                 01396000
013990     PERFORM REMOVE-SECONDARY-CUSTOMERS.                          01399000
014000 RSC-EXIT.                                                        01400000
014010     EXIT.                                                        01401000
014020******************************************************************01402000
014030 UPDATE-RP-RECORDS SECTION.                                       01403000
014040 URPR-START.                                                      01404000
014050     INITIALIZE RPREL-RECORD.                                     01405000
014060     MOVE RPXXX30-PRIMARY-ACCT TO RPREL-ACCT1-GRP.                01406000
014070     MOVE RPXXX30-SECONDARY-ACCT TO RPREL-ACCT2-GRP.              01407000
014080     MOVE RPREL-INST2 TO RPRF21-BASE-ACCT-INST.                   01408000
014090     MOVE RPREL-PRODCODE2 TO RPRF21-BASE-ACCT-PRODCODE.           01409000
014100     PERFORM READ-MICM-7102.                                      01410000
014110     IF WS-7102-FLAG IS EQUAL TO 'N'                              01411000
014120         MOVE WS-AB3051 TO RPXXX30-ABORT                          01412000
014130         MOVE WS-AB3051 TO RPXXX30-RESP-ABORT                     01413000
014140         MOVE WS-TR0028 TO RPXXX30-ABTRACE                        01414000
014150         MOVE WS-TR0028 TO RPXXX30-RESP-TRACE                     01415000
014160         GO TO CICS-RETURN.                                       01416000
014170     PERFORM RPS-REL-GET-LOCK-REQUEST.                            01417000
014180     IF WS-FUNCTION IS EQUAL TO 'N'                               01418000
014190         GO TO URPR-A-REL.                                        01419000
014200     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01420000
014210         MOVE WS-AB6330 TO RPXXX30-ABORT                          01421000
014220         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     01422000
014230         MOVE WS-TR0029 TO RPXXX30-ABTRACE                        01423000
014240         MOVE WS-TR0029 TO RPXXX30-RESP-TRACE                     01424000
014250         GO TO CICS-RETURN.                                       01425000
014260     MOVE 'A' TO RPREL-ACCT-STATUS.                               01426000
014270     PERFORM RPS-REL-REPUT-REQUEST.                               01427000
014280     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01428000
014290         MOVE WS-AB6330 TO RPXXX30-ABORT                          01429000
014300         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     01430000
014310         MOVE WS-TR0030 TO RPXXX30-ABTRACE                        01431000
014320         MOVE WS-TR0030 TO RPXXX30-RESP-TRACE                     01432000
014330         GO TO CICS-RETURN.                                       01433000
014340     GO TO URPR-A-SEC.                                            01434000
014350 URPR-A-REL.                                                      01435000
014360     INITIALIZE RPREL-RECORD.                                     01436000
014370     MOVE RPXXX30-PRIMARY-ACCT TO RPREL-ACCT1-GRP.                01437000
014380     MOVE RPXXX30-SECONDARY-ACCT TO RPREL-ACCT2-GRP.              01438000
014390     MOVE 'A' TO RPREL-ACCT-STATUS.                               01439000
014400     MOVE WS-ACCT-TYPE TO RPREL-ACCT-TYPE.                        01440000
014410     MOVE WS-BRANCH TO RPREL-BRANCH.                              01441000
014420     MOVE WS-INF-APPLR TO RPREL-APPL.                             01442000
014430     MOVE RPMST-MODEL TO RPREL-MODEL.                             01443000
014440     PERFORM RPS-REL-PUT-REQUEST.                                 01444000
014450     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01445000
014460         MOVE WS-AB6330 TO RPXXX30-ABORT                          01446000
014470         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     01447000
014480         MOVE WS-TR0031 TO RPXXX30-ABTRACE                        01448000
014490         MOVE WS-TR0031 TO RPXXX30-RESP-TRACE                     01449000
014500         GO TO CICS-RETURN.                                       01450000
014510     MOVE 'Y' TO WS-UPDATESW.                                     01451000
014520 URPR-A-SEC.                                                      01452000
014530     INITIALIZE RPSEC-RECORD.                                     01453000
014540     MOVE RPREL-INST2 TO RPSEC-INST.                              01454000
014550     MOVE RPREL-PRODCODE2 TO RPSEC-PRODCODE.                      01455000
014560     MOVE RPREL-ACCOUNT2 TO RPSEC-ACCOUNT.                        01456000
014570     MOVE RPREL-MODEL TO RPSEC-MODEL2.                            01457000
014580     MOVE RPREL-INST TO RPSEC-INST2.                              01458000
014590     MOVE RPREL-PRODCODE TO RPSEC-PRODCODE2.                      01459000
014600     MOVE RPREL-ACCOUNT TO RPSEC-ACCOUNT2.                        01460000
014610     MOVE RPSEC-INST TO RPSEC-ALT-INST.                           01461000
014620     MOVE RPSEC-PRODCODE TO RPSEC-ALT-PRODCODE.                   01462000
014630     MOVE RPSEC-ACCOUNT TO RPSEC-ALT-ACCOUNT.                     01463000
014640     PERFORM RPS-SEC-PUT-REQUEST.                                 01464000
014650     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01465000
014660         MOVE WS-AB6335 TO RPXXX30-ABORT                          01466000
014670         MOVE WS-AB6335 TO RPXXX30-RESP-TRACE                     01467000
014680         MOVE WS-TR0032 TO RPXXX30-ABTRACE                        01468000
014690         MOVE WS-TR0032 TO RPXXX30-RESP-TRACE                     01469000
014700         GO TO CICS-RETURN.                                       01470000
014710     MOVE SPACE TO WS-ACT-FLAG.                                   01471000
014720     IF MIM-7100DUPINCOPT IS EQUAL TO 'Y'                         01472000
014730         GO TO URPR-EXIT.                                         01473000
014740     INITIALIZE RPACT-RECORD.                                     01474000
014750     MOVE RPSEC-ACCT1-GRP TO RPACT-GRP-KEY.                       01475000
014760     PERFORM RPS-ACT-GET-LOCK-REQUEST.                            01476000
014770     IF WS-FUNCTION IS EQUAL TO 'N'                               01477000
014780         MOVE 'N' TO WS-ACT-FLAG                                  01478000
014790         GO TO URPR-A-ACT.                                        01479000
014800     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01480000
014810         MOVE WS-AB6300 TO RPXXX30-ABORT                          01481000
014820         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     01482000
014830         MOVE WS-TR0033 TO RPXXX30-ABTRACE                        01483000
014840         MOVE WS-TR0033 TO RPXXX30-RESP-TRACE                     01484000
014850         GO TO CICS-RETURN.                                       01485000
014860     MOVE 'Y' TO WS-ACT-FLAG.                                     01486000
014870 URPR-A-ACT.                                                      01487000
014880     IF WS-ACT-FLAG IS EQUAL TO 'Y'                               01488000
014890         GO TO URPR-A-ACT-CONT.                                   01489000
014900     INITIALIZE RPACT-RECORD.                                     01490000
014910     MOVE RPSEC-ACCT1-GRP TO RPACT-GRP-KEY.                       01491000
014920     MOVE WS-INF-APPLR TO RPACT-APPL.                             01492000
014930     MOVE 'N' TO RPACT-SC-INC-QUAL.                               01493000
014940     MOVE 'N' TO RPACT-SC-INC-OPTION.                             01494000
014950     MOVE 'N' TO RPACT-RATE-INC-QUAL.                             01495000
014960     MOVE 'N' TO RPACT-RATE-INC-OPTION.                           01496000
014970     MOVE 'N' TO RPACT-PROCOPT.                                   01497000
014980 URPR-A-ACT-CONT.                                                 01498000
014990     IF MIM-7102SECSCINCOPT IS EQUAL TO 'Y'                       01499000
015000         MOVE 'Y' TO RPACT-SC-INC-OPTION.                         01500000
015010     IF MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                     01501000
015020         MOVE 'Y' TO RPACT-RATE-INC-OPTION.                       01502000
015030     IF WS-ACT-FLAG IS EQUAL TO 'Y'                               01503000
015040         PERFORM RPS-ACT-REPUT-REQUEST                            01504000
015050     ELSE                                                         01505000
015060         PERFORM RPS-ACT-PUT-REQUEST.                             01506000
015070     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01507000
015080         MOVE WS-AB6300 TO RPXXX30-ABORT                          01508000
015090         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     01509000
015100         MOVE WS-TR0034 TO RPXXX30-ABTRACE                        01510000
015110         MOVE WS-TR0034 TO RPXXX30-RESP-TRACE                     01511000
015120         GO TO CICS-RETURN.                                       01512000
015130     MOVE SPACES TO WS-SEC-FLAG.                                  01513000
015140     MOVE 'Y' TO WS-UPDATESW.                                     01514000
015150 URPR-EXIT.                                                       01515000
015160     EXIT.                                                        01516000
015170******************************************************************01517000
015180 VALIDATE-MODEL-REQUIREMENTS SECTION.                             01518000
015190 VMR-START.                                                       01519000
015200     MOVE RPXXX30-SEC-INST TO RPRF21-BASE-ACCT-INST.              01520000
015210     MOVE RPXXX30-SEC-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.      01521000
015220     MOVE RPXXX30-SEC-ACCOUNT TO RPRF21-BASE-ACCT.                01522000
015230     IF RPRF21-BASE-ACCT-PRODCODE IS EQUAL TO MIM-2023KPRODCODE   01523000
015240         GO TO VMR-2023.                                          01524000
015250     PERFORM READ-MICM-2023.                                      01525000
015260 VMR-2023.                                                        01526000
015270     IF MIM-2023RPOPTION IS EQUAL TO ' '                          01527000
015280         OR MIM-2023RPOPTION IS EQUAL TO 'N'                      01528000
015290         MOVE 'N' TO MIM-2023RPOPTION.                            01529000
015300     IF MIM-2023RPOPTION IS EQUAL TO 'N'                          01530000
015310         MOVE 500015 TO RPXXX30-MSGNBR                            01531000
015320         MOVE 500015 TO RPXXX30-RESP-MSG-NBR                      01532000
015330         GO TO VMR-ERROR.                                         01533000
015340     IF MIM-2023RPOPTION IS NOT EQUAL TO 'Y'                      01534000
015350         MOVE ZEROS TO RPINF00-BRANCH                             01535000
015360         MOVE ZEROS TO RPINF00-ACCT-TYPE                          01536000
015370         MOVE MIM-2023INTAPPL211 TO RPINF00-APPLR                 01537000
015380         MOVE 'N' TO WS-INTERFACE                                 01538000
015390         GO TO VMR-7102.                                          01539000
015400     PERFORM READ-MICM-0237.                                      01540000
015410     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01541000
015420         OR MIM-237OLINTFC IS NOT GREATER THAN SPACES             01542000
015430         MOVE 500024 TO RPXXX30-MSGNBR                            01543000
015440         MOVE 500024 TO RPXXX30-RESP-MSG-NBR                      01544000
015450         GO TO VMR-ERROR.                                         01545000
015460     PERFORM LINK-INTERFACE.                                      01546000
015470     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01547000
015480         GO TO VMR-ERROR.                                         01548000
015490     MOVE RPINF00-BRANCH TO WS-BRANCH.                            01549000
015500 VMR-7102.                                                        01550000
015510     PERFORM READ-MICM-7102.                                      01551000
015520     IF WS-7102-FLAG IS EQUAL TO 'N'                              01552000
015530         MOVE 500007 TO RPXXX30-MSGNBR                            01553000
015540         MOVE 500007 TO RPXXX30-RESP-MSG-NBR                      01554000
015550         GO TO VMR-ERROR.                                         01555000
015560     IF RPINF00-TERM IS NOT NUMERIC                               01556000
015570         MOVE ZEROS TO RPINF00-TERM.                              01557000
015580 VMR-MIN-TERM.                                                    01558000
015590     IF (MIM-7102MINTERM-Q IS NOT EQUAL TO 'B'                    01559000
015600         AND MIM-7102MINTERM-Q IS NOT EQUAL TO 'E')               01560000
015610         OR MIM-7102MINTERM IS NOT GREATER THAN ZERO              01561000
015620         GO TO VMR-MAX-TERM.                                      01562000
015630     IF RPINF00-TERM IS LESS THAN MIM-7102MINTERM                 01563000
015640         MOVE 500047 TO RPXXX30-MSGNBR                            01564000
015650         MOVE 500047 TO RPXXX30-RESP-MSG-NBR                      01565000
015660         GO TO VMR-ERROR.                                         01566000
015670 VMR-MAX-TERM.                                                    01567000
015680     IF (MIM-7102MAXTERM-Q IS NOT EQUAL TO 'B'                    01568000
015690         AND MIM-7102MAXTERM-Q IS NOT EQUAL TO 'E')               01569000
015700         OR MIM-7102MAXTERM IS NOT GREATER THAN ZERO              01570000
015710         GO TO VMR-USEROPT1.                                      01571000
015720     IF RPINF00-TERM IS GREATER THAN MIM-7102MAXTERM              01572000
015730         MOVE 500048 TO RPXXX30-MSGNBR                            01573000
015740         MOVE 500048 TO RPXXX30-RESP-MSG-NBR                      01574000
015750         GO TO VMR-ERROR.                                         01575000
015760 VMR-USEROPT1.                                                    01576000
015770     IF MIM-7102USERTYPE1 IS EQUAL TO 'P'                         01577000
015780         GO TO VMR-USEROPT2.                                      01578000
015790     IF (MIM-7102USEROPT1-Q IS NOT EQUAL TO 'B'                   01579000
015800         AND MIM-7102USEROPT1-Q IS NOT EQUAL TO 'E')              01580000
015810         GO TO VMR-USEROPT2.                                      01581000
015820     IF (MIM-7102USEROPTREL1 IS EQUAL TO 'EQ'                     01582000
015830         AND RPINF00-USEROPT1 IS NOT EQUAL TO MIM-7102USEROPT1)   01583000
015840         OR (MIM-7102USEROPTREL1 IS EQUAL TO 'NE'                 01584000
015850         AND RPINF00-USEROPT1 IS EQUAL TO MIM-7102USEROPT1)       01585000
015860         MOVE 500083 TO RPXXX30-MSGNBR                            01586000
015870         MOVE 500083 TO RPXXX30-RESP-MSG-NBR                      01587000
015880         GO TO VMR-ERROR.                                         01588000
015890 VMR-USEROPT2.                                                    01589000
015900     IF MIM-7102USERTYPE2 IS EQUAL TO 'P'                         01590000
015910         GO TO VMR-USEROPT3.                                      01591000
015920     IF (MIM-7102USEROPT2-Q IS NOT EQUAL TO 'B'                   01592000
015930         AND MIM-7102USEROPT2-Q IS NOT EQUAL TO 'E')              01593000
015940         GO TO VMR-USEROPT3.                                      01594000
015950     IF (MIM-7102USEROPTREL2 IS EQUAL TO 'EQ'                     01595000
015960         AND RPINF00-USEROPT2 IS NOT EQUAL TO MIM-7102USEROPT2)   01596000
015970         OR (MIM-7102USEROPTREL2 IS EQUAL TO 'NE'                 01597000
015980         AND RPINF00-USEROPT2 IS EQUAL TO MIM-7102USEROPT2)       01598000
015990         MOVE 500084 TO RPXXX30-MSGNBR                            01599000
016000         MOVE 500084 TO RPXXX30-RESP-MSG-NBR                      01600000
016010         GO TO VMR-ERROR.                                         01601000
016020 VMR-USEROPT3.                                                    01602000
016030     IF MIM-7102USERTYPE3 IS EQUAL TO 'P'                         01603000
016040         GO TO VMR-USEROPT4.                                      01604000
016050     IF (MIM-7102USEROPT3-Q IS NOT EQUAL TO 'B'                   01605000
016060         AND MIM-7102USEROPT3-Q IS NOT EQUAL TO 'E')              01606000
016070         GO TO VMR-USEROPT4.                                      01607000
016080     IF (MIM-7102USEROPTREL3 IS EQUAL TO 'EQ'                     01608000
016090         AND RPINF00-USEROPT3 IS NOT EQUAL TO MIM-7102USEROPT3)   01609000
016100         OR (MIM-7102USEROPTREL3 IS EQUAL TO 'NE'                 01610000
016110         AND RPINF00-USEROPT3 IS EQUAL TO MIM-7102USEROPT3)       01611000
016120         MOVE 500085 TO RPXXX30-MSGNBR                            01612000
016130         MOVE 500085 TO RPXXX30-RESP-MSG-NBR                      01613000
016140         GO TO VMR-ERROR.                                         01614000
016150 VMR-USEROPT4.                                                    01615000
016160     IF MIM-7102USERTYPE4 IS EQUAL TO 'P'                         01616000
016170         GO TO VMR-BALANCES.                                      01617000
016180     IF (MIM-7102USEROPT4-Q IS NOT EQUAL TO 'B'                   01618000
016190         AND MIM-7102USEROPT4-Q IS NOT EQUAL TO 'E')              01619000
016200         GO TO VMR-BALANCES.                                      01620000
016210     IF (MIM-7102USEROPTREL4 IS EQUAL TO 'EQ'                     01621000
016220         AND RPINF00-USEROPT4 IS NOT EQUAL TO MIM-7102USEROPT4)   01622000
016230         OR (MIM-7102USEROPTREL4 IS EQUAL TO 'NE'                 01623000
016240         AND RPINF00-USEROPT4 IS EQUAL TO MIM-7102USEROPT4)       01624000
016250         MOVE 500086 TO RPXXX30-MSGNBR                            01625000
016260         MOVE 500086 TO RPXXX30-RESP-MSG-NBR                      01626000
016270         GO TO VMR-ERROR.                                         01627000
016280 VMR-BALANCES.                                                    01628000
016290     IF MIM-2023RPOPTION IS NOT EQUAL TO 'Y'                      01629000
016300         GO TO VMR-INCENTIVE.                                     01630000
016310     IF MIM-7102PRIMCATCD-Q IS NOT EQUAL TO 'E'                   01631000
016320         GO TO VMR-BALCATCD.                                      01632000
016330     IF MIM-7102PRIMCATCD IS EQUAL TO SPACES                      01633000
016340         MOVE 502015 TO RPXXX30-MSGNBR                            01634000
016350         MOVE 502015 TO RPXXX30-RESP-MSG-NBR                      01635000
016360         GO TO VMR-ERROR.                                         01636000
016370     MOVE MIM-7102PRIMCATCD TO WS-WORK-CATCD.                     01637000
016380     PERFORM READ-MICM-7106.                                      01638000
016390     IF WS-FUNCTION IS EQUAL TO 'N'                               01639000
016400         MOVE 502015 TO RPXXX30-MSGNBR                            01640000
016410         MOVE 502015 TO RPXXX30-RESP-MSG-NBR                      01641000
016420         GO TO VMR-ERROR.                                         01642000
016430     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01643000
016440     PERFORM GET-BALANCE.                                         01644000
016450     IF WS-WORK-BALANCE IS LESS THAN MIM-7106BALREQ-E             01645000
016460         MOVE 502016 TO RPXXX30-MSGNBR                            01646000
016470         MOVE 502016 TO RPXXX30-RESP-MSG-NBR                      01647000
016480         GO TO VMR-ERROR.                                         01648000
016490 VMR-BALCATCD.                                                    01649000
016500     MOVE 'N' TO WS-BALCATCD1-FAIL.                               01650000
016510     IF MIM-7101PRIMBALOPT-Q IS NOT EQUAL TO 'E'                  01651000
016520         GO TO VMR-INCENTIVE.                                     01652000
016530     IF MIM-7101PRIMBALOPT IS EQUAL TO 'N'                        01653000
016540         GO TO VMR-INCENTIVE.                                     01654000
016550     IF MIM-7101ACCTRELCD-Q IS NOT EQUAL TO 'E'                   01655000
016560         GO TO VMR-INCENTIVE.                                     01656000
016570     IF MIM-7101ACCTRELCDQ IS NOT EQUAL TO 'A'                    01657000
016580         GO TO VMR-INCENTIVE.                                     01658000
016590     IF MIM-7102BALCATCD1-Q IS NOT EQUAL TO 'E'                   01659000
016600         GO TO VMR-BALCATCD2.                                     01660000
016610     IF MIM-7102BALCATCD1 IS EQUAL TO SPACES                      01661000
016620         MOVE 502017 TO RPXXX30-MSGNBR                            01662000
016630         MOVE 502017 TO RPXXX30-RESP-MSG-NBR                      01663000
016640         GO TO VMR-ERROR.                                         01664000
016650     MOVE MIM-7102BALCATCD1 TO WS-WORK-CATCD.                     01665000
016660     PERFORM READ-MICM-7106.                                      01666000
016670     IF WS-FUNCTION IS EQUAL TO 'N'                               01667000
016680         MOVE 502017 TO RPXXX30-MSGNBR                            01668000
016690         MOVE 502017 TO RPXXX30-RESP-MSG-NBR                      01669000
016700         GO TO VMR-ERROR.                                         01670000
016710     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01671000
016720     PERFORM GET-BALANCE.                                         01672000
016730     IF WS-WORK-BALANCE IS NOT LESS THAN MIM-7106BALREQ-E         01673000
016740         GO TO VMR-INCENTIVE.                                     01674000
016750     MOVE 'Y' TO WS-BALCATCD1-FAIL.                               01675000
016760 VMR-BALCATCD2.                                                   01676000
016770     IF MIM-7102BALCATCD2-Q IS NOT EQUAL TO 'E'                   01677000
016780         AND WS-BALCATCD1-FAIL IS EQUAL TO 'Y'                    01678000
016790         MOVE 502019 TO RPXXX30-MSGNBR                            01679000
016800         MOVE 502019 TO RPXXX30-RESP-MSG-NBR                      01680000
016810         GO TO VMR-ERROR.                                         01681000
016820     IF MIM-7102BALCATCD2-Q IS NOT EQUAL TO 'E'                   01682000
016830         GO TO VMR-INCENTIVE.                                     01683000
016840     IF MIM-7102BALCATCD2 IS EQUAL TO SPACES                      01684000
016850         MOVE 502018 TO RPXXX30-MSGNBR                            01685000
016860         MOVE 502018 TO RPXXX30-RESP-MSG-NBR                      01686000
016870         GO TO VMR-ERROR.                                         01687000
016880     MOVE MIM-7102BALCATCD2 TO WS-WORK-CATCD.                     01688000
016890     PERFORM READ-MICM-7106.                                      01689000
016900     IF WS-FUNCTION IS EQUAL TO 'N'                               01690000
016910         MOVE 502018 TO RPXXX30-MSGNBR                            01691000
016920         MOVE 502018 TO RPXXX30-RESP-MSG-NBR                      01692000
016930         GO TO VMR-ERROR.                                         01693000
016940     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01694000
016950     PERFORM GET-BALANCE.                                         01695000
016960     IF WS-WORK-BALANCE IS LESS THAN MIM-7106BALREQ-E             01696000
016970         MOVE 502019 TO RPXXX30-MSGNBR                            01697000
016980         MOVE 502019 TO RPXXX30-RESP-MSG-NBR                      01698000
016990         GO TO VMR-ERROR.                                         01699000
017000 VMR-INCENTIVE.                                                   01700000
017010     IF WS-ACT-FLAG IS NOT EQUAL TO 'Y'                           01701000
017020         OR MIM-7100ADDONINCOPT IS EQUAL TO 'N'                   01702000
017030         OR MIM-7100DUPINCOPT IS EQUAL TO 'Y'                     01703000
017040         GO TO VMR-7107.                                          01704000
017050     IF (MIM-7102SECSCINCOPT IS EQUAL TO 'Y'                      01705000
017060         AND RPACT-SC-INC-OPTION IS EQUAL TO 'Y')                 01706000
017070         OR (MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                01707000
017080         AND RPACT-RATE-INC-OPTION IS EQUAL TO 'Y')               01708000
017090         MOVE 500027 TO RPXXX30-MSGNBR                            01709000
017100         MOVE 500027 TO RPXXX30-RESP-MSG-NBR                      01710000
017110         GO TO VMR-ERROR.                                         01711000
017120 VMR-7107.                                                        01712000
017130     IF MIM-7102BRCHREGIONCD IS NOT GREATER THAN SPACES           01713000
017140         OR (MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'B'           01714000
017150         AND MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'E')          01715000
017160         GO TO VMR-USER-EXIT.                                     01716000
017170     IF WS-BRANCH IS EQUAL TO ZEROS                               01717000
017180         GO TO VMR-USER-EXIT.                                     01718000
017190     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7107INST.               01719000
017200     MOVE RPXXX30-SEC-INST TO WS-RPMIM7107INST2.                  01720000
017210     MOVE WS-BRANCH TO WS-RPMIM7107BRCHREGION.                    01721000
017220     MOVE MIM-7102BRCHREGIONCD TO WS-RPMIM7107RPREC.              01722000
017230     PERFORM VALIDATE-BRANCH.                                     01723000
017240     IF WS-RPMIM7107ERROR IS NOT EQUAL TO SPACES                  01724000
017250         MOVE 500030 TO RPXXX30-MSGNBR                            01725000
017260         MOVE 500030 TO RPXXX30-RESP-MSG-NBR                      01726000
017270         GO TO VMR-ERROR.                                         01727000
017280 VMR-USER-EXIT.                                                   01728000
017290     IF MIM-7102USERRTN IS NOT EQUAL TO 'Y'                       01729000
017300         OR (MIM-7102USERRTN-Q IS NOT EQUAL TO 'B'                01730000
017310         AND MIM-7102USERRTN-Q IS NOT EQUAL TO 'E')               01731000
017320         GO TO VMR-EXIT.                                          01732000
017330     PERFORM USER-EXIT.                                           01733000
017340     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01734000
017350         OR RPUSER-PASSED IS NOT EQUAL TO 'Y'                     01735000
017360         MOVE 500031 TO RPXXX30-MSGNBR                            01736000
017370         MOVE 500031 TO RPXXX30-RESP-MSG-NBR                      01737000
017380         GO TO VMR-ERROR.                                         01738000
017390     GO TO VMR-EXIT.                                              01739000
017400 VMR-ERROR.                                                       01740000
017410     MOVE 'Y' TO WS-ERROR.                                        01741000
017420 VMR-EXIT.                                                        01742000
017430     EXIT.                                                        01743000
017440******************************************************************01744000
017450 READ-MICM-7104SECUST SECTION.                                    01745000
017460 RM7104SC-START.                                                  01746000
017470     MOVE SPACES TO MI7104-RECORD.                                01747000
017480     MOVE RPXXX30-PRIMARY-INST TO MIM-7104KINST.                  01748000
017490     MOVE +7104 TO MIM-7104KREC.                                  01749000
017500     MOVE WS-RPMIM7104SC TO MIM-7104KRPREC.                       01750000
017510     MOVE MIC-RPS-7104-PRI TO MIC-MST-REC-PRI.                    01751000
017520     MOVE MI7104-RECORD TO MIMST-RECORD.                          01752000
017530     PERFORM MIC-MST-GET-REQUEST.                                 01753000
017540     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01754000
017550         MOVE 'N' TO WS-RELCHECK                                  01755000
017560         GO TO RM7104SC-EXIT.                                     01756000
017570     MOVE MIMST-RECORD TO MI7104-RECORD.                          01757000
017580     INITIALIZE WS-RELCODETABLE.                                  01758000
017590     MOVE MIM-REC7104-DATA TO WS-RELCODETABLE.                    01759000
017600     MOVE 'N' TO WS-INCLUDEREL.                                   01760000
017610     IF MIM-7104OPT IS EQUAL TO 'I'                               01761000
017620         MOVE 'Y' TO WS-INCLUDEREL.                               01762000
017630 RM7104SC-END.                                                    01763000
017640 RM7104SC-EXIT.                                                   01764000
017650     EXIT.                                                        01765000
017660******************************************************************01766000
017670 REMOVE-SECONDARY-CUSTOMERS SECTION.                              01767000
017680***********************************************************       01768000
017690* DETERMINE IF THE SECONDARY ACCOUNT SHOULD BE                    01769000
017700* REMOVED BASED ON THE RELATE CODE (7101--7104)                   01770000
017710***********************************************************       01771000
017720     INITIALIZE WS-SECONDARY-CUSTAREA.                            01772000
017730     MOVE +1 TO WS-SUBSEC1.                                       01773000
017740     MOVE +1 TO WS-SUBSEC2.                                       01774000
017750 RSC-LOOP.                                                        01775000
017760     IF WS-SUBSEC1 IS GREATER THAN +33                            01776000
017770         SUBTRACT +1 FROM WS-SUBSEC2 GIVING                       01777000
017780         WS-SECONDARY-CUST                                        01778000
017790         GO TO RSC-EXIT.                                          01779000
017800     IF WS-ACC-INST (WS-SUBSEC1) IS EQUAL TO ZERO                 01780000
017810         SUBTRACT +1 FROM WS-SUBSEC2 GIVING                       01781000
017820         WS-SECONDARY-CUST                                        01782000
017830         GO TO RSC-EXIT.                                          01783000
017840* ** SKIP PRIMARY CUSTOMER                                        01784000
017850     IF WS-ACC-PRIM (WS-SUBSEC1) IS EQUAL TO ZERO                 01785000
017860         GO TO RSC-NEXT.                                          01786000
017870     IF WS-RELCHECK IS NOT EQUAL TO 'Y'                           01787000
017880         MOVE 'N' TO WS-BADRELNBR                                 01788000
017890         GO TO RSC-TEST.                                          01789000
017900     MOVE WS-ACC-RELNBR (WS-SUBSEC1) TO WS-VALIDREL.              01790000
017910     PERFORM GM-CHECKFORRELNBR.                                   01791000
017920 RSC-TEST.                                                        01792000
017930     IF WS-BADRELNBR IS EQUAL TO 'N'                              01793000
017940         MOVE WS-ACC-INST (WS-SUBSEC1) TO                         01794000
017950             WS-SEC-INST (WS-SUBSEC2)                             01795000
017960         MOVE WS-ACC-CUST-TYPE (WS-SUBSEC1) TO                    01796000
017970             WS-SEC-CUST-TYPE (WS-SUBSEC2)                        01797000
017980         MOVE WS-ACC-CUST (WS-SUBSEC1) TO                         01798000
017990             WS-SEC-CUST (WS-SUBSEC2)                             01799000
018000         MOVE WS-ACC-RELNBR (WS-SUBSEC1) TO                       01800000
018010             WS-SEC-RELNBR (WS-SUBSEC2)                           01801000
018020         MOVE WS-ACC-PRIM (WS-SUBSEC1) TO                         01802000
018030             WS-SEC-PRIM (WS-SUBSEC2)                             01803000
018040          MOVE WS-ACC-FILL (WS-SUBSEC1) TO                        01804000
018050             WS-SEC-FILL (WS-SUBSEC2)                             01805000
018060          ADD +1 TO WS-SUBSEC2.                                   01806000
018070 RSC-NEXT.                                                        01807000
018080     ADD +1 TO WS-SUBSEC1.                                        01808000
018090     GO TO RSC-LOOP.                                              01809000
018100 RSC-EXIT.                                                        01810000
018110     EXIT.                                                        01811000
018120******************************************************************01812000
018130 GM-CHECKFORRELNBR SECTION.                                       01813000
018140***********************************************************       01814000
018150* DETERMINE IF THE CUSTOMER SHOULD BE INCLUDED BASED ON           01815000
018160* THE RELATIONSHIP CODE WITH THE PRIMARY ACCOUNT                  01816000
018170***********************************************************       01817000
018180 GM-CHREL-START.                                                  01818000
018190     MOVE +1 TO WS-RELSUB.                                        01819000
018200 GM-CHECKIT.                                                      01820000
018210     IF WS-RELSUB IS GREATER THAN WS-RELMAX                       01821000
018220         GO TO GM-NOMATCH.                                        01822000
018230     IF WS-SECRELCODE (WS-RELSUB) IS EQUAL TO ZEROS               01823000
018240         GO TO GM-NOMATCH.                                        01824000
018250     IF WS-VALIDREL IS EQUAL TO WS-SECRELCODE (WS-RELSUB)         01825000
018260         GO TO GM-MATCH.                                          01826000
018270     ADD +1 TO WS-RELSUB.                                         01827000
018280     GO TO GM-CHECKIT.                                            01828000
018290 GM-MATCH.                                                        01829000
018300     IF WS-INCLUDEREL IS EQUAL TO 'Y'                             01830000
018310         MOVE 'N' TO WS-BADRELNBR                                 01831000
018320         GO TO GMCFR-EXIT.                                        01832000
018330     MOVE 'Y' TO WS-BADRELNBR.                                    01833000
018340     GO TO GMCFR-EXIT.                                            01834000
018350 GM-NOMATCH.                                                      01835000
018360     IF WS-INCLUDEREL IS EQUAL TO 'Y'                             01836000
018370         MOVE 'Y' TO WS-BADRELNBR                                 01837000
018380         GO TO GMCFR-EXIT.                                        01838000
018390     MOVE 'N' TO WS-BADRELNBR.                                    01839000
018400     GO TO GMCFR-EXIT.                                            01840000
018410 GMCFR-EXIT.                                                      01841000
018420     EXIT.                                                        01842000
018430******************************************************************01843000
018440 GET-BALANCE SECTION.                                             01844000
018450 GB-START.                                                        01845000
018460     MOVE ZEROS TO WS-WORK-BALANCE.                               01846000
018470     IF WS-WORK-BALCD IS EQUAL TO ZEROS                           01847000
018480         OR WS-WORK-BALCD IS GREATER THAN 20                      01848000
018490         GO TO GB-EXIT.                                           01849000
018500     MOVE RPINF00-BAL (WS-WORK-BALCD) TO WS-WORK-BALANCE.         01850000
018510 GB-EXIT.                                                         01851000
018520     EXIT.                                                        01852000
018530******************************************************************01853000
018540 READ-MICM-0237 SECTION.                                          01854000
018550 RM0237-START.                                                    01855000
018560     MOVE SPACES TO WS-FUNCTION.                                  01856000
018570     MOVE SPACES TO MI0237-RECORD.                                01857000
018580     MOVE RPXXX30-PRIMARY-INST TO MIM-0237KINST.                  01858000
018590     MOVE +0237 TO MIM-0237KREC.                                  01859000
018600     MOVE 50 TO MIM-0237KPROCMGR.                                 01860000
018610     MOVE MIM-2023INTAPPL211 TO MIM-0237KINTAPPL.                 01861000
018620     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    01862000
018630     MOVE MI0237-RECORD TO MIMST-RECORD.                          01863000
018640     PERFORM MIC-MST-GET-REQUEST.                                 01864000
018650     MOVE MIMST-RECORD TO MI0237-RECORD.                          01865000
018660     MOVE MIM-0237KINTAPPL TO WS-SAVE-APPL.                       01866000
018670     IF WS-FUNCTION IS EQUAL TO SPACES                            01867000
018680         GO TO RM0237-EXIT.                                       01868000
018690     MOVE SPACES TO MIM-237OLINTFC.                               01869000
018700 RM0237-EXIT.                                                     01870000
018710     EXIT.                                                        01871000
018720******************************************************************01872000
018730 READ-MICM-2023 SECTION.                                          01873000
018740 RM2023-START.                                                    01874000
018750     MOVE SPACES TO WS-FUNCTION.                                  01875000
018760     MOVE SPACES TO MI2023-RECORD.                                01876000
018770     IF RPXXX30-INST-OPT-1 IS NOT EQUAL TO 'Y'                    01877000
018780         MOVE ZEROS TO MIM-2023KINST.                             01878000
018790     MOVE RPXXX30-PRIMARY-INST TO MIM-2023KINST.                  01879000
018800     MOVE RPXXX30-INST-OPT-1 TO SLW096-BANKS.                     01880000
018810     MOVE RPRF21-BASE-ACCT-PRODCODE TO MIM-2023KPRODCODE.         01881000
018820     MOVE +2023 TO MIM-2023KREC.                                  01882000
018830     MOVE MIC-MST-2023-PRI TO MIC-MST-REC-PRI.                    01883000
018840 RM2023-INST-ZERO.                                                01884000
018850     MOVE MI2023-RECORD TO MIMST-RECORD.                          01885000
018860     MOVE SPACES TO WS-FUNCTION.                                  01886000
018870     PERFORM MIC-MST-GET-REQUEST.                                 01887000
018880     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01888000
018890         AND MIM-2023KINST IS NOT EQUAL TO ZEROS                  01889000
018900         MOVE ZEROS TO MIM-2023KINST                              01890000
018910         GO TO RM2023-INST-ZERO.                                  01891000
018920     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01892000
018930         GO TO RM2023-END.                                        01893000
018940     MOVE MIMST-RECORD TO MI2023-RECORD.                          01894000
018950 RM2023-END.                                                      01895000
018960     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01896000
018970         MOVE 'N' TO MIM-2023RPOPTION.                            01897000
018980 RM2023-EXIT.                                                     01898000
018990     EXIT.                                                        01899000
019000******************************************************************01900000
019010 READ-MICM-7100 SECTION.                                          01901000
019020 RM7100-START.                                                    01902000
019030     MOVE SPACES TO WS-FUNCTION.                                  01903000
019040     MOVE SPACES TO MI7100-RECORD.                                01904000
019050     MOVE RPXXX30-PRIMARY-INST TO MIM-7100KINST.                  01905000
019060 RM7100-LOOP.                                                     01906000
019070     MOVE +7100 TO MIM-7100KREC.                                  01907000
019080     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    01908000
019090     MOVE MI7100-RECORD TO MIMST-RECORD.                          01909000
019100     PERFORM MIC-MST-GET-REQUEST.                                 01910000
019110     MOVE MIMST-RECORD TO MI7100-RECORD.                          01911000
019120     IF WS-FUNCTION IS EQUAL TO 'N'                               01912000
019130         AND MIM-7100KINST IS GREATER THAN ZEROS                  01913000
019140         GO TO RM7100-ZERO.                                       01914000
019150     GO TO RM7100-EXIT.                                           01915000
019160 RM7100-ZERO.                                                     01916000
019170     MOVE SPACES TO MI7100-RECORD.                                01917000
019180     MOVE ZEROS TO MIM-7100KINST.                                 01918000
019190     GO TO RM7100-LOOP.                                           01919000
019200 RM7100-EXIT.                                                     01920000
019210     EXIT.                                                        01921000
019220******************************************************************01922000
019230 READ-MICM-7102 SECTION.                                          01923000
019240 RM7102-START.                                                    01924000
019250     MOVE SPACE TO WS-FUNCTION.                                   01925000
019260     IF RPRF21-BASE-ACCT-PRODCODE IS EQUAL TO WS-SAVE-PRODCODE    01926000
019270         AND WS-ACCT-TYPE IS EQUAL TO WS-SAVE-ACCT-TYPE           01927000
019280         GO TO RM7102-EXIT.                                       01928000
019290     MOVE RPRF21-BASE-ACCT-PRODCODE TO WS-SAVE-PRODCODE.          01929000
019300     MOVE WS-ACCT-TYPE TO WS-SAVE-ACCT-TYPE.                      01930000
019310     MOVE SPACES TO WS-7102-FLAG.                                 01931000
019320 RM7102-LOOP.                                                     01932000
019330     MOVE SPACE TO WS-FUNCTION.                                   01933000
019340     MOVE SPACES TO MI7102-RECORD.                                01934000
019350     MOVE RPXXX30-PRIMARY-INST TO MIM-7102KINST.                  01935000
019360     MOVE +7102 TO MIM-7102KREC.                                  01936000
019370     MOVE RPMST-MODEL TO MIM-7102KMODEL.                          01937000
019380     MOVE RPRF21-BASE-ACCT-PRODCODE TO MIM-7102KPRODCODE.         01938000
019390     MOVE WS-ACCT-TYPE TO MIM-7102KACCTTYPE.                      01939000
019400     MOVE MIC-RPS-7102-PRI TO MIC-MST-REC-PRI.                    01940000
019410     MOVE MI7102-RECORD TO MIMST-RECORD.                          01941000
019420     PERFORM MIC-MST-GET-REQUEST.                                 01942000
019430     MOVE MIMST-RECORD TO MI7102-RECORD.                          01943000
019440     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01944000
019450         AND RPRF21-BASE-ACCT-PRODCODE IS EQUAL TO SPACES         01945000
019460         AND WS-ACCT-TYPE IS EQUAL TO ZEROS                       01946000
019470         MOVE 'N' TO WS-7102-FLAG                                 01947000
019480         GO TO RM7102-END.                                        01948000
019490     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01949000
019500         AND WS-ACCT-TYPE IS EQUAL TO ZEROS                       01950000
019510         AND WS-7102-DEF-FLAG IS EQUAL TO 'Y'                     01951000
019520         MOVE SPACES TO WS-FUNCTION                               01952000
019530         MOVE WS-7102-DEF-RECORD TO MI7102-RECORD                 01953000
019540         GO TO RM7102-END.                                        01954000
019550     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01955000
019560         AND WS-ACCT-TYPE IS NOT EQUAL TO ZEROS                   01956000
019570         MOVE ZEROS TO WS-ACCT-TYPE                               01957000
019580         GO TO RM7102-LOOP.                                       01958000
019590     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01959000
019600         AND RPRF21-BASE-ACCT-PRODCODE IS NOT EQUAL TO SPACES     01960000
019610         MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE                 01961000
019620         GO TO RM7102-LOOP.                                       01962000
019630     IF WS-FUNCTION IS EQUAL TO SPACES                            01963000
019640         AND RPRF21-BASE-ACCT-PRODCODE IS EQUAL TO SPACES         01964000
019650         AND WS-ACCT-TYPE IS EQUAL TO ZEROS                       01965000
019660         MOVE 'Y' TO WS-7102-DEF-FLAG                             01966000
019670         MOVE MI7102-RECORD TO WS-7102-DEF-RECORD.                01967000
019680 RM7102-END.                                                      01968000
019690     MOVE WS-SAVE-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.          01969000
019700     MOVE WS-SAVE-ACCT-TYPE TO WS-ACCT-TYPE.                      01970000
019710 RM7102-EXIT.                                                     01971000
019720     EXIT.                                                        01972000
019730******************************************************************01973000
019740 READ-MICM-7104 SECTION.                                          01974000
019750 RM7104-START.                                                    01975000
019760     MOVE 'N' TO WS-KEEP-FLAG.                                    01976000
019770     IF WS-7104-REL IS EQUAL TO WS-SAVE-7104KRPREC                01977000
019780         GO TO RM7104-END.                                        01978000
019790     MOVE SPACES TO MI7104-RECORD.                                01979000
019800     MOVE RPXXX30-PRIMARY-INST TO MIM-7104KINST.                  01980000
019810     MOVE +7104 TO MIM-7104KREC.                                  01981000
019820     MOVE WS-7104-REL TO MIM-7104KRPREC.                          01982000
019830     MOVE MIC-RPS-7104-PRI TO MIC-MST-REC-PRI.                    01983000
019840     MOVE MI7104-RECORD TO MIMST-RECORD.                          01984000
019850     PERFORM MIC-MST-GET-REQUEST.                                 01985000
019860     MOVE MIMST-RECORD TO MI7104-RECORD.                          01986000
019870     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01987000
019880         GO TO RM7104-EXIT.                                       01988000
019890     MOVE MIM-7104KRPREC TO WS-SAVE-7104KRPREC.                   01989000
019900 RM7104-END.                                                      01990000
019910     PERFORM CHECK-REL-CODE.                                      01991000
019920 RM7104-EXIT.                                                     01992000
019930     EXIT.                                                        01993000
019940******************************************************************01994000
019950 READ-MICM-7106 SECTION.                                          01995000
019960 RM7106-START.                                                    01996000
019970     MOVE SPACES TO WS-FUNCTION.                                  01997000
019980     MOVE SPACES TO MI7106-RECORD.                                01998000
019990     MOVE RPXXX30-PRIMARY-INST TO MIM-7106KINST.                  01999000
020000     MOVE +7106 TO MIM-7106KREC.                                  02000000
020010     MOVE WS-WORK-CATCD TO MIM-7106KRPREC.                        02001000
020020     MOVE MIC-RPS-7106-PRI TO MIC-MST-REC-PRI.                    02002000
020030     MOVE MI7106-RECORD TO MIMST-RECORD.                          02003000
020040     PERFORM MIC-MST-GET-REQUEST.                                 02004000
020050     MOVE MIMST-RECORD TO MI7106-RECORD.                          02005000
020060     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02006000
020070         GO TO RM7106-EXIT.                                       02007000
020080 RM7106-EXIT.                                                     02008000
020090     EXIT.                                                        02009000
020100******************************************************************02010000
020110 READ-MICM-7107 SECTION.                                          02011000
020120 RM7107-START.                                                    02012000
020130     MOVE 'N' TO WS-KEEP-FLAG.                                    02013000
020140     IF MIM-7102BRCHREGIONCD IS EQUAL TO WS-SAVE-7107KRPREC       02014000
020150         GO TO RM7107-END.                                        02015000
020160     MOVE SPACES TO MI7107-RECORD.                                02016000
020170     MOVE RPXXX30-PRIMARY-INST TO MIM-7107KINST.                  02017000
020180     MOVE +7107 TO MIM-7107KREC.                                  02018000
020190     MOVE MIM-7102BRCHREGIONCD TO MIM-7107KRPREC.                 02019000
020200     MOVE MIC-RPS-7107-PRI TO MIC-MST-REC-PRI.                    02020000
020210     MOVE MI7107-RECORD TO MIMST-RECORD.                          02021000
020220     PERFORM MIC-MST-GET-REQUEST.                                 02022000
020230     MOVE MIMST-RECORD TO MI7107-RECORD.                          02023000
020240     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02024000
020250         GO TO RM7107-EXIT.                                       02025000
020260     MOVE MIM-7107KRPREC TO WS-SAVE-7107KRPREC.                   02026000
020270 RM7107-END.                                                      02027000
020280     IF WS-BRANCH IS EQUAL TO ZEROS                               02028000
020290         GO TO RM7107-EXIT.                                       02029000
020300     PERFORM CHECK-BRANCH.                                        02030000
020310 RM7107-EXIT.                                                     02031000
020320     EXIT.                                                        02032000
020330******************************************************************02033000
020340 CHECK-REL-CODE SECTION.                                          02034000
020350 CRELCD-START.                                                    02035000
020360     MOVE +0001 TO WS-SUB2.                                       02036000
020370     IF MIM-7104OPT IS EQUAL TO 'E'                               02037000
020380         GO TO CRELCD-EXCLUDE.                                    02038000
020390 CRELCD-INCLUDE.                                                  02039000
020400     IF WS-SUB2 IS GREATER THAN 0050                              02040000
020410         GO TO CRELCD-EXIT.                                       02041000
020420     IF MIM-7104RLSP (WS-SUB2) IS EQUAL TO ZEROS                  02042000
020430         OR MIM-7104RLSP (WS-SUB2) IS EQUAL TO SPACES             02043000
020440         GO TO CRELCD-EXIT.                                       02044000
020450     IF RPRF21-REL IS EQUAL TO MIM-7104RLSP (WS-SUB2)             02045000
020460         MOVE 'Y' TO WS-KEEP-FLAG                                 02046000
020470         GO TO CRELCD-EXIT.                                       02047000
020480     ADD +0001 TO WS-SUB2.                                        02048000
020490     GO TO CRELCD-INCLUDE.                                        02049000
020500 CRELCD-EXCLUDE.                                                  02050000
020510     IF WS-SUB2 IS GREATER THAN 0050                              02051000
020520         MOVE 'Y' TO WS-KEEP-FLAG                                 02052000
020530         GO TO CRELCD-EXIT.                                       02053000
020540     IF MIM-7104RLSP (WS-SUB2) IS EQUAL TO ZEROS                  02054000
020550         OR MIM-7104RLSP (WS-SUB2) IS EQUAL TO SPACES             02055000
020560         MOVE 'Y' TO WS-KEEP-FLAG                                 02056000
020570         GO TO CRELCD-EXIT.                                       02057000
020580     IF RPRF21-REL IS EQUAL TO MIM-7104RLSP (WS-SUB2)             02058000
020590         GO TO CRELCD-EXIT.                                       02059000
020600     ADD +0001 TO WS-SUB2.                                        02060000
020610     GO TO CRELCD-EXCLUDE.                                        02061000
020620 CRELCD-EXIT.                                                     02062000
020630     EXIT.                                                        02063000
020640******************************************************************02064000
020650 CHECK-BRANCH SECTION.                                            02065000
020660 CBRANCH-START.                                                   02066000
020670     MOVE +0001 TO WS-SUB2.                                       02067000
020680     IF MIM-7107OPT IS EQUAL TO 'E'                               02068000
020690         GO TO CBRANCH-EXCLUDE.                                   02069000
020700 CBRANCH-INCLUDE.                                                 02070000
020710     IF WS-SUB2 IS GREATER THAN 0050                              02071000
020720         GO TO CBRANCH-EXIT.                                      02072000
020730     IF MIM-7107BRCHREGION (WS-SUB2) IS EQUAL TO ZEROS            02073000
020740         GO TO CBRANCH-EXIT.                                      02074000
020750     IF WS-BRANCH IS EQUAL TO MIM-7107BRCHREGION (WS-SUB2)        02075000
020760         MOVE 'Y' TO WS-KEEP-FLAG                                 02076000
020770         GO TO CBRANCH-EXIT.                                      02077000
020780     ADD +0001 TO WS-SUB2.                                        02078000
020790     GO TO CBRANCH-INCLUDE.                                       02079000
020800 CBRANCH-EXCLUDE.                                                 02080000
020810     IF WS-SUB2 IS GREATER THAN 0050                              02081000
020820         MOVE 'Y' TO WS-KEEP-FLAG                                 02082000
020830         GO TO CBRANCH-EXIT.                                      02083000
020840     IF MIM-7107BRCHREGION (WS-SUB2) IS EQUAL TO ZEROS            02084000
020850         MOVE 'Y' TO WS-KEEP-FLAG                                 02085000
020860         GO TO CBRANCH-EXIT.                                      02086000
020870     IF WS-BRANCH IS EQUAL TO MIM-7107BRCHREGION (WS-SUB2)        02087000
020880         GO TO CBRANCH-EXIT.                                      02088000
020890     ADD +0001 TO WS-SUB2.                                        02089000
020900     GO TO CBRANCH-EXCLUDE.                                       02090000
020910 CBRANCH-EXIT.                                                    02091000
020920     EXIT.                                                        02092000
020930******************************************************************02093000
020940 LINK-INTERFACE SECTION.                                          02094000
020950 LINT-START.                                                      02095000
020960     MOVE SPACES TO RPINF00-MESSAGE.                              02096000
020970     MOVE MIM-237OLINTFC TO WS-PROGRAM.                           02097000
020980     MOVE RPXXX30-SEC-INST TO RPINF00-INST.                       02098000
020990     MOVE RPXXX30-SEC-PRODCODE TO RPINF00-PRODCODE.               02099000
021000     MOVE RPXXX30-SEC-ACCOUNT TO RPINF00-ACCOUNT.                 02100000
021010     MOVE MIM-2023INTAPPL211 TO RPINF00-APPLR.                    02101000
021020     MOVE MIM-7101CLOSEDACCTOPT TO RPINF00-CLOSEDACCTOPT.         02102000
021030     MOVE RPXXX30-CONTROLS TO RPINF00-CONTROLS.                   02103000
021040     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02104000
021050         AND RPMST-INST IS NOT EQUAL TO RPINF00-INST              02105000
021060         AND WS-LAST-GOOD-INST IS EQUAL TO RPINF00-INST           02106000
P0025          MOVE WS-ACCESS-FILEOPTS TO RPINF00-FILEOPTS.             02107000
021080     MOVE 'N' TO RPINF00-GLOBAL-CLOSE.                            02108000
021090     EXEC CICS LINK                                               02109000
021100         PROGRAM(WS-PROGRAM)                                      02110000
021110         COMMAREA(RPINF00-MESSAGE)                                02111000
021120         LENGTH(LENGTH OF RPINF00-MESSAGE)                        02112000
021130         RESP(WS-CICS-RESPONSE)                                   02113000
021140         END-EXEC.                                                02114000
021150     MOVE RPINF00-FUNCTION TO WS-FUNCTION.                        02115000
021160     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     02116000
021170         MOVE 'L' TO WS-FUNCTION                                  02117000
021180         MOVE 500039 TO WS-MSGNBR                                 02118000
021190         GO TO LINT-EXIT.                                         02119000
021200     IF WS-FUNCTION IS EQUAL TO 'L'                               02120000
021210         MOVE 500040 TO WS-MSGNBR                                 02121000
021220         GO TO LINT-EXIT.                                         02122000
021230     IF WS-FUNCTION IS EQUAL TO 'C'                               02123000
021240         MOVE 500041 TO WS-MSGNBR                                 02124000
021250         GO TO LINT-EXIT.                                         02125000
021260     MOVE 'Y' TO WS-INTERFACE.                                    02126000
021270 LINT-EXIT.                                                       02127000
021280     EXIT.                                                        02128000
021290******************************************************************02129000
021300 USER-EXIT SECTION.                                               02130000
021310 UEXIT-START.                                                     02131000
021320     MOVE SPACES TO RPUSER-MESSAGE.                               02132000
021330     IF WS-INTERFACE IS NOT EQUAL TO 'Y'                          02133000
021340         GO TO UEXIT-CONT.                                        02134000
021350     MOVE RPINF00-KEY-AREAS TO RPUSER-KEY-AREAS.                  02135000
021360     MOVE RPINF00-USER-INFO TO RPUSER-USER-INFO.                  02136000
021370     MOVE RPINF00-MISC-INFO TO RPUSER-MISC-INFO.                  02137000
021380     MOVE RPINF00-BAL-INFO TO RPUSER-BAL-INFO.                    02138000
021390     GO TO UEXIT-CALL.                                            02139000
021400 UEXIT-CONT.                                                      02140000
021410     MOVE RPRF21-ACCT-ALT-INST TO RPUSER-INST.                    02141000
021420     MOVE RPRF21-BASE-ACCT-PRODCODE TO RPUSER-PRODCODE.           02142000
021430     MOVE RPRF21-BASE-ACCT TO RPUSER-ACCOUNT.                     02143000
021440     MOVE MIM-2023INTAPPL211 TO RPUSER-APPLR.                     02144000
021450     INITIALIZE RPUSER-GRP-DATA.                                  02145000
021460 UEXIT-CALL.                                                      02146000
000000     CALL 'RPBUSER' USING                                         02147000
021480         RPUSER-MESSAGE                                           02148000
021490         WS-FUNCTION.                                             02149000
021500 UEXIT-EXIT.                                                      02150000
021510     EXIT.                                                        02151000
021520******************************************************************02152000
021530 DELETE-RELATIONSHIP SECTION.                                     02153000
021540 DREL-START.                                                      02154000
P0111      MOVE 'Y' TO WS-PRIM-RECORD.                                  02154500
021550     INITIALIZE RPREL-RECORD.                                     02155000
021560     MOVE RPXXX30-PRIMARY-ACCT TO RPREL-ACCT1-GRP.                02156000
021570     PERFORM RPS-REL-GET-GE-LOCK-REQUEST.                         02157000
021580     GO TO DREL-REL-CONT.                                         02158000
021590 DREL-REL-NEXT.                                                   02159000
021600     PERFORM RPS-REL-GET-NEXT-LOCK-REQUEST.                       02160000
021610 DREL-REL-CONT.                                                   02161000
021620     IF WS-FUNCTION IS EQUAL TO 'E'                               02162000
021630         GO TO DREL-IDX.                                          02163000
021640     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02164000
021650         MOVE 'Y' TO WS-ERROR                                     02165000
021660         MOVE WS-AB6330 TO RPXXX30-ABORT                          02166000
021670         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     02167000
021680         MOVE WS-TR0035 TO RPXXX30-ABTRACE                        02168000
021690         MOVE WS-TR0035 TO RPXXX30-RESP-TRACE                     02169000
021700         GO TO DREL-EXIT.                                         02170000
021710     IF RPREL-ACCT1-GRP IS NOT EQUAL TO RPXXX30-PRIMARY-ACCT      02171000
021720         PERFORM RPS-REL-UNLOCK-REQUEST                           02172000
021730         GO TO DREL-IDX.                                          02173000
021740     PERFORM RPS-REL-DELETE-REQUEST.                              02174000
021750     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02175000
021760         MOVE 'Y' TO WS-ERROR                                     02176000
021770         MOVE WS-AB6330 TO RPXXX30-ABORT                          02177000
021780         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     02178000
021790         MOVE WS-TR0036 TO RPXXX30-ABTRACE                        02179000
021800         MOVE WS-TR0036 TO RPXXX30-RESP-TRACE                     02180000
021810         GO TO DREL-EXIT.                                         02181000
021820     MOVE 'Y' TO WS-UPDATESW.                                     02182000
021830     IF RPREL-ACCT-STATUS IS EQUAL TO 'R'                         02183000
021840         GO TO DREL-REL-NEXT.                                     02184000
021850 DREL-EVT.                                                        02185000
021860     IF MIM-7100EVENTHISTORYOPT IS NOT EQUAL TO 'Y'               02186000
021870         GO TO DREL-SEC.                                          02187000
P0111      IF WS-PRIM-RECORD IS EQUAL TO 'Y'                            02188000
P0111          MOVE 'N' TO WS-PRIM-RECORD                               02188090
P0111          MOVE 03 TO RPS-EVT-EVENT-CODE                            02188180
P0111      ELSE                                                         02188270
P0111          MOVE 08 TO RPS-EVT-EVENT-CODE.                           02188360
021890     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   02189000
021900     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   02190000
021910     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        02191000
021920     MOVE RPXXX30-PRIMARY-IDNUM TO RPS-EVT-IDNUMBER.              02192000
021930     PERFORM ADD-EVENT-HISTORY.                                   02193000
021940     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02194000
021950         MOVE WS-AB6360 TO RPXXX30-ABORT                          02195000
021960         MOVE WS-AB6360 TO RPXXX30-RESP-ABORT                     02196000
021970         MOVE WS-TR0037 TO RPXXX30-ABTRACE                        02197000
021980         MOVE WS-TR0037 TO RPXXX30-RESP-TRACE                     02198000
021990         GO TO CICS-RETURN.                                       02199000
022000 DREL-SEC.                                                        02200000
022010     INITIALIZE RPSEC-RECORD.                                     02201000
022020     IF RPREL-INST2 IS EQUAL TO ZERO                              02202000
022030         MOVE RPREL-INST TO RPSEC-INST                            02203000
022040         MOVE RPREL-PRODCODE TO RPSEC-PRODCODE                    02204000
022050         MOVE RPREL-ACCOUNT TO RPSEC-ACCOUNT                      02205000
022060         MOVE RPREL-MODEL TO RPSEC-MODEL2                         02206000
022070         MOVE RPREL-INST2 TO RPSEC-INST2                          02207000
022080         MOVE RPREL-PRODCODE2 TO RPSEC-PRODCODE2                  02208000
022090         MOVE RPREL-ACCOUNT2 TO RPSEC-ACCOUNT2                    02209000
022100     ELSE                                                         02210000
022110         MOVE RPREL-INST2 TO RPSEC-INST                           02211000
022120         MOVE RPREL-PRODCODE2 TO RPSEC-PRODCODE                   02212000
022130         MOVE RPREL-ACCOUNT2 TO RPSEC-ACCOUNT                     02213000
022140         MOVE RPREL-MODEL TO RPSEC-MODEL2                         02214000
022150         MOVE RPREL-INST TO RPSEC-INST2                           02215000
022160         MOVE RPREL-PRODCODE TO RPSEC-PRODCODE2                   02216000
022170         MOVE RPREL-ACCOUNT TO RPSEC-ACCOUNT2.                    02217000
022180*    IF RPREL-INST2 IS EQUAL TO ZEROS                             02218000
022190*        MOVE RPREL-ACCT1-GRP TO RPSEC-ACCT1-GRP                  02219000
022200*        MOVE RPREL-ACCT2-GRP TO RPSEC-ACCT2-GRP.                 02220000
022210     PERFORM RPS-SEC-GET-LOCK-REQUEST.                            02221000
022220     IF WS-FUNCTION IS EQUAL TO 'N'                               02222000
022230         AND RPREL-ACCT-STATUS IS EQUAL TO 'U'                    02223000
022240         GO TO DREL-REL-NEXT.                                     02224000
022250     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02225000
022260         MOVE 'Y' TO WS-ERROR                                     02226000
022270         MOVE WS-AB6335 TO RPXXX30-ABORT                          02227000
022280         MOVE WS-AB6335 TO RPXXX30-RESP-ABORT                     02228000
022290         MOVE WS-TR0038 TO RPXXX30-ABTRACE                        02229000
022300         MOVE WS-TR0038 TO RPXXX30-RESP-TRACE                     02230000
022310         GO TO DREL-EXIT.                                         02231000
022320     PERFORM RPS-SEC-DELETE-REQUEST.                              02232000
022330     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02233000
022340         MOVE 'Y' TO WS-ERROR                                     02234000
022350         MOVE WS-AB6335 TO RPXXX30-ABORT                          02235000
022360         MOVE WS-AB6335 TO RPXXX30-RESP-ABORT                     02236000
022370         MOVE WS-TR0039 TO RPXXX30-ABTRACE                        02237000
022380         MOVE WS-TR0039 TO RPXXX30-RESP-TRACE                     02238000
022390         GO TO DREL-EXIT.                                         02239000
022400     MOVE 'Y' TO WS-UPDATESW.                                     02240000
022410     MOVE SPACES TO WS-SEC-FLAG.                                  02241000
022420     INITIALIZE RPACT-RECORD.                                     02242000
022430     MOVE RPSEC-ACCT1-GRP TO RPACT-GRP-KEY.                       02243000
022440     MOVE LOW-VALUES TO RPSEC-MODEL2.                             02244000
022450     MOVE LOW-VALUES TO RPSEC-ACCT2-GRP.                          02245000
022460     PERFORM RPS-SEC-GET-GE-REQUEST.                              02246000
022470     IF WS-FUNCTION IS EQUAL TO 'E'                               02247000
022480         GO TO DREL-7102.                                         02248000
022490     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02249000
022500         MOVE 'Y' TO WS-ERROR                                     02250000
022510         MOVE WS-AB6335 TO RPXXX30-ABORT                          02251000
022520         MOVE WS-AB6335 TO RPXXX30-RESP-ABORT                     02252000
022530         MOVE WS-TR0040 TO RPXXX30-ABTRACE                        02253000
022540         MOVE WS-TR0040 TO RPXXX30-RESP-TRACE                     02254000
022550         GO TO DREL-EXIT.                                         02255000
022560     IF RPSEC-ACCT1-GRP IS EQUAL TO RPACT-GRP-KEY                 02256000
022570         MOVE 'Y' TO WS-SEC-FLAG.                                 02257000
022580 DREL-7102.                                                       02258000
022590     MOVE RPREL-INST2 TO RPRF21-BASE-ACCT-INST.                   02259000
022600     MOVE RPREL-PRODCODE2 TO RPRF21-BASE-ACCT-PRODCODE.           02260000
022610     MOVE RPREL-ACCT-TYPE TO WS-ACCT-TYPE.                        02261000
022620     IF RPREL-INST2 IS EQUAL TO ZEROS                             02262000
022630         MOVE RPREL-INST TO RPRF21-BASE-ACCT-INST                 02263000
022640         MOVE RPREL-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.        02264000
022650     PERFORM READ-MICM-7102.                                      02265000
022660     IF WS-7102-FLAG IS EQUAL TO 'N'                              02266000
022670         AND MIM-7100ACCTLIMITOPT IS NOT EQUAL TO 'Y'             02267000
022680         MOVE SPACES TO WS-SEC-FLAG                               02268000
022690         GO TO DREL-REL-NEXT.                                     02269000
022700 DREL-ACT.                                                        02270000
022710     PERFORM RPS-ACT-GET-LOCK-REQUEST.                            02271000
022720     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02272000
022730         MOVE 'Y' TO WS-ERROR                                     02273000
022740         MOVE WS-AB6300 TO RPXXX30-ABORT                          02274000
022750         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     02275000
022760         MOVE WS-TR0041 TO RPXXX30-ABTRACE                        02276000
022770         MOVE WS-TR0041 TO RPXXX30-RESP-TRACE                     02277000
022780         GO TO DREL-EXIT.                                         02278000
022790     IF WS-7102-FLAG IS EQUAL TO 'N'                              02279000
022800         MOVE 'N' TO WS-SEC-FLAG                                  02280000
022810         GO TO DREL-ACT-CONT.                                     02281000
022820     MOVE 'Y' TO WS-SEC-FLAG.                                     02282000
022830     IF RPREL-INST2 IS NOT EQUAL TO ZEROS                         02283000
022840         AND MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                02284000
022850         MOVE 'N' TO RPACT-RATE-INC-OPTION.                       02285000
022860     IF RPREL-INST2 IS NOT EQUAL TO ZEROS                         02286000
022870         AND MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                02287000
022880         AND MIM-7102TIMEPROCOPT IS EQUAL TO 'Y'                  02288000
022890         MOVE 'Y' TO RPACT-PROCOPT.                               02289000
022900     IF RPREL-INST2 IS EQUAL TO ZEROS                             02290000
022910         AND MIM-7102PRIMSCINCOPT IS EQUAL TO 'Y'                 02291000
022920         MOVE 'N' TO RPACT-SC-INC-OPTION.                         02292000
022930     IF RPREL-INST2 IS EQUAL TO ZEROS                             02293000
022940         AND MIM-7102PRIMRATEINCOPT IS EQUAL TO 'Y'               02294000
022950         MOVE 'N' TO RPACT-RATE-INC-OPTION.                       02295000
022960     IF RPREL-INST2 IS EQUAL TO ZEROS                             02296000
022970         AND MIM-7102PRIMRATEINCOPT IS EQUAL TO 'Y'               02297000
022980         AND MIM-7102TIMEPROCOPT IS EQUAL TO 'Y'                  02298000
022990         MOVE 'Y' TO RPACT-PROCOPT.                               02299000
023000     IF MIM-7100DUPINCOPT IS EQUAL TO 'Y'                         02300000
023010         GO TO DREL-ACT-CONT.                                     02301000
023020     IF RPREL-INST2 IS NOT EQUAL TO ZEROS                         02302000
023030         AND MIM-7102SECSCINCOPT IS EQUAL TO 'Y'                  02303000
023040         MOVE 'N' TO RPACT-SC-INC-OPTION.                         02304000
023050 DREL-ACT-CONT.                                                   02305000
023060     IF WS-SEC-FLAG IS EQUAL TO 'Y'                               02306000
023070         PERFORM RPS-ACT-REPUT-REQUEST                            02307000
023080     ELSE                                                         02308000
023090         PERFORM RPS-ACT-DELETE-REQUEST.                          02309000
023100     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02310000
023110         MOVE 'Y' TO WS-ERROR                                     02311000
023120         MOVE WS-AB6300 TO RPXXX30-ABORT                          02312000
023130         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     02313000
023140         MOVE WS-TR0042 TO RPXXX30-ABTRACE                        02314000
023150         MOVE WS-TR0042 TO RPXXX30-RESP-TRACE                     02315000
023160         GO TO DREL-EXIT.                                         02316000
023170     MOVE SPACES TO WS-SEC-FLAG.                                  02317000
023180     MOVE 'Y' TO WS-UPDATESW.                                     02318000
023190     GO TO DREL-REL-NEXT.                                         02319000
023200 DREL-IDX.                                                        02320000
023210     MOVE RPMST-IDNUMBER TO RPXXX30-PRIMARY-IDNUM.                02321000
023220     PERFORM LOCATE-IDNUMBER-BY-APPL.                             02322000
023230     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02323000
023240         MOVE 'Y' TO WS-ERROR                                     02324000
023250         MOVE WS-AB3051 TO RPXXX30-ABORT                          02325000
023260         MOVE WS-AB3051 TO RPXXX30-RESP-ABORT                     02326000
023270         MOVE WS-TR0043 TO RPXXX30-ABTRACE                        02327000
023280         MOVE WS-TR0043 TO RPXXX30-RESP-TRACE                     02328000
023290         GO TO DREL-EXIT.                                         02329000
023300     PERFORM RPS-IDX-GET-LOCK-REQUEST.                            02330000
023310     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02331000
023320         MOVE 'Y' TO WS-ERROR                                     02332000
023330         MOVE WS-AB6310 TO RPXXX30-ABORT                          02333000
023340         MOVE WS-AB6310 TO RPXXX30-RESP-ABORT                     02334000
023350         MOVE WS-TR0044 TO RPXXX30-ABTRACE                        02335000
023360         MOVE WS-TR0044 TO RPXXX30-RESP-TRACE                     02336000
023370         GO TO DREL-EXIT.                                         02337000
023380     PERFORM RPS-IDX-DELETE-REQUEST.                              02338000
023390     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02339000
023400         MOVE 'Y' TO WS-ERROR                                     02340000
023410         MOVE WS-AB6310 TO RPXXX30-ABORT                          02341000
023420         MOVE WS-AB6310 TO RPXXX30-RESP-ABORT                     02342000
023430         MOVE WS-TR0045 TO RPXXX30-ABTRACE                        02343000
023440         MOVE WS-TR0045 TO RPXXX30-RESP-TRACE                     02344000
023450         GO TO DREL-EXIT.                                         02345000
023460     MOVE 'Y' TO WS-UPDATESW.                                     02346000
023470 DREL-CRW.                                                        02347000
023480     INITIALIZE RPCRW-RECORD.                                     02348000
023490     MOVE LOW-VALUES TO RPCRW-GRP-KEY.                            02349000
023500     MOVE RPXXX30-PRIMARY-ACCT TO RPCRW-ACCT1-GRP.                02350000
023510     PERFORM RPS-CRW-GET-GE-LOCK-REQUEST.                         02351000
023520     IF WS-FUNCTION IS EQUAL TO 'E'                               02352000
023530         GO TO DREL-TRM.                                          02353000
023540     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02354000
023550         MOVE 'Y' TO WS-ERROR                                     02355000
023560         MOVE WS-AB6350 TO RPXXX30-ABORT                          02356000
023570         MOVE WS-AB6350 TO RPXXX30-RESP-ABORT                     02357000
023580         MOVE WS-TR0046 TO RPXXX30-ABTRACE                        02358000
023590         MOVE WS-TR0046 TO RPXXX30-RESP-TRACE                     02359000
023600         GO TO DREL-EXIT.                                         02360000
023610     IF RPCRW-ACCT1-GRP IS NOT EQUAL TO RPXXX30-PRIMARY-ACCT      02361000
023620         PERFORM RPS-CRW-UNLOCK-REQUEST                           02362000
023630         GO TO DREL-TRM.                                          02363000
023640     PERFORM RPS-CRW-DELETE-REQUEST.                              02364000
023650     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02365000
023660         MOVE 'Y' TO WS-ERROR                                     02366000
023670         MOVE WS-AB6350 TO RPXXX30-ABORT                          02367000
023680         MOVE WS-AB6350 TO RPXXX30-RESP-ABORT                     02368000
023690         MOVE WS-TR0047 TO RPXXX30-ABTRACE                        02369000
023700         MOVE WS-TR0047 TO RPXXX30-RESP-TRACE                     02370000
023710         GO TO DREL-EXIT.                                         02371000
023720     MOVE 'Y' TO WS-UPDATESW.                                     02372000
023730 DREL-TRM.                                                        02373000
023740     INITIALIZE RPTRM-RECORD.                                     02374000
023750     MOVE LOW-VALUES TO RPTRM-GRP-KEY.                            02375000
023760     MOVE RPXXX30-PRIMARY-ACCT TO RPTRM-GRP-KEY.                  02376000
023770     PERFORM RPS-TRM-GET-LOCK-REQUEST.                            02377000
023780     IF WS-FUNCTION IS EQUAL TO 'N'                               02378000
023790         PERFORM RPS-TRM-UNLOCK-REQUEST                           02379000
023800         GO TO DREL-MST.                                          02380000
023810     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02381000
023820         MOVE 'Y' TO WS-ERROR                                     02382000
023830         MOVE WS-AB6355 TO RPXXX30-ABORT                          02383000
023840         MOVE WS-AB6355 TO RPXXX30-RESP-ABORT                     02384000
023850         MOVE WS-TR0048 TO RPXXX30-ABTRACE                        02385000
023860         MOVE WS-TR0048 TO RPXXX30-RESP-TRACE                     02386000
023870         GO TO DREL-EXIT.                                         02387000
023880     PERFORM RPS-TRM-DELETE-REQUEST.                              02388000
023890     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02389000
023900         MOVE 'Y' TO WS-ERROR                                     02390000
023910         MOVE WS-AB6355 TO RPXXX30-ABORT                          02391000
023920         MOVE WS-AB6355 TO RPXXX30-RESP-ABORT                     02392000
023930         MOVE WS-TR0049 TO RPXXX30-ABTRACE                        02393000
023940         MOVE WS-TR0049 TO RPXXX30-RESP-TRACE                     02394000
023950         GO TO DREL-EXIT.                                         02395000
023960     MOVE 'Y' TO WS-UPDATESW.                                     02396000
023970 DREL-MST.                                                        02397000
023980     PERFORM RPS-MST-GET-LOCK-REQUEST.                            02398000
023990     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02399000
024000         MOVE 'Y' TO WS-ERROR                                     02400000
024010         MOVE WS-AB6320 TO RPXXX30-ABORT                          02401000
024020         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     02402000
024030         MOVE WS-TR0050 TO RPXXX30-ABTRACE                        02403000
024040         MOVE WS-TR0050 TO RPXXX30-RESP-TRACE                     02404000
024050         GO TO DREL-EXIT.                                         02405000
024060     PERFORM RPS-MST-DELETE-REQUEST.                              02406000
024070     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02407000
024080         MOVE 'Y' TO WS-ERROR                                     02408000
024090         MOVE WS-AB6320 TO RPXXX30-ABORT                          02409000
024100         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     02410000
024110         MOVE WS-TR0051 TO RPXXX30-ABTRACE                        02411000
024120         MOVE WS-TR0051 TO RPXXX30-RESP-TRACE                     02412000
024130         GO TO DREL-EXIT.                                         02413000
024140     MOVE 'Y' TO WS-UPDATESW.                                     02414000
024150 DREL-QUA.                                                        02415000
024160     MOVE RPMST-GRP-KEY TO RPQUA-GRP-KEY.                         02416000
024170     PERFORM RPS-QUA-GET-LOCK-REQUEST.                            02417000
024180     IF WS-FUNCTION IS EQUAL TO 'N'                               02418000
024190         GO TO DREL-SET-MSG.                                      02419000
024200     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02420000
024210         MOVE 'Y' TO WS-ERROR                                     02421000
024220         MOVE WS-AB6325 TO RPXXX30-ABORT                          02422000
024230         MOVE WS-AB6325 TO RPXXX30-RESP-ABORT                     02423000
024240         MOVE WS-TR0052 TO RPXXX30-ABTRACE                        02424000
024250         MOVE WS-TR0052 TO RPXXX30-RESP-TRACE                     02425000
024260         GO TO DREL-EXIT.                                         02426000
024270     PERFORM RPS-QUA-DELETE-REQUEST.                              02427000
024280     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02428000
024290         MOVE 'Y' TO WS-ERROR                                     02429000
024300         MOVE WS-AB6325 TO RPXXX30-ABORT                          02430000
024310         MOVE WS-AB6325 TO RPXXX30-RESP-ABORT                     02431000
024320         MOVE WS-TR0053 TO RPXXX30-ABTRACE                        02432000
024330         MOVE WS-TR0053 TO RPXXX30-RESP-TRACE                     02433000
024340         GO TO DREL-EXIT.                                         02434000
024350     MOVE 'Y' TO WS-UPDATESW.                                     02435000
024360 DREL-SET-MSG.                                                    02436000
024370     MOVE 500606 TO RPXXX30-RESP-MSG-NBR.                         02437000
024380 DREL-EXIT.                                                       02438000
024390     EXIT.                                                        02439000
024400******************************************************************02440000
024410 UPDATE-MASTER SECTION.                                           02441000
024420 UMST-START.                                                      02442000
024430     PERFORM RPS-MST-GET-LOCK-REQUEST.                            02443000
024440     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02444000
024450         MOVE 'Y' TO WS-ERROR                                     02445000
024460         MOVE WS-AB6320 TO RPXXX30-ABORT                          02446000
024470         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     02447000
024480         MOVE WS-TR0054 TO RPXXX30-ABTRACE                        02448000
024490         MOVE WS-TR0054 TO RPXXX30-RESP-TRACE                     02449000
024500         GO TO UMST-EXIT.                                         02450000
024510     MOVE WS-CURDT-YYYYMMDD TO RPMST-LMNTDT.                      02451000
024520     PERFORM RPS-MST-REPUT-REQUEST.                               02452000
024530     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02453000
024540         MOVE 'Y' TO WS-ERROR                                     02454000
024550         MOVE WS-AB6320 TO RPXXX30-ABORT                          02455000
024560         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     02456000
024570         MOVE WS-TR0055 TO RPXXX30-ABTRACE                        02457000
024580         MOVE WS-TR0055 TO RPXXX30-RESP-TRACE                     02458000
024590         GO TO UMST-EXIT.                                         02459000
024600     MOVE 'Y' TO WS-UPDATESW.                                     02460000
024610 UMST-EXIT.                                                       02461000
024620     EXIT.                                                        02462000
024630******************************************************************02463000
024640 LOCATE-IDNUMBER-BY-APPL SECTION.                                 02464000
024650 LIBA-START.                                                      02465000
024660     MOVE RPXXX30-PRIMARY-INST TO MIM-2023KINST.                  02466000
024670     MOVE 'RP' TO MIM-2023KPRODCODE.                              02467000
024680     MOVE RPXXX30-INST-OPT-1 TO SLW096-BANKS.                     02468000
024690     PERFORM SLP096-GET-2023-RECORD.                              02469000
024700     IF SLW096-FUNCTION IS EQUAL TO SPACES                        02470000
024710         GO TO LIBA-READ-IDX.                                     02471000
024720     MOVE ZERO TO WS-SUB1.                                        02472000
024730 LIBA-FIND-ACT-LOOP.                                              02473000
024740     ADD +1 TO WS-SUB1.                                           02474000
024750     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 02475000
024760         MOVE 'N' TO WS-FUNCTION                                  02476000
024770         GO TO LIBA-EXIT.                                         02477000
024780     IF SLW096-2023INTAPPL211 (WS-SUB1)                           02478000
024790         IS NOT EQUAL TO RPXXX30-APPL                             02479000
024800         GO TO LIBA-FIND-ACT-LOOP.                                02480000
024810     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO MIM-2023KPRODCODE.    02481000
024820 LIBA-READ-IDX.                                                   02482000
024830     MOVE RPXXX30-PRIMARY-INST TO RPIDX-INST.                     02483000
024840     MOVE MIM-2023KPRODCODE TO RPIDX-PRODCODE.                    02484000
024850     MOVE RPXXX30-PRIMARY-IDNUM TO RPIDX-IDNUMBER.                02485000
024860     PERFORM RPS-IDX-GET-REQUEST.                                 02486000
024870     IF WS-FUNCTION IS EQUAL TO 'N'                               02487000
024880         GO TO LIBA-FIND-ACT-LOOP.                                02488000
024890     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02489000
024900         MOVE WS-AB6310 TO RPXXX30-ABORT                          02490000
024910         MOVE WS-AB6310 TO RPXXX30-RESP-ABORT                     02491000
024920         MOVE WS-TR0056 TO RPXXX30-ABTRACE                        02492000
024930         MOVE WS-TR0056 TO RPXXX30-RESP-TRACE                     02493000
024940         GO TO CICS-ABORT-EXIT.                                   02494000
024950     MOVE RPIDX-ACCT2-KEY TO RPXXX30-PRIMARY-ACCT.                02495000
024960 LIBA-EXIT.                                                       02496000
024970     EXIT.                                                        02497000
024980******************************************************************02498000
024990 REQUEST-CUSTOMER SECTION.                                        02499000
025000 RC-START.                                                        02500000
025010     MOVE SPACES TO RPRF21-FUNCTION.                              02501000
025020     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             02502000
025030     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         02503000
025040     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          02504000
025050     EXEC CICS LINK                                               02505000
025060         PROGRAM('RPO0RF21')                                      02506000
025070         COMMAREA(RPRF21-MESSAGE)                                 02507000
025080         LENGTH(LENGTH OF RPRF21-MESSAGE)                         02508000
025090         RESP(WS-CICS-RESPONSE)                                   02509000
025100         END-EXEC.                                                02510000
025110     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         02511000
025120     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     02512000
025130         MOVE 'L' TO WS-FUNCTION                                  02513000
025140         MOVE 500036 TO WS-MSGNBR                                 02514000
025150         GO TO RC-EXIT.                                           02515000
025160     IF WS-FUNCTION IS EQUAL TO 'B'                               02516000
025170         MOVE 500045 TO WS-MSGNBR                                 02517000
025180         GO TO RC-EXIT.                                           02518000
025190     IF WS-FUNCTION IS EQUAL TO 'C'                               02519000
025200         MOVE 500037 TO WS-MSGNBR                                 02520000
025210         GO TO RC-EXIT.                                           02521000
025220     IF WS-FUNCTION IS EQUAL TO 'I'                               02522000
025230         MOVE 500038 TO WS-MSGNBR.                                02523000
025240 RC-EXIT.                                                         02524000
025250     EXIT.                                                        02525000
025260******************************************************************02526000
025270 FIND-PROD-CODE SECTION.                                          02527000
025280 FPC-START.                                                       02528000
025290     MOVE 'N' TO WS-ERRORPRODCODE.                                02529000
025300     MOVE '1' TO RPS-SEC-REC-ALT.                                 02530000
025310     MOVE LOW-VALUES TO RPSEC-GRP-KEY.                            02531000
025320     MOVE LOW-VALUES TO RPSEC-GRP-AIX1.                           02532000
025330     MOVE RPXXX30-PRIMARY-INST TO RPSEC-ALT-INST.                 02533000
025340     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPSEC-ALT-ACCOUNT.          02534000
025350     PERFORM RPS-SEC-GET-GE-REQUEST.                              02535000
025360     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02536000
025370         GO TO FPC-NO-SEC-RECORD.                                 02537000
025380     IF RPXXX30-PRIMARY-INST IS NOT EQUAL TO RPSEC-ALT-INST       02538000
025390         OR RPXXX30-PRIMARY-ACCT-NBR IS NOT EQUAL TO              02539000
025400             RPSEC-ALT-ACCOUNT                                    02540000
025410         GO TO FPC-NO-SEC-RECORD.                                 02541000
025420     MOVE RPSEC-GRP-AIX1 TO WS-SAVESECGRPAIX1.                    02542000
025430 FPC-READ-NEXT.                                                   02543000
025440     PERFORM RPS-SEC-GET-NEXT-REQUEST.                            02544000
025450     IF WS-FUNCTION IS EQUAL TO 'N'                               02545000
025460         OR WS-FUNCTION IS EQUAL TO 'E'                           02546000
025470         MOVE WS-SAVSECAPRODCODE TO RPXXX30-PRIMARY-PROD-CODE     02547000
025480         GO TO FPC-EXIT.                                          02548000
025490     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02549000
025500         MOVE 'Y' TO WS-ERRORPRODCODE                             02550000
025510         MOVE WS-AB6335 TO RPXXX30-ABORT                          02551000
025520         MOVE WS-AB6335 TO RPXXX30-RESP-ABORT                     02552000
025530         MOVE WS-TR0057 TO RPXXX30-ABTRACE                        02553000
025540         MOVE WS-TR0057 TO RPXXX30-RESP-TRACE                     02554000
025550         GO TO FPC-EXIT.                                          02555000
025560     IF RPSEC-ALT-INST IS EQUAL TO WS-SAVSECAINST                 02556000
025570         AND RPSEC-ALT-ACCOUNT IS EQUAL TO WS-SAVSECAACCOUNT      02557000
025580         MOVE 'Y' TO WS-ERRORPRODCODE                             02558000
025590         MOVE 500608 TO RPXXX30-RESP-MSG-NBR                      02559000
025600         MOVE 500608 TO RPXXX30-MSGNBR                            02560000
025610         GO TO FPC-EXIT.                                          02561000
025620     MOVE WS-SAVSECAPRODCODE TO RPXXX30-PRIMARY-PROD-CODE.        02562000
025630     GO TO FPC-EXIT.                                              02563000
025640 FPC-NO-SEC-RECORD.                                               02564000
025650     MOVE 'Y' TO WS-ERRORPRODCODE.                                02565000
025660     MOVE 500004 TO RPXXX30-RESP-MSG-NBR.                         02566000
025670     MOVE 500004 TO RPXXX30-MSGNBR.                               02567000
025680     GO TO FPC-EXIT.                                              02568000
025690 FPC-EXIT.                                                        02569000
025700     EXIT.                                                        02570000
025710******************************************************************02571000
025720 FIND-DEFAULT-MODEL SECTION.                                      02572000
025730 FDM-START.                                                       02573000
025740     MOVE 'N' TO WS-ERRORMODEL.                                   02574000
025750     MOVE RPXXX30-PRIMARY-INST TO RPMST-INST.                     02575000
025760     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPMST-PRODCODE.            02576000
025770     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPMST-ACCOUNT.              02577000
025780     MOVE RPXXX30-PRIMARY-MODEL TO RPMST-MODEL.                   02578000
025790     PERFORM RPS-MST-GET-GE-REQUEST.                              02579000
025800     IF WS-FUNCTION IS EQUAL TO 'N'                               02580000
025810         GO TO FDM-500BAD.                                        02581000
025820     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02582000
025830         MOVE WS-AB6320 TO RPXXX30-ABORT                          02583000
025840         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     02584000
025850         MOVE WS-TR0058 TO RPXXX30-ABTRACE                        02585000
025860         MOVE WS-TR0058 TO RPXXX30-RESP-TRACE                     02586000
025870         GO TO VK-RETURN.                                         02587000
025880* USE THIS IS THERE IS ONLY ONE                                   02588000
025890     IF RPMST-INST IS EQUAL TO RPXXX30-PRIMARY-INST               02589000
025900         AND RPMST-PRODCODE IS EQUAL TO RPXXX30-PRIMARY-PROD-CODE 02590000
025910         AND RPMST-ACCOUNT IS EQUAL TO RPXXX30-PRIMARY-ACCT-NBR   02591000
025920         GO TO FDM-200.                                           02592000
025930* IF THE FOUND RECORD DOES NOT MATCH SEND MESSAGE                 02593000
025940     GO TO FDM-500BAD.                                            02594000
025950 FDM-200.                                                         02595000
025960     MOVE RPMST-MODEL TO RPXXX30-PRIMARY-MODEL.                   02596000
025970     MOVE RPXXX30-PRIMARY-INST TO WS-SAVEMSTINST.                 02597000
025980     MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-SAVEMSTPRODCODE.        02598000
025990     MOVE RPXXX30-PRIMARY-ACCT-NBR TO WS-SAVEMSTACCOUNT.          02599000
026000     MOVE RPXXX30-PRIMARY-MODEL TO WS-SAVEMSTMODEL.               02600000
026010     PERFORM RPS-MST-GET-NEXT-REQUEST.                            02601000
026020     IF WS-FUNCTION IS EQUAL TO 'E'                               02602000
026030         GO TO FDM-500GOOD.                                       02603000
026040     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02604000
026050         MOVE WS-AB6320 TO RPXXX30-ABORT                          02605000
026060         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     02606000
026070         MOVE WS-TR0059 TO RPXXX30-ABTRACE                        02607000
026080         MOVE WS-TR0059 TO RPXXX30-RESP-TRACE                     02608000
026090         GO TO VK-RETURN.                                         02609000
026100     IF RPMST-INST IS EQUAL TO RPXXX30-PRIMARY-INST               02610000
026110         AND RPMST-PRODCODE IS EQUAL TO RPXXX30-PRIMARY-PROD-CODE 02611000
026120         AND RPMST-ACCOUNT IS EQUAL TO RPXXX30-PRIMARY-ACCT-NBR   02612000
026130         GO TO FDM-500MULTIPLE.                                   02613000
026140 FDM-500GOOD.                                                     02614000
026150     MOVE WS-SAVEMSTINST TO                                       02615000
026160         RPXXX30-PRIMARY-INST.                                    02616000
026170     MOVE WS-SAVEMSTPRODCODE TO                                   02617000
026180         RPXXX30-PRIMARY-PROD-CODE.                               02618000
026190     MOVE WS-SAVEMSTACCOUNT TO                                    02619000
026200         RPXXX30-PRIMARY-ACCT-NBR.                                02620000
026210     MOVE WS-SAVEMSTMODEL TO                                      02621000
026220         RPXXX30-PRIMARY-MODEL.                                   02622000
026230     GO TO FDM-EXIT.                                              02623000
026240 FDM-500BAD.                                                      02624000
026250     MOVE 'Y' TO WS-ERRORMODEL.                                   02625000
026260     MOVE 500004 TO RPXXX30-RESP-MSG-NBR.                         02626000
026270     MOVE 500004 TO RPXXX30-MSGNBR.                               02627000
026280     GO TO FDM-EXIT.                                              02628000
026290 FDM-500MULTIPLE.                                                 02629000
026300     MOVE 'Y' TO WS-ERRORMODEL.                                   02630000
026310     MOVE 500090 TO RPXXX30-RESP-MSG-NBR.                         02631000
026320     MOVE 500090 TO RPXXX30-MSGNBR.                               02632000
026330     GO TO FDM-EXIT.                                              02633000
026340 FDM-EXIT.                                                        02634000
026350     EXIT.                                                        02635000
P0025 ******************************************************************02635200
P0025  CROSS-INSTITUTION SECTION.                                       02635400
000000 COPY RPP004.                                                     02635600
P0111 ******************************************************************02635700
P0111  VALIDATE-PRIM-RELCD SECTION.                                     02635800
000000 COPY RPP008.                                                     02635900
026360******************************************************************02636000
026370 VALIDATE-BRANCH SECTION.                                         02637000
000000 COPY RPP7107A.                                                   02638000
026390******************************************************************02639000
026400 ADD-EVENT-HISTORY SECTION.                                       02640000
000000 COPY RPPEVTD.                                                    02641000
026420******************************************************************02642000
000000 COPY RPPACTA.                                                    02643000
026440******************************************************************02644000
000000 COPY RPPCRWA.                                                    02645000
026460******************************************************************02646000
000000 COPY RPPEVTA.                                                    02647000
026480******************************************************************02648000
000000 COPY RPPIDXA.                                                    02649000
026500******************************************************************02650000
000000 COPY RPPMSTA.                                                    02651000
026520******************************************************************02652000
000000 COPY RPPQUAA.                                                    02653000
026540******************************************************************02654000
000000 COPY RPPRELA.                                                    02655000
026560******************************************************************02656000
000000 COPY RPPSECA.                                                    02657000
026580******************************************************************02658000
000000 COPY RPPTRMA.                                                    02659000
026600******************************************************************02660000
026610 MIC-MST-API SECTION.                                             02661000
000000 COPY MIPMSTA.                                                    02662000
026630******************************************************************02663000
026640 SLP096-GET-2023-RECORD SECTION.                                  02664000
000000 COPY SLP096.                                                     02665000
026660******************************************************************02666000
026670 OPERATOR-DIALOG-SECURITY SECTION.                                02667000
000000 COPY SRP079.                                                     02668000
026690******************************************************************02669000
026700 CICS-ABORT-EXIT SECTION.                                         02670000
026710 CAE-START.                                                       02671000
026720     GO TO CICS-RETURN.                                           02672000
026730 CAE-EXIT.                                                        02673000
026740     EXIT.                                                        02674000
026750******************************************************************02675000
026760 CICS-RETURN SECTION.                                             02676000
026770     IF COM-ABORT IS NOT EQUAL TO ZERO                            02677000
026780         MOVE COM-ABORT TO RPXXX30-RESP-TRACE                     02678000
026790         MOVE COM-ABORT TO RPXXX30-ABORT.                         02679000
026800     IF RPXXX30-ABORT IS NOT EQUAL TO ZERO                        02680000
026810         AND WS-UPDATESW IS EQUAL TO 'Y'                          02681000
026820         MOVE 'Y' TO RPXXX30-ABTYPE.                              02682000
026830     IF RPXXX30-ABORT IS NOT EQUAL TO ZERO                        02683000
026840         MOVE WS-FUNCTION TO RPXXX30-FUNCTION                     02684000
026850         MOVE SRB-BMDB TO RPXXX30-SRBMDB                          02685000
026860         MOVE EIBFN TO RPXXX30-ABEIBFN                            02686000
026870         MOVE EIBRESP TO RPXXX30-ABEIBRESP                        02687000
026880         MOVE EIBRESP2 TO RPXXX30-ABEIBRESP2                      02688000
026890         MOVE EIBRCODE TO RPXXX30-ABEIBRCODE.                     02689000
000000 COPY SLP709.                                                     02692000
027000******************************************************************02700000
