000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX10.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX10 - ACCOUNT INCENTIVE OVERRIDE                       *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW079-AREAS.                                                00016000
000000 COPY SRW079.                                                     00017000
000180 01  SRW105-AREAS.                                                00018000
000000 COPY SRW105.                                                     00019000
000200*01  BICRSRB.                                                     00020000
000000 COPY BICRSRB.                                                    00021000
000220*01  BICRPSB.                                                     00022000
000000 COPY BICRPSB.                                                    00023000
000240*01  BICRVERB.                                                    00024000
000000 COPY BICRVERB.                                                   00025000
000260*01  BICRSTAT.                                                    00026000
000000 COPY BICRSTAT.                                                   00027000
000280*01  BICRDBS.                                                     00028000
000000 COPY BICRDBS.                                                    00029000
000300*01  BICRLOG.                                                     00030000
000000 COPY BICRLOG.                                                    00031000
000320 01  SRW710-AREAS.                                                00032000
000000 COPY SRW710.                                                     00033000
000340 01  WS-WORKAREAS.                                                00034000
000350     03  COM-ABORT               PIC S9(04)      COMP.            00035000
000360     03  WS-SUB1                 PIC S9(04)      COMP             00036000
000370                                                 VALUE +0000.     00037000
000380     03  WS-SUB2                 PIC S9(04)      COMP             00038000
000390                                                 VALUE +0000.     00039000
000400     03  WS-UPDATESW             PIC X(01)       VALUE SPACES.    00040000
000410     03  WS-ACCT-TYPE            PIC 9(03)       VALUE ZEROES.    00041000
000420     03  WS-PRODCODE             PIC X(06)       VALUE ZEROES.    00042000
000430     03  WS-REL-SWITCH           PIC X(01)       VALUE SPACES.    00043000
000440     03  WS-DISCAMT-OVRD-FLAG    PIC X(01)       VALUE SPACES.    00044000
000450     03  WS-DISCPCT-OVRD-FLAG    PIC X(01)       VALUE SPACES.    00045000
000460     03  WS-RATEPCT-OVRD-FLAG    PIC X(01)       VALUE SPACES.    00046000
000470     03  WS-DISCAMT-OVRD         PIC S9(09)V99   COMP-3           00047000
000480                                                 VALUE ZEROES.    00048000
000490     03  WS-DISCPCT-OVRD         PIC SV9(05)     VALUE ZEROES.    00049000
000500     03  WS-RATEPCT-OVRD         PIC SV9(05)     VALUE ZEROES.    00050000
000510     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00051000
000520                                                 VALUE ZERO.      00052000
000530     03  WS-CHECK-FOR-NEXT       PIC X(01)       VALUE SPACE.     00053000
000540     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00054000
000550     03  FILLER          REDEFINES WS-CURDATE.                    00055000
000560         05  WS-CURMM            PIC 9(02).                       00056000
000570         05  WS-CURDD            PIC 9(02).                       00057000
000580         05  WS-CURYYYY          PIC 9(04).                       00058000
000590     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00059000
000600     03  FILLER          REDEFINES WS-PDATE.                      00060000
000610         05  WS-PDATE-YYYY       PIC 9(04).                       00061000
000620         05  WS-PDATE-MM         PIC 9(02).                       00062000
000630         05  WS-PDATE-DD         PIC 9(02).                       00063000
000640     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00064000
000650     03  FILLER          REDEFINES WS-PDATE2.                     00065000
000660         05  WS-PDATE2-YYYY      PIC 9(04).                       00066000
000670         05  WS-PDATE2-MM        PIC 9(02).                       00067000
000680         05  WS-PDATE2-DD        PIC 9(02).                       00068000
000690     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00069000
000700                                                 VALUE ZERO.      00070000
000710     03  WS-MST-MODEL            PIC X(10)       VALUE SPACES.    00071000
000720     03  WS-TSTINST              PIC 9(04)       VALUE ZERO.      00072000
000730     03  WS-TSTPRODCODE          PIC X(06)       VALUE SPACES.    00073000
000740     03  WS-TSTACCOUNT           PIC X(18)       VALUE SPACES.    00074000
000750     03  WS-TSTMODEL             PIC X(10)       VALUE SPACES.    00075000
000760     03  WSXXX10-SK-ACCT1.                                        00076000
000770         05  WSXXX10-SK-INST     PIC 9(04).                       00077000
000780         05  WSXXX10-SK-PRODCODE PIC X(06).                       00078000
000790         05  WSXXX10-SK-ACCOUNT  PIC X(18).                       00079000
000800     03  WS-ERRORMODEL           PIC X(01)       VALUE 'N'.       00080000
000810     03  WS-SAVEMASTERGROUP.                                      00081000
000820         05  WS-SAVEMSTINST      PIC 9(04).                       00082000
000830         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00083000
000840         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00084000
000850         05  WS-SAVEMSTMODEL     PIC X(10).                       00085000
000860*----------------------------------------------------------------*00086000
000870 01  MIWPRI-AREAS.                                                00087000
000000 COPY MIWPRI.                                                     00088000
000890 01  MIWMSTA-AREAS.                                               00089000
000000 COPY MIWMSTA.                                                    00090000
000910 01  MIMST-RECORD.                                                00091000
000000 COPY MISMST.                                                     00092000
000930 01  MI2023-RECORD.                                               00093000
000000 COPY MIS2023A.                                                   00094000
000950 01  MI7101-RECORD.                                               00095000
000000 COPY MIS7101.                                                    00096000
000970*----------------------------------------------------------------*00097000
000980 01  RPWPRI-AREAS.                                                00098000
000000 COPY RPWPRI.                                                     00099000
001000 01  RPWACT-AREA.                                                 00100000
000000 COPY RPWACTA.                                                    00101000
001020 01  RPACT-RECORD.                                                00102000
000000 COPY RPSACT.                                                     00103000
001040 01  RPWMST-AREA.                                                 00104000
000000 COPY RPWMSTA.                                                    00105000
001060 01  RPMST-RECORD.                                                00106000
000000 COPY RPSMST.                                                     00107000
001080 01  RPWREL-AREA.                                                 00108000
000000 COPY RPWRELA.                                                    00109000
001100 01  RPREL-RECORD.                                                00110000
000000 COPY RPSREL.                                                     00111000
001120 01  RPWSEC-AREA.                                                 00112000
000000 COPY RPWSECA.                                                    00113000
001140 01  RPSEC-RECORD.                                                00114000
000000 COPY RPSSEC.                                                     00115000
001160*----------------------------------------------------------------*00116000
001170 01  WS-TRACECODES.                                               00117000
001180     03  WS-TR0001               PIC S9(04)      COMP             00118000
001190                                                 VALUE +0001.     00119000
001200     03  WS-TR0002               PIC S9(04)      COMP             00120000
001210                                                 VALUE +0002.     00121000
001220     03  WS-TR0003               PIC S9(04)      COMP             00122000
001230                                                 VALUE +0003.     00123000
001240     03  WS-TR0004               PIC S9(04)      COMP             00124000
001250                                                 VALUE +0004.     00125000
001260     03  WS-TR0005               PIC S9(04)      COMP             00126000
001270                                                 VALUE +0005.     00127000
001280     03  WS-TR0006               PIC S9(04)      COMP             00128000
001290                                                 VALUE +0006.     00129000
001300     03  WS-TR0007               PIC S9(04)      COMP             00130000
001310                                                 VALUE +0007.     00131000
001320     03  WS-TR0008               PIC S9(04)      COMP             00132000
001330                                                 VALUE +0008.     00133000
001340     03  WS-TR0009               PIC S9(04)      COMP             00134000
001350                                                 VALUE +0009.     00135000
001360     03  WS-TR0010               PIC S9(04)      COMP             00136000
001370                                                 VALUE +0010.     00137000
001380     03  WS-TR0011               PIC S9(04)      COMP             00138000
001390                                                 VALUE +0011.     00139000
001400     03  WS-TR0012               PIC S9(04)      COMP             00140000
001410                                                 VALUE +0012.     00141000
001420     03  WS-TR0013               PIC S9(04)      COMP             00142000
001430                                                 VALUE +0013.     00143000
001440     03  WS-TR0014               PIC S9(04)      COMP             00144000
001450                                                 VALUE +0014.     00145000
001460     03  WS-TR0015               PIC S9(04)      COMP             00146000
001470                                                 VALUE +0015.     00147000
001480     03  WS-TR0016               PIC S9(04)      COMP             00148000
001490                                                 VALUE +0016.     00149000
001500     03  WS-TR0017               PIC S9(04)      COMP             00150000
001510                                                 VALUE +0017.     00151000
001520     03  WS-TR0018               PIC S9(04)      COMP             00152000
001530                                                 VALUE +0018.     00153000
001540     03  WS-TR0019               PIC S9(04)      COMP             00154000
001550                                                 VALUE +0019.     00155000
001560     03  WS-TR0020               PIC S9(04)      COMP             00156000
001570                                                 VALUE +0020.     00157000
001580     03  WS-TR0021               PIC S9(04)      COMP             00158000
001590                                                 VALUE +0021.     00159000
001600     03  WS-TR0022               PIC S9(04)      COMP             00160000
001610                                                 VALUE +0022.     00161000
001620     03  WS-TR0023               PIC S9(04)      COMP             00162000
001630                                                 VALUE +0023.     00163000
001640     03  WS-TR0024               PIC S9(04)      COMP             00164000
001650                                                 VALUE +0024.     00165000
001660     03  WS-TR0025               PIC S9(04)      COMP             00166000
001670                                                 VALUE +0025.     00167000
001680     03  WS-TR0054               PIC S9(04)      COMP             00168000
001690                                                 VALUE +0054.     00169000
001700     03  WS-TR0055               PIC S9(04)      COMP             00170000
001710                                                 VALUE +0055.     00171000
001720 01  WS-ABORTCODES.                                               00172000
001730     03  WS-AB2000               PIC S9(04)      COMP             00173000
001740                                                 VALUE +2000.     00174000
001750     03  WS-AB2033               PIC S9(04)      COMP             00175000
001760                                                 VALUE +2033.     00176000
001770     03  WS-AB3051               PIC S9(04)      COMP             00177000
001780                                                 VALUE +3051.     00178000
001790     03  WS-AB6300               PIC S9(04)      COMP             00179000
001800                                                 VALUE +6300.     00180000
001810     03  WS-AB6310               PIC S9(04)      COMP             00181000
001820                                                 VALUE +6310.     00182000
001830     03  WS-AB6320               PIC S9(04)      COMP             00183000
001840                                                 VALUE +6320.     00184000
001850     03  WS-AB6325               PIC S9(04)      COMP             00185000
001860                                                 VALUE +6325.     00186000
001870     03  WS-AB6330               PIC S9(04)      COMP             00187000
001880                                                 VALUE +6330.     00188000
001890     03  WS-AB6335               PIC S9(04)      COMP             00189000
001900                                                 VALUE +6335.     00190000
001910     03  WS-AB6350               PIC S9(04)      COMP             00191000
001920                                                 VALUE +6350.     00192000
001930******************************************************************00193000
001940 01  SLW096-AREAS.                                                00194000
000000 COPY SLW096.                                                     00195000
001960******************************************************************00196000
001970 LINKAGE SECTION.                                                 00197000
001980 01  DFHCOMMAREA.                                                 00198000
000000 COPY MISCNT00      REPLACING                                     00199000
002000             ==:MICNT:== BY ==RPXXX10==.                          00200000
000000 COPY RPSXXX10.                                                   00201000
002020*01  SLW096-2023RECORDS.                                          00202000
000000 COPY SLW096L.                                                    00203000
002040******************************************************************00204000
002050 PROCEDURE DIVISION.                                              00205000
002060******************************************************************00206000
002070 ENTRY-ROUTINE SECTION.                                           00207000
002080 ER-START.                                                        00208000
002090     MOVE 'RPLXXX10' TO SR-APIPROGLIT.                            00209000
002100     MOVE 'RPLXXX10' TO RPXXX10-ABPROGID.                         00210000
002110     PERFORM CICS-HANDLE-CONDITION.                               00211000
002120     IF EIBCALEN IS EQUAL TO +0                                   00212000
002130         MOVE WS-AB2000 TO RPXXX10-ABORT                          00213000
002140         MOVE WS-TR0001 TO RPXXX10-ABTRACE                        00214000
002150         GO TO CICS-RETURN.                                       00215000
002160     MOVE ZERO TO RPXXX10-MSGNBR.                                 00216000
002170     MOVE SPACE TO WS-FUNCTION.                                   00217000
002180     MOVE RPXXX10-FILEOPTS TO WS-FILEOPTS.                        00218000
002190     MOVE RPXXX10-OPERID TO WS-UPD-USER.                          00219000
002200     MOVE RPXXX10-EXTERNALID TO LOG-PANELID.                      00220000
002210     MOVE RPXXX10-TERMID TO LOG-TERMID.                           00221000
002220     MOVE RPXXX10-WORKID TO LOG-WORKID.                           00222000
002230     MOVE RPXXX10-TRANSTART TO LOG-TRANSTART.                     00223000
002240     MOVE RPXXX10-APPLSEQ TO LOG-APPLSEQ.                         00224000
000000 COPY SLP094.                                                     00225000
002260     GO TO VERIFY-KEY.                                            00226000
002270 ER-EXIT.                                                         00227000
002280     EXIT.                                                        00228000
002290******************************************************************00229000
002300 CICS-HANDLE-CONDITION SECTION.                                   00230000
000000 COPY SLP702.                                                     00231000
002320     MOVE WS-AB2033 TO RPXXX10-ABORT.                             00232000
002330     MOVE WS-TR0002 TO RPXXX10-ABTRACE.                           00233000
002340     GO TO CICS-RETURN.                                           00234000
002350 CHC-EXIT.                                                        00235000
002360     EXIT.                                                        00236000
002370******************************************************************00237000
002380 VERIFY-KEY SECTION.                                              00238000
002390 VK-START.                                                        00239000
002400     MOVE ZERO TO COM-ABORT.                                      00240000
002410     MOVE ZERO TO RPXXX10-ABORT.                                  00241000
002420     MOVE ZERO TO RPXXX10-MSGNBR.                                 00242000
002430     MOVE ZERO TO WS-MSGNBR.                                      00243000
002440     MOVE SPACES TO RPXXX10-FUNCTION.                             00244000
002450     MOVE RPXXX10-DATE TO WS-CURDATE.                             00245000
002460     MOVE WS-CURMM TO WS-PDATE-MM.                                00246000
002470     MOVE WS-CURDD TO WS-PDATE-DD.                                00247000
002480     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00248000
002490     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00249000
002500 VK-SELECTKEY.                                                    00250000
002510     IF RPXXX10-SK-INST-DCHG IS EQUAL TO 'N'                      00251000
002520         OR RPXXX10-SK-INST-DCHG IS EQUAL TO 'E'                  00252000
002530         MOVE 000002 TO RPXXX10-MSGNBR                            00253000
002540         MOVE 'E' TO RPXXX10-SK-INST-DCHG                         00254000
002550         GO TO VK-ERROR.                                          00255000
002560     IF RPXXX10-SK-INST IS NOT NUMERIC                            00256000
002570         OR RPXXX10-SK-INST IS EQUAL TO ZEROS                     00257000
002580         MOVE 000002 TO RPXXX10-MSGNBR                            00258000
002590         MOVE 'E' TO RPXXX10-SK-INST-DCHG                         00259000
002600         GO TO VK-ERROR.                                          00260000
002610     IF RPXXX10-SK-PRODCODE-DCHG IS EQUAL TO 'N'                  00261000
002620         AND RPXXX10-SK-ACCOUNT-DCHG IS EQUAL TO 'N'              00262000
002630         AND RPXXX10-SK-MODEL-DCHG IS EQUAL TO 'N'                00263000
002640         MOVE 000002 TO RPXXX10-MSGNBR                            00264000
002650         GO TO VK-ERROR.                                          00265000
002660     IF RPXXX10-SK-PRODCODE-DCHG IS EQUAL TO 'N'                  00266000
002670         OR RPXXX10-SK-PRODCODE-DCHG IS EQUAL TO 'E'              00267000
002680         MOVE 000002 TO RPXXX10-MSGNBR                            00268000
002690         MOVE 'E' TO RPXXX10-SK-PRODCODE-DCHG                     00269000
002700         GO TO VK-ERROR.                                          00270000
002710     IF RPXXX10-SK-PRODCODE IS EQUAL TO SPACES                    00271000
002720         OR RPXXX10-SK-PRODCODE IS EQUAL TO LOW-VALUES            00272000
002730         MOVE 000002 TO RPXXX10-MSGNBR                            00273000
002740         MOVE 'E' TO RPXXX10-SK-PRODCODE-DCHG                     00274000
002750         GO TO VK-ERROR.                                          00275000
002760     IF RPXXX10-SK-ACCOUNT-DCHG IS EQUAL TO 'N'                   00276000
002770         OR RPXXX10-SK-ACCOUNT-DCHG IS EQUAL TO 'E'               00277000
002780         MOVE 000002 TO RPXXX10-MSGNBR                            00278000
002790         MOVE 'E' TO RPXXX10-SK-ACCOUNT-DCHG                      00279000
002800         GO TO VK-ERROR.                                          00280000
002810     IF RPXXX10-SK-ACCOUNT IS EQUAL TO SPACES                     00281000
002820         OR RPXXX10-SK-ACCOUNT IS EQUAL TO LOW-VALUES             00282000
002830         MOVE 000002 TO RPXXX10-MSGNBR                            00283000
002840         MOVE 'E' TO RPXXX10-SK-ACCOUNT-DCHG                      00284000
002850         GO TO VK-ERROR.                                          00285000
002860     IF RPXXX10-SK-MODEL-DCHG IS EQUAL TO 'E'                     00286000
002870         MOVE 000002 TO RPXXX10-MSGNBR                            00287000
002880         MOVE 'E' TO RPXXX10-SK-MODEL-DCHG                        00288000
002890         GO TO VK-ERROR.                                          00289000
002900     IF RPXXX10-SK-INST2-DCHG IS EQUAL TO 'E'                     00290000
002910         MOVE 000002 TO RPXXX10-MSGNBR                            00291000
002920         MOVE 'E' TO RPXXX10-SK-INST2-DCHG                        00292000
002930         GO TO VK-ERROR.                                          00293000
002940     IF RPXXX10-SK-INST2 IS NOT NUMERIC                           00294000
002950         MOVE ZEROS TO RPXXX10-SK-INST2.                          00295000
002960     IF RPXXX10-SK-PRODCODE2-DCHG IS EQUAL TO 'E'                 00296000
002970         MOVE 000002 TO RPXXX10-MSGNBR                            00297000
002980         MOVE 'E' TO RPXXX10-SK-PRODCODE2-DCHG                    00298000
002990         GO TO VK-ERROR.                                          00299000
003000     IF RPXXX10-SK-ACCOUNT2-DCHG IS EQUAL TO 'E'                  00300000
003010         MOVE 000002 TO RPXXX10-MSGNBR                            00301000
003020         MOVE 'E' TO RPXXX10-SK-ACCOUNT2-DCHG                     00302000
003030         GO TO VK-ERROR.                                          00303000
003040     IF RPXXX10-NBR-OCCURS IS NOT NUMERIC                         00304000
003050         MOVE ZEROS TO RPXXX10-NBR-OCCURS.                        00305000
003060     IF RPXXX10-END-FILE-INST IS EQUAL TO LOW-VALUE               00306000
003070         MOVE SPACE TO RPXXX10-END-FILE-INST.                     00307000
003080 VK-SECURITY.                                                     00308000
003090     IF RPXXX10-APIFUNC IS NOT EQUAL TO 'VKL'                     00309000
003100         GO TO VK-EXIT.                                           00310000
003110     MOVE RPXXX10-UPDATE TO SR-OPDUPDATE.                         00311000
003120     MOVE RPXXX10-SK-INST TO SR-OPDINST.                          00312000
003130     MOVE RPXXX10-OPERID TO SR-OPDOPERID.                         00313000
003140     MOVE RPXXX10-MODELID TO SR-OPDMODELID.                       00314000
003150     MOVE RPXXX10-EXTERNALID TO SR-OPDTRANCODE.                   00315000
003160     MOVE RPXXX10-APPL TO SR-OPDAPPL.                             00316000
003170     MOVE RPXXX10-SECALT TO SR-OPDSECALT.                         00317000
003180     MOVE RPXXX10-FUNC TO SR-OPDFUNC.                             00318000
003190     PERFORM OPERATOR-DIALOG-SECURITY.                            00319000
003200     MOVE SR-OPDUPDATE TO RPXXX10-UPDATE.                         00320000
003210     IF SR-OPDMSGNBR IS NOT EQUAL TO ZEROS                        00321000
003220         MOVE SR-OPDMSGNBR TO RPXXX10-MSGNBR                      00322000
003230         GO TO VK-ERROR.                                          00323000
003240     MOVE SPACE TO RPXXX10-END-FILE-INST.                         00324000
003250     MOVE SPACE TO RPXXX10-DISCAMT-ACTION.                        00325000
003260     MOVE 'P' TO RPXXX10-DISCAMT-ACTION-DCHG.                     00326000
003270     MOVE 'N' TO RPXXX10-DISCAMT-OVRD-FLAG.                       00327000
003280     MOVE 'P' TO RPXXX10-DISCAMT-OVRD-FLAG-DCHG.                  00328000
003290     MOVE ZEROS TO RPXXX10-DISCAMT-OVRD.                          00329000
003300     MOVE 'P' TO RPXXX10-DISCAMT-OVRD-DCHG.                       00330000
003310     MOVE SPACE TO RPXXX10-DISCPCT-ACTION.                        00331000
003320     MOVE 'P' TO RPXXX10-DISCPCT-ACTION-DCHG.                     00332000
003330     MOVE 'N' TO RPXXX10-DISCPCT-OVRD-FLAG.                       00333000
003340     MOVE 'P' TO RPXXX10-DISCPCT-OVRD-FLAG-DCHG.                  00334000
003350     MOVE ZEROS TO RPXXX10-DISCPCT-OVRD.                          00335000
003360     MOVE 'P' TO RPXXX10-DISCPCT-OVRD-DCHG.                       00336000
003370     MOVE SPACE TO RPXXX10-RATEPCT-ACTION.                        00337000
003380     MOVE 'P' TO RPXXX10-RATEPCT-ACTION-DCHG.                     00338000
003390     MOVE 'N' TO RPXXX10-RATEPCT-OVRD-FLAG.                       00339000
003400     MOVE 'P' TO RPXXX10-RATEPCT-OVRD-FLAG-DCHG.                  00340000
003410     MOVE ZEROS TO RPXXX10-RATEPCT-OVRD.                          00341000
003420     MOVE 'P' TO RPXXX10-RATEPCT-OVRD-DCHG.                       00342000
003430 VK-SEC.                                                          00343000
003440     INITIALIZE RPSEC-GRP-KEY.                                    00344000
003450*    MOVE RPXXX10-SELECTKEY TO RPSEC-GRP-KEY.                     00345000
003460* FORMAT OF RPXXX10-SELECTKEY AND RPSEC-GRP-KEY ARE DIFFERENT     00346000
003470     IF RPXXX10-SK-MODEL IS EQUAL TO SPACES                       00347000
003480         OR RPXXX10-SK-MODEL IS EQUAL TO LOW-VALUES               00348000
003490         PERFORM FIND-DEFAULT-MODEL.                              00349000
003500     IF WS-ERRORMODEL IS EQUAL TO 'Y'                             00350000
003510         GO TO VK-ERROR.                                          00351000
003520     MOVE RPXXX10-SK-INST TO RPSEC-INST.                          00352000
003530     MOVE RPXXX10-SK-PRODCODE TO RPSEC-PRODCODE.                  00353000
003540     MOVE RPXXX10-SK-ACCOUNT TO RPSEC-ACCOUNT.                    00354000
003550     MOVE RPXXX10-SK-INST2 TO RPSEC-INST2.                        00355000
003560     MOVE RPXXX10-SK-PRODCODE2 TO RPSEC-PRODCODE2.                00356000
003570     MOVE RPXXX10-SK-ACCOUNT2 TO RPSEC-ACCOUNT2.                  00357000
003580     MOVE RPXXX10-SK-MODEL TO RPSEC-MODEL2.                       00358000
003590*                                                                 00359000
003600     PERFORM RPS-SEC-GET-GE-REQUEST.                              00360000
003610     IF WS-FUNCTION IS EQUAL TO 'E'                               00361000
003620         MOVE 'E' TO RPXXX10-END-FILE-INST                        00362000
003630         MOVE 'Y' TO RPXXX10-END-FILE-INST-DCHG                   00363000
003640         MOVE 500076 TO RPXXX10-MSGNBR                            00364000
003650         GO TO VK-ERROR.                                          00365000
003660     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00366000
003670         MOVE WS-AB6335 TO RPXXX10-ABORT                          00367000
003680         MOVE WS-TR0003 TO RPXXX10-ABTRACE                        00368000
003690         GO TO CICS-ABORT-EXIT.                                   00369000
003700     MOVE RPXXX10-SK-INST TO WSXXX10-SK-INST.                     00370000
003710     MOVE RPXXX10-SK-PRODCODE TO WSXXX10-SK-PRODCODE.             00371000
003720     MOVE RPXXX10-SK-ACCOUNT TO WSXXX10-SK-ACCOUNT.               00372000
003730     IF RPSEC-ACCT1-GRP IS NOT EQUAL TO WSXXX10-SK-ACCT1          00373000
003740         MOVE 'E' TO RPXXX10-END-FILE-INST                        00374000
003750         MOVE 'Y' TO RPXXX10-END-FILE-INST-DCHG                   00375000
003760         MOVE 500076 TO RPXXX10-MSGNBR                            00376000
003770         GO TO VK-ERROR.                                          00377000
003780     IF RPSEC-MODEL2 IS NOT EQUAL TO RPXXX10-SK-MODEL             00378000
003790         GO TO VK-NEXT-SEC.                                       00379000
003800     GO TO VK-MST.                                                00380000
003810 VK-NEXT-SEC.                                                     00381000
003820     PERFORM RPS-SEC-GET-NEXT-REQUEST.                            00382000
003830     IF WS-FUNCTION IS EQUAL TO 'E'                               00383000
003840         MOVE 'E' TO RPXXX10-END-FILE-INST                        00384000
003850         MOVE 'Y' TO RPXXX10-END-FILE-INST-DCHG                   00385000
003860         MOVE 500074 TO RPXXX10-MSGNBR                            00386000
003870         GO TO VK-ERROR.                                          00387000
003880     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00388000
003890         MOVE WS-AB6335 TO RPXXX10-ABORT                          00389000
003900         MOVE WS-TR0004 TO RPXXX10-ABTRACE                        00390000
003910         GO TO CICS-ABORT-EXIT.                                   00391000
003920     MOVE RPXXX10-SK-INST TO WSXXX10-SK-INST.                     00392000
003930     MOVE RPXXX10-SK-PRODCODE TO WSXXX10-SK-PRODCODE.             00393000
003940     MOVE RPXXX10-SK-ACCOUNT TO WSXXX10-SK-ACCOUNT.               00394000
003950     IF RPSEC-ACCT1-GRP IS NOT EQUAL TO WSXXX10-SK-ACCT1          00395000
003960         MOVE 'E' TO RPXXX10-END-FILE-INST                        00396000
003970         MOVE 'Y' TO RPXXX10-END-FILE-INST-DCHG                   00397000
003980         MOVE 500074 TO RPXXX10-MSGNBR                            00398000
003990         GO TO VK-ERROR.                                          00399000
004000     IF RPSEC-MODEL2 IS NOT EQUAL TO RPXXX10-SK-MODEL             00400000
004010         GO TO VK-NEXT-SEC.                                       00401000
004020 VK-MST.                                                          00402000
004030     INITIALIZE RPMST-GRP-KEY.                                    00403000
004040     MOVE RPSEC-INST2 TO RPMST-INST.                              00404000
004050     MOVE RPSEC-PRODCODE2 TO RPMST-PRODCODE.                      00405000
004060     MOVE RPSEC-ACCOUNT2 TO RPMST-ACCOUNT.                        00406000
004070     MOVE RPSEC-MODEL2 TO RPMST-MODEL.                            00407000
004080     IF RPSEC-PRODCODE2 IS EQUAL TO SPACES                        00408000
004090         AND RPSEC-ACCOUNT2 IS EQUAL TO SPACES                    00409000
004100         MOVE RPSEC-ACCT1-GRP TO RPMST-GRP-KEY                    00410000
004110         MOVE RPSEC-MODEL2 TO RPMST-MODEL.                        00411000
004120*    PERFORM RPS-MST-GET-REQUEST.                                 00412000
004130* IF MODEL IS NOT ENTERED CANNOT DO DIRECT READ                   00413000
004140     MOVE RPMST-INST TO WS-TSTINST.                               00414000
004150     MOVE RPMST-PRODCODE TO WS-TSTPRODCODE.                       00415000
004160     MOVE RPMST-ACCOUNT TO WS-TSTACCOUNT.                         00416000
004170     MOVE RPMST-MODEL TO WS-TSTMODEL.                             00417000
004180     PERFORM RPS-MST-GET-GE-REQUEST.                              00418000
004190 VK-MST-LOOK.                                                     00419000
004200     IF WS-FUNCTION IS EQUAL TO 'E'                               00420000
004210         MOVE 500004 TO RPXXX10-MSGNBR                            00421000
004220         GO TO VK-ERROR.                                          00422000
004230     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00423000
004240         MOVE WS-AB6320 TO RPXXX10-ABORT                          00424000
004250         MOVE WS-TR0005 TO RPXXX10-ABTRACE                        00425000
004260         GO TO CICS-ABORT-EXIT.                                   00426000
004270     IF RPMST-INST IS EQUAL TO WS-TSTINST                         00427000
004280         AND RPMST-PRODCODE IS EQUAL TO WS-TSTPRODCODE            00428000
004290         AND RPMST-ACCOUNT IS EQUAL TO WS-TSTACCOUNT              00429000
004300         AND RPMST-MODEL IS EQUAL TO WS-TSTMODEL                  00430000
004310         GO TO VK-MST-ALL.                                        00431000
004320* THIS OCCURS WHEN SEC PRODCODE AND ACCOUNT ARE SPACES            00432000
004330     IF RPMST-INST IS EQUAL TO WS-TSTINST                         00433000
004340         AND RPMST-PRODCODE IS EQUAL TO WS-TSTPRODCODE            00434000
004350         AND RPMST-ACCOUNT IS EQUAL TO WS-TSTACCOUNT              00435000
004360         AND WS-TSTMODEL IS EQUAL TO SPACES                       00436000
004370         GO TO VK-MST-ALL.                                        00437000
004380     IF RPMST-INST IS EQUAL TO WS-TSTINST                         00438000
004390         AND RPMST-PRODCODE IS EQUAL TO WS-TSTPRODCODE            00439000
004400         AND RPMST-ACCOUNT IS EQUAL TO WS-TSTACCOUNT              00440000
004410         PERFORM RPS-MST-GET-NEXT-REQUEST                         00441000
004420         GO TO VK-MST-LOOK.                                       00442000
004430* DID NOT FIND A MST FOR THE SEC REQUESTED                        00443000
004440     MOVE 500004 TO RPXXX10-MSGNBR.                               00444000
004450     GO TO VK-ERROR.                                              00445000
004460 VK-MST-ALL.                                                      00446000
004470     IF RPMST-REL-STAT IS NOT EQUAL TO 'A'                        00447000
004480         GO TO VK-NEXT-SEC.                                       00448000
004490     MOVE RPMST-MODEL TO WS-MST-MODEL.                            00449000
004500 VK-REL.                                                          00450000
004510     INITIALIZE RPREL-GRP-KEY.                                    00451000
004520     MOVE RPSEC-ACCT2-GRP TO RPREL-ACCT1-GRP.                     00452000
004530     MOVE RPSEC-MODEL2 TO RPREL-MODEL.                            00453000
004540     IF RPSEC-PRODCODE2 IS EQUAL TO SPACES                        00454000
004550         AND RPSEC-ACCOUNT2 IS EQUAL TO SPACES                    00455000
004560         MOVE RPSEC-ACCT1-GRP TO RPREL-ACCT1-GRP                  00456000
004570         MOVE RPSEC-MODEL2 TO RPREL-MODEL                         00457000
004580     ELSE                                                         00458000
004590         MOVE RPSEC-INST TO RPREL-INST2                           00459000
004600         MOVE RPSEC-PRODCODE TO RPREL-PRODCODE2                   00460000
004610         MOVE RPSEC-MODEL2 TO RPREL-MODEL                         00461000
004620         MOVE RPSEC-ACCOUNT TO RPREL-ACCOUNT2.                    00462000
004630     PERFORM RPS-REL-GET-REQUEST.                                 00463000
004640     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00464000
004650         MOVE WS-AB6330 TO RPXXX10-ABORT                          00465000
004660         MOVE WS-TR0006 TO RPXXX10-ABTRACE                        00466000
004670         GO TO CICS-ABORT-EXIT.                                   00467000
004680     IF RPREL-SC-INC-OPTION IS EQUAL TO 'N'                       00468000
004690         AND RPREL-RATE-INC-OPTION IS EQUAL TO 'N'                00469000
004700         GO TO VK-NEXT-SEC.                                       00470000
004710 VK-7101.                                                         00471000
004720     MOVE SPACES TO MI7101-RECORD.                                00472000
004730     MOVE RPMST-INST TO MIM-7101KINST.                            00473000
004740     MOVE +7101 TO MIM-7101KREC.                                  00474000
004750     MOVE RPREL-MODEL TO MIM-7101KMODEL.                          00475000
004760     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        00476000
004770     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00477000
004780     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00478000
004790     MOVE MI7101-RECORD TO MIMST-RECORD.                          00479000
004800     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00480000
004810     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00481000
004820         MOVE 500006 TO RPXXX10-MSGNBR                            00482000
004830         GO TO VK-ERROR.                                          00483000
004840     MOVE MIMST-RECORD TO MI7101-RECORD.                          00484000
004850     IF MIM-7101KINST IS NOT EQUAL TO RPMST-INST                  00485000
004860         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00486000
004870         OR MIM-7101KMODEL IS NOT EQUAL TO RPREL-MODEL            00487000
004880         MOVE 500006 TO RPXXX10-MSGNBR                            00488000
004890         GO TO VK-ERROR.                                          00489000
004900     IF MIM-7101ACCTINCENOVRD IS EQUAL TO 'N'                     00490000
004910         GO TO VK-NEXT-SEC.                                       00491000
004920     MOVE MIM-7101DESC TO RPXXX10-MODEL-DESC.                     00492000
004930     MOVE RPREL-MODEL TO RPXXX10-SK-MODEL.                        00493000
004940     MOVE 'Y' TO RPXXX10-MODEL-DESC-DCHG.                         00494000
004950 VK-ACT.                                                          00495000
004960     INITIALIZE RPACT-RECORD.                                     00496000
004970     MOVE RPXXX10-SK-ACCT1 TO RPACT-GRP-KEY.                      00497000
004980     PERFORM RPS-ACT-GET-REQUEST.                                 00498000
004990     IF WS-FUNCTION IS EQUAL TO 'N'                               00499000
005000         MOVE 500075 TO RPXXX10-MSGNBR                            00500000
005010         MOVE 'E' TO RPXXX10-SK-ACCOUNT-DCHG                      00501000
005020         GO TO VK-ERROR.                                          00502000
005030     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00503000
005040         MOVE WS-AB6300 TO RPXXX10-ABORT                          00504000
005050         MOVE WS-TR0007 TO RPXXX10-ABTRACE                        00505000
005060         GO TO CICS-ABORT-EXIT.                                   00506000
005070     MOVE RPACT-DISCOUNT-AMOUNT TO RPXXX10-DISCOUNT-AMOUNT.       00507000
005080     MOVE 'Y' TO RPXXX10-DISCOUNT-AMOUNT-DCHG.                    00508000
005090     MOVE RPACT-DISCOUNT-PERCENT TO RPXXX10-DISCOUNT-PERCENT.     00509000
005100     MOVE 'Y' TO RPXXX10-DISCOUNT-PERCENT-DCHG.                   00510000
005110     MOVE RPACT-RATE-PERCENT TO RPXXX10-RATE-PERCENT.             00511000
005120     MOVE 'Y' TO RPXXX10-RATE-PERCENT-DCHG.                       00512000
005130     MOVE RPREL-SC-INC-OPTION TO RPXXX10-SC-OPTION.               00513000
005140     MOVE 'Y' TO RPXXX10-SC-OPTION-DCHG.                          00514000
005150     MOVE RPREL-RATE-INC-OPTION TO RPXXX10-RATE-OPTION.           00515000
005160     MOVE 'Y' TO RPXXX10-RATE-OPTION-DCHG.                        00516000
005170     MOVE 'N' TO RPXXX10-DISCAMT-ACTION-DCHG.                     00517000
005180     MOVE RPREL-DISCAMT-OVRD-FLAG TO RPXXX10-DISCAMT-OVRD-FLAG.   00518000
005190     MOVE 'N' TO RPXXX10-DISCAMT-OVRD-FLAG-DCHG.                  00519000
005200     MOVE RPREL-DISCAMT-OVRD TO RPXXX10-DISCAMT-OVRD.             00520000
005210     MOVE 'N' TO RPXXX10-DISCAMT-OVRD-DCHG.                       00521000
005220     MOVE 'N' TO RPXXX10-DISCPCT-ACTION-DCHG.                     00522000
005230     MOVE RPREL-DISCPCT-OVRD-FLAG TO RPXXX10-DISCPCT-OVRD-FLAG.   00523000
005240     MOVE 'N' TO RPXXX10-DISCPCT-OVRD-FLAG-DCHG.                  00524000
005250     MOVE RPREL-DISCPCT-OVRD TO RPXXX10-DISCPCT-OVRD.             00525000
005260     MOVE 'N' TO RPXXX10-DISCPCT-OVRD-DCHG.                       00526000
005270     MOVE 'N' TO RPXXX10-RATEPCT-ACTION-DCHG.                     00527000
005280     MOVE RPREL-RATEPCT-OVRD-FLAG TO RPXXX10-RATEPCT-OVRD-FLAG.   00528000
005290     MOVE 'N' TO RPXXX10-RATEPCT-OVRD-FLAG-DCHG.                  00529000
005300     MOVE RPREL-RATEPCT-OVRD TO RPXXX10-RATEPCT-OVRD.             00530000
005310     MOVE 'N' TO RPXXX10-RATEPCT-OVRD-DCHG.                       00531000
005320     MOVE RPSEC-ACCT2-GRP TO RPXXX10-SK-ACCT2.                    00532000
005330     MOVE 'Y' TO RPXXX10-SK-INST2-DCHG.                           00533000
005340     MOVE 'Y' TO RPXXX10-SK-PRODCODE2-DCHG.                       00534000
005350     MOVE 'Y' TO RPXXX10-SK-ACCOUNT2-DCHG.                        00535000
005360     GO TO VK-EXIT.                                               00536000
005370 VK-ERROR.                                                        00537000
005380     MOVE 'E' TO RPXXX10-RETURN.                                  00538000
005390 VK-RETURN.                                                       00539000
005400     GO TO CICS-RETURN.                                           00540000
005410 VK-EXIT.                                                         00541000
005420     EXIT.                                                        00542000
005430******************************************************************00543000
005440 ROUTING-ROUTINE SECTION.                                         00544000
005450 RR-START.                                                        00545000
005460     IF RPXXX10-APIFUNC IS EQUAL TO 'VKL'                         00546000
005470         GO TO RR-CHECK-2.                                        00547000
005480     MOVE SPACES TO WS-DISCAMT-OVRD-FLAG.                         00548000
005490     MOVE SPACES TO WS-DISCPCT-OVRD-FLAG.                         00549000
005500     MOVE SPACES TO WS-RATEPCT-OVRD-FLAG.                         00550000
005510     MOVE ZEROS TO WS-DISCAMT-OVRD.                               00551000
005520     MOVE ZEROS TO WS-DISCPCT-OVRD.                               00552000
005530     MOVE ZEROS TO WS-RATEPCT-OVRD.                               00553000
005540     MOVE SPACES TO WS-REL-SWITCH.                                00554000
005550     INITIALIZE RPREL-GRP-KEY.                                    00555000
005560     MOVE RPXXX10-SK-ACCT2 TO RPREL-ACCT1-GRP.                    00556000
005570     MOVE RPXXX10-SK-MODEL TO RPREL-MODEL.                        00557000
005580     IF RPXXX10-SK-PRODCODE2 IS EQUAL TO SPACES                   00558000
005590         AND RPXXX10-SK-ACCOUNT2 IS EQUAL TO SPACES               00559000
005600         MOVE RPXXX10-SK-ACCT1 TO RPREL-ACCT1-GRP                 00560000
005610     ELSE                                                         00561000
005620         MOVE RPXXX10-SK-INST TO RPREL-INST2                      00562000
005630         MOVE RPXXX10-SK-PRODCODE TO RPREL-PRODCODE2              00563000
005640         MOVE RPXXX10-SK-ACCOUNT TO RPREL-ACCOUNT2.               00564000
005650 RR-REL.                                                          00565000
005660     PERFORM RPS-REL-GET-REQUEST.                                 00566000
005670     IF WS-FUNCTION IS EQUAL TO 'N'                               00567000
005680         MOVE 500004 TO RPXXX10-MSGNBR                            00568000
005690         MOVE 'E' TO RPXXX10-SK-ACCOUNT-DCHG                      00569000
005700         MOVE 'EDT' TO RPXXX10-APIFUNC                            00570000
005710         GO TO RR-RETURN.                                         00571000
005720     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00572000
005730         MOVE WS-AB6330 TO RPXXX10-ABORT                          00573000
005740         MOVE WS-TR0008 TO RPXXX10-ABTRACE                        00574000
005750         GO TO CICS-ABORT-EXIT.                                   00575000
005760     MOVE RPREL-DISCAMT-OVRD-FLAG TO WS-DISCAMT-OVRD-FLAG.        00576000
005770     MOVE RPREL-DISCPCT-OVRD-FLAG TO WS-DISCPCT-OVRD-FLAG.        00577000
005780     MOVE RPREL-RATEPCT-OVRD-FLAG TO WS-RATEPCT-OVRD-FLAG.        00578000
005790     MOVE RPREL-DISCAMT-OVRD TO WS-DISCAMT-OVRD.                  00579000
005800     MOVE RPREL-DISCPCT-OVRD TO WS-DISCPCT-OVRD.                  00580000
005810     MOVE RPREL-RATEPCT-OVRD TO WS-RATEPCT-OVRD.                  00581000
005820     MOVE RPREL-SC-INC-OPTION TO RPXXX10-SC-OPTION.               00582000
005830     MOVE 'Y' TO RPXXX10-SC-OPTION-DCHG.                          00583000
005840     MOVE RPREL-RATE-INC-OPTION TO RPXXX10-RATE-OPTION.           00584000
005850     MOVE 'Y' TO RPXXX10-RATE-OPTION-DCHG.                        00585000
005860 RR-CONT.                                                         00586000
005870     PERFORM EDIT-MESSAGE.                                        00587000
005880     IF RPXXX10-APIFUNC IS NOT EQUAL TO 'UPD'                     00588000
005890         OR RPXXX10-UPDATE IS NOT EQUAL TO 'Y'                    00589000
005900         GO TO RR-CHECK-2.                                        00590000
005910     IF WS-UPDTSW IS EQUAL TO 'Y'                                 00591000
005920         PERFORM UPDATE-RECORDS.                                  00592000
005930 RR-CHECK.                                                        00593000
005940     MOVE 'N' TO WS-CHECK-FOR-NEXT.                               00594000
005950     PERFORM CHECK-FOR-MORE-RECORDS.                              00595000
005960     IF RPXXX10-END-FILE-INST IS EQUAL TO 'E'                     00596000
005970         AND RPXXX10-END-FILE-INST-DCHG IS EQUAL TO 'Y'           00597000
005980         GO TO RR-RETURN.                                         00598000
005990 RR-CHECK-2.                                                      00599000
006000     MOVE 'Y' TO WS-CHECK-FOR-NEXT.                               00600000
006010     PERFORM CHECK-FOR-MORE-RECORDS.                              00601000
006020 RR-RETURN.                                                       00602000
006030     GO TO CICS-RETURN.                                           00603000
006040 RR-EXIT.                                                         00604000
006050     EXIT.                                                        00605000
006060******************************************************************00606000
006070 EDIT-MESSAGE SECTION.                                            00607000
006080 EM-START.                                                        00608000
006090     IF RPXXX10-DISCAMT-ACTION-DCHG IS NOT EQUAL TO 'Y'           00609000
006100         GO TO EM-DISCPCT-ACTION.                                 00610000
006110     IF RPXXX10-DISCAMT-ACTION IS EQUAL TO LOW-VALUES             00611000
006120         OR RPXXX10-DISCAMT-ACTION IS EQUAL TO SPACES             00612000
006130         GO TO EM-DISCPCT-ACTION.                                 00613000
006140     IF RPXXX10-DISCAMT-ACTION IS NOT EQUAL TO 'R'                00614000
006150         AND RPXXX10-DISCAMT-ACTION IS NOT EQUAL TO 'A'           00615000
006160         MOVE 'Y' TO WS-ERROR                                     00616000
006170         MOVE 'E' TO RPXXX10-DISCAMT-ACTION-DCHG                  00617000
006180         ADD +0001 TO RPXXX10-ERRCNT                              00618000
006190         IF RPXXX10-MSGNBR IS NOT GREATER THAN ZEROS              00619000
006200             MOVE 500077 TO RPXXX10-MSGNBR                        00620000
006210         END-IF                                                   00621000
006220         GO TO EM-DISCPCT-ACTION                                  00622000
006230     END-IF.                                                      00623000
006240     IF (RPXXX10-DISCAMT-ACTION IS EQUAL TO 'R'                   00624000
006250         OR RPXXX10-DISCAMT-ACTION IS EQUAL TO 'A')               00625000
006260         AND RPREL-SC-INC-OPTION IS EQUAL TO 'N'                  00626000
006270         MOVE 'Y' TO WS-ERROR                                     00627000
006280         MOVE 'E' TO RPXXX10-DISCAMT-ACTION-DCHG                  00628000
006290         ADD +0001 TO RPXXX10-ERRCNT                              00629000
006300         IF RPXXX10-MSGNBR IS NOT GREATER THAN ZEROS              00630000
006310             MOVE 500077 TO RPXXX10-MSGNBR                        00631000
006320         END-IF                                                   00632000
006330         GO TO EM-DISCPCT-ACTION                                  00633000
006340     END-IF.                                                      00634000
006350     IF RPXXX10-DISCAMT-ACTION IS EQUAL TO 'R'                    00635000
006360         AND WS-DISCAMT-OVRD-FLAG IS EQUAL TO 'N'                 00636000
006370         GO TO EM-DISCPCT-ACTION.                                 00637000
006380     MOVE 'Y' TO WS-UPDTSW.                                       00638000
006390     IF RPXXX10-DISCAMT-ACTION IS EQUAL TO 'R'                    00639000
006400         GO TO EM-DISCPCT-ACTION.                                 00640000
006410 EM-DISCAMT.                                                      00641000
006420     IF RPXXX10-DISCAMT-OVRD-DCHG IS NOT EQUAL TO 'Y'             00642000
006430         AND RPXXX10-DISCAMT-OVRD-DCHG IS NOT EQUAL TO 'E'        00643000
006440         GO TO EM-DISCPCT-ACTION.                                 00644000
006450     IF RPXXX10-DISCAMT-OVRD IS NOT NUMERIC                       00645000
006460         MOVE 'Y' TO WS-ERROR                                     00646000
006470         MOVE 'E' TO RPXXX10-DISCAMT-OVRD-DCHG                    00647000
006480         ADD +0001 TO RPXXX10-ERRCNT                              00648000
006490         IF RPXXX10-MSGNBR IS NOT GREATER THAN ZEROS              00649000
006500             MOVE 500078 TO RPXXX10-MSGNBR                        00650000
006510         END-IF                                                   00651000
006520         GO TO EM-DISCPCT-ACTION                                  00652000
006530     END-IF.                                                      00653000
006540     IF RPXXX10-DISCAMT-OVRD-DCHG IS EQUAL TO 'E'                 00654000
006550         ADD +1 TO RPXXX10-ERRCNT                                 00655000
006560         MOVE 'Y' TO WS-ERROR                                     00656000
006570         GO TO EM-DISCPCT-ACTION.                                 00657000
006580     IF RPXXX10-DISCAMT-OVRD IS EQUAL TO WS-DISCAMT-OVRD          00658000
006590         GO TO EM-DISCPCT-ACTION.                                 00659000
006600     MOVE 'Y' TO WS-UPDTSW.                                       00660000
006610 EM-DISCPCT-ACTION.                                               00661000
006620     IF RPXXX10-DISCPCT-ACTION-DCHG IS NOT EQUAL TO 'Y'           00662000
006630         GO TO EM-RATEPCT-ACTION.                                 00663000
006640     IF RPXXX10-DISCPCT-ACTION IS EQUAL TO LOW-VALUES             00664000
006650         OR RPXXX10-DISCPCT-ACTION IS EQUAL TO SPACES             00665000
006660         GO TO EM-RATEPCT-ACTION.                                 00666000
006670     IF RPXXX10-DISCPCT-ACTION IS NOT EQUAL TO 'R'                00667000
006680         AND RPXXX10-DISCPCT-ACTION IS NOT EQUAL TO 'A'           00668000
006690         MOVE 'Y' TO WS-ERROR                                     00669000
006700         MOVE 'E' TO RPXXX10-DISCPCT-ACTION-DCHG                  00670000
006710         ADD +0001 TO RPXXX10-ERRCNT                              00671000
006720         IF RPXXX10-MSGNBR IS NOT GREATER THAN ZEROS              00672000
006730             MOVE 500077 TO RPXXX10-MSGNBR                        00673000
006740         END-IF                                                   00674000
006750         GO TO EM-RATEPCT-ACTION                                  00675000
006760     END-IF.                                                      00676000
006770     IF (RPXXX10-DISCPCT-ACTION IS EQUAL TO 'R'                   00677000
006780         OR RPXXX10-DISCPCT-ACTION IS EQUAL TO 'A')               00678000
006790         AND RPREL-SC-INC-OPTION IS EQUAL TO 'N'                  00679000
006800         MOVE 'Y' TO WS-ERROR                                     00680000
006810         MOVE 'E' TO RPXXX10-DISCPCT-ACTION-DCHG                  00681000
006820         ADD +0001 TO RPXXX10-ERRCNT                              00682000
006830         IF RPXXX10-MSGNBR IS NOT GREATER THAN ZEROS              00683000
006840             MOVE 500077 TO RPXXX10-MSGNBR                        00684000
006850         END-IF                                                   00685000
006860         GO TO EM-RATEPCT-ACTION                                  00686000
006870     END-IF.                                                      00687000
006880     IF RPXXX10-DISCPCT-ACTION IS EQUAL TO 'R'                    00688000
006890         AND WS-DISCPCT-OVRD-FLAG IS EQUAL TO 'N'                 00689000
006900         GO TO EM-RATEPCT-ACTION.                                 00690000
006910     MOVE 'Y' TO WS-UPDTSW.                                       00691000
006920     IF RPXXX10-DISCPCT-ACTION IS EQUAL TO 'R'                    00692000
006930         GO TO EM-RATEPCT-ACTION.                                 00693000
006940 EM-DISCPCT.                                                      00694000
006950     IF RPXXX10-DISCPCT-OVRD-DCHG IS NOT EQUAL TO 'Y'             00695000
006960         AND RPXXX10-DISCPCT-OVRD-DCHG IS NOT EQUAL TO 'E'        00696000
006970         GO TO EM-RATEPCT-ACTION.                                 00697000
006980     IF RPXXX10-DISCPCT-OVRD IS NOT NUMERIC                       00698000
006990         MOVE 'Y' TO WS-ERROR                                     00699000
007000         MOVE 'E' TO RPXXX10-DISCPCT-OVRD-DCHG                    00700000
007010         ADD +0001 TO RPXXX10-ERRCNT                              00701000
007020         IF RPXXX10-MSGNBR IS NOT GREATER THAN ZEROS              00702000
007030             MOVE 500079 TO RPXXX10-MSGNBR                        00703000
007040         END-IF                                                   00704000
007050         GO TO EM-RATEPCT-ACTION                                  00705000
007060     END-IF.                                                      00706000
007070     IF RPXXX10-DISCPCT-OVRD-DCHG IS EQUAL TO 'E'                 00707000
007080         ADD +1 TO RPXXX10-ERRCNT                                 00708000
007090         MOVE 'Y' TO WS-ERROR                                     00709000
007100         GO TO EM-RATEPCT-ACTION.                                 00710000
007110     IF RPXXX10-DISCPCT-OVRD IS EQUAL TO WS-DISCPCT-OVRD          00711000
007120         GO TO EM-RATEPCT-ACTION.                                 00712000
007130     MOVE 'Y' TO WS-UPDTSW.                                       00713000
007140 EM-RATEPCT-ACTION.                                               00714000
007150     IF RPXXX10-RATEPCT-ACTION-DCHG IS NOT EQUAL TO 'Y'           00715000
007160         GO TO EM-END.                                            00716000
007170     IF RPXXX10-RATEPCT-ACTION IS EQUAL TO LOW-VALUES             00717000
007180         OR RPXXX10-RATEPCT-ACTION IS EQUAL TO SPACES             00718000
007190         GO TO EM-END.                                            00719000
007200     IF RPXXX10-RATEPCT-ACTION IS NOT EQUAL TO 'R'                00720000
007210         AND RPXXX10-RATEPCT-ACTION IS NOT EQUAL TO 'A'           00721000
007220         MOVE 'Y' TO WS-ERROR                                     00722000
007230         MOVE 'E' TO RPXXX10-RATEPCT-ACTION-DCHG                  00723000
007240         ADD +0001 TO RPXXX10-ERRCNT                              00724000
007250         IF RPXXX10-MSGNBR IS NOT GREATER THAN ZEROS              00725000
007260             MOVE 500077 TO RPXXX10-MSGNBR                        00726000
007270         END-IF                                                   00727000
007280         GO TO EM-END                                             00728000
007290     END-IF.                                                      00729000
007300     IF (RPXXX10-RATEPCT-ACTION IS EQUAL TO 'R'                   00730000
007310         OR RPXXX10-RATEPCT-ACTION IS EQUAL TO 'A')               00731000
007320         AND RPREL-RATE-INC-OPTION IS EQUAL TO 'N'                00732000
007330         MOVE 'Y' TO WS-ERROR                                     00733000
007340         MOVE 'E' TO RPXXX10-RATEPCT-ACTION-DCHG                  00734000
007350         ADD +0001 TO RPXXX10-ERRCNT                              00735000
007360         IF RPXXX10-MSGNBR IS NOT GREATER THAN ZEROS              00736000
007370             MOVE 500077 TO RPXXX10-MSGNBR                        00737000
007380         END-IF                                                   00738000
007390         GO TO EM-END                                             00739000
007400     END-IF.                                                      00740000
007410     IF RPXXX10-RATEPCT-ACTION IS EQUAL TO 'R'                    00741000
007420         AND WS-RATEPCT-OVRD-FLAG IS EQUAL TO 'N'                 00742000
007430         GO TO EM-END.                                            00743000
007440     MOVE 'Y' TO WS-UPDTSW.                                       00744000
007450     IF RPXXX10-RATEPCT-ACTION IS EQUAL TO 'R'                    00745000
007460         GO TO EM-END.                                            00746000
007470 EM-RATEPCT.                                                      00747000
007480     IF RPXXX10-RATEPCT-OVRD-DCHG IS NOT EQUAL TO 'Y'             00748000
007490         AND RPXXX10-RATEPCT-OVRD-DCHG IS NOT EQUAL TO 'E'        00749000
007500         GO TO EM-END.                                            00750000
007510     IF RPXXX10-RATEPCT-OVRD IS NOT NUMERIC                       00751000
007520         MOVE 'Y' TO WS-ERROR                                     00752000
007530         MOVE 'E' TO RPXXX10-RATEPCT-OVRD-DCHG                    00753000
007540         ADD +0001 TO RPXXX10-ERRCNT                              00754000
007550         IF RPXXX10-MSGNBR IS NOT GREATER THAN ZEROS              00755000
007560             MOVE 500080 TO RPXXX10-MSGNBR                        00756000
007570         END-IF                                                   00757000
007580         GO TO EM-END                                             00758000
007590     END-IF.                                                      00759000
007600     IF RPXXX10-RATEPCT-OVRD-DCHG IS EQUAL TO 'E'                 00760000
007610         ADD +1 TO RPXXX10-ERRCNT                                 00761000
007620         MOVE 'Y' TO WS-ERROR                                     00762000
007630         GO TO EM-END.                                            00763000
007640     IF RPXXX10-RATEPCT-OVRD IS EQUAL TO WS-RATEPCT-OVRD          00764000
007650         GO TO EM-END.                                            00765000
007660     MOVE 'Y' TO WS-UPDTSW.                                       00766000
007670 EM-END.                                                          00767000
007680     IF RPXXX10-UPDATE IS NOT EQUAL TO 'Y'                        00768000
007690         GO TO EM-EXIT.                                           00769000
007700     IF WS-ERROR IS EQUAL TO 'Y'                                  00770000
007710         AND RPXXX10-MSGNBR IS EQUAL TO ZEROS                     00771000
007720         MOVE 500035 TO RPXXX10-MSGNBR.                           00772000
007730     IF RPXXX10-APIFUNC IS EQUAL TO 'EDT'                         00773000
007740         OR WS-ERROR IS EQUAL TO 'Y'                              00774000
007750         MOVE 'EDT' TO RPXXX10-APIFUNC.                           00775000
007760 EM-EXIT.                                                         00776000
007770     EXIT.                                                        00777000
007780******************************************************************00778000
007790 UPDATE-RECORDS SECTION.                                          00779000
007800 UR-START.                                                        00780000
007810     INITIALIZE RPREL-RECORD.                                     00781000
007820     MOVE RPXXX10-SK-ACCT2 TO RPREL-ACCT1-GRP.                    00782000
007830     MOVE RPXXX10-SK-MODEL TO RPREL-MODEL.                        00783000
007840     IF RPXXX10-SK-PRODCODE2 IS EQUAL TO SPACES                   00784000
007850         AND RPXXX10-SK-ACCOUNT2 IS EQUAL TO SPACES               00785000
007860         MOVE RPXXX10-SK-ACCT1 TO RPREL-ACCT1-GRP                 00786000
007870     ELSE                                                         00787000
007880         MOVE RPXXX10-SK-INST TO RPREL-INST2                      00788000
007890         MOVE RPXXX10-SK-PRODCODE TO RPREL-PRODCODE2              00789000
007900         MOVE RPXXX10-SK-ACCOUNT TO RPREL-ACCOUNT2.               00790000
007910     PERFORM RPS-REL-GET-LOCK-REQUEST.                            00791000
007920     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00792000
007930         MOVE WS-AB6330 TO RPXXX10-ABORT                          00793000
007940         MOVE WS-TR0009 TO RPXXX10-ABTRACE                        00794000
007950         GO TO CICS-ABORT-EXIT.                                   00795000
007960     IF RPXXX10-DISCAMT-ACTION-DCHG IS EQUAL TO 'Y'               00796000
007970         AND RPXXX10-DISCAMT-ACTION IS EQUAL TO 'R'               00797000
007980         MOVE ZEROS TO RPREL-DISCAMT-OVRD                         00798000
007990         MOVE 'N' TO RPREL-DISCAMT-OVRD-FLAG.                     00799000
008000     IF RPXXX10-DISCAMT-ACTION-DCHG IS EQUAL TO 'Y'               00800000
008010         AND RPXXX10-DISCAMT-ACTION IS EQUAL TO 'A'               00801000
008020         MOVE RPXXX10-DISCAMT-OVRD TO RPREL-DISCAMT-OVRD          00802000
008030         MOVE 'Y' TO RPREL-DISCAMT-OVRD-FLAG.                     00803000
008040     IF RPXXX10-DISCPCT-ACTION-DCHG IS EQUAL TO 'Y'               00804000
008050         AND RPXXX10-DISCPCT-ACTION IS EQUAL TO 'R'               00805000
008060         MOVE ZEROS TO RPREL-DISCPCT-OVRD                         00806000
008070         MOVE 'N' TO RPREL-DISCPCT-OVRD-FLAG.                     00807000
008080     IF RPXXX10-DISCPCT-ACTION-DCHG IS EQUAL TO 'Y'               00808000
008090         AND RPXXX10-DISCPCT-ACTION IS EQUAL TO 'A'               00809000
008100         MOVE RPXXX10-DISCPCT-OVRD TO RPREL-DISCPCT-OVRD          00810000
008110         MOVE 'Y' TO RPREL-DISCPCT-OVRD-FLAG.                     00811000
008120     IF RPXXX10-RATEPCT-ACTION-DCHG IS EQUAL TO 'Y'               00812000
008130         AND RPXXX10-RATEPCT-ACTION IS EQUAL TO 'R'               00813000
008140         MOVE ZEROS TO RPREL-RATEPCT-OVRD                         00814000
008150         MOVE 'N' TO RPREL-RATEPCT-OVRD-FLAG.                     00815000
008160     IF RPXXX10-RATEPCT-ACTION-DCHG IS EQUAL TO 'Y'               00816000
008170         AND RPXXX10-RATEPCT-ACTION IS EQUAL TO 'A'               00817000
008180         MOVE RPXXX10-RATEPCT-OVRD TO RPREL-RATEPCT-OVRD          00818000
008190         MOVE 'Y' TO RPREL-RATEPCT-OVRD-FLAG.                     00819000
008200     PERFORM RPS-REL-REPUT-REQUEST.                               00820000
008210     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00821000
008220         MOVE WS-AB6330 TO RPXXX10-ABORT                          00822000
008230         MOVE WS-TR0012 TO RPXXX10-ABTRACE                        00823000
008240         GO TO CICS-ABORT-EXIT.                                   00824000
008250     MOVE RPREL-ACCT1-GRP TO RPMST-GRP-KEY.                       00825000
008260     PERFORM RPS-MST-GET-LOCK-REQUEST.                            00826000
008270     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00827000
008280         MOVE WS-AB6320 TO RPXXX10-ABORT                          00828000
008290         MOVE WS-TR0013 TO RPXXX10-ABTRACE                        00829000
008300         GO TO CICS-ABORT-EXIT.                                   00830000
008310     MOVE WS-CURDT-YYYYMMDD TO RPMST-LMNTDT.                      00831000
008320     PERFORM RPS-MST-REPUT-REQUEST.                               00832000
008330     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00833000
008340         MOVE WS-AB6320 TO RPXXX10-ABORT                          00834000
008350         MOVE WS-TR0014 TO RPXXX10-ABTRACE                        00835000
008360         GO TO CICS-ABORT-EXIT.                                   00836000
008370     MOVE 'Y' TO WS-UPDATESW.                                     00837000
008380 UR-EXIT.                                                         00838000
008390     EXIT.                                                        00839000
008400******************************************************************00840000
008410 CHECK-FOR-MORE-RECORDS SECTION.                                  00841000
008420 CRMR-START.                                                      00842000
008430     INITIALIZE RPSEC-GRP-KEY.                                    00843000
008440*    MOVE RPXXX10-SELECTKEY TO RPSEC-GRP-KEY.                     00844000
008450* FORMAT OF RPXXX10-SELECTKEY AND RPSEC-GRP-KEY ARE DIFFERENT     00845000
008460     MOVE RPXXX10-SK-INST TO RPSEC-INST.                          00846000
008470     MOVE RPXXX10-SK-PRODCODE TO RPSEC-PRODCODE.                  00847000
008480     MOVE RPXXX10-SK-ACCOUNT TO RPSEC-ACCOUNT.                    00848000
008490     MOVE RPXXX10-SK-INST2 TO RPSEC-INST2.                        00849000
008500     MOVE RPXXX10-SK-PRODCODE2 TO RPSEC-PRODCODE2.                00850000
008510     MOVE RPXXX10-SK-ACCOUNT2 TO RPSEC-ACCOUNT2.                  00851000
008520     MOVE RPXXX10-SK-MODEL TO RPSEC-MODEL2.                       00852000
008530*                                                                 00853000
008540     PERFORM RPS-SEC-GET-GE-REQUEST.                              00854000
008550     IF WS-FUNCTION IS EQUAL TO 'E'                               00855000
008560         MOVE 'E' TO RPXXX10-END-FILE-INST                        00856000
008570         MOVE 'Y' TO RPXXX10-END-FILE-INST-DCHG                   00857000
008580         GO TO CRMR-INITIALIZE.                                   00858000
008590     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00859000
008600         MOVE WS-AB6335 TO RPXXX10-ABORT                          00860000
008610         MOVE WS-TR0021 TO RPXXX10-ABTRACE                        00861000
008620         GO TO CICS-ABORT-EXIT.                                   00862000
008630     MOVE RPXXX10-SK-INST TO WSXXX10-SK-INST.                     00863000
008640     MOVE RPXXX10-SK-PRODCODE TO WSXXX10-SK-PRODCODE.             00864000
008650     MOVE RPXXX10-SK-ACCOUNT TO WSXXX10-SK-ACCOUNT.               00865000
008660     IF RPSEC-ACCT1-GRP IS NOT EQUAL TO WSXXX10-SK-ACCT1          00866000
008670         MOVE 'E' TO RPXXX10-END-FILE-INST                        00867000
008680         MOVE 'Y' TO RPXXX10-END-FILE-INST-DCHG                   00868000
008690         GO TO CRMR-INITIALIZE.                                   00869000
008700* ** CHECK FOR SAME MODEL                                         00870000
008710     IF RPSEC-MODEL2 IS NOT EQUAL TO RPXXX10-SK-MODEL             00871000
008720         MOVE 'E' TO RPXXX10-END-FILE-INST                        00872000
008730         MOVE 'Y' TO RPXXX10-END-FILE-INST-DCHG                   00873000
008740         GO TO CRMR-INITIALIZE.                                   00874000
008750 CRMR-NEXT.                                                       00875000
008760     PERFORM RPS-SEC-GET-NEXT-REQUEST.                            00876000
008770     IF WS-FUNCTION IS EQUAL TO 'E'                               00877000
008780         MOVE 'E' TO RPXXX10-END-FILE-INST                        00878000
008790         MOVE 'Y' TO RPXXX10-END-FILE-INST-DCHG                   00879000
008800         GO TO CRMR-INITIALIZE.                                   00880000
008810     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00881000
008820         MOVE WS-AB6335 TO RPXXX10-ABORT                          00882000
008830         MOVE WS-TR0022 TO RPXXX10-ABTRACE                        00883000
008840         GO TO CICS-ABORT-EXIT.                                   00884000
008850     MOVE RPXXX10-SK-INST TO WSXXX10-SK-INST.                     00885000
008860     MOVE RPXXX10-SK-PRODCODE TO WSXXX10-SK-PRODCODE.             00886000
008870     MOVE RPXXX10-SK-ACCOUNT TO WSXXX10-SK-ACCOUNT.               00887000
008880     IF RPSEC-ACCT1-GRP IS NOT EQUAL TO WSXXX10-SK-ACCT1          00888000
008890         MOVE 'E' TO RPXXX10-END-FILE-INST                        00889000
008900         MOVE 'Y' TO RPXXX10-END-FILE-INST-DCHG                   00890000
008910         GO TO CRMR-INITIALIZE.                                   00891000
008920* ** CHECK FOR SAME MODEL                                         00892000
008930     IF RPSEC-MODEL2 IS NOT EQUAL TO RPXXX10-SK-MODEL             00893000
008940         MOVE 'E' TO RPXXX10-END-FILE-INST                        00894000
008950         MOVE 'Y' TO RPXXX10-END-FILE-INST-DCHG                   00895000
008960         GO TO CRMR-INITIALIZE.                                   00896000
008970 CRMR-MST.                                                        00897000
008980     INITIALIZE RPMST-GRP-KEY.                                    00898000
008990     MOVE RPSEC-INST2 TO RPMST-INST.                              00899000
009000     MOVE RPSEC-PRODCODE2 TO RPMST-PRODCODE.                      00900000
009010     MOVE RPSEC-ACCOUNT2 TO RPMST-ACCOUNT.                        00901000
009020     MOVE RPSEC-MODEL2 TO RPMST-MODEL.                            00902000
009030     IF RPSEC-PRODCODE2 IS EQUAL TO SPACES                        00903000
009040         AND RPSEC-ACCOUNT2 IS EQUAL TO SPACES                    00904000
009050         MOVE RPSEC-ACCT1-GRP TO RPMST-GRP-KEY                    00905000
009060         MOVE RPSEC-MODEL2 TO RPMST-MODEL.                        00906000
009070* **                                                              00907000
009080     PERFORM RPS-MST-GET-REQUEST.                                 00908000
009090     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00909000
009100         MOVE WS-AB6320 TO RPXXX10-ABORT                          00910000
009110         MOVE WS-TR0023 TO RPXXX10-ABTRACE                        00911000
009120         GO TO CICS-ABORT-EXIT.                                   00912000
009130     IF RPMST-REL-STAT IS NOT EQUAL TO 'A'                        00913000
009140         GO TO CRMR-NEXT.                                         00914000
009150 CRMR-REL.                                                        00915000
009160     INITIALIZE RPREL-GRP-KEY.                                    00916000
009170     MOVE RPSEC-ACCT2-GRP TO RPREL-ACCT1-GRP.                     00917000
009180     MOVE RPSEC-MODEL2 TO RPREL-MODEL.                            00918000
009190     IF RPSEC-PRODCODE2 IS EQUAL TO SPACES                        00919000
009200         AND RPSEC-ACCOUNT2 IS EQUAL TO SPACES                    00920000
009210         MOVE RPSEC-ACCT1-GRP TO RPREL-ACCT1-GRP                  00921000
009220         MOVE RPSEC-MODEL2 TO RPREL-MODEL                         00922000
009230     ELSE                                                         00923000
009240         MOVE RPSEC-INST TO RPREL-INST2                           00924000
009250         MOVE RPSEC-PRODCODE TO RPREL-PRODCODE2                   00925000
009260         MOVE RPSEC-ACCOUNT TO RPREL-ACCOUNT2.                    00926000
009270     PERFORM RPS-REL-GET-REQUEST.                                 00927000
009280     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00928000
009290         MOVE WS-AB6330 TO RPXXX10-ABORT                          00929000
009300         MOVE WS-TR0024 TO RPXXX10-ABTRACE                        00930000
009310         GO TO CICS-ABORT-EXIT.                                   00931000
009320     IF RPREL-SC-INC-OPTION IS EQUAL TO 'N'                       00932000
009330         AND RPREL-RATE-INC-OPTION IS EQUAL TO 'N'                00933000
009340         GO TO CRMR-NEXT.                                         00934000
009350 CRMR-7101.                                                       00935000
009360     MOVE SPACES TO MI7101-RECORD.                                00936000
009370     MOVE RPMST-INST TO MIM-7101KINST.                            00937000
009380     MOVE +7101 TO MIM-7101KREC.                                  00938000
009390     MOVE RPREL-MODEL TO MIM-7101KMODEL.                          00939000
009400     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        00940000
009410     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00941000
009420     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00942000
009430     MOVE MI7101-RECORD TO MIMST-RECORD.                          00943000
009440     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00944000
009450     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00945000
009460         MOVE 500006 TO RPXXX10-MSGNBR                            00946000
009470         MOVE 'E' TO RPXXX10-RETURN                               00947000
009480         GO TO CICS-RETURN.                                       00948000
009490     MOVE MIMST-RECORD TO MI7101-RECORD.                          00949000
009500     IF MIM-7101KINST IS NOT EQUAL TO RPMST-INST                  00950000
009510         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00951000
009520         OR MIM-7101KMODEL IS NOT EQUAL TO RPREL-MODEL            00952000
009530         MOVE 500006 TO RPXXX10-MSGNBR                            00953000
009540         MOVE 'E' TO RPXXX10-RETURN                               00954000
009550         GO TO CICS-RETURN.                                       00955000
009560     IF MIM-7101ACCTINCENOVRD IS EQUAL TO 'N'                     00956000
009570         GO TO CRMR-NEXT.                                         00957000
009580     IF WS-CHECK-FOR-NEXT IS EQUAL TO 'Y'                         00958000
009590         GO TO CRMR-EXIT.                                         00959000
009600     MOVE MIM-7101DESC TO RPXXX10-MODEL-DESC.                     00960000
009610     MOVE 'Y' TO RPXXX10-MODEL-DESC-DCHG.                         00961000
009620 CRMR-ACT.                                                        00962000
009630     INITIALIZE RPACT-RECORD.                                     00963000
009640     MOVE RPXXX10-SK-ACCT1 TO RPACT-GRP-KEY.                      00964000
009650     PERFORM RPS-ACT-GET-REQUEST.                                 00965000
009660     IF WS-FUNCTION IS EQUAL TO 'N'                               00966000
009670         MOVE 500075 TO RPXXX10-MSGNBR                            00967000
009680         MOVE 'E' TO RPXXX10-SK-ACCOUNT-DCHG                      00968000
009690         MOVE 'E' TO RPXXX10-RETURN                               00969000
009700         GO TO CICS-RETURN.                                       00970000
009710     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00971000
009720         MOVE WS-AB6300 TO RPXXX10-ABORT                          00972000
009730         MOVE WS-TR0025 TO RPXXX10-ABTRACE                        00973000
009740         GO TO CICS-ABORT-EXIT.                                   00974000
009750     MOVE RPACT-DISCOUNT-AMOUNT TO RPXXX10-DISCOUNT-AMOUNT.       00975000
009760     MOVE 'Y' TO RPXXX10-DISCOUNT-AMOUNT-DCHG.                    00976000
009770     MOVE RPACT-DISCOUNT-PERCENT TO RPXXX10-DISCOUNT-PERCENT.     00977000
009780     MOVE 'Y' TO RPXXX10-DISCOUNT-PERCENT-DCHG.                   00978000
009790     MOVE RPACT-RATE-PERCENT TO RPXXX10-RATE-PERCENT.             00979000
009800     MOVE 'Y' TO RPXXX10-RATE-PERCENT-DCHG.                       00980000
009810     MOVE RPREL-SC-INC-OPTION TO RPXXX10-SC-OPTION.               00981000
009820     MOVE 'Y' TO RPXXX10-SC-OPTION-DCHG.                          00982000
009830     MOVE RPREL-RATE-INC-OPTION TO RPXXX10-RATE-OPTION.           00983000
009840     MOVE 'Y' TO RPXXX10-RATE-OPTION-DCHG.                        00984000
009850     MOVE 'N' TO RPXXX10-DISCAMT-ACTION-DCHG.                     00985000
009860     MOVE RPREL-DISCAMT-OVRD-FLAG TO RPXXX10-DISCAMT-OVRD-FLAG.   00986000
009870     MOVE 'N' TO RPXXX10-DISCAMT-OVRD-FLAG-DCHG.                  00987000
009880     MOVE RPREL-DISCAMT-OVRD TO RPXXX10-DISCAMT-OVRD.             00988000
009890     MOVE 'N' TO RPXXX10-DISCAMT-OVRD-DCHG.                       00989000
009900     MOVE 'N' TO RPXXX10-DISCPCT-ACTION-DCHG.                     00990000
009910     MOVE RPREL-DISCPCT-OVRD-FLAG TO RPXXX10-DISCPCT-OVRD-FLAG.   00991000
009920     MOVE 'N' TO RPXXX10-DISCPCT-OVRD-FLAG-DCHG.                  00992000
009930     MOVE RPREL-DISCPCT-OVRD TO RPXXX10-DISCPCT-OVRD.             00993000
009940     MOVE 'N' TO RPXXX10-DISCPCT-OVRD-DCHG.                       00994000
009950     MOVE 'N' TO RPXXX10-RATEPCT-ACTION-DCHG.                     00995000
009960     MOVE RPREL-RATEPCT-OVRD-FLAG TO RPXXX10-RATEPCT-OVRD-FLAG.   00996000
009970     MOVE 'N' TO RPXXX10-RATEPCT-OVRD-FLAG-DCHG.                  00997000
009980     MOVE RPREL-RATEPCT-OVRD TO RPXXX10-RATEPCT-OVRD.             00998000
009990     MOVE 'N' TO RPXXX10-RATEPCT-OVRD-DCHG.                       00999000
010000     MOVE RPSEC-ACCT2-GRP TO RPXXX10-SK-ACCT2.                    01000000
010010     MOVE 'Y' TO RPXXX10-SK-INST2-DCHG.                           01001000
010020     MOVE 'Y' TO RPXXX10-SK-PRODCODE2-DCHG.                       01002000
010030     MOVE 'Y' TO RPXXX10-SK-ACCOUNT2-DCHG.                        01003000
010040     GO TO CRMR-EXIT.                                             01004000
010050 CRMR-INITIALIZE.                                                 01005000
010060     IF WS-CHECK-FOR-NEXT IS EQUAL TO 'Y'                         01006000
010070         GO TO CRMR-EXIT.                                         01007000
010080     MOVE SPACES TO RPXXX10-MODEL-DESC.                           01008000
010090     MOVE 'N' TO RPXXX10-MODEL-DESC-DCHG.                         01009000
010100     MOVE ZEROS TO RPXXX10-DISCOUNT-AMOUNT.                       01010000
010110     MOVE 'N' TO RPXXX10-DISCOUNT-AMOUNT-DCHG.                    01011000
010120     MOVE ZEROS TO RPXXX10-DISCOUNT-PERCENT.                      01012000
010130     MOVE 'N' TO RPXXX10-DISCOUNT-PERCENT-DCHG.                   01013000
010140     MOVE ZEROS TO RPXXX10-RATE-PERCENT.                          01014000
010150     MOVE 'N' TO RPXXX10-RATE-PERCENT-DCHG.                       01015000
010160     MOVE SPACE TO RPXXX10-SC-OPTION.                             01016000
010170     MOVE 'N' TO RPXXX10-SC-OPTION-DCHG.                          01017000
010180     MOVE SPACE TO RPXXX10-RATE-OPTION.                           01018000
010190     MOVE 'N' TO RPXXX10-RATE-OPTION-DCHG.                        01019000
010200     MOVE 'N' TO RPXXX10-DISCAMT-ACTION-DCHG.                     01020000
010210     MOVE 'N' TO RPXXX10-DISCAMT-OVRD-FLAG.                       01021000
010220     MOVE 'N' TO RPXXX10-DISCAMT-OVRD-FLAG-DCHG.                  01022000
010230     MOVE ZEROS TO RPXXX10-DISCAMT-OVRD.                          01023000
010240     MOVE 'N' TO RPXXX10-DISCAMT-OVRD-DCHG.                       01024000
010250     MOVE 'N' TO RPXXX10-DISCPCT-ACTION-DCHG.                     01025000
010260     MOVE 'N' TO RPXXX10-DISCPCT-OVRD-FLAG.                       01026000
010270     MOVE 'N' TO RPXXX10-DISCPCT-OVRD-FLAG-DCHG.                  01027000
010280     MOVE ZEROS TO RPXXX10-DISCPCT-OVRD.                          01028000
010290     MOVE 'N' TO RPXXX10-DISCPCT-OVRD-DCHG.                       01029000
010300     MOVE 'N' TO RPXXX10-RATEPCT-ACTION-DCHG.                     01030000
010310     MOVE 'N' TO RPXXX10-RATEPCT-OVRD-FLAG.                       01031000
010320     MOVE 'N' TO RPXXX10-RATEPCT-OVRD-FLAG-DCHG.                  01032000
010330     MOVE ZEROS TO RPXXX10-RATEPCT-OVRD.                          01033000
010340     MOVE 'N' TO RPXXX10-RATEPCT-OVRD-DCHG.                       01034000
010350     MOVE RPSEC-ACCT2-GRP TO RPXXX10-SK-ACCT2.                    01035000
010360     MOVE ZEROS TO RPXXX10-SK-INST2.                              01036000
010370     MOVE SPACES TO RPXXX10-SK-PRODCODE2.                         01037000
010380     MOVE SPACES TO RPXXX10-SK-ACCOUNT2.                          01038000
010390     MOVE 'N' TO RPXXX10-SK-INST2-DCHG.                           01039000
010400     MOVE 'N' TO RPXXX10-SK-PRODCODE2-DCHG.                       01040000
010410     MOVE 'N' TO RPXXX10-SK-ACCOUNT2-DCHG.                        01041000
010420 CRMR-EXIT.                                                       01042000
010430     EXIT.                                                        01043000
010440******************************************************************01044000
010450 FIND-DEFAULT-MODEL SECTION.                                      01045000
010460 FDM-START.                                                       01046000
010470     MOVE 'N' TO WS-ERRORMODEL.                                   01047000
010480     MOVE RPXXX10-SK-INST TO RPSEC-INST.                          01048000
010490     MOVE RPXXX10-SK-PRODCODE TO RPSEC-PRODCODE.                  01049000
010500     MOVE RPXXX10-SK-ACCOUNT TO RPSEC-ACCOUNT.                    01050000
010510     IF RPXXX10-SK-MODEL IS EQUAL TO LOW-VALUE                    01051000
010520         MOVE SPACES TO RPXXX10-SK-MODEL.                         01052000
010530     MOVE RPXXX10-SK-MODEL TO RPSEC-MODEL2.                       01053000
010540     PERFORM RPS-SEC-GET-GE-REQUEST.                              01054000
010550     IF WS-FUNCTION IS EQUAL TO 'N'                               01055000
010560         OR WS-FUNCTION IS EQUAL TO 'E'                           01056000
010570         GO TO FDM-RECORD-NOT-FOUND.                              01057000
010580     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01058000
010590         MOVE WS-AB6320 TO RPXXX10-ABORT                          01059000
010600         MOVE WS-TR0054 TO RPXXX10-ABTRACE                        01060000
010610         MOVE 'Y' TO WS-ERRORMODEL                                01061000
010620         GO TO FDM-EXIT.                                          01062000
010630     IF RPSEC-INST IS EQUAL TO RPXXX10-SK-INST                    01063000
010640         AND RPSEC-PRODCODE IS EQUAL TO RPXXX10-SK-PRODCODE       01064000
010650         AND RPSEC-ACCOUNT IS EQUAL TO RPXXX10-SK-ACCOUNT         01065000
010660         GO TO FDM-GET-NEXT-SEC.                                  01066000
010670     GO TO FDM-RECORD-NOT-FOUND.                                  01067000
010680 FDM-GET-NEXT-SEC.                                                01068000
010690     MOVE RPSEC-MODEL2 TO RPXXX10-SK-MODEL.                       01069000
010700     MOVE RPXXX10-SK-INST TO WS-SAVEMSTINST.                      01070000
010710     MOVE RPXXX10-SK-PRODCODE TO WS-SAVEMSTPRODCODE.              01071000
010720     MOVE RPXXX10-SK-ACCOUNT TO WS-SAVEMSTACCOUNT.                01072000
010730     MOVE RPXXX10-SK-MODEL TO WS-SAVEMSTMODEL.                    01073000
010740     PERFORM RPS-SEC-GET-NEXT-REQUEST.                            01074000
010750     IF WS-FUNCTION IS EQUAL TO 'E'                               01075000
010760         GO TO FDM-GOOD-RECORD.                                   01076000
010770     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01077000
010780         MOVE WS-AB6320 TO RPXXX10-ABORT                          01078000
010790         MOVE WS-TR0055 TO RPXXX10-ABTRACE                        01079000
010800         MOVE 'Y' TO WS-ERRORMODEL                                01080000
010810         GO TO FDM-EXIT.                                          01081000
010820     IF RPSEC-INST IS EQUAL TO RPXXX10-SK-INST                    01082000
010830         AND RPSEC-PRODCODE IS EQUAL TO RPXXX10-SK-PRODCODE       01083000
010840         AND RPSEC-ACCOUNT IS EQUAL TO RPXXX10-SK-ACCOUNT         01084000
010850         GO TO FDM-GOOD-MODEL.                                    01085000
010860     GO TO FDM-GOOD-RECORD.                                       01086000
010870 FDM-GOOD-MODEL.                                                  01087000
010880     IF RPSEC-MODEL2 IS NOT EQUAL TO WS-SAVEMSTMODEL              01088000
010890         GO TO FDM-MULTIPLE-PRIM.                                 01089000
010900     GO TO FDM-GET-NEXT-SEC.                                      01090000
010910 FDM-GOOD-RECORD.                                                 01091000
010920     MOVE WS-SAVEMSTINST TO RPXXX10-SK-INST.                      01092000
010930     MOVE WS-SAVEMSTPRODCODE TO RPXXX10-SK-PRODCODE.              01093000
010940     MOVE WS-SAVEMSTACCOUNT TO RPXXX10-SK-ACCOUNT.                01094000
010950     MOVE WS-SAVEMSTMODEL TO RPXXX10-SK-MODEL.                    01095000
010960     GO TO FDM-EXIT.                                              01096000
010970 FDM-RECORD-NOT-FOUND.                                            01097000
010980     MOVE 'Y' TO WS-ERRORMODEL.                                   01098000
010990     MOVE 500004 TO RPXXX10-MSGNBR.                               01099000
011000     GO TO FDM-EXIT.                                              01100000
011010 FDM-MULTIPLE-PRIM.                                               01101000
011020     MOVE 'Y' TO WS-ERRORMODEL.                                   01102000
011030     MOVE 500090 TO RPXXX10-MSGNBR.                               01103000
011040 FDM-EXIT.                                                        01104000
011050     EXIT.                                                        01105000
011060******************************************************************01106000
000000 COPY RPPACTA.                                                    01107000
011080******************************************************************01108000
000000 COPY RPPMSTA.                                                    01109000
011100******************************************************************01110000
000000 COPY RPPRELA.                                                    01111000
011120******************************************************************01112000
000000 COPY RPPSECA.                                                    01113000
011140******************************************************************01114000
011150 MIC-MST-API SECTION.                                             01115000
000000 COPY MIPMSTA.                                                    01116000
011170******************************************************************01117000
011180 SLP096-GET-2023-RECORD SECTION.                                  01118000
000000 COPY SLP096.                                                     01119000
011200******************************************************************01120000
011210 OPERATOR-DIALOG-SECURITY SECTION.                                01121000
000000 COPY SRP079.                                                     01122000
011230******************************************************************01123000
011240 CICS-ABORT-EXIT SECTION.                                         01124000
011250 CAE-START.                                                       01125000
011260     GO TO CICS-RETURN.                                           01126000
011270 CAE-EXIT.                                                        01127000
011280     EXIT.                                                        01128000
011290******************************************************************01129000
011300 CICS-RETURN SECTION.                                             01130000
011310     IF COM-ABORT IS NOT EQUAL TO ZERO                            01131000
011320         MOVE COM-ABORT TO RPXXX10-ABORT.                         01132000
011330     IF RPXXX10-ABORT IS NOT EQUAL TO ZERO                        01133000
011340         AND WS-UPDATESW IS EQUAL TO 'Y'                          01134000
011350         MOVE 'Y' TO RPXXX10-ABTYPE.                              01135000
011360     IF RPXXX10-ABORT IS NOT EQUAL TO ZERO                        01136000
011370         MOVE WS-FUNCTION TO RPXXX10-FUNCTION                     01137000
011380         MOVE SRB-BMDB TO RPXXX10-SRBMDB                          01138000
011390         MOVE EIBFN TO RPXXX10-ABEIBFN                            01139000
011400         MOVE EIBRESP TO RPXXX10-ABEIBRESP                        01140000
011410         MOVE EIBRESP2 TO RPXXX10-ABEIBRESP2                      01141000
011420         MOVE EIBRCODE TO RPXXX10-ABEIBRCODE.                     01142000
011430     IF RPXXX10-ABTYPE IS NOT EQUAL TO 'Y'                        01143000
011440         PERFORM GLOBAL-CLOSE.                                    01144000
000000 COPY SLP709.                                                     01145000
011460******************************************************************01146000
011470 GLOBAL-CLOSE SECTION.                                            01147000
011480 GC-START.                                                        01148000
011490     IF RPXXX10-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  01149000
011500         PERFORM RPS-MST-GLOBAL-CLOSE-REQUEST.                    01150000
011510 GC-EXIT.                                                         01151000
011520     EXIT.                                                        01152000
011530******************************************************************01153000
