000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX12.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX12 - RELATIONSHIP NEW MODULE                          *00005000
000060*               MINIMAL CRITERIA EDITS ON PRIMARY ACCOUNT        *00006000
000070******************************************************************00007000
000080 ENVIRONMENT DIVISION.                                            00008000
000090 DATA DIVISION.                                                   00009000
000100******************************************************************00010000
000110 WORKING-STORAGE SECTION.                                         00011000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00012000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00012001
000130 01  RPS-RLSELIT.                                                 00013000
000000 COPY RPWRLSE.                                                    00014000
000150 01  MIC-RLSELIT.                                                 00015000
000000 COPY MIWRLSE.                                                    00016000
000170 01  SRW000-AREAS.                                                00017000
000000 COPY SRW000.                                                     00018000
000190 01  SRW025-AREAS.                                                00019000
000000 COPY SRW025.                                                     00020000
000210 01  SRW079-AREAS.                                                00021000
000000 COPY SRW079.                                                     00022000
000230 01  SRW105-AREAS.                                                00023000
000000 COPY SRW105.                                                     00024000
000250*01  BICRSRB.                                                     00025000
000000 COPY BICRSRB.                                                    00026000
000270*01  BICRPSB.                                                     00027000
000000 COPY BICRPSB.                                                    00028000
000290*01  BICRVERB.                                                    00029000
000000 COPY BICRVERB.                                                   00030000
000310*01  BICRSTAT.                                                    00031000
000000 COPY BICRSTAT.                                                   00032000
000330*01  BICRDBS.                                                     00033000
000000 COPY BICRDBS.                                                    00034000
000350*01  BICRLOG.                                                     00035000
000000 COPY BICRLOG.                                                    00036000
000370 01  SRW710-AREAS.                                                00037000
000000 COPY SRW710.                                                     00038000
000390 01  WS-WORKAREAS.                                                00039000
000400     03  COM-ABORT               PIC S9(04)      COMP.            00040000
000410     03  WS-SUB1                 PIC S9(04)      COMP             00041000
000420                                                 VALUE +0000.     00042000
000430     03  WS-SUB2                 PIC S9(04)      COMP             00043000
000440                                                 VALUE +0000.     00044000
000450     03  WS-KEEP-FLAG            PIC X(01)       VALUE SPACES.    00045000
000460     03  WS-INTERFACE            PIC X(01)       VALUE SPACES.    00046000
000470     03  WS-DATE-TEST            PIC X(01)       VALUE 'N'.       00047000
000480     03  WS-UPDATESW             PIC X(01)       VALUE SPACES.    00048000
000490     03  WS-ACT-FLAG             PIC X(01)       VALUE SPACES.    00049000
000500     03  WS-BALCATCD1-FAIL       PIC X(01)       VALUE SPACES.    00050000
000510     03  WS-PRIMOPT-FAIL         PIC X(01)       VALUE SPACES.    00051000
000520     03  WS-NUM-15               PIC S9(15)      VALUE ZEROS.     00052000
000530     03  WS-WORK-TRUE            PIC X(15).                       00053000
000540     03  WS-WORK-TRUEX   REDEFINES WS-WORK-TRUE.                  00054000
000550         05  WS-TRUE-SW          PIC X(01)       OCCURS 15 TIMES. 00055000
000560     03  WS-WORK-CATCD           PIC X(06)       VALUE SPACES.    00056000
000570     03  WS-WORK-BALCD           PIC 9(02)       VALUE ZEROS.     00057000
000580     03  WS-WORK-BALANCE         PIC S9(13)V99   COMP-3           00058000
000590                                                 VALUE ZEROS.     00059000
000600     03  WS-SUB99                PIC S9(04)      COMP             00060000
000610                                                 VALUE +0000.     00061000
000620     03  WS-SAVE-PRODCODE        PIC X(06)       VALUE SPACES.    00062000
000630     03  WS-SAVE-ACCT-TYPE       PIC 9(03)       VALUE ZEROS.     00063000
000640     03  WS-2023RPOPTION         PIC X(01)       VALUE SPACES.    00064000
000650     03  WS-IDNBR-GRP            PIC 9(18)       VALUE ZERO.      00065000
000660     03  FILLER          REDEFINES WS-IDNBR-GRP.                  00066000
000670         05  WS-IDNBR-DATE       PIC 9(08).                       00067000
000680         05  WS-IDNBR-TIME       PIC 9(06).                       00068000
000690         05  WS-IDNBR-SEQ        PIC 9(04).                       00069000
000700     03  WS-CYEAR-FIRST          PIC X(08).                       00070000
000710     03  FILLER          REDEFINES WS-CYEAR-FIRST.                00071000
000720         05  WS-CYYYY            PIC 9(04).                       00072000
000730         05  WS-CMM              PIC 9(02).                       00073000
000740         05  WS-CDD              PIC 9(02).                       00074000
000750     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00075000
000760     03  FILLER          REDEFINES WS-CURDATE.                    00076000
000770         05  WS-CURMM            PIC 9(02).                       00077000
000780         05  WS-CURDD            PIC 9(02).                       00078000
000790         05  WS-CURYYYY          PIC 9(04).                       00079000
000800     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00080000
000810     03  FILLER          REDEFINES WS-PDATE.                      00081000
000820         05  WS-PDATE-YYYY       PIC 9(04).                       00082000
000830         05  WS-PDATE-MM         PIC 9(02).                       00083000
000840         05  WS-PDATE-DD         PIC 9(02).                       00084000
000850     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00085000
000860     03  FILLER          REDEFINES WS-PDATE2.                     00086000
000870         05  WS-PDATE2-YYYY      PIC 9(04).                       00087000
000880         05  WS-PDATE2-MM        PIC 9(02).                       00088000
000890         05  WS-PDATE2-DD        PIC 9(02).                       00089000
000900     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00090000
000910                                                 VALUE ZERO.      00091000
000920     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00092000
000930                                                 VALUE ZERO.      00093000
000940*----------------------------------------------------------------*00094000
000950 01  MIWPRI-AREAS.                                                00095000
000000 COPY MIWPRI.                                                     00096000
000970 01  MIWMSTA-AREAS.                                               00097000
000000 COPY MIWMSTA.                                                    00098000
000990 01  MIMST-RECORD.                                                00099000
000000 COPY MISMST.                                                     00100000
001010 01  MICSF-RECORD.                                                00101000
000000 COPY MISCSF.                                                     00102000
001030 01  MI0237-RECORD.                                               00103000
000000 COPY MIS0237A.                                                   00104000
001050 01  MI2023-RECORD.                                               00105000
000000 COPY MIS2023A.                                                   00106000
001070 01  MI7100-RECORD.                                               00107000
000000 COPY MIS7100.                                                    00108000
001090 01  MI7101-RECORD.                                               00109000
000000 COPY MIS7101.                                                    00110000
001110 01  MI7102-RECORD.                                               00111000
000000 COPY MIS7102.                                                    00112000
001130 01  MI7104-RECORD.                                               00113000
000000 COPY MIS7104.                                                    00114000
001150 01  MI7107-RECORD.                                               00115000
000000 COPY MIS7107.                                                    00116000
001170*----------------------------------------------------------------*00117000
001180 01  RPWPRI-AREAS.                                                00118000
000000 COPY RPWPRI.                                                     00119000
001200 01  RPWACT-AREA.                                                 00120000
000000 COPY RPWACTA.                                                    00121000
001220 01  RPACT-RECORD.                                                00122000
000000 COPY RPSACT.                                                     00123000
001240 01  RPWIDX-AREA.                                                 00124000
000000 COPY RPWIDXA.                                                    00125000
001260 01  RPIDX-RECORD.                                                00126000
000000 COPY RPSIDX.                                                     00127000
001280 01  RPWMST-AREA.                                                 00128000
000000 COPY RPWMSTA.                                                    00129000
001300 01  RPMST-RECORD.                                                00130000
000000 COPY RPSMST.                                                     00131000
001320 01  RPWQUA-AREA.                                                 00132000
000000 COPY RPWQUAA.                                                    00133000
001340 01  RPQUA-RECORD.                                                00134000
000000 COPY RPSQUA.                                                     00135000
001360*----------------------------------------------------------------*00136000
001370 01  RPRF21-MESSAGE.                                              00137000
000000 COPY MISCNT00      REPLACING                                     00138000
001390             ==:MICNT:== BY ==RPRF21==.                           00139000
000000 COPY RPSRF21.                                                    00140000
001410*----------------------------------------------------------------*00141000
001420 01  RPINF00-MESSAGE.                                             00142000
000000 COPY MISCNT00      REPLACING                                     00143000
001440             ==:MICNT:== BY ==RPINF00==.                          00144000
000000 COPY RPSINF00.                                                   00145000
001460*----------------------------------------------------------------*00146000
001470 01  RPUSER-MESSAGE.                                              00147000
000000 COPY MISCNT00      REPLACING                                     00148000
001490     ==:MICNT:== BY ==RPUSER==.                                   00149000
000000 COPY RPWUSER.                                                    00150000
001510***************************************************************** 00151000
001520 01  WS-TRACECODES.                                               00152000
001530     03  WS-TR0001               PIC S9(04)      COMP             00153000
001540                                                 VALUE +0001.     00154000
001550     03  WS-TR0002               PIC S9(04)      COMP             00155000
001560                                                 VALUE +0002.     00156000
001570     03  WS-TR0003               PIC S9(04)      COMP             00157000
001580                                                 VALUE +0003.     00158000
001590     03  WS-TR0004               PIC S9(04)      COMP             00159000
001600                                                 VALUE +0004.     00160000
001610     03  WS-TR0005               PIC S9(04)      COMP             00161000
001620                                                 VALUE +0005.     00162000
001630     03  WS-TR0006               PIC S9(04)      COMP             00163000
001640                                                 VALUE +0006.     00164000
001650     03  WS-TR0007               PIC S9(04)      COMP             00165000
001660                                                 VALUE +0007.     00166000
001670     03  WS-TR0008               PIC S9(04)      COMP             00167000
001680                                                 VALUE +0008.     00168000
001690     03  WS-TR0009               PIC S9(04)      COMP             00169000
001700                                                 VALUE +0009.     00170000
001710     03  WS-TR0010               PIC S9(04)      COMP             00171000
001720                                                 VALUE +0010.     00172000
001730 01  WS-ABORTCODES.                                               00173000
001740     03  WS-AB2000               PIC S9(04)      COMP             00174000
001750                                                 VALUE +2000.     00175000
001760     03  WS-AB2033               PIC S9(04)      COMP             00176000
001770                                                 VALUE +2033.     00177000
001780     03  WS-AB3051               PIC S9(04)      COMP             00178000
001790                                                 VALUE +3051.     00179000
001800     03  WS-AB6300               PIC S9(04)      COMP             00180000
001810                                                 VALUE +6300.     00181000
001820     03  WS-AB6310               PIC S9(04)      COMP             00182000
001830                                                 VALUE +6310.     00183000
001840     03  WS-AB6320               PIC S9(04)      COMP             00184000
001850                                                 VALUE +6320.     00185000
001860     03  WS-AB6325               PIC S9(04)      COMP             00186000
001870                                                 VALUE +6325.     00187000
001880******************************************************************00188000
001890 01  SLW096-AREAS.                                                00189000
000000 COPY SLW096.                                                     00190000
001910******************************************************************00191000
001920 LINKAGE SECTION.                                                 00192000
001930 01  DFHCOMMAREA.                                                 00193000
000000 COPY MISCNT00      REPLACING                                     00194000
001950             ==:MICNT:== BY ==RPXXX02==.                          00195000
000000 COPY RPSXXX02.                                                   00196000
001970*01  SLW096-2023RECORDS.                                          00197000
000000 COPY SLW096L.                                                    00198000
001990******************************************************************00199000
002000 PROCEDURE DIVISION.                                              00200000
002010******************************************************************00201000
002020 ENTRY-ROUTINE SECTION.                                           00202000
002030 ER-START.                                                        00203000
002040     MOVE 'RPLXXX12' TO SR-APIPROGLIT.                            00204000
002050     MOVE 'RPLXXX12' TO RPXXX02-ABPROGID.                         00205000
002060     PERFORM CICS-HANDLE-CONDITION.                               00206000
002070     IF EIBCALEN IS EQUAL TO +0                                   00207000
002080         MOVE WS-AB2000 TO RPXXX02-ABORT                          00208000
002090         MOVE WS-TR0001 TO RPXXX02-ABTRACE                        00209000
002100         GO TO CICS-RETURN.                                       00210000
002110     MOVE ZERO TO RPXXX02-MSGNBR.                                 00211000
002120     MOVE SPACE TO WS-FUNCTION.                                   00212000
002130     MOVE RPXXX02-FILEOPTS TO WS-FILEOPTS.                        00213000
002140     MOVE RPXXX02-OPERID TO WS-UPD-USER.                          00214000
002150     MOVE RPXXX02-EXTERNALID TO LOG-PANELID.                      00215000
002160     MOVE RPXXX02-TERMID TO LOG-TERMID.                           00216000
002170     MOVE RPXXX02-WORKID TO LOG-WORKID.                           00217000
002180     MOVE RPXXX02-TRANSTART TO LOG-TRANSTART.                     00218000
002190     MOVE RPXXX02-APPLSEQ TO LOG-APPLSEQ.                         00219000
000000 COPY SLP094.                                                     00220000
002210     GO TO VERIFY-KEY.                                            00221000
002220 ER-EXIT.                                                         00222000
002230     EXIT.                                                        00223000
002240******************************************************************00224000
002250 CICS-HANDLE-CONDITION SECTION.                                   00225000
000000 COPY SLP702.                                                     00226000
002270     MOVE WS-AB2033 TO RPXXX02-ABORT.                             00227000
002280     MOVE WS-TR0002 TO RPXXX02-ABTRACE.                           00228000
002290     GO TO CICS-RETURN.                                           00229000
002300 CHC-EXIT.                                                        00230000
002310     EXIT.                                                        00231000
002320******************************************************************00232000
002330 VERIFY-KEY SECTION.                                              00233000
002340 VK-START.                                                        00234000
002350     MOVE ZERO TO COM-ABORT.                                      00235000
002360     MOVE ZERO TO RPXXX02-ABORT.                                  00236000
002370     MOVE ZERO TO RPXXX02-MSGNBR.                                 00237000
002380     MOVE SPACES TO RPXXX02-FUNCTION.                             00238000
002390     MOVE RPXXX02-DATE TO WS-CURDATE.                             00239000
002400     MOVE WS-CURMM TO WS-PDATE-MM.                                00240000
002410     MOVE WS-CURDD TO WS-PDATE-DD.                                00241000
002420     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00242000
002430     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00243000
002440 VK-SECURITY.                                                     00244000
002450     IF RPXXX02-APIFUNC IS NOT EQUAL TO 'VKL'                     00245000
002460         GO TO VK-2023-LOAD.                                      00246000
002470     MOVE RPXXX02-UPDATE TO SR-OPDUPDATE.                         00247000
002480     MOVE RPXXX02-KEY-INST TO SR-OPDINST.                         00248000
002490     MOVE RPXXX02-OPERID TO SR-OPDOPERID.                         00249000
002500     MOVE RPXXX02-MODELID TO SR-OPDMODELID.                       00250000
002510     MOVE RPXXX02-EXTERNALID TO SR-OPDTRANCODE.                   00251000
002520     MOVE RPXXX02-APPL TO SR-OPDAPPL.                             00252000
002530     MOVE RPXXX02-SECALT TO SR-OPDSECALT.                         00253000
002540     MOVE RPXXX02-FUNC TO SR-OPDFUNC.                             00254000
002550     PERFORM OPERATOR-DIALOG-SECURITY.                            00255000
002560     MOVE SR-OPDUPDATE TO RPXXX02-UPDATE.                         00256000
002570     IF SR-OPDMSGNBR IS NOT EQUAL TO ZEROS                        00257000
002580         MOVE SR-OPDMSGNBR TO RPXXX02-MSGNBR                      00258000
002590         GO TO VK-RETURN.                                         00259000
002600 VK-RECTYPE.                                                      00260000
002610     IF RPXXX02-KEY-MODEL IS NOT EQUAL TO SPACES                  00261000
002620         AND RPXXX02-KEY-MODEL IS NOT EQUAL TO LOW-VALUES         00262000
002630         MOVE 500052 TO RPXXX02-MSGNBR                            00263000
002640         GO TO VK-RETURN.                                         00264000
002650 VK-2023-LOAD.                                                    00265000
002660     MOVE RPXXX02-KEY-INST TO MIM-2023KINST.                      00266000
002670     MOVE 'RP' TO MIM-2023KPRODCODE.                              00267000
002680     MOVE RPXXX02-INST-OPT-1 TO SLW096-BANKS.                     00268000
002690     PERFORM SLP096-GET-2023-RECORD.                              00269000
002700     IF SLW096-FUNCTION IS EQUAL TO 'N'                           00270000
002710         MOVE SPACES TO RPXXX02-RP-PRODCODE                       00271000
002720         GO TO VK-MST.                                            00272000
002730     MOVE MIM-2023KPRODCODE TO RPXXX02-RP-PRODCODE.               00273000
002740 VK-MST.                                                          00274000
002750     MOVE RPXXX02-KEY-RECORD TO RPMST-GRP-KEY.                    00275000
002760     PERFORM RPS-MST-GET-REQUEST.                                 00276000
002770     IF WS-FUNCTION IS EQUAL TO 'N'                               00277000
002780         GO TO VK-2023.                                           00278000
002790     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00279000
002800         MOVE WS-AB6320 TO RPXXX02-ABORT                          00280000
002810         MOVE WS-TR0003 TO RPXXX02-ABTRACE                        00281000
002820         GO TO VK-RETURN.                                         00282000
002830     MOVE 500014 TO RPXXX02-MSGNBR.                               00283000
002840     GO TO VK-RETURN.                                             00284000
002850 VK-2023.                                                         00285000
002860     PERFORM READ-MICM-2023.                                      00286000
002870     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00287000
002880         MOVE 500001 TO RPXXX02-MSGNBR                            00288000
002890         GO TO VK-RETURN.                                         00289000
002900     IF MIM-2023RPOPTION IS EQUAL TO ' '                          00290000
002910         OR MIM-2023RPOPTION IS EQUAL TO 'N'                      00291000
002920         MOVE 500015 TO RPXXX02-MSGNBR                            00292000
002930         GO TO VK-RETURN.                                         00293000
002940 VK-7100.                                                         00294000
002950     PERFORM READ-MICM-7100.                                      00295000
002960     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00296000
002970         MOVE 500005 TO RPXXX02-MSGNBR                            00297000
002980         GO TO VK-RETURN.                                         00298000
002990 VK-7101.                                                         00299000
003000     PERFORM READ-MICM-7101.                                      00300000
003010     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00301000
003020         MOVE 500006 TO RPXXX02-MSGNBR                            00302000
003030         GO TO VK-RETURN.                                         00303000
003040     IF RPXXX02-APIFUNC IS NOT EQUAL TO 'VKL'                     00304000
003050         GO TO VK-EXIT.                                           00305000
003060     IF MIM-7101ACTCD IS EQUAL TO 'I'                             00306000
003070         MOVE 500017 TO RPXXX02-MSGNBR                            00307000
003080         GO TO VK-RETURN.                                         00308000
003090     IF MIM-7101EXPDT IS NOT GREATER THAN WS-CURDT-YYYYMMDD       00309000
003100         AND MIM-7101EXPDT IS GREATER THAN ZEROS                  00310000
003110         MOVE 500018 TO RPXXX02-MSGNBR                            00311000
003120         GO TO VK-RETURN.                                         00312000
003130     IF MIM-7101CLOSEDT IS LESS THAN WS-CURDT-YYYYMMDD            00313000
003140         AND MIM-7101CLOSEDT IS GREATER THAN ZEROS                00314000
003150         MOVE 500019 TO RPXXX02-MSGNBR                            00315000
003160         GO TO VK-RETURN.                                         00316000
003170     MOVE MIM-7101DESC TO RPXXX02-MODEL-DESC.                     00317000
003180     MOVE MIM-7101ENROLLATTEMPTS TO RPXXX02-ENROLL-ATTEMPTS.      00318000
003190 VK-NAME.                                                         00319000
003200     MOVE 'A' TO RPRF21-FUNC.                                     00320000
003210     MOVE RPXXX02-KEY-INST TO RPRF21-BASE-ACCT-INST.              00321000
003220     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00322000
003230         AND MIM-7100ENTERPRISEINST IS GREATER THAN ZEROS         00323000
003240         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00324000
003250     MOVE RPXXX02-KEY-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.      00325000
003260     MOVE RPXXX02-KEY-ACCOUNT TO RPRF21-BASE-ACCT.                00326000
003270     PERFORM REQUEST-CUSTOMER.                                    00327000
003280     IF WS-FUNCTION IS EQUAL TO SPACES                            00328000
003290         GO TO VK-RP-CHECK.                                       00329000
003300     IF RPXXX02-MSGNBR IS EQUAL TO ZEROS                          00330000
003310         MOVE 500016 TO RPXXX02-MSGNBR.                           00331000
003320     GO TO VK-RETURN.                                             00332000
003330 VK-RP-CHECK.                                                     00333000
003340     MOVE RPRF21-BASE-CUSTOMER TO RPXXX02-CUST-KEY.               00334000
003350     MOVE RPRF21-NAME TO RPXXX02-CUST-NAME.                       00335000
003360     IF MIM-7100CUSTLIMITOPT IS NOT EQUAL TO 'Y'                  00336000
003370         GO TO VK-ACT.                                            00337000
003380     MOVE ZERO TO WS-SUB1.                                        00338000
003390     IF RPXXX02-RP-PRODCODE IS GREATER THAN SPACES                00339000
003400         GO TO VK-RP-CONT.                                        00340000
003410 VK-RP-LOOP.                                                      00341000
003420     ADD +1 TO WS-SUB1.                                           00342000
003430     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00343000
003440         MOVE 500033 TO RPXXX02-MSGNBR                            00344000
003450         GO TO VK-RETURN.                                         00345000
003460     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00346000
003470         IS NOT EQUAL TO RPXXX02-APPL                             00347000
003480         GO TO VK-RP-LOOP.                                        00348000
003490     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO RPXXX02-RP-PRODCODE.  00349000
003500 VK-RP-CONT.                                                      00350000
003510     MOVE 'D' TO RPRF21-FUNC.                                     00351000
003520     MOVE RPXXX02-KEY-INST TO RPRF21-BASE-ACCT-INST.              00352000
003530     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00353000
003540         AND MIM-7100ENTERPRISEINST IS GREATER THAN ZEROS         00354000
003550         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00355000
003560     MOVE RPXXX02-RP-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.       00356000
003570     MOVE SPACES TO RPRF21-BASE-ACCT.                             00357000
003580     PERFORM REQUEST-CUSTOMER.                                    00358000
003590     IF WS-FUNCTION IS EQUAL TO SPACES                            00359000
003600         MOVE RPXXX02-KEY-INST TO RPRF21-BASE-ACCT-INST           00360000
003610         MOVE RPXXX02-KEY-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE   00361000
003620         MOVE RPXXX02-KEY-ACCOUNT TO RPRF21-BASE-ACCT             00362000
003630         GO TO VK-ACT.                                            00363000
003640     IF RPXXX02-MSGNBR IS EQUAL TO ZEROS                          00364000
003650         MOVE 500020 TO RPXXX02-MSGNBR.                           00365000
003660     GO TO VK-RETURN.                                             00366000
003670 VK-ACT.                                                          00367000
003680     MOVE SPACE TO WS-ACT-FLAG.                                   00368000
003690     INITIALIZE RPACT-RECORD.                                     00369000
003700     MOVE RPXXX02-KEY-RECORD TO RPACT-GRP-KEY.                    00370000
003710     PERFORM RPS-ACT-GET-GE-REQUEST.                              00371000
003720     GO TO VK-ACT-CONT.                                           00372000
003730 VK-ACT-NEXT.                                                     00373000
003740     PERFORM RPS-ACT-GET-NEXT-REQUEST.                            00374000
003750 VK-ACT-CONT.                                                     00375000
003760     IF WS-FUNCTION IS EQUAL TO 'E'                               00376000
003770         GO TO VK-QUA-ACCT.                                       00377000
003780     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00378000
003790         MOVE WS-AB6300 TO RPXXX02-ABORT                          00379000
003800         MOVE WS-TR0004 TO RPXXX02-ABTRACE                        00380000
003810         GO TO CICS-ABORT-EXIT.                                   00381000
003820     IF RPXXX02-KEY-INST IS NOT EQUAL TO RPACT-INST               00382000
003830         OR RPXXX02-KEY-PRODCODE IS NOT EQUAL TO RPACT-PRODCODE   00383000
003840         OR RPXXX02-KEY-ACCOUNT IS NOT EQUAL TO RPACT-ACCOUNT     00384000
003850         GO TO VK-QUA-ACCT.                                       00385000
003860     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      00386000
003870         MOVE 500021 TO RPXXX02-MSGNBR                            00387000
003880         GO TO VK-RETURN.                                         00388000
003890*    IF RPXXX02-KEY-MODEL IS EQUAL TO RPACT-RECTYPE               00389000
003900*        MOVE 'Y' TO WS-ACT-FLAG                                  00390000
003910*        GO TO VK-QUA-ACCT.                                       00391000
003920     GO TO VK-ACT-NEXT.                                           00392000
003930 VK-QUA-ACCT.                                                     00393000
003940     INITIALIZE RPQUA-RECORD.                                     00394000
003950     MOVE RPXXX02-KEY-RECORD TO RPQUA-GRP-KEY.                    00395000
003960     MOVE RPXXX02-KEY-MODEL TO RPQUA-MODEL.                       00396000
003970     PERFORM RPS-QUA-GET-REQUEST.                                 00397000
003980     IF WS-FUNCTION IS EQUAL TO 'N'                               00398000
003990         GO TO VK-QUA-CONT.                                       00399000
004000     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00400000
004010         MOVE WS-AB6325 TO RPXXX02-ABORT                          00401000
004020         MOVE WS-TR0005 TO RPXXX02-ABTRACE                        00402000
004030         GO TO CICS-ABORT-EXIT.                                   00403000
004040     MOVE 500022 TO RPXXX02-MSGNBR.                               00404000
004050     GO TO VK-RETURN.                                             00405000
004060 VK-QUA-CONT.                                                     00406000
004070     IF MIM-7100ACCTLIMITOPT IS NOT EQUAL TO 'Y'                  00407000
004080         GO TO VK-QUA-CUST.                                       00408000
004090     INITIALIZE RPQUA-RECORD.                                     00409000
004100     MOVE RPXXX02-KEY-RECORD TO RPQUA-GRP-KEY.                    00410000
004110     MOVE LOW-VALUES TO RPQUA-MODEL.                              00411000
004120     PERFORM RPS-QUA-GET-GE-REQUEST.                              00412000
004130     IF WS-FUNCTION IS EQUAL TO 'E'                               00413000
004140         GO TO VK-QUA-CUST.                                       00414000
004150     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00415000
004160         MOVE WS-AB6325 TO RPXXX02-ABORT                          00416000
004170         MOVE WS-TR0006 TO RPXXX02-ABTRACE                        00417000
004180         GO TO CICS-ABORT-EXIT.                                   00418000
004190     IF RPXXX02-KEY-INST IS NOT EQUAL TO RPQUA-INST               00419000
004200         OR RPXXX02-KEY-PRODCODE IS NOT EQUAL TO RPQUA-PRODCODE   00420000
004210         OR RPXXX02-KEY-ACCOUNT IS NOT EQUAL TO RPQUA-ACCOUNT     00421000
004220         GO TO VK-QUA-CUST.                                       00422000
004230     MOVE 500022 TO RPXXX02-MSGNBR.                               00423000
004240     GO TO VK-RETURN.                                             00424000
004250 VK-QUA-CUST.                                                     00425000
004260     IF MIM-7100CUSTLIMITOPT IS NOT EQUAL TO 'Y'                  00426000
004270         GO TO VK-INTERFACE.                                      00427000
004280     INITIALIZE RPQUA-RECORD.                                     00428000
004290     MOVE RPXXX02-KEY-INST TO RPQUA-INST.                         00429000
004300     PERFORM RPS-QUA-GET-GE-REQUEST.                              00430000
004310     GO TO VK-QUA-CHECK.                                          00431000
004320 VK-QUA-NEXT.                                                     00432000
004330     PERFORM RPS-QUA-GET-NEXT-REQUEST.                            00433000
004340 VK-QUA-CHECK.                                                    00434000
004350     IF WS-FUNCTION IS EQUAL TO 'E'                               00435000
004360         GO TO VK-INTERFACE.                                      00436000
004370     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00437000
004380         MOVE WS-AB6325 TO RPXXX02-ABORT                          00438000
004390         MOVE WS-TR0007 TO RPXXX02-ABTRACE                        00439000
004400         GO TO VK-RETURN.                                         00440000
004410     IF RPQUA-INST IS NOT EQUAL TO RPXXX02-KEY-INST               00441000
004420         GO TO VK-INTERFACE.                                      00442000
004430     IF RPQUA-RCIF-KEY IS NOT EQUAL TO RPRF21-BASE-CUSTOMER       00443000
004440         GO TO VK-QUA-NEXT.                                       00444000
004450     MOVE 500023 TO RPXXX02-MSGNBR.                               00445000
004460     GO TO VK-RETURN.                                             00446000
004470 VK-INTERFACE.                                                    00447000
004480     MOVE 'N' TO WS-INTERFACE.                                    00448000
004490     MOVE SPACES TO RPINF00-MESSAGE.                              00449000
004500     IF MIM-2023RPOPTION IS NOT EQUAL TO 'Y'                      00450000
004510         MOVE ZEROS TO RPXXX02-BRANCH                             00451000
004520         MOVE ZEROS TO RPXXX02-ACCT-TYPE                          00452000
004530         GO TO VK-PRIMARY-OPTION.                                 00453000
004540     PERFORM READ-MICM-0237.                                      00454000
004550     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00455000
004560         OR MIM-237OLINTFC IS NOT GREATER THAN SPACES             00456000
004570         MOVE 500024 TO RPXXX02-MSGNBR                            00457000
004580         GO TO VK-RETURN.                                         00458000
004590     PERFORM LINK-INTERFACE.                                      00459000
004600     IF WS-FUNCTION IS EQUAL TO 'D'                               00460000
004610         AND RPXXX02-MSGNBR IS EQUAL TO ZEROS                     00461000
004620         MOVE 500087 TO RPXXX02-MSGNBR.                           00462000
004630     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00463000
004640         AND RPXXX02-MSGNBR IS EQUAL TO ZEROS                     00464000
004650         MOVE 500025 TO RPXXX02-MSGNBR.                           00465000
004660     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00466000
004670         GO TO VK-RETURN.                                         00467000
004680     MOVE RPINF00-BRANCH TO RPXXX02-BRANCH.                       00468000
004690     MOVE RPINF00-ACCT-TYPE TO RPXXX02-ACCT-TYPE.                 00469000
004700 VK-PRIMARY-OPTION.                                               00470000
004710     PERFORM VALIDATE-PRIMARY-OPTION.                             00471000
004720     IF WS-PRIMOPT-FAIL IS EQUAL TO 'Y'                           00472000
004730         MOVE 500089 TO RPXXX02-MSGNBR                            00473000
004740         GO TO VK-RETURN.                                         00474000
004750 VK-7102.                                                         00475000
004760     PERFORM READ-MICM-7102.                                      00476000
004770     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00477000
004780         MOVE 500007 TO RPXXX02-MSGNBR                            00478000
004790         GO TO VK-RETURN.                                         00479000
004800 VK-INCENTIVE.                                                    00480000
004810     IF WS-ACT-FLAG IS NOT EQUAL TO 'Y'                           00481000
004820         OR MIM-7100DUPINCOPT IS EQUAL TO 'Y'                     00482000
004830         GO TO VK-7104.                                           00483000
004840     IF (MIM-7102PRIMSCINCOPT IS EQUAL TO 'Y'                     00484000
004850         AND RPACT-SC-INC-OPTION IS EQUAL TO 'Y')                 00485000
004860         OR (MIM-7102PRIMRATEINCOPT IS EQUAL TO 'Y'               00486000
004870         AND RPACT-RATE-INC-OPTION IS EQUAL TO 'Y')               00487000
004880         MOVE 500027 TO RPXXX02-MSGNBR                            00488000
004890         GO TO VK-RETURN.                                         00489000
004900 VK-7104.                                                         00490000
004910     IF MIM-7101CUSTRELCD IS EQUAL TO SPACES                      00491000
004920         OR (MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'B'              00492000
004930         AND MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'E')             00493000
004940         GO TO VK-7107.                                           00494000
004950     PERFORM READ-MICM-7104.                                      00495000
004960     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00496000
004970         MOVE 500009 TO RPXXX02-MSGNBR                            00497000
004980         GO TO VK-RETURN.                                         00498000
004990     IF WS-KEEP-FLAG IS NOT EQUAL TO 'Y'                          00499000
005000         MOVE 500028 TO RPXXX02-MSGNBR                            00500000
005010         GO TO VK-RETURN.                                         00501000
005020 VK-7107.                                                         00502000
005030     IF MIM-7102BRCHREGIONCD IS EQUAL TO SPACES                   00503000
005040         OR (MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'B'           00504000
005050         AND MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'E')          00505000
005060         GO TO VK-IDNUMBER.                                       00506000
005070     PERFORM READ-MICM-7107.                                      00507000
005080     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00508000
005090         MOVE 500012 TO RPXXX02-MSGNBR                            00509000
005100         GO TO VK-RETURN.                                         00510000
005110     IF WS-KEEP-FLAG IS NOT EQUAL TO 'Y'                          00511000
005120         MOVE 500030 TO RPXXX02-MSGNBR                            00512000
005130         GO TO VK-RETURN.                                         00513000
005140 VK-IDNUMBER.                                                     00514000
005150     PERFORM CREATE-IDNUMBER.                                     00515000
005160     GO TO VK-EXIT.                                               00516000
005170 VK-RETURN.                                                       00517000
005180     MOVE 'E' TO RPXXX02-RETURN.                                  00518000
005190     GO TO CICS-RETURN.                                           00519000
005200 VK-EXIT.                                                         00520000
005210     EXIT.                                                        00521000
005220******************************************************************00522000
005230 ROUTING-ROUTINE SECTION.                                         00523000
005240 RR-START.                                                        00524000
005250     IF RPXXX02-APIFUNC IS EQUAL TO 'VKL'                         00525000
005260         GO TO RR-END.                                            00526000
005270     PERFORM WRITE-QUA-RECORD.                                    00527000
005280 RR-END.                                                          00528000
005290     GO TO CICS-RETURN.                                           00529000
005300 RR-EXIT.                                                         00530000
005310     EXIT.                                                        00531000
005320******************************************************************00532000
005330 READ-MICM-0237 SECTION.                                          00533000
005340 RM0237-START.                                                    00534000
005350     MOVE SPACES TO WS-FUNCTION.                                  00535000
005360     MOVE SPACES TO MI0237-RECORD.                                00536000
005370     MOVE RPXXX02-KEY-INST TO MIM-0237KINST.                      00537000
005380     MOVE +0237 TO MIM-0237KREC.                                  00538000
005390     MOVE RPXXX02-APPL TO MIM-0237KPROCMGR.                       00539000
005400     MOVE MIM-2023INTAPPL211 TO MIM-0237KINTAPPL.                 00540000
005410     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    00541000
005420     MOVE MI0237-RECORD TO MIMST-RECORD.                          00542000
005430     PERFORM MIC-MST-GET-REQUEST.                                 00543000
005440     MOVE MIMST-RECORD TO MI0237-RECORD.                          00544000
005450 RM0237-EXIT.                                                     00545000
005460     EXIT.                                                        00546000
005470******************************************************************00547000
005480 READ-MICM-2023 SECTION.                                          00548000
005490 RM2023-START.                                                    00549000
005500     MOVE SPACES TO WS-FUNCTION.                                  00550000
005510     MOVE SPACES TO MI2023-RECORD.                                00551000
005520     MOVE RPXXX02-KEY-INST TO MIM-2023KINST.                      00552000
005530     IF RPXXX02-INST-OPT-1 IS NOT EQUAL TO 'Y'                    00553000
005540         MOVE ZEROS TO MIM-2023KINST.                             00554000
005550     MOVE RPXXX02-KEY-PRODCODE TO MIM-2023KPRODCODE.              00555000
005560     MOVE +2023 TO MIM-2023KREC.                                  00556000
005570     MOVE MIC-MST-2023-PRI TO MIC-MST-REC-PRI.                    00557000
005580 RM2023-INST-ZERO.                                                00558000
005590     MOVE MI2023-RECORD TO MIMST-RECORD.                          00559000
005600     MOVE SPACES TO WS-FUNCTION.                                  00560000
005610     PERFORM MIC-MST-GET-REQUEST.                                 00561000
005620     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00562000
005630         AND MIM-2023KINST IS NOT EQUAL TO ZEROS                  00563000
005640         MOVE ZEROS TO MIM-2023KINST                              00564000
005650         GO TO RM2023-INST-ZERO.                                  00565000
005660     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00566000
005670         GO TO RM2023-END.                                        00567000
005680     MOVE MIMST-RECORD TO MI2023-RECORD.                          00568000
005690 RM2023-END.                                                      00569000
005700     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00570000
005710         MOVE 'N' TO MIM-2023RPOPTION.                            00571000
005720 RM2023-EXIT.                                                     00572000
005730     EXIT.                                                        00573000
005740******************************************************************00574000
005750 READ-MICM-7100 SECTION.                                          00575000
005760 RM7100-START.                                                    00576000
005770     MOVE SPACES TO WS-FUNCTION.                                  00577000
005780     MOVE SPACES TO MI7100-RECORD.                                00578000
005790     MOVE RPXXX02-KEY-INST TO MIM-7100KINST.                      00579000
005800 RM7100-LOOP.                                                     00580000
005810     MOVE +7100 TO MIM-7100KREC.                                  00581000
005820     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00582000
005830     MOVE MI7100-RECORD TO MIMST-RECORD.                          00583000
005840     PERFORM MIC-MST-GET-REQUEST.                                 00584000
005850     MOVE MIMST-RECORD TO MI7100-RECORD.                          00585000
005860     IF WS-FUNCTION IS EQUAL TO 'N'                               00586000
005870         AND MIM-7100KINST IS GREATER THAN ZEROS                  00587000
005880         GO TO RM7100-ZERO.                                       00588000
005890     GO TO RM7100-EXIT.                                           00589000
005900 RM7100-ZERO.                                                     00590000
005910     MOVE SPACES TO MI7100-RECORD.                                00591000
005920     MOVE ZEROS TO MIM-7100KINST.                                 00592000
005930     GO TO RM7100-LOOP.                                           00593000
005940 RM7100-EXIT.                                                     00594000
005950     EXIT.                                                        00595000
005960******************************************************************00596000
005970 READ-MICM-7101 SECTION.                                          00597000
005980 RM7101-START.                                                    00598000
005990     MOVE SPACES TO WS-FUNCTION.                                  00599000
006000     MOVE SPACES TO MI7101-RECORD.                                00600000
006010     MOVE RPXXX02-KEY-INST TO MIM-7101KINST.                      00601000
006020     MOVE +7101 TO MIM-7101KREC.                                  00602000
006030     MOVE RPXXX02-KEY-MODEL TO MIM-7101KMODEL.                    00603000
006040     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        00604000
006050     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00605000
006060     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00606000
006070     MOVE MI7101-RECORD TO MIMST-RECORD.                          00607000
006080     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00608000
006090     MOVE MIMST-RECORD TO MI7101-RECORD.                          00609000
006100     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00610000
006110         GO TO RM7101-EXIT.                                       00611000
006120     IF MIM-7101KINST IS NOT EQUAL TO RPXXX02-KEY-INST            00612000
006130         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00613000
006140         OR MIM-7101KMODEL IS NOT EQUAL TO RPXXX02-KEY-MODEL      00614000
006150         MOVE 'N' TO WS-FUNCTION                                  00615000
006160         GO TO RM7101-EXIT.                                       00616000
006170 RM7101-EXIT.                                                     00617000
006180     EXIT.                                                        00618000
006190******************************************************************00619000
006200 READ-MICM-7102 SECTION.                                          00620000
006210 RM7102-START.                                                    00621000
006220     MOVE RPRF21-BASE-ACCT-PRODCODE TO WS-SAVE-PRODCODE.          00622000
006230     MOVE RPXXX02-ACCT-TYPE TO WS-SAVE-ACCT-TYPE.                 00623000
006240 RM7102-LOOP.                                                     00624000
006250     MOVE SPACES TO WS-FUNCTION.                                  00625000
006260     MOVE SPACES TO MI7102-RECORD.                                00626000
006270     MOVE RPXXX02-KEY-INST TO MIM-7102KINST.                      00627000
006280     MOVE +7102 TO MIM-7102KREC.                                  00628000
006290     MOVE RPXXX02-KEY-MODEL TO MIM-7102KMODEL.                    00629000
006300     MOVE RPRF21-BASE-ACCT-PRODCODE TO MIM-7102KPRODCODE.         00630000
006310     MOVE RPXXX02-ACCT-TYPE TO MIM-7102KACCTTYPE.                 00631000
006320     MOVE MIC-RPS-7102-PRI TO MIC-MST-REC-PRI.                    00632000
006330     MOVE MI7102-RECORD TO MIMST-RECORD.                          00633000
006340     PERFORM MIC-MST-GET-REQUEST.                                 00634000
006350     MOVE MIMST-RECORD TO MI7102-RECORD.                          00635000
006360     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00636000
006370         AND RPRF21-BASE-ACCT-PRODCODE IS EQUAL TO SPACES         00637000
006380         AND RPXXX02-ACCT-TYPE IS EQUAL TO ZEROS                  00638000
006390         GO TO RM7102-END.                                        00639000
006400     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00640000
006410         AND RPXXX02-ACCT-TYPE IS NOT EQUAL TO ZEROS              00641000
006420         MOVE ZEROS TO RPXXX02-ACCT-TYPE                          00642000
006430         GO TO RM7102-LOOP.                                       00643000
006440     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00644000
006450         AND RPRF21-BASE-ACCT-PRODCODE IS NOT EQUAL TO SPACES     00645000
006460         MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE                 00646000
006470         GO TO RM7102-LOOP.                                       00647000
006480 RM7102-END.                                                      00648000
006490     MOVE WS-SAVE-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.          00649000
006500     MOVE WS-SAVE-ACCT-TYPE TO RPXXX02-ACCT-TYPE.                 00650000
006510 RM7102-EXIT.                                                     00651000
006520     EXIT.                                                        00652000
006530******************************************************************00653000
006540 READ-MICM-7104 SECTION.                                          00654000
006550 RM7104-START.                                                    00655000
006560     MOVE 'N' TO WS-KEEP-FLAG.                                    00656000
006570     MOVE SPACES TO WS-FUNCTION.                                  00657000
006580     MOVE SPACES TO MI7104-RECORD.                                00658000
006590     MOVE RPXXX02-KEY-INST TO MIM-7104KINST.                      00659000
006600     MOVE +7104 TO MIM-7104KREC.                                  00660000
006610     MOVE MIM-7101CUSTRELCD TO MIM-7104KRPREC.                    00661000
006620     MOVE MIC-RPS-7104-PRI TO MIC-MST-REC-PRI.                    00662000
006630     MOVE MI7104-RECORD TO MIMST-RECORD.                          00663000
006640     PERFORM MIC-MST-GET-REQUEST.                                 00664000
006650     MOVE MIMST-RECORD TO MI7104-RECORD.                          00665000
006660     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00666000
006670         GO TO RM7104-EXIT.                                       00667000
006680 RM7104-END.                                                      00668000
006690     PERFORM CHECK-REL-CODE.                                      00669000
006700 RM7104-EXIT.                                                     00670000
006710     EXIT.                                                        00671000
006720******************************************************************00672000
006730 READ-MICM-7107 SECTION.                                          00673000
006740 RM7107-START.                                                    00674000
006750     MOVE 'N' TO WS-KEEP-FLAG.                                    00675000
006760     MOVE SPACES TO MI7107-RECORD.                                00676000
006770     MOVE RPXXX02-KEY-INST TO MIM-7107KINST.                      00677000
006780     MOVE +7107 TO MIM-7107KREC.                                  00678000
006790     MOVE MIM-7102BRCHREGIONCD TO MIM-7107KRPREC.                 00679000
006800     MOVE MIC-RPS-7107-PRI TO MIC-MST-REC-PRI.                    00680000
006810     MOVE MI7107-RECORD TO MIMST-RECORD.                          00681000
006820     PERFORM MIC-MST-GET-REQUEST.                                 00682000
006830     MOVE MIMST-RECORD TO MI7107-RECORD.                          00683000
006840     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00684000
006850         GO TO RM7107-EXIT.                                       00685000
006860     PERFORM CHECK-BRANCH.                                        00686000
006870 RM7107-EXIT.                                                     00687000
006880     EXIT.                                                        00688000
006890******************************************************************00689000
006900 VALIDATE-PRIMARY-OPTION SECTION.                                 00690000
006910 VPO-START.                                                       00691000
006920     MOVE 'N' TO WS-PRIMOPT-FAIL.                                 00692000
006930     MOVE SPACES TO WS-FUNCTION.                                  00693000
006940     MOVE SPACES TO MI7102-RECORD.                                00694000
006950     MOVE LOW-VALUES TO MIM-7102GRP-KEY.                          00695000
006960     MOVE RPXXX02-KEY-INST TO MIM-7102KINST.                      00696000
006970     MOVE +7102 TO MIM-7102KREC.                                  00697000
006980     MOVE RPXXX02-KEY-MODEL TO MIM-7102KMODEL.                    00698000
006990     MOVE MIC-RPS-7102-PRI TO MIC-MST-REC-PRI.                    00699000
007000     MOVE MI7102-RECORD TO MIMST-RECORD.                          00700000
007010     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00701000
007020     GO TO VPO-TEST.                                              00702000
007030 VPO-FIND-NEXT.                                                   00703000
007040     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00704000
007050 VPO-TEST.                                                        00705000
007060     MOVE MIMST-RECORD TO MI7102-RECORD.                          00706000
007070     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00707000
007080         GO TO VPO-EXIT.                                          00708000
007090     IF MIM-7102KMODEL IS GREATER THAN RPXXX02-KEY-MODEL          00709000
007100         OR MIM-7102KINST IS NOT EQUAL TO RPXXX02-KEY-INST        00710000
007110         GO TO VPO-EXIT.                                          00711000
007120     IF MIM-7102PRIMARY IS NOT EQUAL TO 'Y'                       00712000
007130         GO TO VPO-FIND-NEXT.                                     00713000
007140     IF MIM-7102KPRODCODE IS EQUAL TO SPACES                      00714000
007150         AND MIM-7102KACCTTYPE IS EQUAL TO ZEROS                  00715000
007160         GO TO VPO-EXIT.                                          00716000
007170     MOVE RPRF21-BASE-ACCT-PRODCODE TO WS-SAVE-PRODCODE.          00717000
007180     MOVE RPXXX02-ACCT-TYPE TO WS-SAVE-ACCT-TYPE.                 00718000
007190     IF MIM-7102KPRODCODE IS EQUAL TO RPRF21-BASE-ACCT-PRODCODE   00719000
007200         AND (MIM-7102KACCTTYPE IS EQUAL TO ZEROS                 00720000
007210         OR MIM-7102KACCTTYPE IS EQUAL TO RPXXX02-ACCT-TYPE)      00721000
007220         GO TO VPO-EXIT.                                          00722000
007230     MOVE 'Y' TO WS-PRIMOPT-FAIL.                                 00723000
007240 VPO-EXIT.                                                        00724000
007250     EXIT.                                                        00725000
007260******************************************************************00726000
007270 CHECK-REL-CODE SECTION.                                          00727000
007280 CRELCD-START.                                                    00728000
007290     MOVE +0001 TO WS-SUB2.                                       00729000
007300     IF MIM-7104OPT IS EQUAL TO 'E'                               00730000
007310         GO TO CRELCD-EXCLUDE.                                    00731000
007320 CRELCD-INCLUDE.                                                  00732000
007330     IF WS-SUB2 IS GREATER THAN 0050                              00733000
007340         GO TO CRELCD-EXIT.                                       00734000
007350     IF MIM-7104RLSP (WS-SUB2) IS EQUAL TO ZEROS                  00735000
007360         OR MIM-7104RLSP (WS-SUB2) IS EQUAL TO SPACES             00736000
007370         GO TO CRELCD-EXIT.                                       00737000
007380     IF RPRF21-REL IS EQUAL TO MIM-7104RLSP (WS-SUB2)             00738000
007390         MOVE 'Y' TO WS-KEEP-FLAG                                 00739000
007400         GO TO CRELCD-EXIT.                                       00740000
007410     ADD +0001 TO WS-SUB2.                                        00741000
007420     GO TO CRELCD-INCLUDE.                                        00742000
007430 CRELCD-EXCLUDE.                                                  00743000
007440     IF WS-SUB2 IS GREATER THAN 0050                              00744000
007450         MOVE 'Y' TO WS-KEEP-FLAG                                 00745000
007460         GO TO CRELCD-EXIT.                                       00746000
007470     IF MIM-7104RLSP (WS-SUB2) IS EQUAL TO ZEROS                  00747000
007480         OR MIM-7104RLSP (WS-SUB2) IS EQUAL TO SPACES             00748000
007490         MOVE 'Y' TO WS-KEEP-FLAG                                 00749000
007500         GO TO CRELCD-EXIT.                                       00750000
007510     IF RPRF21-REL IS EQUAL TO MIM-7104RLSP (WS-SUB2)             00751000
007520         GO TO CRELCD-EXIT.                                       00752000
007530     ADD +0001 TO WS-SUB2.                                        00753000
007540     GO TO CRELCD-EXCLUDE.                                        00754000
007550 CRELCD-EXIT.                                                     00755000
007560     EXIT.                                                        00756000
007570******************************************************************00757000
007580 CHECK-BRANCH SECTION.                                            00758000
007590 CBRANCH-START.                                                   00759000
007600     MOVE +0001 TO WS-SUB2.                                       00760000
007610     IF MIM-7107OPT IS EQUAL TO 'E'                               00761000
007620         GO TO CBRANCH-EXCLUDE.                                   00762000
007630 CBRANCH-INCLUDE.                                                 00763000
007640     IF WS-SUB2 IS GREATER THAN 0050                              00764000
007650         GO TO CBRANCH-EXIT.                                      00765000
007660     IF MIM-7107BRCHREGION (WS-SUB2) IS EQUAL TO ZEROS            00766000
007670         GO TO CBRANCH-EXIT.                                      00767000
007680     IF RPXXX02-BRANCH IS EQUAL TO MIM-7107BRCHREGION (WS-SUB2)   00768000
007690         MOVE 'Y' TO WS-KEEP-FLAG                                 00769000
007700         GO TO CBRANCH-EXIT.                                      00770000
007710     ADD +0001 TO WS-SUB2.                                        00771000
007720     GO TO CBRANCH-INCLUDE.                                       00772000
007730 CBRANCH-EXCLUDE.                                                 00773000
007740     IF WS-SUB2 IS GREATER THAN 0050                              00774000
007750         MOVE 'Y' TO WS-KEEP-FLAG                                 00775000
007760         GO TO CBRANCH-EXIT.                                      00776000
007770     IF MIM-7107BRCHREGION (WS-SUB2) IS EQUAL TO ZEROS            00777000
007780         MOVE 'Y' TO WS-KEEP-FLAG                                 00778000
007790         GO TO CBRANCH-EXIT.                                      00779000
007800     IF RPXXX02-BRANCH IS EQUAL TO MIM-7107BRCHREGION (WS-SUB2)   00780000
007810         GO TO CBRANCH-EXIT.                                      00781000
007820     ADD +0001 TO WS-SUB2.                                        00782000
007830     GO TO CBRANCH-EXCLUDE.                                       00783000
007840 CBRANCH-EXIT.                                                    00784000
007850     EXIT.                                                        00785000
007860******************************************************************00786000
007870 LINK-INTERFACE SECTION.                                          00787000
007880 LINT-START.                                                      00788000
007890     MOVE MIM-237OLINTFC TO WS-PROGRAM.                           00789000
007900     MOVE RPXXX02-KEY-INST TO RPINF00-INST.                       00790000
007910     MOVE RPXXX02-KEY-ACCOUNT TO RPINF00-ACCOUNT.                 00791000
007920     MOVE RPXXX02-KEY-PRODCODE TO RPINF00-PRODCODE.               00792000
007930     MOVE MIM-2023INTAPPL211 TO RPINF00-APPLR.                    00793000
007940     MOVE MIM-7101CLOSEDACCTOPT TO RPINF00-CLOSEDACCTOPT.         00794000
007950     MOVE RPXXX02-CONTROLS TO RPINF00-CONTROLS.                   00795000
007960     MOVE ZEROS TO RPINF00-ABORT.                                 00796000
007970     MOVE 'N' TO RPINF00-GLOBAL-CLOSE.                            00797000
007980     EXEC CICS LINK                                               00798000
007990         PROGRAM(WS-PROGRAM)                                      00799000
008000         COMMAREA(RPINF00-MESSAGE)                                00800000
008010         LENGTH(LENGTH OF RPINF00-MESSAGE)                        00801000
008020         RESP(WS-CICS-RESPONSE)                                   00802000
008030         END-EXEC.                                                00803000
008040     MOVE RPINF00-FUNCTION TO WS-FUNCTION.                        00804000
008050     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00805000
008060         MOVE 'L' TO WS-FUNCTION                                  00806000
008070         MOVE 500039 TO RPXXX02-MSGNBR                            00807000
008080         GO TO LINT-EXIT.                                         00808000
008090     IF WS-FUNCTION IS EQUAL TO 'L'                               00809000
008100         MOVE 500040 TO RPXXX02-MSGNBR                            00810000
008110         GO TO LINT-EXIT.                                         00811000
008120     IF WS-FUNCTION IS EQUAL TO 'C'                               00812000
008130         MOVE 500041 TO RPXXX02-MSGNBR                            00813000
008140         GO TO LINT-EXIT.                                         00814000
008150     IF RPINF00-ABORT IS NOT EQUAL TO ZEROS                       00815000
008160         MOVE RPINF00-ABORT TO RPXXX02-ABORT                      00816000
008170         MOVE RPINF00-ABTRACE TO RPXXX02-ABTRACE                  00817000
008180         GO TO LINT-EXIT.                                         00818000
008190     MOVE 'Y' TO WS-INTERFACE.                                    00819000
008200 LINT-EXIT.                                                       00820000
008210     EXIT.                                                        00821000
008220******************************************************************00822000
008230 USER-EXIT SECTION.                                               00823000
008240 UEXIT-START.                                                     00824000
008250     MOVE SPACES TO RPUSER-MESSAGE.                               00825000
008260     IF WS-INTERFACE IS NOT EQUAL TO 'Y'                          00826000
008270         GO TO UEXIT-CONT.                                        00827000
008280     MOVE RPINF00-KEY-AREAS TO RPUSER-KEY-AREAS.                  00828000
008290     MOVE RPINF00-USER-INFO TO RPUSER-USER-INFO.                  00829000
008300     MOVE RPINF00-MISC-INFO TO RPUSER-MISC-INFO.                  00830000
008310     MOVE RPINF00-BAL-INFO TO RPUSER-BAL-INFO.                    00831000
008320     GO TO UEXIT-CALL.                                            00832000
008330 UEXIT-CONT.                                                      00833000
008340     MOVE RPXXX02-KEY-INST TO RPUSER-INST.                        00834000
008350     MOVE RPRF21-BASE-ACCT-PRODCODE TO RPUSER-PRODCODE.           00835000
008360     MOVE RPRF21-BASE-ACCT TO RPUSER-ACCOUNT.                     00836000
008370     MOVE MIM-2023INTAPPL211 TO RPUSER-APPLR.                     00837000
008380     INITIALIZE RPUSER-GRP-DATA.                                  00838000
008390 UEXIT-CALL.                                                      00839000
000000     CALL 'RPBUSER' USING                                         00840000
008410         RPUSER-MESSAGE                                           00841000
008420         WS-FUNCTION.                                             00842000
008430 UEXIT-EXIT.                                                      00843000
008440     EXIT.                                                        00844000
008450******************************************************************00845000
008460 CREATE-IDNUMBER SECTION.                                         00846000
008470 CID-START.                                                       00847000
008480     EXEC CICS ASKTIME                                            00848000
008490         END-EXEC.                                                00849000
008500     MOVE WS-CURDT-YYYYMMDD TO WS-IDNBR-DATE.                     00850000
008510     MOVE EIBTIME TO WS-IDNBR-TIME.                               00851000
008520     MOVE ZEROES TO WS-IDNBR-SEQ.                                 00852000
008530     MOVE RPXXX02-KEY-INST TO RPQUA-INST.                         00853000
008540     MOVE WS-IDNBR-GRP TO RPXXX02-IDNUMBER.                       00854000
008550 CID-EXIT.                                                        00855000
008560     EXIT.                                                        00856000
008570******************************************************************00857000
008580 WRITE-QUA-RECORD SECTION.                                        00858000
008590 WQUA-START.                                                      00859000
008600     MOVE ZERO TO WS-SUB1.                                        00860000
008610     MOVE RPXXX02-KEY-INST TO MIM-2023KINST.                      00861000
008620     MOVE 'RP' TO MIM-2023KPRODCODE.                              00862000
008630     MOVE RPXXX02-INST-OPT-1 TO SLW096-BANKS.                     00863000
008640     PERFORM SLP096-GET-2023-RECORD.                              00864000
008650     IF SLW096-FUNCTION IS EQUAL TO SPACES                        00865000
008660         MOVE MIM-2023KPRODCODE TO RPXXX02-RP-PRODCODE            00866000
008670         GO TO FRPR-IDX.                                          00867000
008680 FRPR-PRODCD-LOOP.                                                00868000
008690     ADD +1 TO WS-SUB1.                                           00869000
008700     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00870000
008710         MOVE WS-AB3051 TO RPXXX02-ABORT                          00871000
008720         MOVE WS-TR0008 TO RPXXX02-ABTRACE                        00872000
008730         GO TO CICS-RETURN.                                       00873000
008740     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00874000
008750         IS NOT EQUAL TO RPXXX02-APPL                             00875000
008760         GO TO FRPR-PRODCD-LOOP.                                  00876000
008770     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO RPXXX02-RP-PRODCODE.  00877000
008780 FRPR-IDX.                                                        00878000
008790     INITIALIZE RPIDX-RECORD.                                     00879000
008800     MOVE RPXXX02-KEY-INST TO RPIDX-INST.                         00880000
008810     MOVE RPXXX02-RP-PRODCODE TO RPIDX-PRODCODE.                  00881000
008820     MOVE RPXXX02-IDNUMBER TO RPIDX-IDNUMBER.                     00882000
008830     MOVE RPXXX02-IDNUMBER TO WS-IDNBR-GRP.                       00883000
008840     MOVE RPXXX02-KEY-RECORD TO RPIDX-ACCT2-KEY.                  00884000
008850 FRPR-IDX-ADD.                                                    00885000
008860     PERFORM RPS-IDX-PUT-REQUEST.                                 00886000
008870     IF WS-FUNCTION IS EQUAL TO '='                               00887000
008880         ADD +0001 TO WS-IDNBR-SEQ                                00888000
008890         MOVE WS-IDNBR-GRP TO RPIDX-IDNUMBER                      00889000
008900         MOVE 'Y' TO RPXXX02-IDNBR-CHANGE                         00890000
008910         GO TO FRPR-IDX-ADD.                                      00891000
008920     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00892000
008930         MOVE WS-AB6310 TO RPXXX02-ABORT                          00893000
008940         MOVE WS-TR0009 TO RPXXX02-ABTRACE                        00894000
008950         GO TO CICS-RETURN.                                       00895000
008960     MOVE 'Y' TO WS-UPDATESW.                                     00896000
008970     MOVE RPIDX-IDNUMBER TO RPXXX02-IDNUMBER.                     00897000
008980 FRPR-QUA.                                                        00898000
008990     INITIALIZE RPQUA-RECORD.                                     00899000
009000     MOVE RPXXX02-KEY-RECORD TO RPQUA-GRP-KEY.                    00900000
009010     MOVE RPXXX02-CUST-KEY TO RPQUA-RCIF-KEY.                     00901000
009020     MOVE RPXXX02-CUST-NAME TO RPQUA-CUST-NAME.                   00902000
009030     MOVE WS-CURDT-YYYYMMDD TO RPQUA-DATE-OPENED.                 00903000
009040     MOVE RPXXX02-KEY-MODEL TO RPQUA-MODEL.                       00904000
009050     MOVE RPXXX02-IDNUMBER TO RPQUA-IDNUMBER.                     00905000
009060     MOVE RPXXX02-BRANCH TO RPQUA-BRANCH.                         00906000
009070     MOVE RPXXX02-ACCT-TYPE TO RPQUA-ACCT-TYPE.                   00907000
009080     MOVE RPXXX02-ENROLL-ATTEMPTS TO RPQUA-ENROLLATTEMPTS.        00908000
009090     PERFORM RPS-QUA-PUT-REQUEST.                                 00909000
009100     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00910000
009110         MOVE WS-AB6325 TO RPXXX02-ABORT                          00911000
009120         MOVE WS-TR0010 TO RPXXX02-ABTRACE                        00912000
009130         GO TO CICS-RETURN.                                       00913000
009140     MOVE 'Y' TO WS-UPDATESW.                                     00914000
009150 WQUA-EXIT.                                                       00915000
009160     EXIT.                                                        00916000
009170******************************************************************00917000
009180 REQUEST-CUSTOMER SECTION.                                        00918000
009190 RC-START.                                                        00919000
009200     MOVE SPACES TO RPRF21-FUNCTION.                              00920000
009210     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             00921000
009220     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         00922000
009230     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          00923000
009240     EXEC CICS LINK                                               00924000
009250         PROGRAM('RPO0RF21')                                      00925000
009260         COMMAREA(RPRF21-MESSAGE)                                 00926000
009270         LENGTH(LENGTH OF RPRF21-MESSAGE)                         00927000
009280         RESP(WS-CICS-RESPONSE)                                   00928000
009290         END-EXEC.                                                00929000
009300     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         00930000
009310     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00931000
009320         MOVE 'L' TO WS-FUNCTION                                  00932000
009330         MOVE 500036 TO RPXXX02-MSGNBR                            00933000
009340         GO TO RC-EXIT.                                           00934000
009350     IF WS-FUNCTION IS EQUAL TO 'B'                               00935000
009360         MOVE 500045 TO RPXXX02-MSGNBR                            00936000
009370         GO TO RC-EXIT.                                           00937000
009380     IF WS-FUNCTION IS EQUAL TO 'C'                               00938000
009390         MOVE 500037 TO RPXXX02-MSGNBR                            00939000
009400         GO TO RC-EXIT.                                           00940000
009410     IF WS-FUNCTION IS EQUAL TO 'I'                               00941000
009420         MOVE 500038 TO RPXXX02-MSGNBR.                           00942000
009430 RC-EXIT.                                                         00943000
009440     EXIT.                                                        00944000
009450******************************************************************00945000
000000 COPY RPPACTA.                                                    00946000
009470******************************************************************00947000
000000 COPY RPPIDXA.                                                    00948000
009490******************************************************************00949000
000000 COPY RPPMSTA.                                                    00950000
009510******************************************************************00951000
000000 COPY RPPQUAA.                                                    00952000
009530******************************************************************00953000
009540 MIC-MST-API SECTION.                                             00954000
000000 COPY MIPMSTA.                                                    00955000
009560******************************************************************00956000
009570 CALENDAR-365 SECTION.                                            00957000
000000 COPY SRP003.                                                     00958000
009590******************************************************************00959000
009600 LEFT-JUSTIFY SECTION.                                            00960000
000000 COPY SRP025.                                                     00961000
009620******************************************************************00962000
009630 RIGHT-JUSTIFY SECTION.                                           00963000
000000 COPY SRP026.                                                     00964000
009650******************************************************************00965000
009660 SLP096-GET-2023-RECORD SECTION.                                  00966000
000000 COPY SLP096.                                                     00967000
009680******************************************************************00968000
009690 OPERATOR-DIALOG-SECURITY SECTION.                                00969000
000000 COPY SRP079.                                                     00970000
009710******************************************************************00971000
009720 CICS-ABORT-EXIT SECTION.                                         00972000
009730 CAE-START.                                                       00973000
009740     GO TO CICS-RETURN.                                           00974000
009750 CAE-EXIT.                                                        00975000
009760     EXIT.                                                        00976000
009770******************************************************************00977000
009780 CICS-RETURN SECTION.                                             00978000
009790     IF COM-ABORT IS NOT EQUAL TO ZERO                            00979000
009800         MOVE COM-ABORT TO RPXXX02-ABORT.                         00980000
009810     IF RPXXX02-ABORT IS NOT EQUAL TO ZERO                        00981000
009820         AND WS-UPDATESW IS EQUAL TO 'Y'                          00982000
009830         MOVE 'Y' TO RPXXX02-ABTYPE.                              00983000
009840     IF RPXXX02-ABORT IS NOT EQUAL TO ZERO                        00984000
009850         MOVE WS-FUNCTION TO RPXXX02-FUNCTION                     00985000
009860         MOVE SRB-BMDB TO RPXXX02-SRBMDB                          00986000
009870         MOVE EIBFN TO RPXXX02-ABEIBFN                            00987000
009880         MOVE EIBRESP TO RPXXX02-ABEIBRESP                        00988000
009890         MOVE EIBRESP2 TO RPXXX02-ABEIBRESP2                      00989000
009900         MOVE EIBRCODE TO RPXXX02-ABEIBRCODE.                     00990000
009910     IF RPXXX02-ABTYPE IS NOT EQUAL TO 'Y'                        00991000
009920         PERFORM GLOBAL-CLOSE.                                    00992000
000000 COPY SLP709.                                                     00993000
009940******************************************************************00994000
009950 GLOBAL-CLOSE SECTION.                                            00995000
009960 GC-START.                                                        00996000
009970     IF RPXXX02-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  00997000
009980         PERFORM RPS-MST-GLOBAL-CLOSE-REQUEST.                    00998000
009990 GC-EXIT.                                                         00999000
010000     EXIT.                                                        01000000
010010******************************************************************01001000
