000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX11.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX11 - SECONDARY SERVICES INQUIRY MODULE                *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW079-AREAS.                                                00016000
000000 COPY SRW079.                                                     00017000
000180 01  SRW105-AREAS.                                                00018000
000000 COPY SRW105.                                                     00019000
000200*01  BICRSRB.                                                     00020000
000000 COPY BICRSRB.                                                    00021000
000220*01  BICRPSB.                                                     00022000
000000 COPY BICRPSB.                                                    00023000
000240*01  BICRVERB.                                                    00024000
000000 COPY BICRVERB.                                                   00025000
000260*01  BICRSTAT.                                                    00026000
000000 COPY BICRSTAT.                                                   00027000
000280*01  BICRDBS.                                                     00028000
000000 COPY BICRDBS.                                                    00029000
000300*01  BICRLOG.                                                     00030000
000000 COPY BICRLOG.                                                    00031000
000320 01  SRW710-AREAS.                                                00032000
000000 COPY SRW710.                                                     00033000
000340 01  WS-WORKAREAS.                                                00034000
000350     03  COM-ABORT               PIC S9(04)      COMP.            00035000
000360     03  WS-SUB1                 PIC S9(04)      COMP             00036000
000370                                                 VALUE +0000.     00037000
000380     03  WS-SERVICES             PIC S9(05)      COMP-3           00038000
000390                                                 VALUE ZEROS.     00039000
000400     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00040000
000410     03  FILLER          REDEFINES WS-CURDATE.                    00041000
000420         05  WS-CURMM            PIC 9(02).                       00042000
000430         05  WS-CURDD            PIC 9(02).                       00043000
000440         05  WS-CURYYYY          PIC 9(04).                       00044000
000450     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00045000
000460     03  FILLER          REDEFINES WS-PDATE.                      00046000
000470         05  WS-PDATE-YYYY       PIC 9(04).                       00047000
000480         05  WS-PDATE-MM         PIC 9(02).                       00048000
000490         05  WS-PDATE-DD         PIC 9(02).                       00049000
000500     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00050000
000510     03  FILLER          REDEFINES WS-PDATE2.                     00051000
000520         05  WS-PDATE2-YYYY      PIC 9(04).                       00052000
000530         05  WS-PDATE2-MM        PIC 9(02).                       00053000
000540         05  WS-PDATE2-DD        PIC 9(02).                       00054000
000550     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00055000
000560                                                 VALUE ZERO.      00056000
000570*----------------------------------------------------------------*00057000
000580 01  MIWPRI-AREAS.                                                00058000
000000 COPY MIWPRI.                                                     00059000
000600 01  MIWMSTA-AREAS.                                               00060000
000000 COPY MIWMSTA.                                                    00061000
000620 01  MIMST-RECORD.                                                00062000
000000 COPY MISMST.                                                     00063000
000640 01  MI7108-RECORD.                                               00064000
000000 COPY MIS7108.                                                    00065000
000660*----------------------------------------------------------------*00066000
000670 01  RPWPRI-AREAS.                                                00067000
000000 COPY RPWPRI.                                                     00068000
000690 01  RPWACT-AREA.                                                 00069000
000000 COPY RPWACTA.                                                    00070000
000710 01  RPACT-RECORD.                                                00071000
000000 COPY RPSACT.                                                     00072000
000730 01  RPWSEC-AREA.                                                 00073000
000000 COPY RPWSECA.                                                    00074000
000750 01  RPSEC-RECORD.                                                00075000
000000 COPY RPSSEC.                                                     00076000
000770*----------------------------------------------------------------*00077000
000780 01  WS-TRACECODES.                                               00078000
000790     03  WS-TR0001               PIC S9(04)      COMP             00079000
000800                                                 VALUE +0001.     00080000
000810     03  WS-TR0002               PIC S9(04)      COMP             00081000
000820                                                 VALUE +0002.     00082000
000830     03  WS-TR0003               PIC S9(04)      COMP             00083000
000840                                                 VALUE +0003.     00084000
000850     03  WS-TR0004               PIC S9(04)      COMP             00085000
000860                                                 VALUE +0004.     00086000
000870     03  WS-TR0005               PIC S9(04)      COMP             00087000
000880                                                 VALUE +0005.     00088000
000890 01  WS-ABORTCODES.                                               00089000
000900     03  WS-AB2000               PIC S9(04)      COMP             00090000
000910                                                 VALUE +2000.     00091000
000920     03  WS-AB2033               PIC S9(04)      COMP             00092000
000930                                                 VALUE +2033.     00093000
000940     03  WS-AB6300               PIC S9(04)      COMP             00094000
000950                                                 VALUE +6300.     00095000
000960     03  WS-AB6335               PIC S9(04)      COMP             00096000
000970                                                 VALUE +6335.     00097000
000980******************************************************************00098000
000990 01  SLW096-AREAS.                                                00099000
000000 COPY SLW096.                                                     00100000
001010******************************************************************00101000
001020 LINKAGE SECTION.                                                 00102000
001030 01  DFHCOMMAREA.                                                 00103000
000000 COPY MISCNT00      REPLACING                                     00104000
001050             ==:MICNT:== BY ==RPXXX11==.                          00105000
000000 COPY RPSXXX11.                                                   00106000
001070*01  SLW096-2023RECORDS.                                          00107000
000000 COPY SLW096L.                                                    00108000
001090******************************************************************00109000
001100 PROCEDURE DIVISION.                                              00110000
001110******************************************************************00111000
001120 ENTRY-ROUTINE SECTION.                                           00112000
001130 ER-START.                                                        00113000
001140     MOVE 'RPLXXX11' TO SR-APIPROGLIT.                            00114000
001150     MOVE 'RPLXXX11' TO RPXXX11-ABPROGID.                         00115000
001160     PERFORM CICS-HANDLE-CONDITION.                               00116000
001170     IF EIBCALEN IS EQUAL TO +0                                   00117000
001180         MOVE WS-AB2000 TO RPXXX11-ABORT                          00118000
001190         MOVE WS-TR0001 TO RPXXX11-ABTRACE                        00119000
001200         GO TO CICS-RETURN.                                       00120000
001210     MOVE ZERO TO RPXXX11-MSGNBR.                                 00121000
001220     MOVE SPACE TO WS-FUNCTION.                                   00122000
001230     MOVE RPXXX11-FILEOPTS TO WS-FILEOPTS.                        00123000
001240     MOVE RPXXX11-OPERID TO WS-UPD-USER.                          00124000
001250     MOVE RPXXX11-EXTERNALID TO LOG-PANELID.                      00125000
001260     MOVE RPXXX11-TERMID TO LOG-TERMID.                           00126000
001270     MOVE RPXXX11-WORKID TO LOG-WORKID.                           00127000
001280     MOVE RPXXX11-TRANSTART TO LOG-TRANSTART.                     00128000
001290     MOVE RPXXX11-APPLSEQ TO LOG-APPLSEQ.                         00129000
000000 COPY SLP094.                                                     00130000
001310     GO TO VERIFY-KEY.                                            00131000
001320 ER-EXIT.                                                         00132000
001330     EXIT.                                                        00133000
001340******************************************************************00134000
001350 CICS-HANDLE-CONDITION SECTION.                                   00135000
000000 COPY SLP702.                                                     00136000
001370     MOVE WS-AB2033 TO RPXXX11-ABORT.                             00137000
001380     MOVE WS-TR0002 TO RPXXX11-ABTRACE.                           00138000
001390     GO TO CICS-RETURN.                                           00139000
001400 CHC-EXIT.                                                        00140000
001410     EXIT.                                                        00141000
001420******************************************************************00142000
001430 VERIFY-KEY SECTION.                                              00143000
001440 VK-START.                                                        00144000
001450     MOVE ZERO TO COM-ABORT.                                      00145000
001460     MOVE ZERO TO RPXXX11-ABORT.                                  00146000
001470     MOVE ZERO TO RPXXX11-MSGNBR.                                 00147000
001480     MOVE SPACES TO RPXXX11-FUNCTION.                             00148000
001490     MOVE RPXXX11-DATE TO WS-CURDATE.                             00149000
001500     MOVE WS-CURMM TO WS-PDATE-MM.                                00150000
001510     MOVE WS-CURDD TO WS-PDATE-DD.                                00151000
001520     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00152000
001530     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00153000
001540 VK-NBR-OCCURS.                                                   00154000
001550     IF RPXXX11-NBR-OCCURS-DCHG IS EQUAL TO 'N'                   00155000
001560         OR RPXXX11-NBR-OCCURS-DCHG IS EQUAL TO 'E'               00156000
001570         MOVE 000002 TO RPXXX11-MSGNBR                            00157000
001580         MOVE 'E' TO RPXXX11-NBR-OCCURS-DCHG                      00158000
001590         GO TO VK-ERROR.                                          00159000
001600     IF RPXXX11-NBR-OCCURS IS NOT NUMERIC                         00160000
001610         OR RPXXX11-NBR-OCCURS IS EQUAL TO ZEROS                  00161000
001620         MOVE +20 TO RPXXX11-NBR-OCCURS.                          00162000
001630     IF RPXXX11-NBR-OCCURS IS GREATER THAN +20                    00163000
001640         OR RPXXX11-NBR-OCCURS IS LESS THAN ZEROS                 00164000
001650         MOVE +20 TO RPXXX11-NBR-OCCURS.                          00165000
001660 VK-SELECTKEY.                                                    00166000
001670     IF RPXXX11-SK-INST-DCHG IS EQUAL TO 'N'                      00167000
001680         OR RPXXX11-SK-INST-DCHG IS EQUAL TO 'E'                  00168000
001690         MOVE 000002 TO RPXXX11-MSGNBR                            00169000
001700         MOVE 'E' TO RPXXX11-SK-INST-DCHG                         00170000
001710         GO TO VK-ERROR.                                          00171000
001720     IF RPXXX11-SK-INST IS NOT NUMERIC                            00172000
001730         OR RPXXX11-SK-INST IS EQUAL TO ZEROS                     00173000
001740         MOVE 000002 TO RPXXX11-MSGNBR                            00174000
001750         MOVE 'E' TO RPXXX11-SK-INST-DCHG                         00175000
001760         GO TO VK-ERROR.                                          00176000
001770     IF RPXXX11-SK-PRODCODE-DCHG IS EQUAL TO 'N'                  00177000
001780         OR RPXXX11-SK-PRODCODE-DCHG IS EQUAL TO 'E'              00178000
001790         MOVE 000002 TO RPXXX11-MSGNBR                            00179000
001800         MOVE 'E' TO RPXXX11-SK-PRODCODE-DCHG                     00180000
001810         GO TO VK-ERROR.                                          00181000
001820     IF RPXXX11-SK-PRODCODE IS EQUAL TO SPACES                    00182000
001830         OR RPXXX11-SK-PRODCODE IS EQUAL TO LOW-VALUES            00183000
001840         MOVE 000002 TO RPXXX11-MSGNBR                            00184000
001850         MOVE 'E' TO RPXXX11-SK-PRODCODE-DCHG                     00185000
001860         GO TO VK-ERROR.                                          00186000
001870     IF RPXXX11-SK-ACCOUNT-DCHG IS EQUAL TO 'N'                   00187000
001880         OR RPXXX11-SK-ACCOUNT-DCHG IS EQUAL TO 'E'               00188000
001890         MOVE 000002 TO RPXXX11-MSGNBR                            00189000
001900         MOVE 'E' TO RPXXX11-SK-ACCOUNT-DCHG                      00190000
001910         GO TO VK-ERROR.                                          00191000
001920     IF RPXXX11-SK-ACCOUNT IS EQUAL TO SPACES                     00192000
001930         OR RPXXX11-SK-ACCOUNT IS EQUAL TO LOW-VALUES             00193000
001940         MOVE 000002 TO RPXXX11-MSGNBR                            00194000
001950         MOVE 'E' TO RPXXX11-SK-ACCOUNT-DCHG                      00195000
001960         GO TO VK-ERROR.                                          00196000
001970     IF RPXXX11-SK-MODEL-DCHG IS EQUAL TO 'E'                     00197000
001980         MOVE 000002 TO RPXXX11-MSGNBR                            00198000
001990         MOVE 'E' TO RPXXX11-SK-MODEL-DCHG                        00199000
002000         GO TO VK-ERROR.                                          00200000
002010     IF RPXXX11-SK-MODEL-DCHG IS EQUAL TO 'N'                     00201000
002020         OR RPXXX11-SK-MODEL IS EQUAL TO LOW-VALUES               00202000
002030         MOVE SPACES TO RPXXX11-SK-MODEL.                         00203000
002040 VK-SECURITY.                                                     00204000
002050     MOVE RPXXX11-UPDATE TO SR-OPDUPDATE.                         00205000
002060     MOVE RPXXX11-SK-INST TO SR-OPDINST.                          00206000
002070     MOVE RPXXX11-OPERID TO SR-OPDOPERID.                         00207000
002080     MOVE RPXXX11-MODELID TO SR-OPDMODELID.                       00208000
002090     MOVE RPXXX11-EXTERNALID TO SR-OPDTRANCODE.                   00209000
002100     MOVE RPXXX11-APPL TO SR-OPDAPPL.                             00210000
002110     MOVE RPXXX11-SECALT TO SR-OPDSECALT.                         00211000
002120     MOVE RPXXX11-FUNC TO SR-OPDFUNC.                             00212000
002130     PERFORM OPERATOR-DIALOG-SECURITY.                            00213000
002140     MOVE SR-OPDUPDATE TO RPXXX11-UPDATE.                         00214000
002150     IF SR-OPDMSGNBR IS NOT EQUAL TO ZEROS                        00215000
002160         MOVE SR-OPDMSGNBR TO RPXXX11-MSGNBR                      00216000
002170         GO TO VK-ERROR.                                          00217000
002180 VK-ACT.                                                          00218000
002190     MOVE ZEROS TO WS-SERVICES.                                   00219000
002200     MOVE SPACE TO RPXXX11-END-FILE-INST.                         00220000
002210     INITIALIZE RPXXX11-RECORD.                                   00221000
002220     MOVE ALL 'N' TO RPXXX11-DATA-GRP-DCHG.                       00222000
002230     MOVE RPXXX11-SK-INST TO RPACT-INST.                          00223000
002240     MOVE RPXXX11-SK-PRODCODE TO RPACT-PRODCODE.                  00224000
002250     MOVE RPXXX11-SK-ACCOUNT TO RPACT-ACCOUNT.                    00225000
002260     PERFORM RPS-ACT-GET-REQUEST.                                 00226000
002270     IF WS-FUNCTION IS EQUAL TO 'N'                               00227000
002280         MOVE 500076 TO RPXXX11-MSGNBR                            00228000
002290         MOVE ZEROS TO RPXXX11-NBR-OCCURS                         00229000
002300         MOVE 'Y' TO RPXXX11-NBR-OCCURS-DCHG                      00230000
002310         MOVE 'E' TO RPXXX11-END-FILE-INST                        00231000
002320         MOVE 'Y' TO RPXXX11-END-FILE-INST-DCHG                   00232000
002330         MOVE 'E' TO RPXXX11-SK-INST-DCHG                         00233000
002340         MOVE 'E' TO RPXXX11-SK-PRODCODE-DCHG                     00234000
002350         MOVE 'E' TO RPXXX11-SK-ACCOUNT-DCHG                      00235000
002360         MOVE 'E' TO RPXXX11-SK-MODEL-DCHG                        00236000
002370         GO TO VK-ERROR.                                          00237000
002380     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00238000
002390         MOVE WS-AB6300 TO RPXXX11-ABORT                          00239000
002400         MOVE WS-TR0003 TO RPXXX11-ABTRACE                        00240000
002410         GO TO VK-ERROR.                                          00241000
002420     MOVE LOW-VALUES TO RPSEC-GRP-KEY.                            00242000
002430     MOVE RPXXX11-SK-INST TO RPSEC-INST.                          00243000
002440     MOVE RPXXX11-SK-PRODCODE TO RPSEC-PRODCODE.                  00244000
002450     MOVE RPXXX11-SK-ACCOUNT TO RPSEC-ACCOUNT.                    00245000
002460     MOVE RPXXX11-SK-MODEL TO RPSEC-MODEL2.                       00246000
002470     PERFORM RPS-SEC-GET-GE-REQUEST.                              00247000
002480     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00248000
002490         MOVE WS-AB6335 TO RPXXX11-ABORT                          00249000
002500         MOVE WS-TR0004 TO RPXXX11-ABTRACE                        00250000
002510         GO TO VK-ERROR.                                          00251000
002520     IF RPXXX11-SK-INST IS NOT EQUAL TO RPSEC-INST                00252000
002530         OR RPXXX11-SK-PRODCODE IS NOT EQUAL TO RPSEC-PRODCODE    00253000
002540         OR RPXXX11-SK-ACCOUNT IS NOT EQUAL TO RPSEC-ACCOUNT      00254000
002550         MOVE WS-AB6335 TO RPXXX11-ABORT                          00255000
002560         MOVE WS-TR0005 TO RPXXX11-ABTRACE                        00256000
002570         GO TO VK-ERROR.                                          00257000
002580     MOVE ZEROS TO WS-SUB1.                                       00258000
002590     MOVE ZEROS TO WS-SERVICES.                                   00259000
002600 VK-ACT-TEST.                                                     00260000
002610     ADD +1 TO WS-SUB1.                                           00261000
002620     IF WS-SUB1 IS GREATER THAN +20                               00262000
002630         GO TO VK-DONE.                                           00263000
002640     IF RPACT-SECSERV (WS-SUB1) IS EQUAL TO SPACES                00264000
002650         GO TO VK-ACT-TEST.                                       00265000
002660     ADD +0001 TO WS-SERVICES.                                    00266000
002670     IF WS-SERVICES IS GREATER THAN RPXXX11-NBR-OCCURS            00267000
002680         MOVE 'E' TO RPXXX11-END-FILE-INST                        00268000
002690         MOVE 'Y' TO RPXXX11-END-FILE-INST-DCHG                   00269000
002700         GO TO VK-END.                                            00270000
002710 VK-7108-READ.                                                    00271000
002720     MOVE SPACES TO MI7108-RECORD.                                00272000
002730     IF RPSEC-INST2 IS EQUAL TO ZEROS                             00273000
002740         MOVE RPXXX11-SK-INST TO MIM-7108KINST                    00274000
002750     ELSE                                                         00275000
002760         MOVE RPSEC-INST2 TO MIM-7108KINST.                       00276000
002770     MOVE +7108 TO MIM-7108KREC.                                  00277000
002780     MOVE RPACT-SECSERV (WS-SUB1) TO MIM-7108KSECSVC.             00278000
002790     MOVE MIC-RPS-7108-PRI TO MIC-MST-REC-PRI.                    00279000
002800     MOVE MI7108-RECORD TO MIMST-RECORD.                          00280000
002810     PERFORM MIC-MST-GET-REQUEST.                                 00281000
002820     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00282000
002830         MOVE 'No Description Found' TO MIM-7108DESC              00283000
002840     ELSE                                                         00284000
002850         MOVE MIMST-RECORD TO MI7108-RECORD.                      00285000
002860     MOVE RPACT-SECSERV (WS-SUB1) TO                              00286000
002870         RPXXX11-SECSVC (WS-SERVICES).                            00287000
002880     MOVE MIM-7108DESC TO RPXXX11-DESC (WS-SERVICES).             00288000
002890     MOVE 'Y' TO RPXXX11-SECSVC-DCHG (WS-SERVICES).               00289000
002900     MOVE 'Y' TO RPXXX11-DESC-DCHG (WS-SERVICES).                 00290000
002910     GO TO VK-ACT-TEST.                                           00291000
002920 VK-DONE.                                                         00292000
002930     MOVE WS-SERVICES TO RPXXX11-NBR-OCCURS.                      00293000
002940     MOVE 'Y' TO RPXXX11-NBR-OCCURS-DCHG.                         00294000
002950     IF RPXXX11-NBR-OCCURS IS EQUAL TO ZEROS                      00295000
002960         AND RPXXX11-MSGNBR IS EQUAL TO ZEROS                     00296000
002970         MOVE 500057 TO RPXXX11-MSGNBR                            00297000
002980         MOVE 'E' TO RPXXX11-NBR-OCCURS-DCHG.                     00298000
002990     MOVE 'E' TO RPXXX11-END-FILE-INST.                           00299000
003000     MOVE 'Y' TO RPXXX11-END-FILE-INST-DCHG.                      00300000
003010     GO TO VK-END.                                                00301000
003020 VK-ERROR.                                                        00302000
003030     MOVE 'E' TO RPXXX11-RETURN.                                  00303000
003040 VK-END.                                                          00304000
003050     GO TO CICS-RETURN.                                           00305000
003060 VK-EXIT.                                                         00306000
003070     EXIT.                                                        00307000
003080******************************************************************00308000
000000 COPY RPPACTA.                                                    00309000
003100******************************************************************00310000
000000 COPY RPPSECA.                                                    00311000
003120******************************************************************00312000
003130 MIC-MST-API SECTION.                                             00313000
000000 COPY MIPMSTA.                                                    00314000
003150******************************************************************00315000
003160 OPERATOR-DIALOG-SECURITY SECTION.                                00316000
000000 COPY SRP079.                                                     00317000
003180******************************************************************00318000
003190 CICS-ABORT-EXIT SECTION.                                         00319000
003200 CAE-START.                                                       00320000
003210     GO TO CICS-RETURN.                                           00321000
003220 CAE-EXIT.                                                        00322000
003230     EXIT.                                                        00323000
003240******************************************************************00324000
003250 CICS-RETURN SECTION.                                             00325000
003260     IF COM-ABORT IS NOT EQUAL TO ZERO                            00326000
003270         MOVE COM-ABORT TO RPXXX11-ABORT.                         00327000
003280     IF RPXXX11-ABORT IS NOT EQUAL TO ZERO                        00328000
003290         MOVE 'Y' TO RPXXX11-ABTYPE.                              00329000
003300     IF RPXXX11-ABORT IS NOT EQUAL TO ZERO                        00330000
003310         MOVE WS-FUNCTION TO RPXXX11-FUNCTION                     00331000
003320         MOVE SRB-BMDB TO RPXXX11-SRBMDB                          00332000
003330         MOVE EIBFN TO RPXXX11-ABEIBFN                            00333000
003340         MOVE EIBRESP TO RPXXX11-ABEIBRESP                        00334000
003350         MOVE EIBRESP2 TO RPXXX11-ABEIBRESP2                      00335000
003360         MOVE EIBRCODE TO RPXXX11-ABEIBRCODE.                     00336000
003370     IF RPXXX11-ABTYPE IS NOT EQUAL TO 'Y'                        00337000
003380         PERFORM GLOBAL-CLOSE.                                    00338000
000000 COPY SLP709.                                                     00339000
003400******************************************************************00340000
003410 GLOBAL-CLOSE SECTION.                                            00341000
003420 GC-START.                                                        00342000
003430     IF RPXXX11-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  00343000
003440         PERFORM RPS-ACT-GLOBAL-CLOSE-REQUEST.                    00344000
003450 GC-EXIT.                                                         00345000
003460     EXIT.                                                        00346000
003470******************************************************************00347000
