000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX05.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX05 - ADD-ON ACCOUNT NEW MODULE                        *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW000-AREAS.                                                00016000
000000 COPY SRW000.                                                     00017000
000180 01  SRW009-AREAS.                                                00018000
000000 COPY SRW009.                                                     00019000
000200 01  SRW022-AREAS.                                                00020000
000000 COPY SRW022.                                                     00021000
000220 01  SRW079-AREAS.                                                00022000
000000 COPY SRW079.                                                     00023000
000240 01  SRW105-AREAS.                                                00024000
000000 COPY SRW105.                                                     00025000
000260*01  BICRSRB.                                                     00026000
000000 COPY BICRSRB.                                                    00027000
000280*01  BICRPSB.                                                     00028000
000000 COPY BICRPSB.                                                    00029000
000300*01  BICRVERB.                                                    00030000
000000 COPY BICRVERB.                                                   00031000
000320*01  BICRSTAT.                                                    00032000
000000 COPY BICRSTAT.                                                   00033000
000340*01  BICRDBS.                                                     00034000
000000 COPY BICRDBS.                                                    00035000
000360*01  BICRLOG.                                                     00036000
000000 COPY BICRLOG.                                                    00037000
000380 01  SRW710-AREAS.                                                00038000
000000 COPY SRW710.                                                     00039000
000400 01  WS-WORKAREAS.                                                00040000
000410     03  COM-ABORT               PIC S9(04)      COMP.            00041000
000420     03  WS-SUB1                 PIC S9(04)      COMP             00042000
000430                                                 VALUE +0000.     00043000
000440     03  WS-SUB2                 PIC S9(04)      COMP             00044000
000450                                                 VALUE +0000.     00045000
000460     03  WS-UPDATESW             PIC X(01)       VALUE SPACES.    00046000
000470     03  WS-INTERFACE            PIC X(01)       VALUE SPACES.    00047000
000480     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00048000
000490                                                 VALUE ZERO.      00049000
000500     03  WS-SAVE-ACCT-TYPE       PIC 9(03)       VALUE ZERO.      00050000
000510     03  WS-SAVE-PRODCODE        PIC X(06)       VALUE SPACES.    00051000
000520     03  WS-7102-FLAG            PIC X(01)       VALUE SPACES.    00052000
000530     03  WS-7107-FLAG            PIC X(01)       VALUE SPACES.    00053000
000540     03  WS-ACT-FLAG             PIC X(01)       VALUE SPACES.    00054000
000550     03  WS-QUA-FLAG             PIC X(01)       VALUE SPACES.    00055000
000560     03  WS-MST-FOUND            PIC X(01)       VALUE SPACES.    00056000
000570     03  WS-BALCATCD1-FAIL       PIC X(01)       VALUE SPACES.    00057000
000580     03  WS-WORK-CATCD           PIC X(06)       VALUE SPACES.    00058000
000590     03  WS-WORK-BALCD           PIC 9(02)       VALUE ZEROS.     00059000
000600     03  WS-WORK-BALANCE         PIC S9(13)V99   COMP-3           00060000
000610                                                 VALUE ZEROS.     00061000
000620     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00062000
000630                                                 VALUE ZERO.      00063000
000640     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00064000
000650     03  FILLER          REDEFINES WS-CURDATE.                    00065000
000660         05  WS-CURMM            PIC 9(02).                       00066000
000670         05  WS-CURDD            PIC 9(02).                       00067000
000680         05  WS-CURYYYY          PIC 9(04).                       00068000
000690     03  WS-CURDTYYYYMMDD        PIC 9(08)       VALUE ZEROS.     00069000
000700     03  FILLER          REDEFINES WS-CURDTYYYYMMDD.              00070000
000710         05  WS-CURDTYYYY        PIC 9(04).                       00071000
000720         05  WS-CURDTMMDD        PIC 9(04).                       00072000
000730         05  FILLER      REDEFINES WS-CURDTMMDD.                  00073000
000740             07  WS-CURDTMM      PIC 9(02).                       00074000
000750             07  WS-CURDTDD      PIC 9(02).                       00075000
000760     03  WS-DATEMMDDYYYY         PIC 9(08)       VALUE ZEROS.     00076000
000770     03  FILLER          REDEFINES WS-DATEMMDDYYYY.               00077000
000780         05  WS-DATEMM           PIC 9(02).                       00078000
000790         05  WS-DATEDD           PIC 9(02).                       00079000
000800         05  WS-DATEYYYY         PIC 9(04).                       00080000
000810     03  WS-SAVEMASTERGROUP.                                      00081000
000820         05  WS-SAVEMSTINST      PIC 9(04).                       00082000
000830         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00083000
000840         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00084000
000850         05  WS-SAVEMSTMODEL     PIC X(10).                       00085000
000860 01  WS-SECONDARY-ACCOUNT-FIELDS.                                 00086000
000870     03  WS-ACC-MAX              PIC S9(04)      COMP             00087000
000880                                                 VALUE +33.       00088000
000890     03  WS-ACC-TABLE.                                            00089000
000900         05  WS-ACC-INFO                         OCCURS 33 TIMES. 00090000
000910             07  WS-ACC-INST     PIC 9(04).                       00091000
000920             07  WS-ACC-CUST-TYPE                                 00092000
000930                                 PIC X(01).                       00093000
000940             07  WS-ACC-CUST     PIC X(21).                       00094000
000950             07  WS-ACC-RELNBR   PIC 9(02).                       00095000
000960             07  WS-ACC-PRIM     PIC 9(01).                       00096000
000970             07  WS-ACC-FILL     PIC X(01).                       00097000
000980         05  WS-ACC-FILLER       PIC X(10).                       00098000
000990     03  WS-MORE-SECONDARYCUST   PIC X(01)       VALUE 'N'.       00099000
001000     03  WS-SCSUB                PIC S9(04)      COMP             00100000
001010                                                 VALUE ZERO.      00101000
001020     03  WS-SECONDARY-CUST       PIC S9(04)      COMP             00102000
001030                                                 VALUE ZERO.      00103000
001040     03  WS-SECCUSTSUB           PIC S9(04)      COMP             00104000
001050                                                 VALUE ZERO.      00105000
001060     03  WS-PRIMCUSTACCTS        PIC S9(05)      COMP-3           00106000
001070                                                 VALUE ZEROS.     00107000
001080     03  WS-SECTABLE             PIC S9(05)      COMP-3           00108000
001090                                                 VALUE ZEROS.     00109000
001100     03  WS-NUMOFSECCUSTS        PIC S9(05)      COMP-3           00110000
001110                                                 VALUE ZEROS.     00111000
001120     03  WS-NUMOFSECACCTS        PIC S9(05)      COMP-3           00112000
001130                                                 VALUE ZEROS.     00113000
001140     03  WS-DUPSECACCT           PIC X(01)       VALUE SPACE.     00114000
001150     03  WS-BADRELNBR            PIC X(01)       VALUE SPACE.     00115000
001160     03  WS-EACHDUPACCT.                                          00116000
001170         07  WS-DUPINST          PIC 9(04).                       00117000
001180         07  WS-DUPPRODCD        PIC X(06).                       00118000
001190         07  WS-DUPACCOUNT       PIC X(18).                       00119000
001200     03  WS-DUPTEST              PIC S9(05)      COMP-3           00120000
001210                                                 VALUE ZERO.      00121000
001220     03  WS-SECMAX               PIC S9(05)      COMP-3           00122000
001230                                                 VALUE +1000.     00123000
001240     03  WS-ALLSEC               PIC S9(05)      COMP-3           00124000
001250                                                 VALUE ZERO.      00125000
001260     03  WS-RELCHECK             PIC X(01)       VALUE 'N'.       00126000
001270     03  WS-VALIDREL             PIC 9(02)       VALUE ZERO.      00127000
001280     03  WS-INCLUDEREL           PIC X(01)       VALUE 'N'.       00128000
001290     03  WS-RELMAX               PIC S9(05)      VALUE 50.        00129000
001300     03  WS-RELSUB               PIC S9(05)      VALUE ZERO.      00130000
001310     03  WS-RELCODETABLE.                                         00131000
001320         05  WS-RELCODE                          OCCURS           00132000
001330                                                 50 TIMES.        00133000
001340             07  WS-SECRELCODE   PIC 9(02).                       00134000
001350                                                                  00135000
001360     03  WS-RPMIM7104SC          PIC X(06).                       00136000
001370     03  WS-SUBSEC1              PIC S9(03)      COMP-3           00137000
001380                                                 VALUE ZERO.      00138000
001390     03  WS-SUBSEC2              PIC S9(03)      COMP-3           00139000
001400                                                 VALUE ZERO.      00140000
001410     03  WS-SUBSEC3              PIC S9(03)      COMP-3           00141000
001420                                                 VALUE ZERO.      00142000
001430     03  WS-SUBSEC4              PIC S9(03)      COMP-3           00143000
001440                                                 VALUE ZERO.      00144000
001450     03  WS-NEED-SECONDARY       PIC X(01)       VALUE 'N'.       00145000
001460     03  WS-NEW-CUSTKEY.                                          00146000
001470         05  WS-NEW-INST         PIC 9(04).                       00147000
001480         05  WS-NEW-CUST-TYPE    PIC X(01).                       00148000
001490         05  WS-NEW-CUST         PIC X(21).                       00149000
001500                                                                  00150000
001510     03  WS-SECONDARY-CUSTAREA.                                   00151000
001520         05  WS-SEC-INFO                         OCCURS 33 TIMES. 00152000
001530             07  WS-SEC-INST     PIC 9(04).                       00153000
001540             07  WS-SEC-CUST-TYPE                                 00154000
001550                                 PIC X(01).                       00155000
001560             07  WS-SEC-CUST     PIC X(21).                       00156000
001570             07  WS-SEC-RELNBR   PIC 9(02).                       00157000
001580             07  WS-SEC-PRIM     PIC 9(01).                       00158000
001590             07  WS-SEC-FILL     PIC X(01).                       00159000
001600         05  WS-SEC-FILLER       PIC X(10).                       00160000
001610* **                                                              00161000
001620* ** END OF WORK FIELDS                                           00162000
P0114 ***************************************************************** 00162200
P0114  01  WS-PRIMRELCD-WORKAREA.                                       00162400
000000 COPY RPW008.                                                     00162600
001630*----------------------------------------------------------------*00163000
001640 01  MIWPRI-AREAS.                                                00164000
000000 COPY MIWPRI.                                                     00165000
001660 01  MIWMSTA-AREAS.                                               00166000
000000 COPY MIWMSTA.                                                    00167000
001680 01  MIMST-RECORD.                                                00168000
000000 COPY MISMST.                                                     00169000
001700 01  MI0237-RECORD.                                               00170000
000000 COPY MIS0237A.                                                   00171000
001720 01  MI2001-RECORD.                                               00172000
000000 COPY MIS2001A.                                                   00173000
001740 01  MI2023-RECORD.                                               00174000
000000 COPY MIS2023A.                                                   00175000
001760 01  MI2024-RECORD.                                               00176000
000000 COPY MIS2024A.                                                   00177000
001780 01  MI7100-RECORD.                                               00178000
000000 COPY MIS7100.                                                    00179000
001800 01  MI7101-RECORD.                                               00180000
000000 COPY MIS7101.                                                    00181000
001820 01  MI7102-RECORD.                                               00182000
000000 COPY MIS7102.                                                    00183000
001840 01  MI7104-RECORD.                                               00184000
000000 COPY MIS7104.                                                    00185000
001860 01  MI7106-RECORD.                                               00186000
000000 COPY MIS7106.                                                    00187000
001880 01  MI7107-RECORD.                                               00188000
000000 COPY MIS7107.                                                    00189000
001900*----------------------------------------------------------------*00190000
001910 01  WS-RPMIM2001AREAS.                                           00191000
000000 COPY RPW2001.                                                    00192000
001930 01  WS-RPMIM7107AREAS.                                           00193000
000000 COPY RPW7107.                                                    00194000
001950*----------------------------------------------------------------*00195000
001960 01  RPWPRI-AREAS.                                                00196000
000000 COPY RPWPRI.                                                     00197000
001980 01  RPWACT-AREA.                                                 00198000
000000 COPY RPWACTA.                                                    00199000
002000 01  RPACT-RECORD.                                                00200000
000000 COPY RPSACT.                                                     00201000
002020 01  RPWEVT-AREA.                                                 00202000
000000 COPY RPWEVTA.                                                    00203000
002040 01  RPEVT-RECORD.                                                00204000
000000 COPY RPSEVT.                                                     00205000
002060 01  RPWIDX-AREA.                                                 00206000
000000 COPY RPWIDXA.                                                    00207000
002080 01  RPIDX-RECORD.                                                00208000
000000 COPY RPSIDX.                                                     00209000
002100 01  RPWMST-AREA.                                                 00210000
000000 COPY RPWMSTA.                                                    00211000
002120 01  RPMST-RECORD.                                                00212000
000000 COPY RPSMST.                                                     00213000
002140 01  RPWQUA-AREA.                                                 00214000
000000 COPY RPWQUAA.                                                    00215000
002160 01  RPQUA-RECORD.                                                00216000
000000 COPY RPSQUA.                                                     00217000
002180 01  RPWREL-AREA.                                                 00218000
000000 COPY RPWRELA.                                                    00219000
002200 01  RPREL-RECORD.                                                00220000
000000 COPY RPSREL.                                                     00221000
002220 01  RPWSEC-AREA.                                                 00222000
000000 COPY RPWSECA.                                                    00223000
002240 01  RPSEC-RECORD.                                                00224000
000000 COPY RPSSEC.                                                     00225000
002260*----------------------------------------------------------------*00226000
002270 01  RPRF21-MESSAGE.                                              00227000
000000 COPY MISCNT00      REPLACING                                     00228000
002290             ==:MICNT:== BY ==RPRF21==.                           00229000
000000 COPY RPSRF21.                                                    00230000
002310*----------------------------------------------------------------*00231000
002320 01  RPINF00-MESSAGE.                                             00232000
000000 COPY MISCNT00      REPLACING                                     00233000
002340             ==:MICNT:== BY ==RPINF00==.                          00234000
000000 COPY RPSINF00.                                                   00235000
002360*----------------------------------------------------------------*00236000
002370 01  RPUSER-MESSAGE.                                              00237000
000000 COPY MISCNT00      REPLACING                                     00238000
002390     ==:MICNT:== BY ==RPUSER==.                                   00239000
000000 COPY RPWUSER.                                                    00240000
002410***************************************************************** 00241000
002420 01  WS-TRACECODES.                                               00242000
002430     03  WS-TR0001               PIC S9(04)      COMP             00243000
002440                                                 VALUE +0001.     00244000
002450     03  WS-TR0002               PIC S9(04)      COMP             00245000
002460                                                 VALUE +0002.     00246000
002470     03  WS-TR0003               PIC S9(04)      COMP             00247000
002480                                                 VALUE +0003.     00248000
002490     03  WS-TR0004               PIC S9(04)      COMP             00249000
002500                                                 VALUE +0004.     00250000
002510     03  WS-TR0005               PIC S9(04)      COMP             00251000
002520                                                 VALUE +0005.     00252000
002530     03  WS-TR0006               PIC S9(04)      COMP             00253000
002540                                                 VALUE +0006.     00254000
002550     03  WS-TR0007               PIC S9(04)      COMP             00255000
002560                                                 VALUE +0007.     00256000
002570     03  WS-TR0008               PIC S9(04)      COMP             00257000
002580                                                 VALUE +0008.     00258000
002590     03  WS-TR0009               PIC S9(04)      COMP             00259000
002600                                                 VALUE +0009.     00260000
002610     03  WS-TR0010               PIC S9(04)      COMP             00261000
002620                                                 VALUE +0010.     00262000
002630     03  WS-TR0011               PIC S9(04)      COMP             00263000
002640                                                 VALUE +0011.     00264000
002650     03  WS-TR0012               PIC S9(04)      COMP             00265000
002660                                                 VALUE +0012.     00266000
002670     03  WS-TR0013               PIC S9(04)      COMP             00267000
002680                                                 VALUE +0013.     00268000
002690     03  WS-TR0014               PIC S9(04)      COMP             00269000
002700                                                 VALUE +0014.     00270000
002710     03  WS-TR0015               PIC S9(04)      COMP             00271000
002720                                                 VALUE +0015.     00272000
002730     03  WS-TR0016               PIC S9(04)      COMP             00273000
002740                                                 VALUE +0016.     00274000
002750     03  WS-TR0017               PIC S9(04)      COMP             00275000
002760                                                 VALUE +0017.     00276000
002770     03  WS-TR0018               PIC S9(04)      COMP             00277000
002780                                                 VALUE +0018.     00278000
002790     03  WS-TR0019               PIC S9(04)      COMP             00279000
002800                                                 VALUE +0019.     00280000
002810     03  WS-TR0020               PIC S9(04)      COMP             00281000
002820                                                 VALUE +0020.     00282000
002830 01  WS-ABORTCODES.                                               00283000
002840     03  WS-AB0009               PIC S9(04)      COMP             00284000
002850                                                 VALUE +0009.     00285000
002860     03  WS-AB2000               PIC S9(04)      COMP             00286000
002870                                                 VALUE +2000.     00287000
002880     03  WS-AB2033               PIC S9(04)      COMP             00288000
002890                                                 VALUE +2033.     00289000
002900     03  WS-AB3051               PIC S9(04)      COMP             00290000
002910                                                 VALUE +3051.     00291000
002920     03  WS-AB6300               PIC S9(04)      COMP             00292000
002930                                                 VALUE +6300.     00293000
002940     03  WS-AB6310               PIC S9(04)      COMP             00294000
002950                                                 VALUE +6310.     00295000
002960     03  WS-AB6320               PIC S9(04)      COMP             00296000
002970                                                 VALUE +6320.     00297000
002980     03  WS-AB6325               PIC S9(04)      COMP             00298000
002990                                                 VALUE +6325.     00299000
003000     03  WS-AB6330               PIC S9(04)      COMP             00300000
003010                                                 VALUE +6330.     00301000
003020     03  WS-AB6335               PIC S9(04)      COMP             00302000
003030                                                 VALUE +6335.     00303000
003040     03  WS-AB6360               PIC S9(04)      COMP             00304000
003050                                                 VALUE +6360.     00305000
003060******************************************************************00306000
003070 01  SLW096-AREAS.                                                00307000
000000 COPY SLW096.                                                     00308000
003090 01  SLS140-RECORD.                                               00309000
000000 COPY SLS140.                                                     00310000
003110******************************************************************00311000
003120 LINKAGE SECTION.                                                 00312000
003130 01  DFHCOMMAREA.                                                 00313000
000000 COPY MISCNT00      REPLACING                                     00314000
003150             ==:MICNT:== BY ==RPXXX05==.                          00315000
000000 COPY RPSXXX05.                                                   00316000
003170*01  SLW096-2023RECORDS.                                          00317000
000000 COPY SLW096L.                                                    00318000
003190******************************************************************00319000
003200 PROCEDURE DIVISION.                                              00320000
003210******************************************************************00321000
003220 ENTRY-ROUTINE SECTION.                                           00322000
003230 ER-START.                                                        00323000
003240     MOVE 'RPLXXX05' TO SR-APIPROGLIT.                            00324000
003250     MOVE 'RPLXXX05' TO RPXXX05-ABPROGID.                         00325000
003260     PERFORM CICS-HANDLE-CONDITION.                               00326000
003270     IF EIBCALEN IS EQUAL TO +0                                   00327000
003280         MOVE WS-AB2000 TO RPXXX05-ABORT                          00328000
003290         MOVE WS-TR0001 TO RPXXX05-ABTRACE                        00329000
003300         GO TO CICS-RETURN.                                       00330000
003310     MOVE ZERO TO RPXXX05-MSGNBR.                                 00331000
003320     MOVE SPACE TO WS-FUNCTION.                                   00332000
003330     MOVE RPXXX05-FILEOPTS TO WS-FILEOPTS.                        00333000
003340     MOVE RPXXX05-OPERID TO WS-UPD-USER.                          00334000
003350     MOVE RPXXX05-EXTERNALID TO LOG-PANELID.                      00335000
003360     MOVE RPXXX05-TERMID TO LOG-TERMID.                           00336000
003370     MOVE RPXXX05-WORKID TO LOG-WORKID.                           00337000
003380     MOVE RPXXX05-TRANSTART TO LOG-TRANSTART.                     00338000
003390     MOVE RPXXX05-APPLSEQ TO LOG-APPLSEQ.                         00339000
003400     INITIALIZE RPRF21-MESSAGE.                                   00340000
000000 COPY SLP094.                                                     00341000
003420     GO TO VERIFY-KEY.                                            00342000
003430 ER-EXIT.                                                         00343000
003440     EXIT.                                                        00344000
003450******************************************************************00345000
003460 CICS-HANDLE-CONDITION SECTION.                                   00346000
000000 COPY SLP702.                                                     00347000
003480     MOVE WS-AB2033 TO RPXXX05-ABORT.                             00348000
003490     MOVE WS-TR0002 TO RPXXX05-ABTRACE.                           00349000
003500     GO TO CICS-RETURN.                                           00350000
003510 CHC-EXIT.                                                        00351000
003520     EXIT.                                                        00352000
003530******************************************************************00353000
003540 VERIFY-KEY SECTION.                                              00354000
003550 VK-START.                                                        00355000
003560     MOVE ZERO TO COM-ABORT.                                      00356000
003570     MOVE ZERO TO RPXXX05-ABORT.                                  00357000
003580     MOVE ZERO TO RPXXX05-MSGNBR.                                 00358000
003590     MOVE ZERO TO WS-MSGNBR.                                      00359000
003600     MOVE SPACES TO RPXXX05-FUNCTION.                             00360000
003610     MOVE RPXXX05-DATE TO WS-CURDATE.                             00361000
003620     MOVE WS-CURMM TO WS-CURDTMM.                                 00362000
003630     MOVE WS-CURDD TO WS-CURDTDD.                                 00363000
003640     MOVE WS-CURYYYY TO WS-CURDTYYYY.                             00364000
003650     MOVE WS-CURDTYYYYMMDD TO WS-CURDT-YYYYMMDD.                  00365000
003660     MOVE 'N' TO WS-QUA-FLAG.                                     00366000
003670 VK-SECURITY.                                                     00367000
003680     IF RPXXX05-APIFUNC IS NOT EQUAL TO 'VKL'                     00368000
003690         GO TO VK-MST.                                            00369000
003700     MOVE RPXXX05-UPDATE TO SR-OPDUPDATE.                         00370000
003710     MOVE RPXXX05-KEY-INST TO SR-OPDINST.                         00371000
003720     MOVE RPXXX05-OPERID TO SR-OPDOPERID.                         00372000
003730     MOVE RPXXX05-MODELID TO SR-OPDMODELID.                       00373000
003740     MOVE RPXXX05-EXTERNALID TO SR-OPDTRANCODE.                   00374000
003750     MOVE RPXXX05-APPL TO SR-OPDAPPL.                             00375000
003760     MOVE RPXXX05-SECALT TO SR-OPDSECALT.                         00376000
003770     MOVE RPXXX05-FUNC TO SR-OPDFUNC.                             00377000
003780     PERFORM OPERATOR-DIALOG-SECURITY.                            00378000
003790     MOVE SR-OPDUPDATE TO RPXXX05-UPDATE.                         00379000
003800     IF SR-OPDMSGNBR IS NOT EQUAL TO ZEROS                        00380000
003810         MOVE SR-OPDMSGNBR TO RPXXX05-MSGNBR                      00381000
003820         GO TO VK-RETURN.                                         00382000
003830 VK-IDX.                                                          00383000
003840     INITIALIZE RPIDX-RECORD.                                     00384000
003850     IF RPXXX05-KEY-IDNUMBER-DCHG IS NOT EQUAL TO 'Y'             00385000
003860         GO TO VK-MST.                                            00386000
003870     IF RPXXX05-KEY-IDNUMBER IS NOT GREATER THAN ZEROS            00387000
003880         OR RPXXX05-KEY-IDNUMBER IS NOT NUMERIC                   00388000
003890         GO TO VK-MST.                                            00389000
003900     PERFORM LOCATE-IDNUMBER-BY-APPL.                             00390000
003910     IF WS-FUNCTION IS EQUAL TO 'N'                               00391000
003920         MOVE 500004 TO RPXXX05-MSGNBR                            00392000
003930         GO TO VK-RETURN.                                         00393000
003940     MOVE ZEROS TO RPXXX05-KEY-IDNUMBER.                          00394000
003950 VK-MST.                                                          00395000
003960     IF RPXXX05-KEY-MODEL IS EQUAL TO SPACES OR                   00396000
003970         RPXXX05-KEY-MODEL IS EQUAL TO LOW-VALUES                 00397000
003980         PERFORM FIND-DEFAULT-MODEL.                              00398000
003990     IF WS-ERROR IS EQUAL TO 'Y'                                  00399000
004000         GO TO VK-RETURN.                                         00400000
004010     MOVE RPXXX05-KEY-INST TO RPMST-INST.                         00401000
004020     MOVE RPXXX05-KEY-PRODCODE TO RPMST-PRODCODE.                 00402000
004030     MOVE RPXXX05-KEY-ACCOUNT TO RPMST-ACCOUNT.                   00403000
004040     MOVE RPXXX05-KEY-MODEL TO RPMST-MODEL.                       00404000
004050     PERFORM RPS-MST-GET-REQUEST.                                 00405000
004060     IF WS-FUNCTION IS EQUAL TO 'N'                               00406000
004070         GO TO VK-QUA.                                            00407000
004080     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00408000
004090         MOVE WS-AB6320 TO RPXXX05-ABORT                          00409000
004100         MOVE WS-TR0003 TO RPXXX05-ABTRACE                        00410000
004110         GO TO VK-RETURN.                                         00411000
004120     MOVE RPMST-IDNUMBER TO RPXXX05-IDNUMBER.                     00412000
004130     MOVE RPMST-REL-STAT TO RPXXX05-REL-STAT.                     00413000
004140     GO TO VK-7100.                                               00414000
004150 VK-QUA.                                                          00415000
004160     MOVE RPXXX05-KEY-INST TO RPQUA-INST.                         00416000
004170     MOVE RPXXX05-KEY-PRODCODE TO RPQUA-PRODCODE.                 00417000
004180     MOVE RPXXX05-KEY-ACCOUNT TO RPQUA-ACCOUNT.                   00418000
004190     MOVE RPXXX05-KEY-MODEL TO RPQUA-MODEL.                       00419000
004200     PERFORM RPS-QUA-GET-REQUEST.                                 00420000
004210     IF WS-FUNCTION IS EQUAL TO 'N'                               00421000
004220         MOVE 500004 TO RPXXX05-MSGNBR                            00422000
004230         GO TO VK-RETURN.                                         00423000
004240     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00424000
004250         MOVE WS-AB6325 TO RPXXX05-ABORT                          00425000
004260         MOVE WS-TR0004 TO RPXXX05-ABTRACE                        00426000
004270         GO TO VK-RETURN.                                         00427000
004280     MOVE 'Y' TO WS-QUA-FLAG.                                     00428000
004290     MOVE RPQUA-IDNUMBER TO RPXXX05-IDNUMBER.                     00429000
004300     MOVE 'A' TO RPXXX05-REL-STAT.                                00430000
004310 VK-7100.                                                         00431000
004320     PERFORM READ-MICM-7100.                                      00432000
004330     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00433000
004340         MOVE 500005 TO RPXXX05-MSGNBR                            00434000
004350         GO TO VK-RETURN.                                         00435000
004360 VK-7101.                                                         00436000
004370     MOVE SPACES TO MI7101-RECORD.                                00437000
004380     MOVE RPXXX05-KEY-INST TO MIM-7101KINST.                      00438000
004390     MOVE +7101 TO MIM-7101KREC.                                  00439000
004400     MOVE RPXXX05-KEY-MODEL TO MIM-7101KMODEL.                    00440000
004410     COMPUTE WS-7101KEFFDT = WS-CURDTYYYYMMDD - 99999999.         00441000
004420     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00442000
004430     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00443000
004440     MOVE MI7101-RECORD TO MIMST-RECORD.                          00444000
004450     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00445000
004460     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00446000
004470         MOVE 500006 TO RPXXX05-MSGNBR                            00447000
004480         GO TO VK-RETURN.                                         00448000
004490     MOVE MIMST-RECORD TO MI7101-RECORD.                          00449000
004500     IF MIM-7101KINST IS NOT EQUAL TO RPXXX05-KEY-INST            00450000
004510         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00451000
004520         OR MIM-7101KMODEL IS NOT EQUAL TO RPXXX05-KEY-MODEL      00452000
004530         MOVE 500006 TO RPXXX05-MSGNBR                            00453000
004540         GO TO VK-RETURN.                                         00454000
004550     MOVE MIM-7101DESC TO RPXXX05-MODEL-DESC.                     00455000
004560     MOVE 'N' TO WS-RELCHECK.                                     00456000
004570     MOVE SPACES TO WS-RPMIM7104SC.                               00457000
P0114      IF MIM-7101PRIMRELCD-Q IS NOT EQUAL TO 'B'                   00458000
P0114          AND MIM-7101PRIMRELCD-Q IS NOT EQUAL TO 'E'              00458590
004600         GO TO VK-NAME.                                           00460000
P0114      IF MIM-7101PRIMRELCD IS NOT EQUAL TO SPACES                  00461000
004620         MOVE 'Y' TO WS-RELCHECK                                  00462000
P0114          MOVE MIM-7101PRIMRELCD TO WS-RPMIM7104SC.                00463000
004640 VK-NAME.                                                         00464000
004650     MOVE 'A' TO RPRF21-FUNC.                                     00465000
004660     MOVE RPXXX05-KEY-INST TO RPRF21-BASE-ACCT-INST.              00466000
004670     MOVE RPXXX05-KEY-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.      00467000
004680     MOVE RPXXX05-KEY-ACCOUNT TO RPRF21-BASE-ACCT.                00468000
004690     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00469000
004700         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00470000
004710         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00471000
004720     PERFORM REQUEST-CUSTOMER.                                    00472000
004730     MOVE WS-MSGNBR TO RPXXX05-MSGNBR.                            00473000
004740     IF WS-FUNCTION IS EQUAL TO 'B'                               00474000
004750         MOVE SPACES TO WS-FUNCTION.                              00475000
004760     IF WS-FUNCTION IS EQUAL TO SPACES                            00476000
004770         MOVE RPRF21-BASE-RCIF-KEY TO RPXXX05-RCIF-KEY            00477000
004780         MOVE RPRF21-NAME TO RPXXX05-CUST-NAME                    00478000
P0114          MOVE RPRF21-REL TO WS-RPW008-RELNBR                      00478500
004790         GO TO VK-END.                                            00479000
004800     IF RPXXX05-MSGNBR IS EQUAL TO ZEROS                          00480000
004810         MOVE 500016 TO RPXXX05-MSGNBR.                           00481000
004820     GO TO VK-RETURN.                                             00482000
004830 VK-END.                                                          00483000
004840     IF RPXXX05-APIFUNC IS EQUAL TO 'VKD'                         00484000
004850         GO TO CICS-RETURN.                                       00485000
004860     IF RPXXX05-APIFUNC IS EQUAL TO 'VKL'                         00486000
004870         INITIALIZE RPXXX05-RECORD                                00487000
004880         GO TO CICS-RETURN.                                       00488000
004890     GO TO VK-EXIT.                                               00489000
004900 VK-RETURN.                                                       00490000
004910     MOVE 'E' TO RPXXX05-RETURN.                                  00491000
004920     GO TO CICS-RETURN.                                           00492000
004930 VK-EXIT.                                                         00493000
004940     EXIT.                                                        00494000
004950******************************************************************00495000
004960 EDIT-DATA SECTION.                                               00496000
004970 ED-START.                                                        00497000
004980     MOVE ZEROS TO RPXXX05-MSGNBR.                                00498000
004990     MOVE +0000 TO RPXXX05-ABORT.                                 00499000
005000     MOVE +0000 TO RPXXX05-ERRCNT.                                00500000
005010 ED-INST2.                                                        00501000
005020     IF RPXXX05-ADD-INST-DCHG IS EQUAL TO 'E'                     00502000
005030         OR RPXXX05-ADD-INST-DCHG IS EQUAL TO 'N'                 00503000
005040         MOVE 'E' TO RPXXX05-ADD-INST-DCHG                        00504000
005050         ADD +1 TO RPXXX05-ERRCNT                                 00505000
005060         MOVE 'Y' TO WS-ERROR                                     00506000
005070         GO TO ED-PRODCODE.                                       00507000
005080     MOVE 'Y' TO WS-UPDTSW.                                       00508000
005090     IF RPXXX05-ADD-INST IS EQUAL TO SPACE                        00509000
005100         OR RPXXX05-ADD-INST IS EQUAL TO LOW-VALUES               00510000
005110         ADD +1 TO RPXXX05-ERRCNT                                 00511000
005120         MOVE 'Y' TO WS-ERROR                                     00512000
005130         MOVE 'E' TO RPXXX05-ADD-INST-DCHG.                       00513000
005140 ED-PRODCODE.                                                     00514000
005150     IF RPXXX05-ADD-PRODCODE-DCHG IS EQUAL TO 'E'                 00515000
005160         OR RPXXX05-ADD-PRODCODE-DCHG IS EQUAL TO 'N'             00516000
005170         MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG                    00517000
005180         ADD +1 TO RPXXX05-ERRCNT                                 00518000
005190         MOVE 'Y' TO WS-ERROR                                     00519000
005200         GO TO ED-ACCOUNT.                                        00520000
005210     MOVE 'Y' TO WS-UPDTSW.                                       00521000
005220     IF RPXXX05-ADD-PRODCODE IS EQUAL TO SPACE                    00522000
005230         OR RPXXX05-ADD-PRODCODE IS EQUAL TO LOW-VALUES           00523000
005240         ADD +1 TO RPXXX05-ERRCNT                                 00524000
005250         MOVE 'Y' TO WS-ERROR                                     00525000
005260         MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG.                   00526000
005270 ED-ACCOUNT.                                                      00527000
005280     IF RPXXX05-ADD-ACCOUNT-DCHG IS EQUAL TO 'E'                  00528000
005290         OR RPXXX05-ADD-ACCOUNT-DCHG IS EQUAL TO 'N'              00529000
005300         MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG                     00530000
005310         ADD +1 TO RPXXX05-ERRCNT                                 00531000
005320         MOVE 'Y' TO WS-ERROR                                     00532000
005330         GO TO ED-PROD-ACCOUNT.                                   00533000
005340     MOVE 'Y' TO WS-UPDTSW.                                       00534000
005350     IF RPXXX05-ADD-ACCOUNT IS EQUAL TO SPACE                     00535000
005360         OR RPXXX05-ADD-ACCOUNT IS EQUAL TO LOW-VALUES            00536000
005370         ADD +1 TO RPXXX05-ERRCNT                                 00537000
005380         MOVE 'Y' TO WS-ERROR                                     00538000
005390         MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG.                    00539000
005400 ED-PROD-ACCOUNT.                                                 00540000
005410     IF RPXXX05-ADD-PRODCODE-DCHG IS EQUAL TO 'E'                 00541000
005420         OR RPXXX05-ADD-ACCOUNT-DCHG IS EQUAL TO 'E'              00542000
005430         OR RPXXX05-ADD-INST-DCHG IS EQUAL TO 'E'                 00543000
005440         GO TO ED-END.                                            00544000
005450     MOVE RPXXX05-ADD-INST TO RPRF21-BASE-ACCT-INST.              00545000
005460     MOVE RPXXX05-ADD-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.      00546000
005470     MOVE RPXXX05-ADD-ACCOUNT TO RPRF21-BASE-ACCT.                00547000
005480     IF RPRF21-BASE-ACCT-PRODCODE IS EQUAL TO MIM-2023KPRODCODE   00548000
005490         GO TO ED-PRODACCT-2023.                                  00549000
005500     PERFORM READ-MICM-2023.                                      00550000
005510 ED-PRODACCT-2023.                                                00551000
005520     IF MIM-2023RPOPTION IS EQUAL TO ' '                          00552000
005530         OR MIM-2023RPOPTION IS EQUAL TO 'N'                      00553000
005540         MOVE 'N' TO MIM-2023RPOPTION.                            00554000
005550     IF MIM-2023RPOPTION IS EQUAL TO 'N'                          00555000
005560         ADD +3 TO RPXXX05-ERRCNT                                 00556000
005570         MOVE 'Y' TO WS-ERROR                                     00557000
005580         MOVE 'E' TO RPXXX05-ADD-INST-DCHG                        00558000
005590         MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG                    00559000
005600         MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG                     00560000
005610         MOVE 500015 TO RPXXX05-MSGNBR                            00561000
005620         GO TO ED-END.                                            00562000
005630 ED-2023.                                                         00563000
005640     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'N'                     00564000
005650         AND RPXXX05-KEY-INST IS NOT EQUAL TO RPXXX05-ADD-INST    00565000
005660         ADD +3 TO RPXXX05-ERRCNT                                 00566000
005670         MOVE 'Y' TO WS-ERROR                                     00567000
005680         MOVE 'E' TO RPXXX05-ADD-INST-DCHG                        00568000
005690         MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG                    00569000
005700         MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG                     00570000
005710         MOVE 500088 TO RPXXX05-MSGNBR                            00571000
005720         GO TO ED-END.                                            00572000
005730     IF RPXXX05-KEY-INST IS EQUAL TO RPXXX05-ADD-INST             00573000
005740         GO TO ED-CUSTOMER.                                       00574000
005750     MOVE ZEROES TO MIM-2024KINST.                                00575000
005760     MOVE 2024 TO MIM-2024KREC.                                   00576000
005770     MOVE RPXXX05-KEY-INST TO MIM-2024KGROUP-INST.                00577000
005780     MOVE RPXXX05-ADD-INST TO MIM-2024KACCESS-INST.               00578000
005790     MOVE MIC-MST-2024-PRI TO MIC-MST-REC-PRI.                    00579000
005800     MOVE 50 TO MIM-2024KMANGER.                                  00580000
005810     MOVE MI2024-RECORD TO MIMST-RECORD.                          00581000
005820     PERFORM MIC-MST-GET-REQUEST.                                 00582000
005830     IF WS-FUNCTION IS EQUAL TO 'N'                               00583000
005840         ADD +3 TO RPXXX05-ERRCNT                                 00584000
005850         MOVE 'Y' TO WS-ERROR                                     00585000
005860         MOVE 'E' TO RPXXX05-ADD-INST-DCHG                        00586000
005870         MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG                    00587000
005880         MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG                     00588000
005890         MOVE 500088 TO RPXXX05-MSGNBR                            00589000
005900         GO TO ED-END.                                            00590000
005910     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00591000
005920         MOVE WS-TR0014 TO RPXXX05-ABTRACE                        00592000
005930         MOVE WS-AB3051 TO RPXXX05-ABORT                          00593000
005940         GO TO CICS-ABORT-EXIT.                                   00594000
005950     MOVE MIMST-RECORD TO MI2024-RECORD.                          00595000
005960     MOVE SPACES TO SLS140-MSGNBRG.                               00596000
005970     MOVE SPACES TO SLS140-ABMSG.                                 00597000
005980     MOVE 'X' TO SLS140-SECURITY-FUNC.                            00598000
005990     MOVE RPXXX05-KEY-INST TO SLS140-INST.                        00599000
006000     MOVE RPXXX05-ADD-INST TO SLS140-INST2.                       00600000
006010     MOVE RPXXX05-OPERID TO SLS140-OPERID.                        00601000
006020     MOVE RPXXX05-PROFILE TO SLS140-PROFILE.                      00602000
006030     MOVE RPXXX05-EXTERNALID TO SLS140-EXTERNALID.                00603000
006040     EXEC CICS LINK                                               00604000
006050         PROGRAM('SSL140')                                        00605000
006060         COMMAREA(SLS140-RECORD)                                  00606000
006070         LENGTH(LENGTH OF SLS140-RECORD)                          00607000
006080         NOHANDLE                                                 00608000
006090         END-EXEC.                                                00609000
006100     IF EIBRESP IS NOT EQUAL TO DFHRESP(NORMAL)                   00610000
006110         MOVE 'PROGRAM ID = ' TO RPXXX05-ABMSG                    00611000
006120         MOVE 'SSL140  ' TO RPXXX05-ABMSG (14:8)                  00612000
006130         MOVE WS-TR0015 TO RPXXX05-ABTRACE                        00613000
006140         MOVE WS-AB0009 TO RPXXX05-ABORT                          00614000
006150         GO TO CICS-RETURN.                                       00615000
006160     IF SLS140-SECURITY-FUNC IS EQUAL TO 'A'                      00616000
006170         MOVE SLS140-MSGNBRG TO RPXXX05-MSGNBRG                   00617000
006180         MOVE SLS140-ABORT TO RPXXX05-ABORT                       00618000
006190         MOVE SLS140-ABTRACE TO RPXXX05-ABTRACE                   00619000
006200         MOVE SLS140-ABFUNCTION TO RPXXX05-FUNCTION               00620000
006210         MOVE SLS140-ABPROGID TO RPXXX05-ABPROGID                 00621000
006220         MOVE SLS140-ABMSG TO RPXXX05-ABMSG                       00622000
006230         MOVE SLS140-ABEIBRESP TO EIBRESP                         00623000
006240         MOVE SLS140-ABEIBRESP2 TO EIBRESP2                       00624000
006250         MOVE SLS140-ABEIBFN TO EIBFN                             00625000
006260         MOVE SLS140-ABEIBRCODE TO EIBRCODE                       00626000
006270         MOVE SLS140-SRBMDB TO RPXXX05-SRBMDB                     00627000
006280         GO TO CICS-RETURN.                                       00628000
006290     IF SLS140-SECURITY-FUNC IS NOT EQUAL TO 'G'                  00629000
006300         ADD +3 TO RPXXX05-ERRCNT                                 00630000
006310         MOVE 'Y' TO WS-ERROR                                     00631000
006320         MOVE 'E' TO RPXXX05-ADD-INST-DCHG                        00632000
006330         MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG                    00633000
006340         MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG                     00634000
006350         MOVE 500088 TO RPXXX05-MSGNBR                            00635000
006360         GO TO ED-END.                                            00636000
006370 ED-CUSTOMER.                                                     00637000
006380     MOVE 'F' TO RPRF21-FUNC.                                     00638000
006390     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00639000
006400         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00640000
006410         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00641000
006420     PERFORM REQUEST-CUSTOMER.                                    00642000
006430     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00643000
006440         ADD +3 TO RPXXX05-ERRCNT                                 00644000
006450         MOVE 'Y' TO WS-ERROR                                     00645000
006460         MOVE 500016 TO RPXXX05-MSGNBR                            00646000
006470         MOVE 'E' TO RPXXX05-ADD-INST-DCHG                        00647000
006480         MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG                    00648000
006490         MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG                     00649000
006500         GO TO ED-END.                                            00650000
006510     MOVE SPACE TO WS-ACT-FLAG.                                   00651000
006520     INITIALIZE RPACT-RECORD.                                     00652000
006530     MOVE RPXXX05-ADD-INST TO RPACT-INST.                         00653000
006540     MOVE RPXXX05-ADD-PRODCODE TO RPACT-PRODCODE.                 00654000
006550     MOVE RPXXX05-ADD-ACCOUNT TO RPACT-ACCOUNT.                   00655000
006560     PERFORM RPS-ACT-GET-REQUEST.                                 00656000
006570     IF WS-FUNCTION IS EQUAL TO 'N'                               00657000
006580         GO TO ED-END.                                            00658000
006590     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00659000
006600         MOVE WS-AB6300 TO RPXXX05-ABORT                          00660000
006610         MOVE WS-TR0005 TO RPXXX05-ABTRACE                        00661000
006620         GO TO CICS-RETURN.                                       00662000
006630     PERFORM READ-MICM-7100.                                      00663000
006640     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00664000
006650         ADD +3 TO RPXXX05-ERRCNT                                 00665000
006660         MOVE 'Y' TO WS-ERROR                                     00666000
006670         MOVE 500005 TO RPXXX05-MSGNBR                            00667000
006680         MOVE 'E' TO RPXXX05-ADD-INST-DCHG                        00668000
006690         MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG                    00669000
006700         MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG                     00670000
006710         GO TO ED-END.                                            00671000
006720     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      00672000
006730         ADD +3 TO RPXXX05-ERRCNT                                 00673000
006740         MOVE 'Y' TO WS-ERROR                                     00674000
006750         MOVE 500021 TO RPXXX05-MSGNBR                            00675000
006760         MOVE 'E' TO RPXXX05-ADD-INST-DCHG                        00676000
006770         MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG                    00677000
006780         MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG                     00678000
006790         GO TO ED-END.                                            00679000
006800     MOVE 'Y' TO WS-ACT-FLAG.                                     00680000
006810 ED-END.                                                          00681000
006820     IF RPXXX05-UPDATE IS NOT EQUAL TO 'Y'                        00682000
006830         GO TO CICS-RETURN.                                       00683000
006840     IF WS-ERROR IS NOT EQUAL TO 'Y'                              00684000
006850         PERFORM CHECK-EXISTING-RELATIONSHIP.                     00685000
006860     IF WS-ERROR IS NOT EQUAL TO 'Y'                              00686000
006870         PERFORM VALIDATE-MODEL-REQUIREMENTS.                     00687000
006880     IF RPXXX05-APIFUNC IS EQUAL TO 'EDT'                         00688000
006890         OR WS-ERROR IS EQUAL TO 'Y'                              00689000
006900         MOVE 'EDT' TO RPXXX05-APIFUNC                            00690000
006910         GO TO CICS-RETURN.                                       00691000
006920     IF WS-UPDTSW IS NOT EQUAL TO 'Y'                             00692000
006930         GO TO CICS-RETURN.                                       00693000
006940 ED-EXIT.                                                         00694000
006950     EXIT.                                                        00695000
006960******************************************************************00696000
006970 UPDATE-RECORD SECTION.                                           00697000
006980 UR-START.                                                        00698000
006990     MOVE 'Y' TO WS-UPDATESW.                                     00699000
007000     INITIALIZE RPREL-RECORD.                                     00700000
007010     MOVE RPXXX05-KEY-INST TO RPREL-INST.                         00701000
007020     MOVE RPXXX05-KEY-PRODCODE TO RPREL-PRODCODE.                 00702000
007030     MOVE RPXXX05-KEY-ACCOUNT TO RPREL-ACCOUNT.                   00703000
007040     MOVE RPXXX05-KEY-MODEL TO RPREL-MODEL.                       00704000
007050     MOVE RPXXX05-ADD-INST TO RPREL-INST2.                        00705000
007060     MOVE RPXXX05-ADD-PRODCODE TO RPREL-PRODCODE2.                00706000
007070     MOVE RPXXX05-ADD-ACCOUNT TO RPREL-ACCOUNT2.                  00707000
007080     IF WS-QUA-FLAG IS EQUAL TO 'Y'                               00708000
007090         MOVE 'Q' TO RPREL-ACCT-STATUS                            00709000
007100     ELSE                                                         00710000
007110         MOVE 'U' TO RPREL-ACCT-STATUS.                           00711000
007120     IF RPINF00-BRANCH IS NOT NUMERIC                             00712000
007130         MOVE ZEROS TO RPREL-BRANCH                               00713000
007140     ELSE                                                         00714000
007150         MOVE RPINF00-BRANCH TO RPREL-BRANCH.                     00715000
007160     IF RPINF00-ACCT-TYPE IS NOT NUMERIC                          00716000
007170         MOVE ZEROS TO RPREL-ACCT-TYPE                            00717000
007180     ELSE                                                         00718000
007190         MOVE RPINF00-ACCT-TYPE TO RPREL-ACCT-TYPE.               00719000
007200     IF RPINF00-APPLR IS NOT NUMERIC                              00720000
007210         MOVE ZEROS TO RPREL-APPL                                 00721000
007220     ELSE                                                         00722000
007230         MOVE RPINF00-APPLR TO RPREL-APPL.                        00723000
007240     PERFORM RPS-REL-PUT-REQUEST.                                 00724000
007250     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00725000
007260         MOVE WS-AB6330 TO RPXXX05-ABORT                          00726000
007270         MOVE WS-TR0006 TO RPXXX05-ABTRACE                        00727000
007280         GO TO CICS-RETURN.                                       00728000
007290 UR-MASTER.                                                       00729000
007300     MOVE RPXXX05-KEY-INST TO RPQUA-INST.                         00730000
007310     MOVE RPXXX05-KEY-PRODCODE TO RPQUA-PRODCODE.                 00731000
007320     MOVE RPXXX05-KEY-ACCOUNT TO RPQUA-ACCOUNT.                   00732000
007330     MOVE RPXXX05-KEY-MODEL TO RPQUA-MODEL.                       00733000
007340     PERFORM RPS-QUA-GET-LOCK-REQUEST.                            00734000
007350     IF WS-FUNCTION IS EQUAL TO 'N'                               00735000
007360         GO TO UR-SEC.                                            00736000
007370     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00737000
007380         MOVE WS-AB6325 TO RPXXX05-ABORT                          00738000
007390         MOVE WS-TR0007 TO RPXXX05-ABTRACE                        00739000
007400         GO TO CICS-RETURN.                                       00740000
007410     ADD +1 TO RPQUA-ADDON-ACCTS.                                 00741000
007420     PERFORM RPS-QUA-REPUT-REQUEST.                               00742000
007430     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00743000
007440         MOVE WS-AB6325 TO RPXXX05-ABORT                          00744000
007450         MOVE WS-TR0008 TO RPXXX05-ABTRACE                        00745000
007460         GO TO CICS-RETURN.                                       00746000
007470     GO TO CICS-RETURN.                                           00747000
007480 UR-SEC.                                                          00748000
007490     INITIALIZE RPSEC-RECORD.                                     00749000
007500     MOVE RPREL-INST2 TO RPSEC-INST.                              00750000
007510     MOVE RPREL-PRODCODE2 TO RPSEC-PRODCODE.                      00751000
007520     MOVE RPREL-ACCOUNT2 TO RPSEC-ACCOUNT.                        00752000
007530     MOVE RPREL-MODEL TO RPSEC-MODEL2.                            00753000
007540     MOVE RPREL-INST TO RPSEC-INST2.                              00754000
007550     MOVE RPREL-PRODCODE TO RPSEC-PRODCODE2.                      00755000
007560     MOVE RPREL-ACCOUNT TO RPSEC-ACCOUNT2.                        00756000
007570     MOVE RPSEC-INST TO RPSEC-ALT-INST.                           00757000
007580     MOVE RPSEC-PRODCODE TO RPSEC-ALT-PRODCODE.                   00758000
007590     MOVE RPSEC-ACCOUNT TO RPSEC-ALT-ACCOUNT.                     00759000
007600     PERFORM RPS-SEC-PUT-REQUEST.                                 00760000
007610     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00761000
007620         MOVE WS-AB6335 TO RPXXX05-ABORT                          00762000
007630         MOVE WS-TR0009 TO RPXXX05-ABTRACE                        00763000
007640         GO TO CICS-RETURN.                                       00764000
007650     IF WS-ACT-FLAG IS NOT EQUAL TO 'Y'                           00765000
007660         GO TO UR-ACT.                                            00766000
007670     INITIALIZE RPACT-RECORD.                                     00767000
007680     MOVE RPSEC-ACCT1-GRP TO RPACT-GRP-KEY.                       00768000
007690     PERFORM RPS-ACT-GET-LOCK-REQUEST.                            00769000
007700     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00770000
007710         MOVE WS-AB6300 TO RPXXX05-ABORT                          00771000
007720         MOVE WS-TR0010 TO RPXXX05-ABTRACE                        00772000
007730         GO TO CICS-RETURN.                                       00773000
007740     GO TO UR-A-ACT.                                              00774000
007750 UR-ACT.                                                          00775000
007760     INITIALIZE RPACT-RECORD.                                     00776000
007770     MOVE RPSEC-ACCT1-GRP TO RPACT-GRP-KEY.                       00777000
007780     MOVE RPREL-APPL TO RPACT-APPL.                               00778000
007790     MOVE 'N' TO RPACT-SC-INC-QUAL.                               00779000
007800     MOVE 'N' TO RPACT-SC-INC-OPTION.                             00780000
007810     MOVE 'N' TO RPACT-RATE-INC-QUAL.                             00781000
007820     MOVE 'N' TO RPACT-RATE-INC-OPTION.                           00782000
007830     MOVE 'N' TO RPACT-PROCOPT.                                   00783000
007840 UR-A-ACT.                                                        00784000
007850     IF MIM-7102SECSCINCOPT IS EQUAL TO 'Y'                       00785000
007860         MOVE 'Y' TO RPACT-SC-INC-OPTION.                         00786000
007870     IF MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                     00787000
007880         MOVE 'Y' TO RPACT-RATE-INC-OPTION.                       00788000
007890     IF WS-ACT-FLAG IS EQUAL TO 'Y'                               00789000
007900         PERFORM RPS-ACT-REPUT-REQUEST                            00790000
007910     ELSE                                                         00791000
007920         PERFORM RPS-ACT-PUT-REQUEST.                             00792000
007930     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00793000
007940         MOVE WS-AB6300 TO RPXXX05-ABORT                          00794000
007950         MOVE WS-TR0011 TO RPXXX05-ABTRACE                        00795000
007960         GO TO CICS-RETURN.                                       00796000
007970 UR-EVT.                                                          00797000
007980     IF MIM-7100EVENTHISTORYOPT IS NOT EQUAL TO 'Y'               00798000
007990         OR WS-QUA-FLAG IS EQUAL TO 'Y'                           00799000
008000         GO TO CICS-RETURN.                                       00800000
008010     MOVE 07 TO RPS-EVT-EVENT-CODE.                               00801000
008020     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   00802000
008030     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   00803000
008040     MOVE RPXXX05-IDNUMBER TO RPS-EVT-IDNUMBER.                   00804000
008050     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        00805000
008060     PERFORM ADD-EVENT-HISTORY.                                   00806000
008070     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00807000
008080         MOVE WS-AB6360 TO RPXXX05-ABORT                          00808000
008090         MOVE WS-TR0016 TO RPXXX05-ABTRACE                        00809000
008100         GO TO CICS-RETURN.                                       00810000
008110     GO TO CICS-RETURN.                                           00811000
008120 UR-EXIT.                                                         00812000
008130     EXIT.                                                        00813000
008140******************************************************************00814000
008150 LOCATE-IDNUMBER-BY-APPL SECTION.                                 00815000
008160 LIBA-START.                                                      00816000
008170     MOVE RPXXX05-KEY-INST TO MIM-2023KINST.                      00817000
008180     MOVE 'RP' TO MIM-2023KPRODCODE.                              00818000
008190     MOVE RPXXX05-INST-OPT-1 TO SLW096-BANKS.                     00819000
008200     PERFORM SLP096-GET-2023-RECORD.                              00820000
008210     IF SLW096-FUNCTION IS EQUAL TO SPACES                        00821000
008220         GO TO LIBA-READ-IDX.                                     00822000
008230     MOVE ZERO TO WS-SUB1.                                        00823000
008240 LIBA-FIND-ACT-LOOP.                                              00824000
008250     ADD +1 TO WS-SUB1.                                           00825000
008260     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00826000
008270         MOVE 'N' TO WS-FUNCTION                                  00827000
008280         GO TO LIBA-EXIT.                                         00828000
008290     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00829000
008300         IS NOT EQUAL TO RPXXX05-APPL                             00830000
008310         GO TO LIBA-FIND-ACT-LOOP.                                00831000
008320     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO MIM-2023KPRODCODE.    00832000
008330 LIBA-READ-IDX.                                                   00833000
008340     MOVE RPXXX05-KEY-INST TO RPIDX-INST.                         00834000
008350     MOVE MIM-2023KPRODCODE TO RPIDX-PRODCODE.                    00835000
008360     MOVE RPXXX05-KEY-IDNUMBER TO RPIDX-IDNUMBER.                 00836000
008370     PERFORM RPS-IDX-GET-REQUEST.                                 00837000
008380     IF WS-FUNCTION IS EQUAL TO 'N'                               00838000
008390         GO TO LIBA-FIND-ACT-LOOP.                                00839000
008400     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00840000
008410         MOVE WS-AB6310 TO RPXXX05-ABORT                          00841000
008420         MOVE WS-TR0012 TO RPXXX05-ABTRACE                        00842000
008430         GO TO CICS-ABORT-EXIT.                                   00843000
008440     MOVE RPIDX-ACCT2-KEY TO RPXXX05-KEY-ACCT-GRP.                00844000
008450 LIBA-EXIT.                                                       00845000
008460     EXIT.                                                        00846000
008470******************************************************************00847000
008480 CHECK-EXISTING-RELATIONSHIP SECTION.                             00848000
008490 CER-START.                                                       00849000
008500     MOVE LOW-VALUES TO RPREL-GRP-KEY.                            00850000
008510     MOVE RPXXX05-KEY-INST TO RPREL-INST.                         00851000
008520     MOVE RPXXX05-KEY-PRODCODE TO RPREL-PRODCODE.                 00852000
008530     MOVE RPXXX05-KEY-ACCOUNT TO RPREL-ACCOUNT.                   00853000
008540     MOVE RPXXX05-KEY-MODEL TO RPREL-MODEL.                       00854000
008550     PERFORM RPS-REL-GET-GE-REQUEST.                              00855000
008560     GO TO CER-TEST.                                              00856000
008570 CER-READ-NEXT.                                                   00857000
008580     PERFORM RPS-REL-GET-NEXT-REQUEST.                            00858000
008590 CER-TEST.                                                        00859000
008600     IF WS-FUNCTION IS EQUAL TO 'E'                               00860000
008610         OR WS-FUNCTION IS EQUAL TO 'N'                           00861000
008620         GO TO CER-RCIF.                                          00862000
008630     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00863000
008640         MOVE WS-AB6330 TO RPXXX05-ABORT                          00864000
008650         MOVE WS-TR0013 TO RPXXX05-ABTRACE                        00865000
008660         MOVE 'EDT' TO RPXXX05-APIFUNC                            00866000
008670         GO TO CICS-RETURN.                                       00867000
008680     IF RPXXX05-KEY-INST IS NOT EQUAL TO RPREL-INST               00868000
008690         OR RPXXX05-KEY-PRODCODE IS NOT EQUAL TO RPREL-PRODCODE   00869000
008700         OR RPXXX05-KEY-ACCOUNT IS NOT EQUAL TO RPREL-ACCOUNT     00870000
008710         OR RPXXX05-KEY-MODEL IS NOT EQUAL TO RPREL-MODEL         00871000
008720         GO TO CER-RCIF.                                          00872000
008730     IF RPXXX05-ADD-INST IS EQUAL TO RPREL-INST2                  00873000
008740         AND RPXXX05-ADD-PRODCODE IS EQUAL TO RPREL-PRODCODE2     00874000
008750         AND RPXXX05-ADD-ACCOUNT IS EQUAL TO RPREL-ACCOUNT2       00875000
P0114          AND RPREL-ACCT-STATUS IS NOT EQUAL TO 'R'                00875500
008760         ADD +3 TO RPXXX05-ERRCNT                                 00876000
008770         MOVE 'Y' TO WS-ERROR                                     00877000
008780         MOVE 'E' TO RPXXX05-ADD-INST-DCHG                        00878000
008790         MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG                    00879000
008800         MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG                     00880000
008810         MOVE 500021 TO RPXXX05-MSGNBR                            00881000
008820         GO TO CER-EXIT.                                          00882000
008830     GO TO CER-READ-NEXT.                                         00883000
008840 CER-RCIF.                                                        00884000
P0114      IF WS-RELCHECK IS NOT EQUAL TO 'Y'                           00884100
P0114          GO TO CER-RCIF-CONT.                                     00884200
P0114      MOVE RPXXX05-KEY-INST TO WS-RPW008-INST.                     00884300
P0114      MOVE WS-RPMIM7104SC TO WS-RPW008-RELCODE.                    00884400
P0114      PERFORM VALIDATE-PRIM-RELCD.                                 00884500
P0114      IF WS-PRIMRELCD-ERROR IS EQUAL TO 'Y'                        00884600
P0114          GO TO CER-SECONDARY.                                     00884700
P0114  CER-RCIF-CONT.                                                   00884800
008850     INITIALIZE RPRF21-MESSAGE.                                   00885000
008860     MOVE 'B' TO RPRF21-FUNC.                                     00886000
008870     MOVE RPXXX05-RCIF-KEY TO RPRF21-BASE-RCIF-KEY.               00887000
008880     MOVE LOW-VALUES TO RPRF21-BASE-ACCOUNT.                      00888000
008890     PERFORM REQUEST-CUSTOMER.                                    00889000
008900     GO TO CER-RCIF-TEST.                                         00890000
008910 CER-RCIF-NEXT.                                                   00891000
008920     MOVE 'C' TO RPRF21-FUNC.                                     00892000
008930     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00893000
008940         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00894000
008950         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00895000
008960     PERFORM REQUEST-CUSTOMER.                                    00896000
008970 CER-RCIF-TEST.                                                   00897000
008980     IF WS-FUNCTION IS EQUAL TO 'N'                               00898000
008990         GO TO CER-SECONDARY.                                     00899000
009000     IF WS-FUNCTION IS EQUAL TO 'C'                               00900000
009010         MOVE 'Y' TO WS-ERROR                                     00901000
009020         MOVE 500037 TO RPXXX05-MSGNBR                            00902000
009030         GO TO CER-EXIT.                                          00903000
009040     IF WS-FUNCTION IS EQUAL TO 'I'                               00904000
009050         MOVE 'Y' TO WS-ERROR                                     00905000
009060         MOVE 500038 TO RPXXX05-MSGNBR                            00906000
009070         GO TO CER-EXIT.                                          00907000
009080     IF RPXXX05-ADD-INST IS EQUAL TO RPRF21-ACCT-ALT-INST         00908000
009090         AND RPXXX05-ADD-PRODCODE IS EQUAL TO                     00909000
009100             RPRF21-BASE-ACCT-PRODCODE                            00910000
009110         AND RPXXX05-ADD-ACCOUNT IS EQUAL TO RPRF21-BASE-ACCT     00911000
009120         ADD +3 TO RPXXX05-ERRCNT                                 00912000
009130         MOVE 'Y' TO WS-ERROR                                     00913000
009140         MOVE 'E' TO RPXXX05-ADD-INST-DCHG                        00914000
009150         MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG                    00915000
009160         MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG                     00916000
009170         MOVE 500020 TO RPXXX05-MSGNBR                            00917000
009180         GO TO CER-EXIT.                                          00918000
009190     GO TO CER-RCIF-NEXT.                                         00919000
009200 CER-SECONDARY.                                                   00920000
009210* CHECK TO SECONDARY ACCOUNTS AND SEND ERROR MESSAGE IF           00921000
009220* MATCH IS FOUND WITH ACCOUNT BEING ADDED.                        00922000
009230     MOVE RPXXX05-KEY-INST TO RPRF21-BASE-ACCT-INST.              00923000
009240     MOVE RPXXX05-KEY-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.      00924000
009250     MOVE RPXXX05-KEY-ACCOUNT TO RPRF21-BASE-ACCT.                00925000
009260     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00926000
009270         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00927000
009280         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00928000
009290     IF WS-RELCHECK IS EQUAL TO 'Y'                               00929000
009300         PERFORM REQUEST-SECONDARY-CUSTOMER                       00930000
009310         ELSE                                                     00931000
009320         MOVE ZERO TO WS-SECONDARY-CUST.                          00932000
009330     IF WS-SECONDARY-CUST IS EQUAL TO ZERO                        00933000
009340         GO TO CER-EXIT.                                          00934000
009350* **                                                              00935000
009360 CSER-NEXT-SECONDARY.                                             00936000
009370     ADD +1 TO WS-SCSUB.                                          00937000
009380     IF WS-SCSUB IS GREATER THAN WS-SECONDARY-CUST                00938000
009390         GO TO CER-EXIT.                                          00939000
009400                                                                  00940000
009410     MOVE WS-SEC-INST (WS-SCSUB) TO WS-NEW-INST.                  00941000
009420     MOVE WS-SEC-CUST-TYPE (WS-SCSUB) TO WS-NEW-CUST-TYPE.        00942000
009430     MOVE WS-SEC-CUST (WS-SCSUB) TO WS-NEW-CUST.                  00943000
009440     MOVE WS-NEW-CUSTKEY TO RPRF21-BASE-CUSTOMER.                 00944000
009450     MOVE WS-NEW-CUSTKEY TO RPXXX05-RCIF-KEY.                     00945000
009460     MOVE 'B' TO RPRF21-FUNC.                                     00946000
009470     MOVE SPACES TO RPRF21-BASE-ACCOUNT.                          00947000
009480     MOVE ZEROS TO RPRF21-BASE-ACCT-INST.                         00948000
009490* **                                                              00949000
009500     GO TO CSER-RCIF.                                             00950000
009510* **                                                              00951000
009520 CSER-RCIF.                                                       00952000
009530     INITIALIZE RPRF21-MESSAGE.                                   00953000
009540     MOVE 'B' TO RPRF21-FUNC.                                     00954000
009550     MOVE RPXXX05-RCIF-KEY TO RPRF21-BASE-RCIF-KEY.               00955000
009560     MOVE LOW-VALUES TO RPRF21-BASE-ACCOUNT.                      00956000
009570     PERFORM REQUEST-CUSTOMER.                                    00957000
009580     GO TO CSER-RCIF-TEST.                                        00958000
009590 CSER-RCIF-NEXT.                                                  00959000
009600     MOVE 'C' TO RPRF21-FUNC.                                     00960000
009610     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00961000
009620         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00962000
009630         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00963000
009640     PERFORM REQUEST-CUSTOMER.                                    00964000
009650 CSER-RCIF-TEST.                                                  00965000
009660     IF WS-FUNCTION IS EQUAL TO 'N'                               00966000
009670         GO TO CSER-NEXT-SECONDARY.                               00967000
009680     IF WS-FUNCTION IS EQUAL TO 'C'                               00968000
009690         GO TO CER-EXIT.                                          00969000
009700     IF WS-FUNCTION IS EQUAL TO 'I'                               00970000
009710         GO TO CER-EXIT.                                          00971000
009720* TEST IF ACCOUNT TO ADD IS A SECONDARY ACCOUNT                   00972000
009730     IF RPXXX05-ADD-INST IS EQUAL TO RPRF21-ACCT-ALT-INST         00973000
009740         AND RPXXX05-ADD-PRODCODE IS EQUAL TO                     00974000
009750             RPRF21-BASE-ACCT-PRODCODE                            00975000
009760         AND RPXXX05-ADD-ACCOUNT IS EQUAL TO RPRF21-BASE-ACCT     00976000
009770         ADD +3 TO RPXXX05-ERRCNT                                 00977000
009780         MOVE 'Y' TO WS-ERROR                                     00978000
009790         MOVE 'E' TO RPXXX05-ADD-INST-DCHG                        00979000
009800         MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG                    00980000
009810         MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG                     00981000
009820         MOVE 500640 TO RPXXX05-MSGNBR                            00982000
009830         GO TO CER-EXIT.                                          00983000
009840     GO TO CSER-RCIF-NEXT.                                        00984000
009850* ** **                                                           00985000
009860 CER-EXIT.                                                        00986000
009870     EXIT.                                                        00987000
009880******************************************************************00988000
009890 VALIDATE-MODEL-REQUIREMENTS SECTION.                             00989000
009900 VMR-START.                                                       00990000
009910     MOVE RPXXX05-ADD-INST TO RPRF21-BASE-ACCT-INST.              00991000
009920     MOVE RPXXX05-ADD-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.      00992000
009930     MOVE RPXXX05-ADD-ACCOUNT TO RPRF21-BASE-ACCT.                00993000
009940     IF RPRF21-BASE-ACCT-PRODCODE IS EQUAL TO MIM-2023KPRODCODE   00994000
009950         GO TO VMR-2023.                                          00995000
009960     PERFORM READ-MICM-2023.                                      00996000
009970 VMR-2023.                                                        00997000
009980     IF MIM-2023RPOPTION IS EQUAL TO ' '                          00998000
009990         OR MIM-2023RPOPTION IS EQUAL TO 'N'                      00999000
010000         MOVE 'N' TO MIM-2023RPOPTION.                            01000000
010010     IF MIM-2023RPOPTION IS EQUAL TO 'N'                          01001000
010020         MOVE 500015 TO RPXXX05-MSGNBR                            01002000
010030         GO TO VMR-ERROR.                                         01003000
010040     IF MIM-2023RPOPTION IS NOT EQUAL TO 'Y'                      01004000
010050         MOVE ZEROS TO RPINF00-BRANCH                             01005000
010060         MOVE ZEROS TO RPINF00-ACCT-TYPE                          01006000
010070         MOVE MIM-2023INTAPPL211 TO RPINF00-APPLR                 01007000
010080         MOVE 'N' TO WS-INTERFACE                                 01008000
010090         GO TO VMR-7102.                                          01009000
010100     PERFORM READ-MICM-0237.                                      01010000
010110     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01011000
010120         OR MIM-237OLINTFC IS NOT GREATER THAN SPACES             01012000
010130         MOVE 500024 TO RPXXX05-MSGNBR                            01013000
010140         GO TO VMR-ERROR.                                         01014000
010150     PERFORM LINK-INTERFACE.                                      01015000
010160     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01016000
010170         GO TO VMR-ERROR.                                         01017000
010180 VMR-7102.                                                        01018000
010190     PERFORM READ-MICM-7102.                                      01019000
010200     IF WS-7102-FLAG IS EQUAL TO 'N'                              01020000
010210         MOVE 500007 TO RPXXX05-MSGNBR                            01021000
010220         GO TO VMR-ERROR.                                         01022000
010230     IF RPINF00-TERM IS NOT NUMERIC                               01023000
010240         MOVE ZEROS TO RPINF00-TERM.                              01024000
010250 VMR-MIN-TERM.                                                    01025000
010260     IF (MIM-7102MINTERM-Q IS NOT EQUAL TO 'B'                    01026000
010270         AND MIM-7102MINTERM-Q IS NOT EQUAL TO 'E')               01027000
010280         OR MIM-7102MINTERM IS NOT GREATER THAN ZERO              01028000
010290         GO TO VMR-MAX-TERM.                                      01029000
010300     IF RPINF00-TERM IS LESS THAN MIM-7102MINTERM                 01030000
010310         MOVE 500047 TO RPXXX05-MSGNBR                            01031000
010320         GO TO VMR-ERROR.                                         01032000
010330 VMR-MAX-TERM.                                                    01033000
010340     IF (MIM-7102MAXTERM-Q IS NOT EQUAL TO 'B'                    01034000
010350         AND MIM-7102MAXTERM-Q IS NOT EQUAL TO 'E')               01035000
010360         OR MIM-7102MAXTERM IS NOT GREATER THAN ZERO              01036000
010370         GO TO VMR-USEROPT1.                                      01037000
010380     IF RPINF00-TERM IS GREATER THAN MIM-7102MAXTERM              01038000
010390         MOVE 500048 TO RPXXX05-MSGNBR                            01039000
010400         GO TO VMR-ERROR.                                         01040000
010410 VMR-USEROPT1.                                                    01041000
010420     IF MIM-7102USERTYPE1 IS EQUAL TO 'P'                         01042000
010430         GO TO VMR-USEROPT2.                                      01043000
010440     IF (MIM-7102USEROPT1-Q IS NOT EQUAL TO 'B'                   01044000
010450         AND MIM-7102USEROPT1-Q IS NOT EQUAL TO 'E')              01045000
010460         GO TO VMR-USEROPT2.                                      01046000
010470     IF (MIM-7102USEROPTREL1 IS EQUAL TO 'EQ'                     01047000
010480         AND RPINF00-USEROPT1 IS NOT EQUAL TO MIM-7102USEROPT1)   01048000
010490         OR (MIM-7102USEROPTREL1 IS EQUAL TO 'NE'                 01049000
010500         AND RPINF00-USEROPT1 IS EQUAL TO MIM-7102USEROPT1)       01050000
010510         MOVE 500083 TO RPXXX05-MSGNBR                            01051000
010520         GO TO VMR-ERROR.                                         01052000
010530 VMR-USEROPT2.                                                    01053000
010540     IF MIM-7102USERTYPE2 IS EQUAL TO 'P'                         01054000
010550         GO TO VMR-USEROPT3.                                      01055000
010560     IF (MIM-7102USEROPT2-Q IS NOT EQUAL TO 'B'                   01056000
010570         AND MIM-7102USEROPT2-Q IS NOT EQUAL TO 'E')              01057000
010580         GO TO VMR-USEROPT3.                                      01058000
010590     IF (MIM-7102USEROPTREL2 IS EQUAL TO 'EQ'                     01059000
010600         AND RPINF00-USEROPT2 IS NOT EQUAL TO MIM-7102USEROPT2)   01060000
010610         OR (MIM-7102USEROPTREL2 IS EQUAL TO 'NE'                 01061000
010620         AND RPINF00-USEROPT2 IS EQUAL TO MIM-7102USEROPT2)       01062000
010630         MOVE 500084 TO RPXXX05-MSGNBR                            01063000
010640         GO TO VMR-ERROR.                                         01064000
010650 VMR-USEROPT3.                                                    01065000
010660     IF MIM-7102USERTYPE3 IS EQUAL TO 'P'                         01066000
010670         GO TO VMR-USEROPT4.                                      01067000
010680     IF (MIM-7102USEROPT3-Q IS NOT EQUAL TO 'B'                   01068000
010690         AND MIM-7102USEROPT3-Q IS NOT EQUAL TO 'E')              01069000
010700         GO TO VMR-USEROPT4.                                      01070000
010710     IF (MIM-7102USEROPTREL3 IS EQUAL TO 'EQ'                     01071000
010720         AND RPINF00-USEROPT3 IS NOT EQUAL TO MIM-7102USEROPT3)   01072000
010730         OR (MIM-7102USEROPTREL3 IS EQUAL TO 'NE'                 01073000
010740         AND RPINF00-USEROPT3 IS EQUAL TO MIM-7102USEROPT3)       01074000
010750         MOVE 500085 TO RPXXX05-MSGNBR                            01075000
010760         GO TO VMR-ERROR.                                         01076000
010770 VMR-USEROPT4.                                                    01077000
010780     IF MIM-7102USERTYPE4 IS EQUAL TO 'P'                         01078000
010790         GO TO VMR-BALANCES.                                      01079000
010800     IF (MIM-7102USEROPT4-Q IS NOT EQUAL TO 'B'                   01080000
010810         AND MIM-7102USEROPT4-Q IS NOT EQUAL TO 'E')              01081000
010820         GO TO VMR-BALANCES.                                      01082000
010830     IF (MIM-7102USEROPTREL4 IS EQUAL TO 'EQ'                     01083000
010840         AND RPINF00-USEROPT4 IS NOT EQUAL TO MIM-7102USEROPT4)   01084000
010850         OR (MIM-7102USEROPTREL4 IS EQUAL TO 'NE'                 01085000
010860         AND RPINF00-USEROPT4 IS EQUAL TO MIM-7102USEROPT4)       01086000
010870         MOVE 500086 TO RPXXX05-MSGNBR                            01087000
010880         GO TO VMR-ERROR.                                         01088000
010890 VMR-BALANCES.                                                    01089000
010900     IF MIM-2023RPOPTION IS NOT EQUAL TO 'Y'                      01090000
010910         GO TO VMR-INCENTIVE.                                     01091000
010920     IF MIM-7102PRIMCATCD-Q IS NOT EQUAL TO 'E'                   01092000
010930         GO TO VMR-BALCATCD.                                      01093000
010940     IF MIM-7102PRIMCATCD IS EQUAL TO SPACES                      01094000
010950         MOVE 502015 TO RPXXX05-MSGNBR                            01095000
010960         GO TO VMR-ERROR.                                         01096000
010970     MOVE MIM-7102PRIMCATCD TO WS-WORK-CATCD.                     01097000
010980     PERFORM READ-MICM-7106.                                      01098000
010990     IF WS-FUNCTION IS EQUAL TO 'N'                               01099000
011000         MOVE 502015 TO RPXXX05-MSGNBR                            01100000
011010         GO TO VMR-ERROR.                                         01101000
011020     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01102000
011030     PERFORM GET-BALANCE.                                         01103000
011040     IF WS-WORK-BALANCE IS LESS THAN MIM-7106BALREQ-E             01104000
011050         MOVE 502016 TO RPXXX05-MSGNBR                            01105000
011060         GO TO VMR-ERROR.                                         01106000
011070 VMR-BALCATCD.                                                    01107000
011080     MOVE 'N' TO WS-BALCATCD1-FAIL.                               01108000
011090     IF MIM-7101PRIMBALOPT-Q IS NOT EQUAL TO 'E'                  01109000
011100         GO TO VMR-INCENTIVE.                                     01110000
011110     IF MIM-7101PRIMBALOPT IS EQUAL TO 'N'                        01111000
011120         GO TO VMR-INCENTIVE.                                     01112000
011130     IF MIM-7101ACCTRELCD-Q IS NOT EQUAL TO 'E'                   01113000
011140         GO TO VMR-INCENTIVE.                                     01114000
011150     IF MIM-7101ACCTRELCDQ IS NOT EQUAL TO 'A'                    01115000
011160         GO TO VMR-INCENTIVE.                                     01116000
011170     IF MIM-7102BALCATCD1-Q IS NOT EQUAL TO 'E'                   01117000
011180         GO TO VMR-BALCATCD2.                                     01118000
011190     IF MIM-7102BALCATCD1 IS EQUAL TO SPACES                      01119000
011200         MOVE 502017 TO RPXXX05-MSGNBR                            01120000
011210         GO TO VMR-ERROR.                                         01121000
011220     MOVE MIM-7102BALCATCD1 TO WS-WORK-CATCD.                     01122000
011230     PERFORM READ-MICM-7106.                                      01123000
011240     IF WS-FUNCTION IS EQUAL TO 'N'                               01124000
011250         MOVE 502017 TO RPXXX05-MSGNBR                            01125000
011260         GO TO VMR-ERROR.                                         01126000
011270     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01127000
011280     PERFORM GET-BALANCE.                                         01128000
011290     IF WS-WORK-BALANCE IS NOT LESS THAN MIM-7106BALREQ-E         01129000
011300         GO TO VMR-INCENTIVE.                                     01130000
011310     MOVE 'Y' TO WS-BALCATCD1-FAIL.                               01131000
011320 VMR-BALCATCD2.                                                   01132000
011330     IF MIM-7102BALCATCD2-Q IS NOT EQUAL TO 'E'                   01133000
011340         AND WS-BALCATCD1-FAIL IS EQUAL TO 'Y'                    01134000
011350         MOVE 502019 TO RPXXX05-MSGNBR                            01135000
011360         GO TO VMR-ERROR.                                         01136000
011370     IF MIM-7102BALCATCD2-Q IS NOT EQUAL TO 'E'                   01137000
011380         GO TO VMR-INCENTIVE.                                     01138000
011390     IF MIM-7102BALCATCD2 IS EQUAL TO SPACES                      01139000
011400         MOVE 502018 TO RPXXX05-MSGNBR                            01140000
011410         GO TO VMR-ERROR.                                         01141000
011420     MOVE MIM-7102BALCATCD2 TO WS-WORK-CATCD.                     01142000
011430     PERFORM READ-MICM-7106.                                      01143000
011440     IF WS-FUNCTION IS EQUAL TO 'N'                               01144000
011450         MOVE 502018 TO RPXXX05-MSGNBR                            01145000
011460         GO TO VMR-ERROR.                                         01146000
011470     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01147000
011480     PERFORM GET-BALANCE.                                         01148000
011490     IF WS-WORK-BALANCE IS LESS THAN MIM-7106BALREQ-E             01149000
011500         MOVE 502019 TO RPXXX05-MSGNBR                            01150000
011510         GO TO VMR-ERROR.                                         01151000
011520 VMR-INCENTIVE.                                                   01152000
011530     IF WS-ACT-FLAG IS NOT EQUAL TO 'Y'                           01153000
011540         OR MIM-7100ADDONINCOPT IS EQUAL TO 'N'                   01154000
011550         OR MIM-7100DUPINCOPT IS EQUAL TO 'Y'                     01155000
011560         GO TO VMR-7107.                                          01156000
011570     IF (MIM-7102SECSCINCOPT IS EQUAL TO 'Y'                      01157000
011580         AND RPACT-SC-INC-OPTION IS EQUAL TO 'Y')                 01158000
011590         OR (MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                01159000
011600         AND RPACT-RATE-INC-OPTION IS EQUAL TO 'Y')               01160000
011610         MOVE 500027 TO RPXXX05-MSGNBR                            01161000
011620         GO TO VMR-ERROR.                                         01162000
011630 VMR-7107.                                                        01163000
011640     IF MIM-7102BRCHREGIONCD IS NOT GREATER THAN SPACES           01164000
011650         OR (MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'B'           01165000
011660         AND MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'E')          01166000
011670         GO TO VMR-USER-EXIT.                                     01167000
011680     IF RPINF00-BRANCH IS EQUAL TO ZEROS                          01168000
011690         GO TO VMR-USER-EXIT.                                     01169000
011700     MOVE RPXXX05-KEY-INST TO WS-RPMIM7107INST.                   01170000
011710     MOVE RPXXX05-ADD-INST TO WS-RPMIM7107INST2.                  01171000
011720     MOVE RPINF00-BRANCH TO WS-RPMIM7107BRCHREGION.               01172000
011730     MOVE MIM-7102BRCHREGIONCD TO WS-RPMIM7107RPREC.              01173000
011740     PERFORM VALIDATE-BRANCH.                                     01174000
011750     IF WS-RPMIM7107ERROR IS NOT EQUAL TO SPACES                  01175000
011760         MOVE 500030 TO RPXXX05-MSGNBR                            01176000
011770         GO TO VMR-ERROR.                                         01177000
011780 VMR-USER-EXIT.                                                   01178000
011790     IF MIM-7102USERRTN IS NOT EQUAL TO 'Y'                       01179000
011800         OR (MIM-7102USERRTN-Q IS NOT EQUAL TO 'B'                01180000
011810         AND MIM-7102USERRTN-Q IS NOT EQUAL TO 'E')               01181000
011820         GO TO VMR-EXIT.                                          01182000
011830     PERFORM USER-EXIT.                                           01183000
011840     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01184000
011850         OR RPUSER-PASSED IS NOT EQUAL TO 'Y'                     01185000
011860         MOVE 500031 TO RPXXX05-MSGNBR                            01186000
011870         GO TO VMR-ERROR.                                         01187000
011880     GO TO VMR-EXIT.                                              01188000
011890 VMR-ERROR.                                                       01189000
011900     ADD +3 TO RPXXX05-ERRCNT.                                    01190000
011910     MOVE 'Y' TO WS-ERROR.                                        01191000
011920     MOVE 'E' TO RPXXX05-ADD-INST-DCHG.                           01192000
011930     MOVE 'E' TO RPXXX05-ADD-PRODCODE-DCHG.                       01193000
011940     MOVE 'E' TO RPXXX05-ADD-ACCOUNT-DCHG.                        01194000
011950 VMR-EXIT.                                                        01195000
011960     EXIT.                                                        01196000
011970******************************************************************01197000
011980 REQUEST-CUSTOMER SECTION.                                        01198000
011990 RC-START.                                                        01199000
012000     MOVE SPACES TO RPRF21-FUNCTION.                              01200000
012010     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             01201000
012020     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         01202000
012030     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          01203000
012040     EXEC CICS LINK                                               01204000
012050         PROGRAM('RPO0RF21')                                      01205000
012060         COMMAREA(RPRF21-MESSAGE)                                 01206000
012070         LENGTH(LENGTH OF RPRF21-MESSAGE)                         01207000
012080         RESP(WS-CICS-RESPONSE)                                   01208000
012090         END-EXEC.                                                01209000
012100     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         01210000
012110     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     01211000
012120         MOVE 'L' TO WS-FUNCTION                                  01212000
012130         MOVE 500036 TO WS-MSGNBR                                 01213000
012140         GO TO RC-EXIT.                                           01214000
012150     IF WS-FUNCTION IS EQUAL TO 'B'                               01215000
012160         MOVE 500045 TO WS-MSGNBR                                 01216000
012170         GO TO RC-EXIT.                                           01217000
012180     IF WS-FUNCTION IS EQUAL TO 'C'                               01218000
012190         MOVE 500037 TO WS-MSGNBR                                 01219000
012200         GO TO RC-EXIT.                                           01220000
012210     IF WS-FUNCTION IS EQUAL TO 'I'                               01221000
012220         MOVE 500038 TO WS-MSGNBR.                                01222000
012230 RC-EXIT.                                                         01223000
012240     EXIT.                                                        01224000
012250******************************************************************01225000
012260 FIND-DEFAULT-MODEL SECTION.                                      01226000
012270 FDM-START.                                                       01227000
012280     MOVE 'N' TO WS-MST-FOUND.                                    01228000
012290     MOVE 'N' TO WS-ERROR.                                        01229000
012300     MOVE RPXXX05-KEY-INST TO RPMST-INST.                         01230000
012310     MOVE RPXXX05-KEY-PRODCODE TO RPMST-PRODCODE.                 01231000
012320     MOVE RPXXX05-KEY-ACCOUNT TO RPMST-ACCOUNT.                   01232000
012330     IF RPXXX05-KEY-MODEL IS EQUAL TO LOW-VALUE                   01233000
012340         MOVE SPACES TO RPXXX05-KEY-MODEL.                        01234000
012350     MOVE RPXXX05-KEY-MODEL TO RPMST-MODEL.                       01235000
012360     PERFORM RPS-MST-GET-GE-REQUEST.                              01236000
012370     IF WS-FUNCTION IS EQUAL TO 'N'                               01237000
012380         OR WS-FUNCTION IS EQUAL TO 'E'                           01238000
012390         GO TO FDM-CHECK-QUA.                                     01239000
012400     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01240000
012410         MOVE WS-AB6320 TO RPXXX05-ABORT                          01241000
012420         MOVE WS-TR0017 TO RPXXX05-ABTRACE                        01242000
012430         MOVE 'Y' TO WS-ERROR                                     01243000
012440         GO TO FDM-EXIT.                                          01244000
012450* USE THIS IS THERE IS ONLY ONE                                   01245000
012460     IF RPMST-INST IS EQUAL TO RPXXX05-KEY-INST                   01246000
012470         AND RPMST-PRODCODE IS EQUAL TO RPXXX05-KEY-PRODCODE      01247000
012480         AND RPMST-ACCOUNT IS EQUAL TO RPXXX05-KEY-ACCOUNT        01248000
012490         MOVE 'Y' TO WS-MST-FOUND                                 01249000
012500         GO TO FDM-GET-NEXT-MST.                                  01250000
012510     GO TO FDM-CHECK-QUA.                                         01251000
012520 FDM-GET-NEXT-MST.                                                01252000
012530     MOVE RPMST-MODEL TO RPXXX05-KEY-MODEL.                       01253000
012540     MOVE RPXXX05-KEY-INST TO WS-SAVEMSTINST.                     01254000
012550     MOVE RPXXX05-KEY-PRODCODE TO WS-SAVEMSTPRODCODE.             01255000
012560     MOVE RPXXX05-KEY-ACCOUNT TO WS-SAVEMSTACCOUNT.               01256000
012570     MOVE RPXXX05-KEY-MODEL TO WS-SAVEMSTMODEL.                   01257000
012580     PERFORM RPS-MST-GET-NEXT-REQUEST.                            01258000
012590     IF WS-FUNCTION IS EQUAL TO 'E'                               01259000
012600         IF WS-MST-FOUND IS EQUAL TO 'Y'                          01260000
012610             GO TO FDM-GOOD-RECORD                                01261000
012620         ELSE                                                     01262000
012630             GO TO FDM-CHECK-QUA.                                 01263000
012640     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01264000
012650         MOVE WS-AB6320 TO RPXXX05-ABORT                          01265000
012660         MOVE WS-TR0018 TO RPXXX05-ABTRACE                        01266000
012670         MOVE 'Y' TO WS-ERROR                                     01267000
012680         GO TO FDM-EXIT.                                          01268000
012690     IF RPMST-INST IS EQUAL TO RPXXX05-KEY-INST                   01269000
012700         AND RPMST-PRODCODE IS EQUAL TO RPXXX05-KEY-PRODCODE      01270000
012710         AND RPMST-ACCOUNT IS EQUAL TO RPXXX05-KEY-ACCOUNT        01271000
012720         GO TO FDM-MULTIPLE-PRIM.                                 01272000
012730     IF WS-MST-FOUND IS EQUAL TO 'Y'                              01273000
012740         GO TO FDM-GOOD-RECORD.                                   01274000
012750     MOVE 'Y' TO WS-ERROR.                                        01275000
012760     GO TO FDM-EXIT.                                              01276000
012770 FDM-CHECK-QUA.                                                   01277000
012780* ONLY WHEN NO MST IS FOUND                                       01278000
012790     MOVE RPXXX05-KEY-INST TO RPQUA-INST.                         01279000
012800     MOVE RPXXX05-KEY-PRODCODE TO RPQUA-PRODCODE.                 01280000
012810     MOVE RPXXX05-KEY-ACCOUNT TO RPQUA-ACCOUNT.                   01281000
012820     MOVE SPACES TO RPQUA-MODEL.                                  01282000
012830     PERFORM RPS-QUA-GET-GE-REQUEST.                              01283000
012840* ** IF (WS-FUNCTION IS EQUAL TO 'N'                              01284000
012850* **     OR WS-FUNCTION IS EQUAL TO 'E')                          01285000
012860* **     AND WS-MST-FOUND IS EQUAL TO 'Y'                         01286000
012870* **     GO TO FDM-GOOD-RECORD.                                   01287000
012880     IF WS-FUNCTION IS EQUAL TO 'N'                               01288000
012890         OR WS-FUNCTION IS EQUAL TO 'E'                           01289000
012900         GO TO FDM-RECORD-NOT-FOUND.                              01290000
012910     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01291000
012920         MOVE WS-AB6325 TO RPXXX05-ABORT                          01292000
012930         MOVE WS-TR0019 TO RPXXX05-ABTRACE                        01293000
012940         MOVE 'Y' TO WS-ERROR                                     01294000
012950         GO TO FDM-EXIT.                                          01295000
012960* ** IF RPQUA-INST IS EQUAL TO RPXXX05-KEY-INST                   01296000
012970* **     AND RPQUA-PRODCODE IS EQUAL TO RPXXX05-KEY-PRODCODE      01297000
012980* **     AND RPQUA-ACCOUNT IS EQUAL TO RPXXX05-KEY-ACCOUNT        01298000
012990* **     AND WS-MST-FOUND IS EQUAL TO 'Y'                         01299000
013000* **     GO TO FDM-MULTIPLE-PRIM.                                 01300000
013010     IF RPQUA-INST IS EQUAL TO RPXXX05-KEY-INST                   01301000
013020         AND RPQUA-PRODCODE IS EQUAL TO RPXXX05-KEY-PRODCODE      01302000
013030         AND RPQUA-ACCOUNT IS EQUAL TO RPXXX05-KEY-ACCOUNT        01303000
013040         GO TO FDM-GET-NEXT-QUA.                                  01304000
013050* IF NO MST AND NO QUA                                            01305000
013060     GO TO FDM-RECORD-NOT-FOUND.                                  01306000
013070 FDM-GET-NEXT-QUA.                                                01307000
013080     MOVE RPQUA-MODEL TO RPXXX05-KEY-MODEL.                       01308000
013090     MOVE RPXXX05-KEY-INST TO WS-SAVEMSTINST.                     01309000
013100     MOVE RPXXX05-KEY-PRODCODE TO WS-SAVEMSTPRODCODE.             01310000
013110     MOVE RPXXX05-KEY-ACCOUNT TO WS-SAVEMSTACCOUNT.               01311000
013120     MOVE RPXXX05-KEY-MODEL TO WS-SAVEMSTMODEL.                   01312000
013130     PERFORM RPS-QUA-GET-NEXT-REQUEST.                            01313000
013140     IF WS-FUNCTION IS EQUAL TO 'E'                               01314000
013150         GO TO FDM-GOOD-RECORD.                                   01315000
013160     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01316000
013170         MOVE WS-AB6325 TO RPXXX05-ABORT                          01317000
013180         MOVE WS-TR0020 TO RPXXX05-ABTRACE                        01318000
013190         MOVE 'Y' TO WS-ERROR                                     01319000
013200         GO TO FDM-EXIT.                                          01320000
013210     IF RPQUA-INST IS EQUAL TO RPXXX05-KEY-INST                   01321000
013220         AND RPQUA-PRODCODE IS EQUAL TO RPXXX05-KEY-PRODCODE      01322000
013230         AND RPQUA-ACCOUNT IS EQUAL TO RPXXX05-KEY-ACCOUNT        01323000
013240         GO TO FDM-MULTIPLE-PRIM.                                 01324000
013250 FDM-GOOD-RECORD.                                                 01325000
013260     MOVE WS-SAVEMSTINST TO RPXXX05-KEY-INST.                     01326000
013270     MOVE WS-SAVEMSTPRODCODE TO RPXXX05-KEY-PRODCODE.             01327000
013280     MOVE WS-SAVEMSTACCOUNT TO RPXXX05-KEY-ACCOUNT.               01328000
013290     MOVE WS-SAVEMSTMODEL TO RPXXX05-KEY-MODEL.                   01329000
013300     GO TO FDM-EXIT.                                              01330000
013310 FDM-RECORD-NOT-FOUND.                                            01331000
013320     MOVE 'Y' TO WS-ERROR.                                        01332000
013330     MOVE 500004 TO RPXXX05-MSGNBR.                               01333000
013340     GO TO FDM-EXIT.                                              01334000
013350 FDM-MULTIPLE-PRIM.                                               01335000
013360     MOVE 'Y' TO WS-ERROR.                                        01336000
013370     MOVE 500090 TO RPXXX05-MSGNBR.                               01337000
013380 FDM-EXIT.                                                        01338000
013390     EXIT.                                                        01339000
013400******************************************************************01340000
013410 LINK-INTERFACE SECTION.                                          01341000
013420 LINT-START.                                                      01342000
013430     MOVE SPACES TO RPINF00-MESSAGE.                              01343000
013440     MOVE MIM-237OLINTFC TO WS-PROGRAM.                           01344000
013450     MOVE RPXXX05-ADD-INST TO RPINF00-INST.                       01345000
013460     MOVE RPXXX05-ADD-PRODCODE TO RPINF00-PRODCODE.               01346000
013470     MOVE RPXXX05-ADD-ACCOUNT TO RPINF00-ACCOUNT.                 01347000
013480     MOVE MIM-2023INTAPPL211 TO RPINF00-APPLR.                    01348000
013490     MOVE MIM-7101CLOSEDACCTOPT TO RPINF00-CLOSEDACCTOPT.         01349000
013500     MOVE RPXXX05-CONTROLS TO RPINF00-CONTROLS.                   01350000
013510     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     01351000
013520         AND RPXXX05-KEY-INST IS NOT EQUAL TO RPINF00-INST        01352000
013530         MOVE SLS140-FILEOPTS2 TO RPINF00-FILEOPTS.               01353000
013540     MOVE 'N' TO RPINF00-GLOBAL-CLOSE.                            01354000
013550     EXEC CICS LINK                                               01355000
013560         PROGRAM(WS-PROGRAM)                                      01356000
013570         COMMAREA(RPINF00-MESSAGE)                                01357000
013580         LENGTH(LENGTH OF RPINF00-MESSAGE)                        01358000
013590         RESP(WS-CICS-RESPONSE)                                   01359000
013600         END-EXEC.                                                01360000
013610     MOVE RPINF00-FUNCTION TO WS-FUNCTION.                        01361000
013620     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     01362000
013630         MOVE 'L' TO WS-FUNCTION                                  01363000
013640         MOVE 500039 TO RPXXX05-MSGNBR                            01364000
013650         GO TO LINT-EXIT.                                         01365000
013660     IF WS-FUNCTION IS EQUAL TO 'D'                               01366000
013670         MOVE 500087 TO RPXXX05-MSGNBR                            01367000
013680         GO TO LINT-EXIT.                                         01368000
013690     IF WS-FUNCTION IS EQUAL TO 'L'                               01369000
013700         OR WS-FUNCTION IS EQUAL TO 'N'                           01370000
013710         MOVE 500040 TO RPXXX05-MSGNBR                            01371000
013720         GO TO LINT-EXIT.                                         01372000
013730     IF WS-FUNCTION IS EQUAL TO 'C'                               01373000
013740         MOVE 500041 TO RPXXX05-MSGNBR                            01374000
013750         GO TO LINT-EXIT.                                         01375000
013760     MOVE 'Y' TO WS-INTERFACE.                                    01376000
013770 LINT-EXIT.                                                       01377000
013780     EXIT.                                                        01378000
013790******************************************************************01379000
013800 USER-EXIT SECTION.                                               01380000
013810 UEXIT-START.                                                     01381000
013820     MOVE SPACES TO RPUSER-MESSAGE.                               01382000
013830     IF WS-INTERFACE IS NOT EQUAL TO 'Y'                          01383000
013840         GO TO UEXIT-CONT.                                        01384000
013850     MOVE RPINF00-KEY-AREAS TO RPUSER-KEY-AREAS.                  01385000
013860     MOVE RPINF00-USER-INFO TO RPUSER-USER-INFO.                  01386000
013870     MOVE RPINF00-MISC-INFO TO RPUSER-MISC-INFO.                  01387000
013880     MOVE RPINF00-BAL-INFO TO RPUSER-BAL-INFO.                    01388000
013890     GO TO UEXIT-CALL.                                            01389000
013900 UEXIT-CONT.                                                      01390000
013910     MOVE RPXXX05-ADD-INST TO RPUSER-INST.                        01391000
013920     MOVE RPXXX05-ADD-PRODCODE TO RPUSER-PRODCODE.                01392000
013930     MOVE RPXXX05-ADD-ACCOUNT TO RPUSER-ACCOUNT.                  01393000
013940     MOVE MIM-2023INTAPPL211 TO RPINF00-APPLR.                    01394000
013950     MOVE MIM-2023INTAPPL211 TO RPUSER-APPLR.                     01395000
013960     INITIALIZE RPUSER-GRP-DATA.                                  01396000
013970 UEXIT-CALL.                                                      01397000
000000     CALL 'RPBUSER' USING                                         01398000
013990         RPUSER-MESSAGE                                           01399000
014000         WS-FUNCTION.                                             01400000
014010 UEXIT-EXIT.                                                      01401000
014020     EXIT.                                                        01402000
014030******************************************************************01403000
014040 READ-MICM-0237 SECTION.                                          01404000
014050 RM0237-START.                                                    01405000
014060     MOVE SPACES TO WS-FUNCTION.                                  01406000
014070     MOVE SPACES TO MI0237-RECORD.                                01407000
014080     MOVE RPXXX05-KEY-INST TO MIM-0237KINST.                      01408000
014090     MOVE +0237 TO MIM-0237KREC.                                  01409000
014100     MOVE 50 TO MIM-0237KPROCMGR.                                 01410000
014110     MOVE MIM-2023INTAPPL211 TO MIM-0237KINTAPPL.                 01411000
014120     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    01412000
014130     MOVE MI0237-RECORD TO MIMST-RECORD.                          01413000
014140     PERFORM MIC-MST-GET-REQUEST.                                 01414000
014150     MOVE MIMST-RECORD TO MI0237-RECORD.                          01415000
014160     IF WS-FUNCTION IS EQUAL TO SPACES                            01416000
014170         GO TO RM0237-EXIT.                                       01417000
014180     MOVE SPACES TO MIM-237OLINTFC.                               01418000
014190 RM0237-EXIT.                                                     01419000
014200     EXIT.                                                        01420000
014210******************************************************************01421000
014220 READ-MICM-2023 SECTION.                                          01422000
014230 RM2023-START.                                                    01423000
014240     MOVE SPACES TO WS-FUNCTION.                                  01424000
014250     MOVE SPACES TO MI2023-RECORD.                                01425000
014260     IF RPXXX05-INST-OPT-1 IS NOT EQUAL TO 'Y'                    01426000
014270         MOVE ZEROS TO MIM-2023KINST.                             01427000
014280     MOVE RPXXX05-KEY-INST TO MIM-2023KINST.                      01428000
014290     MOVE RPXXX05-INST-OPT-1 TO SLW096-BANKS.                     01429000
014300     MOVE RPRF21-BASE-ACCT-PRODCODE TO MIM-2023KPRODCODE.         01430000
014310     MOVE +2023 TO MIM-2023KREC.                                  01431000
014320     MOVE MIC-MST-2023-PRI TO MIC-MST-REC-PRI.                    01432000
014330 RM2023-INST-ZERO.                                                01433000
014340     MOVE MI2023-RECORD TO MIMST-RECORD.                          01434000
014350     MOVE SPACES TO WS-FUNCTION.                                  01435000
014360     PERFORM MIC-MST-GET-REQUEST.                                 01436000
014370     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01437000
014380         AND MIM-2023KINST IS NOT EQUAL TO ZEROS                  01438000
014390         MOVE ZEROS TO MIM-2023KINST                              01439000
014400         GO TO RM2023-INST-ZERO.                                  01440000
014410     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01441000
014420         GO TO RM2023-END.                                        01442000
014430     MOVE MIMST-RECORD TO MI2023-RECORD.                          01443000
014440 RM2023-END.                                                      01444000
014450     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01445000
014460         MOVE 'N' TO MIM-2023RPOPTION.                            01446000
014470 RM2023-EXIT.                                                     01447000
014480     EXIT.                                                        01448000
014490******************************************************************01449000
014500 READ-MICM-7100 SECTION.                                          01450000
014510 RM7100-START.                                                    01451000
014520     MOVE SPACES TO WS-FUNCTION.                                  01452000
014530     MOVE SPACES TO MI7100-RECORD.                                01453000
014540     MOVE RPXXX05-KEY-INST TO MIM-7100KINST.                      01454000
014550 RM7100-LOOP.                                                     01455000
014560     MOVE +7100 TO MIM-7100KREC.                                  01456000
014570     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    01457000
014580     MOVE MI7100-RECORD TO MIMST-RECORD.                          01458000
014590     PERFORM MIC-MST-GET-REQUEST.                                 01459000
014600     MOVE MIMST-RECORD TO MI7100-RECORD.                          01460000
014610     IF WS-FUNCTION IS EQUAL TO 'N'                               01461000
014620         AND MIM-7100KINST IS GREATER THAN ZEROS                  01462000
014630         GO TO RM7100-ZERO.                                       01463000
014640     GO TO RM7100-EXIT.                                           01464000
014650 RM7100-ZERO.                                                     01465000
014660     MOVE SPACES TO MI7100-RECORD.                                01466000
014670     MOVE ZEROS TO MIM-7100KINST.                                 01467000
014680     GO TO RM7100-LOOP.                                           01468000
014690 RM7100-EXIT.                                                     01469000
014700     EXIT.                                                        01470000
014710******************************************************************01471000
014720 READ-MICM-7102 SECTION.                                          01472000
014730 RM7102-START.                                                    01473000
014740     MOVE SPACE TO WS-FUNCTION.                                   01474000
014750     MOVE RPXXX05-ADD-PRODCODE TO WS-SAVE-PRODCODE.               01475000
014760     MOVE RPINF00-ACCT-TYPE TO WS-SAVE-ACCT-TYPE.                 01476000
014770     MOVE SPACE TO WS-7102-FLAG.                                  01477000
014780 RM7102-LOOP.                                                     01478000
014790     MOVE SPACE TO WS-FUNCTION.                                   01479000
014800     MOVE SPACES TO MI7102-RECORD.                                01480000
014810     MOVE RPXXX05-KEY-INST TO MIM-7102KINST.                      01481000
014820     MOVE +7102 TO MIM-7102KREC.                                  01482000
014830     MOVE RPXXX05-KEY-MODEL TO MIM-7102KMODEL.                    01483000
014840     MOVE WS-SAVE-PRODCODE TO MIM-7102KPRODCODE.                  01484000
014850     MOVE WS-SAVE-ACCT-TYPE TO MIM-7102KACCTTYPE.                 01485000
014860     MOVE MIC-RPS-7102-PRI TO MIC-MST-REC-PRI.                    01486000
014870     MOVE MI7102-RECORD TO MIMST-RECORD.                          01487000
014880     PERFORM MIC-MST-GET-REQUEST.                                 01488000
014890     MOVE MIMST-RECORD TO MI7102-RECORD.                          01489000
014900     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01490000
014910         AND WS-SAVE-PRODCODE IS EQUAL TO SPACES                  01491000
014920         AND WS-SAVE-ACCT-TYPE IS EQUAL TO ZEROS                  01492000
014930         MOVE 'N' TO WS-7102-FLAG                                 01493000
014940         GO TO RM7102-EXIT.                                       01494000
014950     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01495000
014960         AND WS-SAVE-ACCT-TYPE IS NOT EQUAL TO ZEROS              01496000
014970         MOVE ZEROS TO WS-SAVE-ACCT-TYPE                          01497000
014980         GO TO RM7102-LOOP.                                       01498000
014990     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01499000
015000         AND WS-SAVE-PRODCODE IS NOT EQUAL TO SPACES              01500000
015010         MOVE SPACES TO WS-SAVE-PRODCODE                          01501000
015020         GO TO RM7102-LOOP.                                       01502000
015030 RM7102-EXIT.                                                     01503000
015040     EXIT.                                                        01504000
015050******************************************************************01505000
015060 READ-MICM-7106 SECTION.                                          01506000
015070 RM7106-START.                                                    01507000
015080     MOVE SPACES TO WS-FUNCTION.                                  01508000
015090     MOVE SPACES TO MI7106-RECORD.                                01509000
015100     MOVE RPXXX05-KEY-INST TO MIM-7106KINST.                      01510000
015110     MOVE +7106 TO MIM-7106KREC.                                  01511000
015120     MOVE WS-WORK-CATCD TO MIM-7106KRPREC.                        01512000
015130     MOVE MIC-RPS-7106-PRI TO MIC-MST-REC-PRI.                    01513000
015140     MOVE MI7106-RECORD TO MIMST-RECORD.                          01514000
015150     PERFORM MIC-MST-GET-REQUEST.                                 01515000
015160     MOVE MIMST-RECORD TO MI7106-RECORD.                          01516000
015170     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01517000
015180         GO TO RM7106-EXIT.                                       01518000
015190 RM7106-EXIT.                                                     01519000
015200     EXIT.                                                        01520000
015210******************************************************************01521000
015220 GET-BALANCE SECTION.                                             01522000
015230 GB-START.                                                        01523000
015240     MOVE ZEROS TO WS-WORK-BALANCE.                               01524000
015250     IF WS-WORK-BALCD IS EQUAL TO ZEROS                           01525000
015260         OR WS-WORK-BALCD IS GREATER THAN 20                      01526000
015270         GO TO GB-EXIT.                                           01527000
015280     MOVE RPINF00-BAL (WS-WORK-BALCD) TO WS-WORK-BALANCE.         01528000
015290 GB-EXIT.                                                         01529000
015300     EXIT.                                                        01530000
015310******************************************************************01531000
015320 REQUEST-SECONDARY-CUSTOMER SECTION.                              01532000
015330 RSC-START.                                                       01533000
015340     MOVE 'X' TO RPRF21-FUNC.                                     01534000
015350     MOVE SPACES TO RPRF21-FUNCTION.                              01535000
015360     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             01536000
015370     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         01537000
015380     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          01538000
015390     EXEC CICS LINK                                               01539000
015400         PROGRAM('RPO0RF21')                                      01540000
015410         COMMAREA(RPRF21-MESSAGE)                                 01541000
015420         LENGTH(LENGTH OF RPRF21-MESSAGE)                         01542000
015430         RESP(WS-CICS-RESPONSE)                                   01543000
015440         END-EXEC.                                                01544000
015450     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         01545000
015460     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     01546000
015470         MOVE 'L' TO WS-FUNCTION                                  01547000
015480         MOVE 500036 TO WS-MSGNBR                                 01548000
015490         GO TO RSC-EXIT.                                          01549000
015500     IF WS-FUNCTION IS EQUAL TO 'B'                               01550000
015510         MOVE 500045 TO WS-MSGNBR                                 01551000
015520         GO TO RSC-EXIT.                                          01552000
015530     IF WS-FUNCTION IS EQUAL TO 'C'                               01553000
015540         MOVE 500037 TO WS-MSGNBR                                 01554000
015550         GO TO RSC-EXIT.                                          01555000
015560     IF WS-FUNCTION IS EQUAL TO 'I'                               01556000
015570         MOVE 500038 TO WS-MSGNBR.                                01557000
015580     MOVE RPRF21-RETURNED-OBJECT TO WS-ACC-TABLE.                 01558000
015590     IF WS-RELCHECK IS EQUAL TO 'Y'                               01559000
015600         PERFORM READ-MICM-7104SECUST.                            01560000
015610     PERFORM REMOVE-SECONDARY-CUSTOMERS.                          01561000
015620                                                                  01562000
015630 RSC-EXIT.                                                        01563000
015640     EXIT.                                                        01564000
015650* **                                                              01565000
015660 REMOVE-SECONDARY-CUSTOMERS SECTION.                              01566000
015670* *********************************************************       01567000
015680* DETERMINE IF THE SECONDARY ACCOUNT SHOULD BE                    01568000
015690* REMOVED BASED ON THE RELATE CODE (7101--7104)                   01569000
015700*                                                                 01570000
015710*                                                                 01571000
015720* *********************************************************       01572000
015730     INITIALIZE WS-SECONDARY-CUSTAREA.                            01573000
015740     MOVE +1 TO WS-SUBSEC1.                                       01574000
015750     MOVE +1 TO WS-SUBSEC2.                                       01575000
015760 RSC-LOOP.                                                        01576000
015770     IF WS-SUBSEC1 IS GREATER THAN +33                            01577000
015780         SUBTRACT +1 FROM WS-SUBSEC2 GIVING                       01578000
015790         WS-SECONDARY-CUST                                        01579000
015800         GO TO RSC-EXIT.                                          01580000
015810     IF WS-ACC-INST (WS-SUBSEC1) IS EQUAL TO ZERO                 01581000
015820         SUBTRACT +1 FROM WS-SUBSEC2 GIVING                       01582000
015830         WS-SECONDARY-CUST                                        01583000
015840         GO TO RSC-EXIT.                                          01584000
015850* ** SKIP PRIMARY CUSTOMER                                        01585000
015860     IF WS-ACC-PRIM (WS-SUBSEC1) IS EQUAL TO ZERO                 01586000
015870         GO TO RSC-NEXT.                                          01587000
015880     IF WS-RELCHECK IS NOT EQUAL TO 'Y'                           01588000
015890         MOVE 'N' TO WS-BADRELNBR                                 01589000
015900         GO TO RSC-TEST.                                          01590000
015910     MOVE WS-ACC-RELNBR (WS-SUBSEC1) TO WS-VALIDREL.              01591000
015920     PERFORM GM-CHECKFORRELNBR.                                   01592000
015930 RSC-TEST.                                                        01593000
015940     IF WS-BADRELNBR IS EQUAL TO 'N'                              01594000
015950         MOVE WS-ACC-INST (WS-SUBSEC1) TO                         01595000
015960             WS-SEC-INST (WS-SUBSEC2)                             01596000
015970         MOVE WS-ACC-CUST-TYPE (WS-SUBSEC1) TO                    01597000
015980             WS-SEC-CUST-TYPE (WS-SUBSEC2)                        01598000
015990         MOVE WS-ACC-CUST (WS-SUBSEC1) TO                         01599000
016000             WS-SEC-CUST (WS-SUBSEC2)                             01600000
016010         MOVE WS-ACC-RELNBR (WS-SUBSEC1) TO                       01601000
016020             WS-SEC-RELNBR (WS-SUBSEC2)                           01602000
016030         MOVE WS-ACC-PRIM (WS-SUBSEC1) TO                         01603000
016040             WS-SEC-PRIM (WS-SUBSEC2)                             01604000
016050          MOVE WS-ACC-FILL (WS-SUBSEC1) TO                        01605000
016060             WS-SEC-FILL (WS-SUBSEC2)                             01606000
016070          ADD +1 TO WS-SUBSEC2.                                   01607000
016080 RSC-NEXT.                                                        01608000
016090     ADD +1 TO WS-SUBSEC1.                                        01609000
016100     GO TO RSC-LOOP.                                              01610000
016110 RSC-EXIT.                                                        01611000
016120     EXIT.                                                        01612000
016130 GM-CHECKFORRELNBR SECTION.                                       01613000
016140* *********************************************************       01614000
016150* DETERMINE IF THE CUSTOMER SHOULD BE INCLUDED BASED ON           01615000
016160* THE RELATIONSHIP CODE WITH THE PRIMARY ACCOUNT                  01616000
016170*                                                                 01617000
016180*                                                                 01618000
016190* *********************************************************       01619000
016200 GM-CHREL-START.                                                  01620000
016210     MOVE +1 TO WS-RELSUB.                                        01621000
016220 GM-CHECKIT.                                                      01622000
016230     IF WS-RELSUB IS GREATER THAN WS-RELMAX                       01623000
016240         GO TO GM-NOMATCH.                                        01624000
016250     IF WS-SECRELCODE (WS-RELSUB) IS EQUAL TO ZEROS               01625000
016260         GO TO GM-NOMATCH.                                        01626000
016270     IF WS-VALIDREL IS EQUAL TO WS-SECRELCODE (WS-RELSUB)         01627000
016280         GO TO GM-MATCH.                                          01628000
016290     ADD +1 TO WS-RELSUB.                                         01629000
016300     GO TO GM-CHECKIT.                                            01630000
016310 GM-MATCH.                                                        01631000
016320     IF WS-INCLUDEREL IS EQUAL TO 'Y'                             01632000
016330         MOVE 'N' TO WS-BADRELNBR                                 01633000
016340         GO TO GMCFR-EXIT.                                        01634000
016350     MOVE 'Y' TO WS-BADRELNBR.                                    01635000
016360     GO TO GMCFR-EXIT.                                            01636000
016370 GM-NOMATCH.                                                      01637000
016380     IF WS-INCLUDEREL IS EQUAL TO 'Y'                             01638000
016390         MOVE 'Y' TO WS-BADRELNBR                                 01639000
016400         GO TO GMCFR-EXIT.                                        01640000
016410     MOVE 'N' TO WS-BADRELNBR.                                    01641000
016420     GO TO GMCFR-EXIT.                                            01642000
016430 GMCFR-EXIT.                                                      01643000
016440     EXIT.                                                        01644000
016450******************************************************************01645000
016460 READ-MICM-7104SECUST SECTION.                                    01646000
016470 RM7104SC-START.                                                  01647000
016480     MOVE SPACES TO MI7104-RECORD.                                01648000
016490     MOVE RPXXX05-KEY-INST TO MIM-7104KINST.                      01649000
016500     MOVE +7104 TO MIM-7104KREC.                                  01650000
016510     MOVE WS-RPMIM7104SC TO MIM-7104KRPREC.                       01651000
016520     MOVE MIC-RPS-7104-PRI TO MIC-MST-REC-PRI.                    01652000
016530     MOVE MI7104-RECORD TO MIMST-RECORD.                          01653000
016540     PERFORM MIC-MST-GET-REQUEST.                                 01654000
016550     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01655000
016560         MOVE 'N' TO WS-RELCHECK                                  01656000
016570         GO TO RM7104SC-EXIT.                                     01657000
016580* **                                                              01658000
016590     MOVE MIMST-RECORD TO MI7104-RECORD.                          01659000
016600     INITIALIZE WS-RELCODETABLE.                                  01660000
016610     MOVE MIM-REC7104-DATA TO WS-RELCODETABLE.                    01661000
P0114      MOVE 'N' TO WS-INCLUDEREL.                                   01662000
016630     IF MIM-7104OPT IS EQUAL TO 'I'                               01663000
016640         MOVE 'Y' TO WS-INCLUDEREL.                               01664000
016650 RM7104SC-END.                                                    01665000
016660 RM7104SC-EXIT.                                                   01666000
016670     EXIT.                                                        01667000
016680* ** END OF NEW                                                   01668000
P0114 ******************************************************************01668200
P0114  VALIDATE-PRIM-RELCD SECTION.                                     01668400
000000 COPY RPP008.                                                     01668600
016690******************************************************************01669000
016700 VALIDATE-BRANCH SECTION.                                         01670000
000000 COPY RPP7107A.                                                   01671000
016720******************************************************************01672000
016730 ADD-EVENT-HISTORY SECTION.                                       01673000
000000 COPY RPPEVTD.                                                    01674000
016750******************************************************************01675000
000000 COPY RPPACTA.                                                    01676000
016770******************************************************************01677000
000000 COPY RPPEVTA.                                                    01678000
016790******************************************************************01679000
000000 COPY RPPIDXA.                                                    01680000
016810******************************************************************01681000
000000 COPY RPPMSTA.                                                    01682000
016830******************************************************************01683000
000000 COPY RPPQUAA.                                                    01684000
016850******************************************************************01685000
000000 COPY RPPRELA.                                                    01686000
016870******************************************************************01687000
000000 COPY RPPSECA.                                                    01688000
016890******************************************************************01689000
016900 MIC-MST-API SECTION.                                             01690000
000000 COPY MIPMSTA.                                                    01691000
016920******************************************************************01692000
016930 SLP096-GET-2023-RECORD SECTION.                                  01693000
000000 COPY SLP096.                                                     01694000
016950******************************************************************01695000
016960 OPERATOR-DIALOG-SECURITY SECTION.                                01696000
000000 COPY SRP079.                                                     01697000
016980******************************************************************01698000
016990 CICS-ABORT-EXIT SECTION.                                         01699000
017000 CAE-START.                                                       01700000
017010     GO TO CICS-RETURN.                                           01701000
017020 CAE-EXIT.                                                        01702000
017030     EXIT.                                                        01703000
017040******************************************************************01704000
017050 CICS-RETURN SECTION.                                             01705000
017060     IF COM-ABORT IS NOT EQUAL TO ZERO                            01706000
017070         MOVE COM-ABORT TO RPXXX05-ABORT.                         01707000
017080     IF RPXXX05-ABORT IS NOT EQUAL TO ZERO                        01708000
017090         AND WS-UPDATESW IS EQUAL TO 'Y'                          01709000
017100         MOVE 'Y' TO RPXXX05-ABTYPE.                              01710000
017110     IF RPXXX05-ABORT IS NOT EQUAL TO ZERO                        01711000
017120         MOVE WS-FUNCTION TO RPXXX05-FUNCTION                     01712000
017130         MOVE SRB-BMDB TO RPXXX05-SRBMDB                          01713000
017140         MOVE EIBFN TO RPXXX05-ABEIBFN                            01714000
017150         MOVE EIBRESP TO RPXXX05-ABEIBRESP                        01715000
017160         MOVE EIBRESP2 TO RPXXX05-ABEIBRESP2                      01716000
017170         MOVE EIBRCODE TO RPXXX05-ABEIBRCODE.                     01717000
017180     IF RPXXX05-ABTYPE IS NOT EQUAL TO 'Y'                        01718000
017190         PERFORM GLOBAL-CLOSE.                                    01719000
000000 COPY SLP709.                                                     01720000
017210******************************************************************01721000
017220 GLOBAL-CLOSE SECTION.                                            01722000
017230 GC-START.                                                        01723000
017240     IF RPXXX05-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  01724000
017250         PERFORM RPS-MST-GLOBAL-CLOSE-REQUEST.                    01725000
017260 GC-EXIT.                                                         01726000
017270     EXIT.                                                        01727000
017280******************************************************************01728000
