       IDENTIFICATION DIVISION.
       PROGRAM-ID. MGOCOMP6.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  FIELD-1                   PIC 9(9).

       PROCEDURE DIVISION.
         FIRST-PARA.
           COPY MGOEMPT2.
           EXIT.
