 CTL022A: PROC OPTIONS(MAIN);    
    DECLARE LABEL_A LABEL;
    DECLARE RESULT BIT(1) INIT(1B);
    DECLARE X CHAR(2) INIT('AB');
    DECLARE Z FIXED DECIMAL(1) INIT(-3);
    GO TO LABEL2;
    PUT SKIP LIST('PRINT ANY');
     LABEL2:
       BEGIN;
         DCL ABC FIXED DECIMAL;
       END;      
 END CTL022A;
