 CTL018A: PROC OPTIONS(MAIN);
    DCL 1 GROUP,
          2 FXD_LEFT FIXED DECIMAL(1) INIT(9),
          2 FXD_RIGHT FIXED DECIMAL(2,1) INIT(9.9);
    DCL RESULT BIT(1) INIT(1B);
    
   SELECT (RESULT) ;   
    WHEN (FXD_LEFT >= FXD_RIGHT)
     BEGIN; 
         RESULT = (FXD_LEFT = FXD_RIGHT);
     END;
    WHEN (FXD_LEFT < FXD_RIGHT)
      BEGIN; 
        RESULT = (FXD_LEFT < FXD_RIGHT);
     END;  
    OTHERWISE
      RESULT = (FXD_LEFT < FXD_RIGHT);
   END;
  END CTL018A;