       IDENTIFICATION DIVISION.
       PROGRAM-ID.    CALLPGM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  MY-PROGRAM-NAME PIC X(10) VALUE 'CALLPGM'.
       01  program1               PIC X(08) VALUE 'MAINPGM'.
       01  MY-COUNTER             PIC 9(04) VALUE ZERO.
       LINKAGE SECTION.
       01  DFHCOMMAREA               PIC X(250).
       PROCEDURE DIVISION.
           EXEC CICS ASKTIME END-EXEC
           CALL program1 USING MMRS-COMMAREA
           GOBACK