//WDIS93JCL1    JOB %ACCTGK,'%OADID',CLASS=S,MSGCLASS=Q,REGION=7M
//STEP1         EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB       DD   DSN=ENDEVOR.PRODP.LOADBAT,DISP=SHR
//              DD   DSN=SYS1.GDB2FACH.LINKLIB,DISP=SHR
//SYSTSPRT      DD   SYSOUT=*
//* IKJEFT01 : COBOLCall in PROG($NAME)
//SYSTSIN       DD *
 DSN SYSTEM(DB2F)
 RUN PROG(G2BPES01) 
     PLAN(GKPLANB)     
     PARMS('$GK103')
 END
/*