100700 IDENTIFICATION DIVISION. 
101000 PROGRAM-ID.    NN-192.
101100 AUTHOR.        CVCVC XXXXX.
101200 DATE-COMPILED.
105200 ENVIRONMENT DIVISION.
105500 CONFIGURATION SECTION.
106200 SOURCE-COMPUTER. UNIX. 
106300 OBJECT-COMPUTER. UNIX.
106400 SPECIAL-NAMES.
106500     ENVIRONMENT-NAME IS ENV-NAME
106600     ENVIRONMENT-VALUE IS ENV-VALUE.
106700*VME
106800
106900 INPUT-OUTPUT SECTION.
107000**********************
107100 FILE-CONTROL.
109000 DATA DIVISION.
109300 FILE SECTION.
109400**************
109500
110000 FD  REPORT1
110400     REPORT  IS        RPT-1.
114600 WORKING-STORAGE SECTION.
101500 77  WS-DAYS-IN-MONTH              PIC S9(11) BINARY.             
101600 77  WS-DAYS-DIFFERENCE            PIC S9(11) BINARY.             
101700 77  WS-DAY-OF-WEEK                PIC S9(11) BINARY.             
101800                                                                  
132300 REPORT SECTION.
132700
132800 RD  RPT-1
132900
133000         CONTROL   FINAL
133100
133200         PAGE  66
133300         FIRST DETAIL  8
133400         LAST  DETAIL  60.
133500
133600 01  PAGE-HEADING   TYPE  PAGE  HEADING.
133700     03  LINE 2.
133800         05  COLUMN   1      PIC X(06)     VALUE
133900             "XX192 ".
148300 PROCEDURE DIVISION. 
163900 MAIN-PROGRAM SECTION.
164400     ACCEPT CMD-LINE FROM COMMAND-LINE.                
165400     
179600     STOP RUN.
