000010    CBL FLAG(I,W),NOSEQUENCE
000020 ID DIVISION.
000030 PROGRAM-ID.   TEST_MOVE.
000050 INSTALLATION. FSG.
000060 DATE-WRITTEN. 04/26/96.
000590 ENVIRONMENT DIVISION.
000600 DATA DIVISION.
000620 WORKING-STORAGE SECTION.
004460 LINKAGE SECTION.
001080
001090     03  TEMP-STORAGE-AREA.
001240         05  TWA-LAST-LOC-PROGRAM     PIC  X(08) VALUE 'IMOVE'.
005340 PROCEDURE DIVISION.
001470
001480 AA009-CICS-MAPFAIL.
           MOVE LK-WORK-MAP TO WORK-MAP.
001490     MOVE LOW-VALUES             TO TWA-MAP-ID
001500                                    TWA-LAST-LOC-PROGRAM.
001510     MOVE WORK-MAP               TO CICS-STRIP-LINEC.
001520     MOVE LOW-VALUES             TO WORK-MAP.
001590
005750 AA200-CHECK-FOR-NEW-XACTION.
005930     IF TWA-LAST-LOC-FUNCT = 'FPHLOC'
005940         MOVE TWA-LAST-LOC-FUNCT TO TWA-SAVE-LAST-DLC-FUNCT.
005950         MOVE TWA-LAST-LOC-PROGRAM TO TWA-SAVE-LAST-DLC-PROGRAM.
005960         MOVE TWA-LAST-LOC-KEY   TO TWA-SAVE-LAST-DLC-KEY.
005970     MOVE TEST-FUNCT             TO SFUNCT
005980                                    TWA-LAST-LOC-FUNCT.
005990     MOVE THIS-PROGRAM           TO TWA-LAST-LOC-PROGRAM.
           END-IF.
006230
006510 AA210-CHECK-KEY-CONT.
006520
006530     IF TWA-MAP-PF4-HIT
006540         MOVE 'F'                     TO TWA-FTH-IND.
006550         MOVE TWA-SAVE-LAST-DLC-FUNCT TO SFUNCT.
006560         MOVE TWA-SAVE-LAST-DLC-KEY TO TEST-KEY SKEY.
006570         MOVE TWA-SAVE-LAST-DLC-PROGRAM TO TWA-LAST-LOC-PROGRAM.
006580         MOVE LOW-VALUES              TO TWA-LAST-KEY.
006590         EXEC CICS XCTL
006600             PROGRAM(TWA-LAST-LOC-PROGRAM)
006610             COMMAREA(WORK-MAP)
006620             LENGTH(2000)
006630           END-EXEC.
           END-IF.
