000010    CBL FLAG(I,W),NOSEQUENCE
000020 ID DIVISION.
000030 PROGRAM-ID.   TEST_SET.
000050 INSTALLATION. FSG.
000060 DATE-WRITTEN. 04/26/96.
000590 ENVIRONMENT DIVISION.
000600 DATA DIVISION.
000620 WORKING-STORAGE SECTION.
004460 LINKAGE SECTION.
001080
001090     03  TEMP-STORAGE-AREA.
001240         05  TWA-LAST-LOC-PROGRAM     PIC  X(08) VALUE 'ISET'.
005340 PROCEDURE DIVISION.
001470
001480 AA009-CICS-MAPFAIL.

001480     SET WORK-MAP TO LK-WORK-MAP.
001480     SET  TWA-LAST-LOC-PROGRAM   TO LOW-VALUES.
001500
001500     SET CICS-STRIP-LINEC TO WORK-MAP.
001500     SET WORK-MAP             TO LOW-VALUES.
001590
005750 AA200-CHECK-FOR-NEW-XACTION.
005930     IF TWA-LAST-LOC-FUNCT = 'FPHLOC'
005940         SET TWA-SAVE-LAST-DLC-FUNCT TO TWA-LAST-LOC-FUNCT.
005950         SET TWA-SAVE-LAST-DLC-PROGRAM TO TWA-LAST-LOC-PROGRAM.
005960         SET TWA-SAVE-LAST-DLC-KEY   TO TWA-LAST-LOC-KEY.
005980     SET TWA-LAST-LOC-FUNCT             TO TEST-FUNCT.
005990     SET TWA-LAST-LOC-PROGRAM         TO THIS-PROGRAM.
           END-IF.
006230
006510 AA210-CHECK-KEY-CONT.
006520
006530     IF TWA-MAP-PF4-HIT
006540         SET TWA-FTH-IND TO 'F'.
006550         SET SFUNCT TO TWA-SAVE-LAST-DLC-FUNCT.
006560         SET TEST-KEY SKEY TO TWA-SAVE-LAST-DLC-KEY.
006570         SET TWA-LAST-LOC-PROGRAM TO TWA-SAVE-LAST-DLC-PROGRAM.
006580         SET TWA-LAST-KEY              TO  LOW-VALUES.

006590         EXEC CICS XCTL
006600             PROGRAM(TWA-LAST-LOC-PROGRAM)
006610             COMMAREA(WORK-MAP)
006620             LENGTH(2000)
006630           END-EXEC.
           END-IF.
