//NNDR96P  JOB (A,X,RN2800),'FOR RELOAD',
//             MSGCLASS=W,USER=ZPDBRJT
//JCLDSN JCLLIB ORDER=AXRN28.P00.JND1.JES.JCLLIB
//JOBLIB  DD DSN=IWXXA1.DB2.SDSNLOAD,DISP=SHR
//        DD DSN=IWXXA1.DB2.RUNLIB.LOAD,DISP=SHR
//        DD DSN=IWRR99.P00.IWD1.BATCH.LOADLIB,DISP=SHR
//        DD DSN=IWRR99.P00.IWD1.CICS.LOADLIB,DISP=SHR
// SET GRNO=00000
//*
//NNDR9605 EXEC PGM=IKJEFT01,DYNAMNBR=20,TIME=999
//*
//SYSPROC  DD DSN=IWXXA1.DB2.SDSNCLST,DISP=SHR
//*
//SYSOUT   DD SYSOUT=*

//SYSIN    DD  DSN=IWRR99.P00.JND1.CTC(IW009605),
//             DISP=SHR
//*
