       IDENTIFICATION DIVISION.
       PROGRAM-ID. REPLACE-TEST.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
         01 FIELD-1         PIC X(10).


00078      COPY MGOCOPY SUPPRESS REPLACING MGO BY DOC-MGO               00860000
00079                   MGO-DEFINE BY DOC-MGO-DEFINE .                  00870000

       PROCEDURE DIVISION.

           DISPLAY "TEST SUPPRESS REPLACING".

         STOP RUN.
