 DCL   01  CUST_CUSTROOT      UNALIGNED,
             02 CUST_CUSTROOT_SEG,
              03 CUST_OLNO,
               04 CUST_OL_NO        CHAR (8),
              03 CUST_OPER_NAME     CHAR (35),
              03 CUST_OPER_BIRTH_CDAT,
               04 CUST_OPER_BIRTH_CENT
                              CHAR (1),
               04 CUST_OPER_BIRTH_DATE
                              CHAR (6),
              03 CUST_SSN_NO        CHAR (9),
              03 CUST_RCD_STATUS    CHAR (1),
              03 CUST_LAST_MOD_TIME CHAR (8),
              03 CUST_LAST_MOD_DATE CHAR (6),
              03 CUST_LAST_OPER_ID  CHAR (7),
              03 CUST_PURGE_DATE    CHAR (6),
              03 CUST_OPER_ADDRESS  CHAR (23),
              03 CUST_OPER_SEC_LN_ADDRESS
                              CHAR (23),
              03 CUST_OPER_CITY     CHAR (14),
              03 CUST_OPER_ST       CHAR (2),
              03 CUST_ZIP_CODE      CHAR (9),
              03 CUST_NEXT_SEQ_NO   CHAR (3),
              03 CUST_OPER_HGT      CHAR (2),
              03 CUST_TOTAL_POINT   CHAR (2),
              03 CUST_POINT_SIX_CNT PIC '(2)9',
              03 CUST_SUSP_CNT      PIC '(3)9',
              03 CUST_ACCIDENT_IND  CHAR (1),
              03 CUST_HABTL_OFF_CENT (3)
                              CHAR (1),
              03 CUST_HABTL_OFF_DATE (3)
                              CHAR (6),
              03 CUST_MAIL_ADDRESS_IND
                              CHAR (1),
              03 CUST_DOT_CTY_CODE  CHAR (2),
              03 CUST_RCD_TYPE_CODE CHAR (2),
              03 CUST_OPER_SEX_CODE CHAR (1),
              03 CUST_EYE_COLOR_CODE
                              CHAR (2),
              03 CUST_DRV_PRIV_STATUS_CODE (9)
                              CHAR (2),
              03 CUST_PROD_CLS_CODE (3)
                              CHAR (1),
              03 CUST_PROD_ISSUE_CDAT,
               04 CUST_PROD_ISSUE_CENT
                              CHAR (1),
               04 CUST_PROD_ISSUE_DATE
                              CHAR (6),
              03 CUST_PROD_STATUS_CODE (4)
                              CHAR (2),
              03 CUST_PROD_EXPIRE_CDAT,
               04 CUST_PROD_EXPIRE_CENT
                              CHAR (1),
               04 CUST_PROD_EXPIRE_DATE
                              CHAR (6),
              03 CUST_PHOTO_SCAN_CDAT,
               04 CUST_PHOTO_SCAN_CENT
                              CHAR (1),
               04 CUST_PHOTO_SCAN_DATE
                              CHAR (6),
              03 CUST_PHOTO_CENTER_LOC_CODE
                              CHAR (3),
              03 CUST_PHOTO_STATUS_CODE
                              CHAR (1),
              03 CUST_DUP_OUTPUT_CNT
                              CHAR (2),
              03 CUST_OUTSTAND_EXAM_CNT
                              CHAR (1),
              03 CUST_MED_STOP_CODE (3)
                              CHAR (3),
              03 CUST_FICT_OPER_IND CHAR (1),
              03 CUST_PROD_ORIG_ISSUE_CDAT,
               04 CUST_PROD_ORIG_ISSUE_CENT
                              CHAR (1),
               04 CUST_PROD_ORIG_ISSUE_DATE
                              CHAR (6),
              03 CUST_LAST_POINT_CDAT,
               04 CUST_LAST_POINT_CENT
                              CHAR (1),
               04 CUST_LAST_POINT_DATE
                              CHAR (6),
              03 CUST_MECH_IND      CHAR (1),
              03 CUST_VIOLTN_1501A_CNTR
                              CHAR (2),
              03 CUST_VIOLTN_1543_CNTR
                              CHAR (2),
              03 CUST_DRV_ED_IND    CHAR (1),
              03 CUST_SUSP_15_CNTR  CHAR (2),
              03 CUST_EYE_QUES_CDAT,
               04 CUST_EYE_QUES_CENT CHAR (1),
               04 CUST_EYE_QUES_DATE CHAR (6),
              03 CUST_ENDORSE_GRP,
               04 CUST_BUS_ENDORSE_CODE
                              CHAR (1),
               04 CUST_CDL_ENDORSE_CODE (3)
                              CHAR (1),
              03 CUST_RESTR_GRP,
               04 CUST_CDL_RESTR_GRP,
                05 CUST_CDL_RESTR_CODE (6)
                              CHAR (1),
               04 CUST_MED_RESTR_GRP,
                05 CUST_RESTR_CODE (17)
                              CHAR (1),
              03 CUST_SOR_CODE      CHAR (2),
              03 CUST_SOR_DL_NO     CHAR (25),
              03 CUST_EXAM_EXMP_CODE
                              CHAR (1),
              03 CUST_VIOLTN_6307_CNTR
                              CHAR (2),
              03 CUST_VIOLTN_6308_CNTR
                              CHAR (2),
              03 CUST_VIOLTN_63103_CNTR
                              CHAR (2),
              03 CUST_VIOLTN_13A1_CNTR
                              CHAR (2),
              03 CUST_VIOLTN_13A12_CNTR
                              CHAR (2),
              03 CUST_VIOLTN_13A16_CNTR
                              CHAR (2),
              03 CUST_VIOLTN_13A30_CNTR
                              CHAR (2),
              03 CUST_VIOLTN_13A31_CNTR
                              CHAR (2),
              03 CUST_VIOLTN_13A36_CNTR
                              CHAR (2),
              03 CUST_VIOLTN_3717C_CNTR
                              CHAR (2),
              03 CUST_VIOLTN_3717D_CNTR
                              CHAR (2),
              03 CUST_STO_DISQ_CNTR CHAR (2),
              03 CUST_MAJ_DISQ_CNTR CHAR (2),
              03 CUST_DISQ_CNTR     CHAR (2),
              03 CUST_CDL_EXPIRE_CDAT,
               04 CUST_CDL_EXPIRE_CENT
                              CHAR (1),
               04 CUST_CDL_EXPIRE_DATE
                              CHAR (6),
              03 CUST_OOS_CONV_FLAG CHAR (1),
              03 CUST_CDL_FLAG,
               04 CUST_CDL_FLAG_TYPE
                              CHAR (1),
               04 CUST_CDL_FLAG_STAT
                              CHAR (1),
              03 CUST_ORGAN_DONOR_TYPE
                              CHAR (1),
              03 CUST_HO_IND        CHAR (1),
              03 CUST_LIMITED_LICENSE_CODE
                              CHAR (1),
              03 CUST_JAIL_CDAT,
               04 CUST_JAIL_CENT  CHAR (1),
               04 CUST_JAIL_DATE  CHAR (6),
              03 CUST_JAIL_CNT      PIC '(2)9',
              03 CUST_II_ORIG_RCD_TYPE
                             CHAR (2),
              03 CUST_II_REMOVAL_ELIG_CDAT,
               04 CUST_II_REMOVAL_ELIG_CENT
                              CHAR (1),
               04 CUST_II_REMOVAL_ELIG_DATE
                              CHAR (6),
              03 CUST_II_CNTR       PIC '(2)9',
              03 CUST_DUI_CNTR      PIC '(2)9',
             02 FILLER_N            CHAR (9);
