************************************************************************
*
* PROGRAMM         : AAP02N0  MENUE PERFORMANCE UND VERMOEGEN
* AUTHOR           : RF___AA&CO________________________________
* DATUM            : 26/10/1989
*
* ----------------------------------------------------------------------
*
*
* VERARBEITUNG (SIEHE AAP02O0)
*
* ----------------------------------------------------------------------
*
* AENDERUNGSNACHWEIS
*
* LFNR  DATUM    AENDERUNGSGRUND                                   WER
* 0001  26/10/89 NEUERSTELLUNG___________________________________  RF__
* 0002  30/01/90 DIVERSE AENDERUNGEN NACH SIR NO 3_______________  TB__
* 0003  07/03/90 DIVERSE AENDERUNGEN NACH ITT SIR NO 506_________  TB__
* 0004  15/03/90 PF22 GESPERRT; ITT-SIR 568______________________  RF__
* 0005  07/04/90 EINBAU OUT OF SCOPE FUNKTIONALITAET_____________  FH__
* 0006  26/06/90 MAINT-NR.52/81: NAVIGATION, BESCHRIFTUNG________  BR__
* 0007  17/07/90 MAINT-NR. 324/FEHLERMELDUNG BEI DRUCKJOB-START__  SB__
* 0008  17/07/90 MAINT-NR. 306___________________________________  SB__
* 0009  18/07/90 MAP AAP02M02 GETRENNT IN AAP02M02 UND AAP02M12__  SB__
* 0010  06/08/90 ANZAHL KOPIEN FUER DRUCK SOFORT_________________  SB__
* 0011  28/08/90 SPLITTING_______________________________________  BR__
* 0012  25/10/90 MAINT-NR : 629 VALIDIERUNG ZAHL/LIEF____________  TS__
* 0013  02/11/90 MAINT-NR 622: ANZAHL KOPIEN FUER DRUCK MORGEN___  SB__
* 0014  06/11/90 MAINT-NR 428: NEUER MENUPUNKT: DRUCKQUEUE ABFR._  SB__
* 0015  08/03/91 REDESIGN: NEUER MENUPUNKT: VERMOEGENS-ANALYSE___  SB__
* 0016  12/06/91 MAINT-NR 1367:DATUMHANDLING FUER JHDT-WECHSEL___  SSI_
*                              ANPASSEN__________________________  SSI_
* 0017  11/11/91 MAINT-NR 1511: NEUER MENUPUNKT: VERZ. UND ABFR._  SB__
* 0018  14/01/92 MAINT-NR 1578: NEUER MENUPUNKT: ERTRAGS-LISTE___  SB__
* 0019  28/12/92 MAINT-NR 1782: XXZ26N0 ERSETZT XXZ25N0__________  SSI_
* 0020  28/01/93 MAINT-NR 1600: UEBERSTEUERUNG REF-WRG SOWIE_____  SCN_
*                               VERARB REF-WRG-WECHSEL___________  SCN_
* 0021  01/03/93 MAINT-NR 1835: KONSOLIDIERUNG VERM.-VERZ./-ANAL.  SSI_
* 0022  01/06/93 MAINT-NR 1834: KONSOLIDIERUNG PERFORMANCEBERICHT  SSI_
* 0023  20/05/94 Bereinigung PORTOS______________________________  SSI_
* 0024  14/12/95 F�r 'Mutation Performancedaten' statt #RV-SV-ID   SSI_
*                neu #RV-SB-ID abfragen                            SSI_
* 0025  06/05/96 Maint-Nr.20071:Neue Logik Aufbereitung Von-Datum  SSI_
* 0026  14/05/01 GUI Changes_____________________________________  VIE61
* 0027  13/11/01 BV-Feld erst nach Pr�fung f�llen________________  VIBIW
* 0028  04/03/03 ($$28) PER-DAT beim Sofortdruck neu vom ZV-C____  VITST
* 0029  02/04/03 ($$29) PER-DAT Bestimmung �berarbeiten__________  VITST
* 0030  25/10/03 ($030) Einbau AAP10 BSPEKU deutsche Steuern_____  VISST
* 0031  25/10/03 ($031) Einbau AAP12 EU-Zahlstellensteuern_______  VIERR
* 0032  16/06/04 ($032) Einbau AAP11 PerformanceChart Aufruf_____  VISST
* 0033  30/12/09 ($033) PF-Tasten deaktivieren ST-2010 __________  VILR0
* 0034  14/01/10 ($034) Menu Reduzieren _______ST-2010 __________  VILR0
*
* **********************************************************************
* ================================================ DATA-DEFINITION =====
* DATA STRUCTURE :
*  GDA (PREDEFINED, CATALOGED IN PREDICT)
*  PDA (PREDEFINED, CATALOGED IN PREDICT)
*  LDA (PREDEFINED, CATALOGED IN PREDICT)
*
DEFINE DATA
*
* GLOBALE PROGRAMMVARIABLE /*------------------------------ GLOBAL -----
GLOBAL
  USING AAP02G0
*
* PARAMETER VOM AUFRUFENDEM PGM /*---------------------  PARAMETER -----
PARAMETER
  USING AAA00A0            /* PDA USER-INF
PARAMETER
  USING AAA00A2            /* PDA KOMM-AREA
PARAMETER
  USING AAA00A8            /* PDA KOMM-PER
*
* LOCALE PROGRAMMVARIABLE /* ------------------------------- LOCAL -----
*
LOCAL                          /* PARAMETER FUER KONSOLIDIERUNGS-WIND.
  USING AAA12A0
LOCAL                          /* PARAMETER FUER BESTELLMODUL
  USING AAZ08A0
LOCAL                          /* PARAMETER FUER TZA-PRUEFROUTINE
  USING AAZ34A0
* LOCAL                        /* PARAMETER FUER DATUMSMODUL
* USING AAZ36A0                                                  /* $$28
LOCAL                          /* PARAMETER FUER DATUMSMODUL
  USING XXZ26A0
*
LOCAL     USING TAZ12A0   /* PDA: Datums-Informationen           /* $$28
LOCAL     USING XXA90K0   /* PDA: System Zustand (Konstanten)    /* $$28
*
LOCAL     USING XXA90A0               /* PDA SystemZustand       /* 0026
LOCAL     USING XXA98L2               /* Standard-Felder         /* 0026
LOCAL     USING XXJT0L01              /* JTC WRP Interface 1     /* 0026
LOCAL     USING XXJT0L02              /* JTC WRP Interface 2     /* 0026
LOCAL     USING XXJT0L03              /* JTC WRP Interface 3     /* 0026
LOCAL     USING XXJT0K0               /* PDA GUIX-WRP            /* 0026
LOCAL     USING XXO13K0               /* OAZ: PFKey-Init         /* 0026
LOCAL     USING XXO69A0               /* LDA Save (SystemZustand)/* 0026
LOCAL     USING AAP02L0A              /* LDA GUIX-Attribute      /* 0026
LOCAL     USING AAP02K0C              /* LDA GUIX-Attribute      /* 0026
LOCAL     USING AAP10A0               /* PDA BSPEKU             /* I$030
LOCAL     USING AAP11A0               /* PDA PRFCHART           /* I$032
LOCAL     USING XXO10A0               /* General OAZ-PDA        /* I$030
LOCAL     USING AAP12A0               /* PDA EU-ZAHLSTELLENST.  /* I$031
LOCAL     USING XXO12A0               /* LDA Hierarchie-Managemen/* 0026
LOCAL     USING XXO12K0               /* Hierarchie-Management   /* 0026
*
LOCAL
1 #PV-ZW-WAHL           (N2)   /* 0025
1 #PV-LS-VON-DAT-RESET  (L)    /* 0025
*
1 #PV-DAT-A8            (A8)                                     /* $$29
1 #PV-DAT-D             (D)                                      /* $$29
*
1 #PK-4800              (A5) CONST<'E4800'>                      /* 0026
1 #PK-3196              (A5) CONST<'E3196'>                      /* 0026
1 #PK-2749              (A5) CONST<'E2749'>                      /* 0026
1 #PK-2503              (A5) CONST<'E2503'>                      /* 0026
*
*
1 #BV-PERF-VON(A10)                                              /* 0026
1 #BV-PERF-BIS(A10)                                              /* 0026
END-DEFINE
*
        IF #RV-SB-ID NE MASK ('S'.)                  /* 0024
          MOVE #SK-C-WAHL TO #RV-CURSPOS-FELD
         end-if
*
  DECIDE FOR first CONDITION
*
 WHEN (#RV-FUNKTION = 'PF2' OR = 'PF3' OR = 'PF4' OR = 'PF9' OR = 'PF10'
        OR = 'PF1' OR = 'PF20' OR = 'PF21' OR = 'PF22'
        OR = 'PF15' OR = 'PF16' OR = 'PF17' OR = 'PF18')
      ESCAPE ROUTINE
    WHEN (#SV-ZRBEZ-7 EQ ' ') AND (#SV-ZRBEZ-3 EQ ' ') AND
        (#SV-ZRBEZ-1 EQ ' ') AND (#SV-WAHL < 9)
      MOVE #PK-2749 TO #RV-MSGCODE-MAP
      MOVE #SK-C-ZRBEZ TO #RV-CURSPOS-MAP
      INCLUDE XXO71CC
        '#SV-ZRBEZ-7'
        '1'
    WHEN All
    	write 'all'
    WHEN NONE
    	write 'none'
end-decide
*
INCLUDE XXA98C2                      /* JVCvar_getVers           /* 0026
INCLUDE XXO12CON                     /* OAZhm_openNonOAZ         /* 0026
  '*LEVEL'                          /* (1) level                /* 0026
  '*PROGRAM'                        /* (2) pgm-id               /* 0026
*
*
* =============================================== PROGRAMMSTRUKTUR =====
*   HOUSEKEEPING
*   PREPARE FIRST DISPLAY
*   REPEAT UNTIL END OF CONVERSATION
*   END-OF-PROGRAM LOGIC
* =====================================================================
*
*
* HOUSEKEEPING -------------------------------------- HOUSEKEEPING -----
*
*
* UEBERNEHMEN FELDER AUS PORTOS-GDA
*
MOVE    #GDA-VDT-DATN TO   #RV-VDT-DATN
MOVE    #GDA-FIL-C    TO   #RV-FIL-C
MOVE    #GDA-SB-ID    TO   #RV-SB-ID
MOVE    #GDA-SB-C     TO   #RV-SB-C
MOVE    #GDA-SB-ZRGID TO   #RV-SB-ZRGID
MOVE    #GDA-SV-ID    TO   #RV-SV-ID
MOVE    #GDA-SV-C     TO   #RV-SV-C
MOVE    #GDA-SV-ZRGID TO   #RV-SV-ZRGID
MOVE    #GDA-MSGCODE  TO   #RV-MSGCODE-MAP /* MELDUNG VOM VORGAENGER
RESET   #GDA-MSGCODE
*
IF #RV-MSGKZ-MAP EQ 'W' OR = 'E'
  MOVE 'I' TO #RV-MSGKZ-MAP
END-IF
*
*
* SETZEN INITIAL-WERTE
*
MOVE    *PROGRAM      TO #RK-PGMID
MOVE    *PROGRAM      TO #SK-PGMID
*
*
* STANDARD-BELEGUNG PF-KEYS VONTOBEL
*
INCLUDE AAZ01C0
*
* BELEGUNG PF-KEYS AUFTRAGSSYSTEM / PROGRAM
*
SET KEY PF3   NAMED 'Ende '                                /* I$034
SET KEY PF19  NAMED 'PERF '
* T KEY PF20  NAMED 'FIXP '                                /* I$033
* T KEY PF21  NAMED 'DR MO'                                /* I$033
* T KEY PF22  NAMED 'DR SO'                                /* I$033
SET KEY PF23  NAMED 'ZAHL '
SET KEY PF24  NAMED 'LIEF '
*
*                                                          /* Start 0026
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '2'                     /* (1) i/Index PF-Key
  '" "'                   /* (2) i/PF-Keytext
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '4'                     /* (1) i/Index PF-Key
  '" "'                   /* (2) i/PF-Keytext
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '3'                     /* (1) i/Index PF-Key
  '"Zur�ck"'              /* (2) i/PF-Keytext
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '9'                     /* (1) i/Index PF-Key
  '"Refresh"'             /* (2) i/PF-Keytext
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '10'                    /* (1) i/Index PF-Key
  '"Cancel"'              /* (2) i/PF-Keytext
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '15'                    /* (1) i/Index PF-Key
  '"ZR"'                  /* (2) i/PF-Keytext
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '16'                    /* (1) i/Index PF-Key
  '"Konto"'               /* (2) i/PF-Keytext
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '17'                    /* (1) i/Index PF-Key
  '"Depot"'               /* (2) i/PF-Keytext
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '18'                    /* (1) i/Index PF-Key
  '"Valor"'               /* (2) i/PF-Keytext
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '13'                    /* (1) i/Index PF-Key  PF19
  '"Perf"'                /* (2) i/PF-Keytext
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '14'                    /* (1) i/Index PF-Key PF20
  '"Fixp"'                /* (2) i/PF-Keytext
* INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
*   '21'                    /* (1) i/Index PF-Key
*   '"DR MO"'               /* (2) i/PF-Keytext
* INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
*   '22'                    /* (1) i/Index PF-Key
*   '"DR SO"'               /* (2) i/PF-Keytext
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '23'                    /* (1) i/Index PF-Key
  '"Zahl"'                /* (2) i/PF-Keytext
INCLUDE XXJT0C0K          /* NonOAZ_setPV-PF-STATUS/TEXT
  '24'                    /* (1) i/Index PF-Key
  '"Lief"'                /* (2) i/PF-Keytext
*                                                            /* End 0026
*
* PREPARE FOR FIRST DISPLAY ----------------------- FIRST DISPLAY -----
* UEBERNEHMEN SCHLUESSELWERTE AUS GDA
*
MOVE #GDA-ZRGPAR-SHL       TO #PV-ZRG-ID-NR
MOVE #GDA-PERDAT-VON       TO #PV-PERF-VON
MOVE #GDA-PERDAT-BIS       TO #PV-PERF-BIS
*
MOVE 'INIT'                TO #RV-FUNKTION         /* EINSTIEG
*
*
*
* REPEAT UNTIL END OF CONVERSTION ------------------------- REPEAT -----
*
*
REPEAT UNTIL #RV-EOP-SEL EQ 'Y'
*
  DECIDE ON FIRST VALUE OF #RV-FUNKTION
    VALUE 'INIT'
      PERFORM SUB_INIT
    VALUE 'PF2', 'PF3', 'PF4'
      PERFORM TRANSFER
    VALUE 'PF9'
      PERFORM REBUILD
    VALUE 'PF10'
      PERFORM CANCEL
    VALUE 'PF15', 'PF16', 'PF17', 'PF18'
      PERFORM TRANSFER
*   VALUE 'PF19','PF20','PF21','PF22','PF23','PF24'     /* I$033
    VALUE 'PF1', 'PF20', 'PF21', 'PF22'                 /* I$033
      PERFORM TRANSFER                                  /* I$033
    VALUE 'PF19','PF23','PF24'                          /* I$033
      PERFORM PROGRAM-AKTION                            /* I$033
    VALUE 'ENTR'
      PERFORM ENTER
    NONE
      CALLNAT 'AAZ99N0' #RV-MELDUNG            /* SYSTEM-ERROR
  END-DECIDE
*
  IF #RV-EOP-SEL EQ 'N'
    PERFORM SUB_DISPLAY
  END-IF
*
*
END-REPEAT
*
*
*
* END-OF-PROGRAM LOGIC ----------------------------- END OF PROGRAM ----
*
INCLUDE XXO12CC                       /* OAZhm_closeLevel        /* 0026
  '*LEVEL'                           /* (1) level               /* 0026
*
MOVE  #RV-MSGCODE-MAP TO #GDA-MSGCODE
*
*
* ==================================================== SUBROUTINES =====
*
DEFINE SUBROUTINE SUB_INIT
MOVE 'INIT' TO #RV-SUBROUTINE
*
SET CONTROL 'WB'                               /* GRUNDSTELLUNG BS
*
PERFORM CLEAR-SCHIRM
*
PERFORM CHECK-SCHLUESSEL
*
PERFORM FUELLEN-SCHIRM
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE CLEAR-SCHIRM /* ------------------- CLEAR-SCHIRM <<<<<
MOVE 'CLEAR-SCHIRM' TO #RV-SUBROUTINE
*
RESET #SV-VARIABLE
*
IF #PV-LS-VON-DAT-RESET               /* 0025
  MOVE #PV-ZW-WAHL TO #SV-WAHL        /* 0025
END-IF                                /* 0025
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE CHECK-SCHLUESSEL /*------------ CHECK-SCHLUESSEL <<<<<
MOVE 'CHECK-SCHLUESSEL' TO #RV-SUBROUTINE
*
IF #PV-ZRG-ID-NR EQ 0            /* SCHLUESSEL MUSS NICHT GEFUELLT SEIN
  IGNORE
ELSE
  IF #RV-MSGKZ-MAP NOT = 'E'
*
    MOVE #RV-FIL-C     TO #PV-ZRG1-FIL-C
    MOVE #PV-ZRG-ID-NR TO #PV-ZRG1-ZRG-ID-NR
*
    RE1. READ (1) AAZRG00-R-01 BY ZRGKEY1
        STARTING FROM #PV-ZRG1-SHL
    END-READ
*
    IF AAZRG00-R-01.ZRG-ID-NR NE #PV-ZRG1-ZRG-ID-NR
      MOVE    #PK-2640    TO #RV-MSGCODE-FELD
      CALLNAT 'AAZ05N0' #RV-MELDUNG
      ESCAPE BOTTOM IMMEDIATE
    ELSE
      MOVE AAZRG00-R-01.ZRBEZ          TO #SV-ZRBEZ
      MOVE AAZRG00-R-01.REF-WRG-C      TO #PV-REF-WRG-C         /* 1600
    END-IF
  END-IF
*
END-IF
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE FUELLEN-SCHIRM /*---------------- FUELLEN-SCHIRM <<<<<
MOVE 'FUELLEN-SCHIRM' TO #RV-SUBROUTINE
*
IF #PV-PERF-VON = 0
  PERFORM FUELLEN-DATUM
ELSE
  MOVE #PV-PERF-VON    TO #PV-Z26-DAT
*
  PERFORM DATUM-AUFBEREITEN                                       /* SSI
*
  IF #XXZ26-RC NOT = 0                                            /* SSI
    MOVE #SK-C-PERF-VON TO #RV-CURSPOS-FELD                       /* SSI
*
    INCLUDE XXO71CC                                              /* 0026
      '#SV-VARIABLE.#SV-PERF-VON'                               /* 0026
      '1'                                                       /* 0026
*
    MOVE #PK-2518 TO #RV-MSGCODE-FELD                             /* SSI
    CALLNAT 'AAZ05N0' #RV-MELDUNG                                 /* SSI
  ELSE                                                            /* SSI
    MOVE #XXZ26-OUT-DAT-ALPHA TO #SV-PERF-VON                     /* SSI
  END-IF
*
END-IF
*
IF #PV-PERF-BIS = 0
  IGNORE
ELSE
  MOVE #PV-PERF-BIS    TO #PV-Z26-DAT
*
  PERFORM DATUM-AUFBEREITEN                                       /* SSI
*
  IF #XXZ26-RC NOT = 0                                            /* SSI
    MOVE #SK-C-PERF-BIS TO #RV-CURSPOS-FELD                       /* SSI
*
    INCLUDE XXO71CC                                              /* 0026
      '#SV-VARIABLE.#SV-PERF-BIS'                               /* 0026
      '1'                                                       /* 0026
*
    MOVE #PK-2518 TO #RV-MSGCODE-FELD                             /* SSI
    CALLNAT 'AAZ05N0' #RV-MELDUNG                                 /* SSI
  ELSE                                                            /* SSI
    MOVE #XXZ26-OUT-DAT-ALPHA TO #SV-PERF-BIS                     /* SSI
  END-IF
*
END-IF
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE FUELLEN-DATUM /*------------------ FUELLEN-DATUM <<<<<
MOVE 'FUELLEN-DATUM' TO #RV-SUBROUTINE
*
RESET #PV-PRF2-SHL
MOVE #RV-VDT-DATN    TO #PV-DAT-N8
MOVE #PV-DAT-N8-JAHR TO #PV-DAT-N8-1-JAHR
MOVE 1               TO #PV-DAT-N8-1-MM
MOVE 1               TO #PV-DAT-N8-1-TT
*
RESET #PV-PRF2-SHL
MOVE #RV-FIL-C     TO #PV-PRF2-FIL-C
MOVE #PV-ZRG-ID-NR TO #PV-PRF2-ZRG-ID-NR
*
COMPUTE #PV-PRF2-KOMPL-STICH-PUNKT-DAT = 99999999 - #PV-DAT-N8-1
*
PERFORM PRF-KEY2-LESEN  /* r�ckw�rts lesen
*
IF AAPRF00-R-00.FIL-C         NE #PV-PRF2-FIL-C OR
    AAPRF00-R-00.ZRG-ID-NR     NE #PV-PRF2-ZRG-ID-NR
  RESET #SV-PERF-VON
    #PV-PERF-VON
*
/* Zugriff mit PRFKEY1 vorbereiten                              /* 0025
  MOVE #RV-FIL-C     TO #PV-PRF1-FIL-C                          /* 0025
  MOVE #PV-ZRG-ID-NR TO #PV-PRF1-ZRG-ID-NR                      /* 0025
  RESET                 #PV-PRF1-STICH-PUNKT-DAT                /* 0025
  PERFORM PRF-KEY1-LESEN                                        /* 0025
*
  IF AAPRF00-R-00.FIL-C     NE #PV-PRF1-FIL-C OR                /* 0025
      AAPRF00-R-00.ZRG-ID-NR NE #PV-PRF1-ZRG-ID-NR               /* 0025
    RESET #SV-PERF-VON                                          /* 0025
      #PV-PERF-VON                                          /* 0025
  ELSE                                                          /* 0025
    MOVE AAPRF00-R-00.STICH-PUNKT-DAT TO #PV-Z26-DAT            /* 0025
    PERFORM DATUM-AUFBEREITEN                                   /* 0025
    IF #XXZ26-RC NOT = 0                                        /* 0025
      MOVE #SK-C-PERF-VON TO #RV-CURSPOS-FELD                   /* 0025
*
      INCLUDE XXO71CC                                            /* 0026
        '#SV-VARIABLE.#SV-PERF-VON'                             /* 0026
        '1'                                                     /* 0026
*
      MOVE #PK-2518 TO #RV-MSGCODE-FELD                         /* 0025
      CALLNAT 'AAZ05N0' #RV-MELDUNG                             /* 0025
    ELSE                                                        /* 0025
      MOVE #XXZ26-OUT-DAT-ALPHA TO #SV-PERF-VON                 /* 0025
      MOVE #XXZ26-OUT-DAT-NUM   TO #PV-PERF-VON                 /* 0025
    END-IF                                                      /* 0025
  END-IF                                                        /* 0025
ELSE
  MOVE AAPRF00-R-00.STICH-PUNKT-DAT TO #PV-Z26-DAT
*
  PERFORM DATUM-AUFBEREITEN
*
  IF #XXZ26-RC NOT = 0
    MOVE #SK-C-PERF-VON TO #RV-CURSPOS-FELD
*
    INCLUDE XXO71CC                                              /* 0026
      '#SV-VARIABLE.#SV-PERF-VON'                               /* 0026
      '1'                                                       /* 0026
*
    MOVE #PK-2518 TO #RV-MSGCODE-FELD
    CALLNAT 'AAZ05N0' #RV-MELDUNG
  ELSE
    MOVE #XXZ26-OUT-DAT-ALPHA TO #SV-PERF-VON
    MOVE #XXZ26-OUT-DAT-NUM   TO #PV-PERF-VON
  END-IF
*
END-IF
*
COMPUTE #PV-PRF2-KOMPL-STICH-PUNKT-DAT = 99999999 - #PV-DAT-N8
*
PERFORM PRF-KEY2-LESEN
*
IF AAPRF00-R-00.FIL-C         NE #PV-PRF2-FIL-C OR
    AAPRF00-R-00.ZRG-ID-NR     NE #PV-PRF2-ZRG-ID-NR
  RESET #SV-PERF-BIS
    #PV-PERF-BIS
ELSE
  MOVE AAPRF00-R-00.STICH-PUNKT-DAT TO #PV-Z26-DAT
*
  PERFORM DATUM-AUFBEREITEN
*
  IF #XXZ26-RC NOT = 0
    MOVE #SK-C-PERF-BIS TO #RV-CURSPOS-FELD
*
    INCLUDE XXO71CC                                              /* 0026
      '#SV-VARIABLE.#SV-PERF-BIS'                               /* 0026
      '1'                                                       /* 0026
*
    MOVE #PK-2518 TO #RV-MSGCODE-FELD
    CALLNAT 'AAZ05N0' #RV-MELDUNG
  ELSE
    MOVE #XXZ26-OUT-DAT-ALPHA TO #SV-PERF-BIS
    MOVE #XXZ26-OUT-DAT-NUM   TO #PV-PERF-BIS
  END-IF
*
END-IF
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE PRF-KEY2-LESEN /*----------------- PRF-KEY2-LESEN <<<<
MOVE 'PRF-KEY2-LESEN' TO #RV-SUBROUTINE
*
RESET AAPRF00-R-00
*
READ (2) AAPRF00-R-00 BY PRFKEY2 STARTING FROM #PV-PRF2-SHL
  IF AAPRF00-R-00.DAT-TYP-C NE ' '
    ESCAPE BOTTOM
  END-IF
END-READ
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE PRF-KEY1-LESEN /*----------------- PRF-KEY1-LESEN <<<<
MOVE 'PRF-KEY1-LESEN' TO #RV-SUBROUTINE
*
/* Neue Subroutine (Maint Nr. 20071)
/* Ist kein PRF >= als 1.1. (akt.Jahr) vorhanden, wird vorw�rts
/* gelesen, bis ein Satz mit Verm�gen > 0 gefunden wird
*
RESET AAPRF00-R-00
*
R2. READ AAPRF00-R-00 WITH PRFKEY1 = #PV-PRF1-SHL
  IF AAPRF00-R-00.FIL-C     NE #PV-PRF1-FIL-C     OR
      AAPRF00-R-00.ZRG-ID-NR NE #PV-PRF1-ZRG-ID-NR OR
      AAPRF00-R-00.GESAMT-VERM-REF-BETR NE 0
    ESCAPE BOTTOM
  END-IF
END-READ
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE SUB_DISPLAY
MOVE 'DISPLAY' TO #RV-SUBROUTINE
*
RESET INITIAL #RV-EOD-SEL
*
REPEAT UNTIL #RV-EOD-SEL = 'Y'
*
*
  INCLUDE XXJT0C0I        /* JTCrun_initMapWrapperInterface      /* 0026
    '#RV-FIL-C'       /* (1) i/filiale                       /* 0026
    '"AAP02N0"'       /* (2) i/User Presentation ID          /* 0026
    '"AAP02M1"'       /* (3) i/Map Id                        /* 0026
    '*PROGRAM'        /* (4) i/Dialogue ID                   /* 0026
    '*PROGRAM'        /* (5) i/Program ID                    /* 0026
    '*USER'           /* (6) i/User                          /* 0026
    '1'               /* (7) i/srf Page                      /* 0026
*
  INCLUDE XXJT0C0M        /* NonOAZ_inputUsingMap/Jtc            /* 0026
    '"AAP02M1"'       /* (1) i/Map                           /* 0026
    'AAP02C1W'        /* (2) i/MapWrapper                    /* 0026
    '" "'             /* (3) i/Message-Text                  /* 0026
    '#RV-CURSPOS-MAP' /* (4) i/Markposition                  /* 0026
    '"AA"'            /* (5) i/Message-Applic-ID             /* 0026
    '#RV-MSGNR-MAP'   /* (6) i/Message-Nr                    /* 0026
* MOVE *PF-KEY TO #RV-FUNKTION                         /* Commented 0026
  INCLUDE XXJT0C0P        /* NonOAZ_fillPfkeyField               /* 0026
    '#RV-FUNKTION'    /* (1) io/PF-Key-Field                 /* 0026
*
  RESET
    #RV-MSGCODE-FELD #RV-MSGCODE-MAP
    #RV-CURSPOS-FELD #RV-CURSPOS-MAP
*
*                              /* Coding for processing rules Start 0026
  DECIDE FOR FIRST CONDITION
*
 WHEN (#RV-FUNKTION = 'PF2' OR = 'PF3' OR = 'PF4' OR = 'PF9' OR = 'PF10'
        OR = 'PF1' OR = 'PF20' OR = 'PF21' OR = 'PF22'
        OR = 'PF15' OR = 'PF16' OR = 'PF17' OR = 'PF18')
      ESCAPE ROUTINE
* I$034-Start
* WHEN (#SV-WAHL = 10 OR = 11 OR = 12) AND (#RV-FUNKTION NE 'PF22')
*   MOVE #PK-4800 TO #RV-MSGCODE-MAP
*   MOVE #SK-C-WAHL TO #RV-CURSPOS-MAP
*
*   INCLUDE XXO71CC                                              /* 0026
*      '#SV-WAHL'                                                /* 0026
*      '1'                                                       /* 0026
*
* WHEN (#SV-WAHL LT 4 OR #SV-WAHL EQ 5) AND
*             (#RV-FUNKTION = 'ENTR')
*   MOVE #PK-2627 TO #RV-MSGCODE-MAP
*   MOVE #SK-C-WAHL TO #RV-CURSPOS-MAP
*
*   INCLUDE XXO71CC                                              /* 0026
*      '#SV-WAHL'                                                /* 0026
*      '1'                                                       /* 0026
*
* WHEN (#SV-WAHL GT 5 AND #SV-WAHL LT 10) AND
*  (#RV-FUNKTION EQ 'PF21' OR EQ 'PF22')
*   MOVE #PK-3196 TO #RV-MSGCODE-MAP
*   MOVE #SK-C-WAHL TO #RV-CURSPOS-MAP
*
*   INCLUDE XXO71CC                                              /* 0026
*      '#SV-WAHL'                                                /* 0026
*      '1'                                                       /* 0026
*
* I$034-Ende
    WHEN (#SV-ZRBEZ-7 EQ ' ') AND (#SV-ZRBEZ-3 EQ ' ') AND
        (#SV-ZRBEZ-1 EQ ' ') AND (#SV-WAHL < 9)
      MOVE #PK-2749 TO #RV-MSGCODE-MAP
      MOVE #SK-C-ZRBEZ TO #RV-CURSPOS-MAP
*
      INCLUDE XXO71CC
        '#SV-ZRBEZ-7'
        '1'
*
*                               /* Coding for processing rules ends 0026
*
    WHEN NONE
      DECIDE ON FIRST VALUE OF #RV-FUNKTION
*   VALUE 'ENTR','PF19','PF20','PF21','PF22','PF23','PF24'      /* I$033
        VALUE 'ENTR','PF19','PF23','PF24'
*
          IF #RV-MSGKZ-MAP NE 'E'
         PERFORM INTERFELD                        /* INTERFELD-RULES ---
        MOVE #SV-PERF-VON TO #BV-PERF-VON                       /* I$027
        MOVE #SV-PERF-BIS TO #BV-PERF-BIS                       /* I$027
          END-IF
*
          IF #RV-MSGKZ-MAP NE 'E'
         PERFORM DB-PRUEFUNGEN                      /* DB-PRUEFUNGEN ---
          END-IF
*
        NONE VALUE
          IGNORE
      END-DECIDE
*
      IF #RV-MSGKZ-MAP NE 'E'
     CALLNAT 'AAZ06N0' #RV-MELDUNG                        /* WARNUNG ---
        MOVE #RV-WARN-CODE TO #RV-EOD-SEL
      END-IF
*
  END-DECIDE
*
END-REPEAT
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE INTERFELD /*-------------------------- INTERFELD <<<<<
MOVE 'INTERFELD' TO #RV-SUBROUTINE
* WRITE #RV-SUBROUTINE (CD=NE)
*
/* Von-Datum wurde gel�scht (blank), oder Menu wurde
/* ohne ZRBEZ aufgerufen
/* -------------------------------------------------
IF ((#SV-PERF-VON NE #BV-PERF-VON OR                             /* 0026
    #AV-VON-DATUM MODIFIED) AND                 /* 0025
    #SV-PERF-VON = ' ') OR                        /* 0025
    #PV-ZRG-ID-NR = 0                             /* 0025
  IF #SV-WAHL NE #PK-PERF-BERICHT-KONS AND      /* 0025
      #SV-WAHL NE #PK-VERM-VERZEICHNIS  AND      /* 0025a
      #SV-WAHL NE #PK-VERM-VERZEICHNIS-KONS AND  /* 0025a
      #SV-WAHL NE #PK-VERM-ANALYSE      AND      /* 0025a
      #SV-WAHL NE #PK-VERM-ANALYSE-KONS AND      /* 0025a
      #SV-WAHL NE #PK-VERM-VERZ-ANALYSE AND      /* 0025a
      #SV-WAHL NE #PK-VERM-VERZ-ANALYSE-KONS AND /* 0025a
      #SV-WAHL NE #PK-MUTATION          AND      /* 0025a
      #SV-WAHL NE #PK-DRUCKABFRAGE      AND      /* 0025a
      #SV-WAHL NE #PK-BSPEKU            AND      /* I$030
      #SV-WAHL NE #PK-PRFCHART          AND      /* I$032
      #SV-WAHL NE #PK-EU-ZAHLSTELLENST           /* I$031
    RESET #SV-PERF-VON                          /* 0025
      #PV-PERF-VON                          /* 0025
    MOVE 'Y'        TO #RV-EOD-SEL              /* 0025
    MOVE 'INIT'     TO #RV-FUNKTION             /* 0025
    MOVE TRUE       TO #PV-LS-VON-DAT-RESET     /* 0025
    MOVE #SV-WAHL   TO #PV-ZW-WAHL              /* 0025
    ESCAPE ROUTINE                              /* 0025
  END-IF                                        /* 0025
END-IF                                          /* 0025
*
/* Von-Datum wurde ge�ndert (nicht blank)
/* --------------------------------------
IF (#SV-PERF-VON NE #BV-PERF-VON OR                              /* 0026
    #AV-VON-DATUM MODIFIED) AND
    #SV-PERF-VON NOT = ' '
*
  RESET #XXZ26-PARM
  MOVE #SV-PERF-VON     TO #XXZ26-IN-DAT-ALPHA
  MOVE 2                TO #XXZ26-FORMAT
  MOVE '.'              TO #XXZ26-DELIMITER
*
  CALLNAT 'XXZ26N0' #XXZ26-PARM   /* Editiermaske aufbereiten
*
  IF #XXZ26-RC NOT = 0
    MOVE #SK-C-PERF-VON TO #RV-CURSPOS-FELD
*
    INCLUDE XXO71CC                                             /* 0026
      '#SV-VARIABLE.#SV-PERF-VON'                              /* 0026
      '1'                                                      /* 0026
*
    MOVE #PK-2518       TO #RV-MSGCODE-FELD
    CALLNAT 'AAZ05N0'      #RV-MELDUNG
  ELSE
    MOVE #XXZ26-OUT-DAT-NUM   TO #PV-PERF-VON
    MOVE #XXZ26-OUT-DAT-ALPHA TO #SV-PERF-VON
  END-IF
END-IF
*
/* Bis-Datum wurde ge�ndert (nicht blank)
/* --------------------------------------
IF (#SV-PERF-BIS NE #BV-PERF-BIS OR                              /* 0026
    #AV-BIS-DATUM MODIFIED) AND
    #SV-PERF-BIS NOT = ' '
  RESET #XXZ26-PARM
  MOVE #SV-PERF-BIS     TO #XXZ26-IN-DAT-ALPHA
  MOVE 2                TO #XXZ26-FORMAT
  MOVE '.'              TO #XXZ26-DELIMITER
*
  CALLNAT 'XXZ26N0' #XXZ26-PARM   /* BIS-DATUM F�R MAP AUFBEREITEN ---
*
  IF #XXZ26-RC NOT = 0
    MOVE #SK-C-PERF-BIS TO #RV-CURSPOS-FELD
*
    INCLUDE XXO71CC                                             /* 0026
      '#SV-VARIABLE.#SV-PERF-BIS'                              /* 0026
      '1'                                                      /* 0026
*
    MOVE #PK-2518       TO #RV-MSGCODE-FELD
    CALLNAT 'AAZ05N0'      #RV-MELDUNG
  ELSE
    MOVE #XXZ26-OUT-DAT-NUM   TO #PV-PERF-BIS
    MOVE #XXZ26-OUT-DAT-ALPHA TO #SV-PERF-BIS
  END-IF
END-IF
*
/* Von-Datum muss kleiner Bis-Datum sein
/* -------------------------------------
IF #PV-PERF-BIS NE 0 AND
    #PV-PERF-VON NE 0 AND
    #PV-PERF-BIS LE #PV-PERF-VON
  MOVE #SK-C-PERF-BIS TO #RV-CURSPOS-FELD
*
  INCLUDE XXO71CC                                               /* 0026
    '#SV-VARIABLE.#SV-PERF-BIS'                                /* 0026
    '1'                                                        /* 0026
*
  MOVE #PK-3014       TO #RV-MSGCODE-FELD
  CALLNAT 'AAZ05N0'      #RV-MELDUNG
  ESCAPE ROUTINE
END-IF
*
/* Von-Datum muss kleiner VDT sein
/* -------------------------------
IF #PV-PERF-VON > #RV-VDT-DATN
  MOVE #SK-C-PERF-VON TO #RV-CURSPOS-FELD
*
  INCLUDE XXO71CC                                               /* 0026
    '#SV-VARIABLE.#SV-PERF-VON'                                /* 0026
    '1'                                                        /* 0026
*
  MOVE #PK-2518       TO #RV-MSGCODE-FELD
  CALLNAT 'AAZ05N0'      #RV-MELDUNG
  ESCAPE ROUTINE
END-IF
*
/* Bis-Datum muss kleiner VDT sein
/* -------------------------------
IF #PV-PERF-BIS > #RV-VDT-DATN           /* BIS-DAT MUSS < VDT SEIN ---
  MOVE #SK-C-PERF-BIS TO #RV-CURSPOS-FELD
*
  INCLUDE XXO71CC                                               /* 0026
    '#SV-VARIABLE.#SV-PERF-BIS'                                /* 0026
    '1'                                                        /* 0026
*
  MOVE #PK-2518       TO #RV-MSGCODE-FELD
  CALLNAT 'AAZ05N0'      #RV-MELDUNG
  ESCAPE ROUTINE
END-IF
*
DECIDE ON FIRST VALUE OF #RV-FUNKTION
*
  VALUE 'ENTR'
    IF #SV-WAHL = #PK-PERF-BERICHT-KONS                      /* 1834
*
      PERFORM DATUM-NOETIG                                  /* 1834
*
      IF #RV-MSGKZ-MAP NE 'E'                               /* 1834
        RESET #A12-VARIABLE                                 /* 1834
        MOVE #RK-PGMID        TO #A12-PROGRAM               /* 1834
        MOVE #RV-FIL-C        TO #A12-FIL-C                 /* 1834
        MOVE #RV-SB-C         TO #A12-SB-C                  /* 1834
        MOVE #RV-SV-C         TO #A12-SV-C                  /* 1834
        MOVE #SV-WAHL         TO #A12-BERICHT-ART           /* 1834
*
        CALLNAT 'AAA12N0' #A12-VARIABLE                     /* 1834
*
        IF #A12-RETURN-C NE 0                               /* 1834
          MOVE #A12-MSGCODE TO #RV-MSGCODE-FELD            /* 1834
          MOVE #SK-C-WAHL   TO #RV-CURSPOS-FELD            /* 1834
*
          INCLUDE XXO71CC                                      /* 0026
            '#SV-WAHL'                                         /* 0026
            '1'                                                /* 0026
*
          CALLNAT 'AAZ05N0' #RV-MELDUNG                    /* 1834
          ESCAPE ROUTINE                                   /* 1834
        ELSE                               /* ALLES O.K.       1834
          MOVE #A12-REF-WRG-C     TO #PV-REF-WRG-C-A12     /* 1834
          MOVE #A12-SPRACH-C      TO #PV-SPRACH-C-A12      /* 1834
          MOVE #A12-HAUPT-ZRBEZ   TO #PV-ZRBEZ-A12         /* 1834
            #SV-ZRBEZ             /* 1834
          MOVE #A12-ZRG-ID-TAB(*) TO #PV-ZRG-ID-TAB(*)     /* 1834
          MOVE #A12-ZRG-ID-TAB(1) TO #PV-ZRG-ID-NR         /* 1834
        END-IF
      END-IF                                              /* 1834
    END-IF                                           /* 1834
*
    DECIDE ON FIRST VALUE OF #SV-WAHL
*
      VALUE #PK-MUTATION
**      IF #RV-SV-ID NE MASK ('S'.)                  /* SEKTOR-CHEF ---
        IF #RV-SB-ID NE MASK ('S'.)                  /* 0024
          MOVE #SK-C-WAHL TO #RV-CURSPOS-FELD
*
          INCLUDE XXO71CC                                        /* 0026
            '#SV-WAHL'                                          /* 0026
            '1'                                                 /* 0026
*
          MOVE #PK-3205   TO #RV-MSGCODE-FELD
          CALLNAT 'AAZ05N0' #RV-MELDUNG
        ELSE
          IF #SV-PERF-VON EQ ' '
            MOVE #SK-C-PERF-VON TO #RV-CURSPOS-FELD
*
            INCLUDE XXO71CC                                      /* 0026
              '#SV-VARIABLE.#SV-PERF-VON'                       /* 0026
              '1'                                               /* 0026
*
            MOVE #PK-2512       TO #RV-MSGCODE-FELD
            CALLNAT 'AAZ05N0' #RV-MELDUNG
          END-IF
        END-IF
*
      VALUE #PK-ZAHLUNGEN , #PK-LIEFERUNGEN
        PERFORM VERZW-ENBEW                 /* ANALOG PF23 UNF PF24 ---
*
      VALUE #PK-DRUCKABFRAGE
        IGNORE
*
      VALUE #PK-VERM-VERZEICHNIS , #PK-VERM-ANALYSE ,
          #PK-VERM-VERZ-ANALYSE , #PK-PERF-BERICHT ,
          #PK-ERTRAGS-LISTE
        PERFORM DATUM-NOETIG       /* ANALOG PF19
*
      VALUE #PK-PERF-BERICHT-KONS                         /* 1834
        IGNORE                                            /* 1834
*
      VALUE #PK-BSPEKU                                          /* i$030
        IGNORE                                                  /* i$030
      VALUE #PK-PRFCHART                                        /* i$032
        IGNORE                                                  /* i$032
*
      VALUE #PK-EU-ZAHLSTELLENST                                /* i$031
        IGNORE                                                  /* i$031
*
      NONE VALUE
        MOVE #SK-C-WAHL TO #RV-CURSPOS-FELD
*
        INCLUDE XXO71CC                                          /* 0026
          '#SV-WAHL'                                            /* 0026
          '1'                                                   /* 0026
*
        MOVE #PK-2627 TO #RV-MSGCODE-FELD
        CALLNAT 'AAZ05N0' #RV-MELDUNG
    END-DECIDE
*
  VALUE 'PF19'
    PERFORM DATUM-NOETIG
*
  VALUE 'PF20'
    IGNORE                         /* KEINE INTERFELD
*
  VALUE 'PF21' , 'PF22'
*
    PERFORM DRUCKEN
*
    IF #RV-FUNKTION = 'PF22'                AND            /* 1835
        (#SV-WAHL = #PK-VERM-VERZEICHNIS-KONS  OR            /* 1835
        #SV-WAHL = #PK-VERM-ANALYSE-KONS      OR            /* 1835
        #SV-WAHL = #PK-VERM-VERZ-ANALYSE-KONS OR            /* 1835
        #SV-WAHL = #PK-PERF-BERICHT-KONS        ) AND       /* 1834
        #RV-MSGKZ-MAP NE 'E'                                /* 1834
*
      RESET #A12-VARIABLE                                 /* 1835
      MOVE #RK-PGMID        TO #A12-PROGRAM               /* 1835
      MOVE #RV-FIL-C        TO #A12-FIL-C                 /* 1835
      MOVE #RV-SB-C         TO #A12-SB-C                  /* 1835
      MOVE #RV-SV-C         TO #A12-SV-C                  /* 1835
      MOVE #SV-WAHL         TO #A12-BERICHT-ART           /* 1834
*
      CALLNAT 'AAA12N0' #A12-VARIABLE                     /* 1835
*
      IF #A12-RETURN-C NE 0                               /* 1835
        MOVE #A12-MSGCODE TO #RV-MSGCODE-FELD            /* 1835
        MOVE #SK-C-WAHL   TO #RV-CURSPOS-FELD            /* 1835
*
        INCLUDE XXO71CC                                        /* 0026
          '#SV-WAHL'                                          /* 0026
          '1'                                                 /* 0026
*
        CALLNAT 'AAZ05N0' #RV-MELDUNG                    /* 1835
        ESCAPE ROUTINE                                   /* 1835
      ELSE                               /* ALLES O.K.       1835
        MOVE #A12-REF-WRG-C     TO #PV-REF-WRG-C-A12     /* 1835
        MOVE #A12-SPRACH-C      TO #PV-SPRACH-C-A12      /* 1835
        MOVE #A12-HAUPT-ZRBEZ   TO #PV-ZRBEZ-A12         /* 1835
          #SV-ZRBEZ             /* 1835
        MOVE #A12-ZRG-ID-TAB(*) TO #PV-ZRG-ID-TAB(*)     /* 1835
        MOVE #A12-ZRG-ID-TAB(1) TO #PV-ZRG-ID-NR         /* 1835
      END-IF
*
      IF #SV-WAHL = #PK-PERF-BERICHT-KONS                    /* 1834
        PERFORM DRUCKER-PRUEFEN                             /* 1834
      END-IF                                                 /* 1834
*
    END-IF                                                 /* 1835
*
  VALUE 'PF23' , 'PF24'
    PERFORM VERZW-ENBEW
  NONE VALUE
    CALLNAT 'AAZ99N0' #RV-MELDUNG
END-DECIDE
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE VERZW-ENBEW /*---------------------- VERZW-ENBEW<<<<<<
MOVE 'VERZW-ENBEW' TO #RV-SUBROUTINE
*
DECIDE FOR FIRST CONDITION
  WHEN #SV-PERF-VON EQ ' ' AND
      #SV-PERF-BIS EQ ' '
    PERFORM STANDARD-DAT
  WHEN #SV-PERF-VON EQ ' '
    MOVE #SK-C-PERF-VON TO #RV-CURSPOS-FELD
*
    INCLUDE XXO71CC                                              /* 0026
      '#SV-VARIABLE.#SV-PERF-VON'                               /* 0026
      '1'                                                       /* 0026
*
    MOVE #PK-2512 TO #RV-MSGCODE-FELD
    CALLNAT 'AAZ05N0' #RV-MELDUNG
  WHEN #SV-PERF-BIS EQ ' '
    MOVE #SK-C-PERF-BIS TO #RV-CURSPOS-FELD
*
    INCLUDE XXO71CC                                              /* 0026
      '#SV-VARIABLE.#SV-PERF-BIS'                               /* 0026
      '1'                                                       /* 0026
*
    MOVE #PK-2512 TO #RV-MSGCODE-FELD
    CALLNAT 'AAZ05N0' #RV-MELDUNG
  WHEN NONE
    IGNORE
END-DECIDE
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE STANDARD-DAT /*-------------------- STANDARD-DAT <<<<<
MOVE 'STANDARD-DAT' TO #RV-SUBROUTINE
*
MOVE #RV-VDT-DATN  TO #PV-DAT-N8
MOVE #RV-VDT-DATN  TO #PV-Z26-DAT                                 /* SSI
*
PERFORM DATUM-AUFBEREITEN                                         /* SSI
*
IF #XXZ26-RC NOT = 0                                              /* SSI
  MOVE #SK-C-PERF-BIS TO #RV-CURSPOS-FELD                       /* SSI
  INCLUDE XXO71CC                                                /* 0026
    '#SV-VARIABLE.#SV-PERF-BIS'                                 /* 0026
    '1'                                                         /* 0026
  MOVE #PK-2518 TO #RV-MSGCODE-FELD                             /* SSI
  CALLNAT 'AAZ05N0' #RV-MELDUNG                                 /* SSI
ELSE
  MOVE #XXZ26-OUT-DAT-ALPHA TO #SV-PERF-BIS                       /* SSI
  MOVE #XXZ26-OUT-DAT-NUM   TO #PV-PERF-BIS                       /* SSI
END-IF                                                            /* SSI
*
MOVE 1             TO #PV-DAT-N8-TT
COMPUTE #PV-DAT-N8-MM = #PV-DAT-N8-MM - 3
IF #PV-DAT-N8-MM LE 0
  ADD 12 TO #PV-DAT-N8-MM
  COMPUTE #PV-DAT-N8-JAHR = #PV-DAT-N8-JAHR - 1
END-IF
*                                              /* AAZ36 ausgesternt $$28
* RESET                    #Z36-VARIABLE
* MOVE *PROGRAM         TO #Z36-PROGRAM
* MOVE #RV-VDT-DATN     TO #Z36-VDT-DATN
* MOVE #PV-DAT-N8       TO #Z36-AB-DAT
* MOVE -1               TO #Z36-ANZAHL-TAG
* MOVE 'E'              TO #Z36-VERARB-C
* MOVE 'STK'            TO #Z36-BOEPLA-WRG-C
* CALLNAT 'AAZ36N0' #Z36-VARIABLE
* IF #Z36-RETURN-C NE 2
*   CALLNAT 'AAZ99N0' #RV-MELDUNG
* END-IF
* MOVE #Z36-GUELTIG-DAT TO #PV-Z26-DAT                            /* SSI
*
RESET #TAZ12-AREA                                                /* $$28
IF #PV-DAT-N8 EQ MASK(YYYYMMDD)                                /* $$29
  MOVE #PV-DAT-N8 TO #PV-DAT-A8                                /*    |
  MOVE EDITED #PV-DAT-A8 TO #PV-DAT-D (EM=YYYYMMDD)            /*    |
  REPEAT                                                       /* $$29
    SUBTRACT 1 FROM #PV-DAT-D                                    /*    |
    MOVE EDITED #PV-DAT-D (EM=YYYYMMDD) TO #PV-DAT-A8          /* $$29
    IF #PV-DAT-A8 IS (N8)                                      /*    |
      COMPUTE #PV-DAT-N8 = VAL(#PV-DAT-A8)                     /*    |
    ELSE                                                       /*    |
      ESCAPE BOTTOM                                            /*    |
    END-IF                                                     /* $$29
    INCLUDE TAZ12C0                                              /*    |
      '#PV-DAT-N8'           /* (1) Datum (N8)                   /*    |
    IF #XXA90-RC ^= #XXA90K-PK-RC-OK                             /*    |
      ESCAPE BOTTOM                                              /*    |
    END-IF                                                       /*    |
    UNTIL #TAZ12-ZV-C ^= 'A' /* Bankwerktag gesucht              /*    |
  END-REPEAT                                                     /*    |
END-IF                                                         /* $$29
*                                                                /*    |
IF #XXA90-RC = #XXA90K-PK-RC-OK                                  /*    |
  MOVE #PV-DAT-N8 TO #PV-Z26-DAT                                 /*    |
  PERFORM DATUM-AUFBEREITEN                                      /*    |
END-IF                                                           /*    |
IF #XXA90-RC NE #XXA90K-PK-RC-OK OR                              /*    |
   #XXZ26-RC NE 0                                                /*    |
  MOVE #RV-VDT-DATN TO #PV-Z26-DAT                               /*    |
  PERFORM DATUM-AUFBEREITEN                                      /*    |
END-IF                                                           /*    |
MOVE #XXZ26-OUT-DAT-ALPHA TO #SV-PERF-VON                        /*    |
MOVE #XXZ26-OUT-DAT-NUM   TO #PV-PERF-VON                        /* $$28
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE DRUCKEN /*------------------------------ DRUCKEN <<<<<
MOVE 'DRUCKEN' TO #RV-SUBROUTINE
*
IF #SV-WAHL = 0
  MOVE #SK-C-WAHL TO #RV-CURSPOS-FELD
*
  INCLUDE XXO71CC                                                /* 0026
    '#SV-WAHL'                                                  /* 0026
    '1'                                                         /* 0026
*
  MOVE #PK-2627 TO #RV-MSGCODE-FELD
  CALLNAT 'AAZ05N0' #RV-MELDUNG
ELSE
  IF #RV-FUNKTION EQ 'PF21'
    RESET #SV-DRUCKER-ADRESSE
  END-IF
  IF #SV-WAHL EQ #PK-PERF-BERICHT  OR
      #SV-WAHL EQ #PK-ERTRAGS-LISTE OR
      #SV-WAHL EQ #PK-PERF-BERICHT-KONS                      /* 1834 ---
    PERFORM DATUM-NOETIG               /* DATUMSEINGABE NOTWENDIG
  END-IF
END-IF
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE DATUM-NOETIG /*--------------------- DATUM-NOETIG <<<<
MOVE 'DATUM-NOETIG' TO #RV-SUBROUTINE
*
/* ---Von- und Bis-Datum m�ssen eingegeben werden ---------------------
*
IF #SV-PERF-VON = ' '
  IF #PV-PERF-VON = 0                          /* 0025
    MOVE #SK-C-PERF-VON TO #RV-CURSPOS-FELD
*
    INCLUDE XXO71CC                                              /* 0026
      '#SV-VARIABLE.#SV-PERF-VON'                               /* 0026
      '1'                                                       /* 0026
*
    MOVE #PK-2512 TO #RV-MSGCODE-FELD
    CALLNAT 'AAZ05N0' #RV-MELDUNG
  ELSE                                         /* 0025
    PERFORM SUB_INIT
  END-IF                                       /* 0025
END-IF
*
IF #RV-MSGKZ-MAP NE 'E'
  IF #SV-PERF-BIS = ' '
    MOVE #SK-C-PERF-BIS TO #RV-CURSPOS-FELD
*
    INCLUDE XXO71CC                                              /* 0026
      '#SV-VARIABLE.#SV-PERF-BIS'                               /* 0026
      '1'                                                       /* 0026
*
    MOVE #PK-2512 TO #RV-MSGCODE-FELD
    CALLNAT 'AAZ05N0' #RV-MELDUNG
  END-IF
END-IF
*
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE DB-PRUEFUNGEN /*------------------ DB-PRUEFUNGEN <<<<<
MOVE 'DB-PRUEFUNGEN' TO #RV-SUBROUTINE
*
MOVE #RV-VDT-DATN TO #PV-VDT-DATN
*
IF #RV-FUNKTION EQ 'ENTR' AND           /* KEINE DB-PRUEFUNG BEI
    #SV-WAHL     EQ #PK-DRUCKABFRAGE     /* DRUCKABFRAGE
  IGNORE
ELSE
  FETCH RETURN 'AAP02P0'
  PERFORM S10-SET-CURSPOS-GUI                                    /* 0026
END-IF
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE ENTER /*---------------------------------- ENTER <<<<<
MOVE 'ENTER' TO #RV-SUBROUTINE
*
PERFORM TRANSFER
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE PROGRAM-AKTION /* -------------- PROGRAM-AKTION <<<<<
MOVE 'PROGRAM-AKTION' TO #RV-SUBROUTINE
*
DECIDE ON FIRST VALUE OF #RV-FUNKTION
  VALUE 'PF19'
    PERFORM TRANSFER
* VALUE 'PF20' , 'PF21' , 'PF22'                          /* I$033
*   PERFORM VERBUCHEN                                     /* I$033
  VALUE 'PF23' , 'PF24'
    PERFORM TRANSFER
  NONE VALUE
    CALLNAT 'AAZ99N0' #RV-MELDUNG
END-DECIDE
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE VERBUCHEN /* ----------------------- VERBUCHEN <<<<<<
MOVE 'VERBUCHEN' TO #RV-SUBROUTINE
*
MOVE *TIMN TO #PV-MUT-TS-TIMN
MOVE #RV-VDT-DATN TO #PV-MUT-TS-DATN
*
DECIDE ON FIRST VALUE OF #RV-FUNKTION
  VALUE 'PF20'
    GT1.
    GET AAPRF00-U-00 #PV-ISN
    MOVE #PK-PROVISORISCHER-FP        TO AAPRF00-U-00.DAT-TYP-C
    MOVE #PK-MUTIERT                  TO AAPRF00-U-00.MUT-C
    MOVE #GDA-VDT-DATN                TO AAPRF00-U-00.MUT-DAT
    COMPUTE AAPRF00-U-00.MUT-TS = #PV-MUT-TS / 10
    MOVE *USER                        TO AAPRF00-U-00.MUT-BEN-ID
    MOVE *PROGRAM                     TO AAPRF00-U-00.MUT-PROG-ID
    UPDATE (GT1.)
    END TRANSACTION
  VALUE 'PF21'
    IF #SV-ANZAHL = 0
      MOVE 1 TO #SV-ANZAHL
    END-IF
    PERFORM BESTELLUNG
    MOVE #PK-DRUCK-ABENDS             TO #Z08-AUSF-BEST-ART-C
    PERFORM BAP-SCHREIBEN
  VALUE 'PF22'
    IF #SV-ANZAHL = 0
      MOVE 1 TO #SV-ANZAHL
    END-IF
    PERFORM BESTELLUNG
    MOVE #PK-DRUCK-SOFORT             TO #Z08-AUSF-BEST-ART-C
    PERFORM BAP-SCHREIBEN
  NONE VALUE
    CALLNAT 'AAZ99N0' #RV-MELDUNG
END-DECIDE
*
MOVE #PK-7532 TO #RV-MSGCODE-FELD
CALLNAT 'AAZ05N0' #RV-MELDUNG
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE BAP-SCHREIBEN /*------------------ BAP-SCHREIBEN <<<<<
MOVE 'BAP-SCHREIBEN' TO #RV-SUBROUTINE
*
* NEWPAGE
* WRITE '=' #Z08-AUSF-FUNK         (CD=RE)
* WRITE '=' #Z08-FIL-C             (CD=RE)
* WRITE '=' #Z08-ZRG-ID-NR         (CD=RE)
* WRITE '=' #Z08-REF-WRG-C         (CD=RE)
* WRITE '=' #Z08-PERF-VON-DAT      (CD=RE)
* WRITE '=' #Z08-PERF-BIS-DAT      (CD=RE)
* WRITE '=' #Z08-AUSZ-PER-DAT      (CD=RE)
* WRITE '=' #Z08-ZRBEZ             (CD=RE)
* WRITE '=' #Z08-DRUCK-ID          (CD=RE)
* WRITE '=' #Z08-DRUCK-COUNT       (CD=RE)
* WRITE '=' #Z08-SACHB-C           (CD=RE)
* WRITE '=' #Z08-SB-ID             (CD=RE)
* WRITE '=' #Z08-BERICHT-ART-C     (CD=RE)
* WRITE '=' #Z08-SPRACH-C          (CD=RE)
* WRITE '=' #Z08-BATCH-START-CNT   (CD=RE)
* WRITE '=' #Z08-ZRG-ID-TAB(1)     (CD=RE)
* WRITE '=' #Z08-ZRG-ID-TAB(2)     (CD=RE)
* ESCAPE ROUTINE
*
CALLNAT 'AAZ08N0' #Z08-VARIABLE
DECIDE ON FIRST VALUE OF #Z08-RETURN-C
  VALUE #PK-SATZ-VORHANDEN                               /* INIT 01 ---
    MOVE #PK-3173 TO #RV-MSGCODE-FELD
    CALLNAT 'AAZ05N0' #RV-MELDUNG
  VALUE #PK-ZU-VIELE-BEST                                /* INIT 02 ---
    MOVE #PK-3174 TO #RV-MSGCODE-FELD
    CALLNAT 'AAZ05N0' #RV-MELDUNG
  VALUE #PK-DRUCKJOB-FEHLER                              /* INIT 03 ---
    MOVE #PK-7664 TO #RV-MSGCODE-FELD
    CALLNAT 'AAZ05N0' #RV-MELDUNG
  ANY VALUE
    BACKOUT TRANSACTION
  NONE VALUE                                          /* ALLES O.K. ---
    END TRANSACTION
END-DECIDE
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE BESTELLUNG /*------------------------ BESTELLUNG <<<<<
MOVE 'BESTELLUNG' TO #RV-SUBROUTINE
*
RESET #Z08-VARIABLE
*
MOVE *PROGRAM                      TO #Z08-PROGRAM
MOVE #RV-FIL-C                     TO #Z08-FIL-C
MOVE #SV-DRUCKER-ADRESSE           TO #Z08-DRUCK-ID
MOVE #SV-ANZAHL                    TO #Z08-DRUCK-COUNT
MOVE #RV-SV-C                      TO #Z08-SACHB-C       /* ORIG. SACHB.
MOVE #RV-SB-ID                     TO #Z08-SB-ID
MOVE #PK-INTERN                    TO #Z08-BERICHT-ART-C
*
IF #SV-WAHL = #PK-VERM-VERZEICHNIS-KONS   OR                /* 1835
    #SV-WAHL = #PK-VERM-ANALYSE-KONS       OR                /* 1835
    #SV-WAHL = #PK-VERM-VERZ-ANALYSE-KONS  OR                /* 1835
    #SV-WAHL = #PK-PERF-BERICHT-KONS                            /* 1834
  MOVE #PV-REF-WRG-C-A12             TO #Z08-REF-WRG-C     /* 1835
  MOVE #PV-SPRACH-C-A12              TO #Z08-SPRACH-C      /* 1835
  MOVE #PV-ZRBEZ-A12                 TO #Z08-ZRBEZ         /* 1835
  MOVE #PV-ZRG-ID-TAB(*)             TO #Z08-ZRG-ID-TAB(*) /* 1835
*
ELSE                                                        /* 1835
  MOVE #PV-ZRG-ID-NR                 TO #Z08-ZRG-ID-NR
  MOVE #SV-ZRBEZ                     TO #Z08-ZRBEZ
  MOVE #PV-REF-WRG-C                 TO #Z08-REF-WRG-C          /* 1600
END-IF                                                    /* 1835
*
DECIDE ON FIRST VALUE OF #SV-WAHL
  VALUE #PK-VERM-VERZEICHNIS
    MOVE #PK-FUNK-VERMOEGEN         TO #Z08-AUSF-FUNK
  VALUE #PK-VERM-VERZEICHNIS-KONS                       /* 1835
    MOVE #PK-FUNK-VERMOEGEN-KONS    TO #Z08-AUSF-FUNK   /* 1835
  VALUE #PK-VERM-ANALYSE
    MOVE #PK-FUNK-ANALYSE           TO #Z08-AUSF-FUNK
  VALUE #PK-VERM-ANALYSE-KONS                           /* 1835
    MOVE #PK-FUNK-ANALYSE-KONS      TO #Z08-AUSF-FUNK   /* 1835
  VALUE #PK-VERM-VERZ-ANALYSE
    MOVE #PK-FUNK-VERZ-ANALYSE      TO #Z08-AUSF-FUNK
  VALUE #PK-VERM-VERZ-ANALYSE-KONS                      /* 1835
    MOVE #PK-FUNK-VERZ-ANALYSE-KONS TO #Z08-AUSF-FUNK   /* 1835
  VALUE #PK-PERF-BERICHT
    MOVE #PK-FUNK-PERFORMANCE       TO #Z08-AUSF-FUNK
    MOVE #PV-PERF-VON               TO #Z08-PERF-VON-DAT
    MOVE #PV-PERF-BIS               TO #Z08-PERF-BIS-DAT
  VALUE #PK-PERF-BERICHT-KONS
    MOVE #PK-FUNK-PERFORMANCE-KONS  TO #Z08-AUSF-FUNK
    MOVE #PV-PERF-VON               TO #Z08-PERF-VON-DAT
    MOVE #PV-PERF-BIS               TO #Z08-PERF-BIS-DAT
  VALUE #PK-ERTRAGS-LISTE
    MOVE #PK-FUNK-ERTRAGS-LISTE     TO #Z08-AUSF-FUNK
    MOVE #PV-PERF-VON               TO #Z08-PERF-VON-DAT
    MOVE #PV-PERF-BIS               TO #Z08-PERF-BIS-DAT
  NONE VALUE
    CALLNAT 'AAZ99N0' #RV-MELDUNG
END-DECIDE
*
IF #RV-FUNKTION EQ 'PF22'  /* SOFORT-DRUCK HAT GESTERN ALS PER-DAT
  RESET #TAZ12-AREA                                              /* $$28
  MOVE #RV-VDT-DATN TO #PV-DAT-N8                                /*    |
  IF #PV-DAT-N8 EQ MASK(YYYYMMDD)                              /* $$29
    MOVE #PV-DAT-N8 TO #PV-DAT-A8                              /*    |
    MOVE EDITED #PV-DAT-A8 TO #PV-DAT-D (EM=YYYYMMDD)          /*    |
    REPEAT                                                     /* $$29
      SUBTRACT 1 FROM #PV-DAT-D                                  /*    |
      MOVE EDITED #PV-DAT-D (EM=YYYYMMDD) TO #PV-DAT-A8        /* $$29
      IF #PV-DAT-A8 IS (N8)                                    /*    |
        COMPUTE #PV-DAT-N8 = VAL(#PV-DAT-A8)                   /*    |
      ELSE                                                     /*    |
        ESCAPE BOTTOM                                          /*    |
      END-IF                                                   /* $$29
      INCLUDE TAZ12C0                                            /*    |
        '#PV-DAT-N8'           /* (1) Datum (N8)                 /*    |
      IF #XXA90-RC ^= #XXA90K-PK-RC-OK                           /*    |
        ESCAPE BOTTOM                                            /*    |
      END-IF                                                     /*    |
      UNTIL #TAZ12-ZV-C ^= 'A' /* Bankwerktag gesucht            /*    |
    END-REPEAT                                                   /*    |
  END-IF                                                       /* $$29
  IF #XXA90-RC = #XXA90K-PK-RC-OK                                /*    |
    MOVE #PV-DAT-N8 TO #Z08-AUSZ-PER-DAT                         /*    |
  ELSE                                                           /*    |
    MOVE #RV-VDT-DATN TO #Z08-AUSZ-PER-DAT                       /*    |
  END-IF                                                         /* $$28
* RESET                               #Z36-VARIABLE /* ausgesternt  $$28
* MOVE *PROGRAM                    TO #Z36-PROGRAM
* MOVE #RV-VDT-DATN                TO #Z36-VDT-DATN
* MOVE #RV-VDT-DATN                TO #Z36-AB-DAT
* MOVE -1                          TO #Z36-ANZAHL-TAG
* MOVE 'E'                         TO #Z36-VERARB-C
* MOVE 'STK'                       TO #Z36-BOEPLA-WRG-C
* CALLNAT 'AAZ36N0' #Z36-VARIABLE
* IF #Z36-RETURN-C NE 2
*   CALLNAT 'AAZ99N0' #RV-MELDUNG
* END-IF
* MOVE #Z36-GUELTIG-DAT            TO #Z08-AUSZ-PER-DAT
ELSE
  MOVE #RV-VDT-DATN                TO #Z08-AUSZ-PER-DAT
END-IF
*
END-SUBROUTINE
*
*
DEFINE SUBROUTINE CANCEL /*-------------------------------- CANCEL <<<<
MOVE 'CANCEL' TO #RV-SUBROUTINE
*
MOVE 'PF2' TO #RV-FUNKTION
*
MOVE #PK-7519 TO #RV-MSGCODE-FELD
CALLNAT 'AAZ05N0' #RV-MELDUNG
*
PERFORM TRANSFER
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE REBUILD /*------------------------------ REBUILD <<<<<
MOVE 'REBUILD' TO #RV-SUBROUTINE
*
MOVE #PK-7518 TO #RV-MSGCODE-FELD
*
CALLNAT 'AAZ05N0' #RV-MELDUNG                    /* MELDUNG
*
PERFORM SUB_INIT
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE TRANSFER /*--------------------------- TRANSFER <<<<<
MOVE 'TRANSFER' TO #RV-SUBROUTINE
*
MOVE 'Y' TO #RV-EOP-SEL
*
DECIDE ON FIRST VALUE OF #RV-FUNKTION
*
  VALUE 'PF1', 'PF2', 'PF3', 'PF4',             /* I$033
      'PF15', 'PF16', 'PF17', 'PF18','PF19',    /* I$033
      'PF20', 'PF21', 'PF22'                    /* I$033
    MOVE #RV-FUNKTION TO #RV-LABEL              /* PF-KEY IST LABEL ---
*
  VALUE 'ENTR'
    DECIDE ON FIRST VALUE OF #SV-WAHL
      VALUE #PK-ZAHLUNGEN
        MOVE 'KBW  '    TO #RV-LABEL
      VALUE #PK-LIEFERUNGEN
        MOVE 'DPW  '    TO #RV-LABEL
      VALUE #PK-MUTATION
        MOVE 'MUT  '    TO #RV-LABEL
      VALUE #PK-DRUCKABFRAGE
        MOVE 'DRU  '    TO #RV-LABEL
      VALUE #PK-BSPEKU                                          /* I$030
        #AAP10A0-IN-FIL-C   := #RV-FIL-C                        /* I$030
        #AAP10A0-IN-PEM     := #RV-SV-C                         /* I$030
        #AAP10A0-IN-PEM-STV := #RV-SB-C                         /* I$030
        INCLUDE AAP10C0                                         /* I$030
        MOVE 'N' TO #RV-EOP-SEL                                 /* I$030
      VALUE #PK-PRFCHART                                        /* I$032
        #AAP11A0-IN-FIL-C         := #RV-FIL-C                  /* I$032
        #AAP11A0-IN-PEM-ID-NR     := #RV-SV-C                   /* I$032
        #AAP11A0-IN-STV-PEM-ID-NR := #RV-SB-C                   /* I$032
        INCLUDE AAP11C0                                         /* I$032
        MOVE 'N' TO #RV-EOP-SEL                                 /* I$032
      VALUE #PK-EU-ZAHLSTELLENST                                /* I$031
        #AAP12A0-IN-FIL-C   := #RV-FIL-C                        /* I$031
        #AAP12A0-IN-PEM     := #RV-SV-C                         /* I$031
        #AAP12A0-IN-PEM-STV := #RV-SB-C                         /* I$031
        INCLUDE AAP12C0                                         /* I$031
        MOVE 'N' TO #RV-EOP-SEL                                 /* I$031
      NONE VALUE
        MOVE 'PF19 '    TO #RV-LABEL                 /* PERFORMANCE ---
    END-DECIDE
*
  VALUE 'PF23'
    MOVE 'KBW  '      TO #RV-LABEL
*
  VALUE 'PF24'
    MOVE 'DPW  '      TO #RV-LABEL
*
  NONE VALUE
    CALLNAT 'AAZ99N0' #RV-MELDUNG             /* SYSTEM-ERROR
END-DECIDE
*
SET CONTROL 'WB'
*
PERFORM TRANSFER-SHL
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE TRANSFER-SHL /*-------------------- TRANSFER-SHL <<<<<
MOVE 'TRANSFER-SHL' TO #RV-SUBROUTINE
*
MOVE #RV-LABEL     TO #GDA-FKTREQ
*
IF #PV-ZRBEZ-A12 NE ' '                                   /* 1834
  MOVE #PV-ZRG-ID-TAB(*) TO #GDA-ZRG-ID-TAB(*)           /* 1834
  MOVE #PV-PERF-VON      TO #GDA-PERDAT-VON              /* 1834
  MOVE #PV-PERF-BIS      TO #GDA-PERDAT-BIS              /* 1834
  MOVE #PV-REF-WRG-C-A12 TO #GDA-REF-WRG-C               /* 1834
ELSE                                                      /* 1834
  RESET                     #GDA-ZRG-ID-TAB(*)           /* 1834
  MOVE #PV-ZRG-ID-NR     TO #GDA-ZRGPAR-SHL   /* UEBERNEHMEN
  MOVE #PV-PERF-VON      TO #GDA-PERDAT-VON
  MOVE #PV-PERF-BIS      TO #GDA-PERDAT-BIS
  IF #RV-FUNKTION NE 'PF4'
    MOVE #PV-REF-WRG-C   TO #GDA-REF-WRG-C
  END-IF
END-IF                                                    /* 1834
*
END-SUBROUTINE
*
*
*
DEFINE SUBROUTINE DATUM-AUFBEREITEN /*---------- DATUM-AUFBEREITEN <<<<<
MOVE 'DATUM-AUFBEREITEN' TO #RV-SUBROUTINE
*
* DATI WERDEN FUER DIE AUSGABE AM BILDSCHIRM INS FORMAT TT.MM.JJJJ
* KONVERTIERT
*
RESET #XXZ26-PARM
*
MOVE #PV-Z26-DAT  TO #XXZ26-IN-DAT-NUM
MOVE '.'          TO #XXZ26-DELIMITER
MOVE 2            TO #XXZ26-FORMAT
*
CALLNAT 'XXZ26N0' #XXZ26-PARM
*
RESET #PV-Z26-DAT
*
*
END-SUBROUTINE
*
*
*
***********************************************************************
DEFINE SUBROUTINE DRUCKER-PRUEFEN /*--------------- DRUCKER-PRUEFEN <<<<
MOVE 'DRUCKER-PRUEFEN' TO #RV-SUBROUTINE
*
RESET #Z34-VARIABLE
*
MOVE *PROGRAM            TO #Z34-PGM-ID
MOVE #PK-UMSETZUNG       TO #Z34-VERARB-C
MOVE #PK-TZA-DRUCKER     TO #Z34-JVC90-NAME
MOVE #SV-DRUCKER-ADRESSE TO #Z34-CODE-WERT
*
CALLNAT 'AAZ34N0' #Z34-VARIABLE
*
IF #Z34-CODE-WERT EQ ' '              /* KEINE WAHL GETROFFEN
  MOVE #SK-C-DRUCKER  TO #RV-CURSPOS-FELD
*
  INCLUDE XXO71CC                                                /* 0026
    '#SV-DRUCKER-ADRESSE'                                       /* 0026
    '1'                                                         /* 0026
*
  MOVE #PK-2513       TO #RV-MSGCODE-FELD
  CALLNAT 'AAZ05N0'      #RV-MELDUNG
ELSE
  MOVE #Z34-CODE-WERT TO #SV-DRUCKER-ADRESSE
END-IF
*
END-SUBROUTINE
*
*
*
*
************************************************************* Start 0026
DEFINE SUBROUTINE                                    S10-SET-CURSPOS-GUI
* i: #RV-CURSPOS-MAP #SK-C-WAHL #SK-C-DRUCKER #SK-C-REF-WRG
* i: #SK-C-PERF-VON #SK-C-PERF-BIS #SK-C-ZEBEZ
* o: --
*
DECIDE ON FIRST VALUE OF #RV-CURSPOS-MAP
  VALUE #SK-C-WAHL
    INCLUDE XXO71CC
      '#SV-WAHL'
      '1'
  VALUE #SK-C-DRUCKER
    INCLUDE XXO71CC
      '#SV-DRUCKER-ADRESSE'
      '1'
  VALUE #SK-C-REF-WRG
    INCLUDE XXO71CC
      '#SV-REF-WRG'
      '1'
  VALUE #SK-C-PERF-VON
    INCLUDE XXO71CC
      '#SV-VARIABLE.#SV-PERF-VON'
      '1'
  VALUE #SK-C-PERF-BIS
    INCLUDE XXO71CC
      '#SV-VARIABLE.#SV-PERF-BIS'
      '1'
  VALUE #SK-C-ZRBEZ
    INCLUDE XXO71CC
      '#SV-ZRBEZ-7'
      '1'
  NONE VALUE
    IGNORE
END-DECIDE
*
END-SUBROUTINE                                               /* End 0026
***********************************************************************
ON ERROR /*----------------------------------------------ON ERROR <<<<<
*
  INCLUDE AAZ98C0
*
END-ERROR
*
* =====================================================================
* END OF PROGRAM ------------------------------------- END OF PROGRAM
END
