DEFINE DATA         
        
LOCAL USING ALLJJ--V
LOCAL USING ABRJJ1-V

LOCAL   
*       
1 #I6				(I4)
1 #S_PROJEKT		(A3)
1 #S_BETRNR			(A3)
1 #S_JAHR			(A3)
1 #J				(I2)
1 #S-F98			(L)
1 #K				(I2)
END-DEFINE          
*       
INCLUDE ANNF98-C
*
END     
