DEFINE DATA 
LOCAL
1 #A (A1/1:*,1:*)
1 #I (I4)
END-DEFINE

FOR #I = 1 TO 1000
	RESIZE ARRAY #A TO (1:250,1:250)
	RESIZE ARRAY #A TO (1:500,1:500)
	RESIZE ARRAY #A TO (1:750,1:750)
	RESIZE ARRAY #A TO (1:1000,1:1000)
	REDUCE ARRAY #A TO 0
END-FOR

END
