DEFINE DATA
GLOBAL USING ADD001AA
LOCAL
1 #EXIT-SUB (L)
1 T_N_10_7(N10.7)
1 T_N_10_2(N10.2)
1 T_P_10_7(P10.7)
1 T_P_10_2(P10.2)
1 F_N_10_7(N10.7)
1 F_N_10_2(N10.2)
1 F_P_10_7(P10.7)
1 F_P_10_2(P10.2)
1 F_I_1(I1)
1 F_I_2(I2)
1 F_I_4(I4)
1 S_N_10_7(N10.7)
1 S_N_10_2(N10.2)
1 S_P_10_7(P10.7)
1 S_P_10_2(P10.2)
1 S_I_1(I1)
1 S_I_2(I2)
1 S_I_4(I4)
END-DEFINE
FORMAT (1) LS=250 PS=0
REPEAT WHILE #RETURN = TRUE
	DECIDE ON FIRST VALUE OF #COUNTER
			VALUE 1
				PERFORM SUB00001
				PERFORM RESETV
			VALUE 2
				PERFORM SUB00002
				PERFORM RESETV
			VALUE 3
				PERFORM SUB00003
				PERFORM RESETV
			VALUE 4
				PERFORM SUB00004
				PERFORM RESETV
			VALUE 5
				PERFORM SUB00005
				PERFORM RESETV
			VALUE 6
				PERFORM SUB00006
				PERFORM RESETV
			VALUE 7
				PERFORM SUB00007
				PERFORM RESETV
			VALUE 8
				PERFORM SUB00008
				PERFORM RESETV
			VALUE 9
				PERFORM SUB00009
				PERFORM RESETV
			VALUE 10
				PERFORM SUB00010
				PERFORM RESETV
			VALUE 11
				PERFORM SUB00011
				PERFORM RESETV
			NONE VALUE
				MOVE FALSE TO #RETURN
				ESCAPE MODULE
		END-DECIDE
	END-REPEAT

DEFINE SUBROUTINE RESETV
	ADD 1 TO #COUNTER
	MOVE 1 TO #OPERATION
	ADD 1 TO #TESTNUMBER
END-SUBROUTINE

DEFINE SUBROUTINE SUB00001
	MOVE FALSE TO #EXIT-SUB
	REPEAT WHILE #EXIT-SUB = FALSE
		DECIDE ON FIRST VALUE OF #OPERATION
				VALUE 0
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 99 TO S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_2 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 1
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -99 TO S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_2 = F_P_10_7 + S_I_2 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
COMPUTE T_P_10_2 = F_P_10_7 + S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 2
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -99 TO S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_2 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 3
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 33 TO S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_2 = F_P_10_7 + S_I_2 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
COMPUTE T_P_10_2 = F_P_10_7 + S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 4
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 33 TO S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_2 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 5
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -33 TO S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_2 = F_P_10_7 + S_I_2 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
COMPUTE T_P_10_2 = F_P_10_7 + S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 6
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -33 TO S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_2 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_2
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_2
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 7
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 8
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 9
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 10
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
		NONE VALUE
			MOVE TRUE TO #EXIT-SUB
		END-DECIDE
	END-REPEAT
	MOVE TRUE TO #RETURN
END-SUBROUTINE

DEFINE SUBROUTINE SUB00002
	MOVE FALSE TO #EXIT-SUB
	REPEAT WHILE #EXIT-SUB = FALSE
		DECIDE ON FIRST VALUE OF #OPERATION
				VALUE 0
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 1
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 2
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 3
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 4
MOVE -9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 5
MOVE -9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 6
MOVE -9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 7
MOVE -9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 8
MOVE -9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 9
MOVE -9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 10
MOVE -9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
		NONE VALUE
			MOVE TRUE TO #EXIT-SUB
		END-DECIDE
	END-REPEAT
	MOVE TRUE TO #RETURN
END-SUBROUTINE

DEFINE SUBROUTINE SUB00003
	MOVE FALSE TO #EXIT-SUB
	REPEAT WHILE #EXIT-SUB = FALSE
		DECIDE ON FIRST VALUE OF #OPERATION
				VALUE 0
MOVE -9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 1
MOVE 3333333333.3333333 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 2
MOVE 3333333333.3333333 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 3
MOVE 3333333333.3333333 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 4
MOVE 3333333333.3333333 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 5
MOVE 3333333333.3333333 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 6
MOVE 3333333333.3333333 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 7
MOVE 3333333333.3333333 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 8
MOVE 3333333333.3333333 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 9
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 10
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
		NONE VALUE
			MOVE TRUE TO #EXIT-SUB
		END-DECIDE
	END-REPEAT
	MOVE TRUE TO #RETURN
END-SUBROUTINE

DEFINE SUBROUTINE SUB00004
	MOVE FALSE TO #EXIT-SUB
	REPEAT WHILE #EXIT-SUB = FALSE
		DECIDE ON FIRST VALUE OF #OPERATION
				VALUE 0
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 1
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 2
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 3
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 4
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 5
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 6
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 7
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 8
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 9
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 10
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
		NONE VALUE
			MOVE TRUE TO #EXIT-SUB
		END-DECIDE
	END-REPEAT
	MOVE TRUE TO #RETURN
END-SUBROUTINE

DEFINE SUBROUTINE SUB00005
	MOVE FALSE TO #EXIT-SUB
	REPEAT WHILE #EXIT-SUB = FALSE
		DECIDE ON FIRST VALUE OF #OPERATION
				VALUE 0
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 1
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 2
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 3
MOVE -9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 4
MOVE -9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 5
MOVE -9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 6
MOVE -9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 7
MOVE -9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 8
MOVE -9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 9
MOVE -9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 10
MOVE -9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
		NONE VALUE
			MOVE TRUE TO #EXIT-SUB
		END-DECIDE
	END-REPEAT
	MOVE TRUE TO #RETURN
END-SUBROUTINE

DEFINE SUBROUTINE SUB00006
	MOVE FALSE TO #EXIT-SUB
	REPEAT WHILE #EXIT-SUB = FALSE
		DECIDE ON FIRST VALUE OF #OPERATION
				VALUE 0
MOVE 3333333333.3333333 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 1
MOVE 3333333333.3333333 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 2
MOVE 3333333333.3333333 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 3
MOVE 3333333333.3333333 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 4
MOVE 3333333333.3333333 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 5
MOVE 3333333333.3333333 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 6
MOVE 3333333333.3333333 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 7
MOVE 3333333333.3333333 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 8
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 9
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 10
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
		NONE VALUE
			MOVE TRUE TO #EXIT-SUB
		END-DECIDE
	END-REPEAT
	MOVE TRUE TO #RETURN
END-SUBROUTINE

DEFINE SUBROUTINE SUB00007
	MOVE FALSE TO #EXIT-SUB
	REPEAT WHILE #EXIT-SUB = FALSE
		DECIDE ON FIRST VALUE OF #OPERATION
				VALUE 0
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 1
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 2
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 3
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 4
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_N_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_N_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 5
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 6
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 7
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 8
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 9
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 10
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
		NONE VALUE
			MOVE TRUE TO #EXIT-SUB
		END-DECIDE
	END-REPEAT
	MOVE TRUE TO #RETURN
END-SUBROUTINE

DEFINE SUBROUTINE SUB00008
	MOVE FALSE TO #EXIT-SUB
	REPEAT WHILE #EXIT-SUB = FALSE
		DECIDE ON FIRST VALUE OF #OPERATION
				VALUE 0
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 1
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 2
MOVE -9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 3
MOVE -9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 4
MOVE -9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 5
MOVE -9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 6
MOVE -9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 7
MOVE -9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 8
MOVE -9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 9
MOVE -9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 10
MOVE 3333333333.3333333 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
		NONE VALUE
			MOVE TRUE TO #EXIT-SUB
		END-DECIDE
	END-REPEAT
	MOVE TRUE TO #RETURN
END-SUBROUTINE

DEFINE SUBROUTINE SUB00009
	MOVE FALSE TO #EXIT-SUB
	REPEAT WHILE #EXIT-SUB = FALSE
		DECIDE ON FIRST VALUE OF #OPERATION
				VALUE 0
MOVE 3333333333.3333333 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 1
MOVE 3333333333.3333333 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 2
MOVE 3333333333.3333333 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 3
MOVE 3333333333.3333333 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 4
MOVE 3333333333.3333333 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 5
MOVE 3333333333.3333333 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 6
MOVE 3333333333.3333333 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 7
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 8
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 9
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 10
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
		NONE VALUE
			MOVE TRUE TO #EXIT-SUB
		END-DECIDE
	END-REPEAT
	MOVE TRUE TO #RETURN
END-SUBROUTINE

DEFINE SUBROUTINE SUB00010
	MOVE FALSE TO #EXIT-SUB
	REPEAT WHILE #EXIT-SUB = FALSE
		DECIDE ON FIRST VALUE OF #OPERATION
				VALUE 0
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 1
MOVE -3333333333.3333333 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 2
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 3
MOVE -3333333333.3333333 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_7 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_7
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 4
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 5
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 6
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 7
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -9999 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 8
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 9
MOVE 9999999999.9999999 TO F_P_10_7
MOVE 3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
				VALUE 10
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE T_P_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE T_P_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
		NONE VALUE
			MOVE TRUE TO #EXIT-SUB
		END-DECIDE
	END-REPEAT
	MOVE TRUE TO #RETURN
END-SUBROUTINE

DEFINE SUBROUTINE SUB00011
	MOVE FALSE TO #EXIT-SUB
	REPEAT WHILE #EXIT-SUB = FALSE
		DECIDE ON FIRST VALUE OF #OPERATION
				VALUE 0
MOVE 9999999999.9999999 TO F_P_10_7
MOVE -3333 TO S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_4 Input'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
COMPUTE ROUNDED T_P_10_2 = F_P_10_7 + S_I_4
PRINT (1) NOTITLE #TESTNUMBER 'Results'
PRINT (1) NOTITLE NOHDR F_P_10_7
PRINT (1) NOTITLE NOHDR S_I_4
PRINT (1) NOTITLE NOHDR T_P_10_2
					ADD 1 TO #OPERATION
					ADD 1 TO #TESTNUMBER
		NONE VALUE
			MOVE TRUE TO #EXIT-SUB
		END-DECIDE
	END-REPEAT
	MOVE TRUE TO #RETURN
END-SUBROUTINE




ON ERROR
PRINT (1) NOTITLE #TESTNUMBER *PROGRAM ' ERROR-NR:' *ERROR-NR
ESCAPE MODULE
END-ERROR
END
