DEFINE DATA
GLOBAL USING ARGDA
LOCAL USING ARLDA
END-DEFINE
FORMAT (1) LS=180 PS=0
REPEAT WHILE #RETURN = TRUE
DECIDE ON FIRST VALUE OF #COUNTER
VALUE 1
 PERFORM AR1
 PERFORM RESETV
VALUE 2
 PERFORM AR2
 PERFORM RESETV
VALUE 3
 PERFORM AR3
 PERFORM RESETV
VALUE 4
 PERFORM AR4
 PERFORM RESETV
VALUE 5
 PERFORM AR5
 PERFORM RESETV
VALUE 6
 PERFORM AR6
 PERFORM RESETV
VALUE 7
 PERFORM AR7
 PERFORM RESETV
VALUE 8
 PERFORM AR8
 PERFORM RESETV
VALUE 9
 PERFORM AR9
 PERFORM RESETV
VALUE 10
 PERFORM AR10
 PERFORM RESETV
NONE VALUE
 MOVE FALSE TO #RETURN
 ESCAPE MODULE
END-DECIDE
END-REPEAT

DEFINE SUBROUTINE RESETV
 ADD 1 TO #COUNTER
 MOVE 1 TO #OPERATION
 MOVE 1 TO #INDEX1
 MOVE 1 TO #INDEX2
 ADD 1 TO #CASENUMBER
END-SUBROUTINE

DEFINE SUBROUTINE AR1
 REPEAT WHILE #INDEX1 < 3
   REPEAT WHILE #INDEX2 < 3
     MOVE #VALUEN0_7(#INDEX1) TO #CN0_7
     MOVE #VALUEP22_7(#INDEX2) TO #CP22_7
     MOVE FALSE TO #EXIT-SUB
     REPEAT WHILE #EXIT-SUB = FALSE
      DECIDE ON FIRST VALUE OF #OPERATION
       VALUE 1
        MOVE 'ADD #CN0_7 #CP22_7 GIVING #RF8' TO #DESC
        ADD #CN0_7 #CP22_7 GIVING #RF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 2
        MOVE 'ADD ROUNDED #CN0_7 #CP22_7 GIVING #RF8' TO #DESC
        ADD ROUNDED #CN0_7 #CP22_7 GIVING #RF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 3
        MOVE 'SUBTRACT #CN0_7 #CP22_7 GIVING #RF8' TO #DESC
        SUBTRACT #CN0_7 FROM #CP22_7 GIVING #RF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 4
        MOVE 'SUBTRACT ROUNDED #CN0_7 #CP22_7 GIVING #RF8' TO #DESC
        SUBTRACT ROUNDED #CN0_7 FROM #CP22_7 GIVING #RF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 5
        MOVE 'MULTIPLY #CN0_7 BY #CP22_7 GIVING #RF8' TO #DESC
        MULTIPLY #CN0_7 BY #CP22_7 GIVING #RF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 6
        MOVE 'MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RF8' TO #DESC
        MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 7
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 8
        MOVE 'DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RF8' TO #DESC
        DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 9
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 10
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 11
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 12
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 13
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 14
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 15
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 16
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 17
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 18
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 19
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 20
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 21
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 22
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 23
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 24
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 25
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 26
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 27
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 28
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 29
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 30
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RF8 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RF8(EM=NZZZZZZZZZZ.999999) #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
         NONE
          MOVE TRUE TO #EXIT-SUB
        END-DECIDE
       END-REPEAT
     ADD 1 TO #INDEX2
     MOVE 1 TO #OPERATION
   END-REPEAT
   ADD 1 TO #INDEX1
   MOVE 1 TO #INDEX2
 END-REPEAT
 MOVE TRUE TO #RETURN
END-SUBROUTINE
DEFINE SUBROUTINE AR2
 REPEAT WHILE #INDEX1 < 3
   REPEAT WHILE #INDEX2 < 3
     MOVE #VALUEN0_7(#INDEX1) TO #CN0_7
     MOVE #VALUEP22_7(#INDEX2) TO #CP22_7
     MOVE FALSE TO #EXIT-SUB
     REPEAT WHILE #EXIT-SUB = FALSE
      DECIDE ON FIRST VALUE OF #OPERATION
       VALUE 1
        MOVE 'ADD #CN0_7 #CP22_7 GIVING #RN29_0' TO #DESC
        ADD #CN0_7 #CP22_7 GIVING #RN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 2
        MOVE 'ADD ROUNDED #CN0_7 #CP22_7 GIVING #RN29_0' TO #DESC
        ADD ROUNDED #CN0_7 #CP22_7 GIVING #RN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 3
        MOVE 'SUBTRACT #CN0_7 #CP22_7 GIVING #RN29_0' TO #DESC
        SUBTRACT #CN0_7 FROM #CP22_7 GIVING #RN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 4
        MOVE 'SUBTRACT ROUNDED #CN0_7 #CP22_7 GIVING #RN29_0' TO #DESC
        SUBTRACT ROUNDED #CN0_7 FROM #CP22_7 GIVING #RN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 5
        MOVE 'MULTIPLY #CN0_7 BY #CP22_7 GIVING #RN29_0' TO #DESC
        MULTIPLY #CN0_7 BY #CP22_7 GIVING #RN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 6
        MOVE 'MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RN29_0' TO #DESC
        MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 7
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 8
        MOVE 'DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RN29_0' TO #DESC
        DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 9
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 10
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 11
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 12
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 13
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 14
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 15
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 16
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 17
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 18
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 19
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 20
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 21
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 22
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 23
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 24
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 25
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 26
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 27
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 28
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 29
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 30
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN29_0 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN29_0 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
         NONE
          MOVE TRUE TO #EXIT-SUB
        END-DECIDE
       END-REPEAT
     ADD 1 TO #INDEX2
     MOVE 1 TO #OPERATION
   END-REPEAT
   ADD 1 TO #INDEX1
   MOVE 1 TO #INDEX2
 END-REPEAT
 MOVE TRUE TO #RETURN
END-SUBROUTINE
DEFINE SUBROUTINE AR3
 REPEAT WHILE #INDEX1 < 3
   REPEAT WHILE #INDEX2 < 3
     MOVE #VALUEN0_7(#INDEX1) TO #CN0_7
     MOVE #VALUEP22_7(#INDEX2) TO #CP22_7
     MOVE FALSE TO #EXIT-SUB
     REPEAT WHILE #EXIT-SUB = FALSE
      DECIDE ON FIRST VALUE OF #OPERATION
       VALUE 1
        MOVE 'ADD #CN0_7 #CP22_7 GIVING #RN0_7' TO #DESC
        ADD #CN0_7 #CP22_7 GIVING #RN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 2
        MOVE 'ADD ROUNDED #CN0_7 #CP22_7 GIVING #RN0_7' TO #DESC
        ADD ROUNDED #CN0_7 #CP22_7 GIVING #RN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 3
        MOVE 'SUBTRACT #CN0_7 #CP22_7 GIVING #RN0_7' TO #DESC
        SUBTRACT #CN0_7 FROM #CP22_7 GIVING #RN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 4
        MOVE 'SUBTRACT ROUNDED #CN0_7 #CP22_7 GIVING #RN0_7' TO #DESC
        SUBTRACT ROUNDED #CN0_7 FROM #CP22_7 GIVING #RN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 5
        MOVE 'MULTIPLY #CN0_7 BY #CP22_7 GIVING #RN0_7' TO #DESC
        MULTIPLY #CN0_7 BY #CP22_7 GIVING #RN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 6
        MOVE 'MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RN0_7' TO #DESC
        MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 7
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 8
        MOVE 'DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RN0_7' TO #DESC
        DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 9
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 10
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 11
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 12
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 13
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 14
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 15
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 16
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 17
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 18
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 19
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 20
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 21
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 22
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 23
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 24
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 25
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 26
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 27
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 28
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 29
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 30
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN0_7 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN0_7 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
         NONE
          MOVE TRUE TO #EXIT-SUB
        END-DECIDE
       END-REPEAT
     ADD 1 TO #INDEX2
     MOVE 1 TO #OPERATION
   END-REPEAT
   ADD 1 TO #INDEX1
   MOVE 1 TO #INDEX2
 END-REPEAT
 MOVE TRUE TO #RETURN
END-SUBROUTINE
DEFINE SUBROUTINE AR4
 REPEAT WHILE #INDEX1 < 3
   REPEAT WHILE #INDEX2 < 3
     MOVE #VALUEN0_7(#INDEX1) TO #CN0_7
     MOVE #VALUEP22_7(#INDEX2) TO #CP22_7
     MOVE FALSE TO #EXIT-SUB
     REPEAT WHILE #EXIT-SUB = FALSE
      DECIDE ON FIRST VALUE OF #OPERATION
       VALUE 1
        MOVE 'ADD #CN0_7 #CP22_7 GIVING #RN22_7' TO #DESC
        ADD #CN0_7 #CP22_7 GIVING #RN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 2
        MOVE 'ADD ROUNDED #CN0_7 #CP22_7 GIVING #RN22_7' TO #DESC
        ADD ROUNDED #CN0_7 #CP22_7 GIVING #RN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 3
        MOVE 'SUBTRACT #CN0_7 #CP22_7 GIVING #RN22_7' TO #DESC
        SUBTRACT #CN0_7 FROM #CP22_7 GIVING #RN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 4
        MOVE 'SUBTRACT ROUNDED #CN0_7 #CP22_7 GIVING #RN22_7' TO #DESC
        SUBTRACT ROUNDED #CN0_7 FROM #CP22_7 GIVING #RN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 5
        MOVE 'MULTIPLY #CN0_7 BY #CP22_7 GIVING #RN22_7' TO #DESC
        MULTIPLY #CN0_7 BY #CP22_7 GIVING #RN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 6
        MOVE 'MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RN22_7' TO #DESC
        MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 7
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 8
        MOVE 'DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RN22_7' TO #DESC
        DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 9
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 10
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 11
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 12
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 13
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 14
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 15
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 16
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 17
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 18
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 19
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 20
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 21
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 22
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 23
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 24
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 25
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 26
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 27
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 28
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 29
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 30
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RN22_7 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RN22_7 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
         NONE
          MOVE TRUE TO #EXIT-SUB
        END-DECIDE
       END-REPEAT
     ADD 1 TO #INDEX2
     MOVE 1 TO #OPERATION
   END-REPEAT
   ADD 1 TO #INDEX1
   MOVE 1 TO #INDEX2
 END-REPEAT
 MOVE TRUE TO #RETURN
END-SUBROUTINE
DEFINE SUBROUTINE AR5
 REPEAT WHILE #INDEX1 < 3
   REPEAT WHILE #INDEX2 < 3
     MOVE #VALUEN0_7(#INDEX1) TO #CN0_7
     MOVE #VALUEP22_7(#INDEX2) TO #CP22_7
     MOVE FALSE TO #EXIT-SUB
     REPEAT WHILE #EXIT-SUB = FALSE
      DECIDE ON FIRST VALUE OF #OPERATION
       VALUE 1
        MOVE 'ADD #CN0_7 #CP22_7 GIVING #RP29_0' TO #DESC
        ADD #CN0_7 #CP22_7 GIVING #RP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 2
        MOVE 'ADD ROUNDED #CN0_7 #CP22_7 GIVING #RP29_0' TO #DESC
        ADD ROUNDED #CN0_7 #CP22_7 GIVING #RP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 3
        MOVE 'SUBTRACT #CN0_7 #CP22_7 GIVING #RP29_0' TO #DESC
        SUBTRACT #CN0_7 FROM #CP22_7 GIVING #RP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 4
        MOVE 'SUBTRACT ROUNDED #CN0_7 #CP22_7 GIVING #RP29_0' TO #DESC
        SUBTRACT ROUNDED #CN0_7 FROM #CP22_7 GIVING #RP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 5
        MOVE 'MULTIPLY #CN0_7 BY #CP22_7 GIVING #RP29_0' TO #DESC
        MULTIPLY #CN0_7 BY #CP22_7 GIVING #RP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 6
        MOVE 'MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RP29_0' TO #DESC
        MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 7
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 8
        MOVE 'DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RP29_0' TO #DESC
        DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 9
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 10
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 11
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 12
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 13
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 14
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 15
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 16
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 17
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 18
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 19
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 20
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 21
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 22
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 23
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 24
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 25
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 26
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 27
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 28
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 29
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 30
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP29_0 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP29_0 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
         NONE
          MOVE TRUE TO #EXIT-SUB
        END-DECIDE
       END-REPEAT
     ADD 1 TO #INDEX2
     MOVE 1 TO #OPERATION
   END-REPEAT
   ADD 1 TO #INDEX1
   MOVE 1 TO #INDEX2
 END-REPEAT
 MOVE TRUE TO #RETURN
END-SUBROUTINE
DEFINE SUBROUTINE AR6
 REPEAT WHILE #INDEX1 < 3
   REPEAT WHILE #INDEX2 < 3
     MOVE #VALUEN0_7(#INDEX1) TO #CN0_7
     MOVE #VALUEP22_7(#INDEX2) TO #CP22_7
     MOVE FALSE TO #EXIT-SUB
     REPEAT WHILE #EXIT-SUB = FALSE
      DECIDE ON FIRST VALUE OF #OPERATION
       VALUE 1
        MOVE 'ADD #CN0_7 #CP22_7 GIVING #RP0_7' TO #DESC
        ADD #CN0_7 #CP22_7 GIVING #RP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 2
        MOVE 'ADD ROUNDED #CN0_7 #CP22_7 GIVING #RP0_7' TO #DESC
        ADD ROUNDED #CN0_7 #CP22_7 GIVING #RP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 3
        MOVE 'SUBTRACT #CN0_7 #CP22_7 GIVING #RP0_7' TO #DESC
        SUBTRACT #CN0_7 FROM #CP22_7 GIVING #RP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 4
        MOVE 'SUBTRACT ROUNDED #CN0_7 #CP22_7 GIVING #RP0_7' TO #DESC
        SUBTRACT ROUNDED #CN0_7 FROM #CP22_7 GIVING #RP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 5
        MOVE 'MULTIPLY #CN0_7 BY #CP22_7 GIVING #RP0_7' TO #DESC
        MULTIPLY #CN0_7 BY #CP22_7 GIVING #RP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 6
        MOVE 'MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RP0_7' TO #DESC
        MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 7
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 8
        MOVE 'DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RP0_7' TO #DESC
        DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 9
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 10
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 11
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 12
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 13
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 14
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 15
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 16
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 17
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 18
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 19
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 20
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 21
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 22
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 23
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 24
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 25
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 26
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 27
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 28
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 29
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 30
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP0_7 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP0_7 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
         NONE
          MOVE TRUE TO #EXIT-SUB
        END-DECIDE
       END-REPEAT
     ADD 1 TO #INDEX2
     MOVE 1 TO #OPERATION
   END-REPEAT
   ADD 1 TO #INDEX1
   MOVE 1 TO #INDEX2
 END-REPEAT
 MOVE TRUE TO #RETURN
END-SUBROUTINE
DEFINE SUBROUTINE AR7
 REPEAT WHILE #INDEX1 < 3
   REPEAT WHILE #INDEX2 < 3
     MOVE #VALUEN0_7(#INDEX1) TO #CN0_7
     MOVE #VALUEP22_7(#INDEX2) TO #CP22_7
     MOVE FALSE TO #EXIT-SUB
     REPEAT WHILE #EXIT-SUB = FALSE
      DECIDE ON FIRST VALUE OF #OPERATION
       VALUE 1
        MOVE 'ADD #CN0_7 #CP22_7 GIVING #RP22_7' TO #DESC
        ADD #CN0_7 #CP22_7 GIVING #RP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 2
        MOVE 'ADD ROUNDED #CN0_7 #CP22_7 GIVING #RP22_7' TO #DESC
        ADD ROUNDED #CN0_7 #CP22_7 GIVING #RP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 3
        MOVE 'SUBTRACT #CN0_7 #CP22_7 GIVING #RP22_7' TO #DESC
        SUBTRACT #CN0_7 FROM #CP22_7 GIVING #RP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 4
        MOVE 'SUBTRACT ROUNDED #CN0_7 #CP22_7 GIVING #RP22_7' TO #DESC
        SUBTRACT ROUNDED #CN0_7 FROM #CP22_7 GIVING #RP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 5
        MOVE 'MULTIPLY #CN0_7 BY #CP22_7 GIVING #RP22_7' TO #DESC
        MULTIPLY #CN0_7 BY #CP22_7 GIVING #RP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 6
        MOVE 'MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RP22_7' TO #DESC
        MULTIPLY ROUNDED #CN0_7 BY #CP22_7 GIVING #RP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 7
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 8
        MOVE 'DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RP22_7' TO #DESC
        DIVIDE ROUNDED #CN0_7 INTO #CP22_7 GIVING #RP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 9
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 10
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 11
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 12
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 13
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 14
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 15
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 16
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 17
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 18
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 19
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 20
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REI1' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 21
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REI2' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 22
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REI4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 23
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 24
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 25
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 26
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 27
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 28
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 29
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 30
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN0_7 INTO #CP22_7 GIVING #RP22_7 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN0_7 #CP22_7 #RP22_7 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
         NONE
          MOVE TRUE TO #EXIT-SUB
        END-DECIDE
       END-REPEAT
     ADD 1 TO #INDEX2
     MOVE 1 TO #OPERATION
   END-REPEAT
   ADD 1 TO #INDEX1
   MOVE 1 TO #INDEX2
 END-REPEAT
 MOVE TRUE TO #RETURN
END-SUBROUTINE
DEFINE SUBROUTINE AR8
 REPEAT WHILE #INDEX1 < 3
   REPEAT WHILE #INDEX2 < 5
     MOVE #VALUEN22_7(#INDEX1) TO #CN22_7
     MOVE #VALUEI1(#INDEX2) TO #CI1
     MOVE FALSE TO #EXIT-SUB
     REPEAT WHILE #EXIT-SUB = FALSE
      DECIDE ON FIRST VALUE OF #OPERATION
       VALUE 1
        MOVE 'ADD #CN22_7 #CI1 GIVING #RI1' TO #DESC
        ADD #CN22_7 #CI1 GIVING #RI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 2
        MOVE 'ADD ROUNDED #CN22_7 #CI1 GIVING #RI1' TO #DESC
        ADD ROUNDED #CN22_7 #CI1 GIVING #RI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 3
        MOVE 'SUBTRACT #CN22_7 #CI1 GIVING #RI1' TO #DESC
        SUBTRACT #CN22_7 FROM #CI1 GIVING #RI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 4
        MOVE 'SUBTRACT ROUNDED #CN22_7 #CI1 GIVING #RI1' TO #DESC
        SUBTRACT ROUNDED #CN22_7 FROM #CI1 GIVING #RI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 5
        MOVE 'MULTIPLY #CN22_7 BY #CI1 GIVING #RI1' TO #DESC
        MULTIPLY #CN22_7 BY #CI1 GIVING #RI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 6
        MOVE 'MULTIPLY ROUNDED #CN22_7 BY #CI1 GIVING #RI1' TO #DESC
        MULTIPLY ROUNDED #CN22_7 BY #CI1 GIVING #RI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 7
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 8
        MOVE 'DIVIDE ROUNDED #CN22_7 INTO #CI1 GIVING #RI1' TO #DESC
        DIVIDE ROUNDED #CN22_7 INTO #CI1 GIVING #RI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 9
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REI1' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 10
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REI2' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 11
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REI4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 12
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 13
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 14
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 15
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 16
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 17
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 18
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 19
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 20
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REI1' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 21
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REI2' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 22
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REI4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 23
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 24
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 25
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 26
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 27
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 28
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 29
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 30
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI1 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI1 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
         NONE
          MOVE TRUE TO #EXIT-SUB
        END-DECIDE
       END-REPEAT
     ADD 1 TO #INDEX2
     MOVE 1 TO #OPERATION
   END-REPEAT
   ADD 1 TO #INDEX1
   MOVE 1 TO #INDEX2
 END-REPEAT
 MOVE TRUE TO #RETURN
END-SUBROUTINE
DEFINE SUBROUTINE AR9
 REPEAT WHILE #INDEX1 < 3
   REPEAT WHILE #INDEX2 < 5
     MOVE #VALUEN22_7(#INDEX1) TO #CN22_7
     MOVE #VALUEI1(#INDEX2) TO #CI1
     MOVE FALSE TO #EXIT-SUB
     REPEAT WHILE #EXIT-SUB = FALSE
      DECIDE ON FIRST VALUE OF #OPERATION
       VALUE 1
        MOVE 'ADD #CN22_7 #CI1 GIVING #RI2' TO #DESC
        ADD #CN22_7 #CI1 GIVING #RI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 2
        MOVE 'ADD ROUNDED #CN22_7 #CI1 GIVING #RI2' TO #DESC
        ADD ROUNDED #CN22_7 #CI1 GIVING #RI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 3
        MOVE 'SUBTRACT #CN22_7 #CI1 GIVING #RI2' TO #DESC
        SUBTRACT #CN22_7 FROM #CI1 GIVING #RI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 4
        MOVE 'SUBTRACT ROUNDED #CN22_7 #CI1 GIVING #RI2' TO #DESC
        SUBTRACT ROUNDED #CN22_7 FROM #CI1 GIVING #RI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 5
        MOVE 'MULTIPLY #CN22_7 BY #CI1 GIVING #RI2' TO #DESC
        MULTIPLY #CN22_7 BY #CI1 GIVING #RI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 6
        MOVE 'MULTIPLY ROUNDED #CN22_7 BY #CI1 GIVING #RI2' TO #DESC
        MULTIPLY ROUNDED #CN22_7 BY #CI1 GIVING #RI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 7
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 8
        MOVE 'DIVIDE ROUNDED #CN22_7 INTO #CI1 GIVING #RI2' TO #DESC
        DIVIDE ROUNDED #CN22_7 INTO #CI1 GIVING #RI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 9
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REI1' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 10
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REI2' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 11
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REI4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 12
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 13
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 14
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 15
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 16
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 17
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 18
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 19
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 20
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REI1' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 21
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REI2' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 22
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REI4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 23
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 24
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 25
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 26
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 27
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 28
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 29
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 30
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI2 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI2 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
         NONE
          MOVE TRUE TO #EXIT-SUB
        END-DECIDE
       END-REPEAT
     ADD 1 TO #INDEX2
     MOVE 1 TO #OPERATION
   END-REPEAT
   ADD 1 TO #INDEX1
   MOVE 1 TO #INDEX2
 END-REPEAT
 MOVE TRUE TO #RETURN
END-SUBROUTINE
DEFINE SUBROUTINE AR10
 REPEAT WHILE #INDEX1 < 3
   REPEAT WHILE #INDEX2 < 5
     MOVE #VALUEN22_7(#INDEX1) TO #CN22_7
     MOVE #VALUEI1(#INDEX2) TO #CI1
     MOVE FALSE TO #EXIT-SUB
     REPEAT WHILE #EXIT-SUB = FALSE
      DECIDE ON FIRST VALUE OF #OPERATION
       VALUE 1
        MOVE 'ADD #CN22_7 #CI1 GIVING #RI4' TO #DESC
        ADD #CN22_7 #CI1 GIVING #RI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 2
        MOVE 'ADD ROUNDED #CN22_7 #CI1 GIVING #RI4' TO #DESC
        ADD ROUNDED #CN22_7 #CI1 GIVING #RI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 3
        MOVE 'SUBTRACT #CN22_7 #CI1 GIVING #RI4' TO #DESC
        SUBTRACT #CN22_7 FROM #CI1 GIVING #RI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 4
        MOVE 'SUBTRACT ROUNDED #CN22_7 #CI1 GIVING #RI4' TO #DESC
        SUBTRACT ROUNDED #CN22_7 FROM #CI1 GIVING #RI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 5
        MOVE 'MULTIPLY #CN22_7 BY #CI1 GIVING #RI4' TO #DESC
        MULTIPLY #CN22_7 BY #CI1 GIVING #RI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 6
        MOVE 'MULTIPLY ROUNDED #CN22_7 BY #CI1 GIVING #RI4' TO #DESC
        MULTIPLY ROUNDED #CN22_7 BY #CI1 GIVING #RI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 7
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 8
        MOVE 'DIVIDE ROUNDED #CN22_7 INTO #CI1 GIVING #RI4' TO #DESC
        DIVIDE ROUNDED #CN22_7 INTO #CI1 GIVING #RI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 9
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REI1' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 10
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REI2' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 11
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REI4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 12
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 13
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 14
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 15
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 16
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 17
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 18
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 19
        SET GLOBALS ZD=OFF
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 20
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REI1' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REI1
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REI1
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 21
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REI2' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REI2
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REI2
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 22
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REI4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REI4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REI4
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 23
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #ERF4' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #ERF4
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #ERF4(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 24
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #ERF8' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #ERF8
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #ERF8(EM=NZZZZZZZZZZ.999999)
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 25
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REN29_0' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REN29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REN29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 26
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REN0_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REN0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REN0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 27
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REN22_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REN22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REN22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 28
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REP29_0' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REP29_0
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REP29_0
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 29
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REP0_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REP0_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REP0_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
       VALUE 30
        SET GLOBALS ZD=ON
        MOVE 'DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REP22_7' TO #DESC
        DIVIDE #CN22_7 INTO #CI1 GIVING #RI4 REMAINDER #REP22_7
        WRITE(1) NOTITLE #CASENUMBER *PROGRAM #DESC #CN22_7 #CI1 #RI4 #REP22_7
        ADD 1 TO #OPERATION
        ADD 1 TO #CASENUMBER
         NONE
          MOVE TRUE TO #EXIT-SUB
        END-DECIDE
       END-REPEAT
     ADD 1 TO #INDEX2
     MOVE 1 TO #OPERATION
   END-REPEAT
   ADD 1 TO #INDEX1
   MOVE 1 TO #INDEX2
 END-REPEAT
 MOVE TRUE TO #RETURN
END-SUBROUTINE

ON ERROR
   WRITE (1) NOTITLE #CASENUMBER *PROGRAM 'ON ERROR ERROR-NR:' *ERROR-NR
   ESCAPE MODULE
END-ERROR
END
