** Example 'ATBREX02': AT BREAK OF  (with user-defined variable and
**                     in conjunction with BEFORE BREAK PROCESSING)
************************************************************************
DEFINE DATA                                        
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL    
1 MYVIEW VIEW OF EMPLOYEES
  2 CITY
  2 COUNTRY
  2 JOB-TITLE
  2 SALARY (1:1)
*
1 #LOCATION (A20)
END-DEFINE
 
INCLUDE Z1069--C
FORMAT (1) PS=0    
*
READ (50) MYVIEW BY CITY WHERE COUNTRY = 'USA'
	BEFORE BREAK PROCESSING
		WRITE (1) NOTITLE 'BEFORE BREAK PROCESSING'
    	COMPRESS CITY 'USA' INTO #LOCATION
	END-BEFORE
	
	DISPLAY (1) NOHDR #LOCATION JOB-TITLE SALARY (1)

	AT BREAK OF #LOCATION
		WRITE (1) NOTITLE #LOCATION OLD(#LOCATION) COUNT(#LOCATION) SUM(SALARY(1)) TOTAL(SALARY(1))
    	SKIP 1
  	END-BREAK
END-READ
END
