** Example 'BEFORX01': BEFORE BREAK PROCESSING
************************************************************************
DEFINE DATA                                        
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL   
1 MYVIEW VIEW OF EMPLOYEES
  2 NAME
  2 FIRST-NAME
  2 SALARY (1:1)
  2 BONUS  (1:1,1:1)
*
1 #INCOME  (P11)
END-DEFINE 
 
INCLUDE Z1069--C
FORMAT (1) PS=0  
*
READ (50) MYVIEW BY NAME FROM 'B' 
	BEFORE BREAK PROCESSING
		WRITE (1) NOTITLE 'BEFORE BREAK PROCESSING'
    	COMPUTE #INCOME = SALARY(1) + BONUS(1,1)
	END-BEFORE
  
  	DISPLAY (1) NOHDR NAME FIRST-NAME (AL=10)
                 #INCOME SALARY(1) (LC==) /
                 BONUS(1,1) (IC=+)
  
  	AT BREAK OF #INCOME
		WRITE (1) NOTITLE T*#INCOME '-'(24)
		WRITE (1) NOTITLE OLD(#INCOME) COUNT(#INCOME)
  	END-BREAK
END-READ
END
