DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL

	1 #A (A/3:5,9:11) DYNAMIC
	1 #B (A1/3:*,9:*)
	1 #C (A/3:*,9:*) DYNAMIC
	1 #D (A1/3:5,9:11)
	1 #I (I4)
	1 #J (I4)
	1 #X (I4)
	
	1 #A1 (I4/3:5,9:11)
	1 #A2 (I4/3:5,9:11)
	1 #B1 (I4/3:5,9:11)
	1 #B2 (I4/3:5,9:11)
	1 #C1 (I4/3:5,9:11)
	1 #C2 (I4/3:5,9:11)
	1 #D1 (I4/3:5,9:11)
	1 #D2 (I4/3:5,9:11)
	
	1 #Y (I4)
	1 #Z (A1/1:26) INIT <'A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z'>
 
END-DEFINE

INCLUDE Z1069--C
FORMAT (1) PS=0

EXPAND ARRAY #B TO (3:7,9:13)
EXPAND ARRAY #C TO (3:7,9:13)

#Y := 1
FOR #I = 3 TO 5
	FOR #J = 9 TO 11
		EXPAND DYNAMIC #A(#I,#J) TO 1
		EXPAND DYNAMIC #C(#I,#J) TO 1
		MOVE #Z(#Y) TO #A(#I,#J)
		MOVE #Z(#Y) TO #B(#I,#J)
		MOVE #Z(#Y) TO #C(#I,#J)
		MOVE #Z(#Y) TO #D(#I,#J)
		#A1(#I,#J) := POS(#A(#I,#J))
		#B1(#I,#J) := POS(#B(#I,#J))
		#C1(#I,#J) := POS(#C(#I,#J))
		#D1(#I,#J) := POS(#D(#I,#J))
		ADD 1 TO #Y
	END-FOR
END-FOR

WRITE (1) '------------------------------------ static array DYNAMIC'
FOR #I = 3 TO 5
	FOR #J = 9 TO 11
		#A2(#I,#J) := POS(#A(#I,#J))
		IF #A1(#I,#J) EQ #A2(#I,#J) THEN
			WRITE (1) NOTITLE #I #J #A(#I,#J) (EM=X) 'equal'
		ELSE
			WRITE (1) NOTITLE #I #J #A(#I,#J) (EM=X) 'not equal'
		END-IF
	END-FOR
END-FOR

WRITE (1) '------------------------------------ x-array PLAIN'
FOR #I = 3 TO 5
	FOR #J = 9 TO 11
		#B2(#I,#J) := POS(#B(#I,#J))
		IF #B1(#I,#J) EQ #B2(#I,#J) THEN
			WRITE (1) NOTITLE #I #J #B(#I,#J) (EM=X) 'equal'
		ELSE
			WRITE (1) NOTITLE #I #J #B(#I,#J) (EM=X) 'not equal'
		END-IF
	END-FOR
END-FOR

WRITE (1) '------------------------------------ x-array DYNAMIC'
FOR #I = 3 TO 5
	FOR #J = 9 TO 11
		#C2(#I,#J) := POS(#C(#I,#J))
		IF #C1(#I,#J) EQ #C2(#I,#J) THEN
			WRITE (1) NOTITLE #I #J #C(#I,#J) (EM=X) 'equal'
		ELSE
			WRITE (1) NOTITLE #I #J #C(#I,#J) (EM=X) 'not equal'
		END-IF
	END-FOR
END-FOR

WRITE (1) '------------------------------------ static array PLAIN'
FOR #I = 3 TO 5
	FOR #J = 9 TO 11
		#D2(#I,#J) := POS(#D(#I,#J))
		IF #D1(#I,#J) EQ #D2(#I,#J) THEN
			WRITE (1) NOTITLE #I #J #D(#I,#J) (EM=X) 'equal'
		ELSE
			WRITE (1) NOTITLE #I #J #D(#I,#J) (EM=X) 'not equal'
		END-IF
	END-FOR
END-FOR

EXPAND DYNAMIC #A(3,9) TO 2000
EXPAND DYNAMIC #A(5,9) TO 2000
REDUCE ARRAY #B TO (3:5,9:11)
REDUCE ARRAY #C TO (3:5,9:11)

WRITE (1) '------------------------------------ static array DYNAMIC changed'
FOR #I = 3 TO 5
	FOR #J = 9 TO 11
		#A2(#I,#J) := POS(#A(#I,#J))
		IF #A1(#I,#J) EQ #A2(#I,#J) THEN
			WRITE (1) NOTITLE #I #J #A(#I,#J) (EM=X) 'equal'
		ELSE
			WRITE (1) NOTITLE #I #J #A(#I,#J) (EM=X) 'not equal'
		END-IF
	END-FOR
END-FOR

WRITE (1) '------------------------------------ x-array PLAIN changed'
FOR #I = 3 TO 5
	FOR #J = 9 TO 11
		#B2(#I,#J) := POS(#B(#I,#J))
		IF #B1(#I,#J) EQ #B2(#I,#J) THEN
			WRITE (1) NOTITLE #I #J 'equal'
		ELSE
			WRITE (1) NOTITLE #I #J 'not equal'
		END-IF
	END-FOR
END-FOR

WRITE (1) '------------------------------------ x-array DYNAMIC changed'
FOR #I = 3 TO 5
	FOR #J = 9 TO 11
		#C2(#I,#J) := POS(#C(#I,#J))
		IF #C1(#I,#J) EQ #C2(#I,#J) THEN
			WRITE (1) NOTITLE #I #J #C(#I,#J) (EM=X) 'equal'
		ELSE
			WRITE (1) NOTITLE #I #J #C(#I,#J) (EM=X) 'not equal'
		END-IF
	END-FOR
END-FOR

WRITE (1) '------------------------------------ static array PLAIN'
FOR #I = 3 TO 5
	FOR #J = 9 TO 11
		#D2(#I,#J) := POS(#D(#I,#J))
		IF #D1(#I,#J) EQ #D2(#I,#J) THEN
			WRITE (1) NOTITLE #I #J #D(#I,#J) (EM=X) 'equal'
		ELSE
			WRITE (1) NOTITLE #I #J #D(#I,#J) (EM=X) 'not equal'
		END-IF
	END-FOR
END-FOR

END
