DEFINE DATA LOCAL                                                       
1 #TEST1 (A2) 
1 #TEST2 (A2)                                                        
1 #TEST3 (A2)                                                        
END-DEFINE                                                              
*                                                                       
DECIDE FOR FIRST CONDITION
	WHEN #TEST1 EQ '01'
		DECIDE FOR FIRST CONDITION
			WHEN #TEST2 EQ '01'
				DECIDE FOR FIRST CONDITION
					WHEN #TEST3 EQ '01'
					  IGNORE
				    WHEN #TEST3 EQ '02'
				      IGNORE
				    WHEN #TEST3 EQ '03'
				      IGNORE
				    WHEN NONE
				      WRITE 'doing something in Test1->Test2->Test3'
				END-DECIDE
		    WHEN #TEST2 EQ '02'
		    	IGNORE
		    WHEN #TEST2 EQ '03'
		    	IGNORE
		    WHEN NONE
		    	WRITE 'doing something in Test1->Test2'
		END-DECIDE
    WHEN #TEST1 EQ '02'
    	DECIDE FOR FIRST CONDITION
			WHEN #TEST2 EQ '01'
				IGNORE
		    WHEN #TEST2 EQ '02'
		    	IGNORE
		    WHEN #TEST2 EQ '03'
		    	DECIDE FOR FIRST CONDITION
					WHEN #TEST3 EQ '01'
					  IGNORE
				    WHEN #TEST3 EQ '02'
				      IGNORE
				    WHEN #TEST3 EQ '03'
				      IGNORE
				    WHEN NONE
				      IGNORE
				END-DECIDE
		    WHEN NONE
		    	WRITE 'doing something in Test1->Test2'
		END-DECIDE
    WHEN #TEST1 EQ '03'
    	DECIDE FOR FIRST CONDITION
			WHEN #TEST2 EQ '01'
				IGNORE
		    WHEN #TEST2 EQ '02'
		    	IGNORE
		    WHEN #TEST2 EQ '03'
		    	DECIDE FOR FIRST CONDITION
					WHEN #TEST3 EQ '01'
					  IGNORE
				    WHEN #TEST3 EQ '02'
				      IGNORE
				    WHEN #TEST3 EQ '03'
				      IGNORE
				    WHEN NONE
				      WRITE 'doing something in Test1->Test2->Test3'
				END-DECIDE
		    WHEN NONE
		    	IGNORE
		END-DECIDE
    WHEN NONE
    	IGNORE
END-DECIDE
*                                                                
END                    
