DEFINE DATA
LOCAL                                                       
1 PERS VIEW OF EMPLOYEES                                               
  2 PERSONNEL-ID                                                       
  2 NAME                                                               
  2 CITY       
END-DEFINE   
 
*                                              
FIND PERS WITH CITY = 'NEW YORK'            
  DOWNLOAD PC 1 CITY   
  WRITE PC 2 CITY   
  WRITE WORK 3 CITY   
  DOWNLOAD PC FILE 4 CITY   
  DOWNLOAD PC 5 VARIABLE CITY   
  DOWNLOAD PC 6 COMMAND CITY
END-FIND
*
/* not working
* FIND PERS WITH CITY = 'NEW YORK'            
*   DOWNLOAD WORK 1 CITY
* END-FIND      
*                                                                       

END
