* max transaction data is 2000. this uses exactly 2000 bytes
DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 EMPLOY-VIEW VIEW OF EMPLOYEES                                         
  2 PERSONNEL-ID                                                        
  2 NAME                                                                
  2 FIRST-NAME                                                          
  2 CITY                                                                
1 #DATA1 (B2000)
1 REDEFINE #DATA1
  2 #DATA1A (B1/1:2000)
1 #I (I4)
END-DEFINE                                                              

INCLUDE Z1069--C
FORMAT (1) PS=0

#I := 1
MOVE 255 TO #DATA1A(#I)
#I := 1000
MOVE 255 TO #DATA1A(#I)
#I := 2000
MOVE 255 TO #DATA1A(#I)

* we do not change any other database records
END TRANSACTION #DATA1

RESET #DATA1

GET TRANSACTION DATA #DATA1

#I := 1
WRITE (1) NOTITLE #DATA1A(#I)
#I := 1000
WRITE (1) NOTITLE #DATA1A(#I)
#I := 2000
WRITE (1) NOTITLE #DATA1A(#I)

END
