DEFINE DATA
LOCAL
 01 #OP1_1 (A90) INIT <'abcd efgh abcd efgh xxxx abcd efgh'>
 01 #OP1_2 (A90) INIT <'   abcd efgh abcd efgh xxxx abcd efgh     '>
 01 #OP1_3 (B90) INIT <H'61626364206566676820616263642065666768207878787820616263642065666768'>
 01 #OP1_4 (B90) INIT <H'002020206162636420656667682061626364206566676820787878782061626364206566676820202020200000'>
 01 #OP1_5 (U90)
1 REDEFINE #OP1_5
    2 #OP1_5B (B180)
 01 #OP1_6 (U90)
1 REDEFINE #OP1_6
    2 #OP1_6B (B180)
 01 #OP4_1 (A6) INIT <' efgh '>
 01 #OP4_2 (B6) INIT <H'206566676820'>
 01 #OP4_3 (B9) INIT <H'002065666768200000'>
 01 #OP4_4 (U6)
1 REDEFINE #OP4_4
    2 #OP4_4B (B12)
 01 #OP4_5 (U9)
1 REDEFINE #OP4_5
    2 #OP4_5B (B18)
 01 #POSITION (I2)
 01 #LENGTH (I2)
 01 #NUMBER (I2)
 01 #DELIMITERS (A) DYNAMIC
 01 #DIRECTION (A1)
 01 #RESET (A) DYNAMIC
 01 #OP6_1 (A3) INIT <'REP'>
 01 #OP6_2 (A5) INIT <'_X_'>
 01 #OP6_3 (B3) INIT <H'524550'>
 01 #OP6_4 (B6) INIT <H'005245500000'>
 01 #OP6_5 (U3)
1 REDEFINE #OP6_5
    2 #OP6_5B (B6)
 01 #OP6_6 (U6)
1 REDEFINE #OP6_6
    2 #OP6_6B (B12)
END-DEFINE
FORMAT (1) LS=240 PS=0
WRITE (1) NOTITLE NOHDR *PROGRAM ' - Examine test'
WRITE (1) NOTITLE NOHDR 'Tested options: POSITION, REPLACE, DELIMITER, FULL_OP1, SUBSTRING, DELETE, DIRECTION, FULL_OP4, PATTERN'
MOVE EDITED
  '6100620063006400200065006600670068002000610062006300640020006500660067006800200078007800780078002000610062006300640020006500660067006800'
  TO #OP1_5B (EM=H(68))
MOVE EDITED
  '000020002000200061006200630064002000650066006700680020006100620063006400200065006600670068002000780078007800780020006100620063006400200065006600670068002000200020002000200000000000'
  TO #OP1_6B (EM=H(90))
MOVE EDITED
  '200065006600670068002000'
  TO #OP4_4B (EM=H(12))
MOVE EDITED
  '000020006500660067006800200000000000'
  TO #OP4_5B (EM=H(18))
MOVE EDITED
  '520045005000'
  TO #OP6_5B (EM=H(6))
MOVE EDITED
  '000052004500500000000000'
  TO #OP6_6B (EM=H(12))
WRITE (1) NOTITLE NOHDR '=' #OP1_6 '=' #OP4_4
PERFORM EXAMINE-11901
DEFINE SUBROUTINE EXAMINE-11901
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11902
DEFINE SUBROUTINE EXAMINE-11902
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11903
DEFINE SUBROUTINE EXAMINE-11903
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11904
DEFINE SUBROUTINE EXAMINE-11904
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11905
DEFINE SUBROUTINE EXAMINE-11905
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11906
DEFINE SUBROUTINE EXAMINE-11906
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11907
DEFINE SUBROUTINE EXAMINE-11907
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11908
DEFINE SUBROUTINE EXAMINE-11908
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11909
DEFINE SUBROUTINE EXAMINE-11909
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11910
DEFINE SUBROUTINE EXAMINE-11910
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11911
DEFINE SUBROUTINE EXAMINE-11911
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11912
DEFINE SUBROUTINE EXAMINE-11912
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11913
DEFINE SUBROUTINE EXAMINE-11913
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11914
DEFINE SUBROUTINE EXAMINE-11914
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11915
DEFINE SUBROUTINE EXAMINE-11915
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11916
DEFINE SUBROUTINE EXAMINE-11916
  #DELIMITERS := ' '
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11917
DEFINE SUBROUTINE EXAMINE-11917
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11918
DEFINE SUBROUTINE EXAMINE-11918
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11919
DEFINE SUBROUTINE EXAMINE-11919
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11920
DEFINE SUBROUTINE EXAMINE-11920
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11921
DEFINE SUBROUTINE EXAMINE-11921
  #DELIMITERS := '.'
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11922
DEFINE SUBROUTINE EXAMINE-11922
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11923
DEFINE SUBROUTINE EXAMINE-11923
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11924
DEFINE SUBROUTINE EXAMINE-11924
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11925
DEFINE SUBROUTINE EXAMINE-11925
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11926
DEFINE SUBROUTINE EXAMINE-11926
  #DELIMITERS := 'e'
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11927
DEFINE SUBROUTINE EXAMINE-11927
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11928
DEFINE SUBROUTINE EXAMINE-11928
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11929
DEFINE SUBROUTINE EXAMINE-11929
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11930
DEFINE SUBROUTINE EXAMINE-11930
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11931
DEFINE SUBROUTINE EXAMINE-11931
  #DELIMITERS := '. '
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11932
DEFINE SUBROUTINE EXAMINE-11932
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11933
DEFINE SUBROUTINE EXAMINE-11933
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11934
DEFINE SUBROUTINE EXAMINE-11934
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11935
DEFINE SUBROUTINE EXAMINE-11935
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR   'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11936
DEFINE SUBROUTINE EXAMINE-11936
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11937
DEFINE SUBROUTINE EXAMINE-11937
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11938
DEFINE SUBROUTINE EXAMINE-11938
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11939
DEFINE SUBROUTINE EXAMINE-11939
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11940
DEFINE SUBROUTINE EXAMINE-11940
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11941
DEFINE SUBROUTINE EXAMINE-11941
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11942
DEFINE SUBROUTINE EXAMINE-11942
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11943
DEFINE SUBROUTINE EXAMINE-11943
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11944
DEFINE SUBROUTINE EXAMINE-11944
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11945
DEFINE SUBROUTINE EXAMINE-11945
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11946
DEFINE SUBROUTINE EXAMINE-11946
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11947
DEFINE SUBROUTINE EXAMINE-11947
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11948
DEFINE SUBROUTINE EXAMINE-11948
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11949
DEFINE SUBROUTINE EXAMINE-11949
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11950
DEFINE SUBROUTINE EXAMINE-11950
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11951
DEFINE SUBROUTINE EXAMINE-11951
  #DELIMITERS := ' '
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11952
DEFINE SUBROUTINE EXAMINE-11952
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11953
DEFINE SUBROUTINE EXAMINE-11953
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11954
DEFINE SUBROUTINE EXAMINE-11954
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11955
DEFINE SUBROUTINE EXAMINE-11955
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11956
DEFINE SUBROUTINE EXAMINE-11956
  #DELIMITERS := '.'
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11957
DEFINE SUBROUTINE EXAMINE-11957
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11958
DEFINE SUBROUTINE EXAMINE-11958
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11959
DEFINE SUBROUTINE EXAMINE-11959
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11960
DEFINE SUBROUTINE EXAMINE-11960
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11961
DEFINE SUBROUTINE EXAMINE-11961
  #DELIMITERS := 'e'
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11962
DEFINE SUBROUTINE EXAMINE-11962
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11963
DEFINE SUBROUTINE EXAMINE-11963
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11964
DEFINE SUBROUTINE EXAMINE-11964
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11965
DEFINE SUBROUTINE EXAMINE-11965
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11966
DEFINE SUBROUTINE EXAMINE-11966
  #DELIMITERS := '. '
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11967
DEFINE SUBROUTINE EXAMINE-11967
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11968
DEFINE SUBROUTINE EXAMINE-11968
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11969
DEFINE SUBROUTINE EXAMINE-11969
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11970
DEFINE SUBROUTINE EXAMINE-11970
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION FORWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION FORWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11971
DEFINE SUBROUTINE EXAMINE-11971
  #DIRECTION := 'F'
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11972
DEFINE SUBROUTINE EXAMINE-11972
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11973
DEFINE SUBROUTINE EXAMINE-11973
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11974
DEFINE SUBROUTINE EXAMINE-11974
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11975
DEFINE SUBROUTINE EXAMINE-11975
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11976
DEFINE SUBROUTINE EXAMINE-11976
  #DIRECTION := 'F'
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11977
DEFINE SUBROUTINE EXAMINE-11977
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11978
DEFINE SUBROUTINE EXAMINE-11978
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11979
DEFINE SUBROUTINE EXAMINE-11979
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11980
DEFINE SUBROUTINE EXAMINE-11980
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11981
DEFINE SUBROUTINE EXAMINE-11981
  #DIRECTION := 'F'
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11982
DEFINE SUBROUTINE EXAMINE-11982
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11983
DEFINE SUBROUTINE EXAMINE-11983
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11984
DEFINE SUBROUTINE EXAMINE-11984
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11985
DEFINE SUBROUTINE EXAMINE-11985
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11986
DEFINE SUBROUTINE EXAMINE-11986
  #DIRECTION := 'F'
  #DELIMITERS := ' '
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11987
DEFINE SUBROUTINE EXAMINE-11987
  #DIRECTION := 'F'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11988
DEFINE SUBROUTINE EXAMINE-11988
  #DIRECTION := 'F'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11989
DEFINE SUBROUTINE EXAMINE-11989
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11990
DEFINE SUBROUTINE EXAMINE-11990
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11991
DEFINE SUBROUTINE EXAMINE-11991
  #DIRECTION := 'F'
  #DELIMITERS := '.'
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11992
DEFINE SUBROUTINE EXAMINE-11992
  #DIRECTION := 'F'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11993
DEFINE SUBROUTINE EXAMINE-11993
  #DIRECTION := 'F'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11994
DEFINE SUBROUTINE EXAMINE-11994
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11995
DEFINE SUBROUTINE EXAMINE-11995
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11996
DEFINE SUBROUTINE EXAMINE-11996
  #DIRECTION := 'F'
  #DELIMITERS := 'e'
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-11997
DEFINE SUBROUTINE EXAMINE-11997
  #DIRECTION := 'F'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11998
DEFINE SUBROUTINE EXAMINE-11998
  #DIRECTION := 'F'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-11999
DEFINE SUBROUTINE EXAMINE-11999
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12000
DEFINE SUBROUTINE EXAMINE-12000
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12001
DEFINE SUBROUTINE EXAMINE-12001
  #DIRECTION := 'F'
  #DELIMITERS := '. '
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12002
DEFINE SUBROUTINE EXAMINE-12002
  #DIRECTION := 'F'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12003
DEFINE SUBROUTINE EXAMINE-12003
  #DIRECTION := 'F'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12004
DEFINE SUBROUTINE EXAMINE-12004
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12005
DEFINE SUBROUTINE EXAMINE-12005
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'F'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'F'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 4 THRU 18 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12006
DEFINE SUBROUTINE EXAMINE-12006
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12007
DEFINE SUBROUTINE EXAMINE-12007
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12008
DEFINE SUBROUTINE EXAMINE-12008
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12009
DEFINE SUBROUTINE EXAMINE-12009
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12010
DEFINE SUBROUTINE EXAMINE-12010
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12011
DEFINE SUBROUTINE EXAMINE-12011
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12012
DEFINE SUBROUTINE EXAMINE-12012
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12013
DEFINE SUBROUTINE EXAMINE-12013
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12014
DEFINE SUBROUTINE EXAMINE-12014
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12015
DEFINE SUBROUTINE EXAMINE-12015
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12016
DEFINE SUBROUTINE EXAMINE-12016
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12017
DEFINE SUBROUTINE EXAMINE-12017
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12018
DEFINE SUBROUTINE EXAMINE-12018
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12019
DEFINE SUBROUTINE EXAMINE-12019
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12020
DEFINE SUBROUTINE EXAMINE-12020
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12021
DEFINE SUBROUTINE EXAMINE-12021
  #DELIMITERS := ' '
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12022
DEFINE SUBROUTINE EXAMINE-12022
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12023
DEFINE SUBROUTINE EXAMINE-12023
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12024
DEFINE SUBROUTINE EXAMINE-12024
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12025
DEFINE SUBROUTINE EXAMINE-12025
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12026
DEFINE SUBROUTINE EXAMINE-12026
  #DELIMITERS := '.'
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12027
DEFINE SUBROUTINE EXAMINE-12027
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12028
DEFINE SUBROUTINE EXAMINE-12028
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12029
DEFINE SUBROUTINE EXAMINE-12029
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12030
DEFINE SUBROUTINE EXAMINE-12030
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12031
DEFINE SUBROUTINE EXAMINE-12031
  #DELIMITERS := 'e'
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12032
DEFINE SUBROUTINE EXAMINE-12032
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12033
DEFINE SUBROUTINE EXAMINE-12033
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12034
DEFINE SUBROUTINE EXAMINE-12034
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12035
DEFINE SUBROUTINE EXAMINE-12035
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12036
DEFINE SUBROUTINE EXAMINE-12036
  #DELIMITERS := '. '
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12037
DEFINE SUBROUTINE EXAMINE-12037
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12038
DEFINE SUBROUTINE EXAMINE-12038
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12039
DEFINE SUBROUTINE EXAMINE-12039
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12040
DEFINE SUBROUTINE EXAMINE-12040
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION BACKWARD FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION BACKWARD'  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12041
DEFINE SUBROUTINE EXAMINE-12041
  #DIRECTION := 'B'
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12042
DEFINE SUBROUTINE EXAMINE-12042
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12043
DEFINE SUBROUTINE EXAMINE-12043
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12044
DEFINE SUBROUTINE EXAMINE-12044
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12045
DEFINE SUBROUTINE EXAMINE-12045
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE FIRST #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE FIRST #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4  REPLACE FIRST '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12046
DEFINE SUBROUTINE EXAMINE-12046
  #DIRECTION := 'B'
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12047
DEFINE SUBROUTINE EXAMINE-12047
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12048
DEFINE SUBROUTINE EXAMINE-12048
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12049
DEFINE SUBROUTINE EXAMINE-12049
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE #OP6_5 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE #OP6_6 GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE '_REP_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12050
DEFINE SUBROUTINE EXAMINE-12050
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 ABSOLUTE  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) ABSOLUTE' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12051
DEFINE SUBROUTINE EXAMINE-12051
  #DIRECTION := 'B'
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12052
DEFINE SUBROUTINE EXAMINE-12052
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  DELETE GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12053
DEFINE SUBROUTINE EXAMINE-12053
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  DELETE FIRST GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12054
DEFINE SUBROUTINE EXAMINE-12054
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE '_' GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12055
DEFINE SUBROUTINE EXAMINE-12055
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  '(WITH DELIMITERS) WITH DELIMITERS' '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12056
DEFINE SUBROUTINE EXAMINE-12056
  #DIRECTION := 'B'
  #DELIMITERS := ' '
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12057
DEFINE SUBROUTINE EXAMINE-12057
  #DIRECTION := 'B'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12058
DEFINE SUBROUTINE EXAMINE-12058
  #DIRECTION := 'B'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12059
DEFINE SUBROUTINE EXAMINE-12059
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12060
DEFINE SUBROUTINE EXAMINE-12060
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := ' '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12061
DEFINE SUBROUTINE EXAMINE-12061
  #DIRECTION := 'B'
  #DELIMITERS := '.'
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12062
DEFINE SUBROUTINE EXAMINE-12062
  #DIRECTION := 'B'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12063
DEFINE SUBROUTINE EXAMINE-12063
  #DIRECTION := 'B'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12064
DEFINE SUBROUTINE EXAMINE-12064
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12065
DEFINE SUBROUTINE EXAMINE-12065
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := '.'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12066
DEFINE SUBROUTINE EXAMINE-12066
  #DIRECTION := 'B'
  #DELIMITERS := 'e'
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12067
DEFINE SUBROUTINE EXAMINE-12067
  #DIRECTION := 'B'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12068
DEFINE SUBROUTINE EXAMINE-12068
  #DIRECTION := 'B'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12069
DEFINE SUBROUTINE EXAMINE-12069
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12070
DEFINE SUBROUTINE EXAMINE-12070
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := 'e'
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12071
DEFINE SUBROUTINE EXAMINE-12071
  #DIRECTION := 'B'
  #DELIMITERS := '. '
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
END-SUBROUTINE
PERFORM EXAMINE-12072
DEFINE SUBROUTINE EXAMINE-12072
  #DIRECTION := 'B'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12073
DEFINE SUBROUTINE EXAMINE-12073
  #DIRECTION := 'B'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  DELETE FIRST
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after DELETE_FIRST' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12074
DEFINE SUBROUTINE EXAMINE-12074
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
PERFORM EXAMINE-12075
DEFINE SUBROUTINE EXAMINE-12075
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_1"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_2"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_3"
  WRITE (1) NOTITLE NOHDR "REPLACE_FIRST is not allowed for #OP1_6, #OP4_4, #OP6_4"
  #DIRECTION := 'B'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_5
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_5 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST #OP6_6
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' #OP6_6 '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_' '=' #OP1_6
  #OP1_6 := #RESET
  #DIRECTION := 'B'
  #DELIMITERS := '. '
  #RESET := #OP1_6
  EXAMINE DIRECTION #DIRECTION FULL SUBSTRING(#OP1_6, 5, 28) FROM 18 THRU 4 FOR FULL PATTERN #OP4_4 WITH DELIMITERS #DELIMITERS  REPLACE FIRST '_REP_'
     GIVING NUMBER #NUMBER GIVING POSITION #POSITION GIVING LENGTH #LENGTH
  WRITE (1) NOTITLE NOHDR  'DIRECTION' '=' #DIRECTION  'WITH DELIMITERS' '=' #DELIMITERS (EM=2X) '=' #NUMBER '=' #POSITION '=' #LENGTH
  WRITE (1) NOTITLE NOHDR 'after REPLACE_FIRST with' '=' '_REP_' '=' #OP1_6
  #OP1_6 := #RESET
END-SUBROUTINE
WRITE (1) NOTITLE NOHDR ' '
ON ERROR
    WRITE (1) NOTITLE NOHDR 'Exception ' *ERROR-NR
    ESCAPE ROUTINE
END-ERROR
END
