DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 ESDS-VIEW VIEW OF VSAM-ESDS
  2 FIELD-A
  2 FIELD-B
  2 FIELD-C (5)
  2 FIELD-E (2)
END-DEFINE
*
INCLUDE Z1069--C
FORMAT (1) PS=0
*
MOVE 'VAL-A'          TO FIELD-A
MOVE 1111111111       TO FIELD-B
MOVE '12-A'           TO FIELD-C(1)
MOVE '34-A'           TO FIELD-C(3)
MOVE 'VAL1-A'         TO FIELD-E(1)
MOVE 'VAL3-A'         TO FIELD-E(2)
STORE ESDS-VIEW
RESET ESDS-VIEW
*
MOVE 'VAL-B'          TO FIELD-A
MOVE 1111111111       TO FIELD-B
MOVE '12-B'           TO FIELD-C(1)
MOVE '34-B'           TO FIELD-C(3)
MOVE 'VAL1-B'         TO FIELD-E(1)
MOVE 'VAL3-B'         TO FIELD-E(2)
STORE ESDS-VIEW
RESET ESDS-VIEW
*
MOVE 'VAL-C'          TO FIELD-A
MOVE 1111111111       TO FIELD-B
MOVE '12-C'           TO FIELD-C(1)
MOVE '34-C'           TO FIELD-C(3)
MOVE 'VAL1-C'         TO FIELD-E(1)
MOVE 'VAL3-C'         TO FIELD-E(2)
STORE ESDS-VIEW
RESET ESDS-VIEW
*
MOVE 'VAL-D'          TO FIELD-A
MOVE 1111111111       TO FIELD-B
MOVE '12-D'           TO FIELD-C(1)
MOVE '34-D'           TO FIELD-C(3)
MOVE 'VAL1-D'         TO FIELD-E(1)
MOVE 'VAL3-D'         TO FIELD-E(2)
STORE ESDS-VIEW
RESET ESDS-VIEW

END TRANSACTION

GET ESDS-VIEW 0
WRITE (1) NOTITLE NOHDR FIELD-A
WRITE (1) NOTITLE NOHDR FIELD-B
WRITE (1) NOTITLE NOHDR FIELD-C(*)
WRITE (1) NOTITLE NOHDR FIELD-E(*)

GET ESDS-VIEW 180
WRITE (1) NOTITLE NOHDR FIELD-A
WRITE (1) NOTITLE NOHDR FIELD-B
WRITE (1) NOTITLE NOHDR FIELD-C(*)
WRITE (1) NOTITLE NOHDR FIELD-E(*)

GET ESDS-VIEW 90
WRITE (1) NOTITLE NOHDR FIELD-A
WRITE (1) NOTITLE NOHDR FIELD-B
WRITE (1) NOTITLE NOHDR FIELD-C(*)
WRITE (1) NOTITLE NOHDR FIELD-E(*)

GET ESDS-VIEW 270
WRITE (1) NOTITLE NOHDR FIELD-A
WRITE (1) NOTITLE NOHDR FIELD-B
WRITE (1) NOTITLE NOHDR FIELD-C(*)
WRITE (1) NOTITLE NOHDR FIELD-E(*)

END
