DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 #CNT (I4)
1 #I (I4)
1 #J (I4)
1 #X (I4)

1 VIEW-WRITE VIEW OF DDM2845A
  2 AA-1

  2 AB-1    (1:3)
  2 AC-1    (1:3)

  2 BA-1
    3 BB-1  (1:3)
    3 BC-1  (2:4)
    3 BD-1  (1:3)
    3 BE-1  (2:4)
    3 BF-1  (1:3,2:4)
    3 BG-1  (1:3,2:4)

  2 CA-1
    3 CB-1  (1:3)
    3 CC-1  (2:4)
    3 CD-1  (1:3)
    3 CE-1  (2:4)
    3 CF-1  (1:3,2:4)
    3 CG-1  (1:3,2:4)

1 VIEW-READ VIEW OF DDM2845A
  2 AA-1

  2 AB-1    (1:3)
  2 AC-1    (1:3)

  2 BA-1
    3 BB-1  (1:3)
    3 BC-1  (2:4)
    3 BD-1  (1:3)
    3 BE-1  (2:4)
    3 BF-1  (1:3,2:4)
    3 BG-1  (1:3,2:4)

  2 CA-1
    3 CB-1  (1:3)
    3 CC-1  (2:4)
    3 CD-1  (1:3)
    3 CE-1  (2:4)
    3 CF-1  (1:3,2:4)
    3 CG-1  (1:3,2:4)

1 VIEW-SU VIEW OF DDM2845A
  2 SU-1
END-DEFINE

INCLUDE Z1069--C
FORMAT (1) PS=0

PERFORM DELETE_DATA
PERFORM STORE_DATA
PERFORM WRITE_DATA
PERFORM DELETE_DATA

DEFINE SUBROUTINE WRITE_DATA
 WRITE (1) NOTITLE NOHDR / '--- histogram su-1 ---'
 HISTOGRAM VIEW-SU SU-1
  WRITE (1) NOTITLE NOHDR '='*ISN '='SU-1
 END-HISTOGRAM
  WRITE (1) NOTITLE NOHDR '--- read su-1 in view ---'
  WRITE (1) NOTITLE NOHDR 'NAT3041: error in format buffer'
*   READ VIEW-su BY su-1
*     WRITE (1) NOTITLE NOHDR '='su-1
*   END-READ
  WRITE (1) NOTITLE NOHDR '--- read su-1 not in view ---'
  READ VIEW-READ BY SU-1
    WRITE (1) NOTITLE NOHDR '='SU-1
  END-READ
  WRITE (1) NOTITLE NOHDR '--- read by iSV su-1 in view ---'
  WRITE (1) NOTITLE NOHDR 'NAT3041: error in format buffer'
*   READ VIEW-su BY ISV
*     WRITE (1) NOTITLE NOHDR '='su-1
*   END-READ
  WRITE (1) NOTITLE NOHDR '--- read by iSV su-1 not in view ---'
  READ VIEW-READ BY ISN
    WRITE (1) NOTITLE NOHDR '='SU-1
  END-READ
  WRITE (1) NOTITLE NOHDR '--- find su-1 in view ---'
  WRITE (1) NOTITLE NOHDR 'NAT3041: error in format buffer'
*   FIND VIEW-su WITH su-1 NE ' '
*     WRITE (1) NOTITLE NOHDR '='su-1
*   END-FIND
  WRITE (1) NOTITLE NOHDR '--- find su-1 not in view ---'
  FIND VIEW-READ WITH SU-1 NE ' '
    WRITE (1) NOTITLE NOHDR '='SU-1
  END-FIND
  WRITE (1) NOTITLE NOHDR '--- find sorted su-1 in view ---'
  WRITE (1) NOTITLE NOHDR 'NAT3028: incorrect descriptor'
*   FIND VIEW-su WITH su-1 NE ' ' SORTED BY su-1
*     WRITE (1) NOTITLE NOHDR '='su-1
*   END-FIND
  WRITE (1) NOTITLE NOHDR '--- find sorted su-1 not in view ---'
  WRITE (1) NOTITLE NOHDR 'NAT3028: incorrect descriptor'
*   FIND VIEW-READ WITH su-1 NE ' ' SORTED BY su-1
*     WRITE (1) NOTITLE NOHDR '='su-1
*   END-FIND
END-SUBROUTINE

DEFINE SUBROUTINE STORE_DATA
 FOR #X 1 3
  COMPRESS #X 'aa' INTO VIEW-WRITE.AA-1 LEAVING NO
  FOR #I 1 3
   COMPUTE #J = #I + 1
   COMPRESS #X 'ab' #I INTO VIEW-WRITE.AB-1(#I) LEAVING NO
   COMPRESS #X 'ac' #I INTO VIEW-WRITE.AC-1(#I) LEAVING NO

   COMPRESS #X 'bb' #I INTO VIEW-WRITE.BB-1(#I) LEAVING NO
   COMPRESS #X 'bc' #J INTO VIEW-WRITE.BC-1(#J) LEAVING NO
   COMPRESS #X 'bd' #I INTO VIEW-WRITE.BD-1(#I) LEAVING NO
   COMPRESS #X 'be' #J INTO VIEW-WRITE.BE-1(#J) LEAVING NO

   COMPRESS #X 'cb' #I INTO VIEW-WRITE.CB-1(#I) LEAVING NO
   COMPRESS #X 'cc' #J INTO VIEW-WRITE.CC-1(#J) LEAVING NO
   COMPRESS #X 'cd' #I INTO VIEW-WRITE.CD-1(#I) LEAVING NO
   COMPRESS #X 'ce' #J INTO VIEW-WRITE.CE-1(#J) LEAVING NO
   FOR #J 2 4
    COMPRESS #X 'bf' #I #J INTO VIEW-WRITE.BF-1(#I,#J) LEAVING NO
    COMPRESS #X 'bg' #I #J INTO VIEW-WRITE.BG-1(#I,#J) LEAVING NO
    COMPRESS #X 'cf' #I #J INTO VIEW-WRITE.CF-1(#I,#J) LEAVING NO
    COMPRESS #X 'cg' #I #J INTO VIEW-WRITE.CG-1(#I,#J) LEAVING NO
   END-FOR
  END-FOR
  STORE VIEW-WRITE
 END-FOR
 END TRANSACTION
END-SUBROUTINE

DEFINE SUBROUTINE DELETE_DATA
 READ VIEW-WRITE BY ISN
  DELETE
 END-READ
 END TRANSACTION
END-SUBROUTINE

END
