DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 EMPLOYEE VIEW OF EMPLOYNDT
  2 DEPT-PERSON
  2 LEAVE-LEFT
END-DEFINE
 
INCLUDE Z1069--C
FORMAT (1) PS=0 LS=80 DF=S
 
** TESTS COMBINATION OF SUPERDESCRIPTORS IN VIEW
** AND EXTRA-SUPERDESCRIPTOR VIA SORTED BY
** AND MULTIPLE DESCRIPTOR IN CRITERION
** WITH FIND
 
FIND (20) EMPLOYEE WITH LANG EQ 'ENG' SORTED BY DEPARTMENT
  WRITE (1) NOTITLE *ISN EMPLOYEE
END-FIND
 
END
