DEFINE DATA
LOCAL
1 X (I4)
1 Y (I4)
1 Z (I4)
1 FILEPATH (A100)
1 DATA (B6000)
1 REDEFINE DATA
  2 GROUP1(1:2, 1:7, 1:9)
    3 XXX (A2)
    3 GROUP11
      4 X1 (N3)
      4 REDEFINE X1
        5 X2 (A3)
    3 REDEFINE GROUP11
      4 GROUP12
        5 Z1 (N1.2)
        5 REDEFINE Z1
          6 Z2 (B3)
  2 REDEFINE GROUP1
    3 GROUP2 (2:2)
      4 Y1 (N1/1:6)
      4 N1 (N2/1:7, 1:2)
      4 REDEFINE N1
        5 A1 (A1/1:14, 1:2)
      4 Y2 (N1/1:6)
  2 I (I4)
END-DEFINE

* writes field DATA unformatted to workfile C:\temp\<program>-OUT.TXT
COMPRESS 'C:\TEMP\' *PROGRAM '-OUT.TXT' INTO FILEPATH LEAVING NO SPACE
DEFINE WORK FILE 1 FILEPATH TYPE 'UNFORMATTED'

FOR X = 1 TO 2
  FOR Y = 1 TO 7
    FOR Z = 1 TO 9
      MOVE 'abc' TO XXX(X,Y,Z)
    END-FOR
  END-FOR
END-FOR

WRITE WORK FILE 1 DATA

FOR X = 1 TO 2
  FOR Y = 1 TO 7
    FOR Z = 1 TO 9
      MOVE 314 TO X1(X,Y,Z)
    END-FOR
  END-FOR
END-FOR

WRITE WORK FILE 1 DATA

FOR X = 1 TO 2
  FOR Y = 1 TO 7
    FOR Z = 1 TO 9
      MOVE 'fgh' TO X2(X,Y,Z)
    END-FOR
  END-FOR
END-FOR

WRITE WORK FILE 1 DATA

FOR X = 1 TO 2
  FOR Y = 1 TO 7
    FOR Z = 1 TO 9
      MOVE 9.81 TO Z1(X,Y,Z)
    END-FOR
  END-FOR
END-FOR

WRITE WORK FILE 1 DATA

FOR X = 1 TO 2
  FOR Y = 1 TO 7
    FOR Z = 1 TO 9
      MOVE EDITED '212223' (EM=H) TO Z2(X,Y,Z)
    END-FOR
  END-FOR
END-FOR

WRITE WORK FILE 1 DATA

FOR X = 2 TO 2
  FOR Y = 1 TO 6
	MOVE 2 TO Y1(X,Y)
	MOVE 7 TO Y2(X,Y)
  END-FOR
END-FOR

WRITE WORK FILE 1 DATA

FOR X = 2 TO 2
  FOR Y = 1 TO 7
    FOR Z = 1 TO 2
      MOVE 41 TO N1(X,Y,Z)
    END-FOR
  END-FOR
END-FOR

WRITE WORK FILE 1 DATA

FOR X = 2 TO 2
  FOR Y = 1 TO 14
    FOR Z = 1 TO 2
      MOVE '+' TO A1(X,Y,Z)
    END-FOR
  END-FOR
END-FOR

WRITE WORK FILE 1 DATA

CLOSE WORK FILE 1

END
