DEFINE DATA LOCAL
1 #OUTPUT                           
  2 #ALPHA (A10) INIT <'ABCDEFGHIJ'>
  2 #NUM (N3,2)                     
  2 #NUM_NEGATIVE (N3,2)            
  2 #PACKED (P3,2)                  
  2 #PACKED_NEGATIVE (P3,2)         
  2 #BINARY (B2)                    
  2 #INTEGER (I2)                   
  2 #LOGICAL (L)                    
  2 #EOR (A1)                       
  2 #ARR (A1/1:10)                  
END-DEFINE   
*
DEFINE WORK FILE 1 'test/res/workfile/wmee.1107.wrk01.txt' TYPE 'TRANSFER'
/* READ WORK FILE 1 #OUTPUT
UPLOAD PC 1 #OUTPUT
  WRITE NOTITLE #OUTPUT 
END-WORK
*
END
