DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
  1 EMP VIEW OF EMPLOYEES
     2 NAME
     2 CITY
END-DEFINE
INCLUDE Z1069--C
FORMAT (1) PS=0

FIND EMP WITH 'SET1'
  WRITE (1) *ISN EMP
END-FIND

ON ERROR
  WRITE (1) NOTITLE 'Errornr: ' *ERROR-NR
  ESCAPE MODULE
END-ERROR

END
