DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 DDM3263A-V VIEW DDM3263A
  2 AAA
  2 AD_MU(1:2)
  2 AE_D
END-DEFINE

INCLUDE Z1069--C
FORMAT (1) PS=180 LS=180

WRITE (1) NOTITLE NOHDR *PROGRAM 'start'
PERFORM CLEANUP

* FDT:
*   1, AA, 2, A, NU ; 
*   1, AB, 2, A, NU ; 
*   1, AC, 2, A, NU ; 
*   1, AD, 11, A, MU, NU ; 
*   1, AE, 4, B, DE, NU ; 
*   BO,UQ=AD(1,4), AE(1,4), AA(1,2)
*
* Test:
*   ISN | AD (INDEX)    | AE       | AA |
*   -------------------------------------
*   180 | 0261EA EK (1) | 000000AE | WO |
*   180 | 0261ST ZP (2) | 000000AE | WO |
*   181 | 0261EA EK (1) | 000000AE | WO |
*
* => Must throw Error: NAT3098: Value to be added already exists
*
PERFORM FILL_PRINT_FIRST
PERFORM FILL_PRINT_SECOND

ON ERROR
  WRITE (1) NOTITLE NOHDR 'Error with error number:' *ERROR-NR
END-ERROR

PERFORM CLEANUP
WRITE (1) NOTITLE NOHDR *PROGRAM 'end'



DEFINE SUBROUTINE FILL_PRINT_FIRST
  RESET DDM3263A-V

  DDM3263A-V.AE_D := 174 /* Hex 000000AE
  DDM3263A-V.AAA := 'WO'
  DDM3263A-V.AD_MU(1) := '0261EA EK'
  DDM3263A-V.AD_MU(2) := '0261ST ZP'

  WRITE (1) NOTITLE NOHDR 'Storing first...'
  STORE DDM3263A-V
  END TRANSACTION

  PERFORM PRINT_VIEW
END-SUBROUTINE



DEFINE SUBROUTINE FILL_PRINT_SECOND
  RESET DDM3263A-V

  DDM3263A-V.AE_D := 174 /* Hex 000000AE
  DDM3263A-V.AAA := 'WO'
  DDM3263A-V.AD_MU(1) := '0261EA EK'

  WRITE (1) NOTITLE NOHDR 'Storing second...'
  STORE DDM3263A-V
  END TRANSACTION

  PERFORM PRINT_VIEW
END-SUBROUTINE



DEFINE SUBROUTINE PRINT_VIEW
  WRITE (1) NOTITLE NOHDR 'Read by ISN...'
  READ DDM3263A-V BY ISN
     WRITE (1) NOTITLE NOHDR '=' DDM3263A-V
  END-READ
END-SUBROUTINE



DEFINE SUBROUTINE CLEANUP
  WRITE (1) NOTITLE NOHDR *PROGRAM 'cleanup'
  READ DDM3263A-V
    DELETE
    RESET DDM3263A-V
  END-READ
  END TRANSACTION
END-SUBROUTINE

END
