DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
01 #A2 (A2)
01 REDEFINE #A2
  02 #P2 (P2)
END-DEFINE

INCLUDE Z1069--C
FORMAT (1) PS=0

SET CONTROL 'N'

WRITE (0) NOTITLE NOHDR *PROGRAM
WRITE (0) NOTITLE NOHDR 'before RESET'
*
WRITE (0) NOTITLE NOHDR 'after RESET'
WRITE (0) NOTITLE NOHDR '=' #A2 #A2 (EM=HH)
WRITE (0) NOTITLE NOHDR '=' #P2 #P2 (EM=HH)
*
WRITE (0) NOTITLE NOHDR 'before SUBTRACT'
SUBTRACT 1 FROM #P2

WRITE (0) NOTITLE NOHDR 'after SUBTRACT'
WRITE (0) NOTITLE NOHDR '=' #A2 #A2 (EM=HH)
WRITE (0) NOTITLE NOHDR '=' #P2 #P2 (EM=HH)

WRITE *PROGRAM '*****  END  *****'

END
