DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 #FLD1 (A5) INIT <'AAAAA'>
1 #FLD2 (A5) INIT <'BBBBB'>
1 #FLD3 (A5) INIT <'CCCCC'>
1 #FLD4 (A5) INIT <'DDDDD'>
END-DEFINE

INCLUDE Z1069--C

DISPLAY (1) NOTITLE 'EXTREMELY LONG LABEL' #FLD1 'NATURAL'  'IS BROKEN' 50T #FLD2
DISPLAY (1) NOTITLE  #FLD1 50T #FLD2
DISPLAY (1) NOTITLE  #FLD1 50T #FLD2

END
