DEFINE DATA
*
** Datentabelle
LOCAL
01         #T-TABLE                    (0020)
  02       #T-KEY                      (I002)
  02       #T-VAL                      (A025)
*
** Index-Felder
01         #I-INDEX
  02       #I                          (I002)
*
END-DEFINE
*
FORMAT (1) LS=180 PS=0

RESET  #T-TABLE(*)
*
** Tabelle fuellen
MOVE  28                               TO  #T-KEY(1)
MOVE  'vier mal sieben'                TO  #T-VAL(1)
MOVE  7                                TO  #T-KEY(2)
MOVE  'ein mal sieben'                 TO  #T-VAL(2)
MOVE  35                               TO  #T-KEY(3)
MOVE  'f�nf mal sieben'                TO  #T-VAL(3)
MOVE  21                               TO  #T-KEY(4)
MOVE  'drei mal sieben'                TO  #T-VAL(4)
MOVE  14                               TO  #T-KEY(5)
MOVE  'zwei mal sieben'                TO  #T-VAL(5)
*
MOVE  86                               TO  #T-KEY(6)
MOVE  'sechs - falsch'                 TO  #T-VAL(6)
MOVE  87                               TO  #T-KEY(7)
MOVE  'sieben - falsch'                TO  #T-VAL(7)
MOVE  88                               TO  #T-KEY(8)
MOVE  'acht - falsch'                  TO  #T-VAL(8)
MOVE  89                               TO  #T-KEY(9)
MOVE  'neun - falsch'                  TO  #T-VAL(9)
MOVE  90                               TO  #T-KEY(10)
MOVE  'zehn - falsch'                  TO  #T-VAL(10)
MOVE  91                               TO  #T-KEY(11)
MOVE  'elf - falsch'                   TO  #T-VAL(11)
*
WRITE (1) NOTITLE '***** START OF PROGRAM *****'

FOR #I FROM 1 TO 5
	WRITE (1) NOTITLE '---->SORT-IN  - key:' #T-KEY(#I) '- val:' #T-VAL(#I) '- i:' #I
END-ALL
AND SORT THEM BY    #T-KEY(#I)
			  USING #T-VAL(#I)
	WRITE (1) NOTITLE '---->SORT-OUT - key:' #T-KEY(#I) '- val:' #T-VAL(#I)
END-SORT

WRITE (1) NOTITLE '***** END OF PROGRAM *****'

END
