*
* Test for WMEE-4337
* INSERT, SELECT, UPDATE with one indicator variables. Either null indicator for null and length, or length indicator.
*

DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL USING VIEW-ALL

LOCAL
1 ASHORT (A8)
1 ASHORT_LIND (I2)
1 ASHORT_NIND (I2)
1 I2 (I2)
END-DEFINE

INCLUDE Z1069--C
FORMAT (1) PS=0 LS=180


* Cleanup test table before the test
DELETE FROM TPL-IW_SQL_TEST


* INSERT with INDICATOR only, set to indicate non-null or null
I2 := 1
ASHORT := '1HALLO1'
ASHORT_NIND := 0
INSERT INTO TPL-IW_SQL_TEST(I_2, ALPHA_SHORT)
  VALUES (I2, ASHORT INDICATOR ASHORT_NIND)

I2 := 2
ASHORT := '2HALLO2'
ASHORT_NIND := -1
INSERT INTO TPL-IW_SQL_TEST(I_2, ALPHA_SHORT)
  VALUES (I2, ASHORT INDICATOR ASHORT_NIND)

* INSERT with LINDICATOR only
I2 := 3
ASHORT := '3HALLO3'
ASHORT_NIND := -1
ASHORT_LIND := 3
INSERT INTO TPL-IW_SQL_TEST(I_2, ALPHA_SHORT)
  VALUES (I2, ASHORT LINDICATOR ASHORT_LIND)


* SELECT with both indicators
SELECT I_2, ALPHA_SHORT
    INTO I2, ASHORT INDICATOR ASHORT_NIND LINDICATOR ASHORT_LIND
    FROM TPL-IW_SQL_TEST ORDER BY I_2
  WRITE (1) NOTITLE NOHDR '=' I2 '=' ASHORT '=' ASHORT_NIND '=' ASHORT_LIND
END-SELECT


* UPDATE with INDICATOR only, set to indicate non-empty or empty
I2 := 1
ASHORT := '1HALLO1'
ASHORT_NIND := -1
UPDATE TPL-IW_SQL_TEST
  SET ALPHA_SHORT = ASHORT INDICATOR ASHORT_NIND
  WHERE I_2 = I2

I2 := 2
ASHORT := '22HALLO2'
ASHORT_NIND := 0
UPDATE TPL-IW_SQL_TEST
  SET ALPHA_SHORT = ASHORT INDICATOR ASHORT_NIND
  WHERE I_2 = I2

* UPDATE with LINDICATOR only
I2 := 3
ASHORT := '33HALLO3'
ASHORT_LIND := 4
UPDATE TPL-IW_SQL_TEST
  SET ALPHA_SHORT = ASHORT LINDICATOR ASHORT_LIND
  WHERE I_2 = I2


* SELECT with both indicators
SELECT I_2, ALPHA_SHORT
    INTO I2, ASHORT INDICATOR ASHORT_NIND LINDICATOR ASHORT_LIND
    FROM TPL-IW_SQL_TEST ORDER BY I_2
  WRITE (1) NOTITLE NOHDR '=' I2 '=' ASHORT '=' ASHORT_NIND '=' ASHORT_LIND
END-SELECT

 
* Cleanup test table after the test
DELETE FROM TPL-IW_SQL_TEST

ROLLBACK


END
