DEFINE DATA
LOCAL
1 #OP (I4)
INDEPENDENT
1 +J (I4)
1 +X (A1/1:*)
END-DEFINE

FORMAT (1) PS=0

INPUT #OP
ADD 1 TO #OP

DECIDE ON FIRST VALUE OF #OP

	VALUE 1
		WRITE (1) NOTITLE *PROGRAM #OP +J '*OCC=' *OCC(+X)
		RESIZE ARRAY +X TO (1:7)
		ADD 1 TO +J
		MOVE 'Y' TO +X(1)
		WRITE (1) NOTITLE *PROGRAM #OP +J '*OCC=' *OCC(+X) +X(1)
		FETCH 'MEE4071C' #OP

	VALUE 3
		WRITE (1) NOTITLE *PROGRAM #OP +J '*OCC=' *OCC(+X)
		RESIZE ARRAY +X TO (1:5)
		ADD 1 TO +J
		WRITE (1) NOTITLE *PROGRAM #OP +J '*OCC=' *OCC(+X) +X(1)
		RELEASE VARIABLES
		FETCH 'MEE4071C' #OP

	VALUE 5
		WRITE (1) NOTITLE *PROGRAM #OP +J '*OCC=' *OCC(+X)
		RESIZE ARRAY +X TO (1:30)
		ADD 1 TO +J
		WRITE (1) NOTITLE *PROGRAM #OP +J '*OCC=' *OCC(+X) +X(1)
		FETCH 'MEE4071C' #OP

	VALUE 12
		WRITE (1) NOTITLE *PROGRAM #OP +J '*OCC=' *OCC(+X)
		RESIZE ARRAY +X TO (1:7)
		ADD 1 TO +J
		WRITE (1) NOTITLE *PROGRAM #OP +J '*OCC=' *OCC(+X) +X(1)
		FETCH 'MEE4071C' #OP
		
	NONE VALUE
		WRITE (1) NOTITLE *PROGRAM #OP +J '*OCC=' *OCC(+X)
		WRITE (1) NOTITLE 'Escaping' #OP
		ESCAPE MODULE

END-DECIDE

END
