DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
01         #D-NUMBER                   (N001)
01         #D-FIELD                    (A005)
01         #D-ARRAY                    (A005/1:2)
01         #I-01                       (I004)
END-DEFINE

INCLUDE Z1069--C

FOR  #I-01                           FROM  8 TO 1 STEP -1

  MOVE  #I-01                          TO  #D-NUMBER
  MOVE ALL  #D-NUMBER                  TO  #D-FIELD

  IF  #I-01                            LE  2
    MOVE  1                            TO  #D-ARRAY(1)
  ELSE
    IF  #I-01                          LE  4
      MOVE  2                          TO  #D-ARRAY(1)
    ELSE
      MOVE  3                          TO  #D-ARRAY(1)
    END-IF
  END-IF

  IF  #I-01                            LE  3
    MOVE  1                            TO  #D-ARRAY(2)
  ELSE
    IF  #I-01                          LE  6
      MOVE  2                          TO  #D-ARRAY(2)
    ELSE
      MOVE  3                          TO  #D-ARRAY(2)
    END-IF
  END-IF
END-ALL

SORT BY  #D-ARRAY(1) #D-ARRAY(2) #D-FIELD USING KEYS

  AT BREAK OF  #D-ARRAY(1)
    WRITE (1) NOTITLE  'AT-BREAK #D-ARRAY(1):' #D-ARRAY(1) '=' #D-FIELD
  END-BREAK

  AT BREAK OF  #D-ARRAY(2)
    WRITE (1) NOTITLE  'AT-BREAK #D-ARRAY(2):' #D-ARRAY(2)  '=' #D-FIELD
  END-BREAK

  WRITE (1) NOTITLE  'SORT-OUT............:' #D-ARRAY(1) #D-ARRAY(2) #D-FIELD
END-SORT
WRITE (1) NOTITLE  '***** ENDE *****'
END
