**
* Test for WMEE-4976
* A program that requests a DB loops *ISN, before the loop has been executed.
* If the *ISN is 0, the program terminates with a RC=0, otherwise with RC=1.
**

DEFINE DATA
LOCAL
1 EMPL-VIEW VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 NAME
1 #ISN_BEFORE (P10)
END-DEFINE


DEFINE SUBROUTINE DO_FIND
  FIND1. FIND (1) EMPL-VIEW WITH PERSONNEL-ID NE ' ' SORTED BY PERSONNEL-ID WHERE PERSONNEL-ID GE '10000000'
    IGNORE
  END-FIND
END-SUBROUTINE

#ISN_BEFORE := *ISN(FIND1.)
PERFORM DO_FIND
TERMINATE #ISN_BEFORE

END
