DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
*
LOCAL
01         #SORT                       (A010)
*
01         #W-CNT                      (N001)
*
01         EMP                      VIEW OF  EMPLOYEES
  02       PERSONNEL-ID
*
END-DEFINE
*
INCLUDE Z1069--C
*
WRITE (1) NOTITLE *PROGRAM '***** START *****'
*
FOR  #W-CNT                          FROM  4 TO 1 STEP -1
*
MOVE ALL  #W-CNT                       TO  #SORT
*
END-ALL
SRT. SORT BY #SORT
       USING KEYS
*
  AT START OF DATA (SRT.)
    WRITE (1) NOTITLE *PROGRAM 'SORT-OUT started'
  END-START
*
  AT END OF DATA (SRT.)
    WRITE (1) NOTITLE *PROGRAM 'SORT-OUT ended'
  END-ENDDATA
*
  PERFORM BREAK PROCESSING (SRT.)
*
  AT BREAK (SRT.) OF #SORT
    WRITE (1) NOTITLE *PROGRAM 'AT BREAK of #SORT before READ' #SORT 'old:' OLD(#SORT)
	READ  (1) EMP
	  IGNORE
	END-READ 
    WRITE (1) NOTITLE *PROGRAM 'AT BREAK of #SORT after READ' #SORT 'old:' OLD(#SORT)
  END-BREAK
*
END-SORT
*
WRITE (1) NOTITLE *PROGRAM '*****  END  *****'
*
END
