DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 #REC (A8)
1 REDEFINE #REC
  2 #A (A1)
  2 #N (N2.2)
  2 #P (P2.2)
END-DEFINE

INCLUDE Z1069--C
FORMAT (1) PS=0

WRITE (1) NOTITLE  'START'

DEFINE WORK FILE 1 'MEE5438A.WRKF' TYPE 'ASCII'

RESET #REC

MOVE 'A' TO #A
MOVE 99.99 TO #N
MOVE 99.99 TO #P
WRITE WORK FILE 1 #REC
WRITE WORK FILE 1 #REC

MOVE 'B' TO #A
WRITE WORK FILE 1 #REC
WRITE WORK FILE 1 #REC
WRITE WORK FILE 1 #REC
MOVE 'C' TO #A
WRITE WORK FILE 1 #REC
WRITE WORK FILE 1 #REC

CLOSE WORK FILE 1

READ WORK FILE 1 #REC

	WRITE (1) 'record'

	AT BREAK OF #A
		WRITE (1) NOTITLE SUM(#N) (NL=12.2) SUM(#P) (NL=12.2)
    	WRITE (1) NOTITLE  'Break #A' #A OLD(#A)
  	END-BREAK

END-WORK

WRITE (1) NOTITLE  'END'

END
