DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
  1 #ALPHA_SHORT (A8)
  1 #ALPHA_LONG (A185)
  1 #DATUM (A10)
  1 #ZEIT (A8)
END-DEFINE
INCLUDE Z1069--C
FORMAT (1) PS=0

WRITE (1) NOTITLE NOHDR *PROGRAM
MOVE *PROGRAM TO #ALPHA_SHORT

DELETE FROM TPL-IW_SQL_TEST

PERFORM TEST-INSERT-DATE
PERFORM TEST-INSERT-TIME
PERFORM TEST-INSERT-DATE-TIME

DEFINE SUBROUTINE TEST-INSERT-DATE
	MOVE 'TEST-INSERT-DATE' TO #ALPHA_LONG
	WRITE (1) NOTITLE NOHDR 'TEST-INSERT-DATE'
	RESET #DATUM
	INSERT INTO TPL-IW_SQL_TEST (ALPHA_SHORT, ALPHA_LONG, DATUM) VALUES (#ALPHA_SHORT, #ALPHA_LONG, #DATUM)
	INSERT INTO TPL-IW_SQL_TEST (ALPHA_SHORT, ALPHA_LONG, DATUM) VALUES (#ALPHA_SHORT, #ALPHA_LONG, "2011-12-28")
	INSERT INTO TPL-IW_SQL_TEST (ALPHA_SHORT, ALPHA_LONG, DATUM) VALUES (#ALPHA_SHORT, #ALPHA_LONG, "2014-12-02")

	SELECT ALPHA_SHORT, DATUM INTO #ALPHA_SHORT, #DATUM FROM TPL-IW_SQL_TEST ORDER BY DATUM
		WRITE (1) NOTITLE NOHDR '=' #DATUM
	END-SELECT

	DELETE FROM TPL-IW_SQL_TEST
END-SUBROUTINE

DEFINE SUBROUTINE TEST-INSERT-TIME
	MOVE 'TEST-INSERT-TIME' TO #ALPHA_LONG
	WRITE (1) NOTITLE NOHDR 'TEST-INSERT-TIME'
	RESET #ZEIT
	INSERT INTO TPL-IW_SQL_TEST (ALPHA_SHORT, ALPHA_LONG, ZEIT) VALUES (#ALPHA_SHORT, #ALPHA_LONG, #ZEIT)
	INSERT INTO TPL-IW_SQL_TEST (ALPHA_SHORT, ALPHA_LONG, ZEIT) VALUES (#ALPHA_SHORT, #ALPHA_LONG, "07:05:12")
	INSERT INTO TPL-IW_SQL_TEST (ALPHA_SHORT, ALPHA_LONG, ZEIT) VALUES (#ALPHA_SHORT, #ALPHA_LONG, "06:52:00")

	SELECT ALPHA_SHORT, ZEIT INTO #ALPHA_SHORT, #ZEIT FROM TPL-IW_SQL_TEST ORDER BY ZEIT
		WRITE (1) NOTITLE NOHDR '=' #ZEIT
	END-SELECT

	DELETE FROM TPL-IW_SQL_TEST
END-SUBROUTINE

DEFINE SUBROUTINE TEST-INSERT-DATE-TIME
	MOVE "TEST-INSERT-DATE-TIME" TO #ALPHA_LONG
	WRITE (1) NOTITLE NOHDR 'TEST-INSERT-DATE-TIME'
	RESET #DATUM
	RESET #ZEIT
	INSERT INTO TPL-IW_SQL_TEST (ALPHA_SHORT, ALPHA_LONG, DATUM, ZEIT) VALUES (#ALPHA_SHORT, #ALPHA_LONG, #DATUM, #ZEIT)
	INSERT INTO TPL-IW_SQL_TEST (ALPHA_SHORT, ALPHA_LONG, DATUM, ZEIT) VALUES (#ALPHA_SHORT, #ALPHA_LONG, "2011-12-28", "06:52:00")
	INSERT INTO TPL-IW_SQL_TEST (ALPHA_SHORT, ALPHA_LONG, DATUM, ZEIT) VALUES (#ALPHA_SHORT, #ALPHA_LONG, "2014-12-02", "07:05:12")

	SELECT ALPHA_SHORT, DATUM, ZEIT INTO #ALPHA_SHORT, #DATUM, #ZEIT FROM TPL-IW_SQL_TEST ORDER BY DATUM
		WRITE (1) NOTITLE NOHDR '=' #DATUM '=' #ZEIT
	END-SELECT

	DELETE FROM TPL-IW_SQL_TEST
END-SUBROUTINE

COMMIT
ON ERROR
	COMMIT
END-ERROR
END
