DEFINE DATA
LOCAL
	1 L-#N-8355(N8.4) INIT <8355>
	1 L-#I-2765(I4) INIT <2765>
	1 L-#B8-H10(B8) INIT <H'00'>
	1 L-#B4-7676(B4) INIT <7676>
	1 L-#B4-2765(B4) INIT <2765>
	1 L-#A1-H00(A1) INIT <H'00'>
	1 L-#A1-H20(A1) INIT <H'20'>
	1 L-#I-4(I4) INIT <4>
	1 L-#I-7676(I4) INIT <7676>
	1 L-#B1-H00(B1) INIT <H'00'>
	1 L-#B1-H20(B1) INIT <H'20'>
	1 L-#I-1234(I4) INIT <1234>
	1 L-#B4-8355(B4) INIT <8355>
	1 L-#B8-4(B8) INIT <H'00'>
	1 L-#F-7676(F8) INIT <7676>
	1 L-#A8-H00(A8) INIT <H'00'>
	1 L-#A8-H20(A8) INIT <H'20'>
	1 L-#B1-4(B1) INIT <4>
	1 L-#D-2765(D) INIT <*DATX>
	1 L-#B4-H20(B4) INIT <H'20'>
	1 L-#D-1234(D) INIT <*DATX>
	1 L-#A4-H00(A4) INIT <H'00'>
	1 L-#D-7676(D) INIT <*DATX>
	1 L-#A4-H20(A4) INIT <H'20'>
	1 L-#F-4(F8) INIT <4>
	1 L-#A1-4(A1) INIT <4>
	1 L-#D-DATX(D) INIT <*DATX>
	1 L-#B4-H00(B4) INIT <H'00'>
	1 L-#A1-H10(A1) INIT <H'10'>
	1 L-#F-1234(F8) INIT <1234>
	1 L-#B8-H20(B8) INIT <H'00'>
	1 L-#B4-1234(B4) INIT <1234>
	1 L-#A8-4(A8) INIT <4>
	1 L-#B8-H00(B8) INIT <H'00'>
	1 L-#D-4(D) INIT <*DATX>
	1 L-#D-8355(D) INIT <*DATX>
	1 L-#N-76761234(N8.4) INIT <7676.1234>
	1 L-#B1-H10(B1) INIT <H'10'>
	1 L-#N-4(N8.4) INIT <4>
	1 L-#A8-H10(A8) INIT <H'10'>
	1 L-#A4-4(A4) INIT <4>
	1 L-#F-2765(F8) INIT <2765>
	1 L-#B4-4(B4) INIT <4>
	1 L-#A4-H10(A4) INIT <H'10'>
	1 L-#B4-H10(B4) INIT <H'10'>
	1 L-#F-8355(F8) INIT <8355>
	1 L-#I-8355(I4) INIT <8355>
	1 R-#B4-1234(B4) INIT <1234>
	1 R-#A8-4(A8) INIT <4>
	1 R-#B1-H00(B1) INIT <H'00'>
	1 R-#B4-H00(B4) INIT <H'00'>
	1 R-#D-DATX(D) INIT <*DATX>
	1 R-#B4-4(B4) INIT <4>
	1 R-#B4-H20(B4) INIT <H'20'>
	1 R-#D-2765(D) INIT <*DATX>
	1 R-#A1-H00(A1) INIT <H'00'>
	1 R-#A8-H10(A8) INIT <H'10'>
	1 R-#B4-8355(B4) INIT <8355>
	1 R-#F-8355(F8) INIT <8355>
	1 R-#I-7676(I4) INIT <7676>
	1 R-#A1-H20(A1) INIT <H'20'>
	1 R-#D-8355(D) INIT <*DATX>
	1 R-#B4-2765(B4) INIT <2765>
	1 R-#A4-4(A4) INIT <4>
	1 R-#F-1234(F8) INIT <1234>
	1 R-#F-2765(F8) INIT <2765>
	1 R-#B8-4(B8) INIT <H'00'>
	1 R-#N-4(N8.4) INIT <4>
	1 R-#B8-H10(B8) INIT <H'00'>
	1 R-#A4-H10(A4) INIT <H'10'>
	1 R-#A1-4(A1) INIT <4>
	1 R-#B4-7676(B4) INIT <7676>
	1 R-#B1-H20(B1) INIT <H'20'>
	1 R-#N-8355(N8.4) INIT <8355>
	1 R-#I-8355(I4) INIT <8355>
	1 R-#B1-H10(B1) INIT <H'10'>
	1 R-#A8-H20(A8) INIT <H'20'>
	1 R-#D-4(D) INIT <*DATX>
	1 R-#B4-H10(B4) INIT <H'10'>
	1 R-#A1-H10(A1) INIT <H'10'>
	1 R-#A8-H00(A8) INIT <H'00'>
	1 R-#F-7676(F8) INIT <7676>
	1 R-#B8-H00(B8) INIT <H'00'>
	1 R-#D-7676(D) INIT <*DATX>
	1 R-#N-76761234(N8.4) INIT <7676.1234>
	1 R-#B1-4(B1) INIT <4>
	1 R-#I-2765(I4) INIT <2765>
	1 R-#D-1234(D) INIT <*DATX>
	1 R-#I-1234(I4) INIT <1234>
	1 R-#B8-H20(B8) INIT <H'00'>
	1 R-#F-4(F8) INIT <4>
	1 R-#I-4(I4) INIT <4>
	1 R-#A4-H20(A4) INIT <H'20'>
	1 R-#A4-H00(A4) INIT <H'00'>
END-DEFINE
FORMAT (1) LS=132 PS=0
IF L-#B8-H10 LE R-#B4-2765
	WRITE (1) NOTITLE 'TEST-402: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-402: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
END-IF
*
IF L-#B8-H10 EQ R-#A4-4
	WRITE (1) NOTITLE 'TEST-403: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#A4-4 ' R-#A4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-403: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#A4-4 ' R-#A4-4 (EM=X)
END-IF
*
IF L-#B8-H10 NE R-#A4-4
	WRITE (1) NOTITLE 'TEST-404: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#A4-4 ' R-#A4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-404: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#A4-4 ' R-#A4-4 (EM=X)
END-IF
*
IF L-#B8-H10 LT R-#A4-4
	WRITE (1) NOTITLE 'TEST-405: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#A4-4 ' R-#A4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-405: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#A4-4 ' R-#A4-4 (EM=X)
END-IF
*
IF L-#B8-H10 GE R-#A4-4
	WRITE (1) NOTITLE 'TEST-406: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#A4-4 ' R-#A4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-406: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#A4-4 ' R-#A4-4 (EM=X)
END-IF
*
IF L-#B8-H10 GT R-#A4-4
	WRITE (1) NOTITLE 'TEST-407: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#A4-4 ' R-#A4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-407: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#A4-4 ' R-#A4-4 (EM=X)
END-IF
*
IF L-#B8-H10 LE R-#A4-4
	WRITE (1) NOTITLE 'TEST-408: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#A4-4 ' R-#A4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-408: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#A4-4 ' R-#A4-4 (EM=X)
END-IF
*
IF L-#B8-H10 EQ R-#B8-4
	WRITE (1) NOTITLE 'TEST-409: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#B8-4 ' R-#B8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-409: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#B8-4 ' R-#B8-4 (EM=X)
END-IF
*
IF L-#B8-H10 NE R-#B8-4
	WRITE (1) NOTITLE 'TEST-410: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#B8-4 ' R-#B8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-410: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#B8-4 ' R-#B8-4 (EM=X)
END-IF
*
IF L-#B8-H10 LT R-#B8-4
	WRITE (1) NOTITLE 'TEST-411: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#B8-4 ' R-#B8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-411: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#B8-4 ' R-#B8-4 (EM=X)
END-IF
*
IF L-#B8-H10 GE R-#B8-4
	WRITE (1) NOTITLE 'TEST-412: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#B8-4 ' R-#B8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-412: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#B8-4 ' R-#B8-4 (EM=X)
END-IF
*
IF L-#B8-H10 GT R-#B8-4
	WRITE (1) NOTITLE 'TEST-413: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#B8-4 ' R-#B8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-413: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#B8-4 ' R-#B8-4 (EM=X)
END-IF
*
IF L-#B8-H10 LE R-#B8-4
	WRITE (1) NOTITLE 'TEST-414: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#B8-4 ' R-#B8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-414: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#B8-4 ' R-#B8-4 (EM=X)
END-IF
*
IF L-#B8-H10 EQ R-#B8-H10
	WRITE (1) NOTITLE 'TEST-415: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#B8-H10 ' R-#B8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-415: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#B8-H10 ' R-#B8-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 NE R-#B8-H10
	WRITE (1) NOTITLE 'TEST-416: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#B8-H10 ' R-#B8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-416: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#B8-H10 ' R-#B8-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 LT R-#B8-H10
	WRITE (1) NOTITLE 'TEST-417: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#B8-H10 ' R-#B8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-417: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#B8-H10 ' R-#B8-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 GE R-#B8-H10
	WRITE (1) NOTITLE 'TEST-418: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#B8-H10 ' R-#B8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-418: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#B8-H10 ' R-#B8-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 GT R-#B8-H10
	WRITE (1) NOTITLE 'TEST-419: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#B8-H10 ' R-#B8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-419: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#B8-H10 ' R-#B8-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 LE R-#B8-H10
	WRITE (1) NOTITLE 'TEST-420: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#B8-H10 ' R-#B8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-420: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#B8-H10 ' R-#B8-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 EQ R-#A4-H10
	WRITE (1) NOTITLE 'TEST-421: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#A4-H10 ' R-#A4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-421: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#A4-H10 ' R-#A4-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 NE R-#A4-H10
	WRITE (1) NOTITLE 'TEST-422: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#A4-H10 ' R-#A4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-422: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#A4-H10 ' R-#A4-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 LT R-#A4-H10
	WRITE (1) NOTITLE 'TEST-423: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#A4-H10 ' R-#A4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-423: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#A4-H10 ' R-#A4-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 GE R-#A4-H10
	WRITE (1) NOTITLE 'TEST-424: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#A4-H10 ' R-#A4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-424: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#A4-H10 ' R-#A4-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 GT R-#A4-H10
	WRITE (1) NOTITLE 'TEST-425: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#A4-H10 ' R-#A4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-425: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#A4-H10 ' R-#A4-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 LE R-#A4-H10
	WRITE (1) NOTITLE 'TEST-426: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#A4-H10 ' R-#A4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-426: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#A4-H10 ' R-#A4-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 EQ R-#A1-4
	WRITE (1) NOTITLE 'TEST-427: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#A1-4 ' R-#A1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-427: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#A1-4 ' R-#A1-4 (EM=X)
END-IF
*
IF L-#B8-H10 NE R-#A1-4
	WRITE (1) NOTITLE 'TEST-428: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#A1-4 ' R-#A1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-428: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#A1-4 ' R-#A1-4 (EM=X)
END-IF
*
IF L-#B8-H10 LT R-#A1-4
	WRITE (1) NOTITLE 'TEST-429: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#A1-4 ' R-#A1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-429: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#A1-4 ' R-#A1-4 (EM=X)
END-IF
*
IF L-#B8-H10 GE R-#A1-4
	WRITE (1) NOTITLE 'TEST-430: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#A1-4 ' R-#A1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-430: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#A1-4 ' R-#A1-4 (EM=X)
END-IF
*
IF L-#B8-H10 GT R-#A1-4
	WRITE (1) NOTITLE 'TEST-431: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#A1-4 ' R-#A1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-431: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#A1-4 ' R-#A1-4 (EM=X)
END-IF
*
IF L-#B8-H10 LE R-#A1-4
	WRITE (1) NOTITLE 'TEST-432: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#A1-4 ' R-#A1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-432: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#A1-4 ' R-#A1-4 (EM=X)
END-IF
*
IF L-#B8-H10 EQ R-#B4-7676
	WRITE (1) NOTITLE 'TEST-433: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-433: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
END-IF
*
IF L-#B8-H10 NE R-#B4-7676
	WRITE (1) NOTITLE 'TEST-434: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-434: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
END-IF
*
IF L-#B8-H10 LT R-#B4-7676
	WRITE (1) NOTITLE 'TEST-435: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-435: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
END-IF
*
IF L-#B8-H10 GE R-#B4-7676
	WRITE (1) NOTITLE 'TEST-436: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-436: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
END-IF
*
IF L-#B8-H10 GT R-#B4-7676
	WRITE (1) NOTITLE 'TEST-437: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-437: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
END-IF
*
IF L-#B8-H10 LE R-#B4-7676
	WRITE (1) NOTITLE 'TEST-438: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-438: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
END-IF
*
IF L-#B8-H10 EQ R-#B1-H20
	WRITE (1) NOTITLE 'TEST-439: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#B1-H20 ' R-#B1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-439: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#B1-H20 ' R-#B1-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 NE R-#B1-H20
	WRITE (1) NOTITLE 'TEST-440: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#B1-H20 ' R-#B1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-440: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#B1-H20 ' R-#B1-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 LT R-#B1-H20
	WRITE (1) NOTITLE 'TEST-441: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#B1-H20 ' R-#B1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-441: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#B1-H20 ' R-#B1-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 GE R-#B1-H20
	WRITE (1) NOTITLE 'TEST-442: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#B1-H20 ' R-#B1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-442: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#B1-H20 ' R-#B1-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 GT R-#B1-H20
	WRITE (1) NOTITLE 'TEST-443: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#B1-H20 ' R-#B1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-443: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#B1-H20 ' R-#B1-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 LE R-#B1-H20
	WRITE (1) NOTITLE 'TEST-444: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#B1-H20 ' R-#B1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-444: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#B1-H20 ' R-#B1-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 EQ R-#B1-H10
	WRITE (1) NOTITLE 'TEST-445: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#B1-H10 ' R-#B1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-445: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#B1-H10 ' R-#B1-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 NE R-#B1-H10
	WRITE (1) NOTITLE 'TEST-446: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#B1-H10 ' R-#B1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-446: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#B1-H10 ' R-#B1-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 LT R-#B1-H10
	WRITE (1) NOTITLE 'TEST-447: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#B1-H10 ' R-#B1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-447: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#B1-H10 ' R-#B1-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 GE R-#B1-H10
	WRITE (1) NOTITLE 'TEST-448: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#B1-H10 ' R-#B1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-448: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#B1-H10 ' R-#B1-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 GT R-#B1-H10
	WRITE (1) NOTITLE 'TEST-449: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#B1-H10 ' R-#B1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-449: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#B1-H10 ' R-#B1-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 LE R-#B1-H10
	WRITE (1) NOTITLE 'TEST-450: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#B1-H10 ' R-#B1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-450: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#B1-H10 ' R-#B1-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 EQ R-#A8-H20
	WRITE (1) NOTITLE 'TEST-451: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#A8-H20 ' R-#A8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-451: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#A8-H20 ' R-#A8-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 NE R-#A8-H20
	WRITE (1) NOTITLE 'TEST-452: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#A8-H20 ' R-#A8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-452: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#A8-H20 ' R-#A8-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 LT R-#A8-H20
	WRITE (1) NOTITLE 'TEST-453: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#A8-H20 ' R-#A8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-453: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#A8-H20 ' R-#A8-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 GE R-#A8-H20
	WRITE (1) NOTITLE 'TEST-454: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#A8-H20 ' R-#A8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-454: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#A8-H20 ' R-#A8-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 GT R-#A8-H20
	WRITE (1) NOTITLE 'TEST-455: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#A8-H20 ' R-#A8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-455: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#A8-H20 ' R-#A8-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 LE R-#A8-H20
	WRITE (1) NOTITLE 'TEST-456: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#A8-H20 ' R-#A8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-456: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#A8-H20 ' R-#A8-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 EQ R-#B4-H10
	WRITE (1) NOTITLE 'TEST-457: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#B4-H10 ' R-#B4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-457: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#B4-H10 ' R-#B4-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 NE R-#B4-H10
	WRITE (1) NOTITLE 'TEST-458: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#B4-H10 ' R-#B4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-458: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#B4-H10 ' R-#B4-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 LT R-#B4-H10
	WRITE (1) NOTITLE 'TEST-459: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#B4-H10 ' R-#B4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-459: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#B4-H10 ' R-#B4-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 GE R-#B4-H10
	WRITE (1) NOTITLE 'TEST-460: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#B4-H10 ' R-#B4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-460: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#B4-H10 ' R-#B4-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 GT R-#B4-H10
	WRITE (1) NOTITLE 'TEST-461: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#B4-H10 ' R-#B4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-461: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#B4-H10 ' R-#B4-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 LE R-#B4-H10
	WRITE (1) NOTITLE 'TEST-462: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#B4-H10 ' R-#B4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-462: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#B4-H10 ' R-#B4-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 EQ R-#A1-H10
	WRITE (1) NOTITLE 'TEST-463: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#A1-H10 ' R-#A1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-463: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#A1-H10 ' R-#A1-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 NE R-#A1-H10
	WRITE (1) NOTITLE 'TEST-464: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#A1-H10 ' R-#A1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-464: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#A1-H10 ' R-#A1-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 LT R-#A1-H10
	WRITE (1) NOTITLE 'TEST-465: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#A1-H10 ' R-#A1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-465: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#A1-H10 ' R-#A1-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 GE R-#A1-H10
	WRITE (1) NOTITLE 'TEST-466: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#A1-H10 ' R-#A1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-466: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#A1-H10 ' R-#A1-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 GT R-#A1-H10
	WRITE (1) NOTITLE 'TEST-467: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#A1-H10 ' R-#A1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-467: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#A1-H10 ' R-#A1-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 LE R-#A1-H10
	WRITE (1) NOTITLE 'TEST-468: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#A1-H10 ' R-#A1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-468: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#A1-H10 ' R-#A1-H10 (EM=HH)
END-IF
*
IF L-#B8-H10 EQ R-#A8-H00
	WRITE (1) NOTITLE 'TEST-469: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#A8-H00 ' R-#A8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-469: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#A8-H00 ' R-#A8-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 NE R-#A8-H00
	WRITE (1) NOTITLE 'TEST-470: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#A8-H00 ' R-#A8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-470: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#A8-H00 ' R-#A8-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 LT R-#A8-H00
	WRITE (1) NOTITLE 'TEST-471: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#A8-H00 ' R-#A8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-471: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#A8-H00 ' R-#A8-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 GE R-#A8-H00
	WRITE (1) NOTITLE 'TEST-472: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#A8-H00 ' R-#A8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-472: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#A8-H00 ' R-#A8-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 GT R-#A8-H00
	WRITE (1) NOTITLE 'TEST-473: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#A8-H00 ' R-#A8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-473: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#A8-H00 ' R-#A8-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 LE R-#A8-H00
	WRITE (1) NOTITLE 'TEST-474: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#A8-H00 ' R-#A8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-474: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#A8-H00 ' R-#A8-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 EQ R-#B8-H00
	WRITE (1) NOTITLE 'TEST-475: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#B8-H00 ' R-#B8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-475: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#B8-H00 ' R-#B8-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 NE R-#B8-H00
	WRITE (1) NOTITLE 'TEST-476: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#B8-H00 ' R-#B8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-476: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#B8-H00 ' R-#B8-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 LT R-#B8-H00
	WRITE (1) NOTITLE 'TEST-477: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#B8-H00 ' R-#B8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-477: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#B8-H00 ' R-#B8-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 GE R-#B8-H00
	WRITE (1) NOTITLE 'TEST-478: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#B8-H00 ' R-#B8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-478: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#B8-H00 ' R-#B8-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 GT R-#B8-H00
	WRITE (1) NOTITLE 'TEST-479: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#B8-H00 ' R-#B8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-479: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#B8-H00 ' R-#B8-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 LE R-#B8-H00
	WRITE (1) NOTITLE 'TEST-480: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#B8-H00 ' R-#B8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-480: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#B8-H00 ' R-#B8-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 EQ R-#B1-4
	WRITE (1) NOTITLE 'TEST-481: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#B1-4 ' R-#B1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-481: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#B1-4 ' R-#B1-4 (EM=X)
END-IF
*
IF L-#B8-H10 NE R-#B1-4
	WRITE (1) NOTITLE 'TEST-482: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#B1-4 ' R-#B1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-482: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#B1-4 ' R-#B1-4 (EM=X)
END-IF
*
IF L-#B8-H10 LT R-#B1-4
	WRITE (1) NOTITLE 'TEST-483: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#B1-4 ' R-#B1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-483: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#B1-4 ' R-#B1-4 (EM=X)
END-IF
*
IF L-#B8-H10 GE R-#B1-4
	WRITE (1) NOTITLE 'TEST-484: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#B1-4 ' R-#B1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-484: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#B1-4 ' R-#B1-4 (EM=X)
END-IF
*
IF L-#B8-H10 GT R-#B1-4
	WRITE (1) NOTITLE 'TEST-485: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#B1-4 ' R-#B1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-485: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#B1-4 ' R-#B1-4 (EM=X)
END-IF
*
IF L-#B8-H10 LE R-#B1-4
	WRITE (1) NOTITLE 'TEST-486: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#B1-4 ' R-#B1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-486: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#B1-4 ' R-#B1-4 (EM=X)
END-IF
*
IF L-#B8-H10 EQ R-#B8-H20
	WRITE (1) NOTITLE 'TEST-487: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#B8-H20 ' R-#B8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-487: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#B8-H20 ' R-#B8-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 NE R-#B8-H20
	WRITE (1) NOTITLE 'TEST-488: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#B8-H20 ' R-#B8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-488: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#B8-H20 ' R-#B8-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 LT R-#B8-H20
	WRITE (1) NOTITLE 'TEST-489: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#B8-H20 ' R-#B8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-489: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#B8-H20 ' R-#B8-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 GE R-#B8-H20
	WRITE (1) NOTITLE 'TEST-490: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#B8-H20 ' R-#B8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-490: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#B8-H20 ' R-#B8-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 GT R-#B8-H20
	WRITE (1) NOTITLE 'TEST-491: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#B8-H20 ' R-#B8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-491: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#B8-H20 ' R-#B8-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 LE R-#B8-H20
	WRITE (1) NOTITLE 'TEST-492: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#B8-H20 ' R-#B8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-492: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#B8-H20 ' R-#B8-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 EQ R-#A4-H20
	WRITE (1) NOTITLE 'TEST-493: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#A4-H20 ' R-#A4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-493: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#A4-H20 ' R-#A4-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 NE R-#A4-H20
	WRITE (1) NOTITLE 'TEST-494: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#A4-H20 ' R-#A4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-494: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#A4-H20 ' R-#A4-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 LT R-#A4-H20
	WRITE (1) NOTITLE 'TEST-495: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#A4-H20 ' R-#A4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-495: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#A4-H20 ' R-#A4-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 GE R-#A4-H20
	WRITE (1) NOTITLE 'TEST-496: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#A4-H20 ' R-#A4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-496: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#A4-H20 ' R-#A4-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 GT R-#A4-H20
	WRITE (1) NOTITLE 'TEST-497: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#A4-H20 ' R-#A4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-497: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#A4-H20 ' R-#A4-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 LE R-#A4-H20
	WRITE (1) NOTITLE 'TEST-498: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#A4-H20 ' R-#A4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-498: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#A4-H20 ' R-#A4-H20 (EM=HH)
END-IF
*
IF L-#B8-H10 EQ R-#A4-H00
	WRITE (1) NOTITLE 'TEST-499: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS EQ R-#A4-H00 ' R-#A4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-499: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT EQ R-#A4-H00 ' R-#A4-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 NE R-#A4-H00
	WRITE (1) NOTITLE 'TEST-500: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NE R-#A4-H00 ' R-#A4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-500: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT NE R-#A4-H00 ' R-#A4-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 LT R-#A4-H00
	WRITE (1) NOTITLE 'TEST-501: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LT R-#A4-H00 ' R-#A4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-501: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LT R-#A4-H00 ' R-#A4-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 GE R-#A4-H00
	WRITE (1) NOTITLE 'TEST-502: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GE R-#A4-H00 ' R-#A4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-502: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GE R-#A4-H00 ' R-#A4-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 GT R-#A4-H00
	WRITE (1) NOTITLE 'TEST-503: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS GT R-#A4-H00 ' R-#A4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-503: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT GT R-#A4-H00 ' R-#A4-H00 (EM=HH)
END-IF
*
IF L-#B8-H10 LE R-#A4-H00
	WRITE (1) NOTITLE 'TEST-504: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS LE R-#A4-H00 ' R-#A4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-504: L-#B8-H10' L-#B8-H10 (EM=HH) ' IS NOT LE R-#A4-H00 ' R-#A4-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#B4-1234
	WRITE (1) NOTITLE 'TEST-505: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-505: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
END-IF
*
IF L-#B4-7676 NE R-#B4-1234
	WRITE (1) NOTITLE 'TEST-506: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-506: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LT R-#B4-1234
	WRITE (1) NOTITLE 'TEST-507: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-507: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GE R-#B4-1234
	WRITE (1) NOTITLE 'TEST-508: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-508: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GT R-#B4-1234
	WRITE (1) NOTITLE 'TEST-509: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-509: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LE R-#B4-1234
	WRITE (1) NOTITLE 'TEST-510: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-510: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
END-IF
*
IF L-#B4-7676 EQ R-#A8-4
	WRITE (1) NOTITLE 'TEST-511: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#A8-4 ' R-#A8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-511: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#A8-4 ' R-#A8-4 (EM=X)
END-IF
*
IF L-#B4-7676 NE R-#A8-4
	WRITE (1) NOTITLE 'TEST-512: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#A8-4 ' R-#A8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-512: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#A8-4 ' R-#A8-4 (EM=X)
END-IF
*
IF L-#B4-7676 LT R-#A8-4
	WRITE (1) NOTITLE 'TEST-513: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#A8-4 ' R-#A8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-513: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#A8-4 ' R-#A8-4 (EM=X)
END-IF
*
IF L-#B4-7676 GE R-#A8-4
	WRITE (1) NOTITLE 'TEST-514: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#A8-4 ' R-#A8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-514: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#A8-4 ' R-#A8-4 (EM=X)
END-IF
*
IF L-#B4-7676 GT R-#A8-4
	WRITE (1) NOTITLE 'TEST-515: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#A8-4 ' R-#A8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-515: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#A8-4 ' R-#A8-4 (EM=X)
END-IF
*
IF L-#B4-7676 LE R-#A8-4
	WRITE (1) NOTITLE 'TEST-516: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#A8-4 ' R-#A8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-516: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#A8-4 ' R-#A8-4 (EM=X)
END-IF
*
IF L-#B4-7676 EQ R-#B1-H00
	WRITE (1) NOTITLE 'TEST-517: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B1-H00 ' R-#B1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-517: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B1-H00 ' R-#B1-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#B1-H00
	WRITE (1) NOTITLE 'TEST-518: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B1-H00 ' R-#B1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-518: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B1-H00 ' R-#B1-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#B1-H00
	WRITE (1) NOTITLE 'TEST-519: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B1-H00 ' R-#B1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-519: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B1-H00 ' R-#B1-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#B1-H00
	WRITE (1) NOTITLE 'TEST-520: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B1-H00 ' R-#B1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-520: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B1-H00 ' R-#B1-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#B1-H00
	WRITE (1) NOTITLE 'TEST-521: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B1-H00 ' R-#B1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-521: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B1-H00 ' R-#B1-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#B1-H00
	WRITE (1) NOTITLE 'TEST-522: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B1-H00 ' R-#B1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-522: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B1-H00 ' R-#B1-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#B4-H00
	WRITE (1) NOTITLE 'TEST-523: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B4-H00 ' R-#B4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-523: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B4-H00 ' R-#B4-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#B4-H00
	WRITE (1) NOTITLE 'TEST-524: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B4-H00 ' R-#B4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-524: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B4-H00 ' R-#B4-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#B4-H00
	WRITE (1) NOTITLE 'TEST-525: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B4-H00 ' R-#B4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-525: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B4-H00 ' R-#B4-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#B4-H00
	WRITE (1) NOTITLE 'TEST-526: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B4-H00 ' R-#B4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-526: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B4-H00 ' R-#B4-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#B4-H00
	WRITE (1) NOTITLE 'TEST-527: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B4-H00 ' R-#B4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-527: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B4-H00 ' R-#B4-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#B4-H00
	WRITE (1) NOTITLE 'TEST-528: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B4-H00 ' R-#B4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-528: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B4-H00 ' R-#B4-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#D-DATX
	WRITE (1) NOTITLE 'TEST-529: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#D-DATX ' R-#D-DATX (EM=XXXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-529: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#D-DATX ' R-#D-DATX (EM=XXXXX)
END-IF
*
IF L-#B4-7676 NE R-#D-DATX
	WRITE (1) NOTITLE 'TEST-530: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#D-DATX ' R-#D-DATX (EM=XXXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-530: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#D-DATX ' R-#D-DATX (EM=XXXXX)
END-IF
*
IF L-#B4-7676 LT R-#D-DATX
	WRITE (1) NOTITLE 'TEST-531: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#D-DATX ' R-#D-DATX (EM=XXXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-531: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#D-DATX ' R-#D-DATX (EM=XXXXX)
END-IF
*
IF L-#B4-7676 GE R-#D-DATX
	WRITE (1) NOTITLE 'TEST-532: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#D-DATX ' R-#D-DATX (EM=XXXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-532: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#D-DATX ' R-#D-DATX (EM=XXXXX)
END-IF
*
IF L-#B4-7676 GT R-#D-DATX
	WRITE (1) NOTITLE 'TEST-533: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#D-DATX ' R-#D-DATX (EM=XXXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-533: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#D-DATX ' R-#D-DATX (EM=XXXXX)
END-IF
*
IF L-#B4-7676 LE R-#D-DATX
	WRITE (1) NOTITLE 'TEST-534: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#D-DATX ' R-#D-DATX (EM=XXXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-534: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#D-DATX ' R-#D-DATX (EM=XXXXX)
END-IF
*
IF L-#B4-7676 EQ R-#B4-4
	WRITE (1) NOTITLE 'TEST-535: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B4-4 ' R-#B4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-535: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B4-4 ' R-#B4-4 (EM=X)
END-IF
*
IF L-#B4-7676 NE R-#B4-4
	WRITE (1) NOTITLE 'TEST-536: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B4-4 ' R-#B4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-536: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B4-4 ' R-#B4-4 (EM=X)
END-IF
*
IF L-#B4-7676 LT R-#B4-4
	WRITE (1) NOTITLE 'TEST-537: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B4-4 ' R-#B4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-537: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B4-4 ' R-#B4-4 (EM=X)
END-IF
*
IF L-#B4-7676 GE R-#B4-4
	WRITE (1) NOTITLE 'TEST-538: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B4-4 ' R-#B4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-538: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B4-4 ' R-#B4-4 (EM=X)
END-IF
*
IF L-#B4-7676 GT R-#B4-4
	WRITE (1) NOTITLE 'TEST-539: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B4-4 ' R-#B4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-539: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B4-4 ' R-#B4-4 (EM=X)
END-IF
*
IF L-#B4-7676 LE R-#B4-4
	WRITE (1) NOTITLE 'TEST-540: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B4-4 ' R-#B4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-540: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B4-4 ' R-#B4-4 (EM=X)
END-IF
*
IF L-#B4-7676 EQ R-#B4-H20
	WRITE (1) NOTITLE 'TEST-541: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B4-H20 ' R-#B4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-541: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B4-H20 ' R-#B4-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#B4-H20
	WRITE (1) NOTITLE 'TEST-542: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B4-H20 ' R-#B4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-542: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B4-H20 ' R-#B4-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#B4-H20
	WRITE (1) NOTITLE 'TEST-543: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B4-H20 ' R-#B4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-543: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B4-H20 ' R-#B4-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#B4-H20
	WRITE (1) NOTITLE 'TEST-544: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B4-H20 ' R-#B4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-544: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B4-H20 ' R-#B4-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#B4-H20
	WRITE (1) NOTITLE 'TEST-545: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B4-H20 ' R-#B4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-545: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B4-H20 ' R-#B4-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#B4-H20
	WRITE (1) NOTITLE 'TEST-546: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B4-H20 ' R-#B4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-546: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B4-H20 ' R-#B4-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#D-2765
	WRITE (1) NOTITLE 'TEST-547: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#D-2765 ' R-#D-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-547: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#D-2765 ' R-#D-2765 (EM=XXXX)
END-IF
*
IF L-#B4-7676 NE R-#D-2765
	WRITE (1) NOTITLE 'TEST-548: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#D-2765 ' R-#D-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-548: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#D-2765 ' R-#D-2765 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LT R-#D-2765
	WRITE (1) NOTITLE 'TEST-549: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#D-2765 ' R-#D-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-549: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#D-2765 ' R-#D-2765 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GE R-#D-2765
	WRITE (1) NOTITLE 'TEST-550: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#D-2765 ' R-#D-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-550: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#D-2765 ' R-#D-2765 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GT R-#D-2765
	WRITE (1) NOTITLE 'TEST-551: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#D-2765 ' R-#D-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-551: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#D-2765 ' R-#D-2765 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LE R-#D-2765
	WRITE (1) NOTITLE 'TEST-552: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#D-2765 ' R-#D-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-552: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#D-2765 ' R-#D-2765 (EM=XXXX)
END-IF
*
IF L-#B4-7676 EQ R-#A1-H00
	WRITE (1) NOTITLE 'TEST-553: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#A1-H00 ' R-#A1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-553: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#A1-H00 ' R-#A1-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#A1-H00
	WRITE (1) NOTITLE 'TEST-554: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#A1-H00 ' R-#A1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-554: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#A1-H00 ' R-#A1-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#A1-H00
	WRITE (1) NOTITLE 'TEST-555: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#A1-H00 ' R-#A1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-555: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#A1-H00 ' R-#A1-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#A1-H00
	WRITE (1) NOTITLE 'TEST-556: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#A1-H00 ' R-#A1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-556: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#A1-H00 ' R-#A1-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#A1-H00
	WRITE (1) NOTITLE 'TEST-557: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#A1-H00 ' R-#A1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-557: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#A1-H00 ' R-#A1-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#A1-H00
	WRITE (1) NOTITLE 'TEST-558: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#A1-H00 ' R-#A1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-558: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#A1-H00 ' R-#A1-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#A8-H10
	WRITE (1) NOTITLE 'TEST-559: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#A8-H10 ' R-#A8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-559: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#A8-H10 ' R-#A8-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#A8-H10
	WRITE (1) NOTITLE 'TEST-560: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#A8-H10 ' R-#A8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-560: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#A8-H10 ' R-#A8-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#A8-H10
	WRITE (1) NOTITLE 'TEST-561: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#A8-H10 ' R-#A8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-561: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#A8-H10 ' R-#A8-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#A8-H10
	WRITE (1) NOTITLE 'TEST-562: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#A8-H10 ' R-#A8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-562: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#A8-H10 ' R-#A8-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#A8-H10
	WRITE (1) NOTITLE 'TEST-563: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#A8-H10 ' R-#A8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-563: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#A8-H10 ' R-#A8-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#A8-H10
	WRITE (1) NOTITLE 'TEST-564: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#A8-H10 ' R-#A8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-564: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#A8-H10 ' R-#A8-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#B4-8355
	WRITE (1) NOTITLE 'TEST-565: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B4-8355 ' R-#B4-8355 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-565: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B4-8355 ' R-#B4-8355 (EM=XXXX)
END-IF
*
IF L-#B4-7676 NE R-#B4-8355
	WRITE (1) NOTITLE 'TEST-566: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B4-8355 ' R-#B4-8355 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-566: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B4-8355 ' R-#B4-8355 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LT R-#B4-8355
	WRITE (1) NOTITLE 'TEST-567: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B4-8355 ' R-#B4-8355 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-567: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B4-8355 ' R-#B4-8355 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GE R-#B4-8355
	WRITE (1) NOTITLE 'TEST-568: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B4-8355 ' R-#B4-8355 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-568: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B4-8355 ' R-#B4-8355 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GT R-#B4-8355
	WRITE (1) NOTITLE 'TEST-569: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B4-8355 ' R-#B4-8355 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-569: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B4-8355 ' R-#B4-8355 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LE R-#B4-8355
	WRITE (1) NOTITLE 'TEST-570: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B4-8355 ' R-#B4-8355 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-570: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B4-8355 ' R-#B4-8355 (EM=XXXX)
END-IF
*
IF L-#B4-7676 EQ R-#F-8355
	WRITE (1) NOTITLE 'TEST-571: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#F-8355 ' R-#F-8355
ELSE
	WRITE (1) NOTITLE 'TEST-571: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#F-8355 ' R-#F-8355
END-IF
*
IF L-#B4-7676 NE R-#F-8355
	WRITE (1) NOTITLE 'TEST-572: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#F-8355 ' R-#F-8355
ELSE
	WRITE (1) NOTITLE 'TEST-572: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#F-8355 ' R-#F-8355
END-IF
*
IF L-#B4-7676 LT R-#F-8355
	WRITE (1) NOTITLE 'TEST-573: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#F-8355 ' R-#F-8355
ELSE
	WRITE (1) NOTITLE 'TEST-573: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#F-8355 ' R-#F-8355
END-IF
*
IF L-#B4-7676 GE R-#F-8355
	WRITE (1) NOTITLE 'TEST-574: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#F-8355 ' R-#F-8355
ELSE
	WRITE (1) NOTITLE 'TEST-574: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#F-8355 ' R-#F-8355
END-IF
*
IF L-#B4-7676 GT R-#F-8355
	WRITE (1) NOTITLE 'TEST-575: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#F-8355 ' R-#F-8355
ELSE
	WRITE (1) NOTITLE 'TEST-575: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#F-8355 ' R-#F-8355
END-IF
*
IF L-#B4-7676 LE R-#F-8355
	WRITE (1) NOTITLE 'TEST-576: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#F-8355 ' R-#F-8355
ELSE
	WRITE (1) NOTITLE 'TEST-576: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#F-8355 ' R-#F-8355
END-IF
*
IF L-#B4-7676 EQ R-#I-7676
	WRITE (1) NOTITLE 'TEST-577: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#I-7676 ' R-#I-7676 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-577: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#I-7676 ' R-#I-7676 (EM=9999)
END-IF
*
IF L-#B4-7676 NE R-#I-7676
	WRITE (1) NOTITLE 'TEST-578: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#I-7676 ' R-#I-7676 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-578: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#I-7676 ' R-#I-7676 (EM=9999)
END-IF
*
IF L-#B4-7676 LT R-#I-7676
	WRITE (1) NOTITLE 'TEST-579: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#I-7676 ' R-#I-7676 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-579: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#I-7676 ' R-#I-7676 (EM=9999)
END-IF
*
IF L-#B4-7676 GE R-#I-7676
	WRITE (1) NOTITLE 'TEST-580: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#I-7676 ' R-#I-7676 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-580: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#I-7676 ' R-#I-7676 (EM=9999)
END-IF
*
IF L-#B4-7676 GT R-#I-7676
	WRITE (1) NOTITLE 'TEST-581: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#I-7676 ' R-#I-7676 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-581: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#I-7676 ' R-#I-7676 (EM=9999)
END-IF
*
IF L-#B4-7676 LE R-#I-7676
	WRITE (1) NOTITLE 'TEST-582: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#I-7676 ' R-#I-7676 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-582: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#I-7676 ' R-#I-7676 (EM=9999)
END-IF
*
IF L-#B4-7676 EQ R-#A1-H20
	WRITE (1) NOTITLE 'TEST-583: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#A1-H20 ' R-#A1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-583: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#A1-H20 ' R-#A1-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#A1-H20
	WRITE (1) NOTITLE 'TEST-584: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#A1-H20 ' R-#A1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-584: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#A1-H20 ' R-#A1-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#A1-H20
	WRITE (1) NOTITLE 'TEST-585: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#A1-H20 ' R-#A1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-585: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#A1-H20 ' R-#A1-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#A1-H20
	WRITE (1) NOTITLE 'TEST-586: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#A1-H20 ' R-#A1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-586: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#A1-H20 ' R-#A1-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#A1-H20
	WRITE (1) NOTITLE 'TEST-587: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#A1-H20 ' R-#A1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-587: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#A1-H20 ' R-#A1-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#A1-H20
	WRITE (1) NOTITLE 'TEST-588: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#A1-H20 ' R-#A1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-588: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#A1-H20 ' R-#A1-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#D-8355
	WRITE (1) NOTITLE 'TEST-589: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#D-8355 ' R-#D-8355 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-589: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#D-8355 ' R-#D-8355 (EM=XXXX)
END-IF
*
IF L-#B4-7676 NE R-#D-8355
	WRITE (1) NOTITLE 'TEST-590: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#D-8355 ' R-#D-8355 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-590: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#D-8355 ' R-#D-8355 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LT R-#D-8355
	WRITE (1) NOTITLE 'TEST-591: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#D-8355 ' R-#D-8355 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-591: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#D-8355 ' R-#D-8355 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GE R-#D-8355
	WRITE (1) NOTITLE 'TEST-592: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#D-8355 ' R-#D-8355 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-592: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#D-8355 ' R-#D-8355 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GT R-#D-8355
	WRITE (1) NOTITLE 'TEST-593: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#D-8355 ' R-#D-8355 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-593: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#D-8355 ' R-#D-8355 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LE R-#D-8355
	WRITE (1) NOTITLE 'TEST-594: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#D-8355 ' R-#D-8355 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-594: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#D-8355 ' R-#D-8355 (EM=XXXX)
END-IF
*
IF L-#B4-7676 EQ R-#B4-2765
	WRITE (1) NOTITLE 'TEST-595: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-595: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
END-IF
*
IF L-#B4-7676 NE R-#B4-2765
	WRITE (1) NOTITLE 'TEST-596: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-596: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LT R-#B4-2765
	WRITE (1) NOTITLE 'TEST-597: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-597: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GE R-#B4-2765
	WRITE (1) NOTITLE 'TEST-598: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-598: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GT R-#B4-2765
	WRITE (1) NOTITLE 'TEST-599: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-599: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LE R-#B4-2765
	WRITE (1) NOTITLE 'TEST-600: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-600: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B4-2765 ' R-#B4-2765 (EM=XXXX)
END-IF
*
IF L-#B4-7676 EQ R-#A4-4
	WRITE (1) NOTITLE 'TEST-601: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#A4-4 ' R-#A4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-601: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#A4-4 ' R-#A4-4 (EM=X)
END-IF
*
IF L-#B4-7676 NE R-#A4-4
	WRITE (1) NOTITLE 'TEST-602: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#A4-4 ' R-#A4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-602: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#A4-4 ' R-#A4-4 (EM=X)
END-IF
*
IF L-#B4-7676 LT R-#A4-4
	WRITE (1) NOTITLE 'TEST-603: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#A4-4 ' R-#A4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-603: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#A4-4 ' R-#A4-4 (EM=X)
END-IF
*
IF L-#B4-7676 GE R-#A4-4
	WRITE (1) NOTITLE 'TEST-604: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#A4-4 ' R-#A4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-604: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#A4-4 ' R-#A4-4 (EM=X)
END-IF
*
IF L-#B4-7676 GT R-#A4-4
	WRITE (1) NOTITLE 'TEST-605: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#A4-4 ' R-#A4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-605: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#A4-4 ' R-#A4-4 (EM=X)
END-IF
*
IF L-#B4-7676 LE R-#A4-4
	WRITE (1) NOTITLE 'TEST-606: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#A4-4 ' R-#A4-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-606: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#A4-4 ' R-#A4-4 (EM=X)
END-IF
*
IF L-#B4-7676 EQ R-#F-1234
	WRITE (1) NOTITLE 'TEST-607: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#F-1234 ' R-#F-1234
ELSE
	WRITE (1) NOTITLE 'TEST-607: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#F-1234 ' R-#F-1234
END-IF
*
IF L-#B4-7676 NE R-#F-1234
	WRITE (1) NOTITLE 'TEST-608: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#F-1234 ' R-#F-1234
ELSE
	WRITE (1) NOTITLE 'TEST-608: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#F-1234 ' R-#F-1234
END-IF
*
IF L-#B4-7676 LT R-#F-1234
	WRITE (1) NOTITLE 'TEST-609: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#F-1234 ' R-#F-1234
ELSE
	WRITE (1) NOTITLE 'TEST-609: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#F-1234 ' R-#F-1234
END-IF
*
IF L-#B4-7676 GE R-#F-1234
	WRITE (1) NOTITLE 'TEST-610: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#F-1234 ' R-#F-1234
ELSE
	WRITE (1) NOTITLE 'TEST-610: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#F-1234 ' R-#F-1234
END-IF
*
IF L-#B4-7676 GT R-#F-1234
	WRITE (1) NOTITLE 'TEST-611: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#F-1234 ' R-#F-1234
ELSE
	WRITE (1) NOTITLE 'TEST-611: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#F-1234 ' R-#F-1234
END-IF
*
IF L-#B4-7676 LE R-#F-1234
	WRITE (1) NOTITLE 'TEST-612: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#F-1234 ' R-#F-1234
ELSE
	WRITE (1) NOTITLE 'TEST-612: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#F-1234 ' R-#F-1234
END-IF
*
IF L-#B4-7676 EQ R-#F-2765
	WRITE (1) NOTITLE 'TEST-613: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#F-2765 ' R-#F-2765
ELSE
	WRITE (1) NOTITLE 'TEST-613: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#F-2765 ' R-#F-2765
END-IF
*
IF L-#B4-7676 NE R-#F-2765
	WRITE (1) NOTITLE 'TEST-614: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#F-2765 ' R-#F-2765
ELSE
	WRITE (1) NOTITLE 'TEST-614: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#F-2765 ' R-#F-2765
END-IF
*
IF L-#B4-7676 LT R-#F-2765
	WRITE (1) NOTITLE 'TEST-615: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#F-2765 ' R-#F-2765
ELSE
	WRITE (1) NOTITLE 'TEST-615: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#F-2765 ' R-#F-2765
END-IF
*
IF L-#B4-7676 GE R-#F-2765
	WRITE (1) NOTITLE 'TEST-616: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#F-2765 ' R-#F-2765
ELSE
	WRITE (1) NOTITLE 'TEST-616: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#F-2765 ' R-#F-2765
END-IF
*
IF L-#B4-7676 GT R-#F-2765
	WRITE (1) NOTITLE 'TEST-617: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#F-2765 ' R-#F-2765
ELSE
	WRITE (1) NOTITLE 'TEST-617: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#F-2765 ' R-#F-2765
END-IF
*
IF L-#B4-7676 LE R-#F-2765
	WRITE (1) NOTITLE 'TEST-618: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#F-2765 ' R-#F-2765
ELSE
	WRITE (1) NOTITLE 'TEST-618: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#F-2765 ' R-#F-2765
END-IF
*
IF L-#B4-7676 EQ R-#B8-4
	WRITE (1) NOTITLE 'TEST-619: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B8-4 ' R-#B8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-619: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B8-4 ' R-#B8-4 (EM=X)
END-IF
*
IF L-#B4-7676 NE R-#B8-4
	WRITE (1) NOTITLE 'TEST-620: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B8-4 ' R-#B8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-620: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B8-4 ' R-#B8-4 (EM=X)
END-IF
*
IF L-#B4-7676 LT R-#B8-4
	WRITE (1) NOTITLE 'TEST-621: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B8-4 ' R-#B8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-621: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B8-4 ' R-#B8-4 (EM=X)
END-IF
*
IF L-#B4-7676 GE R-#B8-4
	WRITE (1) NOTITLE 'TEST-622: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B8-4 ' R-#B8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-622: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B8-4 ' R-#B8-4 (EM=X)
END-IF
*
IF L-#B4-7676 GT R-#B8-4
	WRITE (1) NOTITLE 'TEST-623: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B8-4 ' R-#B8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-623: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B8-4 ' R-#B8-4 (EM=X)
END-IF
*
IF L-#B4-7676 LE R-#B8-4
	WRITE (1) NOTITLE 'TEST-624: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B8-4 ' R-#B8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-624: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B8-4 ' R-#B8-4 (EM=X)
END-IF
*
IF L-#B4-7676 EQ R-#N-4
	WRITE (1) NOTITLE 'TEST-625: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#N-4 ' R-#N-4 (EM=9)
ELSE
	WRITE (1) NOTITLE 'TEST-625: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#N-4 ' R-#N-4 (EM=9)
END-IF
*
IF L-#B4-7676 NE R-#N-4
	WRITE (1) NOTITLE 'TEST-626: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#N-4 ' R-#N-4 (EM=9)
ELSE
	WRITE (1) NOTITLE 'TEST-626: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#N-4 ' R-#N-4 (EM=9)
END-IF
*
IF L-#B4-7676 LT R-#N-4
	WRITE (1) NOTITLE 'TEST-627: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#N-4 ' R-#N-4 (EM=9)
ELSE
	WRITE (1) NOTITLE 'TEST-627: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#N-4 ' R-#N-4 (EM=9)
END-IF
*
IF L-#B4-7676 GE R-#N-4
	WRITE (1) NOTITLE 'TEST-628: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#N-4 ' R-#N-4 (EM=9)
ELSE
	WRITE (1) NOTITLE 'TEST-628: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#N-4 ' R-#N-4 (EM=9)
END-IF
*
IF L-#B4-7676 GT R-#N-4
	WRITE (1) NOTITLE 'TEST-629: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#N-4 ' R-#N-4 (EM=9)
ELSE
	WRITE (1) NOTITLE 'TEST-629: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#N-4 ' R-#N-4 (EM=9)
END-IF
*
IF L-#B4-7676 LE R-#N-4
	WRITE (1) NOTITLE 'TEST-630: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#N-4 ' R-#N-4 (EM=9)
ELSE
	WRITE (1) NOTITLE 'TEST-630: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#N-4 ' R-#N-4 (EM=9)
END-IF
*
IF L-#B4-7676 EQ R-#B8-H10
	WRITE (1) NOTITLE 'TEST-631: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B8-H10 ' R-#B8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-631: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B8-H10 ' R-#B8-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#B8-H10
	WRITE (1) NOTITLE 'TEST-632: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B8-H10 ' R-#B8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-632: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B8-H10 ' R-#B8-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#B8-H10
	WRITE (1) NOTITLE 'TEST-633: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B8-H10 ' R-#B8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-633: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B8-H10 ' R-#B8-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#B8-H10
	WRITE (1) NOTITLE 'TEST-634: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B8-H10 ' R-#B8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-634: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B8-H10 ' R-#B8-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#B8-H10
	WRITE (1) NOTITLE 'TEST-635: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B8-H10 ' R-#B8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-635: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B8-H10 ' R-#B8-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#B8-H10
	WRITE (1) NOTITLE 'TEST-636: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B8-H10 ' R-#B8-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-636: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B8-H10 ' R-#B8-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#A4-H10
	WRITE (1) NOTITLE 'TEST-637: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#A4-H10 ' R-#A4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-637: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#A4-H10 ' R-#A4-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#A4-H10
	WRITE (1) NOTITLE 'TEST-638: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#A4-H10 ' R-#A4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-638: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#A4-H10 ' R-#A4-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#A4-H10
	WRITE (1) NOTITLE 'TEST-639: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#A4-H10 ' R-#A4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-639: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#A4-H10 ' R-#A4-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#A4-H10
	WRITE (1) NOTITLE 'TEST-640: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#A4-H10 ' R-#A4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-640: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#A4-H10 ' R-#A4-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#A4-H10
	WRITE (1) NOTITLE 'TEST-641: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#A4-H10 ' R-#A4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-641: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#A4-H10 ' R-#A4-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#A4-H10
	WRITE (1) NOTITLE 'TEST-642: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#A4-H10 ' R-#A4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-642: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#A4-H10 ' R-#A4-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#A1-4
	WRITE (1) NOTITLE 'TEST-643: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#A1-4 ' R-#A1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-643: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#A1-4 ' R-#A1-4 (EM=X)
END-IF
*
IF L-#B4-7676 NE R-#A1-4
	WRITE (1) NOTITLE 'TEST-644: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#A1-4 ' R-#A1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-644: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#A1-4 ' R-#A1-4 (EM=X)
END-IF
*
IF L-#B4-7676 LT R-#A1-4
	WRITE (1) NOTITLE 'TEST-645: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#A1-4 ' R-#A1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-645: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#A1-4 ' R-#A1-4 (EM=X)
END-IF
*
IF L-#B4-7676 GE R-#A1-4
	WRITE (1) NOTITLE 'TEST-646: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#A1-4 ' R-#A1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-646: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#A1-4 ' R-#A1-4 (EM=X)
END-IF
*
IF L-#B4-7676 GT R-#A1-4
	WRITE (1) NOTITLE 'TEST-647: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#A1-4 ' R-#A1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-647: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#A1-4 ' R-#A1-4 (EM=X)
END-IF
*
IF L-#B4-7676 LE R-#A1-4
	WRITE (1) NOTITLE 'TEST-648: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#A1-4 ' R-#A1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-648: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#A1-4 ' R-#A1-4 (EM=X)
END-IF
*
IF L-#B4-7676 EQ R-#B4-7676
	WRITE (1) NOTITLE 'TEST-649: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-649: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
END-IF
*
IF L-#B4-7676 NE R-#B4-7676
	WRITE (1) NOTITLE 'TEST-650: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-650: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LT R-#B4-7676
	WRITE (1) NOTITLE 'TEST-651: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-651: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GE R-#B4-7676
	WRITE (1) NOTITLE 'TEST-652: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-652: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GT R-#B4-7676
	WRITE (1) NOTITLE 'TEST-653: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-653: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LE R-#B4-7676
	WRITE (1) NOTITLE 'TEST-654: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-654: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B4-7676 ' R-#B4-7676 (EM=XXXX)
END-IF
*
IF L-#B4-7676 EQ R-#B1-H20
	WRITE (1) NOTITLE 'TEST-655: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B1-H20 ' R-#B1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-655: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B1-H20 ' R-#B1-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#B1-H20
	WRITE (1) NOTITLE 'TEST-656: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B1-H20 ' R-#B1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-656: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B1-H20 ' R-#B1-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#B1-H20
	WRITE (1) NOTITLE 'TEST-657: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B1-H20 ' R-#B1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-657: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B1-H20 ' R-#B1-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#B1-H20
	WRITE (1) NOTITLE 'TEST-658: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B1-H20 ' R-#B1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-658: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B1-H20 ' R-#B1-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#B1-H20
	WRITE (1) NOTITLE 'TEST-659: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B1-H20 ' R-#B1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-659: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B1-H20 ' R-#B1-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#B1-H20
	WRITE (1) NOTITLE 'TEST-660: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B1-H20 ' R-#B1-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-660: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B1-H20 ' R-#B1-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#N-8355
	WRITE (1) NOTITLE 'TEST-661: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#N-8355 ' R-#N-8355 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-661: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#N-8355 ' R-#N-8355 (EM=9999)
END-IF
*
IF L-#B4-7676 NE R-#N-8355
	WRITE (1) NOTITLE 'TEST-662: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#N-8355 ' R-#N-8355 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-662: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#N-8355 ' R-#N-8355 (EM=9999)
END-IF
*
IF L-#B4-7676 LT R-#N-8355
	WRITE (1) NOTITLE 'TEST-663: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#N-8355 ' R-#N-8355 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-663: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#N-8355 ' R-#N-8355 (EM=9999)
END-IF
*
IF L-#B4-7676 GE R-#N-8355
	WRITE (1) NOTITLE 'TEST-664: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#N-8355 ' R-#N-8355 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-664: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#N-8355 ' R-#N-8355 (EM=9999)
END-IF
*
IF L-#B4-7676 GT R-#N-8355
	WRITE (1) NOTITLE 'TEST-665: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#N-8355 ' R-#N-8355 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-665: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#N-8355 ' R-#N-8355 (EM=9999)
END-IF
*
IF L-#B4-7676 LE R-#N-8355
	WRITE (1) NOTITLE 'TEST-666: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#N-8355 ' R-#N-8355 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-666: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#N-8355 ' R-#N-8355 (EM=9999)
END-IF
*
IF L-#B4-7676 EQ R-#I-8355
	WRITE (1) NOTITLE 'TEST-667: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#I-8355 ' R-#I-8355 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-667: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#I-8355 ' R-#I-8355 (EM=9999)
END-IF
*
IF L-#B4-7676 NE R-#I-8355
	WRITE (1) NOTITLE 'TEST-668: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#I-8355 ' R-#I-8355 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-668: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#I-8355 ' R-#I-8355 (EM=9999)
END-IF
*
IF L-#B4-7676 LT R-#I-8355
	WRITE (1) NOTITLE 'TEST-669: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#I-8355 ' R-#I-8355 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-669: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#I-8355 ' R-#I-8355 (EM=9999)
END-IF
*
IF L-#B4-7676 GE R-#I-8355
	WRITE (1) NOTITLE 'TEST-670: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#I-8355 ' R-#I-8355 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-670: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#I-8355 ' R-#I-8355 (EM=9999)
END-IF
*
IF L-#B4-7676 GT R-#I-8355
	WRITE (1) NOTITLE 'TEST-671: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#I-8355 ' R-#I-8355 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-671: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#I-8355 ' R-#I-8355 (EM=9999)
END-IF
*
IF L-#B4-7676 LE R-#I-8355
	WRITE (1) NOTITLE 'TEST-672: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#I-8355 ' R-#I-8355 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-672: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#I-8355 ' R-#I-8355 (EM=9999)
END-IF
*
IF L-#B4-7676 EQ R-#B1-H10
	WRITE (1) NOTITLE 'TEST-673: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B1-H10 ' R-#B1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-673: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B1-H10 ' R-#B1-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#B1-H10
	WRITE (1) NOTITLE 'TEST-674: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B1-H10 ' R-#B1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-674: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B1-H10 ' R-#B1-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#B1-H10
	WRITE (1) NOTITLE 'TEST-675: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B1-H10 ' R-#B1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-675: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B1-H10 ' R-#B1-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#B1-H10
	WRITE (1) NOTITLE 'TEST-676: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B1-H10 ' R-#B1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-676: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B1-H10 ' R-#B1-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#B1-H10
	WRITE (1) NOTITLE 'TEST-677: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B1-H10 ' R-#B1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-677: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B1-H10 ' R-#B1-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#B1-H10
	WRITE (1) NOTITLE 'TEST-678: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B1-H10 ' R-#B1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-678: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B1-H10 ' R-#B1-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#A8-H20
	WRITE (1) NOTITLE 'TEST-679: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#A8-H20 ' R-#A8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-679: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#A8-H20 ' R-#A8-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#A8-H20
	WRITE (1) NOTITLE 'TEST-680: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#A8-H20 ' R-#A8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-680: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#A8-H20 ' R-#A8-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#A8-H20
	WRITE (1) NOTITLE 'TEST-681: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#A8-H20 ' R-#A8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-681: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#A8-H20 ' R-#A8-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#A8-H20
	WRITE (1) NOTITLE 'TEST-682: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#A8-H20 ' R-#A8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-682: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#A8-H20 ' R-#A8-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#A8-H20
	WRITE (1) NOTITLE 'TEST-683: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#A8-H20 ' R-#A8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-683: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#A8-H20 ' R-#A8-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#A8-H20
	WRITE (1) NOTITLE 'TEST-684: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#A8-H20 ' R-#A8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-684: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#A8-H20 ' R-#A8-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#D-4
	WRITE (1) NOTITLE 'TEST-685: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#D-4 ' R-#D-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-685: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#D-4 ' R-#D-4 (EM=X)
END-IF
*
IF L-#B4-7676 NE R-#D-4
	WRITE (1) NOTITLE 'TEST-686: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#D-4 ' R-#D-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-686: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#D-4 ' R-#D-4 (EM=X)
END-IF
*
IF L-#B4-7676 LT R-#D-4
	WRITE (1) NOTITLE 'TEST-687: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#D-4 ' R-#D-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-687: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#D-4 ' R-#D-4 (EM=X)
END-IF
*
IF L-#B4-7676 GE R-#D-4
	WRITE (1) NOTITLE 'TEST-688: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#D-4 ' R-#D-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-688: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#D-4 ' R-#D-4 (EM=X)
END-IF
*
IF L-#B4-7676 GT R-#D-4
	WRITE (1) NOTITLE 'TEST-689: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#D-4 ' R-#D-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-689: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#D-4 ' R-#D-4 (EM=X)
END-IF
*
IF L-#B4-7676 LE R-#D-4
	WRITE (1) NOTITLE 'TEST-690: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#D-4 ' R-#D-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-690: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#D-4 ' R-#D-4 (EM=X)
END-IF
*
IF L-#B4-7676 EQ R-#B4-H10
	WRITE (1) NOTITLE 'TEST-691: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B4-H10 ' R-#B4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-691: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B4-H10 ' R-#B4-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#B4-H10
	WRITE (1) NOTITLE 'TEST-692: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B4-H10 ' R-#B4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-692: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B4-H10 ' R-#B4-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#B4-H10
	WRITE (1) NOTITLE 'TEST-693: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B4-H10 ' R-#B4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-693: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B4-H10 ' R-#B4-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#B4-H10
	WRITE (1) NOTITLE 'TEST-694: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B4-H10 ' R-#B4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-694: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B4-H10 ' R-#B4-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#B4-H10
	WRITE (1) NOTITLE 'TEST-695: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B4-H10 ' R-#B4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-695: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B4-H10 ' R-#B4-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#B4-H10
	WRITE (1) NOTITLE 'TEST-696: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B4-H10 ' R-#B4-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-696: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B4-H10 ' R-#B4-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#A1-H10
	WRITE (1) NOTITLE 'TEST-697: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#A1-H10 ' R-#A1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-697: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#A1-H10 ' R-#A1-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#A1-H10
	WRITE (1) NOTITLE 'TEST-698: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#A1-H10 ' R-#A1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-698: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#A1-H10 ' R-#A1-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#A1-H10
	WRITE (1) NOTITLE 'TEST-699: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#A1-H10 ' R-#A1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-699: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#A1-H10 ' R-#A1-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#A1-H10
	WRITE (1) NOTITLE 'TEST-700: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#A1-H10 ' R-#A1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-700: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#A1-H10 ' R-#A1-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#A1-H10
	WRITE (1) NOTITLE 'TEST-701: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#A1-H10 ' R-#A1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-701: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#A1-H10 ' R-#A1-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#A1-H10
	WRITE (1) NOTITLE 'TEST-702: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#A1-H10 ' R-#A1-H10 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-702: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#A1-H10 ' R-#A1-H10 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#A8-H00
	WRITE (1) NOTITLE 'TEST-703: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#A8-H00 ' R-#A8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-703: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#A8-H00 ' R-#A8-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#A8-H00
	WRITE (1) NOTITLE 'TEST-704: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#A8-H00 ' R-#A8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-704: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#A8-H00 ' R-#A8-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#A8-H00
	WRITE (1) NOTITLE 'TEST-705: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#A8-H00 ' R-#A8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-705: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#A8-H00 ' R-#A8-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#A8-H00
	WRITE (1) NOTITLE 'TEST-706: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#A8-H00 ' R-#A8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-706: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#A8-H00 ' R-#A8-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#A8-H00
	WRITE (1) NOTITLE 'TEST-707: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#A8-H00 ' R-#A8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-707: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#A8-H00 ' R-#A8-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#A8-H00
	WRITE (1) NOTITLE 'TEST-708: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#A8-H00 ' R-#A8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-708: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#A8-H00 ' R-#A8-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#F-7676
	WRITE (1) NOTITLE 'TEST-709: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#F-7676 ' R-#F-7676
ELSE
	WRITE (1) NOTITLE 'TEST-709: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#F-7676 ' R-#F-7676
END-IF
*
IF L-#B4-7676 NE R-#F-7676
	WRITE (1) NOTITLE 'TEST-710: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#F-7676 ' R-#F-7676
ELSE
	WRITE (1) NOTITLE 'TEST-710: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#F-7676 ' R-#F-7676
END-IF
*
IF L-#B4-7676 LT R-#F-7676
	WRITE (1) NOTITLE 'TEST-711: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#F-7676 ' R-#F-7676
ELSE
	WRITE (1) NOTITLE 'TEST-711: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#F-7676 ' R-#F-7676
END-IF
*
IF L-#B4-7676 GE R-#F-7676
	WRITE (1) NOTITLE 'TEST-712: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#F-7676 ' R-#F-7676
ELSE
	WRITE (1) NOTITLE 'TEST-712: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#F-7676 ' R-#F-7676
END-IF
*
IF L-#B4-7676 GT R-#F-7676
	WRITE (1) NOTITLE 'TEST-713: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#F-7676 ' R-#F-7676
ELSE
	WRITE (1) NOTITLE 'TEST-713: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#F-7676 ' R-#F-7676
END-IF
*
IF L-#B4-7676 LE R-#F-7676
	WRITE (1) NOTITLE 'TEST-714: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#F-7676 ' R-#F-7676
ELSE
	WRITE (1) NOTITLE 'TEST-714: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#F-7676 ' R-#F-7676
END-IF
*
IF L-#B4-7676 EQ R-#B8-H00
	WRITE (1) NOTITLE 'TEST-715: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B8-H00 ' R-#B8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-715: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B8-H00 ' R-#B8-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#B8-H00
	WRITE (1) NOTITLE 'TEST-716: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B8-H00 ' R-#B8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-716: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B8-H00 ' R-#B8-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#B8-H00
	WRITE (1) NOTITLE 'TEST-717: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B8-H00 ' R-#B8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-717: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B8-H00 ' R-#B8-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#B8-H00
	WRITE (1) NOTITLE 'TEST-718: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B8-H00 ' R-#B8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-718: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B8-H00 ' R-#B8-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#B8-H00
	WRITE (1) NOTITLE 'TEST-719: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B8-H00 ' R-#B8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-719: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B8-H00 ' R-#B8-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#B8-H00
	WRITE (1) NOTITLE 'TEST-720: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B8-H00 ' R-#B8-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-720: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B8-H00 ' R-#B8-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#D-7676
	WRITE (1) NOTITLE 'TEST-721: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#D-7676 ' R-#D-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-721: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#D-7676 ' R-#D-7676 (EM=XXXX)
END-IF
*
IF L-#B4-7676 NE R-#D-7676
	WRITE (1) NOTITLE 'TEST-722: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#D-7676 ' R-#D-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-722: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#D-7676 ' R-#D-7676 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LT R-#D-7676
	WRITE (1) NOTITLE 'TEST-723: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#D-7676 ' R-#D-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-723: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#D-7676 ' R-#D-7676 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GE R-#D-7676
	WRITE (1) NOTITLE 'TEST-724: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#D-7676 ' R-#D-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-724: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#D-7676 ' R-#D-7676 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GT R-#D-7676
	WRITE (1) NOTITLE 'TEST-725: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#D-7676 ' R-#D-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-725: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#D-7676 ' R-#D-7676 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LE R-#D-7676
	WRITE (1) NOTITLE 'TEST-726: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#D-7676 ' R-#D-7676 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-726: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#D-7676 ' R-#D-7676 (EM=XXXX)
END-IF
*
IF L-#B4-7676 EQ R-#N-76761234
	WRITE (1) NOTITLE 'TEST-727: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#N-76761234 ' R-#N-76761234 (EM=999999999)
ELSE
	WRITE (1) NOTITLE 'TEST-727: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#N-76761234 ' R-#N-76761234 (EM=999999999)
END-IF
*
IF L-#B4-7676 NE R-#N-76761234
	WRITE (1) NOTITLE 'TEST-728: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#N-76761234 ' R-#N-76761234 (EM=999999999)
ELSE
	WRITE (1) NOTITLE 'TEST-728: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#N-76761234 ' R-#N-76761234 (EM=999999999)
END-IF
*
IF L-#B4-7676 LT R-#N-76761234
	WRITE (1) NOTITLE 'TEST-729: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#N-76761234 ' R-#N-76761234 (EM=999999999)
ELSE
	WRITE (1) NOTITLE 'TEST-729: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#N-76761234 ' R-#N-76761234 (EM=999999999)
END-IF
*
IF L-#B4-7676 GE R-#N-76761234
	WRITE (1) NOTITLE 'TEST-730: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#N-76761234 ' R-#N-76761234 (EM=999999999)
ELSE
	WRITE (1) NOTITLE 'TEST-730: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#N-76761234 ' R-#N-76761234 (EM=999999999)
END-IF
*
IF L-#B4-7676 GT R-#N-76761234
	WRITE (1) NOTITLE 'TEST-731: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#N-76761234 ' R-#N-76761234 (EM=999999999)
ELSE
	WRITE (1) NOTITLE 'TEST-731: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#N-76761234 ' R-#N-76761234 (EM=999999999)
END-IF
*
IF L-#B4-7676 LE R-#N-76761234
	WRITE (1) NOTITLE 'TEST-732: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#N-76761234 ' R-#N-76761234 (EM=999999999)
ELSE
	WRITE (1) NOTITLE 'TEST-732: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#N-76761234 ' R-#N-76761234 (EM=999999999)
END-IF
*
IF L-#B4-7676 EQ R-#B1-4
	WRITE (1) NOTITLE 'TEST-733: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B1-4 ' R-#B1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-733: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B1-4 ' R-#B1-4 (EM=X)
END-IF
*
IF L-#B4-7676 NE R-#B1-4
	WRITE (1) NOTITLE 'TEST-734: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B1-4 ' R-#B1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-734: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B1-4 ' R-#B1-4 (EM=X)
END-IF
*
IF L-#B4-7676 LT R-#B1-4
	WRITE (1) NOTITLE 'TEST-735: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B1-4 ' R-#B1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-735: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B1-4 ' R-#B1-4 (EM=X)
END-IF
*
IF L-#B4-7676 GE R-#B1-4
	WRITE (1) NOTITLE 'TEST-736: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B1-4 ' R-#B1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-736: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B1-4 ' R-#B1-4 (EM=X)
END-IF
*
IF L-#B4-7676 GT R-#B1-4
	WRITE (1) NOTITLE 'TEST-737: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B1-4 ' R-#B1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-737: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B1-4 ' R-#B1-4 (EM=X)
END-IF
*
IF L-#B4-7676 LE R-#B1-4
	WRITE (1) NOTITLE 'TEST-738: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B1-4 ' R-#B1-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-738: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B1-4 ' R-#B1-4 (EM=X)
END-IF
*
IF L-#B4-7676 EQ R-#I-2765
	WRITE (1) NOTITLE 'TEST-739: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#I-2765 ' R-#I-2765 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-739: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#I-2765 ' R-#I-2765 (EM=9999)
END-IF
*
IF L-#B4-7676 NE R-#I-2765
	WRITE (1) NOTITLE 'TEST-740: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#I-2765 ' R-#I-2765 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-740: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#I-2765 ' R-#I-2765 (EM=9999)
END-IF
*
IF L-#B4-7676 LT R-#I-2765
	WRITE (1) NOTITLE 'TEST-741: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#I-2765 ' R-#I-2765 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-741: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#I-2765 ' R-#I-2765 (EM=9999)
END-IF
*
IF L-#B4-7676 GE R-#I-2765
	WRITE (1) NOTITLE 'TEST-742: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#I-2765 ' R-#I-2765 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-742: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#I-2765 ' R-#I-2765 (EM=9999)
END-IF
*
IF L-#B4-7676 GT R-#I-2765
	WRITE (1) NOTITLE 'TEST-743: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#I-2765 ' R-#I-2765 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-743: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#I-2765 ' R-#I-2765 (EM=9999)
END-IF
*
IF L-#B4-7676 LE R-#I-2765
	WRITE (1) NOTITLE 'TEST-744: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#I-2765 ' R-#I-2765 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-744: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#I-2765 ' R-#I-2765 (EM=9999)
END-IF
*
IF L-#B4-7676 EQ R-#D-1234
	WRITE (1) NOTITLE 'TEST-745: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#D-1234 ' R-#D-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-745: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#D-1234 ' R-#D-1234 (EM=XXXX)
END-IF
*
IF L-#B4-7676 NE R-#D-1234
	WRITE (1) NOTITLE 'TEST-746: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#D-1234 ' R-#D-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-746: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#D-1234 ' R-#D-1234 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LT R-#D-1234
	WRITE (1) NOTITLE 'TEST-747: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#D-1234 ' R-#D-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-747: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#D-1234 ' R-#D-1234 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GE R-#D-1234
	WRITE (1) NOTITLE 'TEST-748: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#D-1234 ' R-#D-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-748: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#D-1234 ' R-#D-1234 (EM=XXXX)
END-IF
*
IF L-#B4-7676 GT R-#D-1234
	WRITE (1) NOTITLE 'TEST-749: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#D-1234 ' R-#D-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-749: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#D-1234 ' R-#D-1234 (EM=XXXX)
END-IF
*
IF L-#B4-7676 LE R-#D-1234
	WRITE (1) NOTITLE 'TEST-750: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#D-1234 ' R-#D-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-750: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#D-1234 ' R-#D-1234 (EM=XXXX)
END-IF
*
IF L-#B4-7676 EQ R-#I-1234
	WRITE (1) NOTITLE 'TEST-751: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#I-1234 ' R-#I-1234 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-751: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#I-1234 ' R-#I-1234 (EM=9999)
END-IF
*
IF L-#B4-7676 NE R-#I-1234
	WRITE (1) NOTITLE 'TEST-752: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#I-1234 ' R-#I-1234 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-752: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#I-1234 ' R-#I-1234 (EM=9999)
END-IF
*
IF L-#B4-7676 LT R-#I-1234
	WRITE (1) NOTITLE 'TEST-753: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#I-1234 ' R-#I-1234 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-753: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#I-1234 ' R-#I-1234 (EM=9999)
END-IF
*
IF L-#B4-7676 GE R-#I-1234
	WRITE (1) NOTITLE 'TEST-754: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#I-1234 ' R-#I-1234 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-754: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#I-1234 ' R-#I-1234 (EM=9999)
END-IF
*
IF L-#B4-7676 GT R-#I-1234
	WRITE (1) NOTITLE 'TEST-755: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#I-1234 ' R-#I-1234 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-755: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#I-1234 ' R-#I-1234 (EM=9999)
END-IF
*
IF L-#B4-7676 LE R-#I-1234
	WRITE (1) NOTITLE 'TEST-756: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#I-1234 ' R-#I-1234 (EM=9999)
ELSE
	WRITE (1) NOTITLE 'TEST-756: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#I-1234 ' R-#I-1234 (EM=9999)
END-IF
*
IF L-#B4-7676 EQ R-#B8-H20
	WRITE (1) NOTITLE 'TEST-757: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#B8-H20 ' R-#B8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-757: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#B8-H20 ' R-#B8-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#B8-H20
	WRITE (1) NOTITLE 'TEST-758: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#B8-H20 ' R-#B8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-758: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#B8-H20 ' R-#B8-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#B8-H20
	WRITE (1) NOTITLE 'TEST-759: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#B8-H20 ' R-#B8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-759: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#B8-H20 ' R-#B8-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#B8-H20
	WRITE (1) NOTITLE 'TEST-760: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#B8-H20 ' R-#B8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-760: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#B8-H20 ' R-#B8-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#B8-H20
	WRITE (1) NOTITLE 'TEST-761: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#B8-H20 ' R-#B8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-761: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#B8-H20 ' R-#B8-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#B8-H20
	WRITE (1) NOTITLE 'TEST-762: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#B8-H20 ' R-#B8-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-762: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#B8-H20 ' R-#B8-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#F-4
	WRITE (1) NOTITLE 'TEST-763: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#F-4 ' R-#F-4
ELSE
	WRITE (1) NOTITLE 'TEST-763: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#F-4 ' R-#F-4
END-IF
*
IF L-#B4-7676 NE R-#F-4
	WRITE (1) NOTITLE 'TEST-764: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#F-4 ' R-#F-4
ELSE
	WRITE (1) NOTITLE 'TEST-764: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#F-4 ' R-#F-4
END-IF
*
IF L-#B4-7676 LT R-#F-4
	WRITE (1) NOTITLE 'TEST-765: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#F-4 ' R-#F-4
ELSE
	WRITE (1) NOTITLE 'TEST-765: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#F-4 ' R-#F-4
END-IF
*
IF L-#B4-7676 GE R-#F-4
	WRITE (1) NOTITLE 'TEST-766: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#F-4 ' R-#F-4
ELSE
	WRITE (1) NOTITLE 'TEST-766: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#F-4 ' R-#F-4
END-IF
*
IF L-#B4-7676 GT R-#F-4
	WRITE (1) NOTITLE 'TEST-767: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#F-4 ' R-#F-4
ELSE
	WRITE (1) NOTITLE 'TEST-767: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#F-4 ' R-#F-4
END-IF
*
IF L-#B4-7676 LE R-#F-4
	WRITE (1) NOTITLE 'TEST-768: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#F-4 ' R-#F-4
ELSE
	WRITE (1) NOTITLE 'TEST-768: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#F-4 ' R-#F-4
END-IF
*
IF L-#B4-7676 EQ R-#I-4
	WRITE (1) NOTITLE 'TEST-769: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#I-4 ' R-#I-4 (EM=9)
ELSE
	WRITE (1) NOTITLE 'TEST-769: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#I-4 ' R-#I-4 (EM=9)
END-IF
*
IF L-#B4-7676 NE R-#I-4
	WRITE (1) NOTITLE 'TEST-770: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#I-4 ' R-#I-4 (EM=9)
ELSE
	WRITE (1) NOTITLE 'TEST-770: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#I-4 ' R-#I-4 (EM=9)
END-IF
*
IF L-#B4-7676 LT R-#I-4
	WRITE (1) NOTITLE 'TEST-771: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#I-4 ' R-#I-4 (EM=9)
ELSE
	WRITE (1) NOTITLE 'TEST-771: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#I-4 ' R-#I-4 (EM=9)
END-IF
*
IF L-#B4-7676 GE R-#I-4
	WRITE (1) NOTITLE 'TEST-772: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#I-4 ' R-#I-4 (EM=9)
ELSE
	WRITE (1) NOTITLE 'TEST-772: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#I-4 ' R-#I-4 (EM=9)
END-IF
*
IF L-#B4-7676 GT R-#I-4
	WRITE (1) NOTITLE 'TEST-773: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#I-4 ' R-#I-4 (EM=9)
ELSE
	WRITE (1) NOTITLE 'TEST-773: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#I-4 ' R-#I-4 (EM=9)
END-IF
*
IF L-#B4-7676 LE R-#I-4
	WRITE (1) NOTITLE 'TEST-774: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#I-4 ' R-#I-4 (EM=9)
ELSE
	WRITE (1) NOTITLE 'TEST-774: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#I-4 ' R-#I-4 (EM=9)
END-IF
*
IF L-#B4-7676 EQ R-#A4-H20
	WRITE (1) NOTITLE 'TEST-775: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#A4-H20 ' R-#A4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-775: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#A4-H20 ' R-#A4-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#A4-H20
	WRITE (1) NOTITLE 'TEST-776: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#A4-H20 ' R-#A4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-776: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#A4-H20 ' R-#A4-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#A4-H20
	WRITE (1) NOTITLE 'TEST-777: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#A4-H20 ' R-#A4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-777: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#A4-H20 ' R-#A4-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#A4-H20
	WRITE (1) NOTITLE 'TEST-778: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#A4-H20 ' R-#A4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-778: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#A4-H20 ' R-#A4-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#A4-H20
	WRITE (1) NOTITLE 'TEST-779: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#A4-H20 ' R-#A4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-779: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#A4-H20 ' R-#A4-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#A4-H20
	WRITE (1) NOTITLE 'TEST-780: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#A4-H20 ' R-#A4-H20 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-780: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#A4-H20 ' R-#A4-H20 (EM=HH)
END-IF
*
IF L-#B4-7676 EQ R-#A4-H00
	WRITE (1) NOTITLE 'TEST-781: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS EQ R-#A4-H00 ' R-#A4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-781: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT EQ R-#A4-H00 ' R-#A4-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 NE R-#A4-H00
	WRITE (1) NOTITLE 'TEST-782: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NE R-#A4-H00 ' R-#A4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-782: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT NE R-#A4-H00 ' R-#A4-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 LT R-#A4-H00
	WRITE (1) NOTITLE 'TEST-783: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LT R-#A4-H00 ' R-#A4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-783: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LT R-#A4-H00 ' R-#A4-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 GE R-#A4-H00
	WRITE (1) NOTITLE 'TEST-784: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GE R-#A4-H00 ' R-#A4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-784: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GE R-#A4-H00 ' R-#A4-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 GT R-#A4-H00
	WRITE (1) NOTITLE 'TEST-785: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS GT R-#A4-H00 ' R-#A4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-785: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT GT R-#A4-H00 ' R-#A4-H00 (EM=HH)
END-IF
*
IF L-#B4-7676 LE R-#A4-H00
	WRITE (1) NOTITLE 'TEST-786: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS LE R-#A4-H00 ' R-#A4-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-786: L-#B4-7676' L-#B4-7676 (EM=XXXX) ' IS NOT LE R-#A4-H00 ' R-#A4-H00 (EM=HH)
END-IF
*
IF L-#B4-2765 EQ R-#B4-1234
	WRITE (1) NOTITLE 'TEST-787: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS EQ R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-787: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT EQ R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
END-IF
*
IF L-#B4-2765 NE R-#B4-1234
	WRITE (1) NOTITLE 'TEST-788: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NE R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-788: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT NE R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
END-IF
*
IF L-#B4-2765 LT R-#B4-1234
	WRITE (1) NOTITLE 'TEST-789: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS LT R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-789: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT LT R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
END-IF
*
IF L-#B4-2765 GE R-#B4-1234
	WRITE (1) NOTITLE 'TEST-790: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS GE R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-790: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT GE R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
END-IF
*
IF L-#B4-2765 GT R-#B4-1234
	WRITE (1) NOTITLE 'TEST-791: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS GT R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-791: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT GT R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
END-IF
*
IF L-#B4-2765 LE R-#B4-1234
	WRITE (1) NOTITLE 'TEST-792: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS LE R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
ELSE
	WRITE (1) NOTITLE 'TEST-792: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT LE R-#B4-1234 ' R-#B4-1234 (EM=XXXX)
END-IF
*
IF L-#B4-2765 EQ R-#A8-4
	WRITE (1) NOTITLE 'TEST-793: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS EQ R-#A8-4 ' R-#A8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-793: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT EQ R-#A8-4 ' R-#A8-4 (EM=X)
END-IF
*
IF L-#B4-2765 NE R-#A8-4
	WRITE (1) NOTITLE 'TEST-794: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NE R-#A8-4 ' R-#A8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-794: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT NE R-#A8-4 ' R-#A8-4 (EM=X)
END-IF
*
IF L-#B4-2765 LT R-#A8-4
	WRITE (1) NOTITLE 'TEST-795: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS LT R-#A8-4 ' R-#A8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-795: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT LT R-#A8-4 ' R-#A8-4 (EM=X)
END-IF
*
IF L-#B4-2765 GE R-#A8-4
	WRITE (1) NOTITLE 'TEST-796: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS GE R-#A8-4 ' R-#A8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-796: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT GE R-#A8-4 ' R-#A8-4 (EM=X)
END-IF
*
IF L-#B4-2765 GT R-#A8-4
	WRITE (1) NOTITLE 'TEST-797: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS GT R-#A8-4 ' R-#A8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-797: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT GT R-#A8-4 ' R-#A8-4 (EM=X)
END-IF
*
IF L-#B4-2765 LE R-#A8-4
	WRITE (1) NOTITLE 'TEST-798: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS LE R-#A8-4 ' R-#A8-4 (EM=X)
ELSE
	WRITE (1) NOTITLE 'TEST-798: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT LE R-#A8-4 ' R-#A8-4 (EM=X)
END-IF
*
IF L-#B4-2765 EQ R-#B1-H00
	WRITE (1) NOTITLE 'TEST-799: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS EQ R-#B1-H00 ' R-#B1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-799: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT EQ R-#B1-H00 ' R-#B1-H00 (EM=HH)
END-IF
*
IF L-#B4-2765 NE R-#B1-H00
	WRITE (1) NOTITLE 'TEST-800: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NE R-#B1-H00 ' R-#B1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-800: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT NE R-#B1-H00 ' R-#B1-H00 (EM=HH)
END-IF
*
IF L-#B4-2765 LT R-#B1-H00
	WRITE (1) NOTITLE 'TEST-801: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS LT R-#B1-H00 ' R-#B1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-801: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT LT R-#B1-H00 ' R-#B1-H00 (EM=HH)
END-IF
*
IF L-#B4-2765 GE R-#B1-H00
	WRITE (1) NOTITLE 'TEST-802: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS GE R-#B1-H00 ' R-#B1-H00 (EM=HH)
ELSE
	WRITE (1) NOTITLE 'TEST-802: L-#B4-2765' L-#B4-2765 (EM=XXXX) ' IS NOT GE R-#B1-H00 ' R-#B1-H00 (EM=HH)
END-IF
*
END
