DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 #INDEX (N3)
END-DEFINE

INCLUDE Z1069--C
FORMAT (1) LS=180 PS=5

WRITE TITLE 'Page' *PAGE-NUMBER(1)

FOR #INDEX 1 TO 12
	WRITE (1) "DEFAULT" #INDEX
END-FOR

WRITE (1) "EJECT MANUALLY"
EJECT (1)

WRITE (1) "EJECT MANUALLY"
EJECT (1)

WRITE (1) "EJECT MANUALLY"
EJECT (1)

WRITE (1) "EJECT MANUALLY"
EJECT (1)

EJECT OFF (1)

FOR #INDEX 1 TO 12
	WRITE (1) "EJECT OFF" #INDEX
END-FOR

WRITE (1) "EJECT MANUALLY"
EJECT (1)

WRITE (1) "EJECT MANUALLY"
EJECT (1)

WRITE (1) "EJECT MANUALLY"
EJECT (1)

WRITE (1) "EJECT MANUALLY"
EJECT (1)

EJECT ON (1)

FOR #INDEX 1 TO 12
	WRITE (1) "EJECT ON" #INDEX
END-FOR

WRITE (1) "EJECT MANUALLY"
EJECT (1)

WRITE (1) "EJECT MANUALLY"
EJECT (1)

WRITE (1) "EJECT MANUALLY"
EJECT (1)

WRITE (1) "EJECT MANUALLY"
EJECT (1)

END
