DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 #FIELD1 (A25)
1 #FIELD2 (A25)
1 #FIELD3 (U25)
END-DEFINE

INCLUDE Z1069--C
FORMAT (1) LS=180 PS=5

MOVE 'HELLO WORLD 1234567890' TO #FIELD1 

MOVE ENCODED #FIELD1 TO #FIELD2 IN CODEPAGE 'IBM01140'
WRITE (1) NOTITLE #FIELD2
WRITE (1) NOTITLE #FIELD2 (EM=H(25))

MOVE ENCODED #FIELD2 IN CODEPAGE 'IBM01140' TO #FIELD3
PRINT (1) NOTITLE #FIELD3
PRINT (1) NOTITLE #FIELD3 (EM=H(50))

MOVE ENCODED #FIELD1 TO #FIELD2 IN CODEPAGE 'IBM037'
WRITE (1) NOTITLE #FIELD2
WRITE (1) NOTITLE #FIELD2 (EM=H(25))

MOVE ENCODED #FIELD2 IN CODEPAGE 'IBM037' TO #FIELD3
PRINT (1) NOTITLE #FIELD3
PRINT (1) NOTITLE #FIELD3 (EM=H(50))

MOVE ENCODED #FIELD1 TO #FIELD2 IN CODEPAGE 'UTF8'
WRITE (1) NOTITLE #FIELD2
WRITE (1) NOTITLE #FIELD2 (EM=H(25))

MOVE ENCODED #FIELD2 IN CODEPAGE 'UTF8' TO #FIELD3
PRINT (1) NOTITLE #FIELD3
PRINT (1) NOTITLE #FIELD3 (EM=H(50))
END
