DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 SOMEFIELDNAME (A10)
1 TO-PROCESS (L) INIT<TRUE>
END-DEFINE
 
INCLUDE Z1069--C
FORMAT (1) PS=0

DEFINE WORK FILE 1 'src/res/workfile/MEE7349'

WRITE WORK FILE 1 'PATRICK'
WRITE WORK FILE 1 'RICK   '
WRITE WORK FILE 1 'PAT    '
CLOSE WORK FILE 1

READ WORK FILE 1 SOMEFIELDNAME
 BEFORE BREAK PROCESSING
  IF SOMEFIELDNAME EQ 'PATRICK'
   TO-PROCESS := FALSE
   ESCAPE TOP
  END-IF
 END-BEFORE
 
 AT BREAK OF SOMEFIELDNAME
  SKIP (1) 1
 END-BREAK
 IF TO-PROCESS EQ FALSE
  TO-PROCESS := TRUE
  WRITE (1) 'RECORD WITH ' SOMEFIELDNAME ' SHOULD NOT BEEN WRITTEN'
 END-IF
 WRITE (1) NOTITLE 5X SOMEFIELDNAME
END-WORK
END
