DEFINE DATA
LOCAL
	1 MY-XML (A) DYNAMIC
	1 MY-PATH (A100)
	1 MY-NAME (A100)
	1 MY-VALUE (A100)
	1 NS (A100/1:2)
	1 PRE (A100/1:2)
	
	1 MY-PATHS (A100/1:2)
	1 MY-NAMES (A100/1:2)
	1 MY-VALUES (A100/1:2)
	
END-DEFINE

PARSE XML MY-XML INTO PATH MY-PATH
  PRINT MY-PATH
END-PARSE
*
PARSE XML MY-XML INTO NAME MY-NAME
  PRINT MY-NAME
END-PARSE
*
PARSE XML MY-XML INTO VALUE MY-VALUE
  PRINT MY-VALUE
END-PARSE
*
PARSE XML MY-XML INTO PATH MY-PATH NAME MY-NAME VALUE MY-VALUE
  PRINT MY-PATH MY-NAME MY-VALUE
END-PARSE
*
PARSE XML MY-XML INTO PATH MY-PATH NORMALIZE NAMESPACE NS(*) PREFIX PRE(*)
  PRINT MY-PATH
END-PARSE
*
PARSE XML MY-XML PATH MY-PATH NAME MY-NAME NAMESPACE NS(*) PREFIX PRE(*)
  PRINT MY-PATH
END-PARSE
*
PARSE XML MY-XML INTO PATH MY-PATH NAME MY-NAME VALUE MY-VALUE NORMALIZE NAMESPACE NS(*) PREFIX PRE(*)
  PRINT MY-PATH MY-NAME MY-VALUE
END-PARSE
*
PARSE XML MY-XML INTO PATH MY-PATHS(1) NAME MY-NAMES(1) VALUE MY-VALUES(1) NORMALIZE NAMESPACE NS(*) PREFIX PRE(*)
  PRINT MY-PATHS(1) MY-NAMES(1) MY-VALUES(1)
END-PARSE

END
