* using a dataset with multiple fields
* fields are sorted mixed DESCENDING and ASCENDING

DEFINE DATA
LOCAL
1 WKF
  2 N1 (N2)
  2 N2 (N2)
  2 N3 (N2)
END-DEFINE
 
FORMAT PS=0

DEFINE WORK FILE 1 'test/res/solid/workfiles/WORKFILE.WMEE962.D.txt' TYPE 'CSV'

READ WORK 1 WKF
  AT START OF DATA
     WRITE 'Original content'
  END-START

  WRITE N1 N2 N3
END-ALL
 
SORT RECORDS BY N1 ASCENDING N2 DESCENDING N3 DESCENDING USING KEYS
  AT START OF DATA
    WRITE 'sorted ASCENDING DESCENDING DESCENDING'
  END-START
  
  WRITE N1 N2 N3
END-SORT
 
END
