DEFINE DATA
LOCAL
*
1 #TOTAL-IN-CNT (N2)
1 TRANSM-READ VIEW OF AAPEM00N
	2	NAME
	2	VORNAME
*
END-DEFINE
*
RDGEN. READ TRANSM-READ BY NAME STARTING FROM ' '
*
  ACCEPT IF NAME EQ MASK('CKCK'..)
  ACCEPT IF NAME EQ MASK('RDRD'..)
  REJECT IF NAME EQ MASK('IAIA'..)
  ACCEPT IF NAME EQ MASK('FILL'..)                   /* V11
  REJECT IF NAME EQ MASK('PO'....)                   /* V12
  REJECT IF NAME EQ MASK('WCWC'..)                   /* V09
  ACCEPT IF NAME EQ MASK('NRNR'..)
  ACCEPT IF NAME EQ MASK('LH'....)
  REJECT IF NAME EQ MASK('XX'....)
  ACCEPT IF NAME EQ MASK('EE'....)
  
  ADD 1 TO #TOTAL-IN-CNT
  ACCEPT  IF NAME EQ MASK('12'....)
  ADD 2 TO #TOTAL-IN-CNT
  REJECT  IF NAME EQ MASK('34'....)
  ADD 3 TO #TOTAL-IN-CNT
  perform sub1
  perform sub2
*
END-READ

RDGEN2. READ TRANSM-READ BY NAME STARTING FROM ' '
  REJECT IF #TOTAL-IN-CNT GT 0
  perform sub1
  ACCEPT IF
    (NAME = 'L' AND (NAME = 'U' OR = 'W'))
    OR (NAME = 'M' AND NAME = 'H')
    OR (NAME = 'F')
    OR (NAME = 'S' AND NAME = 'T')
  perform sub2
END-READ
*
DEFINE SUBROUTINE SUB1
	REJECT IF NAME EQ MASK('56')
	WRITE 'SUB1'
END-SUBROUTINE
*
DEFINE SUBROUTINE SUB2
	ACCEPT IF NAME EQ MASK('78')
	WRITE 'SUB2'
END-SUBROUTINE
END
