DEFINE DATA LOCAL
1 #A (N2)
1 #B (N2)
END-DEFINE

DEFINE WINDOW E225WW
  SIZE 15*50
DEFINE WINDOW E225WW
  SIZE #A*#B
DEFINE WINDOW E225WW
  SIZE #A * #B
DEFINE WINDOW E225WW
  SIZE AUTO
DEFINE WINDOW E225WW
  SIZE QUARTER

DEFINE WINDOW E225WW
  BASE 50/50
DEFINE WINDOW E225WW
  BASE #A / #B
DEFINE WINDOW E225WW
  BASE TOP RIGHT
DEFINE WINDOW E225WW
  BASE TOP LEFT
DEFINE WINDOW E225WW
  BASE BOTTOM LEFT
DEFINE WINDOW E225WW
  BASE BOTTOM RIGHT
DEFINE WINDOW E225WW
  BASE CURSOR         

DEFINE WINDOW E225WW
  SIZE 15*50
  BASE 50/50
DEFINE WINDOW E225WW
  SIZE 15*50
  BASE #A / #B
DEFINE WINDOW E225WW
  SIZE 15*50
  BASE TOP RIGHT
DEFINE WINDOW E225WW
  SIZE 15*50
  BASE TOP LEFT
DEFINE WINDOW E225WW
  SIZE 15*50
  BASE BOTTOM LEFT
DEFINE WINDOW E225WW
  SIZE 15*50
  BASE BOTTOM RIGHT
DEFINE WINDOW E225WW
  SIZE 15*50
  BASE CURSOR

DEFINE WINDOW E225WW
  SIZE 15*50
  BASE 50/50
DEFINE WINDOW E225WW
  SIZE #A*#B
  BASE 50/50
DEFINE WINDOW E225WW
  SIZE #A * #B
  BASE 50/50
DEFINE WINDOW E225WW
  SIZE AUTO
  BASE 50/50
DEFINE WINDOW E225WW
  SIZE QUARTER
  BASE 50/50
  
END
