
FILE PERSNL FB(150 1800)                                                
  EMP#             9    5  N                                            
  EMPNAME         17   20  A                                            
    NAME-LAST  EMPNAME     8  A                                         
    NAME-FIRST EMPNAME +8 12  A                                         
  PAY-NET         90    4  P 2                                          
  PAY-GROSS       94    4  P 2                                          
  AMT            127    1  N                                            
TOTAL-EMP#         W    3  N VALUE 0                                    
TOTAL-AMT          W    3  N VALUE 0                                    
TOTAL-PAY          W    3  N VALUE 0                                    
TOTAL-FIRST-NAME   W    3  N VALUE 0                                    
MALE               W    1  N VALUE 1                                    
JOB INPUT PERSNL NAME MYPROG FINISH FINISH-PROC

 IF EMP# ALPHABETIC
     TOTAL-EMP# = TOTAL-EMP# + 3
 ELSE-IF PAY-GROSS > 500.00
     XMAS-BONUS = PAY-GROSS * 1.03 
 ELSE 
     XMAS-BONUS = PAY-GROSS * 1.05
 END-IF
 IF EMP# NULL 

     TOTAL-EMP# = TOTAL-EMP# + 2                                        
   END-IF                                                               
 IF EMP# NUMERIC

     TOTAL-EMP# = TOTAL-EMP# + 2                                        
 END-IF                                                               
 IF EMP# ZEROES

     TOTAL-EMP# = TOTAL-EMP# + 2                                        
 END-IF                                                               
 IF EMP# SPACE 

     TOTAL-EMP# = TOTAL-EMP# + 1                                        
 END-IF                                                               
 IF SEM SPACES

     TOTAL-SEM = TOTAL-SEM + 1                                          
 END-IF                                                               
 IF PAY-NET ZERO 

     TOTAL-PAY = TOTAL-PAY + 1                                          
   END-IF                                                               
 IF NAME-FIRST ZEROS 

     TOTAL-FIRST-NAME = TOTAL-FIRST-NAME + 1                            
   END-IF                                                                  
  IF EMP# NOT ALPHABETIC 

     TOTAL-EMP# = TOTAL-EMP# + 3                                        
   END-IF                                                               
 IF EMP# NOT NULL 

     TOTAL-EMP# = TOTAL-EMP# + 2                                        
   END-IF                                                               
 IF EMP# NOT NUMERIC

     TOTAL-EMP# = TOTAL-EMP# + 2                                        
   END-IF                                                               
 IF PAY-NET NOT ZERO 

     TOTAL-PAY = TOTAL-PAY + 1                                          
   END-IF                                                               
 IF EMP# NOT SPACE 

     TOTAL-EMP# = TOTAL-EMP# + 1                                        
 END-IF

