FILE PERSNL FB(150 1800)                                                
  EMP#             9    5  N                                            
  EMPNAME         17   20  A                                            
    NAME-LAST  EMPNAME     8  A                                         
    NAME-FIRST EMPNAME +8 12  A                                         
  PAY-NET         90    4  P 2                                          
  PAY-GROSS       94    4  P 2                                          
  AMT            127    1  N                                            
TOTAL-EMP#         W    3  N VALUE 0                                    
TOTAL-AMT          W    3  N VALUE 0                                    
TOTAL-PAY          W    3  N VALUE 0                                    
TOTAL-FIRST-NAME   W    3  N VALUE 0                                    
MALE               W    1  N VALUE 1                                    
JOB INPUT PERSNL NAME MYPROG FINISH FINISH-PROC                         
 IF EMP# NE 10000 

     TOTAL-EMP# = TOTAL-EMP# + 3                                        
   END-IF                                                               
 IF EMP# GE 10000 

     TOTAL-EMP# = TOTAL-EMP# + 2                                        
   END-IF                                                               
    IF EMP# LE 10000 

     TOTAL-EMP# = TOTAL-EMP# + 2                                        
   END-IF                                                               
 IF EMP# GT 10000 

     TOTAL-EMP# = TOTAL-EMP# + 1                                        
   END-IF                                                               
 IF AMT NE MALE 

     TOTAL-AMT = TOTAL-AMT + 1                                          
   END-IF                                                               
 IF PAY-NET LT (PAY-GROSS / 2) 

     TOTAL-PAY = TOTAL-PAY + 1                                          
   END-IF                                                               
 IF NAME-FIRST EQ 'LINDA' 

     TOTAL-FIRST-NAME = TOTAL-FIRST-NAME + 1                            
   END-IF

