FILE PERSNL FB(150 1800)                                                
  EMP#             9    5  N                                            
  EMPNAME         17   20  A                                            
    NAME-LAST  EMPNAME     8  A                                         
    NAME-FIRST EMPNAME +8 12  A                                         
  PAY-NET         90    4  P 2                                          
  PAY-GROSS       94    4  P 2                                          
JOB INPUT PERSNL NAME MYPROG FINISH FINISH-PROC                         
 IF (NOT DUPLICATE PRIMARY AND EMP# ALPHABETIC) OR PAY-GROSS > 500.00

     DISPLAY EMP# '  PERSONNEL RECORD IS DAMAGED'                       
     GOTO JOB    
 ELSE   
  IF PAY-GROSS > 500.00 AND (FIRST-DUP ACCEPT OR NOT DUPLICATE A0)

        XMAS-BONUS = PAY-GROSS * 1.03 
  ELSE-IF (NOT FIRST-DUP B3 AND PAY > 100) 
        XMAS-BONUS = PAY-GROSS * 1.05
  ELSE
     TOTAL-EMP# = TOTAL-EMP# + 1                                     
  END-IF   
 END-IF 

 IF (EMP# ZEROES AND EMP# LE 10000) AND NAME-FIRST EQ 'LINDA' 

     TOTAL-EMP# = TOTAL-EMP# + 2                                        
 END-IF                                                               
 IF (EMP# SPACE OR NOT MATCHED SECONDARY)

     TOTAL-EMP# = TOTAL-EMP# + 1                                        
 END-IF                                                               
 IF SEM SPACES

     TOTAL-SEM = TOTAL-SEM + 1                                          
 END-IF                                                               

