       IDENTIFICATION  DIVISION.
       PROGRAM-ID.     MEE6705A.

       DATA            DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.

       PROCEDURE DIVISION.
           EXEC SQL INCLUDE SMALLSQL
           END-EXEC.
           EXEC SQL INCLUDE EMPTYSQL
           END-EXEC.
       END PROGRAM MEE6705A.

