   DBACC: PROCEDURE OPTIONS(MAIN);


    DECLARE cnt FIXED BIN(15);
    DECLARE A FIXED DECIMAL(4,0) INIT(5);
    DECLARE B FIXED DECIMAL(4,0) INIT(3);
    DECLARE C FIXED DECIMAL(6,2);
    DECLARE alpha_short CHAR(50);

    cnt = 10;
    alpha_short = 'empty';

    /* only statements inside branches should be identified */

    C = A + B;
    PUT SKIP LIST  ('A + B = ', C);
    A = C - B;
    PUT SKIP LIST  ('C - B = ', A);

    END;

  END ADD;
