 
  SAMPLE1: PROC OPTIONS(MAIN);
    DECLARE RESULT BIT(1) INIT(1B);
    DECLARE X CHAR(2) INIT('AB');
    DECLARE Z FIXED DECIMAL(1) INIT(1);
    GOTO LABEL1;
    GOTO LABEL3;
    GOTO NESTED_PROC;
    LABEL1:
       BEGIN;
           DECLARE A CHAR(2) INIT('AB');
           DECLARE B FIXED DECIMAL(1) INIT(1);
           X = SUBSTR(X,LENGTH(X)+1 , Z);
           PUT SKIP LIST(' INSIDE LABEL1', X);
       END;
    GOTO LABEL2;
    PUT SKIP LIST('POST LABEL2');
    PUT SKIP LIST('INSIDE SAMPLE1');
    GOTO OUT;
    LABEL3: 
    PUT SKIP LIST('INSIDE LABEL3');
    NESTED_PROC: PROC;
     PUT SKIP LIST('INSIDE LABEL4');
    END NESTED_PROC;
 OUT : END SAMPLE1;