  COUNTEROUTSIDEINVOCABLE: PROCEDURE OPTIONS(MAIN);
     DCL 1 #INT1 FIXED BIN(31) INIT(10);
     DCL 1 #INT2 FIXED BIN(31) INIT(15);
     DCL 1 #COUNTER FIXED BIN(31);

     #COUNTER = #COUNTER + 1;
     #INT2 = #INT2 - #INT1;
     #INT1 = #INT1 - #INT2;
  END COUNTEROUTSIDEINVOCABLE;