    P4030H: PACKAGE EXPORTS(EXTPRC2);

      DCL IO_PTR_PCB POINTER;
      DCL DB_PTR_MAST POINTER;
      DCL DB_PTR_SCND POINTER;
      DCL DB_PTR_XXX POINTER;
      %INCLUDE FUNC;
      
      CALL CEETDLI (3, FUNC_GN, IO_PTR_PCB, DET_SEG_IO_AREA);
      
      %INCLUDE IMSCALL;
      
      CALL PLITDLI (3, FUNC_GNP, DB_PTR_XXX, DET_SEG_IO_AREA);
  
  END P4030H;