//TESTPRC  PROC NATPGM=NATPRG,          NATURAL PROGRAM NAME            00010004
//         NATREG=3M,                   NATURAL,DDM,OS SORT             00020000
//         SYSOUT='*',                  SYSOUT CLASS                    00080000
//         PRM=('IM=D,AUTO=ON,MT=0')    NATURAL PARMS                   00100000
//NATSTEP  EXEC PGM=&NATPGM,REGION=&NATREG,PARM=&PRM                    00170001
//CMSYNIN  DD DDNAME=SYSIN                                              00530000