//EIPPD62B PROC PARMLIB=VR.PARAMLIB,
//              EIPQUAL1=VPRDEIP,         STANDARD SYSOUT
//              SOUH=H                    DUMP SYSOUT
//SCRATCH  EXEC PGM=PLONG
//*