//PROC1  PROC                                                                   
//*                                                                             
//S083     EXEC PGM=MTCHECK                                                     
//CHKFILE  DD DSN=TKMT.D.DL.LMLABOR.DATA865.MFT,                                
//            DISP=SHR                                                          
//*      