//WEO418I1 PROC FTPPARM=,RGN=                                                   
// IF (RC LE 4) THEN                                                            
//FBR14010 EXEC PGM=IEFBR14                                                     
//DD1      DD DSN=WE.ORSIS.&RGN..ACS,                                           
//            DISP=(MOD,DELETE,DELETE),                                         
//            SPACE=(TRK,0),                                                    
//            STORCLAS=(STANDARD)                                                                                             
//SYSIN    DD DUMMY                                                             
//SYSPRINT DD SYSOUT=*                                                          
// ENDIF                                                                        
