           01 WS-DATE.
           02 WS-YEAR  PIC X(4) VALUE '2017'.
           02 WS-SEP1  PIC X VALUE '-'.
           02 WS-MONTH PIC X(2) VALUE '08'.
           02 WS-SEP2  PIC X VALUE '-'.
           02 WS-DAY   PIC X(2) VALUE '15'.