//TESTJCLJOB JOB (14300,211), 'UNLOAD TABLE',
//            CLASS=A,
//            MSGCLASS=Y,
//          MSGLEVEL=(1,1)
/*JOBPARM SYSAFF=ANY
//*
//STEP01 EXEC TESTPROC