  DAT018A : Proc Options(main);
  DCL Fxdcal ENTRY(FIXED DECIMAL, FIXED DECIMAL);
  DCL Flocal ENTRY(ALIGNED, FIXED DECIMAL);
  DCL Mixed ENTRY(ALIGNED, FIXED DECIMAL);
  DCL Error ENTRY(ALIGNED, FIXED DECIMAL);
  DCL SQRT BUILTIN;
  declare Calc generic (
              Fxdcal when (fixed,fixed),
              Flocal when (float,float),
              Mixed  when (float,fixed),
              Error otherwise);
   CALL Fxdcal(1,2);
   call B;
    END DAT018A;
    
   B: PROC;
   dcl x fixed decimal;
    x = 1;
   END B;