       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDITION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 A PIC 9(4).
       77 B PIC 9(4).
       77 C PIC 9(4).
       PROCEDURE DIVISION.
        COMPUTE A = ( B * C) / 1200
       STOP RUN.
