   PRINT NOGEN                                                          00000100
*                                                                               
*PCBNAME=ABCD02PA                                                       00000200
         PCB   TYPE=DB,                                                X00000300
               DBDNAME=DBD4018A,                                       X00000400
               PROCOPT=GOTP,                                           X00000500
               KEYLEN=100                                               00000600
         SENSEG NAME=QRSTCASE,                                         X00000700
               PARENT=0                                                 00000800
*                                                                       00032700
         PSBGEN LANG=COBOL,                                            X00034300
               PSBNAME=IEBGENER,CMPAT=YES                               00034400
         END                                                            00034500
