**********************************************************************
*******  NAME : TR-STD2W     ART  : PROGRAM
*******  BEZ. : Workfile aus X123-ABX-SCHREIBEN erstellen - hier: ABX
*******  STAND: 27.05.2000   VERS.: 1.000
*******  AUST.: NEIN         KASSE: KA
*******  AUTOR: TESTER
**********************************************************************
*******    ***********************************************************
*******    * A E N D E R U N G S H I S T O R I K *********************
*******    ***********************************************************
*******
*******    DATUM        DURCH               PGM-AUFTRAG
*******    BESCHREIBUNG
*******    ***********************************************************
*******    27.05.2000   U.Test_______
*******    Erstellung
*******    99.99.9999   _____________       ___/__
*******    ___________________________________________________________
**********************************************************************
DEFINE DATA
LOCAL
  USING ZGST10-L                       /* ZVK-Standardschreiben
*
LOCAL
  USING TR-STD-L                       /* Workfile
*
LOCAL
01 #ANZAHL                             (N06) INIT <0>
*
END-DEFINE
* --------------------------------------------------------------------
IF *DEVICE NE 'BATCH'
  DISPLAY 'BATCH-Programm nur über Job startbar'
  STOP
END-IF
END
