//AF10H01   PROC                                                        00010000
//AF10H01   EXEC  PGM=AF10H01                                           00020000
//STEPLIB   DD   DSN=ENDVR.USR.PROD.LOADLIB,DISP=SHR                    00030001
