 ADD002A: PROCEDURE OPTIONS(MAIN);
   
    DECLARE STR_1 CHAR(6) INIT('ABCDEF');
    DECLARE STR_2 CHAR(6) INIT('GHIJKL');
    DECLARE DELIM_1 CHAR(1) INIT('-');
    DECLARE STR_3 CHAR(19) INIT(' ');;
    
    STR_3 = STR_1 || STR_2;
    PUT SKIP LIST('/* STR_3 VALUE IS */ USING ||' , STR_3);
   
    STR_3 = STR_1 || DELIM_1 || STR_2;
    PUT SKIP LIST('STR_3 VALUE IS USING DELIMITER ||' , STR_3);       
   
 END ADD002A;
