//DB2RPS05 JOB
//*-------------------------------------------------------------------  00001000
//* IKJEFT01 - DB2 CREATE TABLES - RPS BK170                            00002000
//*-------------------------------------------------------------------  00003000
//TABLE    EXEC PGM=IKJEFT01,REGION=4096K,DYNAMNBR=20                   00004000
//STEPLIB  DD  DSN=your.DB2.SDSNLOAD,DISP=SHR                           00005000
//         DD  DSN=your.DB2.RUNLIB,DISP=SHR                             00006000
//SYSPRINT DD  SYSOUT=*                                                 00007000
//SYSUDUMP DD  SYSOUT=*                                                 00008000
//SYSTSPRT DD  SYSOUT=*                                                 00009000
//*                                                                     00010000
//SYSTSIN  DD  DSN=BNKCA.BI15.SAMPLE.DATA(DB2DSNnn),DISP=SHR            00011000
//         DD  DSN=BNKCA.BI15.SAMPLE.DATA(DB2RUNnn),DISP=SHR            00012000
//*                                                                     00013000
//SYSIN    DD  DSN=BNKCA.BI15.SAMPLE.DATA(DB2USER),DISP=SHR             00014000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SAATABL),DISP=SHR             00015000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SABTABL),DISP=SHR             00016000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SACTABL),DISP=SHR             00017000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SADTABL),DISP=SHR             00018000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SAETABL),DISP=SHR             00019000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SAFTABL),DISP=SHR             00020000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SAGTABL),DISP=SHR             00021000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SAHTABL),DISP=SHR             00022000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SAITABL),DISP=SHR             00023000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SAJTABL),DISP=SHR             00024000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SAKTABL),DISP=SHR             00025000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SALTABL),DISP=SHR             00026000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SAMTABL),DISP=SHR             00027000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(SANTABL),DISP=SHR             00028000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S00TABL),DISP=SHR             00029000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S01TABL),DISP=SHR             00030000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S02TABL),DISP=SHR             00031000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S03TABL),DISP=SHR             00032000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S04TABL),DISP=SHR             00033000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S05TABL),DISP=SHR             00034000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S06TABL),DISP=SHR             00035000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S07TABL),DISP=SHR             00036000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S08TABL),DISP=SHR             00037000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S09TABL),DISP=SHR             00038000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S10TABL),DISP=SHR             00039000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S11TABL),DISP=SHR             00040000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S12TABL),DISP=SHR             00041000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S13TABL),DISP=SHR             00042000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(S14TABL),DISP=SHR             00043000
//*                                                                     00044000
//
