//DB2RPS07 JOB
//*-------------------------------------------------------------------  00001000
//* IKJEFT01 - DB2 BIND PACKAGE - RPS BK170                             00002000
//*-------------------------------------------------------------------  00003000
//DATABASE EXEC PGM=IKJEFT01,REGION=4096K,DYNAMNBR=20                   00004000
//STEPLIB  DD  DSN=your.DB2.SDSNLOAD,DISP=SHR                           00005000
//         DD  DSN=your.DB2.RUNLIB,DISP=SHR                             00006000
//DBRMLIB  DD  DSN=BNKCA.RP50.DBRMLIB,DISP=SHR                          00007000
//         DD  DSN=BNKCA.BI15.DBRMLIB,DISP=SHR                          00008000
//SYSPRINT DD  SYSOUT=*                                                 00009000
//SYSUDUMP DD  SYSOUT=*                                                 00010000
//SYSTSPRT DD  SYSOUT=*                                                 00011000
//*                                                                     00012000
//SYSTSIN  DD  DSN=BNKCA.BI15.SAMPLE.DATA(DB2DSNnn),DISP=SHR            00013000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPSPKG),DISP=SHR              00014000
//         DD  DSN=BNKCA.BI15.SAMPLE.DATA(DB2RUNnn),DISP=SHR            00015000
//SYSIN  DD DUMMY                                                       00016000
//*                                                                     00017000
//
