//DB2RPS08 JOB
//*----------------------------------------------------                 00001000
//* BIS863B - LOAD RPS DB2 DATABASES BK170                              00002000
//*----------------------------------------------------                 00003000
//BIS863B  EXEC PGM=BIS863B,REGION=2048K                                00004000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//         DD  DSN=your.DB2.SDSNLOAD,DISP=SHR                           00006000
//         DD  DSN=your.DB2.RUNLIB,DISP=SHR                             00007000
//BIPUTIL  DD  DSN=BNKCA.IN0.RP50.BIPUTIL,DISP=(OLD,KEEP)               00008000
//BNKPRT1  DD SYSOUT=A                                                  00009000
//SYSOUT   DD SYSOUT=A                                                  00010000
//SYSPRINT DD SYSOUT=A                                                  00011000
//SYSUDUMP DD SYSOUT=A                                                  00012000
//* DSNTRACE DD SYSOUT=X                                                00013000
//SYSIN    DD   *                                                       00014000
IPRF BNK INSTALL  EN          0                                         00015000
/*                                                                      00016000
//                                                                      00017000
//
