//LSVSAMDD JOB
//*    **********************************************                   00001000
//*    * LSVSAMDD - VSAM API DD STATEMENTS                              00002000
//*    **********************************************                   00003000
//LSFACO   DD  DSN=BNKCAV.IN0.II20.LSFACO,DISP=SHR                      00004000
//LSFBAL   DD  DSN=BNKCAV.IN0.II20.LSFBAL,DISP=SHR                      00005000
//LSFBIL   DD  DSN=BNKCAV.IN0.II20.LSFBIL,DISP=SHR                      00006000
//LSFBNK   DD  DSN=BNKCAV.IN0.II20.LSFBNK,DISP=SHR                      00007000
//LSFCHB   DD  DSN=BNKCAV.IN0.II20.LSFCHB,DISP=SHR                      00008000
//LSFFEE   DD  DSN=BNKCAV.IN0.II20.LSFFEE,DISP=SHR                      00009000
//LSFFHI   DD  DSN=BNKCAV.IN0.II20.LSFFHI,DISP=SHR                      00010000
//LSFINS   DD  DSN=BNKCAV.IN0.II20.LSFINS,DISP=SHR                      00011000
//LSFIRS   DD  DSN=BNKCAV.IN0.II20.LSFIRS,DISP=SHR                      00012000
//LSFLOG   DD  DSN=BNKCAV.IN0.II20.LSFLOG,DISP=SHR                      00013000
//LSFMSA   DD  DSN=BNKCAV.IN0.II20.LSFMSA,DISP=SHR                      00014000
//LSFMSO   DD  DSN=BNKCAV.IN0.II20.LSFMSO,DISP=SHR                      00015000
//LSFMST   DD  DSN=BNKCAV.IN0.II20.LSFMST,DISP=SHR                      00016000
//LSFMTH   DD  DSN=BNKCAV.IN0.II20.LSFMTH,DISP=SHR                      00017000
//LSFMUL   DD  DSN=BNKCAV.IN0.II20.LSFMUL,DISP=SHR                      00018000
//LSFOTH   DD  DSN=BNKCAV.IN0.II20.LSFOTH,DISP=SHR                      00019000
//LSFOTR   DD  DSN=BNKCAV.IN0.II20.LSFOTR,DISP=SHR                      00020000
//LSFPMT   DD  DSN=BNKCAV.IN0.II20.LSFPMT,DISP=SHR                      00021000
//LSFPSE   DD  DSN=BNKCAV.IN0.II20.LSFPSE,DISP=SHR                      00022000
//LSFRAT   DD  DSN=BNKCAV.IN0.II20.LSFRAT,DISP=SHR                      00023000
//LSFRSV   DD  DSN=BNKCAV.IN0.II20.LSFRSV,DISP=SHR                      00024000
//LSFTRW   DD  DSN=BNKCAV.IN0.II20.LSFTRW,DISP=SHR                      00025000
//LSFTTL   DD  DSN=BNKCAV.IN0.II20.LSFTTL,DISP=SHR                      00026000
//LSFUSE   DD  DSN=BNKCAV.IN0.II20.LSFUSE,DISP=SHR                      00027000
//LSMMST   DD  DSN=BNKCAV.IN0.II20.LSMMST,DISP=SHR                      00028000
//MIFCSR   DD  DSN=BNKCAV.IN0.MI51.MIFCSR,DISP=SHR                      00029000
//
