//RP50DUMP JOB
//********************************************************************* 00001000
//*      THIS JOB WILL DUMP ALL PANELS IN THE MAPPER VSAM FILE        * 00002000
//*      TO A SEQUENTIAL BACKUP FILE                                  * 00003000
//********************************************************************* 00004000
//SCRATCH  EXEC PGM=IEFBR14                                             00005000
//DD1      DD  DSN=BNKCA.IN0.RP50.ENCAMAP,                              00006000
//             DISP=(MOD,DELETE,DELETE),                                00007000
//             UNIT=BNKDEV,                                             00008000
//             SPACE=(TRK,0),                                           00009000
//             DCB=(DSORG=PS,RECFM=VB,LRECL=8188,BLKSIZE=8192)          00010000
//****************************************************************      00011000
//CAU$DUMP EXEC  PGM=CAU$DUMP                                           00012000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//CAMAP    DD  DSN=BNKCAV.IN0.RP50.ENCAMAP,DISP=SHR                     00014000
//CADUMP   DD  DSN=BNKCA.IN0.RP50.ENCAMAP,DISP=(NEW,CATLG),             00015000
//             UNIT=BNKDEV,SPACE=(CYL,(1,1),RLSE),                      00016000
//             DCB=(DSORG=PS,RECFM=VB,LRECL=8188,BLKSIZE=8192)          00017000
//SYSPRINT DD  SYSOUT=*                                                 00018000
//SYSIN    DD  *                                                        00019000
CAMAP * CADUMP                                                          00020000
/*                                                                      00021000
//
