//RPC020 JOB
//*                                                                     00013000
//*    **************************************************************** 00014000
//*    * STEP005   RPC020 - INSTITUTION CONTROL FILE CONVERSION         00015000
//*    **************************************************************** 00018000
//*                                                                     00019000
//STEP005  EXEC PGM=IEFBR14                                             00004000
//PRINTK   DD  DSN=BNKCA.IN0.MI51.PRINTK,DISP=(MOD,DELETE,DELETE),      00005000
//             UNIT=SYSDA,SPACE=(TRK,(1,1),RLSE)                        00006000
//*                                                                     00007000
//*                                                                     00014000
//*    **************************************************************** 00014000
//*    * STEP010   IDCAMS - DEL/DEF INSTITITION CONTROL FILE            00015000
//*    **************************************************************** 00018000
//*                                                                     00019000
//STEP010  EXEC PGM=IDCAMS,REGION=512K                                  00008000
//SYSPRINT DD  SYSOUT=*                                                 00009000
//SYSUDUMP DD  SYSOUT=*                                                 00010000
//*                                                                     00011000
//SYSIN    DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPFBNK),DISP=SHR              00012000
//*                                                                     00013000
//*                                                                     00014000
//*    **************************************************************** 00014000
//*    * STEP015   BIS869B - INITIALIZE INSTITUTION CONTROL FILE        00015000
//*    **************************************************************** 00018000
//*                                                                     00019000
//STEP015  EXEC PGM=BIS869B,REGION=1024K                                00015000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//RPFBNK   DD DSN=BNKCAV.IN0.RP50.RPFBNK,DISP=SHR                       00017000
//BNKPRT1  DD SYSOUT=*                                                  00018000
//SYSOUT   DD SYSOUT=*                                                  00019000
//SYSPRINT DD SYSOUT=*                                                  00020000
//SYSUDUMP DD SYSOUT=*                                                  00021000
//DSNTRACE DD SYSOUT=*                                                  00022000
//SYSIN    DD   *                                                       00023000
IPRP BNK INFOPNT  EN          0                                         00024000
SAB 000000 Y                                                            00025000
END                                                                     00026000
/*                                                                      00027000
//*                                                                     00014000
//*    **************************************************************** 00014000
//*    * STEP020   RPC020 - INITIALIZE INSTITUTION CONTROL FILE         00015000
//*    *                    CONVERSION                                  00015000
//*    **************************************************************** 00018000
//*                                                                     00028000
//STEP020  EXEC PGM=RPC020,REGION=1024K                                 00029000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00031000
//SYSUDUMP DD  SYSOUT=*                                                 00032000
//SYSOUT   DD  SYSOUT=*                                                 00033000
//PRINTR   DD  SYSOUT=*                                                 00034000
//PRFICH   DD  SYSOUT=*                                                 00035000
//PRINTA   DD  SYSOUT=*                                                 00036000
//PRINTB   DD  SYSOUT=*                                                 00037000
//PRINTC   DD  SYSOUT=*                                                 00038000
//PRINTD   DD  SYSOUT=*                                                 00039000
//PRINTE   DD  SYSOUT=*                                                 00040000
//PRINTF   DD  SYSOUT=*                                                 00041000
//PRINTG   DD  SYSOUT=*                                                 00042000
//PRINTH   DD  SYSOUT=*                                                 00043000
//PRINTI   DD  SYSOUT=*                                                 00044000
//PRINTJ   DD  SYSOUT=*                                                 00045000
//PRNTR01  DD  SYSOUT=*                                                 00046000
//RPFBNK   DD  DSN=BNKCAV.IN0.RP50.RPFBNK,DISP=SHR                      00005000
//MIFMST   DD  DSN=BNKCAV.IN0.MI51.MIFMST,DISP=SHR                      00048000
//MIFCSR   DD  DSN=BNKCAV.IN0.MI51.MIFCSR,DISP=SHR                      00049000
//PRINTK   DD  DSN=BNKCA.IN0.MI51.PRINTK,DISP=(NEW,CATLG,DELETE),       00050000
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=0133,BLKSIZE=11438),      00051000
//             SPACE=(CYL,(1,1),RLSE)                                   00052000
//*                                                                     00053000
//RPCARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPC020),DISP=SHR              00054000
//*                                                                     00055000
//
