//RPD015 JOB
//*    ************************************************
//*    * RPD015 - RPT INIT                            *
//*    ************************************************
//IDCAMS   EXEC PGM=IDCAMS,REGION=512K
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//*
//SYSIN    DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPRPTS),DISP=SHR
//*
//*
//RPD015   EXEC  PGM=RPD015,REGION=1024K
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//RPRPTS   DD  DSN=BNKCAV.IN0.RP50.RPRPTS,DISP=SHR
//*
//
