//RPD036 JOB
//*    ***************************************                          00001000
//*    * RPD036 - ONLINE MAINTENANCE JOURNAL *                          00002000
//*    ***************************************                          00003000
//RPD036   EXEC PGM=RPD036,REGION=3000K                                 00004000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00006000
//SYSUDUMP DD  SYSOUT=*                                                 00007000
//SYSOUT   DD  SYSOUT=*                                                 00008000
//PRINTR   DD  SYSOUT=*                                                 00009000
//PRFICH   DD  SYSOUT=*                                                 00010000
//PRINTA   DD  SYSOUT=*                                                 00011000
//PRINTB   DD  SYSOUT=*                                                 00012000
//PRINTC   DD  SYSOUT=*                                                 00013000
//PRINTD   DD  SYSOUT=*                                                 00014000
//PRINTE   DD  SYSOUT=*                                                 00015000
//PRINTF   DD  SYSOUT=*                                                 00016000
//PRINTG   DD  SYSOUT=*                                                 00017000
//PRINTH   DD  SYSOUT=*                                                 00018000
//PRINTI   DD  SYSOUT=*                                                 00019000
//PRINTJ   DD  SYSOUT=*                                                 00020000
//PRINTR   DD  SYSOUT=*                                                 00021000
//PRNTR01  DD  SYSOUT=*                                                 00022000
//PRNTRST  DD  SYSOUT=*                                                 00023000
//MIFBNK   DD  DSN=BNKCAV.IN0.MI51.MIFBNK,DISP=SHR                      00024000
//MIFMST   DD  DSN=BNKCAV.IN0.MI51.MIFMST,DISP=SHR                      00025000
//MIFCSR   DD  DSN=BNKCAV.IN0.MI51.MIFCSR,DISP=SHR                      00026000
//RPRPTO   DD  DSN=BNKCAV.IN0.RP50.RPRPTO,DISP=SHR                      00027000
//*    *************************************************                00001000
//*    * RPVSAMDD - REL PRICING VSAM API DD STATEMENTS *                00002000
//*    *************************************************                00003000
//RPFACT   DD  DSN=BNKCAV.IN0.RP50.RPFACT,DISP=SHR                      00004000
//RPFBNK   DD  DSN=BNKCAV.IN0.RP50.RPFBNK,DISP=SHR                      00005000
//RPFCRW   DD  DSN=BNKCAV.IN0.RP50.RPFCRW,DISP=SHR                      00006000
//RPFENR   DD  DSN=BNKCAV.IN0.RP50.RPFENR,DISP=SHR                      00007000
//RPFEVT   DD  DSN=BNKCAV.IN0.RP50.RPFEVT,DISP=SHR                      00008000
//RPFIDX   DD  DSN=BNKCAV.IN0.RP50.RPFIDX,DISP=SHR                      00009000
//RPFINT   DD  DSN=BNKCAV.IN0.RP50.RPFINT,DISP=SHR                      00010000
//RPFLOG   DD  DSN=BNKCAV.IN0.RP50.RPFLOG,DISP=SHR                      00011000
//RPFMST   DD  DSN=BNKCAV.IN0.RP50.RPFMST,DISP=SHR                      00012000
//RPFQUA   DD  DSN=BNKCAV.IN0.RP50.RPFQUA,DISP=SHR                      00013000
//RPFREL   DD  DSN=BNKCAV.IN0.RP50.RPFREL,DISP=SHR                      00014000
//RPFSEC   DD  DSN=BNKCAV.IN0.RP50.RPFSEC,DISP=SHR                      00015000
//RPFSYC   DD  DSN=BNKCAV.IN0.RP50.RPFSYC,DISP=SHR                      00016000
//RPFTRM   DD  DSN=BNKCAV.IN0.RP50.RPFTRM,DISP=SHR                      00017000
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//*                                                                     00030000
//RPCARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD036),DISP=SHR              00031000
//*                                                                     00032000
//
