//RPD020D JOB
//*    ********************************************                     00001000
//*    * RPD020 - INSTITUTION CONTROL FILE UPDATE *                     00002000
//*    ********************************************                     00003000
//SCRATCH  EXEC PGM=IEFBR14                                             00004000
//PRINTK   DD  DSN=BNKCA.IN0.MI51.PRINTK,DISP=(MOD,DELETE,DELETE),      00005000
//             UNIT=SYSDA,SPACE=(TRK,(1,1),RLSE)                        00006000
//*                                                                     00007000
//RPD020   EXEC PGM=RPD020,REGION=1024K                                 00008000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00010000
//SYSUDUMP DD  SYSOUT=*                                                 00011000
//SYSOUT   DD  SYSOUT=*                                                 00012000
//PRINTR   DD  SYSOUT=*                                                 00013000
//PRFICH   DD  SYSOUT=*                                                 00014000
//PRINTA   DD  SYSOUT=*                                                 00015000
//PRINTB   DD  SYSOUT=*                                                 00016000
//PRINTC   DD  SYSOUT=*                                                 00017000
//PRINTD   DD  SYSOUT=*                                                 00018000
//PRINTE   DD  SYSOUT=*                                                 00019000
//PRINTF   DD  SYSOUT=*                                                 00020000
//PRINTG   DD  SYSOUT=*                                                 00021000
//PRINTH   DD  SYSOUT=*                                                 00022000
//PRINTI   DD  SYSOUT=*                                                 00023000
//PRINTJ   DD  SYSOUT=*                                                 00024000
//PRNTR01  DD  SYSOUT=*                                                 00025000
//PRINTK   DD  DSN=BNKCA.IN0.MI51.PRINTK,DISP=(NEW,CATLG,DELETE),       00026000
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=0133,BLKSIZE=11438),      00027000
//             SPACE=(CYL,(1,1),RLSE)                                   00028000
//*                                                                     00029000
//RPCARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD020),DISP=SHR              00030000
//*                                                                     00031000
//
