//RPD035 JOB
//*    ***************************************                          00001000
//*    * RPD035 - ONLINE MAINTENANCE EXTRACT *                          00002000
//*    ***************************************                          00003000
//*                                                                     00058000
//IDCAMS   EXEC PGM=IDCAMS,REGION=512K                                  00059000
//SYSPRINT DD  SYSOUT=*                                                 00060000
//SYSUDUMP DD  SYSOUT=*                                                 00061000
//*                                                                     00062000
//SYSIN    DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPRPTO),DISP=SHR              00063000
//*                                                                     00064000
//*                                                                     00068000
//RPD035   EXEC PGM=RPD035,REGION=3000K                                 00069000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00070000
//SYSUDUMP DD  SYSOUT=*                                                 00071000
//SYSOUT   DD  SYSOUT=*                                                 00072000
//PRINTR   DD  SYSOUT=*                                                 00073000
//PRFICH   DD  SYSOUT=*                                                 00074000
//PRINTA   DD  SYSOUT=*                                                 00075000
//PRINTB   DD  SYSOUT=*                                                 00076000
//PRINTC   DD  SYSOUT=*                                                 00077000
//PRINTD   DD  SYSOUT=*                                                 00078000
//PRINTE   DD  SYSOUT=*                                                 00079000
//PRINTF   DD  SYSOUT=*                                                 00080000
//PRINTG   DD  SYSOUT=*                                                 00081000
//PRINTH   DD  SYSOUT=*                                                 00082000
//PRINTI   DD  SYSOUT=*                                                 00083000
//PRINTJ   DD  SYSOUT=*                                                 00084000
//PRNTR01  DD  SYSOUT=*                                                 00085000
//MILOGS   DD  DSN=BNKCA.IN0.RP50.MILOGS,DISP=(NEW,DELETE,DELETE),      00086000
//             UNIT=SYSDA,DCB=(RECFM=VB,LRECL=4282,BLKSIZE=11475),      00087000
//             SPACE=(CYL,(1,1),RLSE)                                   00088000
//MIAMTT   DD  DSN=BNKCAV.IN0.MI51.MIAMTT,DISP=SHR                      00089000
//MIFMST   DD  DSN=BNKCAV.IN0.MI51.MIFMST,DISP=SHR                      00090000
//MIFCSR   DD  DSN=BNKCAV.IN0.MI51.MIFCSR,DISP=SHR                      00091000
//MIHDTS   DD  DSN=BNKCAV.IN0.MI51.MIHD50,DISP=SHR                      00092000
//RPRPTO   DD  DSN=BNKCAV.IN0.RP50.RPRPTO,DISP=SHR                      00093000
//RPFLOG   DD  DSN=BNKCAV.IN0.RP50.RPFLOG,DISP=SHR                      00094000
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//*                                                                     00096000
//MICARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD035),DISP=SHR              00097000
//*                                                                     00098000
//
