//RPD036D JOB
//*    ***************************************                          00001000
//*    * RPD036 - ONLINE MAINTENANCE JOURNAL *                          00002000
//*    ***************************************                          00003000
//RPD036   EXEC PGM=RPD036,REGION=3000K                                 00004000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00006000
//SYSUDUMP DD  SYSOUT=*                                                 00007000
//SYSOUT   DD  SYSOUT=*                                                 00008000
//PRINTR   DD  SYSOUT=*                                                 00009000
//PRFICH   DD  SYSOUT=*                                                 00010000
//PRINTA   DD  SYSOUT=*                                                 00011000
//PRINTB   DD  SYSOUT=*                                                 00012000
//PRINTC   DD  SYSOUT=*                                                 00013000
//PRINTD   DD  SYSOUT=*                                                 00014000
//PRINTE   DD  SYSOUT=*                                                 00015000
//PRINTF   DD  SYSOUT=*                                                 00016000
//PRINTG   DD  SYSOUT=*                                                 00017000
//PRINTH   DD  SYSOUT=*                                                 00018000
//PRINTI   DD  SYSOUT=*                                                 00019000
//PRINTJ   DD  SYSOUT=*                                                 00020000
//PRINTR   DD  SYSOUT=*                                                 00021000
//PRNTR01  DD  SYSOUT=*                                                 00022000
//PRNTRST  DD  SYSOUT=*                                                 00023000
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//*                                                                     00025000
//RPCARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD036),DISP=SHR              00026000
//*                                                                     00027000
//
