//RPD111 JOB
//*                                                                     00001000
//JOBLIB   DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.DP86.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.TI86.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//*                                                                     00003000
//*                                                                     00004000
//*    **************************************************************** 00005000
//*    * STEP005   IDCAMS                                               00006000
//*    **************************************************************** 00007000
//*                                                                     00008000
//STEP005  EXEC PGM=IDCAMS,REGION=512K,COND=(4,LT)                      00009000
//SYSPRINT DD  SYSOUT=*                                                 00010000
//SYSUDUMP DD  SYSOUT=*                                                 00011000
//*                                                                     00012000
//SYSIN    DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPRPTS),DISP=SHR              00013000
//*                                                                     00014000
//*                                                                     00015000
//*    **************************************************************** 00016000
//*    * STEP010   RPD015  -  REPORTS FILE CREATE                       00017000
//*    **************************************************************** 00018000
//*                                                                     00019000
//STEP010  EXEC PGM=RPD015,REGION=1024K,COND=(4,LT)                     00020000
//SYSPRINT DD  SYSOUT=*                                                 00021000
//SYSUDUMP DD  SYSOUT=*                                                 00022000
//SYSOUT   DD  SYSOUT=*                                                 00023000
//RPRPTS   DD  DSN=BNKCAV.IN0.RP50.RPRPTS,DISP=SHR                      00024000
//*                                                                     00025000
//*    ************************************************************     00026000
//*    * RPD111 - CREATE NEW RELATIONSHIPS WITH DEFAULT MODEL.    *     00027000
//*    ************************************************************     00028000
//RPD111   EXEC PGM=RPD111,REGION=4096K                                 00029000
//SYSPRINT DD  SYSOUT=*                                                 00030000
//SYSUDUMP DD  SYSOUT=*                                                 00031000
//SYSOUT   DD  SYSOUT=*                                                 00032000
//MIFMST   DD  DSN=BNKCAV.IN0.MI51.MIFMST,DISP=SHR                      00033000
//MIFCSR   DD  DSN=BNKCAV.IN0.MI51.MIFCSR,DISP=SHR                      00034000
//*    *************************************************                00001000
//*    * RPVSAMDD - REL PRICING VSAM API DD STATEMENTS *                00002000
//*    *************************************************                00003000
//RPFACT   DD  DSN=BNKCAV.IN0.RP50.RPFACT,DISP=SHR                      00004000
//RPFBNK   DD  DSN=BNKCAV.IN0.RP50.RPFBNK,DISP=SHR                      00005000
//RPFCRW   DD  DSN=BNKCAV.IN0.RP50.RPFCRW,DISP=SHR                      00006000
//RPFENR   DD  DSN=BNKCAV.IN0.RP50.RPFENR,DISP=SHR                      00007000
//RPFEVT   DD  DSN=BNKCAV.IN0.RP50.RPFEVT,DISP=SHR                      00008000
//RPFIDX   DD  DSN=BNKCAV.IN0.RP50.RPFIDX,DISP=SHR                      00009000
//RPFINT   DD  DSN=BNKCAV.IN0.RP50.RPFINT,DISP=SHR                      00010000
//RPFLOG   DD  DSN=BNKCAV.IN0.RP50.RPFLOG,DISP=SHR                      00011000
//RPFMST   DD  DSN=BNKCAV.IN0.RP50.RPFMST,DISP=SHR                      00012000
//RPFQUA   DD  DSN=BNKCAV.IN0.RP50.RPFQUA,DISP=SHR                      00013000
//RPFREL   DD  DSN=BNKCAV.IN0.RP50.RPFREL,DISP=SHR                      00014000
//RPFSEC   DD  DSN=BNKCAV.IN0.RP50.RPFSEC,DISP=SHR                      00015000
//RPFSYC   DD  DSN=BNKCAV.IN0.RP50.RPFSYC,DISP=SHR                      00016000
//RPFTRM   DD  DSN=BNKCAV.IN0.RP50.RPFTRM,DISP=SHR                      00017000
//RPRPTS   DD  DSN=BNKCAV.IN0.RP50.RPRPTS,DISP=SHR                      00036000
//RPMSTW   DD  DSN=BNKCA.IN0.RP50.RPMSTW,DISP=SHR                       00037000
//*                                                                     00038000
//
