//RPD126D JOB
//*    **************************************************               00001000
//*    * RPD126 - INTERFACE WAREHOUSE INFORMATION BUILD *               00002000
//*    **************************************************               00003000
//RPD126S  EXEC PGM=IEFBR14                                             00004000
//MIAPIB   DD   DSN=BNKCA.IN0.RP50.BLDINT,                              00005000
//         DISP=(MOD,DELETE,DELETE),                                    00006000
//         UNIT=SYSDA,                                                  00007000
//         SPACE=(TRK,(1,1),RLSE)                                       00008000
/*                                                                      00009000
//RPD126   EXEC PGM=RPD126,REGION=1024K,COND=(0,LT)                     00010000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//* ====== OUTPUT FILE ==========================================       00012000
//SYSUDUMP DD   SYSOUT=1                                                00013000
//SYSPRINT DD   SYSOUT=5                                                00014000
//SYSOUT   DD   SYSOUT=6                                                00015000
//CAIPRNT1 DD   SYSOUT=5                                                00016000
//CAIPRNT2 DD   SYSOUT=8                                                00017000
//CAIPRINT DD   SYSOUT=9                                                00018000
//MIAPIB   DD   DSN=BNKCA.IN0.RP50.BLDINT,                              00019000
//         DISP=(NEW,CATLG,DELETE),                                     00020000
//         UNIT=SYSDA,                                                  00021000
//         SPACE=(22257,(50,25),RLSE),                                  00022000
//         DCB=(RECFM=VB,LRECL=2019,BLKSIZE=22257)                      00023000
//* ====== WORK FILE ============================================       00024000
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//RPSORT2  DD   UNIT=SYSDA,SPACE=(CYL,(2,1))                            00026000
//RPWREL   DD   UNIT=SYSDA,SPACE=(CYL,(2,1))                            00027000
//RPWINT   DD   UNIT=SYSDA,SPACE=(CYL,(2,1))                            00028000
//* ====== INPUT FILE ===========================================       00029000
//*                                                                     00030000
//
