//RPD252 JOB
//SCRATCH  EXEC PGM=IEFBR14,COND=(0,LT)                                 00001000
//PRINTK   DD  DSN=BNKCA.IN0.MI51.PRINTK,DISP=(MOD,DELETE,DELETE),      00002000
//             UNIT=SYSDA,SPACE=(TRK,(1,1),RLSE)                        00003000
//*                                                                     00004000
//RPD252   EXEC PGM=RPD252,REGION=1024K,COND=(0,LT)                     00005000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00007000
//SYSUDUMP DD  SYSOUT=*                                                 00008000
//SYSOUT   DD  SYSOUT=*                                                 00009000
//PRINTR   DD  SYSOUT=*                                                 00010000
//PRFICH   DD  SYSOUT=*                                                 00011000
//PRINTA   DD  SYSOUT=*                                                 00012000
//PRINTB   DD  SYSOUT=*                                                 00013000
//PRINTC   DD  SYSOUT=*                                                 00014000
//PRINTD   DD  SYSOUT=*                                                 00015000
//PRINTE   DD  SYSOUT=*                                                 00016000
//PRINTF   DD  SYSOUT=*                                                 00017000
//PRINTG   DD  SYSOUT=*                                                 00018000
//PRINTH   DD  SYSOUT=*                                                 00019000
//PRINTI   DD  SYSOUT=*                                                 00020000
//PRINTJ   DD  SYSOUT=*                                                 00021000
//PRNTR01  DD  SYSOUT=*                                                 00022000
//MIFMST   DD  DSN=BNKCAV.IN0.MI51.MIFMST,DISP=SHR                      00023000
//MIFCSR   DD  DSN=BNKCAV.IN0.MI51.MIFCSR,DISP=SHR                      00024000
//*    *************************************************                00001000
//*    * RPVSAMDD - REL PRICING VSAM API DD STATEMENTS *                00002000
//*    *************************************************                00003000
//RPFACT   DD  DSN=BNKCAV.IN0.RP50.RPFACT,DISP=SHR                      00004000
//RPFBNK   DD  DSN=BNKCAV.IN0.RP50.RPFBNK,DISP=SHR                      00005000
//RPFCRW   DD  DSN=BNKCAV.IN0.RP50.RPFCRW,DISP=SHR                      00006000
//RPFENR   DD  DSN=BNKCAV.IN0.RP50.RPFENR,DISP=SHR                      00007000
//RPFEVT   DD  DSN=BNKCAV.IN0.RP50.RPFEVT,DISP=SHR                      00008000
//RPFIDX   DD  DSN=BNKCAV.IN0.RP50.RPFIDX,DISP=SHR                      00009000
//RPFINT   DD  DSN=BNKCAV.IN0.RP50.RPFINT,DISP=SHR                      00010000
//RPFLOG   DD  DSN=BNKCAV.IN0.RP50.RPFLOG,DISP=SHR                      00011000
//RPFMST   DD  DSN=BNKCAV.IN0.RP50.RPFMST,DISP=SHR                      00012000
//RPFQUA   DD  DSN=BNKCAV.IN0.RP50.RPFQUA,DISP=SHR                      00013000
//RPFREL   DD  DSN=BNKCAV.IN0.RP50.RPFREL,DISP=SHR                      00014000
//RPFSEC   DD  DSN=BNKCAV.IN0.RP50.RPFSEC,DISP=SHR                      00015000
//RPFSYC   DD  DSN=BNKCAV.IN0.RP50.RPFSYC,DISP=SHR                      00016000
//RPFTRM   DD  DSN=BNKCAV.IN0.RP50.RPFTRM,DISP=SHR                      00017000
//RFFL06   DD  DSN=BNKCAV.IN0.RF21.RFFL06,DISP=SHR                      00001000
//RFFL09   DD  DSN=BNKCAV.IN0.RF21.RFFL09,DISP=SHR                      00002000
//RFFL10   DD  DSN=BNKCAV.IN0.RF21.RFFL10,DISP=SHR                      00003000
//RFFL11   DD  DSN=BNKCAV.IN0.RF21.RFFL11,DISP=SHR                      00004000
//RFFL12   DD  DSN=BNKCAV.IN0.RF21.RFFL12,DISP=SHR                      00005000
//RFFL13   DD  DSN=BNKCAV.IN0.RF21.RFFL13,DISP=SHR                      00006000
//RFFL15   DD  DSN=BNKCAV.IN0.RF21.RFFL15,DISP=SHR                      00007000
//*RFFL17   DD  DSN=BNKCAV.IN0.RF21.RFFL17,DISP=SHR                     00008000
//*RFFL18   DD  DSN=BNKCAV.IN0.RF21.RFFL18,DISP=SHR                     00009000
//RPTRNW2  DD  DSN=BNKCA.IN0.RP50.RPTRNW2,DISP=(OLD,KEEP,KEEP)          00027000
//PRINTK   DD  DSN=BNKCA.IN0.MI51.PRINTK,DISP=(NEW,CATLG,DELETE),       00028000
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=0133,BLKSIZE=23408),      00029000
//             SPACE=(CYL,(1,1),RLSE)                                   00030000
//*                                                                     00031000
//RPCARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD252),DISP=SHR              00032000
//*                                                                     00033000
//
