//RPD202D JOB
//*    ***********************************************                  00001000
//*    * RPD202 - ACCOUNT INCENTIVE EXCEPTION REPORT *                  00002000
//*    ***********************************************                  00003000
//RPD202   EXEC PGM=RPD202,REGION=1024K,COND=(0,LT)                     00004000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//* ====== OUTPUT FILE ==========================================       00006000
//SYSPRINT DD  SYSOUT=*                                                 00007000
//SYSUDUMP DD  SYSOUT=*                                                 00008000
//SYSOUT   DD  SYSOUT=*                                                 00009000
//* ====== INPUT FILE ===========================================       00010000
//RPACTE   DD  DSN=BNKCA.IN0.RP50.RPACTE,DISP=SHR                       00011000
//RPRPTS   DD  DSN=BNKCAV.IN0.RP50.RPRPTS,DISP=SHR                      00012000
//*                                                                     00013000
//RPCARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD202),DISP=SHR              00014000
//*                                                                     00015000
//
