//RPD201LS JOB
//***************************************************************       00001000
//*       LOAD ACCOUNT INCENTIVE RECORDS                        *       00002000
//***************************************************************       00003000
//RPD201IS EXEC PGM=IDCAMS,REGION=512K,COND=(0,LT)                      00004000
//SYSUDUMP DD   SYSOUT=*                                                00005000
//SYSABOUT DD   SYSOUT=*                                                00006000
//SYSOUT   DD   SYSOUT=*                                                00007000
//SYSPRINT DD   SYSOUT=*                                                00008000
//*                                                                     00009000
//SYSIN    DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPFACT),DISP=SHR              00010000
//*                                                                     00011000
//*                                                                     00012000
//********************************************************************  00013000
//*                                                                  *  00014000
//*   LOAD EXTRACTED RECORDS INTO RELATIONSHIP PRICING VSAM FILES    *  00015000
//*                                                                  *  00016000
//********************************************************************  00017000
//*                                                                     00018000
//RPD201LS EXEC PGM=BIS863B,REGION=4096K,COND=(0,LT)                    00019000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//BIPUTIL  DD  DSN=BNKCA.IN0.RP50.BLDACT,                               00021000
//             DISP=(OLD,KEEP,KEEP),                                    00022000
//             DCB=BUFNO=20                                             00023000
//BIPDSK1  DD  DSN=&&BIPDSK1,DISP=(,DELETE,DELETE),                     00024000
//             UNIT=SYSDA,SPACE=(CYL,(2,2),RLSE),                       00025000
//             DCB=(RECFM=VB,LRECL=2015,BLKSIZE=16300)                  00026000
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,2,,CONTIG)                         00027000
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,2,,CONTIG)                         00028000
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,2,,CONTIG)                         00029000
//*    **********************************************************       00001000
//*    * RPVSAMD1 - REL PRICING VSAM API SCALABLE DD STATEMENTS *       00002000
//*    **********************************************************       00003000
//RPFACT   DD  DSN=BNKCAV.IN0.RP50.RPFACT,DISP=SHR                      00004000
//RPFBNK   DD  DSN=BNKCAV.IN0.RP50.RPFBNK,DISP=SHR                      00005000
//RPFCRW   DD  DSN=BNKCAV.IN0.RP50.RPFCRW,DISP=SHR                      00006000
//RPFIDX   DD  DSN=BNKCAV.IN0.RP50.RPFIDX,DISP=SHR                      00007000
//RPFINTA  DD  DSN=BNKCAV.IN0.RP50.RPFINTA,DISP=SHR                     00008000
//RPFINTC  DD  DSN=BNKCAV.IN0.RP50.RPFINTC,DISP=SHR                     00009000
//RPFLOG   DD  DSN=BNKCAV.IN0.RP50.RPFLOG,DISP=SHR                      00010000
//RPFMSTA  DD  DSN=BNKCAV.IN0.RP50.RPFMSTA,DISP=SHR                     00011000
//RPFMSTC  DD  DSN=BNKCAV.IN0.RP50.RPFMSTC,DISP=SHR                     00012000
//RPFQUA   DD  DSN=BNKCAV.IN0.RP50.RPFQUA,DISP=SHR                      00013000
//RPFRELA  DD  DSN=BNKCAV.IN0.RP50.RPFRELA,DISP=SHR                     00014000
//RPFRELC  DD  DSN=BNKCAV.IN0.RP50.RPFRELC,DISP=SHR                     00015000
//RPFSEC   DD  DSN=BNKCAV.IN0.RP50.RPFSEC,DISP=SHR                      00016000
//RPFSYC   DD  DSN=BNKCAV.IN0.RP50.RPFSYC,DISP=SHR                      00017000
//RPFTRMA  DD  DSN=BNKCAV.IN0.RP50.RPFTRMA,DISP=SHR                     00018000
//RPFTRMC  DD  DSN=BNKCAV.IN0.RP50.RPFTRMC,DISP=SHR                     00019000
//BNKPRT1  DD  SYSOUT=*                                                 00031000
//SYSOUT   DD  SYSOUT=*                                                 00032000
//SYSPRINT DD  SYSOUT=*                                                 00033000
//* DSNTRACE DD  DUMMY                                                  00034000
//SYSIN    DD   *                                                       00035000
IPRP BNK INFOPNT  EN BIS863B  0 L 0                                     00036000
END                                                                     00037000
SAA                                                                     00038000
/*                                                                      00039000
//*                                                                     00040000
//
