//RPD550D JOB
//*    ************************************                             00001000
//*    * RPD550 - RP/RCIF SYNCHRONIZATION *                             00002000
//*    ************************************                             00003000
//SCRATCH  EXEC PGM=IEFBR14                                             00004000
//RFTRN    DD  DSN=BNKCA.IN0.RP50.RFTRN,DISP=(MOD,DELETE,DELETE),       00005000
//             UNIT=SYSDA,SPACE=(TRK,(1,1),RLSE)                        00006000
//RPD550   EXEC PGM=RPD550,REGION=4096K                                 00007000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00009000
//SYSUDUMP DD  SYSOUT=*                                                 00010000
//SYSOUT   DD  SYSOUT=*                                                 00011000
//PRINTR   DD  SYSOUT=2                                                 00012000
//RFTRN    DD  DSN=BNKCA.IN0.RP50.RFTRN,DISP=(NEW,CATLG,DELETE),        00013000
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=0660,BLKSIZE=23100),      00014000
//             SPACE=(CYL,(1,1),RLSE)                                   00015000
//
