//RPD500S JOB
//*    ********************************************                     00001000
//*    * RPD500 - INTERFACE SYNCHRONIZATION BUILD *                     00002000
//*    ********************************************                     00003000
//*                                                                     00004000
//*    *-------------------------------------------------*              00005000
//*    * DELETE/DEFINE RELATIONSHIP PRICING RPFSYC FILE  *              00006000
//*    *-------------------------------------------------*              00007000
//*                                                                     00008000
//RPD500IS EXEC  PGM=IDCAMS                                             00009000
//SYSOUT   DD  SYSOUT=*                                                 00010000
//SYSPRINT DD  SYSOUT=*                                                 00011000
//SYSUDUMP DD  SYSOUT=*                                                 00012000
//*                                                                     00013000
//SYSIN    DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPFSYC),DISP=SHR              00014000
//*                                                                     00015000
//*                                                                     00016000
//RPD500SS EXEC PGM=IEFBR14                                             00017000
//PRINTK   DD  DSN=BNKCA.IN0.MI51.PRINTK,                               00018000
//             DISP=(MOD,DELETE,DELETE),                                00019000
//             UNIT=SYSDA,SPACE=(TRK,(1,1),RLSE)                        00020000
//*                                                                     00021000
//RPD500S  EXEC PGM=RPD500,PARM='ORG=(1)',REGION=1024K                  00022000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00024000
//SYSUDUMP DD  SYSOUT=*                                                 00025000
//SYSOUT   DD  SYSOUT=*                                                 00026000
//PRINTR   DD  SYSOUT=*                                                 00027000
//PRFICH   DD  SYSOUT=*                                                 00028000
//PRINTA   DD  SYSOUT=*                                                 00029000
//PRINTB   DD  SYSOUT=*                                                 00030000
//PRINTC   DD  SYSOUT=*                                                 00031000
//PRINTD   DD  SYSOUT=*                                                 00032000
//PRINTE   DD  SYSOUT=*                                                 00033000
//PRINTF   DD  SYSOUT=*                                                 00034000
//PRINTG   DD  SYSOUT=*                                                 00035000
//PRINTH   DD  SYSOUT=*                                                 00036000
//PRINTI   DD  SYSOUT=*                                                 00037000
//PRINTJ   DD  SYSOUT=*                                                 00038000
//PRNTR01  DD  SYSOUT=*                                                 00039000
//*    **********************************************************       00001000
//*    * RPVSAMD1 - REL PRICING VSAM API SCALABLE DD STATEMENTS *       00002000
//*    **********************************************************       00003000
//RPFACT   DD  DSN=BNKCAV.IN0.RP50.RPFACT,DISP=SHR                      00004000
//RPFBNK   DD  DSN=BNKCAV.IN0.RP50.RPFBNK,DISP=SHR                      00005000
//RPFCRW   DD  DSN=BNKCAV.IN0.RP50.RPFCRW,DISP=SHR                      00006000
//RPFIDX   DD  DSN=BNKCAV.IN0.RP50.RPFIDX,DISP=SHR                      00007000
//RPFINTA  DD  DSN=BNKCAV.IN0.RP50.RPFINTA,DISP=SHR                     00008000
//RPFINTC  DD  DSN=BNKCAV.IN0.RP50.RPFINTC,DISP=SHR                     00009000
//RPFLOG   DD  DSN=BNKCAV.IN0.RP50.RPFLOG,DISP=SHR                      00010000
//RPFMSTA  DD  DSN=BNKCAV.IN0.RP50.RPFMSTA,DISP=SHR                     00011000
//RPFMSTC  DD  DSN=BNKCAV.IN0.RP50.RPFMSTC,DISP=SHR                     00012000
//RPFQUA   DD  DSN=BNKCAV.IN0.RP50.RPFQUA,DISP=SHR                      00013000
//RPFRELA  DD  DSN=BNKCAV.IN0.RP50.RPFRELA,DISP=SHR                     00014000
//RPFRELC  DD  DSN=BNKCAV.IN0.RP50.RPFRELC,DISP=SHR                     00015000
//RPFSEC   DD  DSN=BNKCAV.IN0.RP50.RPFSEC,DISP=SHR                      00016000
//RPFSYC   DD  DSN=BNKCAV.IN0.RP50.RPFSYC,DISP=SHR                      00017000
//RPFTRMA  DD  DSN=BNKCAV.IN0.RP50.RPFTRMA,DISP=SHR                     00018000
//RPFTRMC  DD  DSN=BNKCAV.IN0.RP50.RPFTRMC,DISP=SHR                     00019000
//PRINTK   DD  DSN=BNKCA.IN0.MI51.PRINTK,                               00041000
//             DISP=(NEW,CATLG,DELETE),                                 00042000
//             DCB=(RECFM=FB,LRECL=0133,BLKSIZE=11438),                 00043000
//             SPACE=(CYL,(1,1),RLSE),                                  00044000
//             UNIT=SYSDA                                               00045000
//*                                                                     00046000
//RPCARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD500),DISP=SHR              00047000
//*                                                                     00048000
/*                                                                      00049000
//
