//RPD500D JOB
//*    ********************************************                     00001000
//*    * RPD500 - INTERFACE SYNCHRONIZATION BUILD *                     00002000
//*    ********************************************                     00003000
//*                                                                     00004000
//SCRATCH  EXEC PGM=IEFBR14                                             00005000
//PRINTK   DD  DSN=BNKCA.IN0.MI51.PRINTK,DISP=(MOD,DELETE,DELETE),      00006000
//             UNIT=SYSDA,SPACE=(TRK,(1,1),RLSE)                        00007000
//*                                                                     00008000
//RPD500   EXEC PGM=RPD500,REGION=1024K                                 00009000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00011000
//SYSUDUMP DD  SYSOUT=*                                                 00012000
//SYSOUT   DD  SYSOUT=*                                                 00013000
//PRINTR   DD  SYSOUT=*                                                 00014000
//PRFICH   DD  SYSOUT=*                                                 00015000
//PRINTA   DD  SYSOUT=*                                                 00016000
//PRINTB   DD  SYSOUT=*                                                 00017000
//PRINTC   DD  SYSOUT=*                                                 00018000
//PRINTD   DD  SYSOUT=*                                                 00019000
//PRINTE   DD  SYSOUT=*                                                 00020000
//PRINTF   DD  SYSOUT=*                                                 00021000
//PRINTG   DD  SYSOUT=*                                                 00022000
//PRINTH   DD  SYSOUT=*                                                 00023000
//PRINTI   DD  SYSOUT=*                                                 00024000
//PRINTJ   DD  SYSOUT=*                                                 00025000
//PRNTR01  DD  SYSOUT=*                                                 00026000
//PRINTK   DD  DSN=BNKCA.IN0.MI51.PRINTK,DISP=(NEW,CATLG,DELETE),       00027000
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=0133,BLKSIZE=11438),      00028000
//             SPACE=(CYL,(1,1),RLSE)                                   00029000
//*                                                                     00030000
//RPCARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD500),DISP=SHR              00031000
//*                                                                     00032000
/*                                                                      00033000
//
