       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
001600
001390 01  PARAM1                         PIC X(78).
001390 01  PARAM2                         PIC X(78).
001780
001790 PROCEDURE DIVISION.
005350     EXIT PROGRAM.