         TITLE 'FORMAT GEN FOR AP0791 '                                 0000000
         PRINT NOGEN                                                    0000000
*  DIF/DOF FOR FORMAT AP0791                                            0000000
         SPACE                                                          0000000
AP0791   FMT                                                            0000000
         DEV   TYPE=(3270,2),FEAT=IGNORE,SYSMSG=F2402,DSCA=X'0080',    X0000000
               PFK=(PFIN,                                              X0000000
               'AP0791        ',        1                              X0000000
               '              ',        2                              X0000000
               '              ',        3                              X0000000
               '              ',        4                              X0000000
               '              ',        5                              X0000000
               '              ',        6                              X0000000
               '              ',        7                              X0000000
               '              ',        8                              X0000000
               '              ',        9                              X0000000
               'AP0791  PF10  ',       10                              X0000000
               '/FOR VC0158O. ',,      11                              X0000000
               'AP0791        ',       13                              X0000000
               '              ',       14                              X0000000
               '              ',       15                              X0000000
               '              ',       16                              X0000000
               '              ',       17                              X0000000
               '              ',       18                              X0000000
               '              ',       19                              X0000000
               '/FOR MF0616O. ',       20                              X0000000
               '              ',       21                              X0000000
               '/FOR MF0612O. ',       22                              X0000000
               '/FOR VC0158O. ')       23                               0000000
         DIV   TYPE=INOUT                                               0000000
         DPAGE CURSOR=((03,10)),FILL=NONE                               0000000
         ALPHA 'abcdefghijklmnopqrstuvwxyz'                             0000000
         DFLD  'AP0791O/AP0791',POS=(01,02)                             0000000
         DFLD  'MODEL AND ACCESSORY PRICING MAINTENANCE',              C0000000
               POS=(01,18)                                              0000000
         DFLD  'PIO ACCESSORY PART NUMBER MAINTENANCE',                C0000000
               POS=(02,19)                                              0000000
F0158    DFLD  POS=(01,58),LTH=0008,ATTR=(PROT,NUM,NOMOD)               0000000
F0168    DFLD  POS=(01,68),LTH=0008,ATTR=(PROT,NUM,NOMOD)               0000000
F0258    DFLD  POS=(02,58),LTH=0008,ATTR=(PROT,NUM,NOMOD)               0000000
         DFLD  'Action:',POS=(03,02)                                    0000000
F0310    DFLD  POS=(03,10),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F0315    DFLD  POS=(03,15),LTH=0001,ATTR=(NUM,NOMOD,PROT)               0000000
         DFLD  '(Add,Chg,Lis)',POS=(03,17),ATTR=NORM                    0000000
         DFLD  'ACC:',POS=(03,35)                                       0000000
F0340    DFLD  POS=(03,40),LTH=0002,ATTR=(NUM,MOD,PROT)                 0000000
         DFLD  'MDL YR:',POS=(03,46)                                    0000000
F0354    DFLD  POS=(03,54),LTH=0002,ATTR=(NUM,MOD,PROT)                 0000000
         DFLD  'PHASE:',POS=(03,71)                                     0000000
F0378    DFLD  POS=(03,78),LTH=0001,ATTR=(NUM,MOD,PROT)                 0000000
* PCPS CHANGES START
*        DFLD  'MODELS:',POS=(05,02)                                    0000000
         DFLD  'MODELS:',POS=(04,02)                                    0000000
*                                                                       0000000
*F0510    DFLD  POS=(05,10),LTH=0004,ATTR=(NUM,PROT,MOD)                0000000
*F0518    DFLD  POS=(05,18),LTH=0004,ATTR=(NUM,PROT,MOD)                0000000
*F0526    DFLD  POS=(05,26),LTH=0004,ATTR=(NUM,PROT,MOD)                0000000
*F0534    DFLD  POS=(05,34),LTH=0004,ATTR=(NUM,PROT,MOD)                0000000
*F0542    DFLD  POS=(05,42),LTH=0004,ATTR=(NUM,PROT,MOD)                0000000
*F0550    DFLD  POS=(05,50),LTH=0004,ATTR=(NUM,PROT,MOD)                0000000
*F0558    DFLD  POS=(05,58),LTH=0004,ATTR=(NUM,PROT,MOD)                0000000
*F0566    DFLD  POS=(05,66),LTH=0004,ATTR=(NUM,PROT,MOD)                0000000
*F0574    DFLD  POS=(05,74),LTH=0004,ATTR=(NUM,PROT,MOD)                0000000
F0410    DFLD  POS=(04,10),LTH=0004,ATTR=(NUM,PROT,MOD)
F0415    DFLD  POS=(04,15),LTH=0004,ATTR=(NUM,PROT,MOD)
F0420    DFLD  POS=(04,20),LTH=0004,ATTR=(NUM,PROT,MOD)
F0425    DFLD  POS=(04,25),LTH=0004,ATTR=(NUM,PROT,MOD)
F0430    DFLD  POS=(04,30),LTH=0004,ATTR=(NUM,PROT,MOD)
F0435    DFLD  POS=(04,35),LTH=0004,ATTR=(NUM,PROT,MOD)
F0440    DFLD  POS=(04,40),LTH=0004,ATTR=(NUM,PROT,MOD)
F0445    DFLD  POS=(04,45),LTH=0004,ATTR=(NUM,PROT,MOD)
F0450    DFLD  POS=(04,50),LTH=0004,ATTR=(NUM,PROT,MOD)
F0455    DFLD  POS=(04,55),LTH=0004,ATTR=(NUM,PROT,MOD)
F0460    DFLD  POS=(04,60),LTH=0004,ATTR=(NUM,PROT,MOD)
F0465    DFLD  POS=(04,65),LTH=0004,ATTR=(NUM,PROT,MOD)
F0470    DFLD  POS=(04,70),LTH=0004,ATTR=(NUM,PROT,MOD)
F0510    DFLD  POS=(05,10),LTH=0004,ATTR=(NUM,PROT,MOD)
F0515    DFLD  POS=(05,15),LTH=0004,ATTR=(NUM,PROT,MOD)
F0520    DFLD  POS=(05,20),LTH=0004,ATTR=(NUM,PROT,MOD)
F0525    DFLD  POS=(05,25),LTH=0004,ATTR=(NUM,PROT,MOD)
F0530    DFLD  POS=(05,30),LTH=0004,ATTR=(NUM,PROT,MOD)
F0535    DFLD  POS=(05,35),LTH=0004,ATTR=(NUM,PROT,MOD)
F0540    DFLD  POS=(05,40),LTH=0004,ATTR=(NUM,PROT,MOD)
F0545    DFLD  POS=(05,45),LTH=0004,ATTR=(NUM,PROT,MOD)
F0550    DFLD  POS=(05,50),LTH=0004,ATTR=(NUM,PROT,MOD)
F0555    DFLD  POS=(05,55),LTH=0004,ATTR=(NUM,PROT,MOD)
F0560    DFLD  POS=(05,60),LTH=0004,ATTR=(NUM,PROT,MOD)
F0565    DFLD  POS=(05,65),LTH=0004,ATTR=(NUM,PROT,MOD)
F0570    DFLD  POS=(05,70),LTH=0004,ATTR=(NUM,PROT,MOD)
F0659    DFLD  POS=(06,59),LTH=0013,ATTR=(HI,NUM,PROT,MOD)
*F0610    DFLD  POS=(06,10),LTH=0004,ATTR=(NUM,PROT,MOD)
*F0615    DFLD  POS=(06,15),LTH=0004,ATTR=(NUM,PROT,MOD)
*F0620    DFLD  POS=(06,20),LTH=0004,ATTR=(NUM,PROT,MOD)
*F0625    DFLD  POS=(06,25),LTH=0004,ATTR=(NUM,PROT,MOD)
*F0630    DFLD  POS=(06,30),LTH=0004,ATTR=(NUM,PROT,MOD)
*F0635    DFLD  POS=(06,35),LTH=0004,ATTR=(NUM,PROT,MOD)
*F0640    DFLD  POS=(06,40),LTH=0004,ATTR=(NUM,PROT,MOD)
*F0645    DFLD  POS=(06,45),LTH=0004,ATTR=(NUM,PROT,MOD)
*F0650    DFLD  POS=(06,50),LTH=0004,ATTR=(NUM,PROT,MOD)
*F0655    DFLD  POS=(06,55),LTH=0004,ATTR=(NUM,PROT,MOD)
*F0660    DFLD  POS=(06,60),LTH=0004,ATTR=(NUM,PROT,MOD)
*F0665    DFLD  POS=(06,65),LTH=0004,ATTR=(NUM,PROT,MOD)
*F0670    DFLD  POS=(06,70),LTH=0004,ATTR=(NUM,PROT,MOD)
*        DFLD  'Update All Models:',POS=(06,02)                         0000000
         DFLD  'Update All Models:',POS=(07,02)                         0000000
*F0622    DFLD  POS=(06,21),LTH=0001,ATTR=(ALPHA,MOD)                   0000000
*F0622    DFLD  POS=(06,20),LTH=0001,ATTR=(ALPHA,MOD)                   0000000
F0721    DFLD  POS=(07,21),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
*         DFLD  '(Y or N)',POS=(06,26),ATTR=NORM                        0000000
         DFLD  '(Y/N)',POS=(07,23),ATTR=NORM                            0000000
*                                                                       0000000
*F0658    DFLD  POS=(06,58),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0660    DFLD  POS=(06,60),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0662    DFLD  POS=(06,62),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0664    DFLD  POS=(06,64),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0666    DFLD  POS=(06,66),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0668    DFLD  POS=(06,68),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0670    DFLD  POS=(06,70),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0672    DFLD  POS=(06,72),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0674    DFLD  POS=(06,74),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0622    DFLD  POS=(06,21),LTH=0001,ATTR=(ALPHA,MOD)                   0000000
F0729    DFLD  POS=(07,29),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0731    DFLD  POS=(07,31),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0733    DFLD  POS=(07,33),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0735    DFLD  POS=(07,35),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0737    DFLD  POS=(07,37),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0739    DFLD  POS=(07,39),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0741    DFLD  POS=(07,41),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0743    DFLD  POS=(07,43),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0745    DFLD  POS=(07,45),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0747    DFLD  POS=(07,47),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0749    DFLD  POS=(07,49),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0751    DFLD  POS=(07,51),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0753    DFLD  POS=(07,53),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0755    DFLD  POS=(07,55),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0757    DFLD  POS=(07,57),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0759    DFLD  POS=(07,59),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0761    DFLD  POS=(07,61),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0763    DFLD  POS=(07,63),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0765    DFLD  POS=(07,65),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0767    DFLD  POS=(07,67),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0769    DFLD  POS=(07,69),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0771    DFLD  POS=(07,71),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0773    DFLD  POS=(07,73),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0775    DFLD  POS=(07,75),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0777    DFLD  POS=(07,77),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F0823    DFLD  POS=(08,23),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
*F0825    DFLD  POS=(08,25),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0827    DFLD  POS=(08,27),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0829    DFLD  POS=(08,29),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0831    DFLD  POS=(08,31),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0833    DFLD  POS=(08,33),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0835    DFLD  POS=(08,35),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0837    DFLD  POS=(08,37),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0839    DFLD  POS=(08,39),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0841    DFLD  POS=(08,41),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0843    DFLD  POS=(08,43),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0845    DFLD  POS=(08,45),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0847    DFLD  POS=(08,47),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*F0849    DFLD  POS=(08,49),LTH=0001,ATTR=(NODISP,PROT,MOD)             0000000
*                                                                       0000000
*PCPS CHANGES END
         DFLD  'SELECT   SELECT  PIO',POS=(08,02)                       0000000
         DFLD  'PART    COLOR    MAJOR',POS=(08,57)                     0000000
*                                                                       0000000
         DFLD  'MODEL   ACTION  CODE          PART',                   X0000000
               POS=(09,03)                                              0000000
         DFLD  'NUMBER           COMMENT   SENSE  COMPONENT',          X0000000
               POS=(09,38)                                              0000000
         DFLD  '(Chg,Del)',POS=(10,09),ATTR=NORM                        0000000
         DFLD  '(Y or N)',POS=(10,72),ATTR=NORM                         0000000
*                                                                       0000000
F1102    DFLD  POS=(11,02),LTH=0004,ATTR=(NUM,MOD)                      0000000
F1108    DFLD  POS=(11,08),LTH=0001,ATTR=(PROT,NOMOD)                   0000000
*                                                                       0000000
F1110    DFLD  POS=(11,10),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F1112    DFLD  POS=(11,12),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1117    DFLD  POS=(11,17),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1120    DFLD  POS=(11,20),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1123    DFLD  POS=(11,23),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1126    DFLD  POS=(11,26),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(11,33)                                          0000000
F1136    DFLD  POS=(11,36),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(11,43)                                          0000000
F1146    DFLD  POS=(11,46),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F1153    DFLD  POS=(11,53),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1158    DFLD  POS=(11,58),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1163    DFLD  POS=(11,63),LTH=0001,ATTR=(PROT,NOMOD,ALPHA)             0000000
F1167    DFLD  POS=(11,67),LTH=0002,ATTR=(ALPHA,MOD)                    0000000
F1171    DFLD  POS=(11,71),LTH=0001,ATTR=(PROT,NOMOD,ALPHA)             0000000
F1175    DFLD  POS=(11,75),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1178    DFLD  POS=(11,78),LTH=0001,ATTR=(PROT,NOMOD,ALPHA)             0000000
*                                                                       0000000
F1210    DFLD  POS=(12,10),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F1212    DFLD  POS=(12,12),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1217    DFLD  POS=(12,17),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1220    DFLD  POS=(12,20),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1223    DFLD  POS=(12,23),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1226    DFLD  POS=(12,26),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(12,33)                                          0000000
F1236    DFLD  POS=(12,36),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(12,43)                                          0000000
F1246    DFLD  POS=(12,46),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F1253    DFLD  POS=(12,53),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1258    DFLD  POS=(12,58),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1263    DFLD  POS=(12,63),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1267    DFLD  POS=(12,67),LTH=0002,ATTR=(ALPHA,MOD)                    0000000
F1271    DFLD  POS=(12,71),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1275    DFLD  POS=(12,75),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1278    DFLD  POS=(12,78),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
*                                                                       0000000
F1310    DFLD  POS=(13,10),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F1312    DFLD  POS=(13,12),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1317    DFLD  POS=(13,17),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1320    DFLD  POS=(13,20),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1323    DFLD  POS=(13,23),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1326    DFLD  POS=(13,26),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(13,33)                                          0000000
F1336    DFLD  POS=(13,36),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(13,43)                                          0000000
F1346    DFLD  POS=(13,46),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F1353    DFLD  POS=(13,53),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1358    DFLD  POS=(13,58),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1363    DFLD  POS=(13,63),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1367    DFLD  POS=(13,67),LTH=0002,ATTR=(ALPHA,MOD)                    0000000
F1371    DFLD  POS=(13,71),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1375    DFLD  POS=(13,75),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1378    DFLD  POS=(13,78),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
*                                                                       0000000
F1410    DFLD  POS=(14,10),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F1412    DFLD  POS=(14,12),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1417    DFLD  POS=(14,17),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1420    DFLD  POS=(14,20),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1423    DFLD  POS=(14,23),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1426    DFLD  POS=(14,26),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(14,33)                                          0000000
F1436    DFLD  POS=(14,36),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(14,43)                                          0000000
F1446    DFLD  POS=(14,46),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F1453    DFLD  POS=(14,53),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1458    DFLD  POS=(14,58),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1463    DFLD  POS=(14,63),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1467    DFLD  POS=(14,67),LTH=0002,ATTR=(ALPHA,MOD)                    0000000
F1471    DFLD  POS=(14,71),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1475    DFLD  POS=(14,75),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1478    DFLD  POS=(14,78),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
*                                                                       0000000
F1510    DFLD  POS=(15,10),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F1512    DFLD  POS=(15,12),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1517    DFLD  POS=(15,17),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1520    DFLD  POS=(15,20),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1523    DFLD  POS=(15,23),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1526    DFLD  POS=(15,26),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(15,33)                                          0000000
F1536    DFLD  POS=(15,36),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(15,43)                                          0000000
F1546    DFLD  POS=(15,46),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F1553    DFLD  POS=(15,53),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1558    DFLD  POS=(15,58),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1563    DFLD  POS=(15,63),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1567    DFLD  POS=(15,67),LTH=0002,ATTR=(ALPHA,MOD)                    0000000
F1571    DFLD  POS=(15,71),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1575    DFLD  POS=(15,75),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1578    DFLD  POS=(15,78),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
*                                                                       0000000
F1610    DFLD  POS=(16,10),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F1612    DFLD  POS=(16,12),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1617    DFLD  POS=(16,17),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1620    DFLD  POS=(16,20),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1623    DFLD  POS=(16,23),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1626    DFLD  POS=(16,26),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(16,33)                                          0000000
F1636    DFLD  POS=(16,36),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(16,43)                                          0000000
F1646    DFLD  POS=(16,46),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F1653    DFLD  POS=(16,53),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1658    DFLD  POS=(16,58),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1663    DFLD  POS=(16,63),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1667    DFLD  POS=(16,67),LTH=0002,ATTR=(ALPHA,MOD)                    0000000
F1671    DFLD  POS=(16,71),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1675    DFLD  POS=(16,75),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1678    DFLD  POS=(16,78),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
*                                                                       0000000
F1710    DFLD  POS=(17,10),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F1712    DFLD  POS=(17,12),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1717    DFLD  POS=(17,17),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1720    DFLD  POS=(17,20),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1723    DFLD  POS=(17,23),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1726    DFLD  POS=(17,26),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(17,33)                                          0000000
F1736    DFLD  POS=(17,36),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(17,43)                                          0000000
F1746    DFLD  POS=(17,46),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F1753    DFLD  POS=(17,53),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1758    DFLD  POS=(17,58),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1763    DFLD  POS=(17,63),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1767    DFLD  POS=(17,67),LTH=0002,ATTR=(ALPHA,MOD)                    0000000
F1771    DFLD  POS=(17,71),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1775    DFLD  POS=(17,75),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1778    DFLD  POS=(17,78),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
*                                                                       0000000
F1810    DFLD  POS=(18,10),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
F1812    DFLD  POS=(18,12),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1817    DFLD  POS=(18,17),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1820    DFLD  POS=(18,20),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1823    DFLD  POS=(18,23),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1826    DFLD  POS=(18,26),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(18,33)                                          0000000
F1836    DFLD  POS=(18,36),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(18,43)                                          0000000
F1846    DFLD  POS=(18,46),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F1853    DFLD  POS=(18,53),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1858    DFLD  POS=(18,58),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1863    DFLD  POS=(18,63),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1867    DFLD  POS=(18,67),LTH=0002,ATTR=(ALPHA,MOD)                    0000000
F1871    DFLD  POS=(18,71),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1875    DFLD  POS=(18,75),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1878    DFLD  POS=(18,78),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
*                                                                       0000000
         DFLD  'MAJ-REG',POS=(19,03),LTH=007                            0000000
F1912    DFLD  POS=(19,12),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1917    DFLD  POS=(19,17),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1920    DFLD  POS=(19,20),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1923    DFLD  POS=(19,23),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1926    DFLD  POS=(19,26),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(19,33)                                          0000000
F1936    DFLD  POS=(19,36),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(19,43)                                          0000000
F1946    DFLD  POS=(19,46),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F1953    DFLD  POS=(19,53),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1958    DFLD  POS=(19,58),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F1963    DFLD  POS=(19,63),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1967    DFLD  POS=(19,67),LTH=0002,ATTR=(ALPHA,MOD)                    0000000
F1971    DFLD  POS=(19,71),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F1975    DFLD  POS=(19,75),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F1978    DFLD  POS=(19,78),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
*                                                                       0000000
         DFLD  'MAJ-CAL',POS=(20,03),LTH=007                            0000000
F2012    DFLD  POS=(20,12),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F2017    DFLD  POS=(20,17),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F2020    DFLD  POS=(20,20),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F2023    DFLD  POS=(20,23),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F2026    DFLD  POS=(20,26),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(20,33)                                          0000000
F2036    DFLD  POS=(20,36),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
         DFLD  '-',POS=(20,43)                                          0000000
F2046    DFLD  POS=(20,46),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F2053    DFLD  POS=(20,53),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F2058    DFLD  POS=(20,58),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F2063    DFLD  POS=(20,63),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F2067    DFLD  POS=(20,67),LTH=0002,ATTR=(ALPHA,MOD)                    0000000
F2071    DFLD  POS=(20,71),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F2075    DFLD  POS=(20,75),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F2078    DFLD  POS=(20,78),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
*                                                                       0000000
F2110    DFLD  POS=(21,10),LTH=0001,ATTR=(NODISP,PROT,MOD)              0000000
         DFLD  'ADD',POS=(21,15),LTH=0003                               0000000
F2120    DFLD  POS=(21,20),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F2123    DFLD  POS=(21,23),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F2126    DFLD  POS=(21,26),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F2133    DFLD  POS=(21,33),LTH=0001,ATTR=(ALPHA,NOMOD)                  0000000
F2136    DFLD  POS=(21,36),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F2143    DFLD  POS=(21,43),LTH=0001,ATTR=(ALPHA,NOMOD)                  0000000
F2146    DFLD  POS=(21,46),LTH=0005,ATTR=(ALPHA,MOD)                    0000000
F2153    DFLD  POS=(21,53),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F2158    DFLD  POS=(21,58),LTH=0003,ATTR=(ALPHA,MOD)                    0000000
F2163    DFLD  POS=(21,63),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F2167    DFLD  POS=(21,67),LTH=0002,ATTR=(ALPHA,MOD)                    0000000
F2171    DFLD  POS=(21,71),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
F2175    DFLD  POS=(21,75),LTH=0001,ATTR=(ALPHA,MOD)                    0000000
F2178    DFLD  POS=(21,78),LTH=0001,ATTR=(NOMOD,PROT)                   0000000
*                                                                       0000000
F2202    DFLD  POS=(22,02),LTH=0015,ATTR=(NODISP,MOD,PROT)              0000000
F2219    DFLD  POS=(22,19),LTH=0009,ATTR=(NODISP,MOD,PROT)              0000000
F2230    DFLD  POS=(22,30),LTH=0001,ATTR=(NODISP,MOD,PROT)              0000000
F2235    DFLD  POS=(22,35),LTH=0001,ATTR=(NODISP,MOD,PROT)              0000000
F2240    DFLD  POS=(22,40),LTH=0001,ATTR=(NODISP,MOD,PROT)              0000000
F2243    DFLD  POS=(22,43),LTH=0001,ATTR=(NODISP,MOD,PROT)              0000000
F2245    DFLD  POS=(22,45),LTH=0001,ATTR=(NODISP,MOD,PROT)              0000000
F2247    DFLD  POS=(22,47),LTH=0001,ATTR=(NODISP,MOD,PROT)              0000000
F2249    DFLD  POS=(22,49),LTH=0001,ATTR=(NODISP,MOD,PROT)              0000000
*                                                                       0000000
*PCPS CHANGES START
HMODCD   DFLD  POS=(22,51),LTH=0004,ATTR=(NODISP,MOD,PROT)              0000000
HMDLYR   DFLD  POS=(22,56),LTH=0002,ATTR=(NODISP,MOD,PROT)              0000000
HACCCD   DFLD  POS=(22,59),LTH=0002,ATTR=(NODISP,MOD,PROT)              0000000
HACCPH   DFLD  POS=(22,62),LTH=0001,ATTR=(NODISP,MOD,PROT)              0000000
HPWD     DFLD  POS=(22,64),LTH=0008,ATTR=(NODISP,MOD,PROT)
HFLG     DFLD  POS=(22,73),LTH=0001,ATTR=(NODISP,MOD,PROT)
*PCPS CHANGES END
*                                                                       0000000
*                                                                       0000000
F2302    DFLD  POS=(23,02),LTH=79,ATTR=(HI,ALPHA,NOMOD,PROT)            0000000
F2402    DFLD  POS=(24,02),LTH=79,ATTR=(HI,ALPHA,NOMOD,PROT)            0000000
         FMTEND                                                         0000000
         TITLE 'FORMAT GEN FOR FORMAT AP0791I'                          02651000
         PRINT NOGEN                                                    02660000
*   MID FOR THE FORMAT PA0791                                           02670000
         SPACE                                                          02680000
AP0791I  MSG   TYPE=INPUT,SOR=PA0791,OPT=1,NXT=AP0791O                  02690000
         SEG                                                            02700000
         MFLD  (PFIN,'POA982        '),LTH=014,FILL=X'3F'               02710000
         MFLD  F0310,LTH=0003                                           02720000
         MFLD  F0340,LTH=0002                                           02730000
         MFLD  F0354,LTH=0002                                           02740000
         MFLD  F0378,LTH=0001                                           02750000
* PCPS CHANGES START
*        MFLD  F0510,LTH=0004                                           02760000
*        MFLD  F0518,LTH=0004                                           02770000
*        MFLD  F0526,LTH=0004                                           02780000
*        MFLD  F0534,LTH=0004                                           02790000
*        MFLD  F0542,LTH=0004                                           02800000
*        MFLD  F0550,LTH=0004                                           02810000
*        MFLD  F0558,LTH=0004                                           02820000
*        MFLD  F0566,LTH=0004                                           02830000
*        MFLD  F0574,LTH=0004                                           02840000
         MFLD  F0410,LTH=0004
         MFLD  F0415,LTH=0004
         MFLD  F0420,LTH=0004
         MFLD  F0425,LTH=0004
         MFLD  F0430,LTH=0004
         MFLD  F0435,LTH=0004
         MFLD  F0440,LTH=0004
         MFLD  F0445,LTH=0004
         MFLD  F0450,LTH=0004
         MFLD  F0455,LTH=0004
         MFLD  F0460,LTH=0004
         MFLD  F0465,LTH=0004
         MFLD  F0470,LTH=0004
         MFLD  F0510,LTH=0004
         MFLD  F0515,LTH=0004
         MFLD  F0520,LTH=0004
         MFLD  F0525,LTH=0004
         MFLD  F0530,LTH=0004
         MFLD  F0535,LTH=0004
         MFLD  F0540,LTH=0004
         MFLD  F0545,LTH=0004
         MFLD  F0550,LTH=0004
         MFLD  F0555,LTH=0004
         MFLD  F0560,LTH=0004
         MFLD  F0565,LTH=0004
         MFLD  F0570,LTH=0004
         MFLD  F0659,LTH=0013                                           02750000
*         MFLD  F0610,LTH=0004
*         MFLD  F0615,LTH=0004
*         MFLD  F0620,LTH=0004
*         MFLD  F0625,LTH=0004
*         MFLD  F0630,LTH=0004
*         MFLD  F0635,LTH=0004
*         MFLD  F0640,LTH=0004
*         MFLD  F0645,LTH=0004
*         MFLD  F0650,LTH=0004
*         MFLD  F0655,LTH=0004
*         MFLD  F0660,LTH=0004
*         MFLD  F0665,LTH=0004
*         MFLD  F0670,LTH=0004
* PCPS CHANGES END
*                                                                       02850000
*PCPS CHANGES START
*        MFLD  F0622,LTH=0001                                           02860000
         MFLD  F0721,LTH=0001                                           02860000
*        MFLD  F0658,LTH=0001                                           02870000
*        MFLD  F0660,LTH=0001                                           02880000
*        MFLD  F0662,LTH=0001                                           02890000
*        MFLD  F0664,LTH=0001                                           02900000
*        MFLD  F0666,LTH=0001                                           02910000
*        MFLD  F0668,LTH=0001                                           02920000
*        MFLD  F0670,LTH=0001                                           02930000
*        MFLD  F0672,LTH=0001                                           02940000
*        MFLD  F0674,LTH=0001                                           02950000
         MFLD  F0729,LTH=0001                                           02950000
         MFLD  F0731,LTH=0001                                           02950000
         MFLD  F0733,LTH=0001                                           02950000
         MFLD  F0735,LTH=0001                                           02950000
         MFLD  F0737,LTH=0001                                           02950000
         MFLD  F0739,LTH=0001                                           02950000
         MFLD  F0741,LTH=0001                                           02950000
         MFLD  F0743,LTH=0001                                           02950000
         MFLD  F0745,LTH=0001                                           02950000
         MFLD  F0747,LTH=0001                                           02950000
         MFLD  F0749,LTH=0001                                           02950000
         MFLD  F0751,LTH=0001                                           02950000
         MFLD  F0753,LTH=0001                                           02950000
         MFLD  F0755,LTH=0001                                           02950000
         MFLD  F0757,LTH=0001                                           02950000
         MFLD  F0759,LTH=0001                                           02950000
         MFLD  F0761,LTH=0001                                           02950000
         MFLD  F0763,LTH=0001                                           02950000
         MFLD  F0765,LTH=0001                                           02950000
         MFLD  F0767,LTH=0001                                           02950000
         MFLD  F0769,LTH=0001                                           02950000
         MFLD  F0771,LTH=0001                                           02950000
         MFLD  F0773,LTH=0001                                           02950000
         MFLD  F0775,LTH=0001                                           02950000
         MFLD  F0777,LTH=0001                                           02950000
         MFLD  F0823,LTH=0001                                           02950000
*         MFLD  F0825,LTH=0001                                          02950000
*         MFLD  F0827,LTH=0001                                          02950000
*         MFLD  F0829,LTH=0001                                          02950000
*         MFLD  F0831,LTH=0001                                          02950000
*         MFLD  F0833,LTH=0001                                          02950000
*         MFLD  F0835,LTH=0001                                          02950000
*         MFLD  F0837,LTH=0001                                          02950000
*         MFLD  F0839,LTH=0001                                          02950000
*         MFLD  F0841,LTH=0001                                          02950000
*         MFLD  F0843,LTH=0001                                          02950000
*         MFLD  F0845,LTH=0001                                          02950000
*         MFLD  F0847,LTH=0001                                          02950000
*         MFLD  F0849,LTH=0001                                          02950000
*PCPS CHANGES END
*                                                                       02960000
         MFLD  F1102,LTH=0004                                           02970000
*                                                                       02980000
         MFLD  F1110,LTH=0001                                           02990000
         MFLD  F1112,LTH=0003                                           03000000
         MFLD  F1120,LTH=0001                                           03010000
         MFLD  F1126,LTH=0005                                           03020000
         MFLD  F1136,LTH=0005                                           03030000
         MFLD  F1146,LTH=0005                                           03040000
         MFLD  F1158,LTH=0003                                           03050000
         MFLD  F1167,LTH=0002                                           03060000
         MFLD  F1175,LTH=0001                                           03070000
*                                                                       03080000
         MFLD  F1210,LTH=0001                                           03090000
         MFLD  F1212,LTH=0003                                           03100000
         MFLD  F1220,LTH=0001                                           03110000
         MFLD  F1226,LTH=0005                                           03120000
         MFLD  F1236,LTH=0005                                           03130000
         MFLD  F1246,LTH=0005                                           03140000
         MFLD  F1258,LTH=0003                                           03150000
         MFLD  F1267,LTH=0002                                           03160000
         MFLD  F1275,LTH=0001                                           03170000
*                                                                       03180000
         MFLD  F1310,LTH=0001                                           03190000
         MFLD  F1312,LTH=0003                                           03200000
         MFLD  F1320,LTH=0001                                           03210000
         MFLD  F1326,LTH=0005                                           03220000
         MFLD  F1336,LTH=0005                                           03230000
         MFLD  F1346,LTH=0005                                           03240000
         MFLD  F1358,LTH=0003                                           03250000
         MFLD  F1367,LTH=0002                                           03260000
         MFLD  F1375,LTH=0001                                           03270000
*                                                                       03280000
         MFLD  F1410,LTH=0001                                           03290000
         MFLD  F1412,LTH=0003                                           03300000
         MFLD  F1420,LTH=0001                                           03310000
         MFLD  F1426,LTH=0005                                           03320000
         MFLD  F1436,LTH=0005                                           03330000
         MFLD  F1446,LTH=0005                                           03340000
         MFLD  F1458,LTH=0003                                           03350000
         MFLD  F1467,LTH=0002                                           03360000
         MFLD  F1475,LTH=0001                                           03370000
*                                                                       03380000
         MFLD  F1510,LTH=0001                                           03390000
         MFLD  F1512,LTH=0003                                           03400000
         MFLD  F1520,LTH=0001                                           03410000
         MFLD  F1526,LTH=0005                                           03420000
         MFLD  F1536,LTH=0005                                           03430000
         MFLD  F1546,LTH=0005                                           03440000
         MFLD  F1558,LTH=0003                                           03450000
         MFLD  F1567,LTH=0002                                           03460000
         MFLD  F1575,LTH=0001                                           03470000
*                                                                       03480000
         MFLD  F1610,LTH=0001                                           03490000
         MFLD  F1612,LTH=0003                                           03500000
         MFLD  F1620,LTH=0001                                           03510000
         MFLD  F1626,LTH=0005                                           03520000
         MFLD  F1636,LTH=0005                                           03530000
         MFLD  F1646,LTH=0005                                           03540000
         MFLD  F1658,LTH=0003                                           03550000
         MFLD  F1667,LTH=0002                                           03560000
         MFLD  F1675,LTH=0001                                           03570000
*                                                                       03580000
         MFLD  F1710,LTH=0001                                           03590000
         MFLD  F1712,LTH=0003                                           03600000
         MFLD  F1720,LTH=0001                                           03610000
         MFLD  F1726,LTH=0005                                           03620000
         MFLD  F1736,LTH=0005                                           03630000
         MFLD  F1746,LTH=0005                                           03640000
         MFLD  F1758,LTH=0003                                           03650000
         MFLD  F1767,LTH=0002                                           03660000
         MFLD  F1775,LTH=0001                                           03670000
*                                                                       03680000
         MFLD  F1810,LTH=0001                                           03690000
         MFLD  F1812,LTH=0003                                           03700000
         MFLD  F1820,LTH=0001                                           03710000
         MFLD  F1826,LTH=0005                                           03720000
         MFLD  F1836,LTH=0005                                           03730000
         MFLD  F1846,LTH=0005                                           03740000
         MFLD  F1858,LTH=0003                                           03750000
         MFLD  F1867,LTH=0002                                           03760000
         MFLD  F1875,LTH=0001                                           03770000
*                                                                       03780000
         MFLD  F1912,LTH=0003                                           03790000
         MFLD  F1920,LTH=0001                                           03791000
         MFLD  F1926,LTH=0005                                           03800000
         MFLD  F1936,LTH=0005                                           03810000
         MFLD  F1946,LTH=0005                                           03820000
         MFLD  F1958,LTH=0003                                           03830000
         MFLD  F1967,LTH=0002                                           03840000
         MFLD  F1975,LTH=0001                                           03850000
*                                                                       03860000
         MFLD  F2012,LTH=0003                                           03870000
         MFLD  F2020,LTH=0001                                           03871000
         MFLD  F2026,LTH=0005                                           03880000
         MFLD  F2036,LTH=0005                                           03890000
         MFLD  F2046,LTH=0005                                           03900000
         MFLD  F2058,LTH=0003                                           03910000
         MFLD  F2067,LTH=0002                                           03920000
         MFLD  F2075,LTH=0001                                           03930000
*                                                                       03940000
         MFLD  F2110,LTH=0001                                           03950000
         MFLD  F2120,LTH=0001                                           03960000
         MFLD  F2126,LTH=0005                                           03970000
         MFLD  F2136,LTH=0005                                           03980000
         MFLD  F2146,LTH=0005                                           03990000
         MFLD  F2158,LTH=0003                                           04000000
         MFLD  F2167,LTH=0002                                           04010000
         MFLD  F2175,LTH=0001                                           04020000
*                                                                       04030000
         MFLD  F2202,LTH=0015                                           04040000
         MFLD  F2219,LTH=0009                                           04050000
         MFLD  F2230,LTH=0001                                           04060000
         MFLD  F2235,LTH=0001                                           04070000
         MFLD  F2240,LTH=0001                                           04080000
         MFLD  F2243,LTH=0001                                           04090000
         MFLD  F2245,LTH=0001                                           04100000
         MFLD  F2247,LTH=0001                                           04110000
         MFLD  F2249,LTH=0001                                           04120000
*PCPS CHANGES START
         MFLD  HMODCD,LTH=0004                                          04120000
         MFLD  HMDLYR,LTH=0002                                          04120000
         MFLD  HACCCD,LTH=0002                                          04120000
         MFLD  HACCPH,LTH=0001                                          04120000
         MFLD  HPWD,LTH=0008                                            04120000
         MFLD  HFLG,LTH=0001                                            04120000
*PCPS CHANGES END
*                                                                       04130000
         MSGEND                                                         04140000
         TITLE 'FORMAT GEN FOR FORMAT PA0791'                           00010000
         PRINT NOGEN                                                    00020000
*   MOD FOR THE FORMAT PA0791                                           00030000
         SPACE                                                          00040000
AP0791O  MSG   TYPE=OUTPUT,SOR=(PA0791,IGNORE),OPT=1,                  X00050000
               NXT=AP0791I,FILL=PT                                      00060000
         SEG                                                            00070000
         MFLD  (F0153,DATE2)                                            00080000
         MFLD  (F0163,LTNAME)                                           00090000
         MFLD  (F0253,TIME)                                             00100000
         MFLD  F0310,LTH=0005,ATTR=YES                                  00110000
         MFLD  F0315,LTH=0001                                           00120000
         MFLD  F0340,LTH=0002                                           00130000
         MFLD  F0354,LTH=0002                                           00140000
         MFLD  F0378,LTH=0001                                           00150000
*PCPS CHANGES START
*        MFLD  F0510,LTH=0004                                           00160000
*        MFLD  F0518,LTH=0004                                           00170000
*        MFLD  F0526,LTH=0004                                           00180000
*        MFLD  F0534,LTH=0004                                           00190000
*        MFLD  F0542,LTH=0004                                           00200000
*        MFLD  F0550,LTH=0004                                           00210000
*        MFLD  F0558,LTH=0004                                           00220000
*        MFLD  F0566,LTH=0004                                           00230000
*        MFLD  F0574,LTH=0004                                           00240000
         MFLD  F0410,LTH=0004                                           00240000
         MFLD  F0415,LTH=0004                                           00240000
         MFLD  F0420,LTH=0004                                           00240000
         MFLD  F0425,LTH=0004                                           00240000
         MFLD  F0430,LTH=0004                                           00240000
         MFLD  F0435,LTH=0004                                           00240000
         MFLD  F0440,LTH=0004                                           00240000
         MFLD  F0445,LTH=0004                                           00240000
         MFLD  F0450,LTH=0004                                           00240000
         MFLD  F0455,LTH=0004                                           00240000
         MFLD  F0460,LTH=0004                                           00240000
         MFLD  F0465,LTH=0004                                           00240000
         MFLD  F0470,LTH=0004                                           00240000
         MFLD  F0510,LTH=0004                                           00240000
         MFLD  F0515,LTH=0004                                           00240000
         MFLD  F0520,LTH=0004                                           00240000
         MFLD  F0525,LTH=0004                                           00240000
         MFLD  F0530,LTH=0004                                           00240000
         MFLD  F0535,LTH=0004                                           00240000
         MFLD  F0540,LTH=0004                                           00240000
         MFLD  F0545,LTH=0004                                           00240000
         MFLD  F0550,LTH=0004                                           00240000
         MFLD  F0555,LTH=0004                                           00240000
         MFLD  F0560,LTH=0004                                           00240000
         MFLD  F0565,LTH=0004                                           00240000
         MFLD  F0570,LTH=0004                                           00240000
         MFLD  F0659,LTH=0013                                           00150000
*         MFLD  F0610,LTH=0004                                          00240000
*         MFLD  F0615,LTH=0004                                          00240000
*         MFLD  F0620,LTH=0004                                          00240000
*         MFLD  F0625,LTH=0004                                          00240000
*         MFLD  F0630,LTH=0004                                          00240000
*         MFLD  F0635,LTH=0004                                          00240000
*         MFLD  F0640,LTH=0004                                          00240000
*         MFLD  F0645,LTH=0004                                          00240000
*         MFLD  F0650,LTH=0004                                          00240000
*         MFLD  F0655,LTH=0004                                          00240000
*         MFLD  F0660,LTH=0004                                          00240000
*         MFLD  F0665,LTH=0004                                          00240000
*         MFLD  F0670,LTH=0004                                          00240000
*PCPS CHANGES END
*                                                                       00250000
*PCPS CHANGES START
*        MFLD  F0622,LTH=0001                                           00260000
         MFLD  F0721,LTH=0001                                           00260000
*        MFLD  F0658,LTH=0001                                           00270000
*        MFLD  F0660,LTH=0001                                           00280000
*        MFLD  F0662,LTH=0001                                           00290000
*        MFLD  F0664,LTH=0001                                           00300000
*        MFLD  F0666,LTH=0001                                           00310000
*        MFLD  F0668,LTH=0001                                           00320000
*        MFLD  F0670,LTH=0001                                           00330000
*        MFLD  F0672,LTH=0001                                           00340000
*        MFLD  F0674,LTH=0001                                           00350000
         MFLD  F0729,LTH=0001                                           00350000
         MFLD  F0731,LTH=0001                                           00350000
         MFLD  F0733,LTH=0001                                           00350000
         MFLD  F0735,LTH=0001                                           00350000
         MFLD  F0737,LTH=0001                                           00350000
         MFLD  F0739,LTH=0001                                           00350000
         MFLD  F0741,LTH=0001                                           00350000
         MFLD  F0743,LTH=0001                                           00350000
         MFLD  F0745,LTH=0001                                           00350000
         MFLD  F0747,LTH=0001                                           00350000
         MFLD  F0749,LTH=0001                                           00350000
         MFLD  F0751,LTH=0001                                           00350000
         MFLD  F0753,LTH=0001                                           00350000
         MFLD  F0755,LTH=0001                                           00350000
         MFLD  F0757,LTH=0001                                           00350000
         MFLD  F0759,LTH=0001                                           00350000
         MFLD  F0761,LTH=0001                                           00350000
         MFLD  F0763,LTH=0001                                           00350000
         MFLD  F0765,LTH=0001                                           00350000
         MFLD  F0767,LTH=0001                                           00350000
         MFLD  F0769,LTH=0001                                           00350000
         MFLD  F0771,LTH=0001                                           00350000
         MFLD  F0773,LTH=0001                                           00350000
         MFLD  F0775,LTH=0001                                           00350000
         MFLD  F0777,LTH=0001                                           00350000
         MFLD  F0823,LTH=0001                                           00350000
*         MFLD  F0825,LTH=0001                                          00350000
*         MFLD  F0827,LTH=0001                                          00350000
*         MFLD  F0829,LTH=0001                                          00350000
*         MFLD  F0831,LTH=0001                                          00350000
*         MFLD  F0833,LTH=0001                                          00350000
*         MFLD  F0835,LTH=0001                                          00350000
*         MFLD  F0837,LTH=0001                                          00350000
*         MFLD  F0839,LTH=0001                                          00350000
*         MFLD  F0841,LTH=0001                                          00350000
*         MFLD  F0843,LTH=0001                                          00350000
*         MFLD  F0845,LTH=0001                                          00350000
*         MFLD  F0847,LTH=0001                                          00350000
*         MFLD  F0849,LTH=0001                                          00350000
*PCPS CHANGES END
*                                                                       00360000
         MFLD  F1102,LTH=0006,ATTR=YES                                  00370000
         MFLD  F1108,LTH=0001                                           00380000
*                                                                       00390000
         MFLD  F1110,LTH=0001                                           00400000
         MFLD  F1112,LTH=0005,ATTR=YES                                  00410000
         MFLD  F1117,LTH=0001                                           00420000
         MFLD  F1120,LTH=0003,ATTR=YES                                  00430000
         MFLD  F1123,LTH=0001                                           00440000
         MFLD  F1126,LTH=0007,ATTR=YES                                  00450000
         MFLD  F1136,LTH=0007,ATTR=YES                                  00460000
         MFLD  F1146,LTH=0007,ATTR=YES                                  00470000
         MFLD  F1153,LTH=0001                                           00480000
         MFLD  F1158,LTH=0005,ATTR=YES                                  00490000
         MFLD  F1163,LTH=0001                                           00500000
         MFLD  F1167,LTH=0004,ATTR=YES                                  00510000
         MFLD  F1171,LTH=0001                                           00520000
         MFLD  F1175,LTH=0003,ATTR=YES                                  00530000
         MFLD  F1178,LTH=0001                                           00540000
*                                                                       00550000
         MFLD  F1210,LTH=0001                                           00560000
         MFLD  F1212,LTH=0005,ATTR=YES                                  00570000
         MFLD  F1217,LTH=0001                                           00580000
         MFLD  F1220,LTH=0003,ATTR=YES                                  00590000
         MFLD  F1223,LTH=0001                                           00600000
         MFLD  F1226,LTH=0007,ATTR=YES                                  00610000
         MFLD  F1236,LTH=0007,ATTR=YES                                  00620000
         MFLD  F1246,LTH=0007,ATTR=YES                                  00630000
         MFLD  F1253,LTH=0001                                           00640000
         MFLD  F1258,LTH=0005,ATTR=YES                                  00650000
         MFLD  F1263,LTH=0001                                           00660000
         MFLD  F1267,LTH=0004,ATTR=YES                                  00670000
         MFLD  F1271,LTH=0001                                           00680000
         MFLD  F1275,LTH=0003,ATTR=YES                                  00690000
         MFLD  F1278,LTH=0001                                           00700000
*                                                                       00710000
         MFLD  F1310,LTH=0001                                           00720000
         MFLD  F1312,LTH=0005,ATTR=YES                                  00730000
         MFLD  F1317,LTH=0001                                           00740000
         MFLD  F1320,LTH=0003,ATTR=YES                                  00750000
         MFLD  F1323,LTH=0001                                           00760000
         MFLD  F1326,LTH=0007,ATTR=YES                                  00770000
         MFLD  F1336,LTH=0007,ATTR=YES                                  00780000
         MFLD  F1346,LTH=0007,ATTR=YES                                  00790000
         MFLD  F1353,LTH=0001                                           00800000
         MFLD  F1358,LTH=0005,ATTR=YES                                  00810000
         MFLD  F1363,LTH=0001                                           00820000
         MFLD  F1367,LTH=0004,ATTR=YES                                  00830000
         MFLD  F1371,LTH=0001                                           00840000
         MFLD  F1375,LTH=0003,ATTR=YES                                  00850000
         MFLD  F1378,LTH=0001                                           00860000
*                                                                       00870000
         MFLD  F1410,LTH=0001                                           00880000
         MFLD  F1412,LTH=0005,ATTR=YES                                  00890000
         MFLD  F1417,LTH=0001                                           00900000
         MFLD  F1420,LTH=0003,ATTR=YES                                  00910000
         MFLD  F1423,LTH=0001                                           00920000
         MFLD  F1426,LTH=0007,ATTR=YES                                  00930000
         MFLD  F1436,LTH=0007,ATTR=YES                                  00940000
         MFLD  F1446,LTH=0007,ATTR=YES                                  00950000
         MFLD  F1453,LTH=0001                                           00960000
         MFLD  F1458,LTH=0005,ATTR=YES                                  00970000
         MFLD  F1463,LTH=0001                                           00980000
         MFLD  F1467,LTH=0004,ATTR=YES                                  00990000
         MFLD  F1471,LTH=0001                                           01000000
         MFLD  F1475,LTH=0003,ATTR=YES                                  01010000
         MFLD  F1478,LTH=0001                                           01020000
*                                                                       01030000
         MFLD  F1510,LTH=0001                                           01040000
         MFLD  F1512,LTH=0005,ATTR=YES                                  01050000
         MFLD  F1517,LTH=0001                                           01060000
         MFLD  F1520,LTH=0003,ATTR=YES                                  01070000
         MFLD  F1523,LTH=0001                                           01080000
         MFLD  F1526,LTH=0007,ATTR=YES                                  01090000
         MFLD  F1536,LTH=0007,ATTR=YES                                  01100000
         MFLD  F1546,LTH=0007,ATTR=YES                                  01110000
         MFLD  F1553,LTH=0001                                           01120000
         MFLD  F1558,LTH=0005,ATTR=YES                                  01130000
         MFLD  F1563,LTH=0001                                           01140000
         MFLD  F1567,LTH=0004,ATTR=YES                                  01150000
         MFLD  F1571,LTH=0001                                           01160000
         MFLD  F1575,LTH=0003,ATTR=YES                                  01170000
         MFLD  F1578,LTH=0001                                           01180000
*                                                                       01190000
         MFLD  F1610,LTH=0001                                           01200000
         MFLD  F1612,LTH=0005,ATTR=YES                                  01210000
         MFLD  F1617,LTH=0001                                           01220000
         MFLD  F1620,LTH=0003,ATTR=YES                                  01230000
         MFLD  F1623,LTH=0001                                           01240000
         MFLD  F1626,LTH=0007,ATTR=YES                                  01250000
         MFLD  F1636,LTH=0007,ATTR=YES                                  01260000
         MFLD  F1646,LTH=0007,ATTR=YES                                  01270000
         MFLD  F1653,LTH=0001                                           01280000
         MFLD  F1658,LTH=0005,ATTR=YES                                  01290000
         MFLD  F1663,LTH=0001                                           01300000
         MFLD  F1667,LTH=0004,ATTR=YES                                  01310000
         MFLD  F1671,LTH=0001                                           01320000
         MFLD  F1675,LTH=0003,ATTR=YES                                  01330000
         MFLD  F1678,LTH=0001                                           01340000
*                                                                       01350000
         MFLD  F1710,LTH=0001                                           01360000
         MFLD  F1712,LTH=0005,ATTR=YES                                  01370000
         MFLD  F1717,LTH=0001                                           01380000
         MFLD  F1720,LTH=0003,ATTR=YES                                  01390000
         MFLD  F1723,LTH=0001                                           01400000
         MFLD  F1726,LTH=0007,ATTR=YES                                  01410000
         MFLD  F1736,LTH=0007,ATTR=YES                                  01420000
         MFLD  F1746,LTH=0007,ATTR=YES                                  01430000
         MFLD  F1753,LTH=0001                                           01440000
         MFLD  F1758,LTH=0005,ATTR=YES                                  01450000
         MFLD  F1763,LTH=0001                                           01460000
         MFLD  F1767,LTH=0004,ATTR=YES                                  01470000
         MFLD  F1771,LTH=0001                                           01480000
         MFLD  F1775,LTH=0003,ATTR=YES                                  01490000
         MFLD  F1778,LTH=0001                                           01500000
*                                                                       01510000
         MFLD  F1810,LTH=0001                                           01520000
         MFLD  F1812,LTH=0005,ATTR=YES                                  01530000
         MFLD  F1817,LTH=0001                                           01540000
         MFLD  F1820,LTH=0003,ATTR=YES                                  01550000
         MFLD  F1823,LTH=0001                                           01560000
         MFLD  F1826,LTH=0007,ATTR=YES                                  01570000
         MFLD  F1836,LTH=0007,ATTR=YES                                  01580000
         MFLD  F1846,LTH=0007,ATTR=YES                                  01590000
         MFLD  F1853,LTH=0001                                           01600000
         MFLD  F1858,LTH=0005,ATTR=YES                                  01610000
         MFLD  F1863,LTH=0001                                           01620000
         MFLD  F1867,LTH=0004,ATTR=YES                                  01630000
         MFLD  F1871,LTH=0001                                           01640000
         MFLD  F1875,LTH=0003,ATTR=YES                                  01650000
         MFLD  F1878,LTH=0001                                           01660000
*                                                                       01670000
         MFLD  F1912,LTH=0005,ATTR=YES                                  01680000
         MFLD  F1917,LTH=0001                                           01690000
         MFLD  F1920,LTH=0003,ATTR=YES                                  01691000
         MFLD  F1923,LTH=0001                                           01692000
         MFLD  F1926,LTH=0007,ATTR=YES                                  01700000
         MFLD  F1936,LTH=0007,ATTR=YES                                  01710000
         MFLD  F1946,LTH=0007,ATTR=YES                                  01720000
         MFLD  F1953,LTH=0001                                           01730000
         MFLD  F1958,LTH=0005,ATTR=YES                                  01740000
         MFLD  F1963,LTH=0001                                           01750000
         MFLD  F1967,LTH=0004,ATTR=YES                                  01760000
         MFLD  F1971,LTH=0001                                           01770000
         MFLD  F1975,LTH=0003,ATTR=YES                                  01780000
         MFLD  F1978,LTH=0001                                           01790000
*                                                                       01800000
         MFLD  F2012,LTH=0005,ATTR=YES                                  01810000
         MFLD  F2017,LTH=0001                                           01820000
         MFLD  F2020,LTH=0003,ATTR=YES                                  01821000
         MFLD  F2023,LTH=0001                                           01822000
         MFLD  F2026,LTH=0007,ATTR=YES                                  01830000
         MFLD  F2036,LTH=0007,ATTR=YES                                  01840000
         MFLD  F2046,LTH=0007,ATTR=YES                                  01850000
         MFLD  F2053,LTH=0001                                           01860000
         MFLD  F2058,LTH=0005,ATTR=YES                                  01870000
         MFLD  F2063,LTH=0001                                           01880000
         MFLD  F2067,LTH=0004,ATTR=YES                                  01890000
         MFLD  F2071,LTH=0001                                           01900000
         MFLD  F2075,LTH=0003,ATTR=YES                                  01910000
         MFLD  F2078,LTH=0001                                           01920000
*                                                                       01930000
         MFLD  F2110,LTH=0001                                           01940000
         MFLD  F2120,LTH=0003,ATTR=YES                                  01950000
         MFLD  F2123,LTH=0001                                           01960000
         MFLD  F2126,LTH=0007,ATTR=YES                                  01970000
         MFLD  F2133,LTH=0003,ATTR=YES                                  01980000
         MFLD  F2136,LTH=0007,ATTR=YES                                  01990000
         MFLD  F2143,LTH=0003,ATTR=YES                                  02000000
         MFLD  F2146,LTH=0007,ATTR=YES                                  02010000
         MFLD  F2153,LTH=0001                                           02020000
         MFLD  F2158,LTH=0005,ATTR=YES                                  02030000
         MFLD  F2163,LTH=0001                                           02040000
         MFLD  F2167,LTH=0004,ATTR=YES                                  02050000
         MFLD  F2171,LTH=0001                                           02060000
         MFLD  F2175,LTH=0003,ATTR=YES                                  02070000
         MFLD  F2178,LTH=0001                                           02080000
*                                                                       02090000
         MFLD  F2202,LTH=0015                                           02100000
         MFLD  F2219,LTH=0009                                           02110000
         MFLD  F2230,LTH=0001                                           02120000
         MFLD  F2235,LTH=0001                                           02130000
         MFLD  F2240,LTH=0001                                           02140000
         MFLD  F2243,LTH=0001                                           02150000
         MFLD  F2245,LTH=0001                                           02160000
         MFLD  F2247,LTH=0001                                           02170000
         MFLD  F2249,LTH=0001                                           02180000
*PCPS CHANGES START
         MFLD  HMODCD,LTH=0004                                          02180000
         MFLD  HMDLYR,LTH=0002                                          02180000
         MFLD  HACCCD,LTH=0002                                          02180000
         MFLD  HACCPH,LTH=0001                                          02180000
         MFLD  HPWD,LTH=0008                                            02180000
         MFLD  HFLG,LTH=0001                                            02180000
*PCPS CHANGES END
*                                                                       02190000
         MFLD  F2302,LTH=0079                                           02200000
         MSGEND                                                         02220000
         END                                                            02230000
