*                                                                       00000900
          PSBGEN LANG=COBOL,PSBNAME=APL001,CMPAT=YES                    00001000
          END                                                           00001100
