   PCB      TYPE=DB,DBDNAME=PTM,KEYLEN=27
   SENSEG   NAME=STMROOT,PARENT=0,PROCOPT=G
   SENSEG   NAME=STMPACC,PARENT=STMROOT,PROCOPT=G
   SENSEG   NAME=STMPART,PARENT=STMPACC,PROCOPT=GIRD
*
***********************   PARTS DATA BASE   ************************
   PCB      TYPE=DB,DBDNAME=PPT,KEYLEN=15
   SENSEG   NAME=PTROOT,PARENT=0,PROCOPT=G
*
********************  TRANSACTION DATA BASE   **********************
   PCB      TYPE=DB,DBDNAME=PTX,KEYLEN=54
   SENSEG   NAME=TXROOT,PARENT=0,PROCOPT=I
**********************************************************************
   PSBGEN   LANG=COBOL,CMPAT=YES,PSBNAME=APL002,MAXQ=005
   END
