         PCB   TYPE=TP,                                                X        
               MODIFY=YES,
               PCBNAME=PCB1,
               EXTERNALNAME=EPCB1,                                     X        
               EXPRESS=YES                                                      
                                                                             
         PCB   TYPE=TP,                                                X        
               EXTERNALNAME=EPCB2,                                     X        
               KEYLEN=8,                                               X        
               PROCOPT=AEP                                                      
         SENSEG NAME=FFFFGROP,PARENT=0                                          
         SENSEG NAME=FFFFNAME,PARENT=FFFFGROP                                   
*                                                                                                                                            
         PCB   TYPE=TP,                                                X        
               PCBNAME=PCB3,                                           X        
               KEYLEN=8,                                               X        
               PROCOPT=GOTP                                                     
         SENSEG NAME=CS02USER,PARENT=0                                          
*                                                                  
         PCB   TYPE=TP,                                                X               
               KEYLEN=8,                                               X        
               PROCOPT=GOTP                                                     
         SENSEG NAME=CS02USER,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,                                            X        
               PSBNAME=CDA001,                                         X        
               CMPAT=YES                                                        
         END                                                                    
