*   SCREEN  1                                     PROJECT=              00010000
*   FORMAT FOR SCREEN  AP000101                    6/05/90  NEW SCREEN  00020000
         PRINT NOGEN                                                    00030000
         ALPHA 'abcdefghijklmnopqrstuvwxyz'                             00040000
AP0001   FMT                                                            00050000
         DEV   TYPE=(3270,2),FEAT=IGNORE,SYSMSG=F2402,                 X00060000
               PFK=(PFIN,1='AP0001   2   ',2='AP0001   3   ',3='/FOR PSX00070000
               0800O.',4='/FOR PS0800O.',5='/FOR PS0800O.',6='/FOR PS08X00080000
               00O.',7='/FOR PS0800O.',8='/FOR PS0800O.',9='/FOR PS0800X00090000
               O.',10='/FOR PS0800O.',11='/FOR PS0001O.',13='AP0001   2X00100000
                  ',14='AP0001   3   ',15='/FOR PS0800O.',16='/FOR PS08X00110000
               00O.',17='/FOR PS0800O.',18='/FOR PS0800O.',19='/FOR PS0X00120000
               800O.',20='/FOR PS0800O.',21='/FOR PS0800O.',22='/FOR PSX00130000
               0800O.',23='/FOR PS0001O.'),DSCA=X'0080'                 00140000
         DIV   TYPE=INOUT                                               00150000
AP000101 DPAGE CURSOR=((05,21)),FILL=NONE                               00160000
         DFLD  'AP0001O',POS=(1,2),ATTR=(NUM,PROT)                      00170000
         DFLD  'PARTS ACCESSORY SALES',POS=(1,30),ATTR=(NUM,PROT)       00180000
F0159    DFLD  LTH=8,POS=(1,58),ATTR=(NUM,PROT)                         00190000
F0169    DFLD  LTH=8,POS=(1,68),ATTR=(NUM,PROT)                         00200000
         DFLD  'WHOLESALE INSTALLATION RATES',POS=(2,27),              X00210000
               ATTR=(NUM,PROT)                                          00220000
F0259    DFLD  LTH=8,POS=(2,58),ATTR=(NUM,PROT)                         00230000
F0302    DFLD  LTH=12,POS=(3,2),ATTR=(PROT,NODISP,MOD)                  00240000
         DFLD  'Press',POS=(5,23),ATTR=(NUM,PROT)                       00250000
         DFLD  'ENTER',POS=(5,29),ATTR=(NUM,PROT,HI)                    00260000
         DFLD  'to Sign On.',POS=(5,35),ATTR=(NUM,PROT)                 00270000
         DFLD  'Then press one of the following:',POS=(7,23),          X00280000
               ATTR=(NUM,PROT)                                          00290000
         DFLD  'PF1',POS=(9,23),ATTR=(NUM,PROT,HI)                      00300000
         DFLD  'Browse APS Objectives',POS=(9,29),ATTR=(NUM,PROT)       00310000
         DFLD  'PF2',POS=(10,23),ATTR=(NUM,PROT,HI)                     00320000
         DFLD  'Update APS Objectives',POS=(10,29),ATTR=(NUM,PROT)      00330000
         DFLD  'PF10',POS=(12,23),ATTR=(NUM,PROT,HI)                    00340000
         DFLD  'Return to "APS" Menu',POS=(12,29),ATTR=(NUM,PROT)       00350000
         DFLD  'PF11',POS=(13,23),ATTR=(NUM,PROT,HI)                    00360000
         DFLD  'Return to Parts Master Menu',POS=(13,29),              X00370000
               ATTR=(NUM,PROT)                                          00380000
F2402    DFLD  LTH=79,POS=(24,2),ATTR=(NUM,PROT,HI)                     00390000
         FMTEND                                                         00400000
         EJECT                                                          00410000
*   SCREEN  1                                     PROJECT=              00420000
*        MESSAGE INPUT DESCRIPTOR                  6/05/90  NEW SCREEN  00430000
         PRINT NOGEN                                                    00440000
AP0001I  MSG   TYPE=INPUT,SOR=AP0001,NXT=AP0001O,OPT=1                  00450000
         SEG                                                            00460000
         MFLD  (PFIN,'/SIGN ON PACTRANS NOTELL  '),LTH=26               00470003
         MFLD  F0302,LTH=12,FILL=X'40'                                  00480000
*** LENGTH OF PRECEDING SEGMENT = 42                                    00490000
         MSGEND                                                         00500000
         EJECT                                                          00510000
*   SCREEN  1                                     PROJECT=              00520000
*        MESSAGE OUTPUT DESCRIPTOR                 6/05/90  NEW SCREEN  00530000
         PRINT NOGEN                                                    00540000
AP0001O  MSG   TYPE=OUTPUT,SOR=(AP0001,IGNORE),NXT=AP0001I,OPT=1        00550000
         SEG                                                            00560000
         MFLD  (F0159,DATE2)                                            00570000
         MFLD  (F0169,LTNAME)                                           00580000
         MFLD  (F0259,TIME)                                             00590000
         MFLD  F0302,LTH=12                                             00600000
*** LENGTH OF PRECEDING SEGMENT = 16                                    00610000
         MSGEND                                                         00620000
        END                                                             00630000
