  PGM4435A: PROC(IO_PTR_PCB, DB_PTR_MAST, DB_PTR_SCND) OPTIONS(MAIN);
  
    DCL IO_PTR_PCB POINTER;
    DCL DB_PTR_MAST POINTER;
    DCL DB_PTR_SCND POINTER;
    DCL FUNC_PTR POINTER;
    DCL FUNC_PTR1 POINTER;
    DCL DET_SEG_IO_AREA CHAR(100);
    DCL 1    DB_PCB_SCND          BASED (DB_PTR_SCND),
         2   MAST_DB_NAME     CHAR(8),
         2   MAST_SEG_LEVEL   CHAR(2),
         2   MAST_STAT_CODE   CHAR(2),
         2   MAST_PROC_OPT    CHAR(4),
         2   FILLER           FIXED BINARY (31,0),
         2   MAST_SEG_NAME    CHAR(8),
         2   MAST_LEN_KFB     FIXED BINARY (31,0),
         2   MAST_NO_SENSEG   FIXED BINARY (31,0),
         2   MAST_KEY_FB      CHAR(*);
    
    DCL 1 DLI_FUNC1,
          2 FUNC_GU   CHAR(4) INIT('GU  '),
          2 FUNC_GN   CHAR(4) INIT('XXXX');
    DCL 1 DLI_FUNC2,
          2 FUNC_GNP  CHAR(4),
          2 DLI_NESTED,
            3 FUNC_ISRT CHAR(4) VALUE('ISRT');
    DCL FUNC_REPL CHAR(4) BASED INIT('REPL');
    DCL 1 DLI_FUNC4 BASED,
          2 FUNC_GHN CHAR(4) INIT('GHN ');
          
    DCL 1 HMCOMMON,
          2 FIELD1 CHAR(4),
          2 FIELD2 CHAR(4);
    DCL THREE FIXED BINARY(15) INIT(3);
  
    CALL P$$$ZZ (HMCOMMON, THREE, FUNC_GU, DB_PTR_MAST, DET_SEG_IO_AREA);
    
    CALL MY_PROC;
    
    MY_PROC: PROC;
      DCL 1 DLI_FUNC3,
            2 FUNC_GN   CHAR(4) VALUE('GN  '),
            2 DB_PTR_MAST POINTER;
      DCL SOME_PTR POINTER INIT(ADDR(DB_PTR_SNCD));
      
      CALL P$$$ZZ (HMCOMMON, THREE, DLI_FUNC9.FUNC_DLET, DB_PTR_MISSING, DET_SEG_IO_AREA);
      FUNC_GNP = 'GNP ';
      CALL P$$$ZZ (HMCOMMON, THREE, FUNC_GNP, DB_PCB_MISSING, DET_SEG_IO_AREA);
      
      CALL MY_PROC_1;
      
      MY_PROC_1: PROC;
        CALL P$$$ZZ (HMCOMMON, THREE, DLI_FUNC3.FUNC_GN, DB_PTR_SCND, DET_SEG_IO_AREA);
        CALL P$$$ZZ (HMCOMMON, THREE, FUNC_PTR->FUNC_REPL, DLI_FUNC3.DB_PTR_MAST, DET_SEG_IO_AREA);
        CALL P$$$ZZ (HMCOMMON, THREE, FUNC_PTR1->FUNC_PTR->FUNC_REPL, SOME_PTR->DB_PTR_SCND, DET_SEG_IO_AREA);
      END MY_PROC_1;
    END MY_PROC;
   
  END;