//JOBCARD JOB DSNC810,CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
// USER=&SYSUID,NOTIFY=&SYSUID
//PS010    EXEC PGM=SORT,COND=(0,NE)
//SYSIN    DD  DSN=CVC235.&INIT..D4070SA.SRTD(CNTLCRD),DISP=SHR
//*
//HLOD0100 EXEC PGM=DSNUTILB,
//         REGION=1024
//SYSIN    DD DSN=CVC235.&INIT..D4070SA.SRTD(+1),DISP=SHR
