//DUPFILE   JOB 000,CLASS=P,MSGCLASS=C                                  00001**2
//STEP1 EXEC PGM=IEFBR14
//DD1   DD DSN=TEST.GDG(0),DISP=SHR
//DD2   DD DSN=TEST.GDG(+1),DISP=(NEW,KEEP),DATACLAS=DSORG
//STEP2 EXEC PGM=IEFBR14
//DD1   DD DSN=TEST.GDG(0),DISP=SHR
//DD2   DD DSN=TEST.GDG(+1),DISP=(NEW,KEEP),DATACLAS=DSORG
//DD2   DD DSN=TEST.GDG(+2),DISP=MOD
//STEP3 EXEC PGM=IEFBR14
//DD1   DD DSN=TEST.FILE,DISP=SHR
//DD2   DD DSN=TEST.FILE,DISP=(NEW,KEEP),DATACLAS=DSORG