//ME002101 JOB (VS00200,NSNS),'MENTOR',REGION=0M,
// TIME=0,MSGCLASS=T,CLASS=K
//DPSPROP EXEC GV2QPROP,
// APPL=VSTA,
// DBID=210,
// DBPARMS=ERPARMS,
// RESTVOL=PLOG02,
// VOLPRI=ADA51E,
// VOLSEC=ADA51F,
// EXTRPRI=200,
// EXTRSEC=200,
//* ATVOL=PLOG02,
// NEXTJOB=ME002102
//DSUCHK.DDPARM DD *
HOSTADDR=151.110.228.33
STATPORT=8028
FILENAME=/opt/tre/repl/vsta220.done
/*
//TRAN.DDPLOG DD DISP=SHR,DSN=DBAQ.DB211.PLOG.COPY.G0002V00
// DD DISP=SHR,DSN=DBAQ.DB211.PLOG.COPY.G0003V00,
// UNIT=AFF=DDPLOG
//COPYCMDS.SYSUT1 DD *
LOGON MENTOR
UPDATE OFF
ME0180P1
DBAQ.DB211.PLOG.COPY.G0003V00
FIN
/*
