DEFINE DATA
LOCAL
01 #PROG1 (A8) INIT <'NIIGCMD'>
END-DEFINE

CALLNAT 'NIIEMOD'
CALLNAT FTP
CALLNAT ZZZ
CALLNAT #PROG1

INCLUDE 'NIIEMOD'
INCLUDE FTP
INCLUDE ZZZ
INCLUDE #PROG1

END