       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTPGM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TEST-FILE    ASSIGN     DD1.
       FILE SECTION.
       FD  TEST-FILE
             LABEL RECORDS ARE STANDARD
             RECORDING MODE IS F
             BLOCK CONTAINS 0 RECORDS.
       01  EXTRACT-REC-7       PIC X(232).

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  REC PIC X(232).

       PROCEDURE DIVISION.
            OPEN INPUT TEST-FILE
            READ TEST-FILE INTO REC
            CLOSE TEST-FILE
            STOP RUN.
