
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    PROG2.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO'
           .
      *    --------------------------------------------------
