 SIMPLE: PROCEDURE OPTIONS(MAIN);
    /* Test case for SELECT with no expression */   
    SELECT ;   
    OTHERWISE PUT SKIP LIST('NO MATCH FOUND');
    END;
 END SIMPLE;