 WMIN4156A: PROCEDURE OPTIONS(MAIN);
    IF (FXD1 = FXD2)
    THEN 
       RESULT = (FXD1 = FXD2);      
    PUT SKIP LIST("FXD1 = FXD2", RESULT);
        IF (FXD1 >= FXD2)
    THEN 
       RESULT = (FXD1 >= FXD2); 
    END; 
 END WMIN4156A;