 SIMPLE: PROCEDURE OPTIONS(MAIN);
   IF FXD1 > FXD2 THEN IF FXD1 > FXD3 THEN PUT SKIP LIST("FXD1 > FXD3");
   ELSE PUT SKIP LIST("FXD1 <= FXD3");
   ELSE IF FXD1 > FXD3 THEN PUT SKIP LIST("FXD1 > FXD3");
   ELSE PUT SKIP LIST("FXD1 <= FXD3");
   IF FXD2 > FXD3 THEN PUT SKIP LIST("FXD2 > FXD3");
   ELSE PUT SKIP LIST("FXD2 <= FXD3");
 END SIMPLE;