DEFINE DATA
LOCAL
1 #INT1 (I4) INIT <10>
1 #INT2 (I4) INIT <15>
END-DEFINE

ADD 3 + 2 TO #INT1
SUBTRACT 2 FROM #INT2

IF #INT1 = 15
  SUBTRACT 1 FROM #INT1
END-IF

END