DEFINE DATA
LOCAL
1 #INT1 (I4) INIT <10>
1 #INT2 (I4)
END-DEFINE

COMPUTE #INT2 = #INT1 - 4

IF #INT1 = 15
  MULTIPLY #INT2 by 2 giving #INT1
END-IF

END