DEFINE DATA
LOCAL
1 #WF-LINE (A10)
END-DEFINE

DEFINE WORK FILE 1 'src/res/workfile/WF1'
WRITE WORK FILE 1 'SomeData'
CLOSE WORK FILE 1

READ WORK FILE 1 #WF-LINE
  BEFORE BREAK PROCESSING
    WRITE 'BEFORE BREAK'
  END-BEFORE

  AT BREAK OF #WF-LINE
    WRITE 'AT BREAK'
  END-BREAK
END-WORK
END