       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILDSIB3.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  MY-HEX-CONV.
           05 FILLER-1          PIC X(1) VALUE LOW-VALUES.
           05 MY-HEX-CONV-CHAR  PIC X(1).
       01  MY-HEX-CONV-NUM REDEFINES MY-HEX-CONV PIC 9(4) COMP.
       01 WS-OUTPUT PIC 9(4).

       PROCEDURE DIVISION.
           COMPUTE WS-OUTPUT = MY-HEX-CONV-NUM * 2.
       END PROGRAM FILDSIB3.
