       IDENTIFICATION DIVISION.
       PROGRAM-ID. START02.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.

        01 G1.
           05 G1-F1 PIC X.
           05 G1-F2 PIC X.

       PROCEDURE DIVISION.

           MOVE G1-F1 TO G1-F2
           
       END PROGRAM START02.
