       IDENTIFICATION DIVISION.
       PROGRAM-ID. REDEFINESEXAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 EMPLOYEE-RECORD.
          05 EMPLOYEE-ID         PIC 9(5).
          05 EMPLOYEE-NAME.
             10 FIRST-NAME      PIC X(20).
             10 LAST-NAME       PIC X(30).

       01 EMPLOYEE-INFO REDEFINES EMPLOYEE-RECORD.
          05 EMPLOYEE-A   PIC 9(9).
          05 EMPLOYEE-B   PIC 9(8).

       01 EMPLOYEE-RECORD-REDEFINED REDEFINES EMPLOYEE-RECORD.
          05 EMPLOYEE-A-REDEFINED   PIC 9(9).
          05 EMPLOYEE-B-REDEFINED   PIC 9(8).

       PROCEDURE DIVISION.

       	DISPLAY "Employee ID: " EMPLOYEE-ID.
       	DISPLAY "Employee Record: " EMPLOYEE-RECORD.

       	DISPLAY "Employee A: " EMPLOYEE-A.

       	DISPLAY EMPLOYEE-A-REDEFINED

       	STOP RUN.
