//PROCA PROC
//PSTEP1    EXEC PGM=PRGA                                             00039900
//SYSPRINT DD  DSN=&QUAL.F.FILE                                         00041300
//PSTEP2 EXEC PROCB,QUAL=L
//PSTEP3 EXEC PROCB,QUAL=M