//PROCB PROC
//PSTEPB    EXEC PGM=PRGB                                             00039900
//SYSPRINT DD  DSN=&QUAL.F.FILE                                         00041300
