       IDENTIFICATION DIVISION.
       PROGRAM-ID. XXXXSEI.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  FILLER       PIC X(16) VALUE 'xxxxxxx-MMRS71Bx'.
           COPY XXXXCCOPY.

       LINKAGE SECTION.
       01  DFHCOMMAREA            PIC X(250).
       PROCEDURE DIVISION.

       END PROGRAM XXXXSEI.
