       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN539FILE1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.

      * REWRITE
           REWRITE RECORD
           END-REWRITE.
      
           GOBACK.
