#JOBCARD1
#JOBCARD2
#JOBPARM
#JOBROUTE
//TDFREPRO PROC VSMQUAL='#VSAMQUAL',            VSAM QUALIFIER
//         TAPUNIT='#TAPEUNIT',                 TAPE UNIT NAME
//         PDSQUAL='#PDSQUAL',                  TELON INSTALL LIB
//         CYCLE='0',                           GDG CYCLE NUMBER
//         LABEL='0',                           TAPE LABEL NUMBER
//         CONTROL=,                            REPRO CONTROL(S)
//         DBNAME='',                           DATABASE NAME
//         BKPQUAL='#BACKUPQUAL',               BACKUP QUALIFIER
//         GDGNAME='#GDGNAME'                   GDG QUALIFIER
//*
//*********************************************************************
//*        LET THE SYSTEM FIND THE VOLUME OF THE BACKUP FILE          *
//*********************************************************************
//*
//GETVOL   EXEC PGM=IEFBR14
//GDG      DD DSN=&GDGNAME(&CYCLE),DISP=OLD,UNIT=(,,DEFER)
//*
//*********************************************************************
//*        IDCAMS REPRO DESIRED TDF DATABASES FROM TAPE               *
//*********************************************************************
//*
//REPRO    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//DD1      DD DSN=&BKPQUAL..&DBNAME,DISP=(OLD,KEEP),
//         UNIT=&TAPUNIT,LABEL=(&LABEL,SL),
//         VOL=(,RETAIN,,,REF=*.GETVOL.GDG)
//DD2      DD DSN=&VSMQUAL..&DBNAME,DISP=OLD
//SYSIN    DD DSN=&PDSQUAL..CAWLINST(&CONTROL),DISP=SHR
//******************** END OF TDFREPRO PROCEDURE ***********************
// PEND
//TNTDD  EXEC PROC=TDFREPRO,CONTROL=CTDFTDD,LABEL=2,DBNAME=TNTDD

