000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. ADAS01.
000030 ENVIRONMENT DIVISION.
000040 CONFIGURATION SECTION.
000070 INPUT-OUTPUT SECTION.
000080 FILE-CONTROL.
000090 DATA DIVISION.
000100 FILE SECTION.
000110 WORKING-STORAGE SECTION.
000111 01  WS-SUBMIT-COMMAND.
000112     05  FILLER PIC X(54) VALUE
000113         "SUBMIT/NOIDENT/NONOTIFY/LOG=LOG:CLM_TD_OUX_03_FTP.LOG".
000114     05  FILLER PIC X(33) VALUE
000115        " COM:CLM_TD_OUX_03_FTP.COM/PARAM=".
000116     05  WS-SUBMIT-PARAM PIC X(80) VALUE SPACE.       
000120 REPORT SECTION.
000130 PROCEDURE DIVISION.
000140 THE-MAIN SECTION.
000300        CALL "LIB$SPAWN" USING 
000400         BY DESCRIPTOR WS-SUBMIT-COMMAND
