IDENTIFICATION DIVISION.
PROGRAM-ID.	CAP_BAL_BRM_09.
AUTHOR.		DDB.
DATE-WRITTEN.	09-AUG-2003.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.	CONSOLE IS SYS$ERROR
		SYMBOLIC CHARACTERS BYTE_VALUE_1 IS 2.

INPUT-OUTPUT SECTION.
FILE-CONTROL.

    SELECT BAL_RPT_FILE
	ASSIGN TO "CAP_RPT:"
	    FILE STATUS IS RPT_STAT.

DATA DIVISION.
*
FILE SECTION.
*
FD BAL_RPT_FILE
    VALUE OF ID IS WS_FNAME
    REPORTS ARE BAL_RPT.

WORKING-STORAGE SECTION.
01  WS_VARS.

    05	BALANCE_SW			PIC X(01).
	88  IN_BALANCE 			VALUE "I".
	88  OUT_OF_BALANCE 		VALUE "O".

    05	MORE_RECS_SW			PIC X(01).
	88  MORE_RECS			VALUE "1".
	88  NO_MORE_RECS 		VALUE "0".

    05	SIGN_VAL   			PIC X(01).
	88  POS_VAL	 		VALUE "P".
	88  NEG_VAL			VALUE "N".

    05	MATCH_SW			PIC X(01).
	88  A_MATCH			VALUE "A".
	88  NO_MATCH			VALUE "N".

    05	LOOKUP_SW			PIC X(01).
	88  LOOK_4_STR			VALUE "L".
	88  FOUND_STR			VALUE "F".


    05	BRM27_CH		    POINTER.
    05	BRM30_CH		    POINTER.
    05	TBLMSTR_CH		    POINTER.
 
    05	WS_FMT_AMT		    PIC ZZZ,ZZZ,ZZ9.99.

    05	X0000_CHAR 		    PIC X(20) JUST RIGHT.
    05	X0000_AMT		    PIC S9(16)V9(02).

    05	IDX			    PIC 9(04) COMP.
    05	IDX1			    PIC 9(04) COMP.
    05	IDX2			    PIC 9(04) COMP.
    05	MATCH_IDX		    PIC 9(04) COMP.
    05	WS_AMT_NUM		    PIC 9(15).
    05	WS_AMT_STR REDEFINES WS_AMT_NUM
				    PIC X(15).

    05	WS_VAL1_AMT		    PIC S9(16)V9(02).
    05	WS_VAL2_AMT		    PIC S9(16)V9(02).

    05	BRM27_KSTR		    PIC X(07) VALUE "TOTAL :".
    05	BRM27_KBEG_POS		    PIC 999   VALUE 03.
    05	BRM27_KLEN		    PIC 99    VALUE 07.

    05	BRM27_VBEG_POS		    PIC 999   VALUE 14.
    05	BRM27_VLEN		    PIC 99    VALUE 19.
    05	BRM27_AMT_CHAR		    PIC X(20) JUST RIGHT.
    05	BRM27_AMT_NUM		    PIC S9(16)V9(02).

    05	BRM30_KSTR1		    PIC X(03) VALUE "ALL".
    05	BRM30_KBEG_POS1		    PIC 999   VALUE 03.
    05	BRM30_KLEN1		    PIC 99    VALUE 03.

    05	BRM30_KSTR		    PIC X(03).
    05	BRM30_KBEG_POS		    PIC 999   VALUE 10.
    05	BRM30_KLEN		    PIC 99    VALUE 03.

    05	BRM30_VBEG_POS		    PIC 999   VALUE 117.
    05	BRM30_VLEN		    PIC 99    VALUE 15.
    05	BRM30_VAL		    PIC X(19).
    05	BRM30_TOT_AMT_NUM	    PIC S9(16)V9(02).
    05	BRM30_TOT_AMT_CHAR	    PIC X(20) JUST RIGHT.

    05	BRM27_BRM30_DIFF_NUM	    PIC S9(16)V9(02).
    05	BRM27_BRM30_DIFF_CHAR	    PIC X(20) JUST RIGHT.

    05  WS_RUN_DATE.
	10  YYYY			PIC X(04).
	10  MM				PIC X(02).
	10  DD				PIC X(02).
    05  RW_RUN_DATE.
	10  FILLER			PIC X	VALUE " ".
	10  MM				PIC XX.
	10  FILLER			PIC X	VALUE "-".
	10  DD				PIC XX.
	10  FILLER			PIC X	VALUE "-".
	10  YYYY			PIC XXXX.
    05  WS_ABORT_STATUS		COMP	PIC 9(9)	VALUE 44.

    05	RW_BRM30_CAT		    PIC X(03).
    05	RW_AMT			    PIC X(20) JUST RIGHT.

    05	RETURN_VALUE		    PIC X(01).

01  ACE_BAL_09_TABLE.
    10	TBL_CNT			    PIC 9(04) COMP.
    10	MAX_TBL_CNT		    PIC 9(04) COMP VALUE 500.
    10	ACE_BAL_09_TBL OCCURS 500 TIMES.
	15  TBL_CAT		    PIC X(03).
	15  TBL_AMT_CHAR	    PIC X(15) JUST RIGHT.
	15  TBL_AMT_NUM		    PIC S9(16)V9(02).


01  RPT_REC			    PIC X(132).

  
REPORT SECTION.
RD BAL_RPT

	PAGE LIMIT IS	60
        HEADING		 1
	FIRST DETAIL     7
	LAST DETAIL     60.

01  RPT_HEAD TYPE IS PAGE HEADING.
    05	LINE 1.
        10  COLUMN	 01		PIC X(14) VALUE "CAP_BAL_BRM_09".
	10  COLUMN	 29		PIC X(21) 
	    VALUE "HEALTH NET CAPITATION".
	10 COLUMN	 70		PIC X(11) SOURCE RW_RUN_DATE.

    05	LINE 2.
	10  COLUMN	 25		PIC X(29)  VALUE 
            "CAP 27 TO 30 REPORT BALANCING".

    05	LINE 3.
	10  COLUMN	 01		PIC X(01)  VALUE " ".

    05	LINE 4.
	10  COLUMN	 01		PIC X(01)  VALUE " ".

    05	LINE 5.
	10  COLUMN	 19		PIC X(11) VALUE	"DESCRIPTION".
	10  COLUMN	 49		PIC X(17) VALUE "BALANCING FIGURES".

    05	LINE 6.
	10  COLUMN	 5		PIC X(40) VALUE
	    "----------------------------------------".
	10  COLUMN	 49		PIC X(18) VALUE "------------------".
	
 
01  RW_BRM27_LINE TYPE IS DETAIL.
    05	LINE PLUS 1.
	10  COLUMN       05	        PIC X(28) VALUE
	    "27 REPORT - TOTAL REMITTANCE".

	10  COLUMN	 47		PIC X(20) SOURCE RW_AMT.

01  RW_BRM30_HDR_LINE TYPE IS DETAIL.
    05	LINE PLUS 1.
	10  COLUMN       05	        PIC X(35) VALUE
	    "30 REPORT - REMITTANCE BY CATEGORY:".

01  RW_BRM30_LINE TYPE IS DETAIL.
    05	LINE PLUS 1.
	10  COLUMN       05	        PIC X(03) SOURCE RW_BRM30_CAT.
	10  COLUMN       09	        PIC X(18) VALUE "- TOTAL REMITTANCE".
	10  COLUMN	 47		PIC X(20) SOURCE RW_AMT.


01  RW_BRM30_TOT_LINE TYPE IS DETAIL.
    05	LINE PLUS 1.
	10  COLUMN       49	        PIC X(18) VALUE "__________________".
    05	LINE PLUS 1.
	10  COLUMN       05	        PIC X(28) VALUE 
	    "30 REPORT - TOTAL REMITTANCE".
	10  COLUMN	 47		PIC X(20) SOURCE RW_AMT.

01  RW_BRM30_DIFF_LINE TYPE IS DETAIL.
    05	LINE PLUS 1.
	10  COLUMN       05	        PIC X(32) VALUE 
	    "NET DIFFERENCE BETWEEN 27 AND 30".
	10  COLUMN	 47		PIC X(20) SOURCE RW_AMT.

01  RW_BLANK_LINE TYPE IS DETAIL.
    05	LINE PLUS 1.
	10  COLUMN	 01		PIC X(01) VALUE " ".


*			` PROCEDURES '
PROCEDURE DIVISION GIVING RETURN_STATUS.
END PROGRAM CAP_BAL_BRM_09.
