       IDENTIFICATION DIVISION.
       PROGRAM-ID. MEE3131J.
       PROCEDURE DIVISION.
           DISPLAY "MEE3131J START".
           PERFORM LABEL_1.
           DISPLAY "MEE3131J PERFORM RETURNED!".
       LABEL_1.
           DISPLAY "MEE3131J LABEL1".
           CALL 'MEE3131K'.
           DISPLAY "MEE3131J AFTER CALL".
       LABEL_2.
           DISPLAY "MEE3131J LABEL2".
           GOBACK.
       END PROGRAM MEE3131J.
