       IDENTIFICATION DIVISION.
       PROGRAM-ID. MEE3131L.
       PROCEDURE DIVISION.
           DISPLAY "MEE3131L START".
           PERFORM LABEL_1.
           DISPLAY "MEE3131L PERFORM RETURNED!".
       LABEL_1.
           DISPLAY "MEE3131L LABEL1".
           GO TO LABEL_2.
           DISPLAY "MEE3131L AFTER CALL".
       LABEL_2.
           DISPLAY "MEE3131L LABEL2".
           CALL "MEE3131K".
           GOBACK.
       END PROGRAM MEE3131L.
