       IDENTIFICATION DIVISION.
       PROGRAM-ID. MEE4918.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       INIT0100-MAIN.
           PERFORM SERV2000-CALL-PROG THRU SERV2000-EXIT.
           DISPLAY 'SUCCESS'.
           GOBACK
       INIT0100-EXIT. EXIT.
       SERV2000-CALL-PROG.
           DISPLAY 'IN PERFORM THRU'.
           GO TO SERV2000-EXIT.
       SERV2000-EXIT. EXIT.
