       IDENTIFICATION DIVISION.

       PROGRAM-ID.    MEE8118A.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
       0000-MAINLINE.
           PERFORM 1000-INITIALIZE THRU 1000-INITIALIZE-EXIT.

       0000-MAINLINE-EXIT. EXIT.

       1000-INITIALIZE.
           DISPLAY 'MEE8118A before call  MEE8118B'.
           CALL 'MEE8118B'.
           DISPLAY 'MEE8118A after call  MEE8118B'.

       1000-INITIALIZE-EXIT. EXIT.

           GOBACK.
       END PROGRAM MEE8118A.
