//$DFPAUT0 JOB
/*JOBPARM LINES=999999
//*AUTOBEEP PAGE=PMDCSTAT
//*
//*+JBS BIND XPDDBA1.ONLINE
//*
//JCLDSN JCLLIB ORDER=AX52ZM.JDCS.PROCLIB.JES.JCLLIB
//*
//STEPUPD  EXEC DFPAUT5P,
//         PQBDT=&:PREVQBD,
//         PQEDT=&:PREVQED
//*****************************************************************
