 DEAD11: PACKAGE EXPORTS(*);

 NOTDEAD1: PROC(PARAM1,PARAM2);
   DCL PARAM1 CHAR(10);
   DCL PARAM2 FIXED BINARY(31);
   
   PUT SKIP LIST('IN EXT PROC');
   PUT SKIP LIST(PARAM1);
   PUT SKIP LIST(PARAM2);
   PARAM1 = 'MODIFIED';
 END NOTDEAD1;
 
  CREATURE: PROC;
   DCL PARAM1 CHAR(10);
   DCL PARAM2 FIXED BINARY(31);
   
   PUT SKIP LIST('IN EXT PROC');
   PUT SKIP LIST(PARAM1);
   PUT SKIP LIST(PARAM2);
   PARAM1 = 'IT''S ALIVE!';
   CALL DORIANGRAY;
   DEAD: PROC;
      
     %INCLUDE TESTCPY2;
      
      NESTED3: PROC;
      PUT SKIP LIST(PARAM2);
      END NESTED3;
   END DEAD;
 END CREATURE;
 

 END DEAD11;
  