* <$ NATURAL META INFORMATION BEGIN
*
* $Mode Report
*
* NATURAL META INFORMATION END $>
DEFINE FUNCTION F#ADD           
  RETURNS #RESULT (I4)          
  DEFINE DATA PARAMETER         
    1 #SUMMAND1 (I4) BY VALUE   
    1 #SUMMAND2 (I4) BY VALUE   
  END-DEFINE        
  /*    
  #RESULT := #SUMMAND1 + #SUMMAND2          
  /*    
END-FUNCTION        
*       
END     
