* MAP2: PROTOTYPE              --- CREATED BY WNT 6.3.8 ---         
* INPUT USING MAP 'XXXXXXXX'    
FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=OFF IP=OFF        
* MAP2: MAP PROFILES *****************************        200***********        
* .TTAAAMMOO   D I D I N D I D I        ?_)^&:+(                       *        
* 021079        N0NNUCN             X        01 SYSDBA  NR             *        
************************************************************************        
INPUT          (     IP=OFF                                           /*        
                                                                       )        
/       
/       
/       
 018T 'Text Label Field____________________________'    
/       
/       
/       
/       
/       
/       
/       
/       
/       
/       
/       
/       
/       
/       
/       
/       
/       
* MAP2: VALIDATION *****************************************************        
* MAP2: END OF MAP *****************************************************        
END     
* <$ NATURAL META INFORMATION BEGIN
*
* $Mode Report
*
* NATURAL META INFORMATION END $>
