//MASJR559 JOB (130300,422),'ACB',CLASS=C,
// MSGCLASS=Y
//PROC1 PROC DUMP='H'
//*
//STEP01 EXEC PGM=MGOPRGM1
//SYSOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=W
//MGOFILE1 DD DSN=MGO.TEST.FILE.ONE,
// DISP=(OLD,DELETE)
// PEND
//*
//STEP010 EXEC PROC1
//*