000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPD036.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*                                                                *00005000
000060*    RPD036 - RELATIONSHIP PRICING ONLINE MAINTENANCE JOURNAL    *00006000
000070*                                                                *00007000
000080******************************************************************00008000
000090 ENVIRONMENT DIVISION.                                            00009000
000100 CONFIGURATION SECTION.                                           00010000
000110 SPECIAL-NAMES.                                                   00011000
000120     C01 IS C-01, C02 IS C-02, C03 IS C-03.                       00012000
000130 INPUT-OUTPUT SECTION.                                            00013000
000140 FILE-CONTROL.                                                    00014000
000000 COPY RPCARDS.                                                    00015000
000000 COPY RPSORTS.                                                    00016000
000000 COPY PRNTERS.                                                    00017000
000180 DATA DIVISION.                                                   00018000
000190 FILE SECTION.                                                    00019000
000000 COPY RPCARDF.                                                    00020000
000210 01  RPCARD-RECORD               PIC X(80).                       00021000
000000 COPY RPSRT609.                                                   00022000
000230 01  RPSORT-RECORD.                                               00023000
000000 COPY RPSRPTO.                                                    00024000
000250     03  RP-SORTKEY.                                              00025000
000260         05  WS-RPTNBR           PIC S9(04)      COMP.            00026000
000270         05  WS-RFORMX           PIC X(02).                       00027000
000280         05  WS-RSEPREP          PIC X(01).                       00028000
000290         05  WS-RHOLDCOX.                                         00029000
000300             07  WS-RHOLDCO      PIC S9(03)      COMP-3.          00030000
000310         05  WS-RINSTX.                                           00031000
000320             07  WS-RINST        PIC S9(04)      COMP-3.          00032000
000330         05  WS-RALTBRANCHX.                                      00033000
000340             07  WS-RALTBRANCH                                    00034000
000350                                 PIC S9(05)      COMP-3.          00035000
000360         05  WS-RSPEC            PIC X(01).                       00036000
000370         05  WS-RREGIONX.                                         00037000
000380             07  WS-RREGION      PIC S9(03)      COMP-3.          00038000
000390         05  WS-RBRANCHX.                                         00039000
000400             07  WS-RBRANCH      PIC S9(05)      COMP-3.          00040000
000410         05  WS-RTYPEX.                                           00041000
000420             07  WS-RTYPE        PIC S9(03)      COMP-3.          00042000
000430         05  WS-ROFFICER         PIC X(09).                       00043000
P0047          05  WS-SORTPRODCODE     PIC X(06).                       00043200
P0047          05  WS-SORTACCOUNT      pic X(18).                       00043400
P0047          05  WS-SORTMODEL        PIC X(10).                       00043600
000440         05  WS-RRECID           PIC X(01).                       00044000
000450         05  WS-RPRODCODE        PIC X(06).                       00045000
000460         05  WS-RACCTNBR         PIC X(18).                       00046000
000470         05  WS-RMODEL           PIC X(10).                       00047000
000480         05  WS-RSEQX.                                            00048000
000490             07  WS-RSEQ         PIC S9(09)      COMP.            00049000
000500         05  WS-RRPTPFC          PIC X(01).                       00050000
000510         05  WS-RPAGEBRK.                                         00051000
000520             07  WS-RBRPAGE      PIC X(01).                       00052000
000530             07  WS-RTYPAGE      PIC X(01).                       00053000
000000 COPY PRNTERF.                                                    00054000
000550 01  PRINTERREC.                                                  00055000
000000 COPY SRW016.                                                     00056000
000570     03  PLINE4          REDEFINES PLINE1.                        00057000
000580         05  P4-RECLIT           PIC X(15).                       00058000
000590         05  FILLER              PIC X(01).                       00059000
000600         05  P4-REC              PIC X(03).                       00060000
000610         05  FILLER              PIC X(04).                       00061000
000620         05  P4-DATELIT          PIC X(15).                       00062000
000630         05  FILLER              PIC X(01).                       00063000
000640         05  P4-DATE.                                             00064000
000650             07  P4-DTMO         PIC 9(02).                       00065000
000660             07  P4-DSH1         PIC X(01).                       00066000
000670             07  P4-DTDA         PIC 9(02).                       00067000
000680             07  P4-DSH2         PIC X(01).                       00068000
000690             07  P4-DTYR         PIC 9(04).                       00069000
000700         05  FILLER              PIC X(03).                       00070000
000710         05  P4-TIMELIT          PIC X(15).                       00071000
000720         05  FILLER              PIC X(01).                       00072000
000730         05  P4-TIME.                                             00073000
000740             07  P4-TMHR         PIC 9(02).                       00074000
000750             07  P4-DOT1         PIC X(01).                       00075000
000760             07  P4-TMMI         PIC 9(02).                       00076000
000770             07  P4-DOT2         PIC X(01).                       00077000
000780             07  P4-TMSC         PIC 9(02).                       00078000
000790         05  FILLER              PIC X(03).                       00079000
000800         05  P4-USERLIT          PIC X(15).                       00080000
000810         05  FILLER              PIC X(01).                       00081000
000820         05  P4-USER             PIC X(08).                       00082000
000830         05  FILLER              PIC X(03).                       00083000
000840         05  P4-FUNCLIT          PIC X(15).                       00084000
000850         05  FILLER              PIC X(01).                       00085000
000860         05  P4-FUNCTION         PIC X(07).                       00086000
000870         05  FILLER              PIC X(03).                       00087000
000880     03  PLINE5          REDEFINES PLINE1.                        00088000
000890         05  P5-KEYLIT1          PIC X(12).                       00089000
000900         05  FILLER              PIC X(01).                       00090000
000910         05  P5-KEY1             PIC X(06).                       00091000
000920         05  FILLER              PIC X(06).                       00092000
000930         05  P5-KEYLIT2          PIC X(12).                       00093000
000940         05  FILLER              PIC X(01).                       00094000
000950         05  P5-KEY2             PIC X(18).                       00095000
000960         05  FILLER              PIC X(06).                       00096000
000970         05  P5-KEYLIT3          PIC X(12).                       00097000
000980         05  FILLER              PIC X(01).                       00098000
000990         05  P5-KEY3             PIC X(10).                       00099000
001000         05  FILLER              PIC X(47).                       00100000
001010     03  PLINE6          REDEFINES PLINE1.                        00101000
001020         05  FILLER              PIC X(132).                      00102000
001030     03  PLINE7          REDEFINES PLINE1.                        00103000
001040         05  FILLER              PIC X(08).                       00104000
001050         05  P7-TOTDESC          PIC X(31).                       00105000
001060         05  FILLER              PIC X(03).                       00106000
001070         05  P7-RECNAME          PIC X(30).                       00107000
001080         05  FILLER              PIC X(03).                       00108000
001090         05  P7-ADDED            PIC ZZZZZZZZ9.                   00109000
001100         05  FILLER              PIC X(03).                       00110000
001110         05  P7-CHANGED          PIC ZZZZZZZZ9.                   00111000
001120         05  FILLER              PIC X(03).                       00112000
001130         05  P7-DELETED          PIC ZZZZZZZZ9.                   00113000
001140         05  FILLER              PIC X(24).                       00114000
001150     03  PLINE8          REDEFINES PLINE1.                        00115000
001160         05  FILLER              PIC X(23).                       00116000
001170         05  P8-FLDNAME          PIC X(15).                       00117000
001180         05  FILLER              PIC X(01).                       00118000
001190         05  P8-FROMLIT          PIC X(04).                       00119000
001200         05  FILLER              PIC X(01).                       00120000
001210         05  P8-DATAFROM         PIC X(40).                       00121000
001220         05  FILLER              PIC X(01).                       00122000
001230         05  P8-TOLIT            PIC X(04).                       00123000
001240         05  FILLER              PIC X(01).                       00124000
001250         05  P8-DATATO           PIC X(40).                       00125000
001260         05  FILLER              PIC X(02).                       00126000
001270     03  PLINE9          REDEFINES PLINE1.                        00127000
001280         05  FILLER              PIC X(23).                       00128000
001290         05  P9-KEYLIT1          PIC X(15).                       00129000
001300         05  FILLER              PIC X(01).                       00130000
001310         05  P9-KEY1             PIC X(04).                       00131000
001320         05  FILLER              PIC X(09).                       00132000
001330         05  P9-KEYLIT2          PIC X(15).                       00133000
001340         05  FILLER              PIC X(01).                       00134000
001350         05  P9-KEY2             PIC X(06).                       00135000
001360         05  FILLER              PIC X(05).                       00136000
001370         05  P9-KEYLIT3          PIC X(15).                       00137000
001380         05  FILLER              PIC X(01).                       00138000
001390         05  P9-KEY3             PIC X(18).                       00139000
001400         05  FILLER              PIC X(19).                       00140000
001410     03  PLINE10         REDEFINES PLINE1.                        00141000
001420         05  FILLER              PIC X(13).                       00142000
001430         05  P10-RECNAME         PIC X(30).                       00143000
001440         05  FILLER              PIC X(63).                       00144000
001450         05  P10-LASTLIT         PIC X(15).                       00145000
001460         05  FILLER              PIC X(01).                       00146000
001470         05  P10-LASTDATE.                                        00147000
001480             07  P10-LASTMO      PIC 9(02).                       00148000
001490             07  P10-LASTDSH1    PIC X(01).                       00149000
001500             07  P10-LASTDA      PIC 9(02).                       00150000
001510             07  P10-LASTDSH2    PIC X(01).                       00151000
001520             07  P10-LASTYR      PIC 9(04).                       00152000
001530******************************************************************00153000
001540 WORKING-STORAGE SECTION.                                         00154000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00155000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00155001
001560 01  RPS-RLSELIT.                                                 00156000
000000 COPY RPWRLSE.                                                    00157000
001580 01  MIC-RLSELIT.                                                 00158000
000000 COPY MIWRLSE.                                                    00159000
001600 01  SRW105-AREAS.                                                00160000
000000 COPY SRW105.                                                     00161000
001620*01  BICPBPRM.                                                    00162000
000000 COPY BICPBPRM.                                                   00163000
001640*01  BICRSRB.                                                     00164000
000000 COPY BICRSRB.                                                    00165000
001660*01  BICRPSB.                                                     00166000
000000 COPY BICRPSB.                                                    00167000
001680*01  BICRVERB.                                                    00168000
000000 COPY BICRVERB.                                                   00169000
001700*01  BICRSTAT.                                                    00170000
000000 COPY BICRSTAT.                                                   00171000
001720*01  BICRDBS.                                                     00172000
000000 COPY BICRDBS.                                                    00173000
001740*01  BICRLOG.                                                     00174000
000000 COPY BICRLOG.                                                    00175000
001760 01  RPWACT-AREAS.                                                00176000
000000 COPY RPWACTA.                                                    00177000
001780 01  RPWIDX-AREAS.                                                00178000
000000 COPY RPWIDXA.                                                    00179000
001800 01  RPWMST-AREAS.                                                00180000
000000 COPY RPWMSTA.                                                    00181000
001820 01  RPWQUA-AREAS.                                                00182000
000000 COPY RPWQUAA.                                                    00183000
001840 01  RPWREL-AREAS.                                                00184000
000000 COPY RPWRELA.                                                    00185000
001860 01  RPWSEC-AREAS.                                                00186000
000000 COPY RPWSECA.                                                    00187000
001880 01  RPWRPTO-AREAS.                                               00188000
000000 COPY RPWRPTO.                                                    00189000
P0047  01  RPRPTO-RECORD               PIC X(503).                      00190000
001910 01  MIWHDTS-AREAS.                                               00191000
000000 COPY MIWHDTS.                                                    00192000
001930 01  MI-HDTSREC.                                                  00193000
000000 COPY MISHDTS.                                                    00194000
001950 01  RPACT-RECORD.                                                00195000
000000 COPY RPSACT.                                                     00196000
001970 01  RPIDX-RECORD.                                                00197000
000000 COPY RPSIDX.                                                     00198000
001990 01  RPMST-RECORD.                                                00199000
000000 COPY RPSMST.                                                     00200000
002010 01  RPQUA-RECORD.                                                00201000
000000 COPY RPSQUA.                                                     00202000
002030 01  RPREL-RECORD.                                                00203000
000000 COPY RPSREL.                                                     00204000
002050 01  RPSEC-RECORD.                                                00205000
000000 COPY RPSSEC.                                                     00206000
002070 01  MIWPRI-AREAS.                                                00207000
000000 COPY MIWPRI.                                                     00208000
002090 01  MIWMSTA-AREAS.                                               00209000
000000 COPY MIWMSTA.                                                    00210000
002110 01  MIMST-RECORD.                                                00211000
000000 COPY MISMST.                                                     00212000
002130 01  RPWBNKA-AREAS.                                               00213000
000000 COPY RPWBNKA.                                                    00214000
002150 01  RPBNK-RECORD.                                                00215000
000000 COPY RPSBNK.                                                     00216000
002170 01  MI1001-RECORD.                                               00217000
000000 COPY MIS1001A.                                                   00218000
002190 01  MI0020-RECORD.                                               00219000
000000 COPY MIS0020A.                                                   00220000
002210 01  MI0021-RECORD.                                               00221000
000000 COPY MIS0021A.                                                   00222000
002230 01  MI2001-RECORD.                                               00223000
000000 COPY MIS2001A.                                                   00224000
002250 01  SRW015-AREAS.                                                00225000
000000 COPY SRW015.                                                     00226000
002270 01  SRW000-AREAS.                                                00227000
000000 COPY SRW000.                                                     00228000
002290 01  FILLER                      PIC X(08)       VALUE '*SRW066*'.00229000
002300 01  SRW066-AREAS.                                                00230000
000000 COPY SRW066.                                                     00231000
002320 01  FILLER                      PIC X(08)       VALUE '*SRW025*'.00232000
002330 01  SRW025-AREAS.                                                00233000
000000 COPY SRW025.                                                     00234000
002350 01  FILLER                      PIC X(08)       VALUE '*SRW028*'.00235000
002360 01  WS-ABEND.                                                    00236000
000000 COPY SRW028.                                                     00237000
002380 01  FILLER                      PIC X(08)       VALUE '*SRW030*'.00238000
002390 01  SRW030-AREAS.                                                00239000
000000 COPY SRW030.                                                     00240000
002410 01  FILLER                      PIC X(08)       VALUE '*SRW031*'.00241000
002420 01  SRW031-AREAS.                                                00242000
000000 COPY SRW031.                                                     00243000
002440 01  FILLER                      PIC X(08)       VALUE '*SRW033*'.00244000
002450 01  SRW033-AREAS.                                                00245000
000000 COPY SRW033.                                                     00246000
002470 01  FILLER                      PIC X(08)       VALUE '*SRW044*'.00247000
002480 01  SRW044-AREAS.                                                00248000
000000 COPY SRW044.                                                     00249000
002500 01  FILLER                      PIC X(08)       VALUE '*SRW045*'.00250000
002510 01  SRW045-AREAS.                                                00251000
000000 COPY SRW045.                                                     00252000
002530 01  FILLER                      PIC X(08)       VALUE '*SRW067*'.00253000
002540 01  SRW067-AREAS.                                                00254000
000000 COPY SRW067.                                                     00255000
002560 01  FILLER                      PIC X(08)       VALUE '*WSDATE*'.00256000
002570 01  WS-COBOLDATE.                                                00257000
002580     03  WS-COBOLMM              PIC X(02).                       00258000
002590     03  WS-COBOLDD              PIC X(02).                       00259000
002600     03  WS-COBOLYY              PIC X(04).                       00260000
002610 01  WS-COBOLDATE-8.                                              00261000
002620     03  WS-COBOLMM8             PIC X(02).                       00262000
002630     03  FILLER                  PIC X(01)       VALUE '/'.       00263000
002640     03  WS-COBOLDD8             PIC X(02).                       00264000
002650     03  FILLER                  PIC X(01)       VALUE '/'.       00265000
002660     03  WS-COBOLYY8             PIC X(02).                       00266000
002670 01  WS-DATE-C.                                                   00267000
002680     03  WS-DATEC.                                                00268000
002690         05  WS-DM               PIC 9(02).                       00269000
002700         05  FILLER              PIC X(01).                       00270000
002710         05  WS-DD               PIC 9(02).                       00271000
002720         05  FILLER              PIC X(01).                       00272000
002730         05  WS-DY               PIC 9(02).                       00273000
002740 01  FILLER                      PIC X(08)       VALUE '*WSWORK*'.00274000
002750 01  WS-WORKAREAS.                                                00275000
002760     03  WS-UPD-USER             PIC X(08)       VALUE SPACES.    00276000
002770     03  WS-FIRSTSW              PIC X(01)       VALUE 'Y'.       00277000
002780     03  WS-SUB1                 PIC S9(04)      COMP.            00278000
002790     03  WS-SUB2                 PIC S9(04)      COMP.            00279000
002800     03  WS-SUB3                 PIC S9(04)      COMP.            00280000
002810     03  WS-SUB4                 PIC S9(04)      COMP.            00281000
002820     03  WS-RECSUB               PIC S9(04)      COMP.            00282000
002830     03  WS-LAST-RECID           PIC X(03).                       00283000
002840     03  WS-INST                 PIC 9(04)       VALUE ZERO.      00284000
002850     03  WS-DATE                 PIC 9(08).                       00285000
002860     03  WS-DATER        REDEFINES WS-DATE.                       00286000
002870         05  WS-TCYR             PIC 9(04).                       00287000
002880         05  WS-TCMON            PIC 9(02).                       00288000
002890         05  WS-TCDAY            PIC 9(02).                       00289000
002900     03  WS-DISPLAYDATE.                                          00290000
002910         05  WS-DSMON            PIC 9(02).                       00291000
002920         05  WS-DSDAY            PIC 9(02).                       00292000
002930         05  WS-DSYR             PIC 9(04).                       00293000
002940     03  WS-PRINTDATE.                                            00294000
002950         05  WS-PRINTMO          PIC 9(02).                       00295000
002960         05  WS-PRINTDSH1        PIC X(01)       VALUE '-'.       00296000
002970         05  WS-PRINTDA          PIC 9(02).                       00297000
002980         05  WS-PRINTDSH2        PIC X(01)       VALUE '-'.       00298000
002990         05  WS-PRINTYR          PIC 9(04).                       00299000
003000     03  WS-RPTCTL.                                               00300000
003010         05  WS-RPRPTSRT.                                         00301000
003020             07  WS-RPRPTSRT1                                     00302000
003030                                 PIC X(01).                       00303000
003040             07  WS-RPRPTSRT2                                     00304000
003050                                 PIC X(01).                       00305000
003060         05  WS-DSRPTFRM         PIC X(02).                       00306000
003070         05  WS-DSRPTPFC         PIC X(01).                       00307000
003080     03  WS-RPTCTL-41.                                            00308000
003090         05  WS-RPRPTSRT-41.                                      00309000
003100             07  WS-RPRPTSRT1-41                                  00310000
003110                                 PIC X(01).                       00311000
003120             07  WS-RPRPTSRT2-41                                  00312000
003130                                 PIC X(01).                       00313000
003140         05  WS-DSRPTFRM-41      PIC X(02).                       00314000
003150         05  WS-DSRPTPFC-41      PIC X(01).                       00315000
003160     03  WS-RPRPTSRTPAC          PIC S9(03)      COMP-3.          00316000
003170     03  WS-RPRPTSRTBIN          PIC S9(04)      COMP.            00317000
003180     03  WS-RPRPTSRTBINR REDEFINES WS-RPRPTSRTBIN.                00318000
003190         05  FILLER              PIC X(01).                       00319000
003200         05  WS-BYTE             PIC X(01).                       00320000
003210     03  WS-REPRECSEQ            PIC S9(09)      COMP             00321000
003220                                                 VALUE +0.        00322000
003230     03  WS-HOLDINST             PIC S9(03)      COMP-3           00323000
003240                                                 VALUE ZEROS.     00324000
003250     03  WS-HOLD0001INST         PIC S9(03)      COMP-3           00325000
003260                                                 VALUE ZEROS.     00326000
003270     03  WS-HOLD2001BRANCH       PIC S9(05)      COMP-3           00327000
003280                                                 VALUE ZEROS.     00328000
003290     03  WS-FUNCTION             PIC X(01).                       00329000
003300     03  WS-SORTRETURN           PIC S9(04).                      00330000
003310     03  WS-RECINFO.                                              00331000
003320         05  WS-RECID            PIC X(03)       OCCURS 40.       00332000
003330         05  WS-RECNAME          PIC X(30)       OCCURS 40.       00333000
003340     03  WS-RECTOTALS                            OCCURS 07.       00334000
003350         05  WS-ADDED            PIC 9(09)       OCCURS 40.       00335000
003360         05  WS-CHANGED          PIC 9(09)       OCCURS 40.       00336000
003370         05  WS-DELETED          PIC 9(09)       OCCURS 40.       00337000
003380     03  WS-KEYBYTES.                                             00338000
003390         05  WS-KBHC             PIC X(01).                       00339000
003400         05  WS-KBBK             PIC X(01).                       00340000
003410         05  WS-KBRG             PIC X(01).                       00341000
003420         05  WS-KBBR             PIC X(01).                       00342000
003430         05  WS-KBTY             PIC X(01).                       00343000
003440         05  WS-KBOF             PIC X(01).                       00344000
003450     03  WS-KEYBYTE6     REDEFINES WS-KEYBYTES.                   00345000
003460         05  WS-KB06             PIC X(06).                       00346000
003470     03  WS-KEYBYTE5     REDEFINES WS-KEYBYTES.                   00347000
003480         05  WS-KB05             PIC X(05).                       00348000
003490         05  WS-KBCLEAR1         PIC X(01).                       00349000
003500     03  WS-KEYBYTE4     REDEFINES WS-KEYBYTES.                   00350000
003510         05  WS-KB04             PIC X(04).                       00351000
003520         05  WS-KBCLEAR2         PIC X(02).                       00352000
003530     03  WS-KEYBYTE3     REDEFINES WS-KEYBYTES.                   00353000
003540         05  WS-KB03             PIC X(03).                       00354000
003550         05  WS-KBCLEAR3         PIC X(03).                       00355000
003560     03  WS-KEYBYTE2     REDEFINES WS-KEYBYTES.                   00356000
003570         05  WS-KB02             PIC X(02).                       00357000
003580         05  WS-KBCLEAR4         PIC X(04).                       00358000
003590     03  WS-KEYBYTE1     REDEFINES WS-KEYBYTES.                   00359000
003600         05  WS-KB01             PIC X(01).                       00360000
003610         05  WS-KBCLEAR5         PIC X(05).                       00361000
003620     03  WS-OPTFLAGS.                                             00362000
003630         05  WS-OPTFLAG          PIC X(01)       OCCURS 0100.     00363000
003640     03  WS-LASTKEY.                                              00364000
003650         05  WS-LRPTNBR          PIC S9(04)      COMP.            00365000
003660         05  WS-LFORMX           PIC X(02).                       00366000
003670         05  WS-LSEPREP          PIC X(01).                       00367000
003680         05  WS-LHOLDCOX.                                         00368000
003690             07  WS-LHOLDCO      PIC S9(03)      COMP-3.          00369000
003700         05  WS-LINSTX.                                           00370000
003710             07  WS-LINST        PIC S9(04)      COMP-3.          00371000
003720         05  WS-LALTBRANCHX.                                      00372000
003730             07  WS-LALTBRANCH                                    00373000
003740                                 PIC S9(05)      COMP-3.          00374000
003750         05  WS-LSPEC            PIC X(01).                       00375000
003760         05  WS-LREGIONX.                                         00376000
003770             07  WS-LREGION      PIC S9(03)      COMP-3.          00377000
003780         05  WS-LBRANCHX.                                         00378000
003790             07  WS-LBRANCH      PIC S9(05)      COMP-3.          00379000
003800         05  WS-LTYPEX.                                           00380000
003810             07  WS-LTYPE        PIC S9(03)      COMP-3.          00381000
003820         05  WS-LOFFICER         PIC X(09).                       00382000
003830         05  WS-LRECID           PIC X(01).                       00383000
003840         05  WS-LPRODCODE        PIC X(06).                       00384000
003850         05  WS-LACCTNBR         PIC X(18).                       00385000
003860         05  WS-LMODEL           PIC X(10).                       00386000
003870         05  WS-LSEQX.                                            00387000
003880             07  WS-LSEQ         PIC S9(09)      COMP.            00388000
003890         05  WS-LRPTPFC          PIC X(01).                       00389000
003900         05  WS-LPAGEBRK.                                         00390000
003910             07  WS-LBRPAGE      PIC X(01).                       00391000
003920             07  WS-LTYPAGE      PIC X(01).                       00392000
003930     03  WS-NEWKEY               PIC X(01)       VALUE 'X'.       00393000
003940     03  WS-NEWRECID             PIC X(01)       VALUE SPACE.     00394000
003950     03  WS-TOTDESC.                                              00395000
003960         05  WS-TOTDESC1         PIC X(15)       VALUE SPACE.     00396000
003970         05  FILLER              PIC X(01)       VALUE SPACE.     00397000
003980         05  WS-TOTDESC2         PIC X(15)       VALUE SPACE.     00398000
003990         05  WS-TOTNBR1X REDEFINES WS-TOTDESC2.                   00399000
004000             07 WS-TOTNBR1       PIC 9(01).                       00400000
004010             07 FILLER           PIC X(14).                       00401000
004020         05  WS-TOTNBR2X REDEFINES WS-TOTDESC2.                   00402000
004030             07 WS-TORNBR2       PIC 9(02).                       00403000
004040             07 FILLER           PIC X(13).                       00404000
004050         05  WS-TOTNBR3X REDEFINES WS-TOTDESC2.                   00405000
004060             07 WS-TOTNBR3       PIC 9(04).                       00406000
004070             07 FILLER           PIC X(11).                       00407000
004080         05  WS-TOTNBR4X REDEFINES WS-TOTDESC2.                   00408000
004090             07 WS-TORNBR4       PIC 9(04).                       00409000
004100             07 FILLER           PIC X(11).                       00410000
004110         05  WS-TOTNBR5X REDEFINES WS-TOTDESC2.                   00411000
004120             07 WS-TOTNBR5       PIC 9(05).                       00412000
004130             07 FILLER           PIC X(10).                       00413000
004140     03  WS-TOTALHEAD.                                            00414000
004150         05  FILLER              PIC X(08)       VALUE SPACE.     00415000
004160         05  FILLER              PIC X(54)       VALUE            00416000
004170         'TOTAL-DESCRIPTION                 RECORD-NAME         '.00417000
004180         05  FILLER              PIC X(54)       VALUE            00418000
004190         '                 ADDED     CHANGED     DELETED'.        00419000
004200 01  WS-RGNAREAS.                                                 00420000
004210     03  WS-RGNMIMEFFDT          PIC S9(07)      COMP-3.          00421000
004220     03  WS-RGNMIMSUB            PIC S9(04)      COMP             00422000
004230                                                 VALUE +0000.     00423000
004240     03  WS-RGNBRSUB             PIC S9(04)      COMP             00424000
004250                                                 VALUE +0000.     00425000
004260     03  WS-RGNBRMAX             PIC S9(04)      COMP             00426000
004270                                                 VALUE +1500.     00427000
004280     03  WS-RGNBRTABLE.                                           00428000
004290         05  WS-RGNBRTBL                         OCCURS 1500 TIMES00429000
004300                                                 ASCENDING KEY IS 00430000
004310                                                 WS-RGNBRBR       00431000
004320                                                 INDEXED BY       00432000
004330                                                 IDX-RGNBR.       00433000
004340             07  WS-RGNBRBR      PIC S9(05)      COMP-3.          00434000
004350             07  WS-RGNBRRGN     PIC S9(03)      COMP-3.          00435000
004360             07  WS-RGNBRNAM     PIC X(30).                       00436000
004370     03  WS-CARDREC.                                              00437000
004380         05  WS-CARDSYS          PIC X(02).                       00438000
004390         05  WS-CARDBANK.                                         00439000
004400             07  WS-CARDBANK9    PIC 9(04).                       00440000
004410         05  WS-CARDFORM         PIC X(02).                       00441000
004420         05  WS-CARDFICHE.                                        00442000
004430             07  WS-CARDFICHE9   PIC 9(01).                       00443000
P0047          05  WS-CARDSORTORDER    PIC X(01).                       00444000
P0047          05  FILLER              PIC X(70).                       00444290
004450     03  WS-LASTFORM             PIC X(02)       VALUE SPACES.    00445000
004460     03  WS-ALLSW                PIC X(01)       VALUE SPACES.    00446000
004470     03  WS-INST-SW              PIC X(01)       VALUE SPACES.    00447000
004480     03  WS-DEFAULT-SWITCH       PIC X(01)       VALUE SPACES.    00448000
004490     03  WS-DEFAULT-REC          PIC X(80)       VALUE SPACES.    00449000
004500     03  WS-SAVE-CDTBLE.                                          00450000
004510         05  WS-SAVE-CDREC       PIC X(80)       OCCURS           00451000
004520                                                 9999 TIMES.      00452000
004530******************************************************************00453000
004540 PROCEDURE DIVISION.                                              00454000
004550******************************************************************00455000
004560 SORT-ROUTINE SECTION.                                            00456000
004570 SR-START.                                                        00457000
004580     SORT RP-SORTFIL                                              00458000
004590         ASCENDING KEY RP-SORTKEY                                 00459000
004600         INPUT PROCEDURE INITIAL-ROUTINE THRU READ-REPORTO        00460000
004610         OUTPUT PROCEDURE MAIN-LOGIC.                             00461000
004620     MOVE SORT-RETURN TO WS-SORTRETURN.                           00462000
004630     IF WS-SORTRETURN IS NOT EQUAL TO +0                          00463000
004640         GO TO AR-0001.                                           00464000
004650     CLOSE PRINTERFIL.                                            00465000
004660 SR-EXIT.                                                         00466000
000000 COPY SRP027.                                                     00467000
004680     STOP RUN.                                                    00468000
004690******************************************************************00469000
004700 INITIAL-ROUTINE SECTION.                                         00470000
004710 IR-START.                                                        00471000
004720     OPEN INPUT RP-CARDFIL.                                       00472000
004730     OPEN OUTPUT                                                  00473000
004740         PRINTERFIL.                                              00474000
004750     PERFORM GET-FILE-ORGANIZATION.                               00475000
004760     MOVE 'N' TO RPS-BNK-LOG.                                     00476000
004770     MOVE 'RPD036' TO SR-APIPROGLIT.                              00477000
004780     MOVE 'RPD036' TO WS-ABPROGID.                                00478000
004790     MOVE 'RPD036' TO WS-UPD-USER.                                00479000
004800     MOVE ZEROS TO RPBNK-INST.                                    00480000
004810     PERFORM RPS-BNK-GET-REQUEST.                                 00481000
004820     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00482000
004830         GO TO AR-0002.                                           00483000
004840     PERFORM CARD-READ.                                           00484000
004850******************************************************************00485000
004860 READ-REPORTO SECTION.                                            00486000
004870 RR-START.                                                        00487000
004880     MOVE 'N  ' TO WS-TRPTO.                                      00488000
004890     MOVE SPACE TO WS-RECINFO.                                    00489000
004900     PERFORM CALL-RPTOFIL.                                        00490000
004910     IF WS-FUNCTION IS EQUAL TO 'E'                               00491000
004920         GO TO RR-EXIT.                                           00492000
004930     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00493000
004940         GO TO AR-0003.                                           00494000
004950     MOVE RPRPTO-RECORD TO RPSORT-RECORD.                         00495000
004960     IF RPRPTO-INST IS NOT NUMERIC                                00496000
004970         OR RPRPTO-INST IS EQUAL TO ZERO                          00497000
004980         GO TO RR-START.                                          00498000
004990     MOVE LOW-VALUES TO RP-SORTKEY.                               00499000
005000 RR-SEPREPNO.                                                     00500000
005010     MOVE LOW-VALUES TO WS-RPRPTSRTBINR.                          00501000
005020     MOVE WS-RPRPTSRT1 TO WS-BYTE.                                00502000
005030     MOVE WS-RPRPTSRTBIN TO WS-RPRPTSRTPAC.                       00503000
005040     IF WS-RPRPTSRTPAC IS LESS THAN +240                          00504000
005050         ADD +57 TO WS-RPRPTSRTPAC.                               00505000
005060     SUBTRACT +240 FROM WS-RPRPTSRTPAC.                           00506000
005070 RR-BANKNBR.                                                      00507000
005080     MOVE SPACE TO WS-RBRPAGE.                                    00508000
005090     IF WS-RPRPTSRTPAC IS NOT LESS THAN +2                        00509000
005100         MOVE 'X' TO WS-RBRPAGE                                   00510000
005110         SUBTRACT +2 FROM WS-RPRPTSRTPAC.                         00511000
005120     MOVE RPRPTO-INST TO WS-RINST.                                00512000
005130 RR-HOLDCONBR.                                                    00513000
005140     IF WS-RPRPTSRTPAC IS LESS THAN +1                            00514000
005150         GO TO RR-START2.                                         00515000
005160     SUBTRACT +1 FROM WS-RPRPTSRTPAC.                             00516000
005170     IF RPRPTO-INST IS EQUAL TO WS-HOLD0001INST                   00517000
005180         GO TO RR-HOLDCONBRMOVE.                                  00518000
005190     MOVE RPRPTO-INST TO WS-HOLD0001INST.                         00519000
005200     MOVE RPRPTO-INST TO MIM-1001KINST.                           00520000
005210     MOVE MIC-MST-1001-PRI TO MIC-MST-REC-PRI.                    00521000
005220     MOVE ZERO TO MIM-1001KINST.                                  00522000
005230     MOVE 1001 TO MIM-1001KREC.                                   00523000
005240     MOVE MI1001-RECORD TO MIMST-RECORD.                          00524000
005250     PERFORM MIC-MST-GET-REQUEST.                                 00525000
005260     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00526000
005270         GO TO AR-0004.                                           00527000
005280     MOVE MIMST-RECORD TO MI1001-RECORD.                          00528000
005290 RR-HOLDCONBRMOVE.                                                00529000
005300     MOVE MIM-1001HCO TO WS-RHOLDCO.                              00530000
005310 RR-START2.                                                       00531000
005320     MOVE LOW-VALUES TO WS-RPRPTSRTBINR.                          00532000
005330     MOVE WS-RPRPTSRT2 TO WS-BYTE.                                00533000
005340     MOVE WS-RPRPTSRTBIN TO WS-RPRPTSRTPAC.                       00534000
005350     IF WS-RPRPTSRTPAC IS LESS THAN +240                          00535000
005360         ADD +57 TO WS-RPRPTSRTPAC.                               00536000
005370     SUBTRACT +240 FROM WS-RPRPTSRTPAC.                           00537000
005380 RR-ACCTNBR.                                                      00538000
005390     MOVE SPACE TO WS-RTYPAGE.                                    00539000
005400     IF WS-RPRPTSRTPAC IS NOT LESS THAN +8                        00540000
005410         MOVE 'X' TO WS-RTYPAGE                                   00541000
005420         SUBTRACT +8 FROM WS-RPRPTSRTPAC.                         00542000
005430     MOVE RPRPTO-PRODCODE TO WS-RPRODCODE.                        00543000
005440     MOVE RPRPTO-ACCTNBR TO WS-RACCTNBR.                          00544000
P0047      MOVE SPACES to WS-SORTACCOUNT.                               00544100
P0047      IF WS-CARDSORTORDER IS EQUAL TO 'Y'                          00544200
P0047          MOVE RPRPTO-PRODCODE TO WS-SORTPRODCODE                  00544300
P0047          MOVE RPRPTO-ACCTNBR TO WS-SORTACCOUNT                    00544400
P0047          MOVE RPRPTO-MODEL TO WS-SORTMODEL.                       00544500
005450     MOVE RPRPTO-MODEL TO WS-RMODEL.                              00545000
005460 RR-RECID.                                                        00546000
005470     IF RPS-ACT-REC-PRI IS EQUAL TO RPRPTO-RECID-2-LOG            00547000
005480         MOVE 'A' TO WS-RRECID                                    00548000
005490         GO TO RR-CUSTNBR.                                        00549000
005500     IF RPS-IDX-REC-PRI IS EQUAL TO RPRPTO-RECID-2-LOG            00550000
005510         MOVE 'B' TO WS-RRECID                                    00551000
005520         GO TO RR-CUSTNBR.                                        00552000
005530     IF RPS-MST-REC-PRI IS EQUAL TO RPRPTO-RECID-2-LOG            00553000
005540         MOVE 'C' TO WS-RRECID                                    00554000
005550         GO TO RR-CUSTNBR.                                        00555000
005560     IF RPS-QUA-REC-PRI IS EQUAL TO RPRPTO-RECID-2-LOG            00556000
005570         MOVE 'D' TO WS-RRECID                                    00557000
005580         GO TO RR-CUSTNBR.                                        00558000
005590     IF RPS-REL-REC-PRI IS EQUAL TO RPRPTO-RECID-2-LOG            00559000
005600         MOVE 'E' TO WS-RRECID                                    00560000
005610         GO TO RR-CUSTNBR.                                        00561000
005620     IF RPS-SEC-REC-PRI IS EQUAL TO RPRPTO-RECID-2-LOG            00562000
005630         MOVE 'F' TO WS-RRECID                                    00563000
005640         GO TO RR-CUSTNBR.                                        00564000
005650     MOVE 'A' TO WS-RRECID.                                       00565000
005660 RR-CUSTNBR.                                                      00566000
005670     IF WS-RPRPTSRTPAC IS NOT LESS THAN +4                        00567000
005680         SUBTRACT +4 FROM WS-RPRPTSRTPAC.                         00568000
005690 RR-FINISH.                                                       00569000
005700     PERFORM PROCESS-CARD.                                        00570000
005710     MOVE WS-CARDFORM TO WS-RFORMX.                               00571000
005720     MOVE WS-CARDFICHE TO WS-RRPTPFC.                             00572000
005730     MOVE SPACE TO WS-RSPEC.                                      00573000
005740     ADD +1 TO WS-REPRECSEQ.                                      00574000
005750     MOVE WS-REPRECSEQ TO WS-RSEQ.                                00575000
005760     MOVE 40 TO WS-RPTNBR.                                        00576000
005770 RR-RELEASE.                                                      00577000
005780     RELEASE RPSORT-RECORD.                                       00578000
005790     GO TO RR-START.                                              00579000
005800 RR-EXIT.                                                         00580000
005810     EXIT.                                                        00581000
005820******************************************************************00582000
005830 MAIN-LOGIC SECTION.                                              00583000
005840 ML-START.                                                        00584000
005850     RETURN RP-SORTFIL                                            00585000
005860         AT END                                                   00586000
005870         GO TO ML-EOF.                                            00587000
005880     IF WS-FIRSTSW IS EQUAL TO 'N'                                00588000
005890         GO TO ML-PROCESS.                                        00589000
005900     MOVE 'N' TO WS-FIRSTSW.                                      00590000
005910     MOVE RP-SORTKEY TO WS-LASTKEY.                               00591000
005920     MOVE WS-RFORMX TO SR-FORM.                                   00592000
005930     MOVE WS-RRPTPFC TO SR-FICHE.                                 00593000
005940     PERFORM CHANGE-FORMS.                                        00594000
005950     PERFORM CHANGE-BANK.                                         00595000
005960     PERFORM CLEAR-TOTALS.                                        00596000
005970     ADD +1 TO SR-PGCTR.                                          00597000
005980     PERFORM HEADING-ROUTINE.                                     00598000
005990 ML-PROCESS.                                                      00599000
006000     MOVE SPACE TO WS-KEYBYTES.                                   00600000
006010     MOVE SPACE TO WS-NEWRECID.                                   00601000
006020     IF WS-RPTNBR IS NOT EQUAL TO WS-LRPTNBR                      00602000
006030         PERFORM ML-SETHC THRU ML-SETRG                           00603000
006040         GO TO ML-REPORT.                                         00604000
006050     IF WS-RHOLDCOX IS NOT EQUAL TO WS-LHOLDCOX                   00605000
006060         AND WS-LHOLDCOX IS NOT EQUAL TO LOW-VALUES               00606000
006070         PERFORM ML-SETHC THRU ML-SETRG                           00607000
006080         GO TO ML-REPORT.                                         00608000
006090     IF WS-RINSTX IS NOT EQUAL TO WS-LINSTX                       00609000
006100         AND WS-LINSTX IS NOT EQUAL TO LOW-VALUES                 00610000
006110         PERFORM ML-SETBK THRU ML-SETRG                           00611000
006120         GO TO ML-SEPRPT.                                         00612000
006130     IF WS-RREGIONX IS NOT EQUAL TO WS-LREGIONX                   00613000
006140         AND WS-LREGIONX IS NOT EQUAL TO LOW-VALUES               00614000
006150         PERFORM ML-SETRG                                         00615000
006160         GO TO ML-SEPRPT.                                         00616000
006170 ML-SEPRPT.                                                       00617000
006180     IF WS-RSEPREP IS NOT EQUAL TO WS-LSEPREP                     00618000
006190         OR WS-RSPEC IS NOT EQUAL TO WS-LSPEC                     00619000
006200         OR WS-RFORMX IS NOT EQUAL TO WS-LFORMX                   00620000
006210         PERFORM ML-SETHC THRU ML-SETRG.                          00621000
006220     GO TO ML-REPORT.                                             00622000
006230 ML-SETHC.                                                        00623000
006240     IF WS-LHOLDCOX IS NOT EQUAL TO LOW-VALUES                    00624000
006250         MOVE 'X' TO WS-KBHC.                                     00625000
006260 ML-SETBK.                                                        00626000
006270     IF WS-LINSTX IS NOT EQUAL TO LOW-VALUES                      00627000
006280         MOVE 'X' TO WS-KBBK.                                     00628000
006290 ML-SETRG.                                                        00629000
006300     IF WS-LREGIONX IS NOT EQUAL TO LOW-VALUES                    00630000
006310         MOVE 'X' TO WS-KBRG.                                     00631000
006320 ML-REPORT.                                                       00632000
006330     IF WS-KEYBYTES IS NOT EQUAL TO SPACE                         00633000
006340         PERFORM TOTAL-ROUTINE.                                   00634000
006350     IF WS-RINSTX IS NOT EQUAL TO WS-LINSTX                       00635000
006360         OR WS-RRECID IS NOT EQUAL TO WS-LRECID                   00636000
006370         OR WS-RPRODCODE IS NOT EQUAL TO WS-LPRODCODE             00637000
006380         OR WS-RACCTNBR IS NOT EQUAL TO WS-LACCTNBR               00638000
006390         OR WS-RMODEL IS NOT EQUAL TO WS-LMODEL                   00639000
006400         OR WS-RSEPREP IS NOT EQUAL TO WS-LSEPREP                 00640000
006410         MOVE 'X' TO WS-NEWKEY.                                   00641000
006420     IF WS-RRECID IS NOT EQUAL TO WS-LRECID                       00642000
006430         AND WS-LRECID IS NOT EQUAL TO LOW-VALUES                 00643000
P0047          AND WS-CARDSORTORDER IS NOT EQUAL TO 'Y'                 00643500
006440         MOVE 'X' TO WS-NEWRECID.                                 00644000
006450     MOVE WS-RRPTPFC TO SR-FICHE.                                 00645000
006460     MOVE RP-SORTKEY TO WS-LASTKEY.                               00646000
006470     IF WS-KBHC IS EQUAL TO 'X'                                   00647000
006480         OR WS-KBBK IS EQUAL TO 'X'                               00648000
006490         PERFORM CHANGE-BANK                                      00649000
006500         GO TO ML-PAGE.                                           00650000
006510     IF WS-KBRG IS EQUAL TO 'X'                                   00651000
006520         PERFORM CHANGE-REGION                                    00652000
006530         GO TO ML-PAGE.                                           00653000
006540     IF WS-NEWRECID IS EQUAL TO 'X'                               00654000
006550         ADD +1 TO SR-PGCTR                                       00655000
006560         PERFORM HEADING-ROUTINE.                                 00656000
006570     GO TO ML-DETAIL.                                             00657000
006580 ML-PAGE.                                                         00658000
006590     IF SR-FORM IS NOT EQUAL TO WS-RFORMX                         00659000
006600         PERFORM CHANGE-FORMS.                                    00660000
006610     MOVE +1 TO SR-PGCTR.                                         00661000
006620     PERFORM HEADING-ROUTINE.                                     00662000
006630 ML-DETAIL.                                                       00663000
006640     PERFORM REPORT-PRINT.                                        00664000
006650     GO TO ML-START.                                              00665000
006660 ML-EOF.                                                          00666000
006670     IF WS-FIRSTSW IS EQUAL TO 'N'                                00667000
006680         PERFORM ML-SETBK THRU ML-SETRG                           00668000
006690         PERFORM TOTAL-ROUTINE.                                   00669000
006700     PERFORM MIC-MST-GLOBAL-CLOSE-REQUEST.                        00670000
006710     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00671000
006720         GO TO AR-0005.                                           00672000
006730     MOVE 'C  ' TO WS-TRPTO.                                      00673000
006740     PERFORM CALL-RPTOFIL.                                        00674000
006750     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00675000
006760         GO TO AR-0006.                                           00676000
006770 ML-EXIT.                                                         00677000
006780     EXIT.                                                        00678000
006790******************************************************************00679000
006800 REPORT-PRINT SECTION.                                            00680000
006810 RP-START.                                                        00681000
006820     IF SR-LINES + 8 IS GREATER THAN SR-PAGE                      00682000
006830         ADD +1 TO SR-PGCTR                                       00683000
006840         PERFORM HEADING-ROUTINE                                  00684000
006850         PERFORM PR-01 THRU PR-EXIT                               00685000
006860         PERFORM REPORT-PRINT-KEY                                 00686000
006870         MOVE SPACES TO WS-NEWKEY.                                00687000
006880     IF RPRPTO-NEW-RECORD IS EQUAL TO 'Y'                         00688000
006890         PERFORM REPORT-PRINT-NEW-RECORD                          00689000
006900         PERFORM PR-01 THRU PR-EXIT.                              00690000
006910     IF RPRPTO-AMTT-MISSING IS EQUAL TO 'Y'                       00691000
006920         MOVE 'RECORD NOT ESTABLISHED ON AMT TABLE' TO PLINE6     00692000
006930         PERFORM PR-01 THRU PR-EXIT                               00693000
006940         GO TO RP-EXIT.                                           00694000
006950     IF RPRPTO-FUNCTION IS EQUAL TO 'M'                           00695000
006960         GO TO RP-MAINTENANCE.                                    00696000
006970 RP-FORMATED-NEW-DELETE.                                          00697000
006980     MOVE ZERO TO WS-SUB1.                                        00698000
006990 RP-LOOP.                                                         00699000
007000     IF RPRPTO-PLINE IS EQUAL TO SPACES                           00700000
007010         GO TO RP-EXIT.                                           00701000
007020     MOVE RPRPTO-PLINE TO PLINE6.                                 00702000
007030     PERFORM PR-01 THRU PR-EXIT.                                  00703000
007040     GO TO RP-EXIT.                                               00704000
007050 RP-MAINTENANCE.                                                  00705000
007060     IF RPRPTO-ENTRYTYPE IS NOT EQUAL TO 'N'                      00706000
007070         GO TO RP-EXIT.                                           00707000
007080     ADD 1 TO WS-CHANGED (5, WS-RECSUB).                          00708000
007090     MOVE RPRPTO-OLDED TO P8-DATAFROM.                            00709000
007100     MOVE RPRPTO-FLDNAME TO P8-FLDNAME.                           00710000
007110     MOVE 'From' TO P8-FROMLIT.                                   00711000
007120     MOVE 'To' TO P8-TOLIT.                                       00712000
007130     MOVE RPRPTO-NEWED TO P8-DATATO.                              00713000
007140     PERFORM PR-01 THRU PR-EXIT.                                  00714000
007150 RP-EXIT.                                                         00715000
007160     EXIT.                                                        00716000
007170******************************************************************00717000
007180 REPORT-PRINT-NEW-RECORD SECTION.                                 00718000
007190 RPNR-START.                                                      00719000
007200     PERFORM PR-01 THRU PR-EXIT.                                  00720000
007210     MOVE ZERO TO SR-PSSUB1.                                      00721000
007220     IF WS-LAST-RECID IS EQUAL TO RPRPTO-RECID-2-LOG              00722000
007230         GO TO RPNR-PRINT.                                        00723000
007240     MOVE 0 TO WS-RECSUB.                                         00724000
007250 RPNR-LOOP.                                                       00725000
007260     ADD 1 TO WS-RECSUB.                                          00726000
007270     IF WS-RECSUB IS GREATER THAN 40                              00727000
007280         GO TO AR-0007.                                           00728000
007290     IF RPRPTO-RECID-2-LOG IS EQUAL TO WS-RECID (WS-RECSUB)       00729000
007300         GO TO RPNR-PRINT.                                        00730000
007310     IF WS-RECID (WS-RECSUB) IS EQUAL TO SPACES                   00731000
007320         MOVE RPRPTO-RECID-2-LOG TO WS-LAST-RECID                 00732000
007330         MOVE RPRPTO-RECID-2-LOG TO WS-RECID (WS-RECSUB)          00733000
007340         MOVE RPRPTO-RECNAME TO WS-RECNAME (WS-RECSUB)            00734000
007350         GO TO RPNR-PRINT.                                        00735000
007360     GO TO RPNR-LOOP.                                             00736000
007370 RPNR-PRINT.                                                      00737000
007380     IF WS-NEWKEY IS NOT EQUAL TO 'X'                             00738000
007390         GO TO RPNR-RECORD.                                       00739000
007400     MOVE SPACES TO WS-NEWKEY.                                    00740000
007410     PERFORM REPORT-PRINT-KEY.                                    00741000
007420 RPNR-RECORD.                                                     00742000
007430     MOVE RPRPTO-RECNAME TO P10-RECNAME.                          00743000
007440     MOVE 'Previous Maint' TO P10-LASTLIT.                        00744000
007450     IF RPRPTO-PRVMNTDT IS NOT NUMERIC                            00745000
007460         MOVE ZERO TO RPRPTO-PRVMNTDT.                            00746000
007470     MOVE RPRPTO-PRVMNTDT TO WS-DATE.                             00747000
007480     MOVE WS-TCMON TO P10-LASTMO.                                 00748000
007490     MOVE WS-TCDAY TO P10-LASTDA.                                 00749000
007500     MOVE WS-TCYR TO P10-LASTYR.                                  00750000
007510     MOVE '-' TO P10-LASTDSH1.                                    00751000
007520     MOVE '-' TO P10-LASTDSH2.                                    00752000
007530     PERFORM PR-01 THRU PR-EXIT.                                  00753000
007540 RPNR-FUNCTION.                                                   00754000
007550     MOVE 'Function  . . .' TO P4-FUNCLIT.                        00755000
007560     MOVE 'Date  . . . . .' TO P4-DATELIT.                        00756000
007570     MOVE 'Time  . . . . .' TO P4-TIMELIT.                        00757000
007580     MOVE 'Updated By  . .' TO P4-USERLIT.                        00758000
007590     MOVE RPRPTO-UPD-USER TO P4-USER.                             00759000
007600     MOVE RPRPTO-DATE-AUDIT TO WS-DATE.                           00760000
007610     MOVE WS-TCMON TO P4-DTMO.                                    00761000
007620     MOVE '-' TO P4-DSH1.                                         00762000
007630     MOVE WS-TCDAY TO P4-DTDA.                                    00763000
007640     MOVE '-' TO P4-DSH2.                                         00764000
007650     MOVE WS-TCYR TO P4-DTYR.                                     00765000
007660     DIVIDE RPRPTO-TIME-AUDIT BY 100 GIVING SR-ETFROMTIME.        00766000
007670     MOVE SR-ETFRHRS TO P4-TMHR.                                  00767000
007680     MOVE ':' TO P4-DOT1.                                         00768000
007690     MOVE SR-ETFRMINS TO P4-TMMI.                                 00769000
007700     MOVE ':' TO P4-DOT2.                                         00770000
007710     MOVE SR-ETFRSECS TO P4-TMSC.                                 00771000
007720     MOVE SPACES TO WS-LAST-RECID.                                00772000
007730     IF RPRPTO-FUNCTION IS EQUAL TO 'A'                           00773000
007740         ADD 1 TO WS-ADDED (5, WS-RECSUB)                         00774000
007750         MOVE 'Added  ' TO P4-FUNCTION.                           00775000
007760     IF RPRPTO-FUNCTION IS EQUAL TO 'M'                           00776000
007770         MOVE 'Changed' TO P4-FUNCTION.                           00777000
007780     IF RPRPTO-FUNCTION IS EQUAL TO 'D'                           00778000
007790         ADD 1 TO WS-DELETED (5, WS-RECSUB)                       00779000
007800         MOVE 'Deleted' TO P4-FUNCTION.                           00780000
007810     PERFORM PR-01 THRU PR-EXIT.                                  00781000
007820 RPNR-KEY.                                                        00782000
007830     IF RPS-ACT-REC-PRI IS EQUAL TO RPRPTO-RECID-2-LOG            00783000
007840         OR RPS-MST-REC-PRI IS EQUAL TO RPRPTO-RECID-2-LOG        00784000
007850         OR RPS-IDX-REC-PRI IS EQUAL TO RPRPTO-RECID-2-LOG        00785000
007860         GO TO RPNR-EXIT.                                         00786000
007870     MOVE RPRPTO-KEY-LINED TO SR-PSLIST.                          00787000
007880     PERFORM PARAMETER-SEARCH.                                    00788000
007890     PERFORM PARAMETER-SEARCH.                                    00789000
007900     PERFORM PARAMETER-SEARCH.                                    00790000
007910     PERFORM PARAMETER-SEARCH.                                    00791000
007920     IF RPS-SEC-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00792000
007930         PERFORM PARAMETER-SEARCH.                                00793000
007940     MOVE 'Inst 2  . . . .' TO P9-KEYLIT1.                        00794000
007950     MOVE SR-PSPARM TO P9-KEY1.                                   00795000
007960     PERFORM PARAMETER-SEARCH.                                    00796000
007970     MOVE 'Prod Cd 2 . . .' TO P9-KEYLIT2.                        00797000
007980     MOVE SR-PSPARM TO P9-KEY2.                                   00798000
007990     PERFORM PARAMETER-SEARCH.                                    00799000
008000     MOVE 'Account 2 . . .' TO P9-KEYLIT3.                        00800000
008010     MOVE SR-PSPARM TO P9-KEY3.                                   00801000
008020     IF P9-KEY3 IS EQUAL TO SPACES                                00802000
008030         MOVE WS-INST TO P9-KEY1                                  00803000
008040         MOVE WS-RPRODCODE TO P9-KEY2                             00804000
008050         MOVE WS-RACCTNBR TO P9-KEY3.                             00805000
008060     PERFORM PR-01 THRU PR-EXIT.                                  00806000
008070 RPNR-EXIT.                                                       00807000
008080     EXIT.                                                        00808000
008090******************************************************************00809000
008100 REPORT-PRINT-KEY SECTION.                                        00810000
008110 RPK-START.                                                       00811000
008120     MOVE 'Prod Cd  . .' TO P5-KEYLIT1.                           00812000
008130     MOVE RPRPTO-PRODCODE TO P5-KEY1.                             00813000
008140     IF WS-RRECID IS EQUAL TO 'B'                                 00814000
008150         MOVE 'ID Nbr . . .' TO P5-KEYLIT2                        00815000
008160         MOVE SPACES TO P5-KEYLIT3                                00816000
008170         MOVE SPACES TO P5-KEY3                                   00817000
P0047          GO TO RPK-CONT.                                          00818000
P0047      IF WS-RRECID IS NOT EQUAL TO 'A'                             00818290
008190         MOVE 'Account  . .' TO P5-KEYLIT2                        00819000
008200         MOVE 'Model  . . .' TO P5-KEYLIT3                        00820000
P0047          MOVE RPRPTO-MODEL TO P5-KEY3                             00821000
P0047      ELSE                                                         00821190
P0047          MOVE 'Account  . .' TO P5-KEYLIT2.                       00821380
P0047  RPK-CONT.                                                        00821570
008220     MOVE RPRPTO-ACCTNBR TO SR-JUSTLONGIN.                        00822000
008230     MOVE 18 TO SR-JLGTH.                                         00823000
008240     PERFORM LEFT-JUSTIFY.                                        00824000
008250     MOVE SR-JUSTLONGOUT TO P5-KEY2.                              00825000
008260     PERFORM PR-01 THRU PR-EXIT.                                  00826000
008270     PERFORM PR-01 THRU PR-EXIT.                                  00827000
008280 RPK-EXIT.                                                        00828000
008290     EXIT.                                                        00829000
008300******************************************************************00830000
008310 TOTAL-ROUTINE SECTION.                                           00831000
008320 TR-START.                                                        00832000
008330     IF WS-KB02 IS EQUAL TO SPACE                                 00833000
008340         GO TO TR-EXIT.                                           00834000
008350     MOVE +0005 TO WS-SUB1.                                       00835000
008360     IF WS-KBBK IS EQUAL TO SPACE                                 00836000
008370         DISPLAY 'WS-KBBK: ' WS-KBBK                              00837000
008380         PERFORM ROLL-TOTAL                                       00838000
008390         GO TO TR-EXIT.                                           00839000
008400     MOVE SPACE TO WS-TOTDESC.                                    00840000
008410     MOVE 'Institution . .' TO WS-TOTDESC1.                       00841000
008420     MOVE WS-LINST TO WS-TOTNBR3.                                 00842000
008430     PERFORM TOTAL-PRINT.                                         00843000
008440     PERFORM ROLL-TOTAL.                                          00844000
008450 TR-EXIT.                                                         00845000
008460     EXIT.                                                        00846000
008470******************************************************************00847000
008480 TOTAL-PRINT SECTION.                                             00848000
008490 TP-START.                                                        00849000
008500     MOVE +0001 TO WS-SUB2.                                       00850000
008510 TP-HEADING.                                                      00851000
008520     IF (SR-LINES + 10) IS GREATER THAN SR-PAGE                   00852000
008530         ADD +1 TO SR-PGCTR                                       00853000
008540         PERFORM HEADING-ROUTINE.                                 00854000
008550     PERFORM PR-01 THRU PR-EXIT.                                  00855000
008560     MOVE WS-TOTALHEAD TO PLINE6.                                 00856000
008570     PERFORM PR-01 THRU PR-EXIT.                                  00857000
008580     MOVE WS-TOTDESC TO P7-TOTDESC.                               00858000
008590 TP-LOOP.                                                         00859000
008600     IF (SR-LINES + 3) IS GREATER THAN SR-PAGE                    00860000
008610         GO TO TP-HEADING.                                        00861000
008620     IF WS-RECID (WS-SUB2) IS EQUAL TO SPACE                      00862000
008630         GO TO TP-EXIT.                                           00863000
008640     IF WS-ADDED (WS-SUB1, WS-SUB2) IS EQUAL TO ZERO              00864000
008650         AND WS-CHANGED (WS-SUB1, WS-SUB2) IS EQUAL TO ZERO       00865000
008660         AND WS-DELETED (WS-SUB1, WS-SUB2) IS EQUAL TO ZERO       00866000
008670         ADD +0001 TO WS-SUB2                                     00867000
008680         GO TO TP-LOOP.                                           00868000
008690     MOVE WS-RECNAME (WS-SUB2) TO P7-RECNAME.                     00869000
008700     MOVE WS-ADDED (WS-SUB1, WS-SUB2) TO P7-ADDED.                00870000
008710     MOVE WS-CHANGED (WS-SUB1, WS-SUB2) TO P7-CHANGED.            00871000
008720     MOVE WS-DELETED (WS-SUB1, WS-SUB2) TO P7-DELETED.            00872000
008730     PERFORM PR-01 THRU PR-EXIT.                                  00873000
008740     IF WS-SUB2 IS LESS THAN +0040                                00874000
008750         ADD +0001 TO WS-SUB2                                     00875000
008760         GO TO TP-LOOP.                                           00876000
008770 TP-EXIT.                                                         00877000
008780     EXIT.                                                        00878000
008790******************************************************************00879000
008800 ROLL-TOTAL SECTION.                                              00880000
008810 RT-START.                                                        00881000
008820     MOVE WS-SUB1 TO WS-SUB2.                                     00882000
008830     ADD +0001 TO WS-SUB2.                                        00883000
008840     MOVE ZERO TO WS-SUB3.                                        00884000
008850 RT-LOOP.                                                         00885000
008860     ADD +0001 TO WS-SUB3.                                        00886000
008870     IF WS-RECID (WS-SUB3) IS EQUAL TO SPACE                      00887000
008880         GO TO RT-CLEAR.                                          00888000
008890     ADD WS-ADDED (WS-SUB1, WS-SUB3)                              00889000
008900         TO WS-ADDED (WS-SUB2, WS-SUB3).                          00890000
008910     ADD WS-CHANGED (WS-SUB1, WS-SUB3)                            00891000
008920         TO WS-CHANGED (WS-SUB2, WS-SUB3).                        00892000
008930     ADD WS-DELETED (WS-SUB1, WS-SUB3)                            00893000
008940         TO WS-DELETED (WS-SUB2, WS-SUB3).                        00894000
008950     IF WS-SUB3 IS LESS THAN +0040                                00895000
008960         GO TO RT-LOOP.                                           00896000
008970 RT-CLEAR.                                                        00897000
008980     MOVE ZERO TO WS-SUB3.                                        00898000
008990 RT-CLEAR-LOOP.                                                   00899000
009000     ADD +0001 TO WS-SUB3.                                        00900000
009010     IF WS-RECID (WS-SUB3) IS EQUAL TO SPACE                      00901000
009020         GO TO RT-EXIT.                                           00902000
009030     MOVE ZERO TO WS-ADDED (WS-SUB1, WS-SUB3).                    00903000
009040     MOVE ZERO TO WS-CHANGED (WS-SUB1, WS-SUB3).                  00904000
009050     MOVE ZERO TO WS-DELETED (WS-SUB1, WS-SUB3).                  00905000
009060     IF WS-SUB3 IS LESS THAN +0040                                00906000
009070         GO TO RT-CLEAR-LOOP.                                     00907000
009080 RT-EXIT.                                                         00908000
009090     EXIT.                                                        00909000
009100******************************************************************00910000
009110 CLEAR-TOTALS SECTION.                                            00911000
009120 CT-START.                                                        00912000
009130     MOVE ZERO TO WS-ADDED (01, 01).                              00913000
009140     MOVE ZERO TO WS-CHANGED (01, 01).                            00914000
009150     MOVE ZERO TO WS-DELETED (01, 01).                            00915000
009160     MOVE +0001 TO WS-SUB1.                                       00916000
009170     MOVE +0001 TO WS-SUB2.                                       00917000
009180 CT-LOOP.                                                         00918000
009190     ADD +0001 TO WS-SUB1.                                        00919000
009200     MOVE WS-ADDED (01, 01) TO WS-ADDED (WS-SUB1, WS-SUB2).       00920000
009210     MOVE WS-CHANGED (01, 01) TO WS-CHANGED (WS-SUB1, WS-SUB2).   00921000
009220     MOVE WS-DELETED (01, 01) TO WS-DELETED (WS-SUB1, WS-SUB2).   00922000
009230     IF WS-SUB1 IS LESS THAN +0007                                00923000
009240         GO TO CT-LOOP.                                           00924000
009250     MOVE +0000 TO WS-SUB1.                                       00925000
009260     IF WS-SUB2 IS LESS THAN +0040                                00926000
009270         ADD +0001 TO WS-SUB2                                     00927000
009280         GO TO CT-LOOP.                                           00928000
009290 CT-EXIT.                                                         00929000
009300     EXIT.                                                        00930000
009310***************************************************************** 00931000
009320 RPS-BNK-API SECTION.                                             00932000
000000 COPY RPPBNKA.                                                    00933000
009340******************************************************************00934000
009350 MIC-MST-API SECTION.                                             00935000
000000 COPY MIPMSTA.                                                    00936000
009370******************************************************************00937000
009380 GET-FILE-ORGANIZATION SECTION.                                   00938000
000000 COPY SRP093.                                                     00939000
009400******************************************************************00940000
009410 CALL-RPTOFIL SECTION.                                            00941000
009420 CR-START.                                                        00942000
009430     PERFORM CALL-RPRPTO.                                         00943000
009440     MOVE WS-FUNCTION TO WS-ABFC.                                 00944000
009450 CR-EXIT.                                                         00945000
009460     EXIT.                                                        00946000
009470******************************************************************00947000
009480 CALL-RPRPTO SECTION.                                             00948000
000000 COPY RPPRPTO.                                                    00949000
009500******************************************************************00950000
009510 CHANGE-BANK SECTION.                                             00951000
009520 CB-START.                                                        00952000
009530     MOVE RPRPTO-INST TO RPBNK-INST.                              00953000
009540     PERFORM RPS-BNK-GET-REQUEST.                                 00954000
009550     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00955000
009560         GO TO AR-0008.                                           00956000
009570     MOVE RPBNK-CURDT TO SR-CYEAR-FIRST.                          00957000
009580     MOVE SR-CMM TO SR-TCMON.                                     00958000
009590     MOVE SR-CDD TO SR-TCDAY.                                     00959000
009600     MOVE SR-CYYYY TO SR-TCYR.                                    00960000
009610     MOVE SR-TOCAL TO SR-TODAY.                                   00961000
009620     IF RPRPTO-INST IS NOT NUMERIC                                00962000
009630         MOVE ZERO TO RPRPTO-INST.                                00963000
009640     IF WS-INST IS EQUAL TO RPRPTO-INST                           00964000
009650         GO TO CB-CFREGION.                                       00965000
009660     MOVE RPRPTO-INST TO WS-INST.                                 00966000
009670     MOVE MIC-MST-1001-PRI TO MIC-MST-REC-PRI.                    00967000
009680     MOVE RPRPTO-INST TO MIM-1001KINST.                           00968000
009690     MOVE 1001 TO MIM-1001KREC.                                   00969000
009700     MOVE MI1001-RECORD TO MIMST-RECORD.                          00970000
009710     PERFORM MIC-MST-GET-REQUEST.                                 00971000
009720     IF WS-FUNCTION IS NOT EQUAL TO 'N'                           00972000
009730         AND WS-FUNCTION IS NOT EQUAL TO SPACE                    00973000
009740         GO TO AR-0009.                                           00974000
009750     IF WS-FUNCTION IS EQUAL TO 'N'                               00975000
009760         MOVE '** INVALID INST NUMBER **' TO SR-BKNAME            00976000
009770     ELSE                                                         00977000
009780         MOVE MIMST-RECORD TO MI1001-RECORD                       00978000
009790         MOVE MIM-1001NAME TO SR-BKNAME.                          00979000
009800     MOVE RPRPTO-INST TO SR-INSTR.                                00980000
009810 CB-CFHOLDCO.                                                     00981000
009820     IF WS-LHOLDCOX IS EQUAL TO LOW-VALUES                        00982000
009830         MOVE SPACES TO SR-HCNAME                                 00983000
009840         MOVE SPACES TO SR-HCNBR                                  00984000
009850         GO TO CB-CFBRANCH.                                       00985000
009860     MOVE MIC-MST-0020-PRI TO MIC-MST-REC-PRI.                    00986000
009870     MOVE RPRPTO-INST TO MIM-0020KINST.                           00987000
009880     MOVE 0020 TO MIM-0020KREC.                                   00988000
009890     MOVE MIM-1001HCO TO MIM-0020KHOLDCO.                         00989000
009900     MOVE MI0020-RECORD TO MIMST-RECORD.                          00990000
009910     PERFORM MIC-MST-GET-REQUEST.                                 00991000
009920     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00992000
009930         GO TO AR-0010.                                           00993000
009940     MOVE MIMST-RECORD TO MI0020-RECORD.                          00994000
009950     MOVE MIM-HCNAME TO SR-HCNAME.                                00995000
009960     MOVE MIM-0020KHOLDCO TO SR-HCNBRR.                           00996000
009970 CB-CFBRANCH.                                                     00997000
009980     MOVE HIGH-VALUES TO WS-RGNBRTABLE.                           00998000
009990     MOVE ZEROS TO WS-RGNBRSUB.                                   00999000
010000     MOVE MIC-MST-2001-PRI TO MIC-MST-REC-PRI.                    01000000
010010     MOVE ZEROS TO MIM-2001KINST.                                 01001000
010020     MOVE RPRPTO-INST TO MIM-2001KINST.                           01002000
010030     MOVE 2001 TO MIM-2001KREC.                                   01003000
010040     MOVE MI2001-RECORD TO MIMST-RECORD.                          01004000
010050     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           01005000
010060     IF WS-FUNCTION IS EQUAL TO 'E'                               01006000
010070         GO TO CB-CFREGION.                                       01007000
010080     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01008000
010090         GO TO AR-0011.                                           01009000
010100     GO TO CB-PROCESS-BRANCH.                                     01010000
010110 CB-CF2001LOOP.                                                   01011000
010120     PERFORM MIC-MST-GET-NEXT-REQUEST.                            01012000
010130     IF WS-FUNCTION IS EQUAL TO 'E'                               01013000
010140         GO TO CB-CFREGION.                                       01014000
010150     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01015000
010160         GO TO AR-0012.                                           01016000
010170 CB-PROCESS-BRANCH.                                               01017000
010180     MOVE MIMST-RECORD TO MI2001-RECORD.                          01018000
010190     IF MIM-2001KINST IS NOT EQUAL TO RPRPTO-INST                 01019000
010200         GO TO CB-CFREGION.                                       01020000
010210     ADD 1 TO WS-RGNBRSUB.                                        01021000
010220     IF WS-RGNBRSUB IS GREATER THAN WS-RGNBRMAX                   01022000
010230         GO TO AR-0013.                                           01023000
010240     MOVE MIM-2001KBRANCH TO WS-RGNBRBR (WS-RGNBRSUB).            01024000
010250     MOVE MIM-2001RPREG TO WS-RGNBRRGN (WS-RGNBRSUB).             01025000
010260     MOVE MIM-2001BRNAME TO WS-RGNBRNAM (WS-RGNBRSUB).            01026000
010270     GO TO CB-CF2001LOOP.                                         01027000
010280 CB-CFREGION.                                                     01028000
010290     IF WS-LREGIONX IS EQUAL TO LOW-VALUES                        01029000
010300         MOVE SPACES TO SR-RGNBR                                  01030000
010310         MOVE SPACES TO SR-RGNAME                                 01031000
010320         GO TO CB-SRSYSTEM.                                       01032000
010330     PERFORM CHANGE-REGION.                                       01033000
010340 CB-SRSYSTEM.                                                     01034000
010350     MOVE 'RELATIONSHIP PRICING' TO SR-SYSTEM.                    01035000
010360     IF WS-RPTNBR IS EQUAL TO 40                                  01036000
010370         MOVE 50040 TO SR-RPTNBR                                  01037000
010380         MOVE 'ONLINE MAINTENANCE JOURNAL' TO SR-REPORT.          01038000
010390 CB-EXIT.                                                         01039000
010400     EXIT.                                                        01040000
010410***************************************************************** 01041000
010420 CHANGE-REGION SECTION.                                           01042000
010430 CRG-START.                                                       01043000
010440     MOVE MIC-MST-0021-PRI TO MIC-MST-REC-PRI.                    01044000
010450     MOVE RPRPTO-INST TO MIM-0021KINST.                           01045000
010460     MOVE 0021 TO MIM-0021KREC.                                   01046000
010470     MOVE WS-RGNBRRGN (IDX-RGNBR) TO MIM-0021KREGIONNBR.          01047000
010480     MOVE MI0021-RECORD TO MIMST-RECORD.                          01048000
010490     PERFORM MIC-MST-GET-REQUEST.                                 01049000
010500     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01050000
010510         GO TO AR-0014.                                           01051000
010520     MOVE MIMST-RECORD TO MI2001-RECORD.                          01052000
010530     MOVE MIM-RGNAME TO SR-RGNAME.                                01053000
010540     MOVE WS-RGNBRRGN (IDX-RGNBR) TO SR-RGNBRR.                   01054000
010550 CRG-EXIT.                                                        01055000
010560     EXIT.                                                        01056000
010570***************************************************************** 01057000
010580 CHANGE-FORMS SECTION.                                            01058000
010590 CF-START.                                                        01059000
010600     MOVE WS-RFORMX TO SRW-FNO.                                   01060000
010610     MOVE 'RP' TO SRW-APPL.                                       01061000
010620     PERFORM PRINT-SEGMENTATION.                                  01062000
010630 CF-CONTINUE.                                                     01063000
010640     MOVE WS-RFORMX TO SR-FORM.                                   01064000
010650 CF-EXIT.                                                         01065000
010660     EXIT.                                                        01066000
010670******************************************************************01067000
010680 CARD-READ SECTION.                                               01068000
010690 CR-START.                                                        01069000
010700     MOVE SPACES TO WS-SAVE-CDTBLE.                               01070000
010710 CR-LOOP.                                                         01071000
010720     READ RP-CARDFIL INTO WS-CARDREC                              01072000
010730         AT END                                                   01073000
010740         GO TO CR-END.                                            01074000
010750     MOVE 'Y' TO WS-INST-SW.                                      01075000
010760     IF WS-CARDSYS IS NOT EQUAL TO '50'                           01076000
010770         GO TO AR-0015.                                           01077000
010780     IF WS-CARDBANK IS NOT NUMERIC                                01078000
010790         GO TO AR-0016.                                           01079000
010800     IF WS-CARDBANK IS NOT GREATER THAN ZEROS                     01080000
010810         MOVE 'Y' TO WS-DEFAULT-SWITCH                            01081000
010820         MOVE WS-CARDREC TO WS-DEFAULT-REC                        01082000
010830         GO TO CR-LOOP.                                           01083000
010840     MOVE WS-CARDBANK9 TO WS-SUB4.                                01084000
010850     MOVE WS-CARDREC TO WS-SAVE-CDREC (WS-SUB4).                  01085000
010860     GO TO CR-LOOP.                                               01086000
010870 CR-END.                                                          01087000
010880     CLOSE RP-CARDFIL.                                            01088000
010890     IF WS-INST-SW IS EQUAL TO 'Y'                                01089000
010900         GO TO CR-EXIT.                                           01090000
010910     MOVE 'Y' TO WS-ALLSW.                                        01091000
010920     MOVE '01' TO WS-CARDFORM.                                    01092000
010930     MOVE '1' TO WS-CARDFICHE.                                    01093000
010940 CR-EXIT.                                                         01094000
010950     EXIT.                                                        01095000
010960******************************************************************01096000
010970 PROCESS-CARD SECTION.                                            01097000
010980 PC-START.                                                        01098000
010990     IF WS-ALLSW IS EQUAL TO 'Y'                                  01099000
011000         GO TO PC-EXIT.                                           01100000
011010     MOVE RPRPTO-INST TO WS-SUB4.                                 01101000
011020     MOVE WS-SAVE-CDREC (WS-SUB4) TO WS-CARDREC.                  01102000
011030     IF WS-CARDREC IS EQUAL TO SPACES                             01103000
011040         AND WS-DEFAULT-SWITCH IS EQUAL TO 'Y'                    01104000
011050         MOVE WS-DEFAULT-REC TO WS-CARDREC.                       01105000
011060     IF WS-CARDREC IS EQUAL TO SPACES                             01106000
011070         GO TO PC-END.                                            01107000
011080     IF WS-CARDFICHE IS EQUAL TO SPACE                            01108000
011090         MOVE '1' TO WS-CARDFICHE.                                01109000
011100     IF WS-CARDFICHE IS LESS THAN '1'                             01110000
011110         OR WS-CARDFICHE IS GREATER THAN '3'                      01111000
011120         MOVE '1' TO WS-CARDFICHE.                                01112000
011130     IF WS-CARDFORM IS EQUAL TO SPACES                            01113000
011140         MOVE '01' TO WS-CARDFORM.                                01114000
011150     GO TO PC-EXIT.                                               01115000
011160 PC-END.                                                          01116000
011170     MOVE '01' TO WS-CARDFORM.                                    01117000
011180     MOVE '1' TO WS-CARDFICHE.                                    01118000
011190 PC-EXIT.                                                         01119000
011200     EXIT.                                                        01120000
011210******************************************************************01121000
011220 CALENDAR-365 SECTION.                                            01122000
000000 COPY SRP003.                                                     01123000
011240******************************************************************01124000
011250 CONVERT-6-TO-8 SECTION.                                          01125000
000000 COPY SRP011.                                                     01126000
011270******************************************************************01127000
011280 HEADING-ROUTINE SECTION.                                         01128000
000000 COPY SRP016.                                                     01129000
011300***************************************************************** 01130000
011310 PRINTER-ROUTINE SECTION.                                         01131000
000000 COPY SRP017.                                                     01132000
011330***************************************************************** 01133000
011340 ABORT-ROUTINE SECTION.                                           01134000
011350 AR-0001.                                                         01135000
011360     MOVE 01 TO WS-ABCODE.                                        01136000
011370     GO TO AR-MSG.                                                01137000
011380 AR-0002.                                                         01138000
011390     MOVE 02 TO WS-ABCODE.                                        01139000
011400     GO TO AR-MSG.                                                01140000
011410 AR-0003.                                                         01141000
011420     MOVE 03 TO WS-ABCODE.                                        01142000
011430     GO TO AR-MSG.                                                01143000
011440 AR-0004.                                                         01144000
011450     MOVE 04 TO WS-ABCODE.                                        01145000
011460     GO TO AR-MSG.                                                01146000
011470 AR-0005.                                                         01147000
011480     MOVE 05 TO WS-ABCODE.                                        01148000
011490     GO TO AR-MSG.                                                01149000
011500 AR-0006.                                                         01150000
011510     MOVE 06 TO WS-ABCODE.                                        01151000
011520     GO TO AR-MSG.                                                01152000
011530 AR-0007.                                                         01153000
011540     MOVE 07 TO WS-ABCODE.                                        01154000
011550     GO TO AR-MSG.                                                01155000
011560 AR-0008.                                                         01156000
011570     MOVE 08 TO WS-ABCODE.                                        01157000
011580     GO TO AR-MSG.                                                01158000
011590 AR-0009.                                                         01159000
011600     MOVE 09 TO WS-ABCODE.                                        01160000
011610     GO TO AR-MSG.                                                01161000
011620 AR-0010.                                                         01162000
011630     MOVE 10 TO WS-ABCODE.                                        01163000
011640     GO TO AR-MSG.                                                01164000
011650 AR-0011.                                                         01165000
011660     MOVE 11 TO WS-ABCODE.                                        01166000
011670     GO TO AR-MSG.                                                01167000
011680 AR-0012.                                                         01168000
011690     MOVE 12 TO WS-ABCODE.                                        01169000
011700     GO TO AR-MSG.                                                01170000
011710 AR-0013.                                                         01171000
011720     MOVE 13 TO WS-ABCODE.                                        01172000
011730     GO TO AR-MSG.                                                01173000
011740 AR-0014.                                                         01174000
011750     MOVE 14 TO WS-ABCODE.                                        01175000
011760     GO TO AR-MSG.                                                01176000
011770 AR-0015.                                                         01177000
011780     MOVE 15 TO WS-ABCODE.                                        01178000
011790     GO TO AR-MSG.                                                01179000
011800 AR-0016.                                                         01180000
011810     MOVE 16 TO WS-ABCODE.                                        01181000
011820     GO TO AR-MSG.                                                01182000
011830 AR-MSG.                                                          01183000
011840     MOVE WS-FUNCTION TO WS-ABFC.                                 01184000
011850     GO TO ABEND-ROUTINE.                                         01185000
011860******************************************************************01186000
011870 ABEND-ROUTINE SECTION.                                           01187000
011880 AB-PRINT.                                                        01188000
000000 COPY SRP029.                                                     01189000
011900******************************************************************01190000
011910 PARAMETER-SEARCH SECTION.                                        01191000
000000 COPY SRP030.                                                     01192000
011930******************************************************************01193000
011940 PRINT-SEGMENTATION SECTION.                                      01194000
000000 COPY SRP044.                                                     01195000
011960******************************************************************01196000
011970 LEFT-JUSTIFY SECTION.                                            01197000
000000 COPY SRP068.                                                     01198000
011990******************************************************************01199000
