000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPD035.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*                                                                *00005000
000060*    RPD035 - RELATIONSHIP PRICING ONLINE MAINTENANCE EXTRACT    *00006000
000070*                                                                *00007000
000080******************************************************************00008000
000090 ENVIRONMENT DIVISION.                                            00009000
000100 CONFIGURATION SECTION.                                           00010000
000110 SPECIAL-NAMES.                                                   00011000
000120     C01 IS C-01, C02 IS C-02, C03 IS C-03, CSP IS C-SP.          00012000
000130 INPUT-OUTPUT SECTION.                                            00013000
000140 FILE-CONTROL.                                                    00014000
000000 COPY MICARDS.                                                    00015000
000000 COPY PRNTERS.                                                    00016000
000170 DATA DIVISION.                                                   00017000
000180 FILE SECTION.                                                    00018000
000000 COPY MICARDF.                                                    00019000
000200 01  MI-CARDREC.                                                  00020000
000210     03  RPS-SYSNBR              PIC X(02).                       00021000
000220     03  FILLER                  PIC X(01).                       00022000
000230     03  RPS-STARTDATEX.                                          00023000
000240         05  RPS-STARTDATE       PIC 9(08).                       00024000
000250     03  FILLER                  PIC X(01).                       00025000
000260     03  RPS-STARTTIMEX.                                          00026000
000270         05  RPS-STARTTIME       PIC 9(06).                       00027000
000280     03  FILLER                  PIC X(01).                       00028000
000290     03  RPS-ENDDATEX.                                            00029000
000300         05  RPS-ENDDATE         PIC 9(08).                       00030000
000310     03  FILLER                  PIC X(01).                       00031000
000320     03  RPS-ENDTIMEX.                                            00032000
000330         05  RPS-ENDTIME         PIC 9(06).                       00033000
000340     03  FILLER                  PIC X(01).                       00034000
000350     03  RPS-PFC                 PIC X(01).                       00035000
000360     03  RPS-FORM                PIC X(02).                       00036000
000370     03  FILLER                  PIC X(01).                       00037000
000380     03  RPS-INCH                PIC X(01).                       00038000
000390     03  FILLER                  PIC X(01).                       00039000
000400     03  RPS-MNTJRN              PIC X(01).                       00040000
000410     03  FILLER                  PIC X(38).                       00041000
000000 COPY PRNTERF.                                                    00042000
000430 01  PRINTERREC.                                                  00043000
000000 COPY SRW016.                                                     00044000
000450     03  PLINE5          REDEFINES PLINE1.                        00045000
000460         05  P5-LIT              PIC X(10).                       00046000
000470         05  P5-FDATE.                                            00047000
000480             07  P5-FDTMO        PIC 9(02).                       00048000
000490             07  P5-FDSH1        PIC X(01).                       00049000
000500             07  P5-FDTDA        PIC 9(02).                       00050000
000510             07  P5-FDSH2        PIC X(01).                       00051000
000520             07  P5-FDTYR        PIC 9(04).                       00052000
000530         05  FILLER              PIC X(01).                       00053000
000540         05  P5-TIME.                                             00054000
000550             07  P5-FTMHR        PIC 9(02).                       00055000
000560             07  P5-FDOT1        PIC X(01).                       00056000
000570             07  P5-FTMMI        PIC 9(02).                       00057000
000580             07  P5-FDOT2        PIC X(01).                       00058000
000590             07  P5-FTMSC        PIC 9(02).                       00059000
000600         05  FILLER              PIC X(01).                       00060000
000610         05  P5-TDATE.                                            00061000
000620             07  P5-TDTMO        PIC 9(02).                       00062000
000630             07  P5-TDSH1        PIC X(01).                       00063000
000640             07  P5-TDTDA        PIC 9(02).                       00064000
000650             07  P5-TDSH2        PIC X(01).                       00065000
000660             07  P5-TDTYR        PIC 9(04).                       00066000
000670         05  FILLER              PIC X(01).                       00067000
000680         05  P5-TIME.                                             00068000
000690             07  P5-TTMHR        PIC 9(02).                       00069000
000700             07  P5-TDOT1        PIC X(01).                       00070000
000710             07  P5-TTMMI        PIC 9(02).                       00071000
000720             07  P5-TDOT2        PIC X(01).                       00072000
000730             07  P5-TTMSC        PIC 9(02).                       00073000
000740         05  FILLER              PIC X(83).                       00074000
000750******************************************************************00075000
000760 WORKING-STORAGE SECTION.                                         00076000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00077000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00077001
000780 01  WS-WRITE-RPTO               PIC 9(01)       VALUE ZERO.      00078000
000790 01  WS-HOLD-MIHDTS-TIEBR        PIC 9(05)       VALUE ZERO.      00079000
000800 01  WS-HOLD-BREAK-RECKEY.                                        00080000
000810     03  WS-HOLD-MIHDTS-RECKE    PIC X(36)       VALUE SPACE.     00081000
000820     03  FILLER                  PIC X(16)       VALUE SPACE.     00082000
000830 01  WS-COBOLDATE.                                                00083000
000840     03  WS-COBOLYY              PIC X(02).                       00084000
000850     03  WS-COBOLMM              PIC X(02).                       00085000
000860     03  WS-COBOLDD              PIC X(02).                       00086000
000870 01  WS-COBOLDATE-8.                                              00087000
000880     03  WS-COBOLMM8             PIC X(02).                       00088000
000890     03  FILLER                  PIC X(01)       VALUE '/'.       00089000
000900     03  WS-COBOLDD8             PIC X(02).                       00090000
000910     03  FILLER                  PIC X(01)       VALUE '/'.       00091000
000920     03  WS-COBOLYY8             PIC X(02).                       00092000
000930 01  WS-COBOLTIME.                                                00093000
000940     03  WS-COB-HHMMSS.                                           00094000
000950         05  WS-COB-HH           PIC X(02).                       00095000
000960         05  WS-COB-MM           PIC X(02).                       00096000
000970         05  WS-COB-SS           PIC X(02).                       00097000
000980     03  FILLER                  PIC X(02)       VALUE '00'.      00098000
000990 01  RPS-RLSELIT.                                                 00099000
000000 COPY RPWRLSE.                                                    00100000
001010 01  SRW105-AREAS.                                                00101000
000000 COPY SRW105.                                                     00102000
001030*----------------------------------------------------------------*00103000
001040 01  MIWLOGL-AREA.                                                00104000
000000 COPY MIWLOGL.                                                    00105000
001060 01  WS-SUBSCRIPTS.                                               00106000
001070     03  WS-SUB1                 PIC S9(04)      COMP             00107000
001080                                                 VALUE ZERO.      00108000
001090*----------------------------------------------------------------*00109000
001100 01  WS-HEADINGS.                                                 00110000
001110     03  WS-HEAD.                                                 00111000
001120         05 FILLER               PIC X(44)       VALUE            00112000
001130            '            S-DATE   S-TIME    E-DATE    E-T'.       00113000
001140         05 FILLER               PIC X(44)       VALUE            00114000
001150            'IME                                      '.          00115000
001160 01  WS-STORAGE.                                                  00116000
001170     03  WS-UPD-USER             PIC X(08)       VALUE SPACES.    00117000
001180     03  WS-HOLDINST             PIC 9(04)       VALUE ZERO.      00118000
001190     03  WS-RPTOCNT              PIC 9(11)       VALUE ZERO.      00119000
001200     03  WS-RPTCTL.                                               00120000
001210         05  WS-FORM             PIC X(02)       VALUE SPACE.     00121000
001220         05  WS-PFC              PIC 9(01)       VALUE 1.         00122000
001230     03  WS-DATE                 PIC 9(08).                       00123000
001240     03  WS-DATER        REDEFINES WS-DATE.                       00124000
001250         05  WS-TCYR             PIC 9(04).                       00125000
001260         05  WS-TCMON            PIC 9(02).                       00126000
001270         05  WS-TCDAY            PIC 9(02).                       00127000
001280     03  WS-DATEC.                                                00128000
001290         05  WS-DM               PIC 9(02).                       00129000
001300         05  FILLER              PIC X(01).                       00130000
001310         05  WS-DD               PIC 9(02).                       00131000
001320         05  FILLER              PIC X(01).                       00132000
001330         05  WS-DY               PIC 9(02).                       00133000
001340     03  WS-FUNCTION             PIC X(01)       VALUE SPACE.     00134000
001350     03  WS-LASTINST             PIC 9(04)       VALUE ZEROS.     00135000
001360     03  WS-NEWSW                PIC X(01)       VALUE 'N'.       00136000
001370     03  WS-CONTROLDATA.                                          00137000
001380         05  WS-STARTDATEX.                                       00138000
001390             07  WS-STARTDATE                                     00139000
001400                                 PIC S9(09)      COMP-3.          00140000
001410         05  WS-ENDDATEX.                                         00141000
001420             07  WS-ENDDATE      PIC S9(09)      COMP-3.          00142000
001430         05  WS-STARTTIMEX.                                       00143000
001440             07  WS-STARTTIME                                     00144000
001450                                 PIC 9(09).                       00145000
001460         05  WS-ENDTIMEX.                                         00146000
001470             07  WS-ENDTIME      PIC 9(09).                       00147000
001480     03  WS-IMAGE                PIC X(4096).                     00148000
001490     03  WS-MNTJRN               PIC X(01)       VALUE SPACE.     00149000
001500     03  WS-BREAK-TIME.                                           00150000
001510         05  WS-FILLER-1         PIC 9(01).                       00151000
001520         05  WS-UPD-TIME         PIC 9(06).                       00152000
001530         05  WS-FILLER-2         PIC 9(02).                       00153000
001540     03  WS-HDTS-KEY.                                             00154000
001550         05  WS-HDTS-PRODCODE    PIC X(06).                       00155000
001560         05  WS-HDTS-ACCOUNT     PIC X(18).                       00156000
001570         05  WS-HDTS-MODEL       PIC X(10).                       00157000
001580         05  WS-HDTS-DATE        PIC S9(08).                      00158000
001590         05  WS-HDTS-EXTREC      PIC X(03).                       00159000
001600         05  WS-HDTS-TYPMNT      PIC X(01).                       00160000
001610         05  FILLER              PIC X(15)       VALUE SPACE.     00161000
001620     03  WS-MIHDTS-GRP-KEY.                                       00162000
001630         05  WS-MIHDTS-INST      PIC X(04)       VALUE SPACE.     00163000
001640         05  WS-MIHDTS-MANAGER   PIC 9(02)       VALUE ZERO.      00164000
001650         05  WS-MIHDTS-APPLREC   PIC X(03)       VALUE SPACE.     00165000
001660         05  WS-BREAK-RECKEY.                                     00166000
001670             07  WS-MIHDTS-RECKE PIC X(36)       VALUE SPACE.     00167000
001680             07  FILLER          PIC X(16)       VALUE SPACE.     00168000
001690         05  WS-MIHDTS-DATE      PIC 9(08)       VALUE ZERO.      00169000
001700         05  WS-MIHDTS-TIME      PIC 9(06)       VALUE ZERO.      00170000
001710         05  WS-MIHDTS-TIEBR     PIC 9(05)       VALUE ZERO.      00171000
001720         05  WS-BREAK-RECID.                                      00172000
001730             07 WS-MIHDTS-RECID  PIC X(03).                       00173000
001740             07 FILLER           PIC X(01).                       00174000
001750     03  WS-REL-KEY.                                              00175000
001760         05  WS-REL-PRODCODE2    PIC X(06).                       00176000
001770         05  FILLER              PIC X(01)       VALUE ','.       00177000
001780         05  WS-REL-ACCOUNT2     PIC X(18).                       00178000
001790     03  WS-SEC-KEY.                                              00179000
001800         05  WS-SEC-PRODCODE2    PIC X(06).                       00180000
001810         05  FILLER              PIC X(01)       VALUE ','.       00181000
001820         05  WS-SEC-ACCOUNT2     PIC X(18).                       00182000
001830         05  FILLER              PIC X(01)       VALUE ','.       00183000
001840         05  WS-SEC-MODEL2       PIC X(10).                       00184000
001850*01  BICRSRB.                                                     00185000
000000 COPY BICRSRB.                                                    00186000
001870*01  BICPBPRM.                                                    00187000
000000 COPY BICPBPRM.                                                   00188000
001890*01  BICRPSB.                                                     00189000
000000 COPY BICRPSB.                                                    00190000
001910*01  BICRVERB.                                                    00191000
000000 COPY BICRVERB.                                                   00192000
001930*01  BICRSTAT.                                                    00193000
000000 COPY BICRSTAT.                                                   00194000
001950*01  BICRDBS.                                                     00195000
000000 COPY BICRDBS.                                                    00196000
001970 01  RPWACT-AREAS.                                                00197000
000000 COPY RPWACTA.                                                    00198000
001990 01  RPWCRW-AREAS.                                                00199000
000000 COPY RPWCRWA.                                                    00200000
002010 01  RPWIDX-AREAS.                                                00201000
000000 COPY RPWIDXA.                                                    00202000
002030 01  RPWMST-AREAS.                                                00203000
000000 COPY RPWMSTA.                                                    00204000
002050 01  RPWQUA-AREAS.                                                00205000
000000 COPY RPWQUAA.                                                    00206000
002070 01  RPWREL-AREAS.                                                00207000
000000 COPY RPWRELA.                                                    00208000
002090 01  RPWSEC-AREAS.                                                00209000
000000 COPY RPWSECA.                                                    00210000
002110 01  RPWRPTO-AREAS.                                               00211000
000000 COPY RPWRPTO.                                                    00212000
002130 01  MIWHDTS-AREAS.                                               00213000
000000 COPY MIWHDTS.                                                    00214000
002150 01  MI-HDTSREC.                                                  00215000
000000 COPY MISHDTS.                                                    00216000
002170 01  MIWMAST-AREAS.                                               00217000
000000 COPY MIWMAST.                                                    00218000
002190 01  RPRPTO-RECORD.                                               00219000
000000 COPY RPSRPTO.                                                    00220000
002210 01  RPACT-RECORD.                                                00221000
000000 COPY RPSACT.                                                     00222000
002230 01  RPCRW-RECORD.                                                00223000
000000 COPY RPSCRW.                                                     00224000
002250 01  RPIDX-RECORD.                                                00225000
000000 COPY RPSIDX.                                                     00226000
002270 01  RPMST-RECORD.                                                00227000
000000 COPY RPSMST.                                                     00228000
002290 01  RPQUA-RECORD.                                                00229000
000000 COPY RPSQUA.                                                     00230000
002310 01  RPREL-RECORD.                                                00231000
000000 COPY RPSREL.                                                     00232000
002330 01  RPSEC-RECORD.                                                00233000
000000 COPY RPSSEC.                                                     00234000
002350 01  FILLER                      PIC X(08)       VALUE '*SRW000*'.00235000
002360 01  SRW000-AREAS.                                                00236000
000000 COPY SRW000.                                                     00237000
002380 01  FILLER                      PIC X(08)       VALUE '*SRW015*'.00238000
002390 01  SRW015-AREAS.                                                00239000
000000 COPY SRW015.                                                     00240000
002410 01  FILLER                      PIC X(08)       VALUE '*SRW025*'.00241000
002420 01  SRW025-AREAS.                                                00242000
000000 COPY SRW025.                                                     00243000
002440 01  FILLER                      PIC X(08)       VALUE '*SRW028*'.00244000
002450 01  WS-ABEND.                                                    00245000
000000 COPY SRW028.                                                     00246000
002470 01  FILLER                      PIC X(08)       VALUE '*SRW030*'.00247000
002480 01  SRW030-AREAS.                                                00248000
000000 COPY SRW030.                                                     00249000
002500 01  FILLER                      PIC X(08)       VALUE '*SRW031*'.00250000
002510 01  SRW031-AREAS.                                                00251000
000000 COPY SRW031.                                                     00252000
002530 01  FILLER                      PIC X(08)       VALUE '*SRW035*'.00253000
002540 01  SRW035-AREAS.                                                00254000
000000 COPY SRW035.                                                     00255000
002560 01  FILLER                      PIC X(08)       VALUE '*SRW044*'.00256000
002570 01  SRW044-AREAS.                                                00257000
000000 COPY SRW044.                                                     00258000
002590 01  FILLER                      PIC X(08)       VALUE '*SRW045*'.00259000
002600 01  SRW045-AREAS.                                                00260000
000000 COPY SRW045.                                                     00261000
002620 01  FILLER                      PIC X(08)       VALUE '*SRW050*'.00262000
002630 01  SRW050-AREAS.                                                00263000
000000 COPY SRW050.                                                     00264000
002650 01  FILLER                      PIC X(08)       VALUE '*SRW067*'.00265000
002660 01  SRW067-AREAS.                                                00266000
000000 COPY SRW067.                                                     00267000
002680 01  FILLER                      PIC X(08)       VALUE '*SRW161*'.00268000
002690 01  SRW161-AREAS.                                                00269000
000000 COPY SRW161.                                                     00270000
002710******************************************************************00271000
002720 PROCEDURE DIVISION.                                              00272000
002730******************************************************************00273000
002740 MAIN-LOGIC SECTION.                                              00274000
002750 ML-START.                                                        00275000
002760     PERFORM INITIALIZATION.                                      00276000
002770     MOVE 'OSL' TO WS-TRPTO.                                      00277000
002780     PERFORM CALL-RPTOFIL.                                        00278000
002790     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00279000
002800         GO TO AR-0001.                                           00280000
002810 ML-LOOP.                                                         00281000
002820     MOVE SPACES TO WS-FUNCTION.                                  00282000
002830     PERFORM READ-INPUT.                                          00283000
002840     IF MILOGL-EOF IS EQUAL TO 'Y'                                00284000
002850         GO TO END-JOB.                                           00285000
002860     MOVE ZERO TO WS-WRITE-RPTO.                                  00286000
002870     PERFORM REPORT-FILE.                                         00287000
002880     IF WS-MNTJRN IS EQUAL TO 'X'                                 00288000
002890         AND WS-WRITE-RPTO IS EQUAL TO +1                         00289000
002900         PERFORM WRITE-JOURNAL.                                   00290000
002910     GO TO ML-LOOP.                                               00291000
002920 ML-EXIT.                                                         00292000
002930     EXIT.                                                        00293000
002940******************************************************************00294000
002950 INITIALIZATION SECTION.                                          00295000
002960 IN-START.                                                        00296000
002970     PERFORM CALL-PARM-GETTER.                                    00297000
002980     MOVE 'RPD035' TO WS-ABPROGID.                                00298000
002990     MOVE 'RPD035' TO WS-UPD-USER.                                00299000
003000     OPEN INPUT                                                   00300000
003010         MI-CARDFIL                                               00301000
003020         OUTPUT                                                   00302000
003030         PRINTERFIL.                                              00303000
003040     MOVE SR-APIOPENORG TO MILOGL-ORG-ID.                         00304000
003050     MOVE 'SAE0' TO MILOGL-REC-ID.                                00305000
003060     MOVE 'IPRP' TO MILOGL-APPL-ID.                               00306000
003070     MOVE ',' TO MILOGL-DELIM-CHAR.                               00307000
003080     MOVE 'Y' TO MILOGL-PRINT-ADD.                                00308000
003090     MOVE 'Y' TO MILOGL-PRINT-DELETE.                             00309000
003100     MOVE SPACES TO PRINTERREC.                                   00310000
003110     ACCEPT WS-COBOLDATE FROM DATE.                               00311000
003120     MOVE WS-COBOLMM TO WS-COBOLMM8.                              00312000
003130     MOVE WS-COBOLDD TO WS-COBOLDD8.                              00313000
003140     MOVE WS-COBOLYY TO WS-COBOLYY8.                              00314000
003150     MOVE WS-COBOLDATE-8 TO WS-DATEC.                             00315000
003160     MOVE WS-DM TO SR-C6MON.                                      00316000
003170     MOVE WS-DD TO SR-C6DAY.                                      00317000
003180     MOVE WS-DY TO SR-C6YR.                                       00318000
003190     PERFORM CONVERT-6-TO-8.                                      00319000
003200     MOVE SR-TOCAL TO SR-TODAY.                                   00320000
003210     MOVE SPACES TO SR-BKNAME.                                    00321000
003220     MOVE SPACES TO SR-BRNAME.                                    00322000
003230     MOVE SPACES TO PLINE1.                                       00323000
003240     MOVE 'ONLINE MAINTENANCE CONTROL CARD ENTRY' TO SR-REPORT.   00324000
003250     MOVE 'RELATIONSHIP PRICING           ' TO SR-SYSTEM.         00325000
003260     MOVE 50035 TO SR-RPTNBR.                                     00326000
003270     MOVE 0 TO SR-PGCTR.                                          00327000
003280 IN-READ.                                                         00328000
003290     READ MI-CARDFIL                                              00329000
003300         AT END                                                   00330000
003310         GO TO AR-0002.                                           00331000
003320     IF RPS-SYSNBR IS NOT EQUAL TO '50'                           00332000
003330         GO TO AR-0003.                                           00333000
003340     IF RPS-STARTDATEX IS EQUAL TO SPACES                         00334000
003350         MOVE ZEROS TO WS-STARTDATE                               00335000
003360         GO TO IN-ENDDATE.                                        00336000
003370     IF RPS-STARTDATEX IS NOT NUMERIC                             00337000
003380         GO TO AR-0004.                                           00338000
003390     MOVE RPS-STARTDATE TO WS-STARTDATE.                          00339000
003400 IN-ENDDATE.                                                      00340000
003410     IF RPS-ENDDATEX IS EQUAL TO SPACES                           00341000
003420         MOVE 99999999 TO WS-ENDDATE                              00342000
003430         GO TO IN-STARTTIME.                                      00343000
003440     IF RPS-ENDDATEX IS NOT NUMERIC                               00344000
003450         GO TO AR-0005.                                           00345000
003460     MOVE RPS-ENDDATE TO WS-ENDDATE.                              00346000
003470 IN-STARTTIME.                                                    00347000
003480     IF RPS-STARTTIMEX IS EQUAL TO SPACES                         00348000
003490         MOVE ZEROS TO WS-STARTTIME                               00349000
003500         GO TO IN-ENDTIME.                                        00350000
003510     IF RPS-STARTTIMEX IS NOT NUMERIC                             00351000
003520         GO TO AR-0006.                                           00352000
003530     MOVE RPS-STARTTIME TO SR-ETFROMTIME.                         00353000
003540     IF SR-ETFRSECS IS GREATER THAN 59                            00354000
003550         OR SR-ETFRMINS IS GREATER THAN 59                        00355000
003560         OR SR-ETFRHRS IS GREATER THAN 23                         00356000
003570         GO TO AR-0007.                                           00357000
003580     MULTIPLY SR-ETFROMTIME BY 100 GIVING WS-STARTTIME.           00358000
003590 IN-ENDTIME.                                                      00359000
003600     IF RPS-ENDTIMEX IS EQUAL TO SPACES                           00360000
003610         MOVE 24000000 TO WS-ENDTIME                              00361000
003620         GO TO IN-PFC.                                            00362000
003630     IF RPS-ENDTIMEX IS NOT NUMERIC                               00363000
003640         GO TO AR-0008.                                           00364000
003650     MOVE RPS-ENDTIME TO SR-ETFROMTIME.                           00365000
003660     IF SR-ETFRSECS IS GREATER THAN 59                            00366000
003670         OR SR-ETFRMINS IS GREATER THAN 59                        00367000
003680         OR RPS-ENDTIME IS GREATER THAN 240000                    00368000
003690         GO TO AR-0009.                                           00369000
003700     MULTIPLY SR-ETFROMTIME BY 100 GIVING WS-ENDTIME.             00370000
003710 IN-PFC.                                                          00371000
003720     IF RPS-PFC IS EQUAL TO SPACE                                 00372000
003730         MOVE 1 TO RPS-PFC.                                       00373000
003740     IF RPS-PFC IS LESS THAN ZERO                                 00374000
003750         OR RPS-PFC IS GREATER THAN 3                             00375000
003760         GO TO AR-0010.                                           00376000
003770     IF RPS-PFC IS NOT EQUAL TO WS-PFC                            00377000
003780         OR RPS-FORM IS NOT EQUAL TO WS-FORM                      00378000
003790         MOVE RPS-PFC TO WS-PFC                                   00379000
003800         MOVE RPS-FORM TO WS-FORM                                 00380000
003810         MOVE 'RP' TO SRW-APPL                                    00381000
003820         MOVE RPS-FORM TO SRW-FNO                                 00382000
003830         PERFORM PRINT-SEGMENTATION.                              00383000
003840     IF RPS-INCH IS EQUAL TO SPACE                                00384000
003850         MOVE 6 TO RPS-INCH.                                      00385000
003860     IF RPS-INCH IS NOT EQUAL TO 6                                00386000
003870         AND RPS-INCH IS NOT EQUAL TO 8                           00387000
003880         GO TO AR-0011.                                           00388000
003890     IF RPS-INCH IS EQUAL TO 8                                    00389000
003900         MOVE 78 TO SR-PAGE.                                      00390000
003910     IF RPS-MNTJRN IS EQUAL TO 'X'                                00391000
003920         MOVE 'X' TO WS-MNTJRN                                    00392000
003930     ELSE                                                         00393000
003940         MOVE SPACE TO WS-MNTJRN.                                 00394000
003950 IN-SUFFIXDONE.                                                   00395000
003960     CLOSE MI-CARDFIL.                                            00396000
003970 IN-EXIT.                                                         00397000
003980     EXIT.                                                        00398000
003990******************************************************************00399000
004000 READ-INPUT SECTION.                                              00400000
004010 RI-START.                                                        00401000
004020     PERFORM CALL-MIB700.                                         00402000
004030     IF MILOGL-EOF IS EQUAL TO 'Y'                                00403000
004040         GO TO RI-EXIT.                                           00404000
004050     IF MILOGL-ABCODE IS NOT EQUAL TO ZERO                        00405000
004060         GO TO AR-0012.                                           00406000
004070     IF MILOGL-DATE-AUDIT IS LESS THAN WS-STARTDATE               00407000
004080         OR MILOGL-DATE-AUDIT IS GREATER THAN WS-ENDDATE          00408000
004090         GO TO RI-START.                                          00409000
004100     IF MILOGL-DATE-AUDIT IS EQUAL TO WS-STARTDATE                00410000
004110         AND MILOGL-TIME-AUDIT IS LESS THAN WS-STARTTIME          00411000
004120         GO TO RI-START.                                          00412000
004130     IF MILOGL-DATE-AUDIT IS EQUAL TO WS-ENDDATE                  00413000
004140         AND MILOGL-TIME-AUDIT IS GREATER THAN WS-ENDTIME         00414000
004150         GO TO RI-START.                                          00415000
004160     MOVE MILOGL-INST TO WS-HOLDINST.                             00416000
004170 RI-EXIT.                                                         00417000
004180     EXIT.                                                        00418000
004190******************************************************************00419000
004200 PRINT-THE-CARD SECTION.                                          00420000
004210 PTC-START.                                                       00421000
004220     ADD +1 TO SR-PGCTR.                                          00422000
004230     PERFORM HEADING-ROUTINE.                                     00423000
004240     MOVE WS-STARTDATE TO WS-DATE.                                00424000
004250     MOVE WS-TCMON TO P5-FDTMO.                                   00425000
004260     MOVE '-' TO P5-FDSH1.                                        00426000
004270     MOVE WS-TCDAY TO P5-FDTDA.                                   00427000
004280     MOVE '-' TO P5-FDSH2.                                        00428000
004290     MOVE WS-TCYR TO P5-FDTYR.                                    00429000
004300     DIVIDE WS-STARTTIME BY 100 GIVING SR-ETFROMTIME.             00430000
004310     MOVE SR-ETFRHRS TO P5-FTMHR.                                 00431000
004320     MOVE ':' TO P5-FDOT1.                                        00432000
004330     MOVE SR-ETFRMINS TO P5-FTMMI.                                00433000
004340     MOVE ':' TO P5-FDOT2.                                        00434000
004350     MOVE SR-ETFRSECS TO P5-FTMSC.                                00435000
004360     MOVE WS-ENDDATE TO WS-DATE.                                  00436000
004370     MOVE WS-TCMON TO P5-TDTMO.                                   00437000
004380     MOVE '-' TO P5-TDSH1.                                        00438000
004390     MOVE WS-TCDAY TO P5-TDTDA.                                   00439000
004400     MOVE '-' TO P5-TDSH2.                                        00440000
004410     MOVE WS-TCYR TO P5-TDTYR.                                    00441000
004420     DIVIDE WS-ENDTIME BY 100 GIVING SR-ETFROMTIME.               00442000
004430     MOVE SR-ETFRHRS TO P5-TTMHR.                                 00443000
004440     MOVE ':' TO P5-TDOT1.                                        00444000
004450     MOVE SR-ETFRMINS TO P5-TTMMI.                                00445000
004460     MOVE ':' TO P5-TDOT2.                                        00446000
004470     MOVE SR-ETFRSECS TO P5-TTMSC.                                00447000
004480     PERFORM PR-01 THRU PR-EXIT.                                  00448000
004490 PTC-EXIT.                                                        00449000
004500     EXIT.                                                        00450000
004510******************************************************************00451000
004520 REPORT-FILE SECTION.                                             00452000
004530 RF-START.                                                        00453000
004540     MOVE MILOGL-INST TO RPRPTO-INST.                             00454000
004550     MOVE MILOGL-RECID-2-LOG TO RPRPTO-RECID-2-LOG.               00455000
004560     MOVE MILOGL-KEY-LINED TO RPRPTO-KEY-LINED.                   00456000
004570     MOVE MILOGL-DATE-AUDIT TO RPRPTO-DATE-AUDIT.                 00457000
004580     MOVE MILOGL-TIME-AUDIT TO RPRPTO-TIME-AUDIT.                 00458000
004590     MOVE MILOGL-UNIQUE TO RPRPTO-UNIQUE.                         00459000
004600     MOVE MILOGL-AMTT-MISSING TO RPRPTO-AMTT-MISSING.             00460000
004610     MOVE MILOGL-RECNAME TO RPRPTO-RECNAME.                       00461000
004620     MOVE MILOGL-FLDNAME TO RPRPTO-FLDNAME.                       00462000
004630     MOVE MILOGL-NEW-RECORD TO RPRPTO-NEW-RECORD.                 00463000
004640     MOVE MILOGL-ENTRYTYPE TO RPRPTO-ENTRYTYPE.                   00464000
004650     MOVE MILOGL-FUNCTION TO RPRPTO-FUNCTION.                     00465000
004660     MOVE MILOGL-UPD-USER TO RPRPTO-UPD-USER.                     00466000
004670     MOVE MILOGL-OLDED TO RPRPTO-OLDED.                           00467000
004680     MOVE MILOGL-NEWED TO RPRPTO-NEWED.                           00468000
004690     MOVE SPACE TO RPRPTO-PLINE.                                  00469000
004700     IF RPRPTO-FUNCTION IS EQUAL TO 'D'                           00470000
004710         OR RPRPTO-FUNCTION IS EQUAL TO 'M'                       00471000
004720         MOVE MILOGL-BIMAGE TO WS-IMAGE                           00472000
004730     ELSE                                                         00473000
004740         MOVE MILOGL-AIMAGE TO WS-IMAGE.                          00474000
004750 RF-ACT.                                                          00475000
004760     IF RPS-ACT-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00476000
004770         GO TO RF-CRW.                                            00477000
004780     MOVE WS-IMAGE TO RPS-ACT-AFTER.                              00478000
004790     MOVE SPACES TO RPRPTO-APPEND-DATA.                           00479000
004800     MOVE WS-IMAGE TO RPACT-RECORD.                               00480000
004810     MOVE RPACT-PRODCODE TO RPRPTO-PRODCODE.                      00481000
004820     MOVE RPACT-ACCOUNT TO RPRPTO-ACCTNBR.                        00482000
004830     MOVE SPACES TO RPRPTO-MODEL.                                 00483000
004840     MOVE ZERO TO RPRPTO-PRVMNTDT.                                00484000
004850     GO TO RF-WRITE.                                              00485000
004860 RF-CRW.                                                          00486000
004870     IF RPS-CRW-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00487000
004880         GO TO RF-IDX.                                            00488000
004890     MOVE WS-IMAGE TO RPS-CRW-AFTER.                              00489000
004900     MOVE SPACES TO RPRPTO-APPEND-DATA.                           00490000
004910     MOVE WS-IMAGE TO RPCRW-RECORD.                               00491000
004920     MOVE RPCRW-PRODCODE TO RPRPTO-PRODCODE.                      00492000
004930     MOVE RPCRW-ACCOUNT TO RPRPTO-ACCTNBR.                        00493000
004940     MOVE RPCRW-MODEL TO RPRPTO-MODEL.                            00494000
004950     MOVE ZERO TO RPRPTO-PRVMNTDT.                                00495000
004960     GO TO RF-WRITE.                                              00496000
004970 RF-IDX.                                                          00497000
004980     IF RPS-IDX-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00498000
004990         GO TO RF-MST.                                            00499000
005000     MOVE WS-IMAGE TO RPS-IDX-AFTER.                              00500000
005010     MOVE SPACES TO RPRPTO-APPEND-DATA.                           00501000
005020     MOVE WS-IMAGE TO RPIDX-RECORD.                               00502000
005030     MOVE RPIDX-PRODCODE TO RPRPTO-PRODCODE.                      00503000
005040     MOVE RPIDX-IDNUMBER TO RPRPTO-ACCTNBR.                       00504000
005050     MOVE SPACE TO RPRPTO-MODEL.                                  00505000
005060     MOVE ZERO TO RPRPTO-PRVMNTDT.                                00506000
005070     GO TO RF-WRITE.                                              00507000
005080 RF-MST.                                                          00508000
005090     IF RPS-MST-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00509000
005100         GO TO RF-QUA.                                            00510000
005110     MOVE WS-IMAGE TO RPS-MST-AFTER.                              00511000
005120     MOVE SPACES TO RPRPTO-APPEND-DATA.                           00512000
005130     MOVE WS-IMAGE TO RPMST-RECORD.                               00513000
005140     MOVE RPMST-PRODCODE TO RPRPTO-PRODCODE.                      00514000
005150     MOVE RPMST-ACCOUNT TO RPRPTO-ACCTNBR.                        00515000
005160     MOVE RPMST-MODEL TO RPRPTO-MODEL.                            00516000
005170     IF RPMST-LMNTDT IS NOT NUMERIC                               00517000
005180         MOVE ZERO TO RPRPTO-PRVMNTDT                             00518000
005190     ELSE                                                         00519000
005200         MOVE RPMST-LMNTDT TO RPRPTO-PRVMNTDT.                    00520000
005210     GO TO RF-WRITE.                                              00521000
005220 RF-QUA.                                                          00522000
005230     IF RPS-QUA-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00523000
005240         GO TO RF-REL.                                            00524000
005250     MOVE WS-IMAGE TO RPS-QUA-AFTER.                              00525000
005260     MOVE SPACES TO RPRPTO-APPEND-DATA.                           00526000
005270     MOVE WS-IMAGE TO RPQUA-RECORD.                               00527000
005280     MOVE RPQUA-PRODCODE TO RPRPTO-PRODCODE.                      00528000
005290     MOVE RPQUA-ACCOUNT TO RPRPTO-ACCTNBR.                        00529000
005300     MOVE RPQUA-MODEL TO RPRPTO-MODEL.                            00530000
005310     MOVE ZERO TO RPRPTO-PRVMNTDT.                                00531000
005320     GO TO RF-WRITE.                                              00532000
005330 RF-REL.                                                          00533000
005340     IF RPS-REL-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00534000
005350         GO TO RF-SEC.                                            00535000
005360     MOVE WS-IMAGE TO RPS-REL-AFTER.                              00536000
005370     MOVE SPACES TO RPRPTO-APPEND-DATA.                           00537000
005380     MOVE WS-IMAGE TO RPREL-RECORD.                               00538000
005390     MOVE RPREL-PRODCODE TO RPRPTO-PRODCODE.                      00539000
005400     MOVE RPREL-ACCOUNT TO RPRPTO-ACCTNBR.                        00540000
005410     MOVE RPREL-MODEL TO RPRPTO-MODEL.                            00541000
005420     MOVE ZERO TO RPRPTO-PRVMNTDT.                                00542000
005430     GO TO RF-WRITE.                                              00543000
005440 RF-SEC.                                                          00544000
005450     IF RPS-SEC-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00545000
005460         MOVE SPACES TO RPRPTO-PRODCODE                           00546000
005470         MOVE SPACES TO RPRPTO-ACCTNBR                            00547000
005480         MOVE SPACES TO RPRPTO-MODEL                              00548000
005490         MOVE SPACE TO RPRPTO-ADES                                00549000
005500         MOVE ZERO TO RPRPTO-PRVMNTDT                             00550000
005510         GO TO RF-WRITE.                                          00551000
005520     MOVE WS-IMAGE TO RPS-SEC-AFTER.                              00552000
005530     MOVE SPACES TO RPRPTO-APPEND-DATA.                           00553000
005540     MOVE WS-IMAGE TO RPSEC-RECORD.                               00554000
005550     MOVE RPSEC-PRODCODE TO RPRPTO-PRODCODE.                      00555000
005560     MOVE RPSEC-ACCOUNT TO RPRPTO-ACCTNBR.                        00556000
005570     MOVE RPSEC-MODEL2 TO RPRPTO-MODEL.                           00557000
005580     MOVE ZERO TO RPRPTO-PRVMNTDT.                                00558000
005590     GO TO RF-WRITE.                                              00559000
005600 RF-WRITE.                                                        00560000
005610     IF RPRPTO-ADES IS EQUAL TO '9'                               00561000
005620         GO TO RF-EXIT.                                           00562000
005630     IF RPRPTO-AMTT-MISSING IS EQUAL TO 'Y'                       00563000
005640         PERFORM WRITE-REPORTO                                    00564000
005650         GO TO RF-EXIT.                                           00565000
005660     IF MILOGL-FUNCTION IS EQUAL TO 'M'                           00566000
005670         GO TO RF-MAINTENANCE.                                    00567000
005680 RF-FORMATED-NEW-DELETE.                                          00568000
005690     MOVE ZERO TO WS-SUB1.                                        00569000
005700 RF-LOOP.                                                         00570000
005710     ADD 1 TO WS-SUB1.                                            00571000
005720     IF MILOGL-NBRPLINES IS EQUAL TO ZERO                         00572000
005730         PERFORM WRITE-REPORTO                                    00573000
005740         GO TO RF-EXIT.                                           00574000
005750     IF WS-SUB1 IS EQUAL TO +0001                                 00575000
005760         MOVE MILOGL-PLINE (WS-SUB1) TO RPRPTO-PLINE              00576000
005770         PERFORM WRITE-REPORTO                                    00577000
005780         MOVE 'N' TO RPRPTO-NEW-RECORD                            00578000
005790         GO TO RF-LOOP.                                           00579000
005800     IF WS-SUB1 IS GREATER THAN MILOGL-NBRPLINES                  00580000
005810         GO TO RF-EXIT.                                           00581000
005820     IF MILOGL-PLINE (WS-SUB1) IS EQUAL TO SPACES                 00582000
005830         GO TO RF-LOOP.                                           00583000
005840     MOVE MILOGL-PLINE (WS-SUB1) TO RPRPTO-PLINE.                 00584000
005850     PERFORM WRITE-REPORTO.                                       00585000
005860     GO TO RF-LOOP.                                               00586000
005870 RF-MAINTENANCE.                                                  00587000
005880     IF MILOGL-NEW-RECORD IS EQUAL TO 'Y'                         00588000
005890         AND MILOGL-ENTRYTYPE IS NOT EQUAL TO 'N'                 00589000
005900         MOVE 'Y' TO WS-NEWSW                                     00590000
005910         GO TO RF-EXIT.                                           00591000
005920     IF MILOGL-ENTRYTYPE IS NOT EQUAL TO 'N'                      00592000
005930         GO TO RF-EXIT.                                           00593000
005940     IF WS-NEWSW IS EQUAL TO 'Y'                                  00594000
005950         MOVE 'Y' TO RPRPTO-NEW-RECORD.                           00595000
005960     PERFORM WRITE-REPORTO.                                       00596000
005970     MOVE 'N' TO WS-NEWSW.                                        00597000
005980 RF-EXIT.                                                         00598000
005990     EXIT.                                                        00599000
006000***************************************************************** 00600000
006010 WRITE-REPORTO SECTION.                                           00601000
006020 WR-START.                                                        00602000
006030     MOVE +1 TO WS-WRITE-RPTO.                                    00603000
006040     MOVE 'ASL' TO WS-TRPTO.                                      00604000
006050     PERFORM CALL-RPTOFIL.                                        00605000
006060     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00606000
006070         GO TO AR-0013.                                           00607000
006080     ADD +0001 TO WS-RPTOCNT.                                     00608000
006090 WR-EXIT.                                                         00609000
006100     EXIT.                                                        00610000
006110***************************************************************** 00611000
006120 CALL-RPTOFIL SECTION.                                            00612000
006130 CRO-START.                                                       00613000
006140     PERFORM CALL-RPRPTO.                                         00614000
006150     MOVE WS-FUNCTION TO WS-ABFC.                                 00615000
006160 CRO-EXIT.                                                        00616000
006170     EXIT.                                                        00617000
006180***************************************************************** 00618000
006190 CALL-RPRPTO SECTION.                                             00619000
000000 COPY RPPRPTO.                                                    00620000
006210***************************************************************** 00621000
006220 CONVERT-6-TO-8 SECTION.                                          00622000
000000 COPY SRP011.                                                     00623000
006240***************************************************************** 00624000
006250 HEADING-ROUTINE SECTION.                                         00625000
000000 COPY SRP016.                                                     00626000
006270 HR-DETAIL.                                                       00627000
006280     MOVE WS-HEAD TO PLINE1.                                      00628000
006290     PERFORM PR-02 THRU PR-EXIT.                                  00629000
006300 HR-DEXIT.                                                        00630000
006310     EXIT.                                                        00631000
006320***************************************************************** 00632000
006330 PRINTER-ROUTINE SECTION.                                         00633000
000000 COPY SRP017.                                                     00634000
006350******************************************************************00635000
006360 PARAMETER-SEARCH SECTION.                                        00636000
000000 COPY SRP030.                                                     00637000
006380******************************************************************00638000
006390 PRINT-SEGMENTATION SECTION.                                      00639000
000000 COPY SRP044.                                                     00640000
006410***************************************************************** 00641000
006420 RIGHT-JUSTIFY SECTION.                                           00642000
000000 COPY SRP067.                                                     00643000
006440***************************************************************** 00644000
006450 CALL-PARM-GETTER SECTION.                                        00645000
006460 CPGET-START.                                                     00646000
000000     CALL 'BIRPBPRM' USING                                        00647000
006480         BICPBPRM.                                                00648000
006490     IF BPRM-NUM-ORGS IS NOT EQUAL TO +0                          00649000
006500         MOVE BPRM-ORG (1) TO SR-APIOPENORG                       00650000
006510     ELSE                                                         00651000
006520         MOVE ZEROS TO SR-APIOPENORG.                             00652000
006530 CPGET-EXIT.                                                      00653000
006540     EXIT.                                                        00654000
006550***************************************************************** 00655000
006560 WRITE-JOURNAL SECTION.                                           00656000
006570 WJ-START.                                                        00657000
006580     MOVE RPRPTO-INST TO MIHDTS-INST.                             00658000
006590     MOVE 50 TO MIHDTS-MANAGER.                                   00659000
006600     MOVE ZERO TO SR-PSSUB1.                                      00660000
006610     MOVE +0001 TO SR-PSSUB2.                                     00661000
006620     MOVE RPRPTO-KEY-LINED TO SR-PSLIST.                          00662000
006630     PERFORM PARAMETER-SEARCH.                                    00663000
006640     PERFORM PARAMETER-SEARCH.                                    00664000
006650 WJ-ACT.                                                          00665000
006660     IF RPS-ACT-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00666000
006670         GO TO WJ-IDX.                                            00667000
006680     MOVE 'ACT' TO WS-HDTS-EXTREC.                                00668000
006690     MOVE 'RPS' TO MIHDTS-APPLREC.                                00669000
006700     MOVE SR-PSPARM TO WS-HDTS-PRODCODE.                          00670000
006710     PERFORM PARAMETER-SEARCH.                                    00671000
006720     MOVE SR-PSPARM TO WS-HDTS-ACCOUNT.                           00672000
006730     MOVE SPACE TO WS-HDTS-MODEL.                                 00673000
006740     MOVE SPACE TO MIHDTS-2NDKEY.                                 00674000
006750     GO TO WJ-FUNCTION.                                           00675000
006760 WJ-IDX.                                                          00676000
006770     IF RPS-IDX-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00677000
006780         GO TO WJ-MST.                                            00678000
006790     MOVE 'IDX' TO WS-HDTS-EXTREC.                                00679000
006800     MOVE 'RPS' TO MIHDTS-APPLREC.                                00680000
006810     MOVE SR-PSPARM TO WS-HDTS-PRODCODE.                          00681000
006820     PERFORM PARAMETER-SEARCH.                                    00682000
006830     MOVE SR-PSPARM TO WS-HDTS-ACCOUNT.                           00683000
006840     MOVE SPACE TO WS-HDTS-MODEL.                                 00684000
006850     MOVE SPACE TO MIHDTS-2NDKEY.                                 00685000
006860     GO TO WJ-FUNCTION.                                           00686000
006870 WJ-MST.                                                          00687000
006880     IF RPS-MST-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00688000
006890         GO TO WJ-QUA.                                            00689000
006900     MOVE 'MST' TO WS-HDTS-EXTREC.                                00690000
006910     MOVE 'RPS' TO MIHDTS-APPLREC.                                00691000
006920     MOVE SR-PSPARM TO WS-HDTS-PRODCODE.                          00692000
006930     PERFORM PARAMETER-SEARCH.                                    00693000
006940     MOVE SR-PSPARM TO WS-HDTS-ACCOUNT.                           00694000
006950     PERFORM PARAMETER-SEARCH.                                    00695000
006960     MOVE SR-PSPARM TO WS-HDTS-MODEL.                             00696000
006970     MOVE SPACE TO MIHDTS-2NDKEY.                                 00697000
006980     GO TO WJ-FUNCTION.                                           00698000
006990 WJ-QUA.                                                          00699000
007000     IF RPS-QUA-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00700000
007010         GO TO WJ-REL.                                            00701000
007020     MOVE 'QUA' TO WS-HDTS-EXTREC.                                00702000
007030     MOVE 'RPS' TO MIHDTS-APPLREC.                                00703000
007040     MOVE SR-PSPARM TO WS-HDTS-PRODCODE.                          00704000
007050     PERFORM PARAMETER-SEARCH.                                    00705000
007060     MOVE SR-PSPARM TO WS-HDTS-ACCOUNT.                           00706000
007070     PERFORM PARAMETER-SEARCH.                                    00707000
007080     MOVE SR-PSPARM TO WS-HDTS-MODEL.                             00708000
007090     MOVE SPACE TO MIHDTS-2NDKEY.                                 00709000
007100 WJ-REL.                                                          00710000
007110     IF RPS-REL-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00711000
007120         GO TO WJ-SEC.                                            00712000
007130     MOVE 'REL' TO WS-HDTS-EXTREC.                                00713000
007140     MOVE 'RPS' TO MIHDTS-APPLREC.                                00714000
007150     MOVE SR-PSPARM TO WS-HDTS-PRODCODE.                          00715000
007160     PERFORM PARAMETER-SEARCH.                                    00716000
007170     MOVE SR-PSPARM TO WS-HDTS-ACCOUNT.                           00717000
007180     PERFORM PARAMETER-SEARCH.                                    00718000
007190     MOVE SR-PSPARM TO WS-HDTS-MODEL.                             00719000
007200     PERFORM PARAMETER-SEARCH.                                    00720000
007210     PERFORM PARAMETER-SEARCH.                                    00721000
007220     MOVE SR-PSPARM TO WS-REL-PRODCODE2.                          00722000
007230     PERFORM PARAMETER-SEARCH.                                    00723000
007240     MOVE SR-PSPARM TO WS-REL-ACCOUNT2.                           00724000
P0133      IF WS-REL-PRODCODE2 IS EQUAL TO SPACES                       00725000
P0133          MOVE SPACES TO MIHDTS-2NDKEY                             00725190
P0133      ELSE                                                         00725380
P0133          MOVE WS-REL-KEY TO MIHDTS-2NDKEY.                        00725570
007260     GO TO WJ-FUNCTION.                                           00726000
007270 WJ-SEC.                                                          00727000
007280     IF RPS-SEC-REC-PRI IS NOT EQUAL TO RPRPTO-RECID-2-LOG        00728000
007290         GO TO WJ-EXIT.                                           00729000
007300     MOVE 'SEC' TO WS-HDTS-EXTREC.                                00730000
007310     MOVE 'RPS' TO MIHDTS-APPLREC.                                00731000
007320     MOVE SR-PSPARM TO WS-HDTS-PRODCODE.                          00732000
007330     PERFORM PARAMETER-SEARCH.                                    00733000
007340     MOVE SR-PSPARM TO WS-HDTS-ACCOUNT.                           00734000
007350     PERFORM PARAMETER-SEARCH.                                    00735000
007360     PERFORM PARAMETER-SEARCH.                                    00736000
007370     MOVE SR-PSPARM TO WS-SEC-PRODCODE2.                          00737000
007380     PERFORM PARAMETER-SEARCH.                                    00738000
007390     MOVE SR-PSPARM TO WS-SEC-ACCOUNT2.                           00739000
007400     PERFORM PARAMETER-SEARCH.                                    00740000
007410     MOVE SR-PSPARM TO WS-SEC-MODEL2.                             00741000
P0133      IF WS-SEC-PRODCODE2 IS EQUAL TO SPACES                       00742000
P0133          MOVE SPACES TO MIHDTS-2NDKEY                             00742190
P0133      ELSE                                                         00742380
P0133          MOVE WS-SEC-KEY TO MIHDTS-2NDKEY.                        00742570
007430     GO TO WJ-FUNCTION.                                           00743000
007440 WJ-FUNCTION.                                                     00744000
007450     MOVE MILOGL-FLDNBR TO MIHDTS-FLDNBR.                         00745000
007460     MOVE 50 TO MIHDTS-APPLCD.                                    00746000
007470     MOVE RPRPTO-UPD-USER TO MIHDTS-OPERID.                       00747000
007480     MOVE RPRPTO-DATE-AUDIT TO MIHDTS-DATE.                       00748000
007490     MOVE RPRPTO-TIME-AUDIT TO WS-BREAK-TIME.                     00749000
007500     MOVE WS-UPD-TIME TO MIHDTS-TIME.                             00750000
007510     MOVE ZERO TO MIHDTS-TIEBR.                                   00751000
007520     MOVE RPRPTO-FUNCTION TO MIHDTS-TYPE.                         00752000
007530     MOVE RPRPTO-FUNCTION TO WS-HDTS-TYPMNT.                      00753000
007540     IF RPRPTO-FUNCTION IS EQUAL TO 'A'                           00754000
007550         MOVE 'ADDED  ' TO MIHDTS-FLDNAME                         00755000
007560         MOVE SPACE TO MIHDTS-BEFORE                              00756000
007570         MOVE SPACE TO MIHDTS-AFTER.                              00757000
007580     IF RPRPTO-FUNCTION IS EQUAL TO 'D'                           00758000
007590         MOVE 'DELETED' TO MIHDTS-FLDNAME                         00759000
007600         MOVE SPACE TO MIHDTS-BEFORE                              00760000
007610         MOVE SPACE TO MIHDTS-AFTER.                              00761000
007620     IF RPRPTO-FUNCTION IS EQUAL TO 'M'                           00762000
007630         MOVE RPRPTO-FLDNAME TO MIHDTS-FLDNAME                    00763000
007640         MOVE RPRPTO-OLDED TO MIHDTS-BEFORE                       00764000
007650         MOVE RPRPTO-NEWED TO MIHDTS-AFTER.                       00765000
007660     MOVE WS-HDTS-EXTREC TO MIHDTS-RECID.                         00766000
007670     MOVE RPRPTO-RECID-2-LOG TO MIHDTS-RECCD.                     00767000
007680     MOVE MIHDTS-DATE TO WS-HDTS-DATE.                            00768000
007690     SUBTRACT 99999999 FROM WS-HDTS-DATE.                         00769000
007700     MOVE WS-HDTS-KEY TO MIHDTS-RECKEY.                           00770000
007710     MOVE MIHDTS-RECKEY TO WS-HOLD-BREAK-RECKEY.                  00771000
007720     IF WS-MIHDTS-RECKE IS EQUAL TO WS-HOLD-MIHDTS-RECKE          00772000
007730         AND WS-MIHDTS-INST IS EQUAL TO MIHDTS-INST               00773000
007740         AND WS-MIHDTS-MANAGER IS EQUAL TO MIHDTS-MANAGER         00774000
007750         AND WS-MIHDTS-APPLREC IS EQUAL TO MIHDTS-APPLREC         00775000
007760         AND WS-MIHDTS-DATE IS EQUAL TO MIHDTS-DATE               00776000
007770         ADD +1 TO WS-HOLD-MIHDTS-TIEBR                           00777000
007780         MOVE WS-HOLD-MIHDTS-TIEBR TO MIHDTS-TIEBR                00778000
007790     ELSE                                                         00779000
007800         MOVE ZERO TO WS-HOLD-MIHDTS-TIEBR.                       00780000
007810     MOVE MIHDTS-GRP-KEY TO WS-MIHDTS-GRP-KEY.                    00781000
007820     MOVE 'ASE' TO WS-MIHDTS.                                     00782000
007830     PERFORM CALL-MIHDTS.                                         00783000
007840     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00784000
007850         GO TO AR-0014.                                           00785000
007860 WJ-EXIT.                                                         00786000
007870     EXIT.                                                        00787000
007880***************************************************************** 00788000
007890 ABORT-ROUTINE SECTION.                                           00789000
007900 AR-0001.                                                         00790000
007910     MOVE 0001 TO WS-ABCODE.                                      00791000
007920     GO TO AR-PRINT.                                              00792000
007930 AR-0002.                                                         00793000
007940     MOVE 0002 TO WS-ABCODE.                                      00794000
007950     GO TO AR-PRINT.                                              00795000
007960 AR-0003.                                                         00796000
007970     MOVE 0003 TO WS-ABCODE.                                      00797000
007980     GO TO AR-PRINT.                                              00798000
007990 AR-0004.                                                         00799000
008000     MOVE 0004 TO WS-ABCODE.                                      00800000
008010     GO TO AR-PRINT.                                              00801000
008020 AR-0005.                                                         00802000
008030     MOVE 0005 TO WS-ABCODE.                                      00803000
008040     GO TO AR-PRINT.                                              00804000
008050 AR-0006.                                                         00805000
008060     MOVE 0006 TO WS-ABCODE.                                      00806000
008070     GO TO AR-PRINT.                                              00807000
008080 AR-0007.                                                         00808000
008090     MOVE 0007 TO WS-ABCODE.                                      00809000
008100     GO TO AR-PRINT.                                              00810000
008110 AR-0008.                                                         00811000
008120     MOVE 0008 TO WS-ABCODE.                                      00812000
008130     GO TO AR-PRINT.                                              00813000
008140 AR-0009.                                                         00814000
008150     MOVE 0009 TO WS-ABCODE.                                      00815000
008160     GO TO AR-PRINT.                                              00816000
008170 AR-0010.                                                         00817000
008180     MOVE 0010 TO WS-ABCODE.                                      00818000
008190     GO TO AR-PRINT.                                              00819000
008200 AR-0011.                                                         00820000
008210     MOVE 0011 TO WS-ABCODE.                                      00821000
008220     GO TO AR-PRINT.                                              00822000
008230 AR-0012.                                                         00823000
008240     MOVE 0012 TO WS-ABCODE.                                      00824000
008250     GO TO AR-PRINT.                                              00825000
008260 AR-0013.                                                         00826000
008270     MOVE 0013 TO WS-ABCODE.                                      00827000
008280     GO TO AR-PRINT.                                              00828000
008290 AR-0014.                                                         00829000
008300     MOVE 0014 TO WS-ABCODE.                                      00830000
008310     GO TO AR-PRINT.                                              00831000
008320 AR-0015.                                                         00832000
008330     MOVE 0015 TO WS-ABCODE.                                      00833000
008340     GO TO AR-PRINT.                                              00834000
008350 AR-0016.                                                         00835000
008360     MOVE 0016 TO WS-ABCODE.                                      00836000
008370     GO TO AR-PRINT.                                              00837000
008380 AR-PRINT.                                                        00838000
008390     MOVE WS-FUNCTION TO WS-ABFC.                                 00839000
008400 AR-EXIT.                                                         00840000
000000 COPY SRP028.                                                     00841000
008420******************************************************************00842000
008430 CALL-MIHDTS SECTION.                                             00843000
000000 COPY MIPHDTS.                                                    00844000
008450******************************************************************00845000
008460 CALL-MIB700 SECTION.                                             00846000
008470 CM-START.                                                        00847000
000000     CALL 'MIB700' USING                                          00848000
008490         MIWLOGL-AREA.                                            00849000
008500 CM-EXIT.                                                         00850000
008510     EXIT.                                                        00851000
008520******************************************************************00852000
008530 END-JOB SECTION.                                                 00853000
008540 EJ-START.                                                        00854000
008550     MOVE 'Y' TO MILOGL-GLOBAL-CLOSE.                             00855000
008560     MOVE 'Y' TO MILOGL-END.                                      00856000
008570     PERFORM CALL-MIB700.                                         00857000
008580     PERFORM PRINT-THE-CARD.                                      00858000
000000 COPY SRP027.                                                     00859000
008600     CLOSE PRINTERFIL.                                            00860000
008610     MOVE 'C  ' TO WS-TRPTO.                                      00861000
008620     PERFORM CALL-RPTOFIL.                                        00862000
008630     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00863000
008640         GO TO AR-0015.                                           00864000
008650     IF WS-MNTJRN IS EQUAL TO 'X'                                 00865000
008660         MOVE 'C' TO WS-MIHDTS1                                   00866000
008670         PERFORM CALL-MIHDTS.                                     00867000
008680     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00868000
008690         GO TO AR-0016.                                           00869000
008700     STOP RUN.                                                    00870000
008710 EJ-EXIT.                                                         00871000
008720     EXIT.                                                        00872000
008730******************************************************************00873000
