000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPD015.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*                                                                *00005000
000060*    RPD015 -  RELATIONSHIP PRICING                              *00006000
000070*              REPORTS FILE INITIALIZTION                        *00007000
000080*                                                                *00008000
000090******************************************************************00009000
000100 ENVIRONMENT DIVISION.                                            00010000
000110 CONFIGURATION SECTION.                                           00011000
000120 SPECIAL-NAMES.                                                   00012000
000130     C01 IS C-01, C02 IS C-02, C03 IS C-03.                       00013000
000140 INPUT-OUTPUT SECTION.                                            00014000
000150 FILE-CONTROL.                                                    00015000
000160 DATA DIVISION.                                                   00016000
000170 FILE SECTION.                                                    00017000
000180 WORKING-STORAGE SECTION.                                         00018000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00019000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00019001
000200 01  RPS-RLSELIT.                                                 00020000
000000 COPY RPWRLSE.                                                    00021000
000220 01  MIWPRI-AREAS.                                                00022000
000000 COPY MIWPRI.                                                     00023000
000240 01  RPWPRI-AREAS.                                                00024000
000000 COPY RPWPRI.                                                     00025000
000260 01  MIWMSTA-AREAS.                                               00026000
000000 COPY MIWMSTA.                                                    00027000
000280 01  SRW105-AREAS.                                                00028000
000000 COPY SRW105.                                                     00029000
000300*01  BICPBPRM.                                                    00030000
000000 COPY BICPBPRM.                                                   00031000
000320*01  BICRSRB.                                                     00032000
000000 COPY BICRSRB.                                                    00033000
000340*01  BICRPSB.                                                     00034000
000000 COPY BICRPSB.                                                    00035000
000360*01  BICRVERB.                                                    00036000
000000 COPY BICRVERB.                                                   00037000
000380*01  BICRSTAT.                                                    00038000
000000 COPY BICRSTAT.                                                   00039000
000400*01  BICRDBS.                                                     00040000
000000 COPY BICRDBS.                                                    00041000
000420 01  RPRPTS-RECORD.                                               00042000
000000 COPY RPSRPTS.                                                    00043000
000440 01  RPWRPTS-AREAS.                                               00044000
000000 COPY RPWRPTS.                                                    00045000
000460 01  WS-ABEND.                                                    00046000
000000 COPY SRW028.                                                     00047000
000480 01  WS-STORAGE.                                                  00048000
000490     03  WS-FUNCTION             PIC X(01)       VALUE SPACE.     00049000
000500     03  WS-SUB                  PIC 9(04)       COMP.            00050000
000000 COPY RPWSEG.                                                     00051000
000520 PROCEDURE DIVISION.                                              00052000
000530***************************************************************** 00053000
000540 INITIALIZATION SECTION.                                          00054000
000550 IN-START.                                                        00055000
000560     PERFORM GET-FILE-ORGANIZATION.                               00056000
000570     PERFORM CALL-SEGID.                                          00057000
000580     IF RPWSEG-SEGRETURN IS EQUAL TO 'X'                          00058000
000590         GO TO AR-0003.                                           00059000
000600     MOVE 'RPD015' TO SR-APIPROGLIT.                              00060000
000610     MOVE 'RPD015' TO WS-ABPROGID.                                00061000
000620     PERFORM FORMAT-REPORT.                                       00062000
000630 IN-END.                                                          00063000
000640     STOP RUN.                                                    00064000
000650 IN-EXIT.                                                         00065000
000660     EXIT.                                                        00066000
000670***************************************************************** 00067000
000680 FORMAT-REPORT SECTION.                                           00068000
000690 FRP-START.                                                       00069000
000700     MOVE +1 TO WS-SUB.                                           00070000
000710 FRP-SEG-LOOP.                                                    00071000
000720     MOVE RPWSEG-ORGID (WS-SUB) TO WS-RRPTS-ORGID.                00072000
000730     MOVE 'OSL' TO WS-RRPTS.                                      00073000
000740     PERFORM CALL-RPTSFIL.                                        00074000
000750     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00075000
000760         GO TO AR-0001.                                           00076000
000770     MOVE 'C  ' TO WS-RRPTS.                                      00077000
000780     MOVE RPWSEG-ORGID (WS-SUB) TO WS-RRPTS-ORGID.                00078000
000790     PERFORM CALL-RPTSFIL.                                        00079000
000800     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00080000
000810         GO TO AR-0002.                                           00081000
000820     ADD 1 TO WS-SUB.                                             00082000
000830     IF WS-SUB IS GREATER THAN 35                                 00083000
000840         GO TO FRP-EXIT.                                          00084000
000850     IF RPWSEG-ORGID (WS-SUB) IS NOT EQUAL TO HIGH-VALUE          00085000
000860         GO TO FRP-SEG-LOOP.                                      00086000
000870 FRP-EXIT.                                                        00087000
000880     EXIT.                                                        00088000
000890***************************************************************** 00089000
000900 CALL-RPTSFIL SECTION.                                            00090000
000910 CR-START.                                                        00091000
000920     PERFORM CALL-RPRPTS.                                         00092000
000930     MOVE WS-FUNCTION TO WS-ABFC.                                 00093000
000940 CR-EXIT.                                                         00094000
000950     EXIT.                                                        00095000
000960***************************************************************** 00096000
000970 GET-FILE-ORGANIZATION SECTION.                                   00097000
000000 COPY SRP093.                                                     00098000
000990***************************************************************** 00099000
001000 CALL-RPRPTS SECTION.                                             00100000
000000 COPY RPPRPTS.                                                    00101000
001020***************************************************************** 00102000
001030 CALL-SEGID SECTION.                                              00103000
001040 CS-START.                                                        00104000
001050     MOVE MIC-MST-APPL-ORG TO RPWSEG-SEGID.                       00105000
000000     CALL 'RPSEGID' USING                                         00106000
001070         RPWSEG-SEGFIELDS.                                        00107000
001080 CS-EXIT.                                                         00108000
001090     EXIT.                                                        00109000
001100***************************************************************** 00110000
001110 ABORT-ROUTINE SECTION.                                           00111000
001120 AR-0001.                                                         00112000
001130     MOVE 01 TO WS-ABCODE.                                        00113000
001140     GO TO AR-MSG.                                                00114000
001150 AR-0002.                                                         00115000
001160     MOVE 02 TO WS-ABCODE.                                        00116000
001170     GO TO AR-MSG.                                                00117000
001180 AR-0003.                                                         00118000
001190     MOVE 03 TO WS-ABCODE.                                        00119000
001200     GO TO AR-MSG.                                                00120000
001210 AR-MSG.                                                          00121000
001220     GO TO ABEND-ROUTINE.                                         00122000
001230***************************************************************** 00123000
001240 ABEND-ROUTINE SECTION.                                           00124000
001250 AR-START.                                                        00125000
000000 COPY SRP029.                                                     00126000
