000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPD252.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*                                                                *00005000
000060*    RPD252 - UPDATE TRANSACTION ACCUMULATORS                    *00006000
000070*                                                                *00007000
000080******************************************************************00008000
000090 ENVIRONMENT DIVISION.                                            00009000
000100 CONFIGURATION SECTION.                                           00010000
000110 SPECIAL-NAMES.                                                   00011000
000120     C01 IS C-01, C02 IS C-02, C03 IS C-03.                       00012000
000130 INPUT-OUTPUT SECTION.                                            00013000
000140 FILE-CONTROL.                                                    00014000
000000 COPY RPTRNW2S.                                                   00015000
000000 COPY RPCARDS.                                                    00016000
000000 COPY PRNTERS.                                                    00017000
000180 DATA DIVISION.                                                   00018000
000190 FILE SECTION.                                                    00019000
000000 COPY RPTRNW2F.                                                   00020000
000210 01  RP-TRNW2REC.                                                 00021000
000000 COPY RPSTRNW2.                                                   00022000
000000 COPY RPCARDF.                                                    00023000
000240 01  RPCARD-RECORD.                                               00024000
000250     03  RPCARD-FORM             PIC X(02).                       00025000
000260     03  RPCARD-FICHE.                                            00026000
000270         05  RPCARD-FICHE9       PIC 9(01).                       00027000
000280     03  FILLER                  PIC X(77).                       00028000
000000 COPY PRNTERF.                                                    00029000
000300 01  PRINTERREC.                                                  00030000
000000 COPY SRW016.                                                     00031000
000320     03  PLINE4          REDEFINES   PLINE1.                      00032000
000330         05  P4-PRODCODE-HDR     PIC X(08).                       00033000
000340         05  FILLER              PIC X(01).                       00034000
000350         05  P4-PRODCODE         PIC X(06).                       00035000
000360         05  FILLER              PIC X(03).                       00036000
000370         05  P4-ACCOUNT-HDR      PIC X(09).                       00037000
000380         05  FILLER              PIC X(01).                       00038000
000390         05  P4-ACCOUNT          PIC X(22).                       00039000
000400         05  FILLER              PIC X(03).                       00040000
000410         05  P4-MODEL-HDR        PIC X(06).                       00041000
000420         05  FILLER              PIC X(01).                       00042000
000430         05  P4-MODEL            PIC X(10).                       00043000
000440         05  FILLER              PIC X(05).                       00044000
000450         05  P4-CUSTNAME-HDR     PIC X(10).                       00045000
000460         05  FILLER              PIC X(01).                       00046000
000470         05  P4-CUSTNAME         PIC X(40).                       00047000
000480         05  FILLER              PIC X(06).                       00048000
000490     03  PLINE5          REDEFINES   PLINE1.                      00049000
000500         05  FILLER              PIC X(18).                       00050000
000510         05  P5-PRODCODE         PIC X(06).                       00051000
000520         05  FILLER              PIC X(01).                       00052000
000530         05  P5-ACCOUNT          PIC X(22).                       00053000
000540         05  FILLER              PIC X(02).                       00054000
000550         05  P5-EXTC             PIC 9(04).                       00055000
000560         05  FILLER              PIC X(02).                       00056000
000570         05  P5-ITC              PIC X(04).                       00057000
000580         05  FILLER              PIC X(02).                       00058000
000590         05  P5-AMOUNT           PIC ZZ,ZZZ,ZZZ,ZZZ.99-.          00059000
000600         05  FILLER              PIC X(03).                       00060000
000610         05  P5-SIGN             PIC X(03).                       00061000
000620         05  FILLER              PIC X(02).                       00062000
000630         05  P5-ACCUM-DATA       PIC X(24).                       00063000
000640         05  P5-ACCUM-DATA-X REDEFINES P5-ACCUM-DATA              00064000
000650                                                 OCCURS 12.       00065000
000660             07  P5-ACCUM        PIC X(01).                       00066000
000670             07  FILLER          PIC X(01).                       00067000
000680         05  FILLER              PIC X(21).                       00068000
000690     03  PLINE6          REDEFINES   PLINE1.                      00069000
000700         05  FILLER              PIC X(19).                       00070000
000710         05  P6-ACCUM            PIC Z9.                          00071000
000720         05  FILLER              PIC X(05).                       00072000
000730         05  P6-BEG-COUNT        PIC ZZ,ZZZ,ZZ9.                  00073000
000740         05  FILLER              PIC X(04).                       00074000
000750         05  P6-END-COUNT        PIC ZZ,ZZZ,ZZ9.                  00075000
000760         05  FILLER              PIC X(03).                       00076000
000770         05  P6-BEG-AMOUNT       PIC ZZ,ZZZ,ZZZ,ZZZ.99-.          00077000
000780         05  FILLER              PIC X(02).                       00078000
000790         05  P6-END-AMOUNT       PIC ZZ,ZZZ,ZZZ,ZZZ.99-.          00079000
000800         05  FILLER              PIC X(02).                       00080000
000810         05  P6-ACCUMDESC        PIC X(15).                       00081000
000820         05  FILLER              PIC X(24).                       00082000
000830     03  PLINE7          REDEFINES   PLINE1.                      00083000
000840         05  FILLER              PIC X(05).                       00084000
000850         05  P7-INST-HDR         PIC X(05).                       00085000
000860         05  P7-INSTX            PIC X(04).                       00086000
000870         05  P7-INST     REDEFINES P7-INSTX                       00087000
000880                                 PIC 9(04).                       00088000
000890         05  FILLER              PIC X(05).                       00089000
000900         05  P7-TOTAL-HDR        PIC X(20).                       00090000
000910         05  P7-TOTAL            PIC ZZZ,ZZZ,ZZZ,ZZ9.             00091000
000920         05  FILLER              PIC X(78).                       00092000
000930****************************************************************  00093000
000940 WORKING-STORAGE SECTION.                                         00094000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00095000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00095001
000960 01  RPS-RLSELIT.                                                 00096000
000000 COPY RPWRLSE.                                                    00097000
000980 01  MIC-RLSELIT.                                                 00098000
000000 COPY MIWRLSE.                                                    00099000
001000 01  RPWPRI-AREAS.                                                00100000
000000 COPY RPWPRI.                                                     00101000
001020 01  MIWPRI-AREAS.                                                00102000
000000 COPY MIWPRI.                                                     00103000
001040 01  SRW105-AREAS.                                                00104000
000000 COPY SRW105.                                                     00105000
001060*01  BICPBPRM.                                                    00106000
000000 COPY BICPBPRM.                                                   00107000
001080*01  BICRSRB.                                                     00108000
000000 COPY BICRSRB.                                                    00109000
001100*01  BICRPSB.                                                     00110000
000000 COPY BICRPSB.                                                    00111000
001120*01  BICRVERB.                                                    00112000
000000 COPY BICRVERB.                                                   00113000
001140*01  BICRSTAT.                                                    00114000
000000 COPY BICRSTAT.                                                   00115000
001160*01  BICRDBS.                                                     00116000
000000 COPY BICRDBS.                                                    00117000
001180 01  RPBNK-RECORD.                                                00118000
000000 COPY RPSBNK.                                                     00119000
001200 01  RPMST-RECORD.                                                00120000
000000 COPY RPSMST.                                                     00121000
001220 01  RPREL-RECORD.                                                00122000
000000 COPY RPSREL.                                                     00123000
001240 01  RPTRM-RECORD.                                                00124000
000000 COPY RPSTRM.                                                     00125000
001260 01  RPBNKA-AREA.                                                 00126000
000000 COPY RPWBNKA.                                                    00127000
001280 01  RPMSTA-AREA.                                                 00128000
000000 COPY RPWMSTA.                                                    00129000
001300 01  RPRELA-AREA.                                                 00130000
000000 COPY RPWRELA.                                                    00131000
001320 01  RPTRMA-AREA.                                                 00132000
000000 COPY RPWTRMA.                                                    00133000
001340 01  FILLER                      PIC X(08)       VALUE '*MISMST*'.00134000
001350 01  MIMST-RECORD.                                                00135000
000000 COPY MISMST.                                                     00136000
001370 01  FILLER                      PIC X(08)       VALUE '*MI0237*'.00137000
001380 01  MI0237-RECORD.                                               00138000
000000 COPY MIS0237A.                                                   00139000
001400 01  FILLER                      PIC X(08)       VALUE '*MI1001*'.00140000
001410 01  MI1001-RECORD.                                               00141000
000000 COPY MIS1001A.                                                   00142000
001430 01  FILLER                      PIC X(08)       VALUE '*MI2023*'.00143000
001440 01  MI2023-RECORD.                                               00144000
000000 COPY MIS2023A.                                                   00145000
001460 01  FILLER                      PIC X(08)       VALUE '*MI7100*'.00146000
001470 01  MI7100-RECORD.                                               00147000
000000 COPY MIS7100.                                                    00148000
001490 01  FILLER                      PIC X(08)       VALUE '*MI7101*'.00149000
001500 01  MI7101-RECORD.                                               00150000
000000 COPY MIS7101.                                                    00151000
001520 01  FILLER                      PIC X(08)       VALUE '*MI7102*'.00152000
001530 01  MI7102-RECORD.                                               00153000
000000 COPY MIS7102.                                                    00154000
001550 01  FILLER                      PIC X(08)       VALUE '*MI7110*'.00155000
001560 01  MI7110-RECORD.                                               00156000
000000 COPY MIS7110.                                                    00157000
001580 01  FILLER                      PIC X(08)       VALUE '*MI7111*'.00158000
001590 01  MI7111-RECORD.                                               00159000
000000 COPY MIS7111.                                                    00160000
001610 01  MIWMSTA-AREAS.                                               00161000
000000 COPY MIWMSTA.                                                    00162000
001630***************************************************************** 00163000
001640 01  WS-LINKRCIF.                                                 00164000
000000 COPY MISCNT00      REPLACING                                     00165000
001660     ==:MICNT:== BY ==RPRF21==.                                   00166000
000000 COPY RPSRF21.                                                    00167000
001680     03  WS-RETURNED-OBJECT                                       00168000
001690                         REDEFINES RPRF21-RETURNED-OBJECT.        00169000
001700         05  FILLER              PIC X(50).                       00170000
001710         05  WS-RO-STATUS        PIC X(01).                       00171000
001720         05  WS-RO-NAME          PIC X(40).                       00172000
001730         05  FILLER              PIC X(909).                      00173000
001740***************************************************************** 00174000
001750 01  SRW000-AREAS.                                                00175000
000000 COPY SRW000.                                                     00176000
001770 01  SRW009-AREAS.                                                00177000
000000 COPY SRW009.                                                     00178000
001790 01  SRW015-AREAS.                                                00179000
000000 COPY SRW015.                                                     00180000
001810 01  SRW022-AREAS.                                                00181000
000000 COPY SRW022.                                                     00182000
001830 01  WS-ABEND.                                                    00183000
000000 COPY SRW028.                                                     00184000
001850 01  SRW033-AREAS.                                                00185000
000000 COPY SRW033.                                                     00186000
001870 01  SRW044-AREAS.                                                00187000
000000 COPY SRW044.                                                     00188000
001890 01  SRW060-AREAS.                                                00189000
000000 COPY SRW060.                                                     00190000
001910 01  RPW015-AREAS.                                                00191000
000000 COPY RPW015.                                                     00192000
001930 01  WS-RPMIM2023AREAS.                                           00193000
000000 COPY RPW2023.                                                    00194000
001950 01  WS-RPMIM7101AREAS.                                           00195000
000000 COPY RPW7101.                                                    00196000
001970 01  WS-RPMIM7102AREAS.                                           00197000
000000 COPY RPW7102.                                                    00198000
001990 01  WS-RPMIM7110AREAS.                                           00199000
000000 COPY RPW7110.                                                    00200000
002010 01  WS-RPMIM7111AREAS.                                           00201000
000000 COPY RPW7111.                                                    00202000
002030 01  WS-HEADINGS.                                                 00203000
002040     03  FILLER                  PIC X(19)       VALUE            00204000
002050         '*** WS-HEADINGS ***'.                                   00205000
002060     03  WS-HEAD01.                                               00206000
002070         05  FILLER              PIC X(44)       VALUE            00207000
002080             '* TRANSACTIONS *  PRODUCT               ACCO'.      00208000
002090         05  FILLER              PIC X(44)       VALUE            00209000
002100             'UNT                                        *'.      00210000
002110         05  FILLER              PIC X(44)       VALUE            00211000
002120             '*     ACCUMULATORS     **                   '.      00212000
002130     03  WS-HEAD02.                                               00213000
002140         05  FILLER              PIC X(44)       VALUE            00214000
002150             '                                         NUM'.      00215000
002160         05  FILLER              PIC X(44)       VALUE            00216000
002170             'BER  EXTC  ITC              AMOUNT   SIGN  1'.      00217000
002180         05  FILLER              PIC X(44)       VALUE            00218000
002190             ' 2 3 4 5 6 7 8 9 10 11 12                   '.      00219000
002200     03  WS-HEAD03.                                               00220000
002210         05  FILLER              PIC X(44)       VALUE            00221000
002220             '* ACCUMULATORS *  ACCUM    BEG COUNT     END'.      00222000
002230         05  FILLER              PIC X(44)       VALUE            00223000
002240             ' COUNT          BEG AMOUNT          END AMOU'.      00224000
002250         05  FILLER              PIC X(44)       VALUE            00225000
002260             'NT   DESCRIPTION                            '.      00226000
002270 01  WS-TOTALS.                                                   00227000
002280     03  FILLER                  PIC X(17)       VALUE            00228000
002290         '*** WS-TOTALS ***'.                                     00229000
002300     03  WS-TOTAL1.                                               00230000
002310         05  FILLER              PIC X(10)       VALUE            00231000
002320             '     INST '.                                        00232000
002330         05  WS-T1INST           PIC 9(04).                       00233000
002340         05  FILLER              PIC X(05)       VALUE SPACES.    00234000
002350         05  WS-T1-HDR           PIC X(20).                       00235000
002360         05  WS-T1ACT            PIC ZZZ,ZZZ,ZZZ,ZZ9.             00236000
002370         05  FILLER              PIC X(78)       VALUE SPACES.    00237000
002380 01  WS-STORAGE.                                                  00238000
002390     03  FILLER                  PIC X(18)       VALUE            00239000
002400         '*** WS-STORAGE ***'.                                    00240000
002410     03  WS-FUNC                 PIC X(01)       VALUE SPACES.    00241000
002420     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00242000
002430     03  WS-INST                 PIC 9(04)       VALUE ZEROS.     00243000
002440     03  WS-PRIMARY-FLAG         PIC X(01)       VALUE SPACES.    00244000
002450     03  WS-FIRST-TRAN           PIC X(01)       VALUE SPACES.    00245000
002460     03  WS-TRM-FLAG             PIC X(01)       VALUE SPACES.    00246000
002470     03  WS-ACCUM-SW             PIC X(01)       VALUE SPACES.    00247000
002480     03  WS-7110-FOUND           PIC X(01)       VALUE SPACE.     00248000
002490     03  WS-RCIF-FOUND           PIC X(01)       VALUE SPACE.     00249000
002500     03  WS-RCIF-INTERFACE       PIC X(08)       VALUE SPACES.    00250000
002510     03  WS-REL-EOF              PIC X(01)       VALUE 'N'.       00251000
002520     03  WS-TRNW2-EOF            PIC X(01)       VALUE 'N'.       00252000
002530     03  WS-TRNW2-READ           PIC X(01)       VALUE 'N'.       00253000
002540     03  WS-CURDTYYYYMMDD        PIC 9(08)       VALUE ZEROS.     00254000
002550     03  FILLER          REDEFINES WS-CURDTYYYYMMDD.              00255000
002560         05  WS-CURDTYYYY        PIC 9(04).                       00256000
002570         05  WS-CURDTMMDD        PIC 9(04).                       00257000
002580         05  FILLER      REDEFINES WS-CURDTMMDD.                  00258000
002590             07  WS-CURDTMM      PIC 9(02).                       00259000
002600             07  WS-CURDTDD      PIC 9(02).                       00260000
002610     03  WS-DATEDDMMYYYY         PIC 9(08)       VALUE ZEROS.     00261000
002620     03  FILLER          REDEFINES WS-DATEDDMMYYYY.               00262000
002630         05  WS-DATEMM           PIC 9(02).                       00263000
002640         05  WS-DATEDD           PIC 9(02).                       00264000
002650         05  WS-DATEYYYY         PIC 9(04).                       00265000
002660     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00266000
002670     03  FILLER          REDEFINES WS-PDATE.                      00267000
002680         05  WS-PDATE-YYYY       PIC 9(04).                       00268000
002690         05  WS-PDATE-MM         PIC 9(02).                       00269000
002700         05  WS-PDATE-DD         PIC 9(02).                       00270000
002710     03  WS-LINES                PIC S9(03)      COMP-3           00271000
002720                                                 VALUE +0.        00272000
002730     03  WS-SUB1                 PIC S9(04)      COMP             00273000
002740                                                 VALUE +0.        00274000
002750     03  WS-SUB2                 PIC S9(04)      COMP             00275000
002760                                                 VALUE +0.        00276000
002770     03  WS-TRAN-COUNT           PIC S9(05)      COMP-3           00277000
002780                                                 VALUE ZEROS.     00278000
002790     03  WS-NUMOFREL             PIC S9(05)      COMP-3           00279000
002800                                                 VALUE ZEROS.     00280000
002810     03  WS-NUMOFTRANS           PIC S9(05)      COMP-3           00281000
002820                                                 VALUE ZEROS.     00282000
002830     03  WS-INST-SW              PIC X(01)       VALUE SPACES.    00283000
002840     03  WS-DEFAULT-SWITCH       PIC X(01)       VALUE SPACES.    00284000
002850     03  WS-ACCUM-UPDATE-FLAGS   PIC X(12)       VALUE SPACES.    00285000
002860     03  WS-ACCUM-UPDATE-FLAGS-X                                  00286000
002870                             REDEFINES WS-ACCUM-UPDATE-FLAGS.     00287000
002880         05  WS-ACCUM-UPDATE-FLAG                                 00288000
002890                                 PIC X(01)       OCCURS 12.       00289000
002900     03  WS-ACCUM-UPDATE-FLAGS1  PIC X(12)       VALUE SPACES.    00290000
002910     03  WS-ACCUM-UPDATE-FLAGS1-X                                 00291000
002920                             REDEFINES WS-ACCUM-UPDATE-FLAGS1.    00292000
002930         05  WS-ACCUM-UPDATE-FLAG1                                00293000
002940                                 PIC X(01)       OCCURS 12.       00294000
002950     03  WS-DISPLAY-AMOUNT       PIC ZZ,ZZZ,ZZZ,ZZZ.99.           00295000
002960     03  WS-BEG-TRAN-INFO        PIC X(180).                      00296000
002970     03  WS-BEG-TRAN-INFOX                                        00297000
002980                             REDEFINES WS-BEG-TRAN-INFO           00298000
002990                                                 OCCURS 12.       00299000
003000         05  WS-BEG-TRAN-DATE                                     00300000
003010                                 PIC S9(09)      COMP-3.          00301000
003020         05  WS-BEG-TRAN-COUNT                                    00302000
003030                                 PIC S9(05)      COMP-3.          00303000
003040         05  WS-BEG-TRAN-AMOUNT                                   00304000
003050                                 PIC S9(11)V99   COMP-3.          00305000
003060******************************************************************00306000
003070 PROCEDURE DIVISION.                                              00307000
003080******************************************************************00308000
003090 INITIALIZATION SECTION.                                          00309000
003100 IN-START.                                                        00310000
003110     PERFORM GET-FILE-ORGANIZATION.                               00311000
003120     MOVE 'RPD252' TO SR-APIPROGLIT.                              00312000
003130     MOVE 'RPD252' TO WS-ABPROGID.                                00313000
003140     OPEN INPUT RP-TRNW2FIL.                                      00314000
003150     OPEN OUTPUT PRINTERFIL.                                      00315000
003160     MOVE SPACES TO PRINTERREC.                                   00316000
003170 IN-EXIT.                                                         00317000
003180     EXIT.                                                        00318000
003190******************************************************************00319000
003200 OPEN-API-FILES SECTION.                                          00320000
003210 OAF-START.                                                       00321000
003220     MOVE 'O R' TO SR-APIFUNC.                                    00322000
003230     PERFORM CALL-RPS-BNK.                                        00323000
003240     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00324000
003250         GO TO AR-0001.                                           00325000
003260     MOVE 'O R' TO SR-APIFUNC.                                    00326000
003270     PERFORM CALL-RPS-MST.                                        00327000
003280     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00328000
003290         GO TO AR-0002.                                           00329000
003300     MOVE 'O R' TO SR-APIFUNC.                                    00330000
003310     PERFORM CALL-RPS-REL.                                        00331000
003320     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00332000
003330         GO TO AR-0003.                                           00333000
003340     MOVE 'O U' TO SR-APIFUNC.                                    00334000
003350     PERFORM CALL-RPS-TRM.                                        00335000
003360     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00336000
003370         GO TO AR-0004.                                           00337000
003380 OAF-EXIT.                                                        00338000
003390     EXIT.                                                        00339000
003400******************************************************************00340000
003410 READ-CARDFILE SECTION.                                           00341000
003420 RC-START.                                                        00342000
003430     OPEN INPUT RP-CARDFIL.                                       00343000
003440     READ RP-CARDFIL                                              00344000
003450         AT END                                                   00345000
003460         MOVE '01' TO RPCARD-FORM                                 00346000
003470         MOVE '1' TO RPCARD-FICHE                                 00347000
003480         GO TO RC-END.                                            00348000
003490     IF RPCARD-FICHE IS EQUAL TO SPACE                            00349000
003500         MOVE '1' TO RPCARD-FICHE.                                00350000
003510     IF RPCARD-FICHE IS LESS THAN '1'                             00351000
003520         OR RPCARD-FICHE IS GREATER THAN '3'                      00352000
003530         MOVE '1' TO RPCARD-FICHE.                                00353000
003540     IF RPCARD-FORM IS EQUAL TO SPACES                            00354000
003550         MOVE '01' TO RPCARD-FORM.                                00355000
003560 RC-END.                                                          00356000
003570     MOVE RPCARD-FICHE TO SR-FICHE.                               00357000
003580     MOVE RPCARD-FORM TO SR-FORM.                                 00358000
003590     MOVE SR-FORM TO SRW-FNO.                                     00359000
003600     MOVE 'RP' TO SRW-APPL.                                       00360000
003610     PERFORM PRINT-SEGMENTATION.                                  00361000
003620     CLOSE RP-CARDFIL.                                            00362000
003630 RC-EXIT.                                                         00363000
003640     EXIT.                                                        00364000
003650******************************************************************00365000
003660 MAIN-LOGIC SECTION.                                              00366000
003670 ML-START.                                                        00367000
003680     MOVE ZEROS TO RPBNK-GRP-KEY.                                 00368000
003690     MOVE ZEROS TO RPMST-GRP-KEY.                                 00369000
003700     MOVE ZEROS TO RPREL-GRP-KEY.                                 00370000
003710     MOVE ZEROS TO RPTRM-GRP-KEY.                                 00371000
003720 ML-PROCESS.                                                      00372000
003730     PERFORM PROCESS-MASTER.                                      00373000
003740 ML-END.                                                          00374000
003750     GO TO END-ROUTINE.                                           00375000
003760 ML-EXIT.                                                         00376000
003770     EXIT.                                                        00377000
003780******************************************************************00378000
003790 PROCESS-MASTER SECTION.                                          00379000
003800*PM-START.                                                        00380000
003810     READ RP-TRNW2FIL                                             00381000
003820         AT END                                                   00382000
003830         GO TO PM-EXIT.                                           00383000
003840     GO TO PM-READ-MST.                                           00384000
003850 PM-READ-TRAN.                                                    00385000
003860     READ RP-TRNW2FIL                                             00386000
003870         AT END                                                   00387000
003880         GO TO PM-END.                                            00388000
003890     IF RPTRNW2-AMOUNT IS EQUAL TO ZEROS                          00389000
003900         GO TO PM-READ-TRAN.                                      00390000
003910     IF RPTRNW2-ACCT-KEY LESS THAN RPMST-GRP-KEY                  00391000
003920         GO TO PM-READ-TRAN.                                      00392000
003930     IF RPTRNW2-ACCT-KEY IS EQUAL TO RPMST-GRP-KEY                00393000
003940         GO TO PM-7101.                                           00394000
003950 PM-READ-MST.                                                     00395000
003960     MOVE 'N  ' TO SR-APIFUNC.                                    00396000
003970     PERFORM CALL-RPS-MST.                                        00397000
003980 PM-PROCESS.                                                      00398000
003990     IF WS-FUNCTION IS EQUAL TO 'E'                               00399000
004000         GO TO PM-END.                                            00400000
004010     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00401000
004020         GO TO AR-0005.                                           00402000
004030     IF RPMST-INST IS NOT EQUAL TO WS-INST                        00403000
004040         AND WS-INST IS NOT EQUAL TO ZEROS                        00404000
004050         PERFORM PRINT-TOTALS.                                    00405000
004060     IF RPMST-INST IS NOT EQUAL TO RPBNK-INST                     00406000
004070         PERFORM CHANGE-BANK.                                     00407000
004080     IF RPMST-REL-STAT IS NOT EQUAL TO 'A'                        00408000
004090         GO TO PM-READ-MST.                                       00409000
004100     IF RPMST-GRP-KEY IS LESS THAN RPTRNW2-ACCT-KEY               00410000
004110         GO TO PM-READ-MST.                                       00411000
004120     IF RPMST-GRP-KEY IS GREATER THAN RPTRNW2-ACCT-KEY            00412000
004130         GO TO PM-READ-TRAN.                                      00413000
004140 PM-7101.                                                         00414000
004150     MOVE RPMST-MODEL TO WS-RPMIM7101MODEL.                       00415000
004160     PERFORM SEARCH-RPS-7101.                                     00416000
004170     IF WS-RPMIM7101FOUND IS EQUAL TO 'N'                         00417000
004180         GO TO PM-READ-MST.                                       00418000
004190     IF MIM-7101ACTCD IS NOT EQUAL TO 'A'                         00419000
004200         GO TO PM-READ-MST.                                       00420000
004210     IF MIM-7101TRANPROFILE IS EQUAL TO SPACES                    00421000
004220         OR MIM-7101TRANPROFILE-I IS NOT EQUAL TO 'Y'             00422000
004230         GO TO PM-READ-MST.                                       00423000
004240 PM-READ-7110.                                                    00424000
004250     MOVE 'Y' TO WS-7110-FOUND.                                   00425000
004260     MOVE MIM-7101TRANPROFILE TO WS-RPMIM7110TRANPROFILE.         00426000
004270     PERFORM SEARCH-RPS-7110.                                     00427000
004280     IF WS-RPMIM7110FOUND IS EQUAL TO 'N'                         00428000
004290         MOVE 'N' TO WS-7110-FOUND.                               00429000
004300 PM-READ-TRM.                                                     00430000
004310     MOVE 'W' TO WS-TRM-FLAG.                                     00431000
004320     MOVE 'N  ' TO SR-APIFUNC.                                    00432000
004330     PERFORM CALL-RPS-TRM.                                        00433000
004340     IF WS-FUNCTION IS EQUAL TO 'E'                               00434000
004350         PERFORM INITIAL-NEW-TRM                                  00435000
004360         GO TO PM-SAVE-BEG-TRM.                                   00436000
004370     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00437000
004380         GO TO AR-0006.                                           00438000
004390     IF RPTRM-GRP-KEY IS LESS THAN RPMST-GRP-KEY                  00439000
004400         GO TO PM-READ-TRM.                                       00440000
004410     IF RPTRM-GRP-KEY IS GREATER THAN RPMST-GRP-KEY               00441000
004420         PERFORM INITIAL-NEW-TRM.                                 00442000
004430 PM-SAVE-BEG-TRM.                                                 00443000
004440     MOVE RPTRM-TRAN-INFO TO WS-BEG-TRAN-INFO.                    00444000
004450 PM-PROCESS-TRANS.                                                00445000
004460     PERFORM PROCESS-TRANSACTIONS.                                00446000
004470     IF WS-ACCUM-SW IS EQUAL TO 'N'                               00447000
004480         GO TO PM-SKIP-TRM-UPDATE.                                00448000
004490 PM-UPDATE-TRM.                                                   00449000
004500     IF WS-TRM-FLAG IS EQUAL TO 'A'                               00450000
004510         MOVE 'A  ' TO SR-APIFUNC                                 00451000
004520     ELSE                                                         00452000
004530         MOVE 'W  ' TO SR-APIFUNC.                                00453000
004540     PERFORM CALL-RPS-TRM.                                        00454000
004550     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00455000
004560         GO TO AR-0007.                                           00456000
004570 PM-SKIP-TRM-UPDATE.                                              00457000
004580     IF WS-TRNW2-EOF IS EQUAL TO 'Y'                              00458000
004590         GO TO PM-END.                                            00459000
004600     GO TO PM-READ-MST.                                           00460000
004610 PM-END.                                                          00461000
004620     PERFORM PRINT-TOTALS.                                        00462000
004630 PM-EXIT.                                                         00463000
004640     EXIT.                                                        00464000
004650******************************************************************00465000
004660 PROCESS-TRANSACTIONS SECTION.                                    00466000
004670 PT-START.                                                        00467000
004680     MOVE 'Y' TO WS-FIRST-TRAN.                                   00468000
004690     MOVE 'N' TO WS-ACCUM-SW.                                     00469000
004700     MOVE SPACES TO WS-ACCUM-UPDATE-FLAGS1.                       00470000
004710     GO TO PT-PROCESS.                                            00471000
004720 PT-READ-TRAN.                                                    00472000
004730     READ RP-TRNW2FIL                                             00473000
004740         AT END                                                   00474000
004750         MOVE 'Y' TO WS-TRNW2-EOF                                 00475000
004760         GO TO PT-END.                                            00476000
004770     IF RPTRNW2-AMOUNT IS EQUAL TO ZEROS                          00477000
004780         GO TO PT-READ-TRAN.                                      00478000
004790 PT-PROCESS.                                                      00479000
004800     IF RPTRNW2-ACCT-KEY IS GREATER THAN RPMST-GRP-KEY            00480000
004810         GO TO PT-END.                                            00481000
004820     IF RPTRNW2-GRP-KEY IS EQUAL TO RPREL-GRP-KEY                 00482000
004830         GO TO PT-7102.                                           00483000
004840 PT-READ-REL.                                                     00484000
004850     IF WS-REL-EOF IS EQUAL TO 'Y'                                00485000
004860         GO TO PT-READ-TRAN.                                      00486000
004870     MOVE 'N  ' TO SR-APIFUNC.                                    00487000
004880     PERFORM CALL-RPS-REL.                                        00488000
004890     IF WS-FUNCTION IS EQUAL TO 'E'                               00489000
004900         MOVE 'Y' TO WS-REL-EOF                                   00490000
004910         GO TO PT-READ-TRAN.                                      00491000
004920     IF RPREL-GRP-KEY IS LESS THAN RPTRNW2-GRP-KEY                00492000
004930         GO TO PT-READ-REL.                                       00493000
004940     IF RPREL-GRP-KEY IS GREATER THAN RPREL-GRP-KEY               00494000
004950         GO TO PT-READ-TRAN.                                      00495000
004960 PT-7102.                                                         00496000
004970     MOVE RPMST-MODEL TO WS-RPMIM7102MODEL.                       00497000
004980     IF RPREL-INST2 IS EQUAL TO ZEROS                             00498000
004990         MOVE RPREL-PRODCODE TO WS-RPMIM7102PRODCODE              00499000
005000     ELSE                                                         00500000
005010         MOVE RPREL-PRODCODE2 TO WS-RPMIM7102PRODCODE.            00501000
005020     MOVE RPREL-ACCT-TYPE TO WS-RPMIM7102TYPE.                    00502000
005030     PERFORM SEARCH-RPS-7102.                                     00503000
005040     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         00504000
005050         GO TO PT-READ-7111.                                      00505000
005060 PT-7102-TYPEZERO.                                                00506000
005070     MOVE ZEROS TO WS-RPMIM7102TYPE.                              00507000
005080     PERFORM SEARCH-RPS-7102.                                     00508000
005090     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         00509000
005100         GO TO PT-READ-7111.                                      00510000
005110 PT-7102-MODELONLY.                                               00511000
005120     MOVE SPACES TO WS-RPMIM7102PRODCODE.                         00512000
005130     MOVE ZEROS TO WS-RPMIM7102TYPE.                              00513000
005140     PERFORM SEARCH-RPS-7102.                                     00514000
005150     IF WS-RPMIM7102FOUND IS EQUAL TO 'N'                         00515000
005160         GO TO PT-READ-TRAN.                                      00516000
005170 PT-READ-7111.                                                    00517000
005180     MOVE MIM-7101TRANPROFILE TO WS-RPMIM7111TRANPROFILE.         00518000
005190     MOVE MIM-7102TRANPLAN TO WS-RPMIM7111TRANPLAN.               00519000
005200     MOVE RPTRNW2-EXTC TO WS-RPMIM7111EXTTRAN.                    00520000
005210     MOVE RPTRNW2-ITC TO WS-RPMIM7111INTTRAN.                     00521000
005220     PERFORM SEARCH-RPS-7111.                                     00522000
005230     IF WS-RPMIM7111FOUND IS EQUAL TO 'N'                         00523000
005240         GO TO PT-READ-TRAN.                                      00524000
005250     MOVE ZEROS TO WS-SUB1.                                       00525000
005260     MOVE SPACES TO WS-ACCUM-UPDATE-FLAGS.                        00526000
005270 PT-ACCUMULATOR-LOOP.                                             00527000
005280     ADD +1 TO WS-SUB1.                                           00528000
005290     IF WS-SUB1 IS GREATER THAN WS-RPMIM7111MAXOCCURS             00529000
005300         GO TO PT-PRINT-TRAN.                                     00530000
005310     IF MIM-7111OPTION (WS-SUB1) IS EQUAL TO 'N'                  00531000
005320         GO TO PT-ACCUMULATOR-LOOP.                               00532000
005330     IF RPTRNW2-AMOUNT IS LESS THAN MIM-7111MINAMT (WS-SUB1)      00533000
005340         GO TO PT-ACCUMULATOR-LOOP.                               00534000
005350     MOVE 'X' TO WS-ACCUM-UPDATE-FLAG (WS-SUB1).                  00535000
005360     MOVE 'X' TO WS-ACCUM-UPDATE-FLAG1 (WS-SUB1).                 00536000
005370     MOVE RPBNK-CURDT TO RPTRM-TRAN-DATE (WS-SUB1).               00537000
005380     IF MIM-7111SIGN IS EQUAL TO 'A'                              00538000
005390         ADD +1 TO RPTRM-TRAN-COUNT (WS-SUB1)                     00539000
005400         ELSE                                                     00540000
005410         SUBTRACT +1 FROM RPTRM-TRAN-COUNT (WS-SUB1)              00541000
005420         END-IF.                                                  00542000
005430     IF RPTRM-TRAN-COUNT (WS-SUB1) IS LESS THAN ZERO              00543000
005440         MOVE ZEROS TO RPTRM-TRAN-COUNT (WS-SUB1).                00544000
005450     IF MIM-7111SIGN IS EQUAL TO 'A'                              00545000
005460         ADD RPTRNW2-AMOUNT TO RPTRM-TRAN-AMOUNT (WS-SUB1)        00546000
005470         ELSE                                                     00547000
005480         SUBTRACT RPTRNW2-AMOUNT                                  00548000
005490             FROM RPTRM-TRAN-AMOUNT (WS-SUB1)                     00549000
005500         END-IF.                                                  00550000
005510     IF RPTRM-TRAN-AMOUNT (WS-SUB1) IS LESS THAN ZERO             00551000
005520         MOVE ZEROS TO RPTRM-TRAN-AMOUNT (WS-SUB1).               00552000
005530     GO TO PT-ACCUMULATOR-LOOP.                                   00553000
005540 PT-PRINT-TRAN.                                                   00554000
005550     IF WS-ACCUM-UPDATE-FLAGS IS EQUAL TO SPACES                  00555000
005560         GO TO PT-READ-TRAN.                                      00556000
005570     IF WS-FIRST-TRAN IS EQUAL TO 'Y'                             00557000
005580         MOVE 'N' TO WS-FIRST-TRAN                                00558000
005590         PERFORM PRINT-PRIMARY.                                   00559000
005600     MOVE 'Y' TO WS-ACCUM-SW.                                     00560000
005610     PERFORM PRINT-TRANSACTION.                                   00561000
005620     GO TO PT-READ-TRAN.                                          00562000
005630 PT-END.                                                          00563000
005640     IF WS-ACCUM-SW IS EQUAL TO 'Y'                               00564000
005650         PERFORM PRINT-ACCUMULATORS.                              00565000
005660 PT-EXIT.                                                         00566000
005670     EXIT.                                                        00567000
005680******************************************************************00568000
005690 INITIAL-NEW-TRM SECTION.                                         00569000
005700 INT-START.                                                       00570000
005710     MOVE 'A' TO WS-TRM-FLAG.                                     00571000
005720     MOVE ZEROS TO WS-SUB1.                                       00572000
005730 INT-MOVE-KEY.                                                    00573000
005740     MOVE SPACES TO RPTRM-RECORD.                                 00574000
005750     MOVE RPMST-GRP-KEY TO RPTRM-GRP-KEY.                         00575000
005760 INT-GRACE-DAYS.                                                  00576000
005770     IF WS-7110-FOUND IS EQUAL TO 'N'                             00577000
005780         MOVE ZEROS TO RPTRM-GRACE-EXPIRATION-DATE                00578000
005790         GO TO INT-LOOP.                                          00579000
005800     IF MIM-7110GRACE-DAYS IS EQUAL TO ZEROS                      00580000
005810         MOVE ZEROS TO RPTRM-GRACE-EXPIRATION-DATE                00581000
005820         GO TO INT-LOOP.                                          00582000
005830     MOVE 'D' TO SR-PERIOD.                                       00583000
005840     MOVE MIM-7110GRACE-DAYS TO SR-FREQ.                          00584000
005850     MOVE ZEROS TO SR-DAY.                                        00585000
005860     MOVE WS-CURDTYYYY TO SR-FCYR.                                00586000
005870     MOVE WS-CURDTMM TO SR-FCMON.                                 00587000
005880     MOVE WS-CURDTDD TO SR-FCDAY.                                 00588000
005890     PERFORM JULIAN-365.                                          00589000
005900     MOVE SR-TOJUL TO SR-FROMJUL.                                 00590000
005910     PERFORM NEXT-DATE-365.                                       00591000
005920     MOVE SR-TOJUL TO SR-FROMJUL.                                 00592000
005930     PERFORM CALENDAR-365.                                        00593000
005940     MOVE SR-TCMON TO WS-PDATE-MM.                                00594000
005950     MOVE SR-TCDAY TO WS-PDATE-DD.                                00595000
005960     MOVE SR-TCYR TO WS-PDATE-YYYY.                               00596000
005970     MOVE WS-PDATE TO RPTRM-GRACE-EXPIRATION-DATE.                00597000
005980 INT-LOOP.                                                        00598000
005990     ADD +1 TO WS-SUB1.                                           00599000
006000     IF WS-SUB1 IS GREATER THAN WS-RPMIM7111MAXOCCURS             00600000
006010         GO TO INT-EXIT.                                          00601000
006020     MOVE ZEROS TO RPTRM-TRAN-DATE (WS-SUB1).                     00602000
006030     MOVE ZEROS TO RPTRM-TRAN-COUNT (WS-SUB1).                    00603000
006040     MOVE ZEROS TO RPTRM-TRAN-AMOUNT (WS-SUB1).                   00604000
006050     GO TO INT-LOOP.                                              00605000
006060 INT-EXIT.                                                        00606000
006070     EXIT.                                                        00607000
006080******************************************************************00608000
006090 CALL-RCIF SECTION.                                               00609000
006100 CR-START.                                                        00610000
006110     MOVE RPMST-INST TO RPRF21-BASE-ACCT-INST.                    00611000
006120     MOVE RPMST-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.            00612000
006130     MOVE RPMST-ACCOUNT TO RPRF21-BASE-ACCT.                      00613000
006140     MOVE SPACES TO RPRF21-BASE-CUSTOMER.                         00614000
006150     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00615000
006160         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00616000
006170         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00617000
006180     MOVE 'A' TO RPRF21-FUNC.                                     00618000
006190     MOVE SPACES TO WS-FUNCTION.                                  00619000
006200     MOVE SPACE TO WS-RCIF-FOUND.                                 00620000
006210     MOVE WS-RCIF-INTERFACE TO SR-060CALLNAME.                    00621000
006220 CR-GET-RCIF-INFO.                                                00622000
006230     CALL SR-060CALLNAME USING                                    00623000
006240         WS-LINKRCIF.                                             00624000
006250     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     00625000
006260         MOVE RPRF21-FUNCTION TO WS-FUNCTION                      00626000
006270         MOVE RPRF21-FUNCTION TO WS-RCIF-FOUND                    00627000
006280         GO TO CR-EXIT.                                           00628000
006290 CR-EXIT.                                                         00629000
006300     EXIT.                                                        00630000
006310******************************************************************00631000
006320 PRINT-PRIMARY SECTION.                                           00632000
006330 PP-START.                                                        00633000
006340     ADD +1 TO WS-NUMOFREL.                                       00634000
006350     IF (SR-LINES + 3) IS GREATER THAN SR-PAGE                    00635000
006360         PERFORM HEADING-ROUTINE                                  00636000
006370     ELSE                                                         00637000
006380         MOVE SPACES TO PLINE1                                    00638000
006390         PERFORM PR-02 THRU PR-EXIT.                              00639000
006400     MOVE 'PROD CD:' TO P4-PRODCODE-HDR.                          00640000
006410     MOVE RPMST-PRODCODE TO P4-PRODCODE.                          00641000
006420     MOVE 'ACCT NBR:' TO P4-ACCOUNT-HDR.                          00642000
006430     MOVE RPMST-PRODCODE TO RPW015-PRODCODE.                      00643000
006440     MOVE RPMST-ACCOUNT TO RPW015-ACCOUNT.                        00644000
006450     PERFORM EDIT-ACCOUNT.                                        00645000
006460     MOVE RPW015-EDITEDACCOUNT TO P4-ACCOUNT.                     00646000
006470     MOVE 'MODEL:' TO P4-MODEL-HDR.                               00647000
006480     MOVE RPMST-MODEL TO P4-MODEL.                                00648000
006490     MOVE 'CUST NAME:' TO P4-CUSTNAME-HDR.                        00649000
006500     PERFORM CALL-RCIF.                                           00650000
006510     IF WS-RCIF-FOUND IS EQUAL TO SPACES                          00651000
006520         MOVE WS-RO-NAME TO P4-CUSTNAME                           00652000
006530     ELSE                                                         00653000
006540         MOVE 'NAME NOT FOUND' TO P4-CUSTNAME.                    00654000
006550 PP-PRINT.                                                        00655000
006560     PERFORM PR-02 THRU PR-EXIT.                                  00656000
006570 PP-TRAN-HEADING.                                                 00657000
006580     MOVE WS-HEAD01 TO PLINE1.                                    00658000
006590     PERFORM PR-01 THRU PR-EXIT.                                  00659000
006600     MOVE WS-HEAD02 TO PLINE1.                                    00660000
006610     PERFORM PR-01 THRU PR-EXIT.                                  00661000
006620 PP-EXIT.                                                         00662000
006630     EXIT.                                                        00663000
006640******************************************************************00664000
006650 PRINT-ACCUMULATORS SECTION.                                      00665000
006660 PA-START.                                                        00666000
006670     MOVE ZEROS TO WS-SUB1.                                       00667000
006680     MOVE SPACES TO PLINE1.                                       00668000
006690     PERFORM PR-01 THRU PR-EXIT.                                  00669000
006700     MOVE WS-HEAD03 TO PLINE1.                                    00670000
006710     PERFORM PR-01 THRU PR-EXIT.                                  00671000
006720 PA-LOOP.                                                         00672000
006730     ADD +1 TO WS-SUB1.                                           00673000
006740     IF WS-SUB1 IS GREATER THAN WS-RPMIM7110MAXOCCURS             00674000
006750         MOVE SPACES TO WS-ACCUM-UPDATE-FLAGS1                    00675000
006760         GO TO PA-EXIT.                                           00676000
006770     IF (SR-LINES + 1) IS GREATER THAN SR-PAGE                    00677000
006780         PERFORM HEADING-ROUTINE.                                 00678000
006790     IF WS-ACCUM-UPDATE-FLAG1 (WS-SUB1) IS NOT EQUAL TO 'X'       00679000
006800         GO TO PA-LOOP.                                           00680000
006810     MOVE WS-SUB1 TO P6-ACCUM.                                    00681000
006820     MOVE WS-BEG-TRAN-COUNT (WS-SUB1) TO P6-BEG-COUNT.            00682000
006830     MOVE RPTRM-TRAN-COUNT (WS-SUB1) TO P6-END-COUNT.             00683000
006840     MOVE WS-BEG-TRAN-AMOUNT (WS-SUB1) TO P6-BEG-AMOUNT.          00684000
006850     MOVE RPTRM-TRAN-AMOUNT (WS-SUB1) TO P6-END-AMOUNT.           00685000
006860     MOVE ZEROS TO WS-SUB2.                                       00686000
006870 PA-DESC-LOOP.                                                    00687000
006880     ADD +1 TO WS-SUB2.                                           00688000
006890     IF WS-SUB2 IS GREATER THAN WS-RPMIM7110MAXOCCURS             00689000
006900         MOVE SPACES TO P6-ACCUMDESC                              00690000
006910         GO TO PA-PRINT-ACCUM-LINE.                               00691000
006920     IF WS-7110-FOUND IS EQUAL TO 'N'                             00692000
006930         MOVE SPACES TO P6-ACCUMDESC                              00693000
006940         GO TO PA-PRINT-ACCUM-LINE.                               00694000
006950     IF MIM-7110ACCUM (WS-SUB2) IS NOT EQUAL TO WS-SUB1           00695000
006960         GO TO PA-DESC-LOOP.                                      00696000
006970     MOVE MIM-7110ACCUMDESC (WS-SUB2) TO P6-ACCUMDESC.            00697000
006980 PA-PRINT-ACCUM-LINE.                                             00698000
006990     PERFORM PR-01 THRU PR-EXIT.                                  00699000
007000     GO TO PA-LOOP.                                               00700000
007010 PA-EXIT.                                                         00701000
007020     EXIT.                                                        00702000
007030******************************************************************00703000
007040 PRINT-TRANSACTION SECTION.                                       00704000
007050 PTR-START.                                                       00705000
007060     ADD +1 TO WS-NUMOFTRANS.                                     00706000
007070     IF (SR-LINES + 1) IS GREATER THAN SR-PAGE                    00707000
007080         PERFORM HEADING-ROUTINE.                                 00708000
007090     IF RPTRNW2-INST2 IS EQUAL TO ZEROS                           00709000
007100         MOVE RPTRNW2-PRODCODE TO P5-PRODCODE                     00710000
007110         MOVE RPTRNW2-PRODCODE TO RPW015-PRODCODE                 00711000
007120         MOVE RPTRNW2-ACCOUNT TO RPW015-ACCOUNT                   00712000
007130     ELSE                                                         00713000
007140         MOVE RPTRNW2-PRODCODE2 TO P5-PRODCODE                    00714000
007150         MOVE RPTRNW2-PRODCODE2 TO RPW015-PRODCODE                00715000
007160         MOVE RPTRNW2-ACCOUNT2 TO RPW015-ACCOUNT.                 00716000
007170     PERFORM EDIT-ACCOUNT.                                        00717000
007180     MOVE RPW015-EDITEDACCOUNT TO P5-ACCOUNT.                     00718000
007190     MOVE RPTRNW2-EXTC TO P5-EXTC.                                00719000
007200     MOVE RPTRNW2-ITC TO P5-ITC.                                  00720000
007210     MOVE RPTRNW2-AMOUNT TO P5-AMOUNT.                            00721000
007220     MOVE MIM-7111SIGN TO P5-SIGN.                                00722000
007230     MOVE ZEROS TO WS-SUB1.                                       00723000
007240 PTR-ACCUM-LOOP.                                                  00724000
007250     ADD +1 TO WS-SUB1.                                           00725000
007260     IF WS-SUB1 IS GREATER THAN +10                               00726000
007270         GO TO PTR-PRINT.                                         00727000
007280     IF WS-ACCUM-UPDATE-FLAG (WS-SUB1) IS EQUAL TO 'X'            00728000
007290         MOVE 'X' TO P5-ACCUM (WS-SUB1).                          00729000
007300     GO TO PTR-ACCUM-LOOP.                                        00730000
007310 PTR-PRINT.                                                       00731000
007320     PERFORM PR-01 THRU PR-EXIT.                                  00732000
007330 PTR-EXIT.                                                        00733000
007340     EXIT.                                                        00734000
007350******************************************************************00735000
007360 PRINT-TOTALS SECTION.                                            00736000
007370 PT-START.                                                        00737000
007380     IF WS-NUMOFREL IS EQUAL TO ZERO                              00738000
007390         GO TO PT-EXIT.                                           00739000
007400     IF (SR-LINES + 2) IS GREATER THAN SR-PAGE                    00740000
007410         PERFORM HEADING-ROUTINE.                                 00741000
007420     MOVE SPACES TO PLINE1.                                       00742000
007430     PERFORM PR-01 THRU PR-EXIT.                                  00743000
007440     MOVE 'INST' TO P7-INST-HDR.                                  00744000
007450     MOVE RPBNK-INST TO P7-INST.                                  00745000
007460     MOVE 'TOTAL RELATIONSHIPS ' TO P7-TOTAL-HDR.                 00746000
007470     MOVE WS-NUMOFREL TO P7-TOTAL.                                00747000
007480     PERFORM PR-01 THRU PR-EXIT.                                  00748000
007490     MOVE SPACES TO PLINE1.                                       00749000
007500     MOVE 'TOTAL TRANSACTIONS  ' TO P7-TOTAL-HDR.                 00750000
007510     MOVE WS-NUMOFTRANS TO P7-TOTAL.                              00751000
007520     PERFORM PR-01 THRU PR-EXIT.                                  00752000
007530     MOVE SPACES TO PLINE1.                                       00753000
007540     MOVE ZEROS TO WS-NUMOFREL.                                   00754000
007550     MOVE ZEROS TO WS-NUMOFTRANS.                                 00755000
007560 PT-EXIT.                                                         00756000
007570     EXIT.                                                        00757000
007580******************************************************************00758000
007590 EDIT-ACCOUNT SECTION.                                            00759000
000000 COPY RPP015.                                                     00760000
007610******************************************************************00761000
007620 CHANGE-BANK SECTION.                                             00762000
007630 CB-START.                                                        00763000
007640     MOVE 'R  ' TO SR-APIFUNC.                                    00764000
007650     MOVE RPMST-INST TO RPBNK-INST.                               00765000
007660     MOVE RPMST-INST TO WS-INST.                                  00766000
007670     PERFORM CALL-RPS-BNK.                                        00767000
007680     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00768000
007690         GO TO AR-0008.                                           00769000
007700     MOVE RPBNK-CURDT TO WS-CURDTYYYYMMDD.                        00770000
007710     MOVE WS-CURDTMM TO WS-DATEMM.                                00771000
007720     MOVE WS-CURDTDD TO WS-DATEDD.                                00772000
007730     MOVE WS-CURDTYYYY TO WS-DATEYYYY.                            00773000
007740     MOVE WS-DATEDDMMYYYY TO SR-TODAY.                            00774000
007750     IF RPBNK-INCH IS EQUAL TO '8'                                00775000
007760         MOVE +78 TO SR-PAGE                                      00776000
007770     ELSE                                                         00777000
007780         MOVE +58 TO SR-PAGE.                                     00778000
007790     MOVE SPACES TO MI1001-RECORD.                                00779000
007800     MOVE RPBNK-INST TO MIM-1001KINST.                            00780000
007810     MOVE +1001 TO MIM-1001KREC.                                  00781000
007820     MOVE MIC-MST-1001-PRI TO MIC-MST-REC-PRI.                    00782000
007830     MOVE MI1001-RECORD TO MIMST-RECORD.                          00783000
007840     PERFORM MIC-MST-GET-REQUEST.                                 00784000
007850     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00785000
007860         GO TO AR-0009.                                           00786000
007870     MOVE MIMST-RECORD TO MI1001-RECORD.                          00787000
007880     MOVE MIM-1001NAME TO SR-BKNAME.                              00788000
007890     MOVE MIM-1001KINST TO SR-INSTR.                              00789000
007900     MOVE 'RELATIONSHIP PRICING' TO SR-SYSTEM.                    00790000
007910     MOVE 'TRANSACTION ACCUMULATOR REPORT' TO SR-REPORT.          00791000
007920     MOVE 50202 TO SR-RPTNBR.                                     00792000
007930     MOVE SPACES TO PLINE1.                                       00793000
007940     MOVE +1 TO SR-PGCTR.                                         00794000
007950     PERFORM HEADING-ROUTINE.                                     00795000
007960 CB-REC2023.                                                      00796000
007970     MOVE RPBNK-INST TO WS-RPMIM2023INST.                         00797000
007980     PERFORM LOAD-RPS-2023.                                       00798000
007990     IF WS-RPMIM2023ERROR IS EQUAL TO 'Y'                         00799000
008000         GO TO AR-0010.                                           00800000
008010 CB-REC7100.                                                      00801000
008020     MOVE SPACES TO MI7100-RECORD.                                00802000
008030     MOVE RPBNK-INST TO MIM-7100KINST.                            00803000
008040     MOVE +7100 TO MIM-7100KREC.                                  00804000
008050     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00805000
008060     MOVE MI7100-RECORD TO MIMST-RECORD.                          00806000
008070     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00807000
008080     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00808000
008090         GO TO AR-0018.                                           00809000
008100     MOVE MIMST-RECORD TO MI7100-RECORD.                          00810000
008110 CB-REC7101.                                                      00811000
008120     MOVE RPBNK-INST TO WS-RPMIM7101INST.                         00812000
008130     COMPUTE WS-RPMIM7101EFFDT = RPBNK-CURDT - 99999999.          00813000
008140     PERFORM LOAD-RPS-7101.                                       00814000
008150     IF WS-RPMIM7101ERROR IS EQUAL TO 'Y'                         00815000
008160         GO TO AR-0011.                                           00816000
008170 CB-REC7102.                                                      00817000
008180     MOVE RPBNK-INST TO WS-RPMIM7102INST.                         00818000
008190     PERFORM LOAD-RPS-7102.                                       00819000
008200     IF WS-RPMIM7102ERROR IS EQUAL TO 'Y'                         00820000
008210         GO TO AR-0012.                                           00821000
008220 CB-REC7110.                                                      00822000
008230     MOVE RPBNK-INST TO WS-RPMIM7110INST.                         00823000
008240     PERFORM LOAD-RPS-7110.                                       00824000
008250     IF WS-RPMIM7110ERROR IS EQUAL TO 'Y'                         00825000
008260         GO TO AR-0013.                                           00826000
008270 CB-REC7111.                                                      00827000
008280     MOVE RPBNK-INST TO WS-RPMIM7111INST.                         00828000
008290     PERFORM LOAD-RPS-7111.                                       00829000
008300     IF WS-RPMIM7111ERROR IS EQUAL TO 'Y'                         00830000
008310         GO TO AR-0014.                                           00831000
008320 CB-REC0237.                                                      00832000
008330     MOVE SPACES TO MI0237-RECORD.                                00833000
008340     MOVE RPBNK-INST TO MIM-0237KINST.                            00834000
008350     MOVE +0237 TO MIM-0237KREC.                                  00835000
008360     MOVE 50 TO MIM-0237KPROCMGR.                                 00836000
008370     MOVE 47 TO MIM-0237KINTAPPL.                                 00837000
008380     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    00838000
008390     MOVE MI0237-RECORD TO MIMST-RECORD.                          00839000
008400     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00840000
008410     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00841000
008420         GO TO AR-0015.                                           00842000
008430     MOVE MIMST-RECORD TO MI0237-RECORD.                          00843000
008440     IF MIM-0237KINST IS NOT EQUAL TO RPBNK-INST                  00844000
008450         OR MIM-0237KPROCMGR IS NOT EQUAL TO 50                   00845000
008460         OR MIM-0237KINTAPPL IS NOT EQUAL TO 47                   00846000
008470         GO TO AR-0016.                                           00847000
008480     IF MIM-237BATINTFC IS EQUAL TO SPACES                        00848000
008490         GO TO AR-0017.                                           00849000
008500     MOVE MIM-237BATINTFC TO WS-RCIF-INTERFACE.                   00850000
008510 CB-EXIT.                                                         00851000
008520     EXIT.                                                        00852000
008530******************************************************************00853000
008540*MIC-MST-API SECTION.                                             00854000
000000 COPY MIPMSTA.                                                    00855000
008560******************************************************************00856000
008570 GET-FILE-ORGANIZATION SECTION.                                   00857000
000000 COPY SRP093.                                                     00858000
008590******************************************************************00859000
008600 CALL-RPS-BNK SECTION.                                            00860000
000000 COPY RPPBNKB.                                                    00861000
008620******************************************************************00862000
008630 CALL-RPS-MST SECTION.                                            00863000
000000 COPY RPPMSTB.                                                    00864000
008650******************************************************************00865000
008660 CALL-RPS-REL SECTION.                                            00866000
000000 COPY RPPRELB.                                                    00867000
008680******************************************************************00868000
008690 CALL-RPS-TRM SECTION.                                            00869000
000000 COPY RPPTRMB.                                                    00870000
008710******************************************************************00871000
008720 LOAD-RPS-2023 SECTION.                                           00872000
000000 COPY RPP2023.                                                    00873000
008740******************************************************************00874000
008750 LOAD-RPS-7101 SECTION.                                           00875000
000000 COPY RPP7101.                                                    00876000
008770******************************************************************00877000
008780 LOAD-RPS-7102 SECTION.                                           00878000
000000 COPY RPP7102.                                                    00879000
008800******************************************************************00880000
008810 LOAD-RPS-7110 SECTION.                                           00881000
000000 COPY RPP7110.                                                    00882000
008830******************************************************************00883000
008840 LOAD-RPS-7111 SECTION.                                           00884000
000000 COPY RPP7111.                                                    00885000
008860******************************************************************00886000
008870 SEARCH-RPS-2023 SECTION.                                         00887000
000000 COPY RPP2023S.                                                   00888000
008890******************************************************************00889000
008900 SEARCH-RPS-7101 SECTION.                                         00890000
000000 COPY RPP7101S.                                                   00891000
008920******************************************************************00892000
008930 SEARCH-RPS-7102 SECTION.                                         00893000
000000 COPY RPP7102S.                                                   00894000
008950******************************************************************00895000
008960 SEARCH-RPS-7110 SECTION.                                         00896000
000000 COPY RPP7110S.                                                   00897000
008980******************************************************************00898000
008990 SEARCH-RPS-7111 SECTION.                                         00899000
000000 COPY RPP7111S.                                                   00900000
009010******************************************************************00901000
009020 JULIAN-365 SECTION.                                              00902000
000000 COPY SRP001.                                                     00903000
009040******************************************************************00904000
009050 CALENDAR-365 SECTION.                                            00905000
000000 COPY SRP003.                                                     00906000
009070******************************************************************00907000
009080 ELAPSED-DAYS-365 SECTION.                                        00908000
000000 COPY SRP005.                                                     00909000
009100***************************************************************** 00910000
009110 NEXT-CODASYL-365 SECTION.                                        00911000
000000 COPY SRP088.                                                     00912000
009130******************************************************************00913000
009140 ELAPSED-MONTHS SECTION.                                          00914000
000000 COPY SRP101.                                                     00915000
009160******************************************************************00916000
009170 NEXT-DATE-365 SECTION.                                           00917000
000000 COPY SRP009.                                                     00918000
009190******************************************************************00919000
009200 NEXT-CYCLE-365 SECTION.                                          00920000
000000 COPY SRP022.                                                     00921000
009220******************************************************************00922000
009230 ACCOUNT-EDIT SECTION.                                            00923000
000000 COPY SRP033.                                                     00924000
009250******************************************************************00925000
009260 PRINT-SEGMENTATION SECTION.                                      00926000
000000 COPY SRP044.                                                     00927000
009280******************************************************************00928000
009290 PRINTER-ROUTINE SECTION.                                         00929000
000000 COPY SRP017.                                                     00930000
009310******************************************************************00931000
009320 HEADING-ROUTINE SECTION.                                         00932000
000000 COPY SRP016.                                                     00933000
009340 HR-DETAIL.                                                       00934000
009350     ADD +1 TO SR-PGCTR.                                          00935000
009360 HR-DEXIT.                                                        00936000
009370     EXIT.                                                        00937000
009380******************************************************************00938000
009390 ABORT-ROUTINE SECTION.                                           00939000
009400 AR-0001.                                                         00940000
009410     MOVE 1 TO WS-ABCODE.                                         00941000
009420     GO TO AR-MSG.                                                00942000
009430 AR-0002.                                                         00943000
009440     MOVE 2 TO WS-ABCODE.                                         00944000
009450     GO TO AR-MSG.                                                00945000
009460 AR-0003.                                                         00946000
009470     MOVE 3 TO WS-ABCODE.                                         00947000
009480     GO TO AR-MSG.                                                00948000
009490 AR-0004.                                                         00949000
009500     MOVE 4 TO WS-ABCODE.                                         00950000
009510     GO TO AR-MSG.                                                00951000
009520 AR-0005.                                                         00952000
009530     MOVE 5 TO WS-ABCODE.                                         00953000
009540     GO TO AR-MSG.                                                00954000
009550 AR-0006.                                                         00955000
009560     MOVE 6 TO WS-ABCODE.                                         00956000
009570     GO TO AR-MSG.                                                00957000
009580 AR-0007.                                                         00958000
009590     MOVE 7 TO WS-ABCODE.                                         00959000
009600     GO TO AR-MSG.                                                00960000
009610 AR-0008.                                                         00961000
009620     MOVE 8 TO WS-ABCODE.                                         00962000
009630     GO TO AR-MSG.                                                00963000
009640 AR-0009.                                                         00964000
009650     MOVE 9 TO WS-ABCODE.                                         00965000
009660     GO TO AR-MSG.                                                00966000
009670 AR-0010.                                                         00967000
009680     MOVE 10 TO WS-ABCODE.                                        00968000
009690     GO TO AR-MSG.                                                00969000
009700 AR-0011.                                                         00970000
009710     MOVE 11 TO WS-ABCODE.                                        00971000
009720     GO TO AR-MSG.                                                00972000
009730 AR-0012.                                                         00973000
009740     MOVE 12 TO WS-ABCODE.                                        00974000
009750     GO TO AR-MSG.                                                00975000
009760 AR-0013.                                                         00976000
009770     MOVE 13 TO WS-ABCODE.                                        00977000
009780     GO TO AR-MSG.                                                00978000
009790 AR-0014.                                                         00979000
009800     MOVE 14 TO WS-ABCODE.                                        00980000
009810     GO TO AR-MSG.                                                00981000
009820 AR-0015.                                                         00982000
009830     MOVE 15 TO WS-ABCODE.                                        00983000
009840     GO TO AR-MSG.                                                00984000
009850 AR-0016.                                                         00985000
009860     MOVE 16 TO WS-ABCODE.                                        00986000
009870     GO TO AR-MSG.                                                00987000
009880 AR-0017.                                                         00988000
009890     MOVE 17 TO WS-ABCODE.                                        00989000
009900     GO TO AR-MSG.                                                00990000
009910 AR-0018.                                                         00991000
009920     MOVE 18 TO WS-ABCODE.                                        00992000
009930     GO TO AR-MSG.                                                00993000
009940 AR-MSG.                                                          00994000
009950     MOVE WS-FUNCTION TO WS-ABFC.                                 00995000
009960 AR-PRINT.                                                        00996000
000000 COPY SRP029.                                                     00997000
009980******************************************************************00998000
009990 END-ROUTINE SECTION.                                             00999000
010000 ER-START.                                                        01000000
010010     CLOSE PRINTERFIL.                                            01001000
010020     CLOSE RP-TRNW2FIL.                                           01002000
010030     MOVE 'GC ' TO SR-APIFUNC.                                    01003000
010040     PERFORM CALL-RPS-BNK.                                        01004000
010050     STOP RUN.                                                    01005000
