000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPD200.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*                                                                *00005000
000060*    RPD200 - RELATIONSHIP PRICING INCENTIVE POSTING             *00006000
000070*                                                                *00007000
000080******************************************************************00008000
000090 ENVIRONMENT DIVISION.                                            00009000
000100 CONFIGURATION SECTION.                                           00010000
000110 SPECIAL-NAMES.                                                   00011000
000120     C01 IS C-01, C02 IS C-02, C03 IS C-03.                       00012000
000130 INPUT-OUTPUT SECTION.                                            00013000
000140 FILE-CONTROL.                                                    00014000
000000 COPY RPACTWS.                                                    00015000
000000 COPY RPCRWWS.                                                    00016000
000000 COPY RPPODXS.                                                    00017000
000180 DATA DIVISION.                                                   00018000
000190 FILE SECTION.                                                    00019000
000000 COPY RPACTWF.                                                    00020000
000210 01  RP-ACTWREC.                                                  00021000
000000 COPY RPSACTW.                                                    00022000
000000 COPY RPCRWWF.                                                    00023000
000240 01  RPCRWW-RECORD.                                               00024000
000000 COPY RPSCRWW.                                                    00025000
000000 COPY RPPODXF.                                                    00026000
000270 01  RPPODX-RECORD.                                               00027000
000000 COPY RPSPODX.                                                    00028000
000290****************************************************************  00029000
000300* NOTE: IF DEPOSITS 8.1 IS BEING USED:                         *  00030000
000310*       USE COPYBOOK RPSPODX1 INSTEAD OF RPSPODX               *  00031000
000320****************************************************************  00032000
000330 WORKING-STORAGE SECTION.                                         00033000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00034000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00034001
000350 01  RPS-RLSELIT.                                                 00035000
000000 COPY RPWRLSE.                                                    00036000
000370 01  MIC-RLSELIT.                                                 00037000
000000 COPY MIWRLSE.                                                    00038000
000390 01  RPWPRI-AREAS.                                                00039000
000000 COPY RPWPRI.                                                     00040000
000410 01  MIWPRI-AREAS.                                                00041000
000000 COPY MIWPRI.                                                     00042000
000430 01  SRW105-AREAS.                                                00043000
000000 COPY SRW105.                                                     00044000
000450*01  BICPBPRM.                                                    00045000
000000 COPY BICPBPRM.                                                   00046000
000470*01  BICRSRB.                                                     00047000
000000 COPY BICRSRB.                                                    00048000
000490*01  BICRPSB.                                                     00049000
000000 COPY BICRPSB.                                                    00050000
000510*01  BICRVERB.                                                    00051000
000000 COPY BICRVERB.                                                   00052000
000530*01  BICRSTAT.                                                    00053000
000000 COPY BICRSTAT.                                                   00054000
000550*01  BICRDBS.                                                     00055000
000000 COPY BICRDBS.                                                    00056000
000570 01  RPBNK-RECORD.                                                00057000
000000 COPY RPSBNK.                                                     00058000
000590 01  RPCRW-RECORD.                                                00059000
000000 COPY RPSCRW.                                                     00060000
000610 01  RPEVT-RECORD.                                                00061000
000000 COPY RPSEVT.                                                     00062000
000630 01  RPINT-RECORD.                                                00063000
000000 COPY RPSINT.                                                     00064000
000650 01  RPMST-RECORD.                                                00065000
000000 COPY RPSMST.                                                     00066000
000670 01  RPREL-RECORD.                                                00067000
000000 COPY RPSREL.                                                     00068000
000690 01  RPTRM-RECORD.                                                00069000
000000 COPY RPSTRM.                                                     00070000
000710 01  RPRPTS-RECORD.                                               00071000
000000 COPY RPSRPTS.                                                    00072000
000730 01  RPBNKA-AREA.                                                 00073000
000000 COPY RPWBNKA.                                                    00074000
000750 01  RPCRWA-AREA.                                                 00075000
000000 COPY RPWCRWA.                                                    00076000
000770 01  RPEVTA-AREA.                                                 00077000
000000 COPY RPWEVTA.                                                    00078000
000790 01  RPINTA-AREA.                                                 00079000
000000 COPY RPWINTA.                                                    00080000
000810 01  RPMSTA-AREA.                                                 00081000
000000 COPY RPWMSTA.                                                    00082000
000830 01  RPRELA-AREA.                                                 00083000
000000 COPY RPWRELA.                                                    00084000
000850 01  RPTRMA-AREA.                                                 00085000
000000 COPY RPWTRMA.                                                    00086000
000870 01  RPRPTSA-RECORD.                                              00087000
000000 COPY RPWRPTS.                                                    00088000
000890 01  FILLER                      PIC X(08)       VALUE '*MISMST*'.00089000
000900 01  MIMST-RECORD.                                                00090000
000000 COPY MISMST.                                                     00091000
000920 01  FILLER                      PIC X(08)       VALUE '*MI0237*'.00092000
000930 01  MI0237-RECORD.                                               00093000
000000 COPY MIS0237A.                                                   00094000
000950 01  FILLER                      PIC X(08)       VALUE '*MI0307*'.00095000
000960 01  MI0307-RECORD.                                               00096000
000000 COPY MIS0307A.                                                   00097000
000980 01  FILLER                      PIC X(08)       VALUE '*MI2011*'.00098000
000990 01  MI2011-RECORD.                                               00099000
000000 COPY MIS2011A.                                                   00100000
001010 01  FILLER                      PIC X(08)       VALUE '*MI2023*'.00101000
001020 01  MI2023-RECORD.                                               00102000
000000 COPY MIS2023A.                                                   00103000
001040 01  FILLER                      PIC X(08)       VALUE '*MI7100*'.00104000
001050 01  MI7100-RECORD.                                               00105000
000000 COPY MIS7100.                                                    00106000
001070 01  FILLER                      PIC X(08)       VALUE '*MI7101*'.00107000
001080 01  MI7101-RECORD.                                               00108000
000000 COPY MIS7101.                                                    00109000
001100 01  FILLER                      PIC X(08)       VALUE '*MI7102*'.00110000
001110 01  MI7102-RECORD.                                               00111000
000000 COPY MIS7102.                                                    00112000
001130 01  FILLER                      PIC X(08)       VALUE '*MI7103*'.00113000
001140 01  MI7103-RECORD.                                               00114000
000000 COPY MIS7103.                                                    00115000
001160 01  FILLER                      PIC X(08)       VALUE '*MI7106*'.00116000
001170 01  MI7106-RECORD.                                               00117000
000000 COPY MIS7106.                                                    00118000
001190 01  FILLER                      PIC X(08)       VALUE '*MI7109*'.00119000
001200 01  MI7109-RECORD.                                               00120000
000000 COPY MIS7109.                                                    00121000
001220 01  FILLER                      PIC X(08)       VALUE '*MI7110*'.00122000
001230 01  MI7110-RECORD.                                               00123000
000000 COPY MIS7110.                                                    00124000
001250 01  FILLER                      PIC X(08)       VALUE '*MI7112*'.00125000
001260 01  MI7112-RECORD.                                               00126000
000000 COPY MIS7112.                                                    00127000
001280 01  FILLER                      PIC X(08)       VALUE '*MI7113*'.00128000
001290 01  MI7113-RECORD.                                               00129000
000000 COPY MIS7113.                                                    00130000
001310 01  FILLER                      PIC X(08)       VALUE '*MI7113*'.00131000
001320 01  MI7114-RECORD.                                               00132000
000000 COPY MIS7114.                                                    00133000
001340 01  MIWMSTA-AREAS.                                               00134000
000000 COPY MIWMSTA.                                                    00135000
001360***************************************************************** 00136000
001370 01  WS-LINKRCIF.                                                 00137000
000000 COPY MISCNT00      REPLACING                                     00138000
001390     ==:MICNT:== BY ==RPRF21==.                                   00139000
000000 COPY RPSRF21.                                                    00140000
001410     03  WS-RETURNED-OBJECT                                       00141000
001420                         REDEFINES RPRF21-RETURNED-OBJECT.        00142000
001430         05  FILLER              PIC X(52).                       00143000
001440         05  WS-RO-STATUS        PIC X(01).                       00144000
001450         05  WS-RO-NAME          PIC X(40).                       00145000
001460         05  FILLER              PIC X(907).                      00146000
001470***************************************************************** 00147000
001480 01  SRW000-AREAS.                                                00148000
000000 COPY SRW000.                                                     00149000
001500 01  SRW009-AREAS.                                                00150000
000000 COPY SRW009.                                                     00151000
001520 01  SRW015-AREAS.                                                00152000
000000 COPY SRW015.                                                     00153000
001540 01  SRW022-AREAS.                                                00154000
000000 COPY SRW022.                                                     00155000
001560 01  WS-ABEND.                                                    00156000
000000 COPY SRW028.                                                     00157000
001580 01  SRW033-AREAS.                                                00158000
000000 COPY SRW033.                                                     00159000
001600 01  SRW044-AREAS.                                                00160000
000000 COPY SRW044.                                                     00161000
001620 01  SRW060-AREAS.                                                00162000
000000 COPY SRW060.                                                     00163000
001640 01  RPW015-AREAS.                                                00164000
000000 COPY RPW015.                                                     00165000
001660 01  WS-RPMIM2023AREAS.                                           00166000
000000 COPY RPW2023.                                                    00167000
001680 01  WS-RPMIM7101AREAS.                                           00168000
000000 COPY RPW7101.                                                    00169000
001700 01  WS-RPMIM7102AREAS.                                           00170000
000000 COPY RPW7102.                                                    00171000
001720 01  WS-RPMIM7103AREAS.                                           00172000
000000 COPY RPW7103.                                                    00173000
001740 01  WS-RPMIM7106AREAS.                                           00174000
000000 COPY RPW7106.                                                    00175000
001760 01  WS-RPMIM7109AREAS.                                           00176000
000000 COPY RPW7109.                                                    00177000
001780 01  WS-RPMIM7110AREAS.                                           00178000
000000 COPY RPW7110.                                                    00179000
001800 01  WS-RPMIM7112AREAS.                                           00180000
000000 COPY RPW7112.                                                    00181000
001820 01  WS-RPMIM7113AREAS.                                           00182000
000000 COPY RPW7113.                                                    00183000
001840 01  WS-RPMIM7114AREAS.                                           00184000
000000 COPY RPW7114.                                                    00185000
001860 01  WS-STORAGE.                                                  00186000
001870     03  FILLER                  PIC X(18)       VALUE            00187000
001880         '*** WS-STORAGE ***'.                                    00188000
001890     03  WS-FUNC                 PIC X(01)       VALUE SPACES.    00189000
001900     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00190000
001910     03  WS-2011-MSGNBR          PIC X(05)       VALUE SPACES.    00191000
001920     03  WS-2011-ERROR.                                           00192000
001930         05  FILLER              PIC X(08)       VALUE            00193000
001940             'MESSAGE '.                                          00194000
001950         05  WS-2011-ERRORNBR    PIC X(05)       VALUE SPACES.    00195000
001960         05  FILLER              PIC X(22)       VALUE            00196000
001970              ' NOT ON FILE          '.                           00197000
001980     03  WS-MESSAGE              PIC X(35)       VALUE SPACES.    00198000
001990     03  WS-7101COMBBALCD1       PIC 9(02)       VALUE ZEROS.     00199000
002000     03  WS-7101COMBBALREQ1      PIC S9(13)V99   COMP-3           00200000
002010                                                 VALUE ZEROS.     00201000
002020     03  WS-7101COMBBALCD2       PIC 9(02)       VALUE ZEROS.     00202000
002030     03  WS-7101COMBBALREQ2      PIC S9(13)V99   COMP-3           00203000
002040                                                 VALUE ZEROS.     00204000
002050     03  WS-7101COMBBALCD3       PIC 9(02)       VALUE ZEROS.     00205000
002060     03  WS-7101COMBBALREQ3      PIC S9(13)V99   COMP-3           00206000
002070                                                 VALUE ZEROS.     00207000
002080     03  WS-7101COMBBALCD4       PIC 9(02)       VALUE ZEROS.     00208000
002090     03  WS-7101COMBBALREQ4      PIC S9(13)V99   COMP-3           00209000
002100                                                 VALUE ZEROS.     00210000
002110     03  WS-PRIMCATBAL           PIC S9(13)V99   COMP-3           00211000
002120                                                 VALUE ZEROS.     00212000
002130     03  WS-SECCATBAL            PIC S9(13)V99   COMP-3           00213000
002140                                                 VALUE ZEROS.     00214000
002150     03  WS-COMBINEBAL1          PIC S9(15)V99   COMP-3           00215000
002160                                                 VALUE ZEROS.     00216000
002170     03  WS-COMBINEBAL2          PIC S9(15)V99   COMP-3           00217000
002180                                                 VALUE ZEROS.     00218000
002190     03  WS-COMBINEBAL3          PIC S9(15)V99   COMP-3           00219000
002200                                                 VALUE ZEROS.     00220000
002210     03  WS-COMBINEBAL4          PIC S9(15)V99   COMP-3           00221000
002220                                                 VALUE ZEROS.     00222000
002230     03  WS-RCIF-INTERFACE       PIC X(08)       VALUE SPACES.    00223000
002240     03  WS-RELATIONSHIP-TABLE.                                   00224000
002250         05  WS-REL-INFO                         OCCURS           00225000
002260                                                 1000 TIMES.      00226000
002270             07  WS-REL-INST     PIC 9(04).                       00227000
002280             07  WS-REL-INST2    PIC 9(04).                       00228000
002290             07  WS-REL-PRODCODE PIC X(06).                       00229000
002300             07  WS-REL-ACCOUNT  PIC X(18).                       00230000
002310             07  WS-REL-BRANCH   PIC S9(05)      COMP-3.          00231000
002320             07  WS-REL-ACCT-TYPE                                 00232000
002330                                 PIC S9(03)      COMP-3.          00233000
002340             07  WS-REL-TERM     pic S9(05)      COMP-3.          00234000
002350             07  WS-REL-NAME     PIC X(40).                       00235000
002360             07  WS-REL-APPL     PIC 9(02).                       00236000
002370             07  WS-REL-SCINCOPT                                  00237000
002380                                 PIC X(01).                       00238000
002390             07  WS-REL-SCDISCAMT                                 00239000
002400                                 PIC S9(03)V99   COMP-3.          00240000
002410             07  WS-REL-SCDISCPCT                                 00241000
002420                                 PIC SV9(05)     COMP-3.          00242000
002430             07  WS-REL-SCCATCODE                                 00243000
002440                                 PIC X(06).                       00244000
002450             07  WS-REL-DISCAMT-OVRD-FLAG                         00245000
002460                                 PIC X(01).                       00246000
002470             07  WS-REL-DISCPCT-OVRD-FLAG                         00247000
002480                                 PIC X(01).                       00248000
002490             07  WS-REL-DISCAMT-OVRD                              00249000
002500                                 PIC S9(03)V99   COMP-3.          00250000
002510             07  WS-REL-DISCPCT-OVRD                              00251000
002520                                 PIC SV9(05)     COMP-3.          00252000
002530             07  WS-REL-RATEINCOPT                                00253000
002540                                 PIC X(01).                       00254000
002550             07  WS-REL-RATEOPTION                                00255000
002560                                 PIC X(01).                       00256000
002570             07  WS-REL-RATETYPE PIC X(01).                       00257000
P0167              07  WS-REL-RATEBALCODE                               00257300
P0167                                  PIC 9(02).                       00257600
002580             07  WS-REL-RATEPCT  PIC SV9(09)     COMP-3.          00258000
002590             07  WS-REL-RATECATCODE                               00259000
002600                                 PIC X(06).                       00260000
002610             07  WS-REL-TIMEPROCOPT                               00261000
002620                                 PIC X(01).                       00262000
002630             07  WS-REL-RATEPCT-OVRD-FLAG                         00263000
002640                                 PIC X(01).                       00264000
002650             07  WS-REL-RATEPCT-OVRD                              00265000
002660                                 PIC SV9(05)     COMP-3.          00266000
002670             07  WS-REL-ACCTDEL  PIC X(01).                       00267000
002680             07  WS-REL-PRIMCATCODE                               00268000
002690                                 PIC X(06).                       00269000
002700             07  WS-REL-PRIMBAL  PIC S9(13)V99   COMP-3.          00270000
002710             07  WS-REL-PRIMBALREQ                                00271000
002720                                 PIC S9(13)V99   COMP-3.          00272000
002730             07  WS-REL-BALCATCODE1                               00273000
002740                                 PIC X(06).                       00274000
002750             07  WS-REL-BAL1     PIC S9(13)V99   COMP-3.          00275000
002760             07  WS-REL-BALREQ1  PIC S9(13)V99   COMP-3.          00276000
002770             07  WS-REL-BALCATCODE2                               00277000
002780                                 PIC X(06).                       00278000
002790             07  WS-REL-BAL2     PIC S9(13)V99   COMP-3.          00279000
002800             07  WS-REL-BALREQ2  PIC S9(13)V99   COMP-3.          00280000
002810             07  WS-REL-ACCTRATEBAL                               00281000
002820                                 PIC S9(13)V99   COMP-3.          00282000
002830             07  WS-REL-SCBAL    PIC S9(13)V99   COMP-3.          00283000
002840             07  WS-REL-SECSVCBAL                                 00284000
002850                                 PIC S9(13)V99   COMP-3.          00285000
002860             07  WS-REL-SECSVCPLAN                                00286000
002870                                 PIC X(06).                       00287000
002880             07  WS-REL-SECSVCTABLE                               00288000
002890                                 PIC X(06).                       00289000
002900             07  WS-REL-ACCT-STATUS                               00290000
002910                                 PIC X(01).                       00291000
002920             07  WS-REL-SEC-SERVICE                               00292000
002930                                 PIC X(01).                       00293000
002940             07  WS-REL-SECSVCOPT                                 00294000
002950                                 PIC X(01).                       00295000
002960             07  WS-REL-BONUSRATEOPT                              00296000
002970                                 PIC X(01).                       00297000
002980             07  WS-REL-MSG-TABLE                OCCURS 5 TIMES.  00298000
002990                 09  WS-REL-MSG  PIC 9(04).                       00299000
003000                 09  WS-REL-MSGNBR                                00300000
003010                                 PIC S9(03)      COMP-3.          00301000
003020     03  WS-REL-MAX              PIC S9(04)      COMP             00302000
003030                                                 VALUE +1000.     00303000
003040     03  WS-CURDTYYYYMMDD        PIC 9(08)       VALUE ZEROS.     00304000
003050     03  FILLER          REDEFINES WS-CURDTYYYYMMDD.              00305000
003060         05  WS-CURDTYYYY        PIC 9(04).                       00306000
003070         05  WS-CURDTMMDD        PIC 9(04).                       00307000
003080         05  FILLER      REDEFINES WS-CURDTMMDD.                  00308000
003090             07  WS-CURDTMM      PIC 9(02).                       00309000
003100             07  WS-CURDTDD      PIC 9(02).                       00310000
003110     03  WS-DATEMMDDYYYY         PIC 9(08)       VALUE ZEROS.     00311000
003120     03  FILLER          REDEFINES WS-DATEMMDDYYYY.               00312000
003130         05  WS-DATEMM           PIC 9(02).                       00313000
003140         05  WS-DATEDD           PIC 9(02).                       00314000
003150         05  WS-DATEYYYY         PIC 9(04).                       00315000
003160     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00316000
003170     03  FILLER          REDEFINES WS-PDATE.                      00317000
003180         05  WS-PDATE-YYYY       PIC 9(04).                       00318000
003190         05  WS-PDATE-MM         PIC 9(02).                       00319000
003200         05  WS-PDATE-DD         PIC 9(02).                       00320000
003210     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00321000
003220     03  FILLER          REDEFINES WS-CURDATE.                    00322000
003230         05  WS-CURMM            PIC 9(02).                       00323000
003240         05  WS-CURDD            PIC 9(02).                       00324000
003250         05  WS-CURYYYY          PIC 9(04).                       00325000
003260     03  WS-LINES                PIC S9(03)      COMP-3           00326000
003270                                                 VALUE +0.        00327000
003280     03  WS-SUB1                 PIC S9(04)      COMP             00328000
003290                                                 VALUE +0.        00329000
003300     03  WS-SUB2                 PIC S9(04)      COMP             00330000
003310                                                 VALUE +0.        00331000
003320     03  WS-SUB3                 PIC S9(04)      COMP             00332000
003330                                                 VALUE +0.        00333000
003340     03  WS-SUB4                 PIC S9(04)      COMP             00334000
003350                                                 VALUE +0.        00335000
003360     03  WS-7114-SUB             PIC S9(04)      COMP             00336000
003370                                                 VALUE +0.        00337000
003380     03  WS-PRIMMSG-SUB          PIC S9(04)      COMP             00338000
003390                                                 VALUE +0.        00339000
003400     03  WS-SUBSEC               PIC S9(04)      COMP             00340000
003410                                                 VALUE +0.        00341000
003420     03  WS-TASUB1               PIC S9(04)      COMP             00342000
003430                                                 VALUE +0.        00343000
003440     03  WS-TASUB2               PIC S9(04)      COMP             00344000
003450                                                 VALUE +0.        00345000
003460     03  WS-SUB7113              PIC S9(04)      COMP             00346000
003470                                                 VALUE +0.        00347000
003480     03  WS-SUBACTW              PIC S9(04)      COMP             00348000
003490                                                 VALUE +0.        00349000
003500     03  WS-IQ-MSGNBR            PIC 9(04)       VALUE ZEROS.     00350000
003510     03  WS-TRAN-VAL-SW          PIC 9(01)       VALUE ZEROS.     00351000
003520     03  WS-QUAL-FLAG            PIC X(01)       VALUE SPACES.    00352000
003530     03  WS-RPMST-QUAL-STAT      PIC X(01)       VALUE SPACES.    00353000
003540     03  WS-REL-STATUS           PIC X(01)       VALUE SPACES.    00354000
003550     03  WS-PRIMCATCD-I          PIC X(01)       VALUE SPACES.    00355000
003560     03  WS-PRIM-INVALID-FLAG    PIC X(01)       VALUE SPACES.    00356000
003570     03  WS-RELACCT-OR-FLAG      PIC X(01)       VALUE SPACES.    00357000
003580     03  WS-COMBCATCD1-FLAG      PIC X(01)       VALUE SPACES.    00358000
003590     03  WS-COMBCATCD2-FLAG      PIC X(01)       VALUE SPACES.    00359000
003600     03  WS-COMBCATCD3-FLAG      PIC X(01)       VALUE SPACES.    00360000
003610     03  WS-COMBCATCD4-FLAG      PIC X(01)       VALUE SPACES.    00361000
003620     03  WS-COMBBAL-FAIL         PIC X(01)       VALUE SPACES.    00362000
003630     03  WS-PRODMOD-FAIL         PIC X(01)       VALUE SPACES.    00363000
003640     03  WS-PROCOPT-FLAG         PIC X(01)       VALUE SPACES.    00364000
003650     03  WS-MICM-NTFND           PIC X(01)       VALUE SPACES.    00365000
003660     03  WS-BALQUAL-FLAG         PIC X(01)       VALUE SPACES.    00366000
003670     03  WS-PRIMBAL-FLAG         PIC X(01)       VALUE SPACES.    00367000
003680     03  WS-ACCTREL-FLAG         PIC X(01)       VALUE SPACES.    00368000
003690     03  WS-ACCTALL-FLAG         PIC X(01)       VALUE SPACES.    00369000
003700     03  WS-BAL-VAL-SW           PIC X(01)       VALUE SPACES.    00370000
003710     03  WS-PRINT-REL-FLAG       PIC X(01)       VALUE 'N'.       00371000
003720     03  WS-REPORT-SW            PIC X(01)       VALUE SPACES.    00372000
003730     03  WS-BAL-RPT-SW           PIC X(01)       VALUE SPACES.    00373000
003740     03  WS-BAL1-RPT-SW          PIC X(01)       VALUE SPACES.    00374000
003750     03  WS-BAL2-RPT-SW          PIC X(01)       VALUE SPACES.    00375000
003760     03  WS-BAL3-RPT-SW          PIC X(01)       VALUE SPACES.    00376000
003770     03  WS-BAL4-RPT-SW          PIC X(01)       VALUE SPACES.    00377000
003780     03  WS-BAL5-RPT-SW          PIC X(01)       VALUE SPACES.    00378000
003790     03  WS-BAL6-RPT-SW          PIC X(01)       VALUE SPACES.    00379000
003800     03  WS-PROCESS-AREA         PIC X(01)       VALUE SPACES.    00380000
003810     03  WS-7102-FOUND           PIC X(01)       VALUE 'N'.       00381000
003820     03  WS-TRM-FOUND            PIC X(01)       VALUE 'N'.       00382000
003830     03  WS-APPL                 PIC 9(02)       VALUE ZEROS.     00383000
003840     03  WS-INST                 PIC 9(04)       VALUE ZEROS.     00384000
003850     03  WS-PRODCODE             PIC X(06)       VALUE SPACES.    00385000
003860     03  WS-ACCOUNT              PIC X(18)       VALUE SPACES.    00386000
003870     03  WS-PRIM-SCNXT           PIC S9(09)      COMP-3           00387000
003880                                                 VALUE ZEROS.     00388000
003890     03  WS-PRIM-SCTODAYFLAG     PIC X(01)       VALUE 'N'.       00389000
003900     03  WS-PRINT-SW             PIC X(01)       VALUE 'P'.       00390000
003910     03  WS-MODEL-REQS           PIC X(01)       VALUE 'N'.       00391000
003920     03  WS-MINACCTS             PIC S9(03)      COMP-3           00392000
003930                                                 VALUE ZEROS.     00393000
003940     03  WS-MAXSECACCTS          PIC S9(03)      COMP-3           00394000
003950                                                 VALUE ZEROS.     00395000
003960     03  WS-WORK-APPL            PIC 9(02)       VALUE ZEROS.     00396000
003970     03  WS-WORK-BALCD           PIC 9(02)       VALUE ZEROS.     00397000
003980     03  WS-WORK-BALANCE         PIC S9(13)V99   COMP-3           00398000
003990                                                 VALUE ZEROS.     00399000
004000     03  WS-RATE-BAL             PIC S9(13)V99   COMP-3           00400000
004010                                                 VALUE ZEROS.     00401000
004020     03  WS-RATE-PCT             PIC SV9(05)     COMP-3           00402000
004030                                                 VALUE ZEROS.     00403000
004040     03  WS-TERM                 PIC S9(05)      COMP-3           00404000
004050                                                 VALUE ZEROS.     00405000
004060     03  WS-SC-BAL               PIC S9(13)V99   COMP-3           00406000
004070                                                 VALUE ZEROS.     00407000
004080     03  WS-DISCOUNT-AMT         PIC S9(03)V99   COMP-3           00408000
004090                                                 VALUE ZEROS.     00409000
004100     03  WS-DISCOUNT-PCT         PIC SV9(05)     COMP-3           00410000
004110                                                 VALUE ZEROS.     00411000
004120     03  WS-SECSVC-BAL           PIC S9(13)V99   COMP-3           00412000
004130                                                 VALUE ZEROS.     00413000
004140     03  WS-SECSVCPLAN           PIC X(06)       VALUE SPACES.    00414000
004150     03  WS-LAST-PRODCD          PIC X(06)       VALUE SPACES.    00415000
004160     03  WS-CNT-WRITE            PIC S9(05)      COMP-3           00416000
004170                                                 VALUE ZEROS.     00417000
004180     03  WS-NUMOFREL             PIC S9(05)      COMP-3           00418000
004190                                                 VALUE ZEROS.     00419000
004200     03  WS-NUMOFRELNOTQUAL      PIC S9(05)      COMP-3           00420000
004210                                                 VALUE ZEROS.     00421000
004220     03  WS-NUMOFACTIVE          PIC S9(05)      COMP-3           00422000
004230                                                 VALUE ZEROS.     00423000
004240     03  WS-NUMOFINACTIVE        PIC S9(05)      COMP-3           00424000
004250                                                 VALUE ZEROS.     00425000
004260     03  WS-NUMOFEXPIRED         PIC S9(05)      COMP-3           00426000
004270                                                 VALUE ZEROS.     00427000
004280     03  WS-NUMOFEXPTODAY        PIC S9(05)      COMP-3           00428000
004290                                                 VALUE ZEROS.     00429000
004300     03  WS-NUMOFRELDEL          PIC S9(05)      COMP-3           00430000
004310                                                 VALUE ZEROS.     00431000
004320     03  WS-NUMOFACCTDEL         PIC S9(05)      COMP-3           00432000
004330                                                 VALUE ZEROS.     00433000
004340     03  WS-NUMOFFAILED          PIC S9(13)      COMP-3           00434000
004350                                                 VALUE ZEROS.     00435000
004360     03  WS-NUMOFSUCCESS         PIC S9(13)      COMP-3           00436000
004370                                                 VALUE ZEROS.     00437000
004380     03  WS-CASH-REWARDS.                                         00438000
004390         05  WS-HAVE-CRW         PIC X(01)       VALUE 'N'.       00439000
004400         05  WS-CRW-MONTH        PIC 9(02)       VALUE ZEROS.     00440000
004410         05  WS-WORK-MONTH       PIC 9(02)       VALUE ZEROS.     00441000
004420         05  WS-CRW-ACCTX.                                        00442000
004430             07  WS-CRW-ACCT     PIC 9(18)       VALUE ZEROS.     00443000
004440         05  WS-CRW-NUM-OF-MONTHS                                 00444000
004450                                 PIC S9(07)      COMP-3           00445000
004460                                                 VALUE ZEROS.     00446000
004470         05  WS-CRW-CURDT-JUL    PIC S9(07)      COMP-3           00447000
004480                                                 VALUE ZEROS.     00448000
004490         05  WS-CRW-AMT          PIC S9(09)V99   COMP-3           00449000
004500                                                 VALUE ZEROS.     00450000
004510         05  WS-CRW-COMBBAL      PIC S9(13)V99   COMP-3           00451000
004520                                                 VALUE ZEROS.     00452000
004530         05  WS-CRW-CALC-BAL     PIC S9(15)V99   COMP-3           00453000
004540                                                 VALUE ZEROS.     00454000
004550         05  WS-CRW-WORK-BAL     PIC S9(15)V99   COMP-3           00455000
004560                                                 VALUE ZEROS.     00456000
004570     03  WS-CRWINST              PIC 9(04)       VALUE ZEROS.     00457000
004580     03  WS-CRWPRODCD            PIC X(06)       VALUE SPACES.    00458000
004590     03  WS-CRWACCT              PIC X(18)       VALUE SPACES.    00459000
004600     03  WS-RELSPROCESSED        PIC S9(05)      COMP-3           00460000
004610                                                 VALUE ZEROS.     00461000
004620     03  WS-ALLSW                PIC X(01)       VALUE SPACES.    00462000
004630     03  WS-INST-SW              PIC X(01)       VALUE SPACES.    00463000
004640     03  WS-DEFAULT-SWITCH       PIC X(01)       VALUE SPACES.    00464000
004650     03  WS-DEFAULT-REC          PIC X(80)       VALUE SPACES.    00465000
004660     03  WS-SAVE-CDTBLE.                                          00466000
004670         05  WS-SAVE-CDREC       PIC X(80)       OCCURS           00467000
004680                                                 9999 TIMES.      00468000
004690     03  WS-RRPTCTL.                                              00469000
004700         05  FILLER              PIC X(04).                       00470000
004710         05  WS-RRPTPFC          PIC X(01)       VALUE SPACES.    00471000
004720     03  WS-RRPTCTL1.                                             00472000
004730         05  FILLER              PIC X(04).                       00473000
004740         05  WS-RRPTPFC1         PIC X(01)       VALUE SPACES.    00474000
004750     03  WS-RRPTCTL2.                                             00475000
004760         05  FILLER              PIC X(04).                       00476000
004770         05  WS-RRPTPFC2         PIC X(01)       VALUE SPACES.    00477000
004780     03  WS-EXPIRED              PIC X(01)       VALUE SPACES.    00478000
004790     03  WS-EXPIRED-FLAG         PIC X(01)       VALUE SPACES.    00479000
004800     03  WS-EXPIRED-TODAY        PIC X(01)       VALUE SPACES.    00480000
004810     03  WS-EXPIRATION-DATE      PIC S9(09)      COMP-3.          00481000
004820     03  WS-DEFAULT-MODEL        PIC X(10)       VALUE ZEROS.     00482000
004830     03  WS-7101-HOLD-RECORD     PIC X(200)      VALUE SPACES.    00483000
004840     03  WSRPTS-RECORD           PIC X(249)      VALUE SPACES.    00484000
004850     03  WS-MST-COUNT            PIC 9(05)       VALUE 4999.      00485000
004860     03  WS-SYNCPOINTNBR         PIC 9(05)       VALUE 5000.      00486000
004870     03  WS-FORMAT-TIMEX         PIC 99,99,99,99.                 00487000
004880     03  WS-FORMAT-TIME  REDEFINES WS-FORMAT-TIMEX.               00488000
004890         05  FILLER              PIC 9(02).                       00489000
004900         05  WS-LIT1             PIC X(01).                       00490000
004910         05  FILLER              PIC 9(02).                       00491000
004920         05  WS-LIT2             PIC X(01).                       00492000
004930         05  FILLER              PIC 9(02).                       00493000
004940         05  WS-LIT3             PIC X(01).                       00494000
004950         05  FILLER              PIC 9(02).                       00495000
004960     03  WS-TRANSFER-MESSAGE.                                     00496000
004970         05  FILLER              PIC X(20)       VALUE            00497000
004980         'Transfer from model '.                                  00498000
004990         05  WS-TF-MODEL         PIC 9(05).                       00499000
005000         05  FILLER              PIC X(04)       VALUE ' to '.    00500000
005010         05  WS-TT-MODEL         PIC 9(05).                       00501000
005020         05  FILLER              PIC X(01)       VALUE SPACES.    00502000
005030 01  WS-CURRENT-DATE-FIELDS.                                      00503000
005040     03  WS-CURRENT-DATE         PIC 9(08).                       00504000
005050     03  WS-CURRENT-TIME         PIC 9(08).                       00505000
005060     03  WS-DIFF-FROM-GMT        PIC S9(04).                      00506000
005070******************************************************************00507000
005080 PROCEDURE DIVISION.                                              00508000
005090******************************************************************00509000
005100 INITIALIZATION SECTION.                                          00510000
005110 IN-START.                                                        00511000
005120     PERFORM GET-FILE-ORGANIZATION.                               00512000
005130     MOVE 'RPD200' TO SR-APIPROGLIT.                              00513000
005140     MOVE 'RPD200' TO WS-ABPROGID.                                00514000
005150     OPEN OUTPUT RP-PODXFIL.                                      00515000
005160     OPEN OUTPUT RP-CRWWFIL.                                      00516000
005170     OPEN OUTPUT RP-ACTWFIL.                                      00517000
005180 IN-EXIT.                                                         00518000
005190     EXIT.                                                        00519000
005200******************************************************************00520000
005210 OPEN-API-FILES SECTION.                                          00521000
005220 OAF-START.                                                       00522000
005230     MOVE 'O R' TO SR-APIFUNC.                                    00523000
005240     PERFORM CALL-RPS-BNK.                                        00524000
005250     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00525000
005260         GO TO AR-0001.                                           00526000
005270     MOVE 'O U' TO SR-APIFUNC.                                    00527000
005280     PERFORM CALL-RPS-EVT.                                        00528000
005290     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00529000
005300         GO TO AR-0061.                                           00530000
005310     MOVE 'O R' TO SR-APIFUNC.                                    00531000
005320     PERFORM CALL-RPS-INT.                                        00532000
005330     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00533000
005340         GO TO AR-0002.                                           00534000
005350     MOVE 'O U' TO SR-APIFUNC.                                    00535000
005360     PERFORM CALL-RPS-MST.                                        00536000
005370     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00537000
005380         GO TO AR-0003.                                           00538000
005390     MOVE 'O U' TO SR-APIFUNC.                                    00539000
005400     PERFORM CALL-RPS-REL.                                        00540000
005410     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00541000
005420         GO TO AR-0004.                                           00542000
005430     MOVE 'O  ' TO SR-APIFUNC.                                    00543000
005440     PERFORM CALL-RPS-CRW.                                        00544000
005450     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00545000
005460         GO TO AR-0035.                                           00546000
005470     MOVE 'O  ' TO SR-APIFUNC.                                    00547000
005480     PERFORM CALL-RPS-TRM.                                        00548000
005490     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00549000
005500         GO TO AR-0051.                                           00550000
005510 OAF-EXIT.                                                        00551000
005520     EXIT.                                                        00552000
005530******************************************************************00553000
005540 MAIN-LOGIC SECTION.                                              00554000
005550 ML-START.                                                        00555000
005560     MOVE ZEROS TO RPBNK-GRP-KEY.                                 00556000
005570     MOVE ZEROS TO RPCRW-GRP-KEY.                                 00557000
005580     MOVE ZEROS TO RPINT-GRP-KEY.                                 00558000
005590     MOVE ZEROS TO RPMST-GRP-KEY.                                 00559000
005600     MOVE ZEROS TO RPREL-GRP-KEY.                                 00560000
005610 ML-PROCESS.                                                      00561000
005620     PERFORM QUALIFY-RELATIONSHIPS.                               00562000
005630     CLOSE RP-ACTWFIL.                                            00563000
005640     IF WS-CNT-WRITE IS EQUAL TO ZEROS                            00564000
005650         DISPLAY 'RPD200 - NO ACCOUNT WORK RECORDS WRITTEN'.      00565000
005660 ML-END.                                                          00566000
005670     GO TO END-ROUTINE.                                           00567000
005680 ML-EXIT.                                                         00568000
005690     EXIT.                                                        00569000
005700******************************************************************00570000
005710 QUALIFY-RELATIONSHIPS SECTION.                                   00571000
005720 QR-START.                                                        00572000
005730     MOVE 'B  ' TO SR-APIFUNC.                                    00573000
005740     PERFORM CALL-RPS-MST.                                        00574000
005750     IF WS-FUNCTION IS EQUAL TO 'E'                               00575000
005760         GO TO QR-END.                                            00576000
005770     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00577000
005780         GO TO AR-0006.                                           00578000
005790     GO TO QR-PROCESS.                                            00579000
005800 QR-READ-NEXT.                                                    00580000
005810     MOVE 'N  ' TO SR-APIFUNC.                                    00581000
005820     PERFORM CALL-RPS-MST.                                        00582000
005830 QR-PROCESS.                                                      00583000
005840     IF WS-FUNCTION IS EQUAL TO 'E'                               00584000
005850         GO TO QR-END.                                            00585000
005860     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00586000
005870         GO TO AR-0007.                                           00587000
005880     IF RPMST-INST IS NOT EQUAL TO RPBNK-INST                     00588000
005890         PERFORM CHANGE-BANK.                                     00589000
005900     ADD +0001 TO WS-MST-COUNT.                                   00590000
005910     IF WS-MST-COUNT IS EQUAL TO WS-SYNCPOINTNBR                  00591000
005920         MOVE FUNCTION CURRENT-DATE TO WS-CURRENT-DATE-FIELDS     00592000
005930         MOVE WS-CURRENT-TIME TO WS-FORMAT-TIMEX                  00593000
005940         MOVE ':' TO WS-LIT1                                      00594000
005950         MOVE ':' TO WS-LIT2                                      00595000
005960         MOVE '.' TO WS-LIT3                                      00596000
005970         DISPLAY 'RPD200 - ' RPMST-INST ' ' RPMST-PRODCODE        00597000
005980             ' ' RPMST-ACCOUNT ' - ' WS-FORMAT-TIME UPON CONSOLE  00598000
005990         MOVE ZEROS TO WS-MST-COUNT                               00599000
006000     END-IF.                                                      00600000
006010     MOVE SPACES TO WS-EXPIRED.                                   00601000
006020 QR-READ-CASH-REWARD.                                             00602000
006030     MOVE 'N' TO WS-HAVE-CRW.                                     00603000
006040     MOVE ZEROS TO WS-CRW-COMBBAL.                                00604000
006050     IF RPCRW-ACCT1-GRP IS GREATER THAN RPMST-GRP-KEY             00605000
006060         GO TO QR-CASH-REWARD-END.                                00606000
006070     IF RPCRW-ACCT1-GRP IS EQUAL TO RPMST-GRP-KEY                 00607000
006080         MOVE 'Y' TO WS-HAVE-CRW                                  00608000
006090         GO TO QR-CASH-REWARD-END.                                00609000
006100     MOVE 'N  ' TO SR-APIFUNC.                                    00610000
006110     PERFORM CALL-RPS-CRW.                                        00611000
006120     IF WS-FUNCTION IS EQUAL TO 'E'                               00612000
006130         MOVE HIGH-VALUES TO RPCRW-ACCT1-GRP                      00613000
006140         GO TO QR-CASH-REWARD-END.                                00614000
006150     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00615000
006160         GO TO AR-0036.                                           00616000
006170     IF RPCRW-ACCT1-GRP IS LESS THAN RPMST-GRP-KEY                00617000
006180         GO TO QR-READ-CASH-REWARD.                               00618000
006190     IF RPCRW-ACCT1-GRP IS EQUAL TO RPMST-GRP-KEY                 00619000
006200         MOVE 'Y' TO WS-HAVE-CRW.                                 00620000
006210 QR-CASH-REWARD-END.                                              00621000
006220     PERFORM VALIDATE-PRIMARY-ACCOUNT.                            00622000
006230     PERFORM VALIDATE-SECONDARY-ACCOUNTS.                         00623000
006240     IF WS-QUAL-FLAG IS NOT EQUAL TO 'P'                          00624000
006250         GO TO QR-RELATIONSHIP-TABLE.                             00625000
006260 QR-INCBAL.                                                       00626000
006270     MOVE 'N' TO WS-BALQUAL-FLAG.                                 00627000
006280     IF WS-BAL-VAL-SW IS EQUAL TO 'N'                             00628000
006290         GO TO QR-TRANSACTION-VALIDATION.                         00629000
006300 QR-PRIMBAL.                                                      00630000
006310     IF WS-PRIMCATCD-I IS NOT EQUAL TO 'Y'                        00631000
006320         GO TO QR-RELATED-BALANCES.                               00632000
006330     IF WS-PRIMBAL-FLAG IS NOT EQUAL TO 'Y'                       00633000
006340         AND MIM-7101INCBALOPT IS EQUAL TO 'A'                    00634000
006350         MOVE 'F' TO WS-BALQUAL-FLAG                              00635000
006360         GO TO QR-INCBALTRNOPT.                                   00636000
006370     IF WS-PRIMBAL-FLAG IS EQUAL TO 'Y'                           00637000
006380         AND MIM-7101INCBALOPT IS EQUAL TO 'O'                    00638000
006390         MOVE 'P' TO WS-BALQUAL-FLAG                              00639000
006400         GO TO QR-INCBALTRNOPT.                                   00640000
006410 QR-RELATED-BALANCES.                                             00641000
006420     IF MIM-7101ACCTRELCD-I IS NOT EQUAL TO 'Y'                   00642000
006430         GO TO QR-COMBBAL.                                        00643000
006440     IF MIM-7101ACCTRELCDI IS EQUAL TO 'O'                        00644000
006450         GO TO QR-ACCTRELCD-OR.                                   00645000
006460     IF WS-ACCTREL-FLAG IS EQUAL TO 'F'                           00646000
006470         AND MIM-7101INCBALOPT IS EQUAL TO 'A'                    00647000
006480         MOVE 'F' TO WS-BALQUAL-FLAG                              00648000
006490         GO TO QR-INCBALTRNOPT.                                   00649000
006500     IF WS-ACCTREL-FLAG IS NOT EQUAL TO 'F'                       00650000
006510         AND MIM-7101INCBALOPT IS EQUAL TO 'O'                    00651000
006520         MOVE 'P' TO WS-BALQUAL-FLAG                              00652000
006530         GO TO QR-INCBALTRNOPT.                                   00653000
006540     GO TO QR-COMBBAL.                                            00654000
006550 QR-ACCTRELCD-OR.                                                 00655000
006560     IF WS-RELACCT-OR-FLAG IS EQUAL TO 'Y'                        00656000
006570         IF MIM-7101INCBALOPT IS EQUAL TO 'A'                     00657000
006580             GO TO QR-COMBBAL                                     00658000
006590         ELSE                                                     00659000
006600             MOVE 'P' TO WS-BALQUAL-FLAG                          00660000
006610             GO TO QR-INCBALTRNOPT.                               00661000
006620     ADD +1 TO WS-PRIMMSG-SUB.                                    00662000
006630     MOVE 2019 TO WS-REL-MSG (1 WS-PRIMMSG-SUB).                  00663000
006640     MOVE 001 TO WS-REL-MSGNBR (1 WS-PRIMMSG-SUB).                00664000
006650     IF MIM-7101INCBALOPT IS EQUAL TO 'A'                         00665000
006660         MOVE 'F' TO WS-BALQUAL-FLAG                              00666000
006670         GO TO QR-INCBALTRNOPT.                                   00667000
006680 QR-COMBBAL.                                                      00668000
006690     IF MIM-7101COMBCATCD1-I IS EQUAL TO 'Y'                      00669000
006700         OR MIM-7101COMBCATCD2-I IS EQUAL TO 'Y'                  00670000
006710         OR MIM-7101COMBCATCD3-I IS EQUAL TO 'Y'                  00671000
006720         OR MIM-7101COMBCATCD4-I IS EQUAL TO 'Y'                  00672000
006730         GO TO QR-COMBBAL1.                                       00673000
006740     IF MIM-7101INCBALOPT IS EQUAL TO 'O'                         00674000
006750         MOVE 'F' TO WS-BALQUAL-FLAG                              00675000
006760     ELSE                                                         00676000
006770         MOVE 'P' TO WS-BALQUAL-FLAG.                             00677000
006780     GO TO QR-INCBALTRNOPT.                                       00678000
006790 QR-COMBBAL1.                                                     00679000
006800     IF MIM-7101COMBCATCD1-I IS NOT EQUAL TO 'Y'                  00680000
006810         GO TO QR-COMBBAL2.                                       00681000
006820     IF WS-COMBINEBAL1 IS LESS THAN WS-7101COMBBALREQ1            00682000
006830         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   00683000
006840         GO TO QR-COMBBAL2.                                       00684000
006850     IF WS-COMBINEBAL1 IS LESS THAN WS-7101COMBBALREQ1            00685000
006860         ADD +1 TO WS-PRIMMSG-SUB                                 00686000
006870         MOVE 2020 TO WS-REL-MSG (1 WS-PRIMMSG-SUB)               00687000
006880         MOVE 002 TO WS-REL-MSGNBR (1 WS-PRIMMSG-SUB)             00688000
006890         MOVE 'F' TO WS-BALQUAL-FLAG                              00689000
006900         GO TO QR-INCBALTRNOPT.                                   00690000
006910     IF MIM-7101COMBBALOPT IS EQUAL TO 'O'                        00691000
006920         MOVE 'P' TO WS-BALQUAL-FLAG                              00692000
006930         GO TO QR-INCBALTRNOPT.                                   00693000
006940 QR-COMBBAL2.                                                     00694000
006950     IF MIM-7101COMBCATCD2-I IS NOT EQUAL TO 'Y'                  00695000
006960         GO TO QR-COMBBAL3.                                       00696000
006970     IF WS-COMBINEBAL2 IS LESS THAN WS-7101COMBBALREQ2            00697000
006980         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   00698000
006990         GO TO QR-COMBBAL3.                                       00699000
007000     IF WS-COMBINEBAL2 IS LESS THAN WS-7101COMBBALREQ2            00700000
007010         ADD +1 TO WS-PRIMMSG-SUB                                 00701000
007020         MOVE 2020 TO WS-REL-MSG (1 WS-PRIMMSG-SUB)               00702000
007030         MOVE 003 TO WS-REL-MSGNBR (1 WS-PRIMMSG-SUB)             00703000
007040         MOVE 'F' TO WS-BALQUAL-FLAG                              00704000
007050         GO TO QR-INCBALTRNOPT.                                   00705000
007060     IF MIM-7101COMBBALOPT IS EQUAL TO 'O'                        00706000
007070         MOVE 'P' TO WS-BALQUAL-FLAG                              00707000
007080         GO TO QR-INCBALTRNOPT.                                   00708000
007090 QR-COMBBAL3.                                                     00709000
007100     IF MIM-7101COMBCATCD3-I IS NOT EQUAL TO 'Y'                  00710000
007110         GO TO QR-COMBBAL4.                                       00711000
007120     IF WS-COMBINEBAL3 IS LESS THAN WS-7101COMBBALREQ3            00712000
007130         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   00713000
007140         GO TO QR-COMBBAL4.                                       00714000
007150     IF WS-COMBINEBAL3 IS LESS THAN WS-7101COMBBALREQ3            00715000
007160         ADD +1 TO WS-PRIMMSG-SUB                                 00716000
007170         MOVE 2020 TO WS-REL-MSG (1 WS-PRIMMSG-SUB)               00717000
007180         MOVE 004 TO WS-REL-MSGNBR (1 WS-PRIMMSG-SUB)             00718000
007190         MOVE 'F' TO WS-BALQUAL-FLAG                              00719000
007200         GO TO QR-INCBALTRNOPT.                                   00720000
007210     IF MIM-7101COMBBALOPT IS EQUAL TO 'O'                        00721000
007220         MOVE 'P' TO WS-BALQUAL-FLAG                              00722000
007230         GO TO QR-INCBALTRNOPT.                                   00723000
007240 QR-COMBBAL4.                                                     00724000
007250     IF MIM-7101COMBCATCD4-I IS NOT EQUAL TO 'Y'                  00725000
007260         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   00726000
007270         ADD +1 TO WS-PRIMMSG-SUB                                 00727000
007280         MOVE 2020 TO WS-REL-MSG (1 WS-PRIMMSG-SUB)               00728000
007290         MOVE 005 TO WS-REL-MSGNBR (1 WS-PRIMMSG-SUB)             00729000
007300         MOVE 'F' TO WS-BALQUAL-FLAG                              00730000
007310         GO TO QR-INCBALTRNOPT.                                   00731000
007320     IF MIM-7101COMBCATCD4-I IS NOT EQUAL TO 'Y'                  00732000
007330         MOVE 'P' TO WS-BALQUAL-FLAG                              00733000
007340         GO TO QR-INCBALTRNOPT.                                   00734000
007350     IF WS-COMBINEBAL4 IS LESS THAN WS-7101COMBBALREQ4            00735000
007360         ADD +1 TO WS-PRIMMSG-SUB                                 00736000
007370         MOVE 2020 TO WS-REL-MSG (1 WS-PRIMMSG-SUB)               00737000
007380         MOVE 005 TO WS-REL-MSGNBR (1 WS-PRIMMSG-SUB)             00738000
007390         MOVE 'F' TO WS-BALQUAL-FLAG                              00739000
007400         GO TO QR-INCBALTRNOPT.                                   00740000
007410     MOVE 'P' TO WS-BALQUAL-FLAG.                                 00741000
007420 QR-INCBALTRNOPT.                                                 00742000
007430     IF MIM-7101INCBALTRNOPT IS EQUAL TO 'A'                      00743000
007440         AND WS-BALQUAL-FLAG IS EQUAL TO 'F'                      00744000
007450         MOVE 'F' TO WS-QUAL-FLAG                                 00745000
007460         GO TO QR-RELATIONSHIP-TABLE.                             00746000
007470     IF MIM-7101INCBALTRNOPT IS EQUAL TO 'O'                      00747000
007480         AND WS-BALQUAL-FLAG IS EQUAL TO 'P'                      00748000
007490         GO TO QR-RELATIONSHIP-TABLE.                             00749000
007500 QR-TRANSACTION-VALIDATION.                                       00750000
007510     IF MIM-7101TRANPROFILE-I IS NOT EQUAL TO 'Y'                 00751000
007520         AND WS-BALQUAL-FLAG IS EQUAL TO 'F'                      00752000
007530         MOVE 'F' TO WS-QUAL-FLAG                                 00753000
007540         GO TO QR-RELATIONSHIP-TABLE.                             00754000
007550     IF MIM-7101TRANPROFILE-I IS NOT EQUAL TO 'Y'                 00755000
007560         GO TO QR-RELATIONSHIP-TABLE.                             00756000
007570     IF MIM-7101TRANPROFILE IS EQUAL TO SPACES                    00757000
007580         ADD +1 TO WS-PRIMMSG-SUB                                 00758000
007590         MOVE 2101 TO WS-REL-MSG (1 WS-PRIMMSG-SUB)               00759000
007600         MOVE 006 TO WS-REL-MSGNBR (1 WS-PRIMMSG-SUB)             00760000
007610         MOVE 'F' TO WS-QUAL-FLAG                                 00761000
007620         GO TO QR-RELATIONSHIP-TABLE.                             00762000
007630     MOVE MIM-7101TRANPROFILE TO WS-RPMIM7110TRANPROFILE.         00763000
007640     PERFORM SEARCH-RPS-7110.                                     00764000
007650     IF WS-RPMIM7110FOUND IS EQUAL TO 'N'                         00765000
007660         ADD +1 TO WS-PRIMMSG-SUB                                 00766000
007670         MOVE 2101 TO WS-REL-MSG (1 WS-PRIMMSG-SUB)               00767000
007680         MOVE 007 TO WS-REL-MSGNBR (1 WS-PRIMMSG-SUB)             00768000
007690         MOVE 'F' TO WS-QUAL-FLAG                                 00769000
007700         GO TO QR-RELATIONSHIP-TABLE.                             00770000
007710 QR-READ-TRM.                                                     00771000
007720     MOVE RPMST-GRP-KEY TO RPTRM-GRP-KEY.                         00772000
007730     MOVE 'R  ' TO SR-APIFUNC.                                    00773000
007740     PERFORM CALL-RPS-TRM.                                        00774000
007750     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00775000
007760         GO TO QR-RELATIONSHIP-TABLE.                             00776000
007770     IF RPTRM-GRACE-EXPIRATION-DATE IS GREATER THAN RPBNK-CURDT   00777000
007780         GO TO QR-RELATIONSHIP-TABLE.                             00778000
007790     PERFORM TRANSACTION-VALIDATION.                              00779000
007800     IF WS-TRAN-VAL-SW IS GREATER THAN ZEROS                      00780000
007810         ADD +1 TO WS-PRIMMSG-SUB                                 00781000
007820         MOVE 2096 TO WS-REL-MSG (1 WS-PRIMMSG-SUB)               00782000
007830         MOVE 008 TO WS-REL-MSGNBR (1 WS-PRIMMSG-SUB)             00783000
007840         MOVE 'F' TO WS-QUAL-FLAG                                 00784000
007850         GO TO QR-RELATIONSHIP-TABLE.                             00785000
007860     MOVE 'P' TO WS-QUAL-FLAG.                                    00786000
007870 QR-RELATIONSHIP-TABLE.                                           00787000
007880     PERFORM PROCESS-RELATIONSHIP-TABLE.                          00788000
007890     IF WS-QUAL-FLAG IS EQUAL TO 'D'                              00789000
007900         GO TO QR-DELETE-MST.                                     00790000
007910     IF MIM-7101TRANPROFILE-I IS EQUAL TO 'Y'                     00791000
007920         PERFORM CHECK-TRM-RESET.                                 00792000
007930     MOVE WS-COMBINEBAL1 TO RPMST-COMBBAL1.                       00793000
007940     MOVE WS-COMBINEBAL2 TO RPMST-COMBBAL2.                       00794000
007950     MOVE WS-COMBINEBAL3 TO RPMST-COMBBAL3.                       00795000
007960     MOVE WS-COMBINEBAL4 TO RPMST-COMBBAL4.                       00796000
007970     IF WS-PROCOPT-FLAG IS EQUAL TO SPACES                        00797000
007980         AND RPMST-QUAL-STAT IS NOT EQUAL TO 'R'                  00798000
007990         MOVE RPBNK-CURDT TO RPMST-IQUALDT.                       00799000
008000     MOVE RPBNK-CURDT TO RPMST-LMNTDT.                            00800000
008010     IF RPMST-QUAL-STAT IS EQUAL TO 'R'                           00801000
008020         MOVE 'N' TO RPMST-SCTODAYFLAG                            00802000
008030         GO TO QR-REWRITE-MST.                                    00803000
008040     IF WS-QUAL-FLAG IS EQUAL TO SPACES                           00804000
008050         MOVE 'P' TO RPMST-QUAL-STAT                              00805000
008060     ELSE                                                         00806000
008070         MOVE WS-QUAL-FLAG TO RPMST-QUAL-STAT.                    00807000
008080     MOVE 'N' TO RPMST-SCTODAYFLAG.                               00808000
008090     IF WS-PRIM-SCTODAYFLAG IS EQUAL TO 'Y'                       00809000
008100         MOVE 'Y' TO RPMST-SCTODAYFLAG.                           00810000
008110     MOVE WS-PRIM-SCNXT TO RPMST-SCNXTDT.                         00811000
008120 QR-REWRITE-MST.                                                  00812000
008130     MOVE 'W  ' TO SR-APIFUNC.                                    00813000
008140     PERFORM CALL-RPS-MST.                                        00814000
008150     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00815000
008160         GO TO AR-0008.                                           00816000
008170     GO TO QR-UPDATE-CASH-REWARD.                                 00817000
008180 QR-DELETE-MST.                                                   00818000
008190     MOVE 'D  ' TO SR-APIFUNC.                                    00819000
008200     PERFORM CALL-RPS-MST.                                        00820000
008210     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00821000
008220         GO TO AR-0009.                                           00822000
008230 QR-UPDATE-CASH-REWARD.                                           00823000
008240     IF RPCRW-ACCT1-GRP IS NOT EQUAL TO RPMST-GRP-KEY             00824000
008250         GO TO QR-READ-NEXT.                                      00825000
008260     IF WS-QUAL-FLAG IS EQUAL TO 'D'                              00826000
008270         PERFORM DELETE-CASH-REWARD                               00827000
008280         GO TO QR-READ-NEXT.                                      00828000
008290     PERFORM UPDATE-CASH-REWARD.                                  00829000
008300     GO TO QR-READ-NEXT.                                          00830000
008310 QR-END.                                                          00831000
008320     IF WS-RELSPROCESSED IS EQUAL TO ZEROS                        00832000
008330         DISPLAY '** RPD200 - INCENTIVE QUALIFICATION **'         00833000
008340         DISPLAY '**   NO MASTER RECORDS PROCESSED    **'         00834000
008350         GO TO QR-EXIT.                                           00835000
008360 QR-EXIT.                                                         00836000
008370     EXIT.                                                        00837000
008380******************************************************************00838000
008390 VALIDATE-PRIMARY-ACCOUNT SECTION.                                00839000
008400 VPA-START.                                                       00840000
008410     MOVE SPACES TO WS-RELATIONSHIP-TABLE.                        00841000
008420     MOVE 'P' TO WS-QUAL-FLAG.                                    00842000
008430     MOVE 'A' TO WS-REL-STATUS.                                   00843000
008440     MOVE 'N' TO WS-EXPIRED-FLAG.                                 00844000
008450     MOVE 'N' TO WS-EXPIRED-TODAY.                                00845000
008460     MOVE 'N' TO WS-PRODMOD-FAIL.                                 00846000
008470     MOVE 'N' TO WS-PRIMCATCD-I.                                  00847000
008480     MOVE 'N' TO WS-PRIM-INVALID-FLAG.                            00848000
008490     MOVE 'N' TO WS-RELACCT-OR-FLAG.                              00849000
008500     MOVE 'N' TO WS-COMBCATCD1-FLAG.                              00850000
008510     MOVE 'N' TO WS-COMBCATCD2-FLAG.                              00851000
008520     MOVE 'N' TO WS-COMBCATCD3-FLAG.                              00852000
008530     MOVE 'N' TO WS-COMBCATCD4-FLAG.                              00853000
008540     MOVE 'P' TO WS-PROCESS-AREA.                                 00854000
008550     MOVE 'N' TO WS-7102-FOUND.                                   00855000
008560     MOVE 'N' TO WS-PRIMBAL-FLAG.                                 00856000
008570     MOVE SPACE TO WS-MICM-NTFND.                                 00857000
008580     MOVE SPACE TO WS-BALQUAL-FLAG.                               00858000
008590     MOVE SPACE TO WS-ACCTREL-FLAG.                               00859000
008600     MOVE SPACE TO WS-ACCTALL-FLAG.                               00860000
008610     MOVE ZEROS TO WS-COMBINEBAL1.                                00861000
008620     MOVE ZEROS TO WS-COMBINEBAL2.                                00862000
008630     MOVE ZEROS TO WS-COMBINEBAL3.                                00863000
008640     MOVE ZEROS TO WS-COMBINEBAL4.                                00864000
008650     MOVE ZEROS TO WS-7101COMBBALREQ1.                            00865000
008660     MOVE ZEROS TO WS-7101COMBBALREQ2.                            00866000
008670     MOVE ZEROS TO WS-7101COMBBALREQ3.                            00867000
008680     MOVE ZEROS TO WS-7101COMBBALREQ4.                            00868000
008690     MOVE SPACES TO WS-PROCOPT-FLAG.                              00869000
008700     MOVE ZEROS TO WS-PRIM-SCNXT.                                 00870000
008710     MOVE 'N' TO WS-BAL-VAL-SW.                                   00871000
008720     MOVE +1 TO WS-SUB1.                                          00872000
008730     MOVE ZEROS TO WS-SUB2.                                       00873000
008740 VPA-REL.                                                         00874000
008750     IF RPMST-GRP-KEY IS EQUAL TO RPREL-ACCT1-GRP                 00875000
008760         GO TO VPA-REL-FOUND.                                     00876000
008770     MOVE 'N  ' TO SR-APIFUNC.                                    00877000
008780     PERFORM CALL-RPS-REL.                                        00878000
008790     IF WS-FUNCTION IS EQUAL TO 'E'                               00879000
008800         DISPLAY 'PRI KEY: ' RPMST-GRP-KEY                        00880000
008810         GO TO AR-0011.                                           00881000
008820     IF RPREL-GRP-KEY IS EQUAL TO LOW-VALUES                      00882000
008830         GO TO VPA-REL.                                           00883000
008840     IF RPMST-GRP-KEY IS NOT EQUAL TO RPREL-ACCT1-GRP             00884000
008850         DISPLAY 'PRI KEY: ' RPMST-GRP-KEY                        00885000
008860         GO TO AR-0012.                                           00886000
008870 VPA-REL-FOUND.                                                   00887000
008880     ADD +1 TO WS-NUMOFREL.                                       00888000
008890     ADD +1 TO WS-RELSPROCESSED.                                  00889000
008900     MOVE RPREL-INST TO WS-REL-INST (1).                          00890000
008910     MOVE RPREL-INST TO WS-REL-INST2 (1).                         00891000
008920     MOVE RPREL-PRODCODE TO WS-REL-PRODCODE (1).                  00892000
008930     MOVE RPREL-ACCOUNT TO WS-REL-ACCOUNT (1).                    00893000
008940     MOVE RPREL-BRANCH TO WS-REL-BRANCH (1).                      00894000
008950     MOVE RPREL-ACCT-TYPE TO WS-REL-ACCT-TYPE (1).                00895000
008960     MOVE RPREL-APPL TO WS-REL-APPL (1).                          00896000
008970     MOVE RPREL-SC-INC-OPTION TO WS-REL-SCINCOPT (1).             00897000
008980     MOVE RPREL-RATE-INC-OPTION TO WS-REL-RATEINCOPT (1).         00898000
008990     MOVE RPREL-ACCT-STATUS TO WS-REL-ACCT-STATUS (1).            00899000
009000     MOVE RPREL-DISCAMT-OVRD-FLAG                                 00900000
009010         TO WS-REL-DISCAMT-OVRD-FLAG (1).                         00901000
009020     MOVE RPREL-DISCAMT-OVRD TO WS-REL-DISCAMT-OVRD (1).          00902000
009030     MOVE RPREL-DISCPCT-OVRD-FLAG                                 00903000
009040         TO WS-REL-DISCPCT-OVRD-FLAG (1).                         00904000
009050     MOVE RPREL-DISCPCT-OVRD TO WS-REL-DISCPCT-OVRD (1).          00905000
009060     MOVE RPREL-RATEPCT-OVRD-FLAG                                 00906000
009070         TO WS-REL-RATEPCT-OVRD-FLAG (1).                         00907000
009080     MOVE RPREL-RATEPCT-OVRD TO WS-REL-RATEPCT-OVRD (1).          00908000
009090     MOVE '0' TO WS-REL-RATEOPTION (1).                           00909000
009100     MOVE 'N' TO WS-REL-SEC-SERVICE (1).                          00910000
009110     MOVE SPACES TO WS-REL-SECSVCPLAN (1).                        00911000
009120     MOVE SPACES TO WS-REL-SECSVCTABLE (1).                       00912000
009130     MOVE ZEROS TO WS-REL-SECSVCBAL (1).                          00913000
009140 VPA-2023.                                                        00914000
009150     MOVE RPMST-PRODCODE TO WS-RPMIM2023PRODCD.                   00915000
009160     PERFORM SEARCH-RPS-2023.                                     00916000
009170     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         00917000
009180         MOVE +1 TO WS-SUB2                                       00918000
009190         MOVE 2004 TO WS-REL-MSG (1 WS-SUB2)                      00919000
009200         MOVE 008 TO WS-REL-MSGNBR (1 WS-SUB2)                    00920000
009210         MOVE 'D' TO WS-QUAL-FLAG                                 00921000
009220         GO TO VPA-DELETE-REL.                                    00922000
009230     IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'Y'              00923000
009240         GO TO VPA-INT.                                           00924000
009250     IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'P'              00925000
009260         GO TO VPA-RCIF.                                          00926000
009270     MOVE +1 TO WS-SUB2.                                          00927000
009280     MOVE 2005 TO WS-REL-MSG (1 WS-SUB2).                         00928000
009290     MOVE 009 TO WS-REL-MSGNBR (1 WS-SUB2).                       00929000
009300     MOVE 'D' TO WS-QUAL-FLAG.                                    00930000
009310     GO TO VPA-DELETE-REL.                                        00931000
009320 VPA-INT.                                                         00932000
009330     IF RPREL-GRP-KEY IS EQUAL TO RPINT-GRP-KEY                   00933000
009340         GO TO VPA-INT-CONT.                                      00934000
009350     IF RPINT-GRP-KEY IS GREATER THAN RPREL-GRP-KEY               00935000
009360         DISPLAY 'REL KEY: ' RPREL-GRP-KEY                        00936000
009370         GO TO AR-0045.                                           00937000
009380     MOVE 'N  ' TO SR-APIFUNC.                                    00938000
009390     PERFORM CALL-RPS-INT.                                        00939000
009400     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00940000
009410         DISPLAY 'PRI KEY: ' RPMST-GRP-KEY                        00941000
009420         GO TO AR-0013.                                           00942000
009430     GO TO VPA-INT.                                               00943000
009440 VPA-INT-CONT.                                                    00944000
009450     IF RPINT-ACCT-STATUS IS EQUAL TO 'N'                         00945000
009460         MOVE +1 TO WS-SUB2                                       00946000
009470         MOVE 2006 TO WS-REL-MSG (1 WS-SUB2)                      00947000
009480         MOVE 010 TO WS-REL-MSGNBR (1 WS-SUB2)                    00948000
009490         MOVE 'D' TO WS-QUAL-FLAG                                 00949000
009500         GO TO VPA-DELETE-REL.                                    00950000
009510     MOVE RPINT-BRANCH TO RPREL-BRANCH.                           00951000
009520     MOVE RPINT-ACCT-TYPE TO RPREL-ACCT-TYPE.                     00952000
009530     MOVE RPINT-BRANCH TO WS-REL-BRANCH (1).                      00953000
009540     MOVE RPINT-ACCT-TYPE TO WS-REL-ACCT-TYPE (1).                00954000
009550     MOVE RPINT-TERM TO WS-REL-TERM (1).                          00955000
009560     MOVE RPINT-SCNXT TO WS-PRIM-SCNXT.                           00956000
009570     GO TO VPA-7101.                                              00957000
009580 VPA-RCIF.                                                        00958000
009590     MOVE RPMST-INST TO WS-INST.                                  00959000
009600     MOVE RPMST-PRODCODE TO WS-PRODCODE.                          00960000
009610     MOVE RPMST-ACCOUNT TO WS-ACCOUNT.                            00961000
009620     MOVE 'T' TO WS-FUNC.                                         00962000
009630     PERFORM CALL-RCIF.                                           00963000
009640     IF WS-FUNCTION IS EQUAL TO 'N'                               00964000
009650         MOVE +1 TO WS-SUB2                                       00965000
009660         MOVE 2007 TO WS-REL-MSG (1 WS-SUB2)                      00966000
009670         MOVE 011 TO WS-REL-MSGNBR (1 WS-SUB2)                    00967000
009680         MOVE 'D' TO WS-QUAL-FLAG                                 00968000
009690         GO TO VPA-DELETE-REL.                                    00969000
009700     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00970000
009710         DISPLAY 'PRI KEY: ' RPMST-GRP-KEY                        00971000
009720         GO TO AR-0014.                                           00972000
009730     IF WS-RO-STATUS IS NOT EQUAL TO 'O'                          00973000
009740         MOVE +1 TO WS-SUB2                                       00974000
009750         MOVE 2008 TO WS-REL-MSG (1 WS-SUB2)                      00975000
009760         MOVE 012 TO WS-REL-MSGNBR (1 WS-SUB2)                    00976000
009770         MOVE 'D' TO WS-QUAL-FLAG                                 00977000
009780         GO TO VPA-DELETE-REL.                                    00978000
009790     MOVE ZEROS TO WS-REL-BRANCH (1).                             00979000
009800     MOVE ZEROS TO WS-REL-ACCT-TYPE (1).                          00980000
009810     MOVE ZEROS TO WS-REL-TERM (1).                               00981000
009820     MOVE ZEROS TO WS-PRIM-SCNXT.                                 00982000
009830 VPA-7101.                                                        00983000
009840     MOVE RPMST-MODEL TO WS-RPMIM7101MODEL.                       00984000
009850     PERFORM SEARCH-RPS-7101.                                     00985000
009860     IF WS-RPMIM7101FOUND IS EQUAL TO 'N'                         00986000
009870         MOVE +1 TO WS-SUB2                                       00987000
009880         MOVE 2009 TO WS-REL-MSG (1 WS-SUB2)                      00988000
009890         MOVE 013 TO WS-REL-MSGNBR (1 WS-SUB2)                    00989000
009900         MOVE 'Y' TO WS-PRODMOD-FAIL                              00990000
009910         MOVE 'F' TO WS-QUAL-FLAG                                 00991000
009920         GO TO VPA-INIT-REL.                                      00992000
009930     IF RPMST-REL-STAT IS EQUAL TO 'E'                            00993000
009940         GO TO VPA-7101-EXPDT.                                    00994000
009950 VPA-7101-ACTCD.                                                  00995000
009960     IF MIM-7101ACTCD IS NOT EQUAL TO 'A'                         00996000
009970         MOVE +1 TO WS-SUB2                                       00997000
009980         MOVE 2010 TO WS-REL-MSG (1 WS-SUB2)                      00998000
009990         MOVE 014 TO WS-REL-MSGNBR (1 WS-SUB2)                    00999000
010000         MOVE 'N' TO WS-QUAL-FLAG                                 01000000
010010         MOVE 'I' TO WS-REL-STATUS                                01001000
010020         MOVE 'I' TO RPMST-REL-STAT                               01002000
010030         ADD +1 TO WS-NUMOFINACTIVE                               01003000
010040         GO TO VPA-INIT-REL.                                      01004000
010050     MOVE 'A' TO RPMST-REL-STAT.                                  01005000
010060 VPA-7101-EXPDT.                                                  01006000
010070     IF RPMST-EXPIRATION-DATE IS EQUAL TO ZEROS                   01007000
010080         GO TO VPA-7102.                                          01008000
P0033      IF RPMST-EXPIRATION-DATE IS GREATER THAN RPBNK-CURDT         01009000
010100         GO TO VPA-7102.                                          01010000
010110     MOVE +1 TO WS-SUB2.                                          01011000
010120     ADD +1 TO WS-NUMOFEXPIRED.                                   01012000
010130     IF RPMST-REL-STAT IS NOT EQUAL TO 'E'                        01013000
010140         ADD +1 TO WS-NUMOFEXPTODAY                               01014000
010150         MOVE 'Y' TO WS-EXPIRED-TODAY                             01015000
010160         MOVE 'E' TO RPMST-REL-STAT                               01016000
010170         MOVE 'E' TO WS-REL-STATUS                                01017000
010180         MOVE 2011 TO WS-REL-MSG (1 WS-SUB2)                      01018000
010190         MOVE 015 TO WS-REL-MSGNBR (1 WS-SUB2)                    01019000
010200     ELSE                                                         01020000
010210         MOVE 'E' TO WS-REL-STATUS                                01021000
010220         MOVE 2012 TO WS-REL-MSG (1 WS-SUB2)                      01022000
010230         MOVE 016 TO WS-REL-MSGNBR (1 WS-SUB2).                   01023000
010240     IF MIM-7100EVENTHISTORYOPT IS EQUAL TO 'N'                   01024000
010250         OR WS-EXPIRED-TODAY IS EQUAL TO 'N'                      01025000
010260         GO TO VPA-7101-EXPDT-CONT.                               01026000
010270     MOVE 'N' TO RPS-EVT-FLAG.                                    01027000
010280     MOVE 02 TO RPS-EVT-EVENT-CODE.                               01028000
010290     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   01029000
010300     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   01030000
010310     MOVE RPMST-IDNUMBER TO RPS-EVT-IDNUMBER.                     01031000
010320     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        01032000
P0061      MOVE ZEROS TO RPS-EVT-MSGNBR.                                01033000
010380     PERFORM ADD-EVENT-HISTORY.                                   01038000
010390     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01039000
010400         GO TO AR-0062.                                           01040000
010410 VPA-7101-EXPDT-CONT.                                             01041000
010420     MOVE 'Y' TO WS-EXPIRED-FLAG.                                 01042000
010430     IF MIM-7100EXPRETDAYS IS EQUAL TO ZEROS                      01043000
010440         MOVE 'D' TO WS-QUAL-FLAG                                 01044000
010450         GO TO VPA-DELETE-REL.                                    01045000
010460     MOVE RPMST-EXPIRATION-DATE TO SR-CODASYL.                    01046000
010470     MOVE 'D' TO SR-CFREQ.                                        01047000
010480     MOVE MIM-7100EXPRETDAYS TO SR-CTERM.                         01048000
010490     PERFORM NEXT-CODASYL-365.                                    01049000
010500     IF SR-CODASYL IS GREATER THAN RPBNK-CURDT                    01050000
010510         MOVE 'N' TO WS-QUAL-FLAG                                 01051000
010520         GO TO VPA-INIT-REL.                                      01052000
010530     MOVE 'D' TO WS-QUAL-FLAG.                                    01053000
010540     GO TO VPA-DELETE-REL.                                        01054000
010550 VPA-7102.                                                        01055000
010560     MOVE RPMST-MODEL TO WS-RPMIM7102MODEL.                       01056000
010570     MOVE RPMST-PRODCODE TO WS-RPMIM7102PRODCODE.                 01057000
010580     IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'P'              01058000
010590         GO TO VPA-7102-TYPEZERO.                                 01059000
010600     MOVE WS-REL-ACCT-TYPE (1) TO WS-RPMIM7102TYPE.               01060000
010610     PERFORM SEARCH-RPS-7102.                                     01061000
010620     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01062000
010630         GO TO VPA-7102-FOUND.                                    01063000
010640 VPA-7102-TYPEZERO.                                               01064000
010650     MOVE ZEROS TO WS-RPMIM7102TYPE.                              01065000
010660     PERFORM SEARCH-RPS-7102.                                     01066000
010670     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01067000
010680         GO TO VPA-7102-FOUND.                                    01068000
010690 VPA-7102-MODELONLY.                                              01069000
010700     MOVE SPACES TO WS-RPMIM7102PRODCODE.                         01070000
010710     MOVE ZEROS TO WS-RPMIM7102TYPE.                              01071000
010720     PERFORM SEARCH-RPS-7102.                                     01072000
010730     IF WS-RPMIM7102FOUND IS NOT EQUAL TO 'N'                     01073000
010740         GO TO VPA-7102-FOUND.                                    01074000
010750     MOVE +1 TO WS-SUB2.                                          01075000
010760     MOVE 2013 TO WS-REL-MSG (1 WS-SUB2).                         01076000
010770     MOVE 017 TO WS-REL-MSGNBR (1 WS-SUB2).                       01077000
010780     MOVE 'Y' TO WS-PRODMOD-FAIL.                                 01078000
010790     MOVE 'F' TO WS-QUAL-FLAG.                                    01079000
010800     GO TO VPA-INIT-REL.                                          01080000
010810 VPA-7102-FOUND.                                                  01081000
010820     MOVE 'Y' TO WS-7102-FOUND.                                   01082000
010830     MOVE MIM-7102PRIMSCINCOPT TO WS-REL-SCINCOPT (1).            01083000
010840     MOVE MIM-7102DISCAMT TO WS-REL-SCDISCAMT (1).                01084000
010850     MOVE MIM-7102DISCPCT TO WS-REL-SCDISCPCT (1).                01085000
010860     MOVE MIM-7102SCINCTABLE TO WS-REL-SCCATCODE (1).             01086000
010870     MOVE MIM-7102PRIMRATEINCOPT TO WS-REL-RATEINCOPT (1).        01087000
010880     MOVE MIM-7102RATETYPE TO WS-REL-RATETYPE (1).                01088000
P0167      MOVE MIM-7102ACCTRATEBALCD TO WS-REL-RATEBALCODE (1).        01088500
010890     MOVE MIM-7102RATEPCT TO WS-REL-RATEPCT (1).                  01089000
010900     MOVE MIM-7102RATEINCTABLE TO WS-REL-RATECATCODE (1).         01090000
010910     MOVE MIM-7102TIMEPROCOPT TO WS-REL-TIMEPROCOPT (1).          01091000
010920     MOVE MIM-7102PRIMSCINCOPT TO RPREL-SC-INC-OPTION.            01092000
010930     MOVE MIM-7102PRIMRATEINCOPT TO RPREL-RATE-INC-OPTION.        01093000
010940     IF MIM-7102SECSVCPLAN IS NOT EQUAL TO SPACES                 01094000
010950         OR MIM-7102SECSVCTABLE IS NOT EQUAL TO SPACES            01095000
010960         MOVE 'Y' TO WS-REL-SEC-SERVICE (1).                      01096000
010970     MOVE MIM-7102SECSVCOPT TO WS-REL-SECSVCOPT (1).              01097000
010980     MOVE MIM-7102SECSVCPLAN TO WS-REL-SECSVCPLAN (1).            01098000
010990     MOVE MIM-7102SECSVCTABLE TO WS-REL-SECSVCTABLE (1).          01099000
011000     MOVE MIM-7102BONUSRATEOPT TO WS-REL-BONUSRATEOPT (1).        01100000
011010 VPA-QUAL-STATUS.                                                 01101000
011020     IF RPMST-QUAL-STAT IS EQUAL TO 'R'                           01102000
011030         MOVE +1 TO WS-SUB2                                       01103000
011040         MOVE 2014 TO WS-REL-MSG (1 WS-SUB2)                      01104000
011050         MOVE 018 TO WS-REL-MSGNBR (1 WS-SUB2)                    01105000
011060         MOVE 'Y' TO WS-PRODMOD-FAIL                              01106000
011070         MOVE 'F' TO WS-QUAL-FLAG                                 01107000
011080         GO TO VPA-INIT-REL1.                                     01108000
011090 VPA-SC-DATE.                                                     01109000
011100     IF MIM-7101PROCOPT IS EQUAL TO 'A'                           01110000
011110         GO TO VPA-NO-INTERFACE.                                  01111000
011120     MOVE 'N' TO WS-PRIM-SCTODAYFLAG.                             01112000
011130     IF WS-PRIM-SCNXT IS EQUAL TO ZEROS                           01113000
011140         GO TO VPA-NO-INTERFACE.                                  01114000
011150     IF WS-PRIM-SCNXT IS NOT LESS THAN RPBNK-CURDT                01115000
011160         AND WS-PRIM-SCNXT IS LESS THAN RPBNK-NPROCDTA            01116000
011170         MOVE 'Y' TO WS-PRIM-SCTODAYFLAG.                         01117000
011180     IF MIM-7101PROCOPT IS EQUAL TO 'U'                           01118000
011190         GO TO VPA-PROCOPT-U.                                     01119000
011200     IF MIM-7101PROCOPT IS EQUAL TO 'T'                           01120000
011210         AND RPMST-DATE-OPENED IS GREATER THAN RPBNK-LPROCDT      01121000
011220         GO TO VPA-NO-INTERFACE.                                  01122000
011230     IF (MIM-7101PROCOPT IS EQUAL TO 'S'                          01123000
011240         OR MIM-7101PROCOPT IS EQUAL TO 'T')                      01124000
011250         AND WS-PRIM-SCTODAYFLAG IS EQUAL TO 'Y'                  01125000
011260         GO TO VPA-NO-INTERFACE.                                  01126000
011270     IF RPMST-QUAL-STAT IS EQUAL TO 'F'                           01127000
011280         MOVE 'F' TO WS-QUAL-FLAG.                                01128000
011290     IF RPMST-QUAL-STAT IS EQUAL TO 'N'                           01129000
011300         OR RPMST-QUAL-STAT IS EQUAL TO SPACES                    01130000
011310         MOVE 'N' TO WS-QUAL-FLAG.                                01131000
011320     MOVE RPMST-COMBBAL1 TO WS-COMBINEBAL1.                       01132000
011330     MOVE RPMST-COMBBAL2 TO WS-COMBINEBAL2.                       01133000
011340     MOVE RPMST-COMBBAL3 TO WS-COMBINEBAL3.                       01134000
011350     MOVE RPMST-COMBBAL4 TO WS-COMBINEBAL4.                       01135000
011360     MOVE RPREL-SC-BAL TO WS-REL-SCBAL (1).                       01136000
011370     MOVE RPREL-ACCT-RATE-BAL TO WS-REL-ACCTRATEBAL (1)           01137000
011380     MOVE RPREL-DISCAMT-OVRD-FLAG                                 01138000
011390         TO WS-REL-DISCAMT-OVRD-FLAG (1).                         01139000
011400     MOVE RPREL-DISCAMT-OVRD TO WS-REL-DISCAMT-OVRD (1).          01140000
011410     MOVE RPREL-DISCPCT-OVRD-FLAG                                 01141000
011420         TO WS-REL-DISCPCT-OVRD-FLAG (1).                         01142000
011430     MOVE RPREL-DISCPCT-OVRD TO WS-REL-DISCPCT-OVRD (1).          01143000
011440     MOVE RPREL-DISCPCT-OVRD-FLAG                                 01144000
011450         TO WS-REL-DISCPCT-OVRD-FLAG (1).                         01145000
011460     MOVE RPREL-DISCPCT-OVRD TO WS-REL-DISCPCT-OVRD (1).          01146000
011470     MOVE 'E' TO WS-PROCOPT-FLAG.                                 01147000
011480     ADD +1 TO WS-SUB2.                                           01148000
011490     MOVE 2023 TO WS-REL-MSG (1 WS-SUB2).                         01149000
011500     MOVE 019 TO WS-REL-MSGNBR (1 WS-SUB2).                       01150000
011510     GO TO VPA-REWRITE-REL.                                       01151000
011520 VPA-PROCOPT-U.                                                   01152000
011530     IF MIM-7101PROCOPT IS NOT EQUAL TO 'U'                       01153000
011540         GO TO VPA-NO-INTERFACE.                                  01154000
011550     IF RPMST-QUAL-STAT IS NOT EQUAL TO 'F'                       01155000
011560         GO TO VPA-NO-INTERFACE.                                  01156000
011570     IF RPMST-SCTODAYFLAG IS EQUAL TO 'Y'                         01157000
011580         AND WS-PRIM-SCTODAYFLAG IS EQUAL TO 'N'                  01158000
011590         MOVE 'N' TO RPMST-SCTODAYFLAG                            01159000
011600         GO TO VPA-NO-INTERFACE.                                  01160000
011610     MOVE 'E' TO WS-PROCOPT-FLAG.                                 01161000
011620     ADD +1 TO WS-SUB2.                                           01162000
011630     MOVE 'Y' TO WS-PRODMOD-FAIL.                                 01163000
011640     MOVE 2024 TO WS-REL-MSG (1 WS-SUB2).                         01164000
011650     MOVE 020 TO WS-REL-MSGNBR (1 WS-SUB2).                       01165000
011660     MOVE 'N' TO WS-QUAL-FLAG.                                    01166000
011670     GO TO VPA-INIT-REL1.                                         01167000
011680 VPA-NO-INTERFACE.                                                01168000
011690     IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'P'              01169000
011700         GO TO VPA-INIT-REL1.                                     01170000
011710 VPA-SC-BALANCE.                                                  01171000
011720     MOVE ZEROS TO WS-REL-SCBAL (1).                              01172000
011730     MOVE ZEROS TO RPREL-SC-BAL.                                  01173000
011740     IF MIM-7102SCBALCD IS EQUAL TO ZEROS                         01174000
011750         GO TO VPA-RATE-BALANCE.                                  01175000
011760     MOVE MIM-7102SCBALCD TO WS-WORK-BALCD.                       01176000
011770     PERFORM GET-BALANCE.                                         01177000
011780     MOVE WS-WORK-BALANCE TO WS-REL-SCBAL (1).                    01178000
011790     MOVE WS-WORK-BALANCE TO RPREL-SC-BAL.                        01179000
011800 VPA-RATE-BALANCE.                                                01180000
011810     MOVE ZEROS TO WS-REL-ACCTRATEBAL (1).                        01181000
011820     MOVE ZEROS TO RPREL-ACCT-RATE-BAL.                           01182000
011830     IF MIM-7102ACCTRATEBALCD IS EQUAL TO ZEROS                   01183000
011840         GO TO VPA-SECSVC-BALANCE.                                01184000
011850     MOVE MIM-7102ACCTRATEBALCD TO WS-WORK-BALCD.                 01185000
011860     PERFORM GET-BALANCE.                                         01186000
011870     MOVE WS-WORK-BALANCE TO WS-REL-ACCTRATEBAL (1).              01187000
011880     MOVE WS-WORK-BALANCE TO RPREL-ACCT-RATE-BAL.                 01188000
011890 VPA-SECSVC-BALANCE.                                              01189000
011900     MOVE ZEROS TO WS-REL-SECSVCBAL (1).                          01190000
011910     MOVE ZEROS TO RPREL-SECSVC-BAL.                              01191000
011920     IF MIM-7102SECSVCBALCD IS EQUAL TO ZEROS                     01192000
011930         GO TO VPA-7102-BALANCE.                                  01193000
011940     MOVE MIM-7102SECSVCBALCD TO WS-WORK-BALCD.                   01194000
011950     PERFORM GET-BALANCE.                                         01195000
011960     MOVE WS-WORK-BALANCE TO WS-REL-SECSVCBAL (1).                01196000
011970     MOVE WS-WORK-BALANCE TO RPREL-SECSVC-BAL.                    01197000
011980 VPA-7102-BALANCE.                                                01198000
011990     IF MIM-7102PRIMCATCD-I IS EQUAL TO 'Y'                       01199000
012000         OR MIM-7101ACCTRELCD-I IS EQUAL TO 'Y'                   01200000
012010         OR MIM-7101COMBCATCD1-I IS EQUAL TO 'Y'                  01201000
012020         OR MIM-7101COMBCATCD2-I IS EQUAL TO 'Y'                  01202000
012030         OR MIM-7101COMBCATCD3-I IS EQUAL TO 'Y'                  01203000
012040         OR MIM-7101COMBCATCD4-I IS EQUAL TO 'Y'                  01204000
012050         MOVE 'Y' TO WS-BAL-VAL-SW.                               01205000
012060     MOVE ZEROS TO RPREL-PRIMEBAL.                                01206000
012070     IF MIM-7102PRIMCATCD-I IS NOT EQUAL TO 'Y'                   01207000
012080         GO TO VPA-PRIMBALOPT.                                    01208000
012090     MOVE 'Y' TO WS-PRIMCATCD-I.                                  01209000
012100     MOVE SPACES TO WS-REL-PRIMCATCODE (1).                       01210000
012110     MOVE ZEROS TO WS-REL-PRIMBAL (1).                            01211000
012120     MOVE ZEROS TO WS-REL-PRIMBALREQ (1).                         01212000
012130     IF MIM-7102PRIMCATCD IS EQUAL TO SPACES                      01213000
012140         ADD +1 TO WS-SUB2                                        01214000
012150         MOVE 2015 TO WS-REL-MSG (WS-SUB1 WS-SUB2)                01215000
012160         MOVE 021 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)              01216000
012170         MOVE 'F' TO WS-QUAL-FLAG                                 01217000
012180         MOVE 'Y' TO WS-MICM-NTFND                                01218000
012190         GO TO VPA-PRIMBALOPT.                                    01219000
012200     MOVE MIM-7102PRIMCATCD TO WS-REL-PRIMCATCODE (1).            01220000
012210     MOVE MIM-7102PRIMCATCD TO WS-RPMIM7106RPREC.                 01221000
012220     PERFORM SEARCH-RPS-7106.                                     01222000
012230     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01223000
012240         ADD +1 TO WS-SUB2                                        01224000
012250         MOVE 2015 TO WS-REL-MSG (WS-SUB1 WS-SUB2)                01225000
012260         MOVE 021 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)              01226000
012270         MOVE 'F' TO WS-QUAL-FLAG                                 01227000
012280         MOVE 'Y' TO WS-MICM-NTFND                                01228000
012290         GO TO VPA-PRIMBALOPT.                                    01229000
012300     MOVE MIM-7106BALREQ-I TO WS-REL-PRIMBALREQ (1).              01230000
012310     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01231000
012320     PERFORM GET-BALANCE.                                         01232000
012330     MOVE WS-WORK-BALANCE TO WS-REL-PRIMBAL (1).                  01233000
012340     MOVE WS-WORK-BALANCE TO RPREL-PRIMEBAL.                      01234000
012350     IF WS-REL-PRIMBAL (1) IS LESS THAN WS-REL-PRIMBALREQ (1)     01235000
012360         ADD +1 TO WS-SUB2                                        01236000
012370         MOVE 2016 TO WS-REL-MSG (1 WS-SUB2)                      01237000
012380         MOVE 022 TO WS-REL-MSGNBR (1 WS-SUB2)                    01238000
012390         GO TO VPA-PRIMBALOPT.                                    01239000
012400     MOVE 'Y' TO WS-PRIMBAL-FLAG.                                 01240000
012410 VPA-PRIMBALOPT.                                                  01241000
012420     IF MIM-7101PRIMBALOPT-I IS NOT EQUAL TO 'Y'                  01242000
012430         GO TO VPA-PRIMCOMBOPT.                                   01243000
012440     IF MIM-7101PRIMBALOPT IS EQUAL TO 'N'                        01244000
012450         GO TO VPA-PRIMCOMBOPT.                                   01245000
012460 VPA-IND-BALANCES.                                                01246000
012470     MOVE ZEROS TO RPREL-ACCTBAL-1.                               01247000
012480     MOVE ZEROS TO RPREL-ACCTBAL-2.                               01248000
012490     MOVE ZEROS TO WS-REL-BAL1 (1).                               01249000
012500     MOVE ZEROS TO WS-REL-BALREQ1 (1).                            01250000
012510     MOVE ZEROS TO WS-REL-BAL2 (1).                               01251000
012520     MOVE ZEROS TO WS-REL-BALREQ2 (1).                            01252000
012530     MOVE SPACES TO WS-REL-BALCATCODE1 (1).                       01253000
012540     MOVE SPACES TO WS-REL-BALCATCODE2 (1).                       01254000
012550     IF MIM-7101PRIMBALOPT-I IS NOT EQUAL TO 'Y'                  01255000
012560         GO TO VPA-PRIMCOMBOPT.                                   01256000
012570     IF MIM-7101PRIMBALOPT IS NOT EQUAL TO 'Y'                    01257000
012580         GO TO VPA-PRIMCOMBOPT.                                   01258000
012590     IF MIM-7101ACCTRELCD-I IS NOT EQUAL TO 'Y'                   01259000
012600         GO TO VPA-PRIMCOMBOPT.                                   01260000
012610 VPA-BALCATCD1.                                                   01261000
012620     IF MIM-7102BALCATCD1-I IS NOT EQUAL TO 'Y'                   01262000
012630         GO TO VPA-BALCATCD2.                                     01263000
012640     IF MIM-7102BALCATCD1 IS EQUAL TO SPACES                      01264000
012650         GO TO VPA-BALCATCD2.                                     01265000
012660     MOVE MIM-7102BALCATCD1 TO WS-RPMIM7106RPREC.                 01266000
012670     PERFORM SEARCH-RPS-7106.                                     01267000
012680     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01268000
012690         GO TO VPA-BALCATCD2.                                     01269000
012700     MOVE MIM-7102BALCATCD1 TO WS-REL-BALCATCODE1 (1).            01270000
012710     MOVE MIM-7106BALREQ-I TO WS-REL-BALREQ1 (1).                 01271000
012720     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01272000
012730     PERFORM GET-BALANCE.                                         01273000
012740     MOVE WS-WORK-BALANCE TO WS-REL-BAL1 (1).                     01274000
012750     MOVE WS-WORK-BALANCE TO RPREL-ACCTBAL-1.                     01275000
012760     IF WS-WORK-BALANCE IS LESS THAN MIM-7106BALREQ-I             01276000
012770         GO TO VPA-BALCATCD2.                                     01277000
012780     IF MIM-7101ACCTRELCDI IS EQUAL TO 'O'                        01278000
012790         MOVE 'Y' TO WS-RELACCT-OR-FLAG.                          01279000
012800     GO TO VPA-PRIMCOMBOPT.                                       01280000
012810 VPA-BALCATCD2.                                                   01281000
012820     IF MIM-7102BALCATCD2-I IS NOT EQUAL TO 'Y'                   01282000
012830         IF MIM-7101ACCTRELCDI IS EQUAL TO 'O'                    01283000
012840             GO TO VPA-PRIMCOMBOPT                                01284000
012850         ELSE                                                     01285000
012860             ADD +1 TO WS-SUB2                                    01286000
012870             MOVE 2019 TO WS-REL-MSG (1 WS-SUB2)                  01287000
012880             MOVE 023 TO WS-REL-MSGNBR (1 WS-SUB2)                01288000
012890             MOVE 'F' TO WS-ACCTREL-FLAG                          01289000
012900             GO TO VPA-PRIMCOMBOPT.                               01290000
012910     IF MIM-7102BALCATCD2 IS EQUAL TO SPACES                      01291000
012920         IF MIM-7101ACCTRELCDI IS EQUAL TO 'O'                    01292000
012930             GO TO VPA-PRIMCOMBOPT                                01293000
012940         ELSE                                                     01294000
012950             ADD +1 TO WS-SUB2                                    01295000
012960             MOVE 2019 TO WS-REL-MSG (1 WS-SUB2)                  01296000
012970             MOVE 024 TO WS-REL-MSGNBR (1 WS-SUB2)                01297000
012980             MOVE 'F' TO WS-ACCTREL-FLAG                          01298000
012990             GO TO VPA-PRIMCOMBOPT.                               01299000
013000     MOVE MIM-7102BALCATCD2 TO WS-REL-BALCATCODE2 (1).            01300000
013010     MOVE MIM-7102BALCATCD2 TO WS-RPMIM7106RPREC.                 01301000
013020     PERFORM SEARCH-RPS-7106.                                     01302000
013030     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01303000
013040         IF MIM-7101ACCTRELCDI IS EQUAL TO 'O'                    01304000
013050             GO TO VPA-PRIMCOMBOPT                                01305000
013060         ELSE                                                     01306000
013070             ADD +1 TO WS-SUB2                                    01307000
013080             MOVE 2019 TO WS-REL-MSG (1 WS-SUB2)                  01308000
013090             MOVE 025 TO WS-REL-MSGNBR (1 WS-SUB2)                01309000
013100             MOVE 'F' TO WS-ACCTREL-FLAG                          01310000
013110             GO TO VPA-PRIMCOMBOPT.                               01311000
013120     MOVE MIM-7106BALREQ-I TO WS-REL-BALREQ2 (1).                 01312000
013130     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01313000
013140     PERFORM GET-BALANCE.                                         01314000
013150     MOVE WS-WORK-BALANCE TO WS-REL-BAL2 (1).                     01315000
013160     MOVE WS-WORK-BALANCE TO RPREL-ACCTBAL-2.                     01316000
013170     IF MIM-7101ACCTRELCDI IS EQUAL TO 'A'                        01317000
013180         AND WS-WORK-BALANCE IS LESS THAN MIM-7106BALREQ-I        01318000
013190         ADD +1 TO WS-SUB2                                        01319000
013200         MOVE 2019 TO WS-REL-MSG (1 WS-SUB2)                      01320000
013210         MOVE 026 TO WS-REL-MSGNBR (1 WS-SUB2)                    01321000
013220         MOVE 'F' TO WS-ACCTREL-FLAG                              01322000
013230         GO TO VPA-PRIMCOMBOPT.                                   01323000
013240     IF MIM-7101ACCTRELCDI IS EQUAL TO 'O'                        01324000
013250         AND WS-WORK-BALANCE IS NOT LESS THAN MIM-7106BALREQ-I    01325000
013260         MOVE 'Y' TO WS-RELACCT-OR-FLAG.                          01326000
013270 VPA-PRIMCOMBOPT.                                                 01327000
013280     MOVE 'N' TO WS-COMBBAL-FAIL.                                 01328000
013290     MOVE ZEROS TO RPREL-ACCT-COMBBAL1.                           01329000
013300     MOVE ZEROS TO RPREL-ACCT-COMBBAL2.                           01330000
013310     MOVE ZEROS TO RPREL-ACCT-COMBBAL3.                           01331000
013320     MOVE ZEROS TO RPREL-ACCT-COMBBAL4.                           01332000
013330     IF MIM-7101COMBCATCD1-I IS NOT EQUAL TO 'Y'                  01333000
013340         GO TO VPA-PRIMCOMBOPT2.                                  01334000
013350     IF MIM-7101COMBCATCD1 IS EQUAL TO SPACES                     01335000
013360         ADD +1 TO WS-SUB2                                        01336000
013370         MOVE 2021 TO WS-REL-MSG (1 WS-SUB2)                      01337000
013380         MOVE 027 TO WS-REL-MSGNBR (1 WS-SUB2)                    01338000
013390         MOVE 'F' TO WS-QUAL-FLAG                                 01339000
013400         MOVE 'Y' TO WS-COMBBAL-FAIL                              01340000
013410         MOVE 'Y' TO WS-MICM-NTFND                                01341000
013420         GO TO VPA-PRIMCOMBOPT2.                                  01342000
013430     MOVE MIM-7101COMBCATCD1 TO WS-RPMIM7106RPREC.                01343000
013440     PERFORM SEARCH-RPS-7106.                                     01344000
013450     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01345000
013460         ADD +1 TO WS-SUB2                                        01346000
013470         MOVE 2021 TO WS-REL-MSG (1 WS-SUB2)                      01347000
013480         MOVE 028 TO WS-REL-MSGNBR (1 WS-SUB2)                    01348000
013490         MOVE 'F' TO WS-QUAL-FLAG                                 01349000
013500         MOVE 'Y' TO WS-COMBBAL-FAIL                              01350000
013510         MOVE 'Y' TO WS-MICM-NTFND                                01351000
013520         GO TO VPA-PRIMCOMBOPT2.                                  01352000
013530     MOVE 'Y' TO WS-COMBCATCD1-FLAG.                              01353000
013540     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01354000
013550     MOVE MIM-7106BALCD TO WS-7101COMBBALCD1.                     01355000
013560     MOVE MIM-7106BALREQ-I TO WS-7101COMBBALREQ1.                 01356000
013570     IF MIM-7101PRIMCOMBOPT1 IS NOT EQUAL TO 'Y'                  01357000
013580         GO TO VPA-PRIMCOMBOPT2.                                  01358000
013590     IF MIM-7101PRIMCOMBOPT1-I IS NOT EQUAL TO 'Y'                01359000
013600         GO TO VPA-PRIMCOMBOPT2.                                  01360000
013610     IF MIM-7102COMBBALCD1-I IS EQUAL TO 'Y'                      01361000
013620         MOVE MIM-7102COMBBALCD1 TO WS-WORK-BALCD.                01362000
013630     PERFORM GET-BALANCE.                                         01363000
013640     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL1.                      01364000
013650     MOVE WS-WORK-BALANCE TO RPREL-ACCT-COMBBAL1.                 01365000
013660 VPA-PRIMCOMBOPT2.                                                01366000
013670     IF MIM-7101COMBCATCD2-I IS NOT EQUAL TO 'Y'                  01367000
013680         GO TO VPA-PRIMCOMBOPT3.                                  01368000
013690     IF MIM-7101COMBCATCD2 IS EQUAL TO SPACES                     01369000
013700         IF WS-COMBBAL-FAIL IS EQUAL TO 'Y'                       01370000
013710              GO TO VPA-PRIMCOMBOPT3                              01371000
013720         ELSE                                                     01372000
013730             ADD +1 TO WS-SUB2                                    01373000
013740             MOVE 2021 TO WS-REL-MSG (1 WS-SUB2)                  01374000
013750             MOVE 029 TO WS-REL-MSGNBR (1 WS-SUB2)                01375000
013760             MOVE 'F' TO WS-QUAL-FLAG                             01376000
013770             MOVE 'Y' TO WS-COMBBAL-FAIL                          01377000
013780             MOVE 'Y' TO WS-MICM-NTFND                            01378000
013790             GO TO VPA-PRIMCOMBOPT3.                              01379000
013800     MOVE MIM-7101COMBCATCD2 TO WS-RPMIM7106RPREC.                01380000
013810     PERFORM SEARCH-RPS-7106.                                     01381000
013820     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01382000
013830         IF WS-COMBBAL-FAIL IS EQUAL TO 'Y'                       01383000
013840              GO TO VPA-PRIMCOMBOPT3                              01384000
013850         ELSE                                                     01385000
013860             ADD +1 TO WS-SUB2                                    01386000
013870             MOVE 2021 TO WS-REL-MSG (1 WS-SUB2)                  01387000
013880             MOVE 030 TO WS-REL-MSGNBR (1 WS-SUB2)                01388000
013890             MOVE 'F' TO WS-QUAL-FLAG                             01389000
013900             MOVE 'Y' TO WS-COMBBAL-FAIL                          01390000
013910             MOVE 'Y' TO WS-MICM-NTFND                            01391000
013920             GO TO VPA-PRIMCOMBOPT3.                              01392000
013930     MOVE 'Y' TO WS-COMBCATCD2-FLAG.                              01393000
013940     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01394000
013950     MOVE MIM-7106BALCD TO WS-7101COMBBALCD2.                     01395000
013960     MOVE MIM-7106BALREQ-I TO WS-7101COMBBALREQ2.                 01396000
013970     IF MIM-7101PRIMCOMBOPT2 IS NOT EQUAL TO 'Y'                  01397000
013980         GO TO VPA-PRIMCOMBOPT3.                                  01398000
013990     IF MIM-7101PRIMCOMBOPT2-I IS NOT EQUAL TO 'Y'                01399000
014000         GO TO VPA-PRIMCOMBOPT3.                                  01400000
014010     IF MIM-7102COMBBALCD2-I IS  EQUAL TO 'Y'                     01401000
014020         MOVE MIM-7102COMBBALCD2 TO WS-WORK-BALCD.                01402000
014030     PERFORM GET-BALANCE.                                         01403000
014040     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL2.                      01404000
014050     MOVE WS-WORK-BALANCE TO RPREL-ACCT-COMBBAL2.                 01405000
014060 VPA-PRIMCOMBOPT3.                                                01406000
014070     IF MIM-7101COMBCATCD3-I IS NOT EQUAL TO 'Y'                  01407000
014080         GO TO VPA-PRIMCOMBOPT4.                                  01408000
014090     IF MIM-7101COMBCATCD3 IS EQUAL TO SPACES                     01409000
014100         IF WS-COMBBAL-FAIL IS EQUAL TO 'Y'                       01410000
014110              GO TO VPA-PRIMCOMBOPT4                              01411000
014120         ELSE                                                     01412000
014130             ADD +1 TO WS-SUB2                                    01413000
014140             MOVE 2021 TO WS-REL-MSG (1 WS-SUB2)                  01414000
014150             MOVE 050 TO WS-REL-MSGNBR (1 WS-SUB2)                01415000
014160             MOVE 'F' TO WS-QUAL-FLAG                             01416000
014170             MOVE 'Y' TO WS-COMBBAL-FAIL                          01417000
014180             MOVE 'Y' TO WS-MICM-NTFND                            01418000
014190             GO TO VPA-PRIMCOMBOPT4.                              01419000
014200     MOVE MIM-7101COMBCATCD3 TO WS-RPMIM7106RPREC.                01420000
014210     PERFORM SEARCH-RPS-7106.                                     01421000
014220     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01422000
014230         IF WS-COMBBAL-FAIL IS EQUAL TO 'Y'                       01423000
014240              GO TO VPA-PRIMCOMBOPT4                              01424000
014250         ELSE                                                     01425000
014260             ADD +1 TO WS-SUB2                                    01426000
014270             MOVE 2021 TO WS-REL-MSG (1 WS-SUB2)                  01427000
014280             MOVE 051 TO WS-REL-MSGNBR (1 WS-SUB2)                01428000
014290             MOVE 'F' TO WS-QUAL-FLAG                             01429000
014300             MOVE 'Y' TO WS-COMBBAL-FAIL                          01430000
014310             MOVE 'Y' TO WS-MICM-NTFND                            01431000
014320             GO TO VPA-PRIMCOMBOPT4.                              01432000
014330     MOVE 'Y' TO WS-COMBCATCD3-FLAG.                              01433000
014340     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01434000
014350     MOVE MIM-7106BALCD TO WS-7101COMBBALCD3.                     01435000
014360     MOVE MIM-7106BALREQ-I TO WS-7101COMBBALREQ3.                 01436000
014370     IF MIM-7101PRIMCOMBOPT3 IS NOT EQUAL TO 'Y'                  01437000
014380         GO TO VPA-PRIMCOMBOPT4.                                  01438000
014390     IF MIM-7101PRIMCOMBOPT3-I IS NOT EQUAL TO 'Y'                01439000
014400         GO TO VPA-PRIMCOMBOPT4.                                  01440000
014410     IF MIM-7102COMBBALCD3-I IS EQUAL TO 'Y'                      01441000
014420         MOVE MIM-7102COMBBALCD3 TO WS-WORK-BALCD.                01442000
014430     PERFORM GET-BALANCE.                                         01443000
014440     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL3.                      01444000
014450     MOVE WS-WORK-BALANCE TO RPREL-ACCT-COMBBAL3.                 01445000
014460 VPA-PRIMCOMBOPT4.                                                01446000
014470     IF MIM-7101COMBCATCD4-I IS NOT EQUAL TO 'Y'                  01447000
014480         GO TO VPA-CASH-REWARD.                                   01448000
014490     IF MIM-7101COMBCATCD4 IS EQUAL TO SPACES                     01449000
014500         ADD +1 TO WS-SUB2                                        01450000
014510         MOVE 2021 TO WS-REL-MSG (1 WS-SUB2)                      01451000
014520         MOVE 052 TO WS-REL-MSGNBR (1 WS-SUB2)                    01452000
014530         MOVE 'F' TO WS-QUAL-FLAG                                 01453000
014540         MOVE 'Y' TO WS-MICM-NTFND                                01454000
014550         GO TO VPA-CASH-REWARD.                                   01455000
014560     MOVE MIM-7101COMBCATCD4 TO WS-RPMIM7106RPREC.                01456000
014570     PERFORM SEARCH-RPS-7106.                                     01457000
014580     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01458000
014590         ADD +1 TO WS-SUB2                                        01459000
014600         MOVE 2021 TO WS-REL-MSG (1 WS-SUB2)                      01460000
014610         MOVE 053 TO WS-REL-MSGNBR (1 WS-SUB2)                    01461000
014620         MOVE 'F' TO WS-QUAL-FLAG                                 01462000
014630         MOVE 'Y' TO WS-MICM-NTFND                                01463000
014640         GO TO VPA-CASH-REWARD.                                   01464000
014650     MOVE 'Y' TO WS-COMBCATCD4-FLAG.                              01465000
014660     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01466000
014670     MOVE MIM-7106BALCD TO WS-7101COMBBALCD4.                     01467000
014680     MOVE MIM-7106BALREQ-I TO WS-7101COMBBALREQ4.                 01468000
014690     IF MIM-7101PRIMCOMBOPT4 IS NOT EQUAL TO 'Y'                  01469000
014700         GO TO VPA-CASH-REWARD.                                   01470000
014710     IF MIM-7101PRIMCOMBOPT4-I IS NOT EQUAL TO 'Y'                01471000
014720         GO TO VPA-CASH-REWARD.                                   01472000
014730     IF MIM-7102COMBBALCD4-I IS EQUAL TO 'Y'                      01473000
014740         MOVE MIM-7102COMBBALCD4 TO WS-WORK-BALCD.                01474000
014750     PERFORM GET-BALANCE.                                         01475000
014760     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL4.                      01476000
014770     MOVE WS-WORK-BALANCE TO RPREL-ACCT-COMBBAL4.                 01477000
014780 VPA-CASH-REWARD.                                                 01478000
014790     IF MIM-7101CRWOPT IS EQUAL TO 'N'                            01479000
014800         OR WS-HAVE-CRW IS EQUAL TO 'N'                           01480000
014810         OR MIM-7102CRWBALCD IS EQUAL TO ZEROS                    01481000
014820         MOVE ZEROS TO RPREL-CASH-RW-BAL                          01482000
014830         GO TO VPA-REWRITE-REL.                                   01483000
014840     MOVE MIM-7102CRWBALCD TO WS-WORK-BALCD.                      01484000
014850     PERFORM GET-BALANCE.                                         01485000
014860     MOVE WS-WORK-BALANCE TO RPREL-CASH-RW-BAL.                   01486000
014870     IF RPREL-CASH-RW-BAL IS LESS THAN MIM-7102CRWMINAMT          01487000
014880         MOVE ZEROS TO RPREL-CASH-RW-BAL.                         01488000
014890     IF RPREL-CASH-RW-BAL IS GREATER THAN MIM-7102CRWMAXAMT       01489000
014900         MOVE MIM-7102CRWMAXAMT TO RPREL-CASH-RW-BAL.             01490000
014910     MOVE RPREL-CASH-RW-BAL TO WS-CRW-COMBBAL.                    01491000
014920     GO TO VPA-REWRITE-REL.                                       01492000
014930 VPA-INIT-REL.                                                    01493000
014940     MOVE 'Y' TO WS-PRIM-INVALID-FLAG.                            01494000
014950     MOVE 'N' TO WS-REL-SCINCOPT (1).                             01495000
014960     MOVE 'N' TO WS-REL-RATEINCOPT (1).                           01496000
014970     MOVE 'I' TO WS-REL-RATETYPE (1).                             01497000
014980     MOVE 'N' TO WS-REL-TIMEPROCOPT (1).                          01498000
014990     MOVE 'N' TO RPREL-SC-INC-OPTION.                             01499000
015000     MOVE 'N' TO RPREL-RATE-INC-OPTION.                           01500000
015010     MOVE ZEROS TO WS-REL-RATEPCT (1).                            01501000
015020 VPA-INIT-REL1.                                                   01502000
015030     MOVE ZEROS TO WS-REL-SECSVCBAL (1).                          01503000
015040     MOVE ZEROS TO RPREL-ACCTBAL-1.                               01504000
015050     MOVE ZEROS TO RPREL-ACCTBAL-2.                               01505000
015060     MOVE ZEROS TO RPREL-PRIMEBAL.                                01506000
015070     MOVE ZEROS TO RPREL-ACCT-COMBBAL1.                           01507000
015080     MOVE ZEROS TO RPREL-ACCT-COMBBAL2.                           01508000
015090     MOVE ZEROS TO RPREL-ACCT-COMBBAL3.                           01509000
015100     MOVE ZEROS TO RPREL-ACCT-COMBBAL4.                           01510000
015110     MOVE ZEROS TO RPREL-SC-BAL.                                  01511000
015120     MOVE ZEROS TO RPREL-ACCT-RATE-BAL.                           01512000
015130     MOVE ZEROS TO RPREL-CASH-RW-BAL.                             01513000
015140 VPA-REWRITE-REL.                                                 01514000
015150     MOVE 'W  ' TO SR-APIFUNC.                                    01515000
015160     PERFORM CALL-RPS-REL.                                        01516000
015170     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01517000
015180         DISPLAY 'PRI KEY: ' RPMST-GRP-KEY                        01518000
015190         GO TO AR-0015.                                           01519000
015200     GO TO VPA-END.                                               01520000
015210 VPA-DELETE-REL.                                                  01521000
015220     IF MIM-7100EVENTHISTORYOPT IS EQUAL TO 'N'                   01522000
015230         OR WS-EXPIRED-FLAG IS EQUAL TO 'Y'                       01523000
015240         GO TO VPA-DELETE-REL-CONT.                               01524000
015250 VPA-EVT.                                                         01525000
015260     MOVE 'N' TO RPS-EVT-FLAG.                                    01526000
015270     MOVE 03 TO RPS-EVT-EVENT-CODE.                               01527000
015280     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   01528000
015290     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   01529000
015300     MOVE RPMST-IDNUMBER TO RPS-EVT-IDNUMBER.                     01530000
015310     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        01531000
015320     IF WS-REL-MSG-TABLE (1 1) IS EQUAL TO SPACES                 01532000
015330         MOVE ZEROS TO RPS-EVT-MSGNBR                             01533000
015340     ELSE                                                         01534000
015350         MOVE WS-REL-MSG (1 1) TO RPS-EVT-MSGNBR.                 01535000
015360     PERFORM ADD-EVENT-HISTORY.                                   01536000
015370     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01537000
015380         GO TO AR-0063.                                           01538000
015390 VPA-DELETE-REL-CONT.                                             01539000
015400     ADD +1 TO WS-NUMOFACCTDEL.                                   01540000
015410     MOVE 'Y' TO WS-REL-ACCTDEL (1).                              01541000
015420     MOVE 'D  ' TO SR-APIFUNC.                                    01542000
015430     PERFORM CALL-RPS-REL.                                        01543000
015440     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01544000
015450         DISPLAY 'PRI KEY: ' RPMST-GRP-KEY                        01545000
015460         GO TO AR-0016.                                           01546000
015470 VPA-END.                                                         01547000
015480     MOVE WS-SUB2 TO WS-PRIMMSG-SUB.                              01548000
015490 VPA-EXIT.                                                        01549000
015500     EXIT.                                                        01550000
015510******************************************************************01551000
015520 VALIDATE-SECONDARY-ACCOUNTS SECTION.                             01552000
015530 VSA-START.                                                       01553000
015540     MOVE +1 TO WS-SUBSEC.                                        01554000
015550     MOVE 'S' TO WS-PROCESS-AREA.                                 01555000
015560 VSA-REL.                                                         01556000
015570     MOVE 'N  ' TO SR-APIFUNC.                                    01557000
015580     PERFORM CALL-RPS-REL.                                        01558000
015590     IF WS-FUNCTION IS EQUAL TO 'E'                               01559000
015600         GO TO VSA-EXIT.                                          01560000
015610     IF RPMST-GRP-KEY IS NOT EQUAL TO RPREL-ACCT1-GRP             01561000
015620         GO TO VSA-EXIT.                                          01562000
015630     MOVE 'N' TO WS-7102-FOUND.                                   01563000
015640     IF RPREL-ACCT-STATUS IS EQUAL TO 'R'                         01564000
015650         AND WS-QUAL-FLAG IS EQUAL TO 'D'                         01565000
015670         GO TO VSA-DELETE-REL.                                    01567000
015680     IF RPREL-ACCT-STATUS IS EQUAL TO 'R'                         01568000
015690         GO TO VSA-REL.                                           01569000
015700     ADD +1 TO WS-SUBSEC.                                         01570000
015710     IF WS-SUBSEC IS GREATER THAN WS-REL-MAX                      01571000
015720         GO TO VSA-REL.                                           01572000
015730     ADD +1 TO WS-SUB1.                                           01573000
015740     MOVE ZEROS TO WS-SUB2.                                       01574000
015750     MOVE RPREL-INST TO WS-REL-INST (WS-SUB1).                    01575000
015760     MOVE RPREL-INST2 TO WS-REL-INST2 (WS-SUB1).                  01576000
015770     MOVE RPREL-PRODCODE2 TO WS-REL-PRODCODE (WS-SUB1).           01577000
015780     MOVE RPREL-ACCOUNT2 TO WS-REL-ACCOUNT (WS-SUB1).             01578000
015790     MOVE RPREL-BRANCH TO WS-REL-BRANCH (WS-SUB1).                01579000
015800     MOVE RPREL-ACCT-TYPE TO WS-REL-ACCT-TYPE (WS-SUB1).          01580000
015810     MOVE RPREL-APPL TO WS-REL-APPL (WS-SUB1).                    01581000
015820     MOVE RPREL-SC-INC-OPTION TO WS-REL-SCINCOPT (WS-SUB1).       01582000
015830     MOVE RPREL-RATE-INC-OPTION TO WS-REL-RATEINCOPT (WS-SUB1).   01583000
015840     MOVE RPREL-ACCT-STATUS TO WS-REL-ACCT-STATUS (WS-SUB1).      01584000
015850     MOVE RPREL-DISCAMT-OVRD-FLAG                                 01585000
015860         TO WS-REL-DISCAMT-OVRD-FLAG (WS-SUB1).                   01586000
015870     MOVE RPREL-DISCAMT-OVRD TO WS-REL-DISCAMT-OVRD (WS-SUB1).    01587000
015880     MOVE RPREL-DISCPCT-OVRD-FLAG                                 01588000
015890         TO WS-REL-DISCPCT-OVRD-FLAG (WS-SUB1).                   01589000
015900     MOVE RPREL-DISCPCT-OVRD TO WS-REL-DISCPCT-OVRD (WS-SUB1).    01590000
015910     MOVE RPREL-RATEPCT-OVRD-FLAG                                 01591000
015920         TO WS-REL-RATEPCT-OVRD-FLAG (WS-SUB1).                   01592000
015930     MOVE RPREL-RATEPCT-OVRD TO WS-REL-RATEPCT-OVRD (WS-SUB1).    01593000
015940     MOVE '0' TO WS-REL-RATEOPTION (WS-SUB1).                     01594000
015950     MOVE 'N' TO WS-REL-SEC-SERVICE (WS-SUB1).                    01595000
015960     MOVE SPACES TO WS-REL-SECSVCPLAN (WS-SUB1).                  01596000
015970     MOVE SPACES TO WS-REL-SECSVCTABLE (WS-SUB1).                 01597000
015980     MOVE ZEROS TO WS-REL-SECSVCBAL (WS-SUB1).                    01598000
015990     IF WS-QUAL-FLAG IS EQUAL TO 'D'                              01599000
016000         GO TO VSA-DELETE-REL.                                    01600000
016010 VSA-2023.                                                        01601000
016020     MOVE RPREL-PRODCODE2 TO WS-RPMIM2023PRODCD.                  01602000
016030     PERFORM SEARCH-RPS-2023.                                     01603000
016040     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         01604000
016050         MOVE +1 TO WS-SUB2                                       01605000
016060         MOVE 2004 TO WS-REL-MSG (WS-SUB1 WS-SUB2)                01606000
016070         MOVE 031 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)              01607000
016080         ADD +1 TO WS-SUB2                                        01608000
016090         MOVE 2022 TO WS-REL-MSG (WS-SUB1 WS-SUB2)                01609000
016100         MOVE 032 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)              01610000
016110         GO TO VSA-DELETE-REL.                                    01611000
016120     IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'Y'              01612000
016130         GO TO VSA-INT.                                           01613000
016140     IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'P'              01614000
016150         GO TO VSA-RCIF.                                          01615000
016160     MOVE +1 TO WS-SUB2.                                          01616000
016170     MOVE 2005 TO WS-REL-MSG (1 WS-SUB2).                         01617000
016180     MOVE 033 TO WS-REL-MSGNBR (1 WS-SUB2).                       01618000
016190     ADD +1 TO WS-SUB2.                                           01619000
016200     MOVE 2022 TO WS-REL-MSG (1 WS-SUB2).                         01620000
016210     MOVE 034 TO WS-REL-MSGNBR (1 WS-SUB2).                       01621000
016220     GO TO VSA-DELETE-REL.                                        01622000
016230 VSA-INT.                                                         01623000
016240     IF RPREL-GRP-KEY IS EQUAL TO RPINT-GRP-KEY                   01624000
016250         GO TO VSA-INT-CONT.                                      01625000
016260     IF RPINT-GRP-KEY IS GREATER THAN RPREL-GRP-KEY               01626000
016270         DISPLAY 'REL KEY: ' RPREL-GRP-KEY                        01627000
016280         GO TO AR-0046.                                           01628000
016290     MOVE 'N  ' TO SR-APIFUNC.                                    01629000
016300     PERFORM CALL-RPS-INT.                                        01630000
016310     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01631000
016320         DISPLAY 'ACCT KEY: ' RPINT-GRP-KEY                       01632000
016330         GO TO AR-0017.                                           01633000
016340     GO TO VSA-INT.                                               01634000
016350 VSA-INT-CONT.                                                    01635000
016360     IF RPINT-ACCT-STATUS IS EQUAL TO 'N'                         01636000
016370         MOVE +1 TO WS-SUB2                                       01637000
016380         MOVE 2006 TO WS-REL-MSG (WS-SUB1 WS-SUB2)                01638000
016390         MOVE 035 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)              01639000
016400         ADD +1 TO WS-SUB2                                        01640000
016410         MOVE 2022 TO WS-REL-MSG (WS-SUB1 WS-SUB2)                01641000
016420         MOVE 036 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)              01642000
016430         GO TO VSA-DELETE-REL.                                    01643000
016440     MOVE RPINT-BRANCH TO RPREL-BRANCH.                           01644000
016450     MOVE RPINT-ACCT-TYPE TO RPREL-ACCT-TYPE.                     01645000
016460     MOVE RPINT-BRANCH TO WS-REL-BRANCH (WS-SUB1).                01646000
016470     MOVE RPINT-ACCT-TYPE TO WS-REL-ACCT-TYPE (WS-SUB1).          01647000
016480     MOVE RPINT-TERM TO WS-REL-TERM (WS-SUB1).                    01648000
016490     GO TO VSA-7102.                                              01649000
016500 VSA-RCIF.                                                        01650000
016510     MOVE RPREL-INST2 TO WS-INST.                                 01651000
016520     MOVE RPREL-PRODCODE2 TO WS-PRODCODE.                         01652000
016530     MOVE RPREL-ACCOUNT2 TO WS-ACCOUNT.                           01653000
016540     MOVE 'T' TO WS-FUNC.                                         01654000
016550     PERFORM CALL-RCIF.                                           01655000
016560     IF WS-FUNCTION IS EQUAL TO 'N'                               01656000
016570         MOVE +1 TO WS-SUB2                                       01657000
016580         MOVE 2007 TO WS-REL-MSG (WS-SUB1 WS-SUB2)                01658000
016590         MOVE 037 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)              01659000
016600         ADD +1 TO WS-SUB2                                        01660000
016610         MOVE 2022 TO WS-REL-MSG (WS-SUB1 WS-SUB2)                01661000
016620         MOVE 038 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)              01662000
016630         GO TO VSA-DELETE-REL.                                    01663000
016640     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01664000
016650         DISPLAY 'ACCT KEY: ' RPREL-ACCT2-GRP                     01665000
016660         GO TO AR-0018.                                           01666000
016670     IF WS-RO-STATUS IS NOT EQUAL TO 'O'                          01667000
016680         MOVE +1 TO WS-SUB2                                       01668000
016690         MOVE 2008 TO WS-REL-MSG (WS-SUB1 WS-SUB2)                01669000
016700         MOVE 039 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)              01670000
016710         ADD +1 TO WS-SUB2                                        01671000
016720         MOVE 2022 TO WS-REL-MSG (WS-SUB1 WS-SUB2)                01672000
016730         MOVE 040 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)              01673000
016740         GO TO VSA-DELETE-REL.                                    01674000
016750     MOVE ZEROS TO WS-REL-BRANCH (WS-SUB1).                       01675000
016760     MOVE ZEROS TO WS-REL-ACCT-TYPE (WS-SUB1).                    01676000
016770     MOVE ZEROS TO WS-REL-TERM (WS-SUB1).                         01677000
016780 VSA-7102.                                                        01678000
016790     IF WS-PRIM-INVALID-FLAG IS EQUAL TO 'Y'                      01679000
016800         GO TO VSA-INIT-REL.                                      01680000
016810     MOVE RPMST-MODEL TO WS-RPMIM7102MODEL.                       01681000
016820     MOVE RPREL-PRODCODE2 TO WS-RPMIM7102PRODCODE.                01682000
016830     IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'P'              01683000
016840         GO TO VSA-7102-TYPEZERO.                                 01684000
016850     MOVE WS-REL-ACCT-TYPE (WS-SUB1) TO WS-RPMIM7102TYPE.         01685000
016860     PERFORM SEARCH-RPS-7102.                                     01686000
016870     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01687000
016880         GO TO VSA-7102-FOUND.                                    01688000
016890 VSA-7102-TYPEZERO.                                               01689000
016900     MOVE ZEROS TO WS-RPMIM7102TYPE.                              01690000
016910     PERFORM SEARCH-RPS-7102.                                     01691000
016920     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01692000
016930         GO TO VSA-7102-FOUND.                                    01693000
016940 VSA-7102-MODELONLY.                                              01694000
016950     MOVE SPACES TO WS-RPMIM7102PRODCODE.                         01695000
016960     MOVE ZEROS TO WS-RPMIM7102TYPE.                              01696000
016970     PERFORM SEARCH-RPS-7102.                                     01697000
016980     IF WS-RPMIM7102FOUND IS NOT EQUAL TO 'N'                     01698000
016990         GO TO VSA-7102-FOUND.                                    01699000
017000     IF MIM-7101ACCTRELCD-I IS NOT EQUAL TO 'Y'                   01700000
017010         OR MIM-7101ACCTRELCDI IS NOT EQUAL TO 'A'                01701000
017020         MOVE +1 TO WS-SUB2                                       01702000
017030         MOVE 2013 TO WS-REL-MSG (WS-SUB1 WS-SUB2)                01703000
017040         MOVE 041 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)              01704000
017050         GO TO VSA-INIT-REL.                                      01705000
017060     MOVE +1 TO WS-SUB2.                                          01706000
017070     MOVE 2013 TO WS-REL-MSG (WS-SUB1 WS-SUB2).                   01707000
017080     MOVE 041 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2).                 01708000
017090     MOVE 'Y' TO WS-PRODMOD-FAIL.                                 01709000
017100     MOVE 'F' TO WS-QUAL-FLAG.                                    01710000
017110     MOVE 'Y' TO WS-MICM-NTFND.                                   01711000
017120     GO TO VSA-INIT-REL.                                          01712000
017130 VSA-7102-FOUND.                                                  01713000
017140     MOVE 'Y' TO WS-7102-FOUND.                                   01714000
017150     MOVE MIM-7102SECSCINCOPT TO WS-REL-SCINCOPT (WS-SUB1).       01715000
017160     MOVE MIM-7102DISCAMT TO WS-REL-SCDISCAMT (WS-SUB1).          01716000
017170     MOVE MIM-7102DISCPCT TO WS-REL-SCDISCPCT (WS-SUB1).          01717000
017180     MOVE MIM-7102SCINCTABLE TO WS-REL-SCCATCODE (WS-SUB1).       01718000
017190     MOVE MIM-7102SECRATEINCOPT TO WS-REL-RATEINCOPT (WS-SUB1).   01719000
017200     MOVE MIM-7102RATETYPE TO WS-REL-RATETYPE (WS-SUB1).          01720000
P0167      MOVE MIM-7102ACCTRATEBALCD TO WS-REL-RATEBALCODE (WS-SUB1).  01720500
017210     MOVE MIM-7102RATEPCT TO WS-REL-RATEPCT (WS-SUB1).            01721000
017220     MOVE MIM-7102RATEINCTABLE TO WS-REL-RATECATCODE (WS-SUB1).   01722000
017230     MOVE MIM-7102TIMEPROCOPT TO WS-REL-TIMEPROCOPT (WS-SUB1).    01723000
017240     IF RPREL-ACCT-STATUS IS EQUAL TO 'U'                         01724000
017250         AND MIM-7100ADDONINCOPT IS EQUAL TO 'N'                  01725000
017260         MOVE 'N' TO RPREL-SC-INC-OPTION                          01726000
017270         MOVE 'N' TO RPREL-RATE-INC-OPTION                        01727000
017280     ELSE                                                         01728000
017290         MOVE MIM-7102SECSCINCOPT TO RPREL-SC-INC-OPTION          01729000
017300         MOVE MIM-7102SECRATEINCOPT TO RPREL-RATE-INC-OPTION.     01730000
017310     IF MIM-7102SECSVCPLAN IS NOT EQUAL TO SPACES                 01731000
017320         OR MIM-7102SECSVCTABLE IS NOT EQUAL TO SPACES            01732000
017330         MOVE 'Y' TO WS-REL-SEC-SERVICE (WS-SUB1).                01733000
017340     MOVE MIM-7102SECSVCOPT TO WS-REL-SECSVCOPT (WS-SUB1).        01734000
017350     MOVE MIM-7102SECSVCPLAN TO WS-REL-SECSVCPLAN (WS-SUB1).      01735000
017360     MOVE MIM-7102SECSVCTABLE TO WS-REL-SECSVCTABLE (WS-SUB1).    01736000
017370     MOVE MIM-7102BONUSRATEOPT TO WS-REL-BONUSRATEOPT (WS-SUB1).  01737000
017380     IF WS-PROCOPT-FLAG IS EQUAL TO 'E'                           01738000
017390         MOVE RPREL-SC-BAL TO WS-REL-SCBAL (WS-SUB1)              01739000
017400         MOVE RPREL-ACCT-RATE-BAL TO WS-REL-ACCTRATEBAL (WS-SUB1) 01740000
017410         MOVE RPREL-DISCAMT-OVRD-FLAG                             01741000
017420             TO WS-REL-DISCAMT-OVRD-FLAG (WS-SUB1)                01742000
017430         MOVE RPREL-DISCAMT-OVRD TO WS-REL-DISCAMT-OVRD (WS-SUB1) 01743000
017440         MOVE RPREL-DISCPCT-OVRD-FLAG                             01744000
017450             TO WS-REL-DISCPCT-OVRD-FLAG (WS-SUB1)                01745000
017460         MOVE RPREL-DISCPCT-OVRD TO WS-REL-DISCPCT-OVRD (WS-SUB1) 01746000
017470         MOVE RPREL-DISCPCT-OVRD-FLAG                             01747000
017480             TO WS-REL-DISCPCT-OVRD-FLAG (WS-SUB1)                01748000
017490         MOVE RPREL-DISCPCT-OVRD TO WS-REL-DISCPCT-OVRD (WS-SUB1) 01749000
017500         GO TO VSA-REWRITE-REL.                                   01750000
017510     IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'P'              01751000
017520         GO TO VSA-INIT-REL-BALS.                                 01752000
017530 VSA-SC-BALANCE.                                                  01753000
017540     MOVE ZEROS TO WS-REL-SCBAL (WS-SUB1).                        01754000
017550     MOVE ZEROS TO RPREL-SC-BAL.                                  01755000
017560     IF MIM-7102SCBALCD IS EQUAL TO ZEROS                         01756000
017570         GO TO VSA-RATE-BALANCE.                                  01757000
017580     MOVE MIM-7102SCBALCD TO WS-WORK-BALCD.                       01758000
017590     PERFORM GET-BALANCE.                                         01759000
017600     MOVE WS-WORK-BALANCE TO WS-REL-SCBAL (WS-SUB1).              01760000
017610     MOVE WS-WORK-BALANCE TO RPREL-SC-BAL.                        01761000
017620 VSA-RATE-BALANCE.                                                01762000
017630     MOVE ZEROS TO WS-REL-ACCTRATEBAL (WS-SUB1).                  01763000
017640     MOVE ZEROS TO RPREL-ACCT-RATE-BAL.                           01764000
017650     IF MIM-7102ACCTRATEBALCD IS EQUAL TO ZEROS                   01765000
017660         GO TO VSA-SECSVC-BALANCE.                                01766000
017670     MOVE MIM-7102ACCTRATEBALCD TO WS-WORK-BALCD.                 01767000
017680     PERFORM GET-BALANCE.                                         01768000
017690     MOVE WS-WORK-BALANCE TO WS-REL-ACCTRATEBAL (WS-SUB1).        01769000
017700     MOVE WS-WORK-BALANCE TO RPREL-ACCT-RATE-BAL.                 01770000
017710 VSA-SECSVC-BALANCE.                                              01771000
017720     MOVE ZEROS TO WS-REL-SECSVCBAL (WS-SUB1).                    01772000
017730     MOVE ZEROS TO RPREL-SECSVC-BAL.                              01773000
017740     IF MIM-7102SECSVCBALCD IS EQUAL TO ZEROS                     01774000
017750         GO TO VSA-IND-BALANCES.                                  01775000
017760     MOVE MIM-7102SECSVCBALCD TO WS-WORK-BALCD.                   01776000
017770     PERFORM GET-BALANCE.                                         01777000
017780     MOVE WS-WORK-BALANCE TO WS-REL-SECSVCBAL (WS-SUB1).          01778000
017790     MOVE WS-WORK-BALANCE TO RPREL-SECSVC-BAL.                    01779000
017800 VSA-IND-BALANCES.                                                01780000
017810     MOVE ZEROS TO RPREL-ACCTBAL-1.                               01781000
017820     MOVE ZEROS TO RPREL-ACCTBAL-2.                               01782000
017830     IF MIM-7101ACCTRELCD-I IS NOT EQUAL TO 'Y'                   01783000
017840         GO TO VSA-COMBBAL.                                       01784000
017850     MOVE ZEROS TO WS-REL-BAL1 (WS-SUB1).                         01785000
017860     MOVE ZEROS TO WS-REL-BALREQ1 (WS-SUB1).                      01786000
017870     MOVE ZEROS TO WS-REL-BAL2 (WS-SUB1).                         01787000
017880     MOVE ZEROS TO WS-REL-BALREQ2 (WS-SUB1).                      01788000
017890 VSA-BALCATCD1.                                                   01789000
017900     IF MIM-7102BALCATCD1-I IS NOT EQUAL TO 'Y'                   01790000
017910         GO TO VSA-BALCATCD2.                                     01791000
017920     IF MIM-7102BALCATCD1 IS EQUAL TO SPACES                      01792000
017930         GO TO VSA-BALCATCD2.                                     01793000
017940     MOVE MIM-7102BALCATCD1 TO WS-RPMIM7106RPREC.                 01794000
017950     PERFORM SEARCH-RPS-7106.                                     01795000
017960     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01796000
017970         GO TO VSA-BALCATCD2.                                     01797000
017980     MOVE MIM-7102BALCATCD1 TO WS-REL-BALCATCODE1 (WS-SUB1).      01798000
017990     MOVE MIM-7106BALREQ-I TO WS-REL-BALREQ1 (WS-SUB1).           01799000
018000     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01800000
018010     PERFORM GET-BALANCE.                                         01801000
018020     MOVE WS-WORK-BALANCE TO WS-REL-BAL1 (WS-SUB1).               01802000
018030     MOVE WS-WORK-BALANCE TO RPREL-ACCTBAL-1.                     01803000
018040     IF WS-WORK-BALANCE IS LESS THAN MIM-7106BALREQ-I             01804000
018050         GO TO VSA-BALCATCD2.                                     01805000
018060     IF MIM-7101ACCTRELCDI IS EQUAL TO 'O'                        01806000
018070         MOVE 'Y' TO WS-RELACCT-OR-FLAG.                          01807000
018080     GO TO VSA-COMBBAL.                                           01808000
018090 VSA-BALCATCD2.                                                   01809000
018100     IF MIM-7102BALCATCD2-I IS NOT EQUAL TO 'Y'                   01810000
018110         IF MIM-7101ACCTRELCDI IS EQUAL TO 'O'                    01811000
018120             GO TO VSA-COMBBAL                                    01812000
018130         ELSE                                                     01813000
018140             ADD +1 TO WS-SUB2                                    01814000
018150             MOVE 2019 TO WS-REL-MSG (WS-SUB1 WS-SUB2)            01815000
018160             MOVE 042 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)          01816000
018170             MOVE 'F' TO WS-ACCTREL-FLAG                          01817000
018180             GO TO VSA-COMBBAL.                                   01818000
018190     IF MIM-7102BALCATCD2 IS EQUAL TO SPACES                      01819000
018200         IF MIM-7101ACCTRELCDI IS EQUAL TO 'O'                    01820000
018210             GO TO VSA-COMBBAL                                    01821000
018220         ELSE                                                     01822000
018230             ADD +1 TO WS-SUB2                                    01823000
018240             MOVE 2019 TO WS-REL-MSG (WS-SUB1 WS-SUB2)            01824000
018250             MOVE 043 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)          01825000
018260             MOVE 'F' TO WS-ACCTREL-FLAG                          01826000
018270             GO TO VSA-COMBBAL.                                   01827000
018280     MOVE MIM-7102BALCATCD2 TO WS-REL-BALCATCODE2 (WS-SUB1).      01828000
018290     MOVE MIM-7102BALCATCD2 TO WS-RPMIM7106RPREC.                 01829000
018300     PERFORM SEARCH-RPS-7106.                                     01830000
018310     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01831000
018320         IF MIM-7101ACCTRELCDI IS EQUAL TO 'O'                    01832000
018330             GO TO VSA-COMBBAL                                    01833000
018340         ELSE                                                     01834000
018350             ADD +1 TO WS-SUB2                                    01835000
018360             MOVE 2019 TO WS-REL-MSG (WS-SUB1 WS-SUB2)            01836000
018370             MOVE 044 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)          01837000
018380             MOVE 'F' TO WS-ACCTREL-FLAG                          01838000
018390             GO TO VSA-COMBBAL.                                   01839000
018400     MOVE MIM-7106BALREQ-I TO WS-REL-BALREQ2 (WS-SUB1).           01840000
018410     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         01841000
018420     PERFORM GET-BALANCE.                                         01842000
018430     MOVE WS-WORK-BALANCE TO WS-REL-BAL2 (WS-SUB1).               01843000
018440     MOVE WS-WORK-BALANCE TO RPREL-ACCTBAL-2.                     01844000
018450     IF MIM-7101ACCTRELCDI IS EQUAL TO 'A'                        01845000
018460         AND WS-WORK-BALANCE IS LESS THAN MIM-7106BALREQ-I        01846000
018470         ADD +1 TO WS-SUB2                                        01847000
018480         MOVE 2019 TO WS-REL-MSG (WS-SUB1 WS-SUB2)                01848000
018490         MOVE 045 TO WS-REL-MSGNBR (WS-SUB1 WS-SUB2)              01849000
018500         MOVE 'F' TO WS-ACCTREL-FLAG                              01850000
018510         GO TO VSA-COMBBAL.                                       01851000
018520     IF MIM-7101ACCTRELCDI IS EQUAL TO 'O'                        01852000
018530         AND WS-WORK-BALANCE IS NOT LESS THAN MIM-7106BALREQ-I    01853000
018540         MOVE 'Y' TO WS-RELACCT-OR-FLAG.                          01854000
018550 VSA-COMBBAL.                                                     01855000
018560     MOVE ZEROS TO RPREL-ACCT-COMBBAL1.                           01856000
018570     MOVE ZEROS TO RPREL-ACCT-COMBBAL2.                           01857000
018580     MOVE ZEROS TO RPREL-ACCT-COMBBAL3.                           01858000
018590     MOVE ZEROS TO RPREL-ACCT-COMBBAL4.                           01859000
018600     IF MIM-7101COMBCATCD1-I IS NOT EQUAL TO 'Y'                  01860000
018610         GO TO VSA-COMBBAL2.                                      01861000
018620     IF MIM-7101COMBCATCD1 IS EQUAL TO SPACES                     01862000
018630         GO TO VSA-COMBBAL2.                                      01863000
018640     IF WS-COMBCATCD1-FLAG IS NOT EQUAL TO 'Y'                    01864000
018650         GO TO VSA-COMBBAL2.                                      01865000
018660     MOVE WS-7101COMBBALCD1 TO WS-WORK-BALCD.                     01866000
018670     IF MIM-7102COMBBALCD1-I IS EQUAL TO 'Y'                      01867000
018680         MOVE MIM-7102COMBBALCD1 TO WS-WORK-BALCD.                01868000
018690     PERFORM GET-BALANCE.                                         01869000
018700     ADD WS-WORK-BALANCE TO WS-COMBINEBAL1.                       01870000
018710     MOVE WS-WORK-BALANCE TO RPREL-ACCT-COMBBAL1.                 01871000
018720 VSA-COMBBAL2.                                                    01872000
018730     IF MIM-7101COMBCATCD2-I IS NOT EQUAL TO 'Y'                  01873000
018740         GO TO VSA-COMBBAL3.                                      01874000
018750     IF MIM-7101COMBCATCD2 IS EQUAL TO SPACES                     01875000
018760         GO TO VSA-COMBBAL3.                                      01876000
018770     IF WS-COMBCATCD2-FLAG IS NOT EQUAL TO 'Y'                    01877000
018780         GO TO VSA-COMBBAL3.                                      01878000
018790     MOVE WS-7101COMBBALCD2 TO WS-WORK-BALCD.                     01879000
018800     IF MIM-7102COMBBALCD2-I IS EQUAL TO 'Y'                      01880000
018810         MOVE MIM-7102COMBBALCD2 TO WS-WORK-BALCD.                01881000
018820     PERFORM GET-BALANCE.                                         01882000
018830     ADD WS-WORK-BALANCE TO WS-COMBINEBAL2.                       01883000
018840     MOVE WS-WORK-BALANCE TO RPREL-ACCT-COMBBAL2.                 01884000
018850 VSA-COMBBAL3.                                                    01885000
018860     IF MIM-7101COMBCATCD3-I IS NOT EQUAL TO 'Y'                  01886000
018870         GO TO VSA-COMBBAL4.                                      01887000
018880     IF MIM-7101COMBCATCD3 IS EQUAL TO SPACES                     01888000
018890         GO TO VSA-COMBBAL4.                                      01889000
018900     IF WS-COMBCATCD3-FLAG IS NOT EQUAL TO 'Y'                    01890000
018910         GO TO VSA-COMBBAL4.                                      01891000
018920     MOVE WS-7101COMBBALCD3 TO WS-WORK-BALCD.                     01892000
018930     IF MIM-7102COMBBALCD3-I IS EQUAL TO 'Y'                      01893000
018940         MOVE MIM-7102COMBBALCD3 TO WS-WORK-BALCD.                01894000
018950     PERFORM GET-BALANCE.                                         01895000
018960     ADD WS-WORK-BALANCE TO WS-COMBINEBAL3.                       01896000
018970     MOVE WS-WORK-BALANCE TO RPREL-ACCT-COMBBAL3.                 01897000
018980 VSA-COMBBAL4.                                                    01898000
018990     IF MIM-7101COMBCATCD4-I IS NOT EQUAL TO 'Y'                  01899000
019000         GO TO VSA-CASH-REWARD.                                   01900000
019010     IF MIM-7101COMBCATCD4 IS EQUAL TO SPACES                     01901000
019020         GO TO VSA-CASH-REWARD.                                   01902000
019030     IF WS-COMBCATCD4-FLAG IS NOT EQUAL TO 'Y'                    01903000
019040         GO TO VSA-CASH-REWARD.                                   01904000
019050     MOVE WS-7101COMBBALCD4 TO WS-WORK-BALCD.                     01905000
019060     IF MIM-7102COMBBALCD4-I IS EQUAL TO 'Y'                      01906000
019070         MOVE MIM-7102COMBBALCD4 TO WS-WORK-BALCD.                01907000
019080     PERFORM GET-BALANCE.                                         01908000
019090     ADD WS-WORK-BALANCE TO WS-COMBINEBAL4.                       01909000
019100     MOVE WS-WORK-BALANCE TO RPREL-ACCT-COMBBAL4.                 01910000
019110 VSA-CASH-REWARD.                                                 01911000
019120     IF MIM-7101CRWOPT IS EQUAL TO 'N'                            01912000
019130         OR WS-HAVE-CRW IS EQUAL TO 'N'                           01913000
019140         OR MIM-7102CRWBALCD IS EQUAL TO ZEROS                    01914000
019150         MOVE ZEROS TO RPREL-CASH-RW-BAL                          01915000
019160         GO TO VSA-REWRITE-REL.                                   01916000
019170     MOVE MIM-7102CRWBALCD TO WS-WORK-BALCD.                      01917000
019180     PERFORM GET-BALANCE.                                         01918000
019190     MOVE WS-WORK-BALANCE TO RPREL-CASH-RW-BAL.                   01919000
019200     IF RPREL-CASH-RW-BAL IS LESS THAN MIM-7102CRWMINAMT          01920000
019210         MOVE ZEROS TO RPREL-CASH-RW-BAL.                         01921000
019220     IF RPREL-CASH-RW-BAL IS GREATER THAN MIM-7102CRWMAXAMT       01922000
019230         MOVE MIM-7102CRWMAXAMT TO RPREL-CASH-RW-BAL.             01923000
019240     ADD RPREL-CASH-RW-BAL TO WS-CRW-COMBBAL.                     01924000
019250     GO TO VSA-REWRITE-REL.                                       01925000
019260 VSA-INIT-REL.                                                    01926000
019270     MOVE 'N' TO WS-REL-SCINCOPT (WS-SUB1).                       01927000
019280     MOVE 'N' TO WS-REL-RATEINCOPT (WS-SUB1).                     01928000
019290     MOVE 'I' TO WS-REL-RATETYPE (WS-SUB1).                       01929000
019300     MOVE ZEROS TO WS-REL-RATEPCT (WS-SUB1).                      01930000
019310     MOVE 'N' TO WS-REL-TIMEPROCOPT (WS-SUB1).                    01931000
019320     MOVE ZEROS TO WS-REL-SCBAL (WS-SUB1).                        01932000
019330     MOVE ZEROS TO WS-REL-ACCTRATEBAL (WS-SUB1).                  01933000
019340     MOVE 'N' TO RPREL-SC-INC-OPTION.                             01934000
019350     MOVE 'N' TO RPREL-RATE-INC-OPTION.                           01935000
019360 VSA-INIT-REL-BALS.                                               01936000
019370     MOVE ZEROS TO RPREL-ACCTBAL-1.                               01937000
019380     MOVE ZEROS TO RPREL-ACCTBAL-2.                               01938000
019390     MOVE ZEROS TO RPREL-PRIMEBAL.                                01939000
019400     MOVE ZEROS TO RPREL-ACCT-COMBBAL1.                           01940000
019410     MOVE ZEROS TO RPREL-ACCT-COMBBAL2.                           01941000
019420     MOVE ZEROS TO RPREL-ACCT-COMBBAL3.                           01942000
019430     MOVE ZEROS TO RPREL-ACCT-COMBBAL4.                           01943000
019440     MOVE ZEROS TO RPREL-SC-BAL.                                  01944000
019450     MOVE ZEROS TO RPREL-ACCT-RATE-BAL.                           01945000
019460     MOVE ZEROS TO RPREL-CASH-RW-BAL.                             01946000
019470 VSA-REWRITE-REL.                                                 01947000
019480     MOVE 'W  ' TO SR-APIFUNC.                                    01948000
019490     PERFORM CALL-RPS-REL.                                        01949000
019500     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01950000
019510         DISPLAY 'PRI KEY: ' RPMST-GRP-KEY                        01951000
019520         GO TO AR-0019.                                           01952000
019530     GO TO VSA-REL.                                               01953000
019540 VSA-DELETE-REL.                                                  01954000
019550     IF MIM-7100EVENTHISTORYOPT IS EQUAL TO 'N'                   01955000
019560         OR RPREL-ACCT-STATUS IS EQUAL TO 'R'                     01956000
019570         GO TO VSA-DELETE-REL-CONT.                               01957000
019580 VSA-EVT.                                                         01958000
019590     MOVE 'N' TO RPS-EVT-FLAG.                                    01959000
P0061      MOVE 08 TO RPS-EVT-EVENT-CODE.                               01960000
019610     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   01961000
019620     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   01962000
019630     MOVE RPMST-IDNUMBER TO RPS-EVT-IDNUMBER.                     01963000
019640     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        01964000
019650     IF WS-REL-MSG-TABLE (WS-SUB1 1) IS NOT EQUAL TO SPACES       01965000
019660         MOVE WS-REL-MSG (WS-SUB1 1) TO RPS-EVT-MSGNBR            01966000
019670     ELSE                                                         01967000
019680         IF WS-REL-MSG-TABLE (1 1) IS NOT EQUAL TO SPACES         01968000
019690             MOVE WS-REL-MSG (1 1) TO RPS-EVT-MSGNBR              01969000
019700         ELSE                                                     01970000
019710             MOVE ZEROS TO RPS-EVT-MSGNBR.                        01971000
019720     PERFORM ADD-EVENT-HISTORY.                                   01972000
019730     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01973000
019740         GO TO AR-0064.                                           01974000
019750 VSA-DELETE-REL-CONT.                                             01975000
019760     IF RPREL-ACCT-STATUS IS NOT EQUAL TO 'R'                     01976000
019770         MOVE 'Y' TO WS-REL-ACCTDEL (WS-SUB1).                    01977000
019780     ADD +1 TO WS-NUMOFACCTDEL.                                   01978000
019790     MOVE 'D  ' TO SR-APIFUNC.                                    01979000
019800     PERFORM CALL-RPS-REL.                                        01980000
019810     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01981000
019820         DISPLAY 'PRI KEY: ' RPMST-GRP-KEY                        01982000
019830         GO TO AR-0020.                                           01983000
019840     GO TO VSA-REL.                                               01984000
019850 VSA-EXIT.                                                        01985000
019860     EXIT.                                                        01986000
019870******************************************************************01987000
019880 PROCESS-RELATIONSHIP-TABLE SECTION.                              01988000
019890 PRT-START.                                                       01989000
019900     MOVE ZEROS TO WS-SUB1.                                       01990000
019910     MOVE ZEROS TO WS-SUB2.                                       01991000
019920     MOVE 'N' TO WS-PRINT-REL-FLAG.                               01992000
019930     MOVE RPMST-IQ-MSGNBR TO WS-IQ-MSGNBR.                        01993000
019940 PRT-READ-TABLE.                                                  01994000
019950     ADD +1 TO WS-SUB1.                                           01995000
019960     IF WS-SUB1 IS GREATER THAN WS-REL-MAX                        01996000
019970         GO TO PRT-EXIT.                                          01997000
019980     IF WS-REL-INFO (WS-SUB1) IS EQUAL TO SPACES                  01998000
019990         GO TO PRT-EXIT.                                          01999000
020000 PRT-ACTW.                                                        02000000
020010     IF WS-QUAL-FLAG IS EQUAL TO 'D'                              02001000
020020         OR WS-REL-ACCTDEL (WS-SUB1) IS EQUAL TO 'Y'              02002000
020030         GO TO PRT-REPORT-ACCOUNT.                                02003000
020040     MOVE SPACES TO RP-ACTWREC.                                   02004000
020050     MOVE WS-REL-INST2 (WS-SUB1) TO RPACTW-INST.                  02005000
020060     MOVE WS-REL-PRODCODE (WS-SUB1) TO RPACTW-PRODCODE.           02006000
020070     MOVE WS-REL-ACCOUNT (WS-SUB1) TO RPACTW-ACCOUNT.             02007000
020080     MOVE RPMST-MODEL TO RPACTW-MODEL2.                           02008000
020090     IF WS-SUB1 IS EQUAL TO +1                                    02009000
020100         MOVE ZEROS TO RPACTW-INST2                               02010000
020110     ELSE                                                         02011000
020120         MOVE RPMST-INST TO RPACTW-INST2                          02012000
020130         MOVE RPMST-PRODCODE TO RPACTW-PRODCODE2                  02013000
020140         MOVE RPMST-ACCOUNT TO RPACTW-ACCOUNT2.                   02014000
020150     MOVE 'N' TO RPACTW-SC-INC-OPTION.                            02015000
020160     MOVE 'N' TO RPACTW-SC-INC-QUAL.                              02016000
020170     MOVE ZEROS TO RPACTW-DISCOUNT-AMOUNT.                        02017000
020180     MOVE ZEROS TO RPACTW-DISCOUNT-PERCENT.                       02018000
020190     MOVE 'N' TO RPACTW-RATE-INC-OPTION.                          02019000
020200     MOVE 'N' TO RPACTW-RATE-INC-QUAL.                            02020000
020210     MOVE '0' TO RPACTW-RATE-OPTION.                              02021000
020220     MOVE 'I' TO RPACTW-RATE-TYPE.                                02022000
P0167      MOVE 'Y' TO RPACTW-RECALC-RATE.                              02022300
P0167      MOVE SPACES TO RPACTW-RATE-BALORDER.                         02022600
020230     MOVE ZEROS TO RPACTW-RATEAMT-1.                              02023000
020240     MOVE ZEROS TO RPACTW-RATEPCT-1.                              02024000
020250     MOVE ZEROS TO RPACTW-RATEAMT-2.                              02025000
020260     MOVE ZEROS TO RPACTW-RATEPCT-2.                              02026000
020270     MOVE ZEROS TO RPACTW-RATEAMT-3.                              02027000
020280     MOVE ZEROS TO RPACTW-RATEPCT-3.                              02028000
020290     MOVE ZEROS TO RPACTW-RATEAMT-4.                              02029000
020300     MOVE ZEROS TO RPACTW-RATEPCT-4.                              02030000
020310     MOVE ZEROS TO RPACTW-RATEAMT-5.                              02031000
020320     MOVE ZEROS TO RPACTW-RATEPCT-5.                              02032000
020330     MOVE ZEROS TO RPACTW-RATEAMT-6.                              02033000
020340     MOVE ZEROS TO RPACTW-RATEPCT-6.                              02034000
020350     MOVE ZEROS TO RPACTW-RATEAMT-7.                              02035000
020360     MOVE ZEROS TO RPACTW-RATEPCT-7.                              02036000
020370     MOVE ZEROS TO RPACTW-RATEAMT-8.                              02037000
020380     MOVE ZEROS TO RPACTW-RATEPCT-8.                              02038000
020390     MOVE ZEROS TO RPACTW-RATEAMT-9.                              02039000
020400     MOVE ZEROS TO RPACTW-RATEPCT-9.                              02040000
020410     MOVE ZEROS TO RPACTW-RATEAMT-10.                             02041000
020420     MOVE ZEROS TO RPACTW-RATEPCT-10.                             02042000
020430     MOVE ZEROS TO RPACTW-RATEAMT-11.                             02043000
020440     MOVE ZEROS TO RPACTW-RATEPCT-11.                             02044000
020450     MOVE ZEROS TO RPACTW-RATEAMT-12.                             02045000
020460     MOVE ZEROS TO RPACTW-RATEPCT-12.                             02046000
020470     MOVE ZEROS TO RPACTW-RATEAMT-13.                             02047000
020480     MOVE ZEROS TO RPACTW-RATEPCT-13.                             02048000
020490     MOVE ZEROS TO RPACTW-RATEAMT-14.                             02049000
020500     MOVE ZEROS TO RPACTW-RATEPCT-14.                             02050000
020510     MOVE ZEROS TO RPACTW-RATEAMT-15.                             02051000
020520     MOVE ZEROS TO RPACTW-RATEPCT-15.                             02052000
020530     MOVE ZEROS TO RPACTW-RATE-PERCENT.                           02053000
020540     MOVE WS-REL-TIMEPROCOPT (WS-SUB1) TO RPACTW-PROCOPT.         02054000
020550     MOVE WS-REL-APPL (WS-SUB1) TO RPACTW-APPL.                   02055000
020560     MOVE WS-COMBINEBAL1 TO RPACTW-COMBBAL1.                      02056000
020570     MOVE WS-COMBINEBAL2 TO RPACTW-COMBBAL2.                      02057000
020580     MOVE WS-COMBINEBAL3 TO RPACTW-COMBBAL3.                      02058000
020590     MOVE WS-COMBINEBAL4 TO RPACTW-COMBBAL4.                      02059000
020600     MOVE WS-REL-SECSVCBAL (WS-SUB1) TO RPACTW-SECSVC-BAL.        02060000
020610     MOVE WS-REL-ACCT-TYPE (WS-SUB1) TO RPACTW-ACCT-TYPE.         02061000
P0167      MOVE WS-REL-RATEBALCODE (WS-SUB1) TO RPACTW-RATE-BALCD.      02061500
020620     MOVE WS-REL-SEC-SERVICE (WS-SUB1) TO                         02062000
020630         RPACTW-SECSVCS-INC-OPTION.                               02063000
020640     IF WS-QUAL-FLAG IS EQUAL TO 'P'                              02064000
020650         GO TO PRT-CONT.                                          02065000
020660     IF WS-REL-SECSVCOPT (WS-SUB1) IS EQUAL TO 'Y'                02066000
020670         GO TO PRT-CONT.                                          02067000
020680     IF WS-REL-SECSVCOPT (WS-SUB1) IS EQUAL TO 'N'                02068000
020690         MOVE 'N' TO RPACTW-SECSVCS-INC-OPTION                    02069000
020700         GO TO PRT-CONT.                                          02070000
020710     IF MIM-7101SECSVCOPT IS EQUAL TO 'Y'                         02071000
020720         GO TO PRT-CONT.                                          02072000
020730     IF MIM-7100SECSVCOPT IS EQUAL TO 'N'                         02073000
020740         OR MIM-7101SECSVCOPT IS EQUAL TO 'N'                     02074000
020750         MOVE 'N' TO RPACTW-SECSVCS-INC-OPTION.                   02075000
020760 PRT-CONT.                                                        02076000
020770     MOVE ZEROS TO RPACTW-RSV-AMT.                                02077000
020780     MOVE SPACE TO RPACTW-MISC-OPTION1.                           02078000
020790     MOVE SPACE TO RPACTW-MISC-OPTION2.                           02079000
020800     MOVE SPACE TO RPACTW-MISC-OPTION3.                           02080000
020810     MOVE SPACES TO RPACTW-SECONDARY-SERVICES.                    02081000
P0167      IF WS-REL-STATUS IS NOT EQUAL TO 'A'                         02082000
P0167          MOVE 'N' TO RPACTW-RECALC-RATE                           02082290
020830         GO TO PRT-EVT.                                           02083000
020840     MOVE WS-REL-SCINCOPT (WS-SUB1) TO RPACTW-SC-INC-OPTION.      02084000
020850     MOVE WS-REL-RATEINCOPT (WS-SUB1) TO RPACTW-RATE-INC-OPTION.  02085000
020860     IF WS-REL-ACCT-STATUS (WS-SUB1) IS EQUAL TO 'U'              02086000
020870         AND MIM-7100ADDONINCOPT IS EQUAL TO 'N'                  02087000
P0167          MOVE 'N' TO RPACTW-RECALC-RATE                           02087500
020880         MOVE 'N' TO RPACTW-SC-INC-OPTION                         02088000
020890         MOVE 'N' TO RPACTW-RATE-INC-OPTION                       02089000
020900         MOVE 'N' TO RPACTW-SECSVCS-INC-OPTION.                   02090000
020910     IF RPACTW-SECSVCS-INC-OPTION IS EQUAL TO 'Y'                 02091000
020920         PERFORM PROCESS-SECONDARY-SERVICES.                      02092000
020930     IF WS-QUAL-FLAG IS NOT EQUAL TO 'F'                          02093000
020940         OR RPACTW-RATE-INC-OPTION IS EQUAL TO 'N'                02094000
020950         OR WS-PRODMOD-FAIL IS EQUAL TO 'Y'                       02095000
020960         GO TO PRT-CONT1.                                         02096000
020970     IF WS-REL-BONUSRATEOPT (WS-SUB1) IS EQUAL TO 'Y'             02097000
020980         PERFORM RATE-INCENTIVES                                  02098000
020990         GO TO PRT-EVT.                                           02099000
021000     IF WS-REL-BONUSRATEOPT (WS-SUB1) IS EQUAL TO 'N'             02100000
P0167          MOVE 'N' TO RPACTW-RECALC-RATE                           02100500
021010         GO TO PRT-EVT.                                           02101000
021020     IF MIM-7101BONUSRATEOPT IS EQUAL TO 'Y'                      02102000
021030         PERFORM RATE-INCENTIVES                                  02103000
021040         GO TO PRT-EVT.                                           02104000
021050     IF MIM-7101BONUSRATEOPT IS EQUAL TO 'N'                      02105000
021060         GO TO PRT-EVT.                                           02106000
021070     IF MIM-7100BONUSRATEOPT IS EQUAL TO 'Y'                      02107000
021080         PERFORM RATE-INCENTIVES.                                 02108000
021090     GO TO PRT-EVT.                                               02109000
021100 PRT-CONT1.                                                       02110000
021110     IF WS-QUAL-FLAG IS NOT EQUAL TO 'P'                          02111000
P0167          MOVE 'N' TO RPACTW-RECALC-RATE                           02111500
021120         GO TO PRT-EVT.                                           02112000
021130     IF RPACTW-SC-INC-OPTION IS EQUAL TO 'Y'                      02113000
021140         PERFORM SERVICE-CHARGE-INCENTIVES.                       02114000
021150     IF RPACTW-RATE-INC-OPTION IS EQUAL TO 'Y'                    02115000
021160         PERFORM RATE-INCENTIVES.                                 02116000
021170 PRT-EVT.                                                         02117000
021180     IF MIM-7100EVENTHISTORYOPT IS EQUAL TO 'N'                   02118000
021190         OR RPMST-QUAL-STAT IS EQUAL TO 'R'                       02119000
021200         GO TO PRT-WRITE-ACTW.                                    02120000
021210     IF WS-QUAL-FLAG IS EQUAL TO RPMST-QUAL-STAT                  02121000
021220         AND WS-QUAL-FLAG IS NOT EQUAL TO 'F'                     02122000
021230         GO TO PRT-WRITE-ACTW.                                    02123000
021240     MOVE RPMST-INST TO RPS-EVT-INST.                             02124000
021250     MOVE RPMST-PRODCODE TO RPS-EVT-PRODCODE.                     02125000
021260     MOVE RPMST-ACCOUNT TO RPS-EVT-ACCOUNT.                       02126000
021270     MOVE RPMST-MODEL TO RPS-EVT-MODEL.                           02127000
021280     IF WS-SUB1 IS EQUAL TO +1                                    02128000
021290         MOVE ZEROS TO RPS-EVT-INST2                              02129000
021300         MOVE SPACES TO RPS-EVT-PRODCODE2                         02130000
021310         MOVE SPACES TO RPS-EVT-ACCOUNT2                          02131000
021320     ELSE                                                         02132000
021330         MOVE WS-REL-INST2 (WS-SUB1) TO RPS-EVT-INST2             02133000
021340         MOVE WS-REL-PRODCODE (WS-SUB1) TO RPS-EVT-PRODCODE2      02134000
021350         MOVE WS-REL-ACCOUNT (WS-SUB1) TO RPS-EVT-ACCOUNT2.       02135000
021360     MOVE 'Y' TO RPS-EVT-FLAG.                                    02136000
021370     IF WS-QUAL-FLAG IS EQUAL TO 'P'                              02137000
021380         MOVE 04 TO RPS-EVT-EVENT-CODE                            02138000
021390     ELSE                                                         02139000
021400         MOVE 05 TO RPS-EVT-EVENT-CODE.                           02140000
021410     MOVE RPMST-IDNUMBER TO RPS-EVT-IDNUMBER.                     02141000
021420     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        02142000
021430     MOVE RPACTW-SC-INC-OPTION TO RPEVT-SC-INC-OPTION.            02143000
021440     MOVE RPACTW-SC-INC-QUAL TO RPEVT-SC-INC-QUAL.                02144000
021450     MOVE RPACTW-DISCOUNT-AMOUNT TO RPEVT-DISCOUNT-AMOUNT.        02145000
021460     MOVE RPACTW-DISCOUNT-PERCENT TO RPEVT-DISCOUNT-PERCENT.      02146000
021470     MOVE RPACTW-RATE-INC-OPTION TO RPEVT-RATE-INC-OPTION.        02147000
021480     MOVE RPACTW-RATE-INC-QUAL TO RPEVT-RATE-INC-QUAL.            02148000
021490     MOVE RPACTW-RATE-OPTION TO RPEVT-RATE-OPTION.                02149000
021500     MOVE RPACTW-RATE-TYPE TO RPEVT-RATE-TYPE.                    02150000
021510     MOVE RPACTW-RATE-PERCENT TO RPEVT-RATE-PERCENT.              02151000
021520     IF WS-REL-MSG-TABLE (WS-SUB1 1) IS NOT EQUAL TO SPACES       02152000
021530         MOVE WS-REL-MSG (WS-SUB1 1) TO RPS-EVT-MSGNBR            02153000
021540     ELSE                                                         02154000
021550         IF WS-REL-MSG-TABLE (1 1) IS NOT EQUAL TO SPACES         02155000
021560             MOVE WS-REL-MSG (1 1) TO RPS-EVT-MSGNBR              02156000
021570         ELSE                                                     02157000
021580             MOVE ZEROS TO RPS-EVT-MSGNBR.                        02158000
021590     IF WS-IQ-MSGNBR IS NOT EQUAL TO ZEROS                        02159000
021600         AND RPS-EVT-MSGNBR IS EQUAL TO WS-IQ-MSGNBR              02160000
021610         GO TO PRT-WRITE-ACTW.                                    02161000
021620     IF WS-SUB1 IS EQUAL TO +1                                    02162000
021630         MOVE RPS-EVT-MSGNBR TO RPMST-IQ-MSGNBR.                  02163000
021640     PERFORM ADD-EVENT-HISTORY.                                   02164000
021650     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02165000
021660         GO TO AR-0065.                                           02166000
021670 PRT-WRITE-ACTW.                                                  02167000
P0041      IF WS-REL-DISCAMT-OVRD-FLAG (WS-SUB1) IS EQUAL TO 'Y'        02167200
P0041          OR WS-REL-DISCPCT-OVRD-FLAG (WS-SUB1) IS EQUAL TO 'Y'    02167400
P0041          OR WS-REL-RATEPCT-OVRD-FLAG (WS-SUB1) IS EQUAL TO 'Y'    02167600
P0041          PERFORM REPORT-054.                                      02167800
P0167      IF RPACTW-RATE-INC-QUAL IS EQUAL TO 'N'                      02167860
P0167          MOVE 'N' TO RPACTW-RECALC-RATE.                          02167920
021680     WRITE RP-ACTWREC                                             02168000
021690         INVALID KEY                                              02169000
021700         GO TO AR-0010.                                           02170000
021710     ADD +1 TO WS-CNT-WRITE.                                      02171000
021720 PRT-REPORT-ACCOUNT.                                              02172000
021730     PERFORM REPORT-ACCOUNT.                                      02173000
021780     GO TO PRT-READ-TABLE.                                        02178000
021790 PRT-EXIT.                                                        02179000
021800     EXIT.                                                        02180000
021810******************************************************************02181000
021820 SERVICE-CHARGE-INCENTIVES SECTION.                               02182000
021830 SCI-START.                                                       02183000
021840     MOVE ZEROS TO WS-DISCOUNT-AMT.                               02184000
021850     MOVE ZEROS TO WS-DISCOUNT-PCT.                               02185000
021860     MOVE 'Y' TO RPACTW-SC-INC-QUAL.                              02186000
021870     MOVE RPMST-MODEL TO RPACTW-SC-MODEL.                         02187000
021880     IF WS-REL-SCCATCODE (WS-SUB1) IS EQUAL TO SPACES             02188000
021890         MOVE WS-REL-SCDISCAMT (WS-SUB1)                          02189000
021900             TO WS-DISCOUNT-AMT                                   02190000
021910         MOVE WS-REL-SCDISCPCT (WS-SUB1)                          02191000
021920             TO WS-DISCOUNT-PCT                                   02192000
021930         GO TO SCI-CHECK-OVERRIDE.                                02193000
021940 SCI-READ-7109-TABLE.                                             02194000
021950     MOVE WS-REL-SCCATCODE (WS-SUB1) TO WS-RPMIM7109SCTABLE.      02195000
021960     PERFORM SEARCH-RPS-7109.                                     02196000
021970     IF WS-RPMIM7109FOUND IS EQUAL TO 'N'                         02197000
021980         GO TO SCI-CHECK-OVERRIDE.                                02198000
021990     MOVE ZEROS TO WS-SUB3.                                       02199000
022000     MOVE ZEROS TO WS-SC-BAL.                                     02200000
022010     IF MIM-7109OPT IS EQUAL TO 'C'                               02201000
022020         MOVE WS-COMBINEBAL1 TO WS-SC-BAL                         02202000
022030         GO TO SCI-TABLE-LOOP.                                    02203000
022040     IF MIM-7109OPT IS EQUAL TO 'D'                               02204000
022050         MOVE WS-COMBINEBAL2 TO WS-SC-BAL                         02205000
022060         GO TO SCI-TABLE-LOOP.                                    02206000
022070     IF MIM-7109OPT IS EQUAL TO 'E'                               02207000
022080         MOVE WS-COMBINEBAL3 TO WS-SC-BAL                         02208000
022090         GO TO SCI-TABLE-LOOP.                                    02209000
022100     IF MIM-7109OPT IS EQUAL TO 'F'                               02210000
022110         MOVE WS-COMBINEBAL4 TO WS-SC-BAL                         02211000
022120         GO TO SCI-TABLE-LOOP.                                    02212000
022130     IF MIM-7109OPT IS NOT EQUAL TO 'G'                           02213000
022140         GO TO SCI-INDIVIDUAL-SCBAL.                              02214000
022150     MOVE WS-COMBINEBAL1 TO WS-SC-BAL.                            02215000
022160     IF WS-COMBINEBAL2 IS GREATER THAN WS-SC-BAL                  02216000
022170         MOVE WS-COMBINEBAL2 TO WS-SC-BAL.                        02217000
022180     IF WS-COMBINEBAL3 IS GREATER THAN WS-SC-BAL                  02218000
022190         MOVE WS-COMBINEBAL3 TO WS-SC-BAL.                        02219000
022200     IF WS-COMBINEBAL4 IS GREATER THAN WS-SC-BAL                  02220000
022210         MOVE WS-COMBINEBAL4 TO WS-SC-BAL.                        02221000
022220     GO TO SCI-TABLE-LOOP.                                        02222000
022230 SCI-INDIVIDUAL-SCBAL.                                            02223000
022240     IF WS-REL-SCBAL (WS-SUB1) IS NOT NUMERIC                     02224000
022250         GO TO SCI-TABLE-LOOP.                                    02225000
022260     IF MIM-7109OPT IS EQUAL TO 'I'                               02226000
022270         MOVE WS-REL-SCBAL (WS-SUB1) TO WS-SC-BAL.                02227000
022280 SCI-TABLE-LOOP.                                                  02228000
022290     ADD +1 TO WS-SUB3.                                           02229000
022300     IF WS-SUB3 IS GREATER THAN +10                               02230000
022310         GO TO SCI-CHECK-OVERRIDE.                                02231000
022320     IF WS-SUB3 IS EQUAL TO +1                                    02232000
022330         GO TO SCI-TABLE-CONT.                                    02233000
022340     IF MIM-7109AMTREQ (WS-SUB3) IS NOT GREATER THAN ZEROS        02234000
022350         GO TO SCI-CHECK-OVERRIDE.                                02235000
022360 SCI-TABLE-CONT.                                                  02236000
022370     IF WS-SC-BAL IS NOT LESS THAN MIM-7109AMTREQ (WS-SUB3)       02237000
022380         MOVE MIM-7109DISCPCT (WS-SUB3) TO WS-DISCOUNT-PCT        02238000
022390         MOVE MIM-7109DISCAMT (WS-SUB3) TO WS-DISCOUNT-AMT        02239000
022400         GO TO SCI-TABLE-LOOP.                                    02240000
022410 SCI-CHECK-OVERRIDE.                                              02241000
022420     IF WS-REL-DISCAMT-OVRD-FLAG (WS-SUB1) IS EQUAL TO 'Y'        02242000
022430         MOVE WS-REL-DISCAMT-OVRD (WS-SUB1)                       02243000
022440             TO RPACTW-DISCOUNT-AMOUNT                            02244000
022450     ELSE                                                         02245000
022460         MOVE WS-DISCOUNT-AMT TO RPACTW-DISCOUNT-AMOUNT.          02246000
022470     IF WS-REL-DISCPCT-OVRD-FLAG (WS-SUB1) IS EQUAL TO 'Y'        02247000
022480         MOVE WS-REL-DISCPCT-OVRD (WS-SUB1)                       02248000
022490             TO RPACTW-DISCOUNT-PERCENT                           02249000
022500     ELSE                                                         02250000
022510         MOVE WS-DISCOUNT-PCT TO RPACTW-DISCOUNT-PERCENT.         02251000
022520 SCI-EXIT.                                                        02252000
022530     EXIT.                                                        02253000
022540******************************************************************02254000
022550 RATE-INCENTIVES SECTION.                                         02255000
022560 RI-START.                                                        02256000
022570     MOVE ZEROS TO WS-RATE-PCT.                                   02257000
022580     MOVE 'Y' TO RPACTW-RATE-INC-QUAL.                            02258000
022590     MOVE RPMST-MODEL TO RPACTW-RATE-MODEL.                       02259000
022600     MOVE WS-REL-RATETYPE (WS-SUB1) TO RPACTW-RATE-TYPE.          02260000
022610     IF WS-REL-RATECATCODE (WS-SUB1) IS EQUAL TO SPACES           02261000
P0167          MOVE 'N' TO RPACTW-RECALC-RATE                           02261500
022620         MOVE WS-REL-RATEPCT (WS-SUB1) TO WS-RATE-PCT             02262000
022630         GO TO RI-CHECK-OVERRIDE.                                 02263000
022640 RI-READ-7103-TABLE.                                              02264000
022650     MOVE WS-REL-RATECATCODE (WS-SUB1) TO WS-RPMIM7103RATETABLE.  02265000
022660     PERFORM SEARCH-RPS-7103.                                     02266000
022670     IF WS-RPMIM7103FOUND IS EQUAL TO 'N'                         02267000
P0167          MOVE 'N' TO RPACTW-RECALC-RATE                           02267500
022680         GO TO RI-CHECK-OVERRIDE.                                 02268000
022690     MOVE MIM-7103RATEOPT TO WS-REL-RATEOPTION (WS-SUB1).         02269000
022700     MOVE MIM-7103RATEOPT TO RPACTW-RATE-OPTION.                  02270000
022710     MOVE ZEROS TO WS-SUB3.                                       02271000
022720     MOVE ZEROS TO WS-RATE-BAL.                                   02272000
022730     IF MIM-7103RATEOPT IS EQUAL TO '2'                           02273000
P0167          MOVE 'N' TO RPACTW-RECALC-RATE                           02273500
022740         GO TO RI-SPLIT-RATE-TABLE.                               02274000
022750     IF MIM-7103RATEOPT IS EQUAL TO '3'                           02275000
P0167          MOVE 'N' TO RPACTW-RECALC-RATE                           02275500
022760         MOVE WS-REL-TERM (WS-SUB1) TO WS-TERM                    02276000
022770         GO TO RI-TERM-TABLE.                                     02277000
P0167      IF MIM-7103BALOPT IS NOT EQUAL TO 'I'                        02277300
P0167          MOVE 'N' TO RPACTW-RECALC-RATE.                          02277600
022780     IF MIM-7103BALOPT IS EQUAL TO 'C'                            02278000
022790         MOVE WS-COMBINEBAL1 TO WS-RATE-BAL                       02279000
022800         GO TO RI-CHECK-RATE-OPTION.                              02280000
022810     IF MIM-7103BALOPT IS EQUAL TO 'D'                            02281000
022820         MOVE WS-COMBINEBAL2 TO WS-RATE-BAL                       02282000
022830         GO TO RI-CHECK-RATE-OPTION.                              02283000
022840     IF MIM-7103BALOPT IS EQUAL TO 'E'                            02284000
022850         MOVE WS-COMBINEBAL3 TO WS-RATE-BAL                       02285000
022860         GO TO RI-CHECK-RATE-OPTION.                              02286000
022870     IF MIM-7103BALOPT IS EQUAL TO 'F'                            02287000
022880         MOVE WS-COMBINEBAL4 TO WS-RATE-BAL                       02288000
022890         GO TO RI-CHECK-RATE-OPTION.                              02289000
022900     IF MIM-7103BALOPT IS NOT EQUAL TO 'G'                        02290000
022910         GO TO RI-INDIVIDUAL-RATE.                                02291000
022920     MOVE WS-COMBINEBAL1 TO WS-RATE-BAL.                          02292000
022930     IF WS-COMBINEBAL2 IS GREATER THAN WS-RATE-BAL                02293000
022940         MOVE WS-COMBINEBAL2 TO WS-RATE-BAL.                      02294000
022950     IF WS-COMBINEBAL3 IS GREATER THAN WS-RATE-BAL                02295000
022960         MOVE WS-COMBINEBAL3 TO WS-RATE-BAL.                      02296000
022970     IF WS-COMBINEBAL4 IS GREATER THAN WS-RATE-BAL                02297000
022980         MOVE WS-COMBINEBAL4 TO WS-RATE-BAL.                      02298000
022990     GO TO RI-CHECK-RATE-OPTION.                                  02299000
023000 RI-INDIVIDUAL-RATE.                                              02300000
023010     IF WS-REL-ACCTRATEBAL (WS-SUB1) IS NOT NUMERIC               02301000
023020         GO TO RI-CHECK-RATE-OPTION.                              02302000
023030     IF MIM-7103BALOPT IS EQUAL TO 'I'                            02303000
023040         MOVE WS-REL-ACCTRATEBAL (WS-SUB1) TO WS-RATE-BAL.        02304000
023050 RI-CHECK-RATE-OPTION.                                            02305000
P0167      MOVE MIM-7103BALORDER TO RPACTW-RATE-BALORDER.               02305500
023060     IF MIM-7103RATEOPT IS EQUAL TO '4'                           02306000
023070         GO TO RI-TERM-BALANCE-TABLE.                             02307000
P0167  RI-MOVE-TABLE-RATEOPT2.                                          02307100
P0167      ADD +1 TO WS-SUB3.                                           02307200
P0167      MOVE MIM-7103RATEAMT (WS-SUB3) TO RPACTW-RATEAMT (WS-SUB3).  02307300
P0167      MOVE MIM-7103RATEPCT (WS-SUB3) TO RPACTW-RATEPCT (WS-SUB3).  02307400
P0167      IF WS-SUB3 IS LESS THAN +15                                  02307500
P0167          GO TO RI-MOVE-TABLE-RATEOPT2.                            02307600
P0167      MOVE ZEROS TO WS-SUB3.                                       02307700
023080     IF MIM-7103BALORDER IS EQUAL TO 'LE'                         02308000
023090         GO TO RI-TABLE-LOOP-LE.                                  02309000
023100 RI-TABLE-LOOP-GE.                                                02310000
023110     ADD +1 TO WS-SUB3.                                           02311000
023120     IF WS-SUB3 IS GREATER THAN +15                               02312000
023130         GO TO RI-CHECK-OVERRIDE.                                 02313000
023140     IF WS-SUB3 IS EQUAL TO +1                                    02314000
023150         GO TO RI-TABLE-CONT-GE.                                  02315000
023160     IF MIM-7103RATEAMT (WS-SUB3) IS NOT GREATER THAN ZEROS       02316000
023170         GO TO RI-CHECK-OVERRIDE.                                 02317000
023180 RI-TABLE-CONT-GE.                                                02318000
023190     IF WS-RATE-BAL IS NOT LESS THAN MIM-7103RATEAMT (WS-SUB3)    02319000
023200         MOVE MIM-7103RATEPCT (WS-SUB3) TO WS-RATE-PCT            02320000
023210         GO TO RI-TABLE-LOOP-GE.                                  02321000
023220     GO TO RI-CHECK-OVERRIDE.                                     02322000
023230 RI-TABLE-LOOP-LE.                                                02323000
023240     ADD +1 TO WS-SUB3.                                           02324000
023250     IF WS-SUB3 IS GREATER THAN +15                               02325000
023260         GO TO RI-CHECK-OVERRIDE.                                 02326000
023270     IF WS-RATE-BAL IS NOT GREATER THAN MIM-7103RATEAMT (WS-SUB3) 02327000
023280         MOVE MIM-7103RATEPCT (WS-SUB3) TO WS-RATE-PCT            02328000
023290         GO TO RI-CHECK-OVERRIDE.                                 02329000
023300     GO TO RI-TABLE-LOOP-LE.                                      02330000
023310 RI-SPLIT-RATE-TABLE.                                             02331000
023320     ADD +1 TO WS-SUB3.                                           02332000
023330     MOVE MIM-7103RATEAMT (WS-SUB3) TO RPACTW-RATEAMT (WS-SUB3).  02333000
023340     MOVE MIM-7103RATEPCT (WS-SUB3) TO RPACTW-RATEPCT (WS-SUB3).  02334000
023350     IF WS-SUB3 IS LESS THAN +15                                  02335000
023360         GO TO RI-SPLIT-RATE-TABLE.                               02336000
023370     GO TO RI-EXIT.                                               02337000
023380 RI-TERM-TABLE.                                                   02338000
023390     ADD +1 TO WS-SUB3.                                           02339000
023400     IF WS-SUB3 IS GREATER THAN +15                               02340000
023410         GO TO RI-CHECK-OVERRIDE.                                 02341000
023420     IF WS-TERM IS NOT GREATER THAN MIM-7103TERM (WS-SUB3)        02342000
023430         MOVE MIM-7103RATEPCT (WS-SUB3) TO WS-RATE-PCT            02343000
023440         GO TO RI-CHECK-OVERRIDE.                                 02344000
023450     GO TO RI-TERM-TABLE.                                         02345000
023460 RI-TERM-BALANCE-TABLE.                                           02346000
023470     MOVE WS-REL-RATECATCODE (WS-SUB1) TO WS-RPMIM7103RATETABLE.  02347000
023480     IF MIM-7103TERMBALTABLE IS EQUAL TO SPACES                   02348000
023490         MOVE WS-REL-RATECATCODE (WS-SUB1)                        02349000
023500             TO WS-RPMIM7114RATETABLE                             02350000
023510     ELSE                                                         02351000
023520         MOVE MIM-7103TERMBALTABLE TO WS-RPMIM7114RATETABLE.      02352000
023530     PERFORM SEARCH-RPS-7114.                                     02353000
023540     IF WS-RPMIM7114FOUND IS EQUAL TO 'N'                         02354000
P0167          MOVE 'N' TO RPACTW-RECALC-RATE                           02354500
023550         GO TO RI-CHECK-OVERRIDE.                                 02355000
023560     MOVE WS-REL-TERM (WS-SUB1) TO WS-TERM.                       02356000
023570     MOVE ZEROS TO WS-7114-SUB.                                   02357000
023580 RI-TERM-LOOP.                                                    02358000
023590     ADD +1 TO WS-7114-SUB.                                       02359000
023600     IF WS-7114-SUB IS GREATER THAN +99                           02360000
P0167          MOVE 'N' TO RPACTW-RECALC-RATE                           02360500
023610         GO TO RI-CHECK-OVERRIDE.                                 02361000
023620     IF WS-7114-WORK-RATETABLE (WS-7114-SUB) IS EQUAL TO SPACES   02362000
P0167          MOVE 'N' TO RPACTW-RECALC-RATE                           02362500
023630         GO TO RI-CHECK-OVERRIDE.                                 02363000
023640     MOVE WS-7114-WORK-RPMIM7114 (WS-7114-SUB) TO MIM-REC7114.    02364000
023650     IF WS-TERM IS GREATER THAN WS-7114-WORK-TERM (WS-7114-SUB)   02365000
023660         GO TO RI-TERM-LOOP.                                      02366000
P0167  RI-MOVE-TABLE-RATEOPT4.                                          02366100
P0167      ADD +1 TO WS-SUB3.                                           02366200
P0167      MOVE MIM-7114RATEAMT (WS-SUB3) TO RPACTW-RATEAMT (WS-SUB3).  02366300
P0167      MOVE MIM-7114RATEPCT (WS-SUB3) TO RPACTW-RATEPCT (WS-SUB3).  02366400
P0167      IF WS-SUB3 IS LESS THAN +15                                  02366500
P0167          GO TO RI-MOVE-TABLE-RATEOPT4.                            02366600
P0167      MOVE ZEROS TO WS-SUB3.                                       02366700
023670     IF MIM-7103BALORDER IS EQUAL TO 'LE'                         02367000
023680         GO TO RI-TABLE-LOOP-LE.                                  02368000
023690 RI-TERM-BAL-GE.                                                  02369000
023700     ADD +1 TO WS-SUB3.                                           02370000
023710     IF WS-SUB3 IS GREATER THAN +15                               02371000
023720         GO TO RI-CHECK-OVERRIDE.                                 02372000
023730     IF WS-SUB3 IS EQUAL TO +1                                    02373000
023740         GO TO RI-TERM-BAL-GE-CONT.                               02374000
023750     IF MIM-7114RATEAMT (WS-SUB3) IS NOT GREATER THAN ZEROS       02375000
023760         GO TO RI-CHECK-OVERRIDE.                                 02376000
023770 RI-TERM-BAL-GE-CONT.                                             02377000
023780     IF WS-RATE-BAL IS NOT LESS THAN MIM-7114RATEAMT (WS-SUB3)    02378000
023790         MOVE MIM-7114RATEPCT (WS-SUB3) TO WS-RATE-PCT            02379000
023800         GO TO RI-TERM-BAL-GE.                                    02380000
023810     GO TO RI-CHECK-OVERRIDE.                                     02381000
023820 RI-TERM-BAL-LE.                                                  02382000
023830     ADD +1 TO WS-SUB3.                                           02383000
023840     IF WS-SUB3 IS GREATER THAN +15                               02384000
023850         GO TO RI-CHECK-OVERRIDE.                                 02385000
023860     IF WS-RATE-BAL IS NOT GREATER THAN MIM-7114RATEAMT (WS-SUB3) 02386000
023870         MOVE MIM-7114RATEPCT (WS-SUB3) TO WS-RATE-PCT            02387000
023880         GO TO RI-CHECK-OVERRIDE.                                 02388000
023890     GO TO RI-TERM-BAL-LE.                                        02389000
023900 RI-CHECK-OVERRIDE.                                               02390000
023910     IF WS-REL-RATEPCT-OVRD-FLAG (WS-SUB1) IS EQUAL TO 'Y'        02391000
P0167          MOVE 'N' TO RPACTW-RECALC-RATE                           02391500
023920         MOVE WS-REL-RATEPCT-OVRD (WS-SUB1)                       02392000
023930             TO RPACTW-RATE-PERCENT                               02393000
023940     ELSE                                                         02394000
023950         MOVE WS-RATE-PCT TO RPACTW-RATE-PERCENT.                 02395000
023960 RI-EXIT.                                                         02396000
023970     EXIT.                                                        02397000
023980******************************************************************02398000
023990 REPORT-ACCOUNT SECTION.                                          02399000
024000 RA-START.                                                        02400000
024010     IF WS-SUB1 IS EQUAL TO +1                                    02401000
024020         MOVE SPACES TO RPRPTS-RECORD.                            02402000
024030     MOVE 51 TO RPRPTS-RPTNBR.                                    02403000
024040     MOVE 'N' TO WS-BAL-RPT-SW.                                   02404000
024050     MOVE 'N' TO WS-BAL1-RPT-SW.                                  02405000
024060     MOVE 'N' TO WS-BAL2-RPT-SW.                                  02406000
024070     MOVE 'N' TO WS-BAL3-RPT-SW.                                  02407000
024080     MOVE 'N' TO WS-BAL4-RPT-SW.                                  02408000
024090     MOVE 'N' TO WS-BAL5-RPT-SW.                                  02409000
024100     MOVE 'N' TO WS-BAL6-RPT-SW.                                  02410000
024110     MOVE ZEROS TO WS-SUB2.                                       02411000
024120     MOVE WS-REL-INST (WS-SUB1) TO RPRPTS-INST.                   02412000
024130     MOVE WS-REL-INST2 (WS-SUB1) TO RPRPTS-051HOLDINST.           02413000
024140     MOVE WS-REL-PRODCODE (WS-SUB1) TO RPRPTS-051HOLDPRODCODE.    02414000
024150     MOVE WS-REL-ACCOUNT (WS-SUB1) TO RPRPTS-051HOLDACCOUNT.      02415000
024160     IF WS-SUB1 IS EQUAL TO +1                                    02416000
024170         MOVE WS-REL-PRODCODE (WS-SUB1) TO RPRPTS-PRODCODE        02417000
024180         MOVE WS-REL-ACCOUNT (WS-SUB1) TO RPRPTS-ACCOUNT          02418000
024190         MOVE WS-REL-BRANCH (WS-SUB1) TO RPRPTS-BRANCH            02419000
024200         MOVE WS-REL-ACCT-TYPE (WS-SUB1) TO RPRPTS-TYPE.          02420000
024210     MOVE WS-REL-BRANCH (WS-SUB1) TO RPRPTS-051HOLDBRANCH.        02421000
024220     MOVE WS-REL-ACCT-TYPE (WS-SUB1) TO RPRPTS-051HOLDTYPE.       02422000
024230     MOVE WS-REL-SCINCOPT (WS-SUB1) TO RPRPTS-051SCOPT.           02423000
024240     MOVE WS-REL-RATEINCOPT (WS-SUB1) TO RPRPTS-051RTOPT.         02424000
024250     IF WS-SUB1 IS GREATER THAN +1                                02425000
024260         GO TO RA-BALANCE.                                        02426000
024270     MOVE 'A' TO WS-REPORT-SW.                                    02427000
024280     IF RPMST-REL-STAT IS EQUAL TO 'A'                            02428000
024290         ADD +1 TO WS-NUMOFACTIVE.                                02429000
024300     IF WS-QUAL-FLAG IS EQUAL TO 'P'                              02430000
024310         ADD +1 TO WS-NUMOFSUCCESS                                02431000
024320         GO TO RA-CUSTOMER.                                       02432000
024330     IF WS-QUAL-FLAG IS EQUAL TO 'F'                              02433000
024340         ADD +1 TO WS-NUMOFFAILED                                 02434000
024350         MOVE 2001 TO WS-2011-MSGNBR                              02435000
024360         GO TO RA-TOPMSG.                                         02436000
024370     IF WS-QUAL-FLAG IS EQUAL TO 'D'                              02437000
024380         ADD +1 TO WS-NUMOFRELDEL                                 02438000
024390         MOVE 2002 TO WS-2011-MSGNBR                              02439000
024400         GO TO RA-TOPMSG.                                         02440000
024410     IF WS-QUAL-FLAG IS NOT EQUAL TO 'N'                          02441000
024420         GO TO RA-CUSTOMER.                                       02442000
024430     IF RPMST-REL-STAT IS EQUAL TO 'E'                            02443000
024440         MOVE 2027 TO WS-2011-MSGNBR                              02444000
024450         GO TO RA-TOPMSG.                                         02445000
024460     IF RPMST-REL-STAT IS EQUAL TO 'I'                            02446000
024470         MOVE 2026 TO WS-2011-MSGNBR                              02447000
024480         GO TO RA-TOPMSG.                                         02448000
024490     IF RPMST-QUAL-STAT IS EQUAL TO 'P'                           02449000
024500         ADD +1 TO WS-NUMOFSUCCESS                                02450000
024510         MOVE 2025 TO WS-2011-MSGNBR                              02451000
024520         GO TO RA-TOPMSG.                                         02452000
024530     IF RPMST-QUAL-STAT IS EQUAL TO 'F'                           02453000
024540         ADD +1 TO WS-NUMOFFAILED                                 02454000
024550         MOVE 2000 TO WS-2011-MSGNBR                              02455000
024560         GO TO RA-TOPMSG.                                         02456000
024570     ADD +1 TO WS-NUMOFRELNOTQUAL.                                02457000
024580     MOVE 2003 TO WS-2011-MSGNBR.                                 02458000
024590 RA-TOPMSG.                                                       02459000
024600     MOVE 001 TO RPRPTS-051ERRORNBR.                              02460000
024610     PERFORM GET-MESSAGE.                                         02461000
024620     MOVE WS-MESSAGE TO RPRPTS-051ERRORMSG.                       02462000
024630 RA-CUSTOMER.                                                     02463000
024640     IF WS-REL-ACCT-STATUS (WS-SUB1) IS EQUAL TO 'U'              02464000
024650         MOVE RPMST-INST TO WS-INST                               02465000
024660         MOVE RPMST-PRODCODE TO WS-PRODCODE                       02466000
024670         MOVE RPMST-ACCOUNT TO WS-ACCOUNT                         02467000
024680     ELSE                                                         02468000
024690         MOVE WS-REL-INST (WS-SUB1) TO WS-INST                    02469000
024700         MOVE WS-REL-PRODCODE (WS-SUB1) TO WS-PRODCODE            02470000
024710         MOVE WS-REL-ACCOUNT (WS-SUB1) TO WS-ACCOUNT.             02471000
024720     MOVE SPACES TO RPRPTS-NAME.                                  02472000
024730     MOVE RPMST-MODEL TO RPRPTS-MODEL.                            02473000
024740 RA-BALANCE.                                                      02474000
024750     IF WS-BAL-RPT-SW IS EQUAL TO 'N'                             02475000
024760         AND WS-REL-PRIMCATCODE (WS-SUB1) IS NOT EQUAL TO SPACES  02476000
024770         MOVE 'PRI' TO RPRPTS-051BALTYPE                          02477000
024780         MOVE WS-REL-PRIMBAL (WS-SUB1) TO RPRPTS-051ACCTBAL       02478000
024790         MOVE WS-REL-PRIMBALREQ (WS-SUB1) TO RPRPTS-051REQDBAL    02479000
024800         MOVE 'Y' TO WS-BAL-RPT-SW                                02480000
024810         GO TO RA-MESSAGE.                                        02481000
024820     IF WS-BAL1-RPT-SW IS EQUAL TO 'N'                            02482000
024830         AND WS-REL-BALCATCODE1 (WS-SUB1) IS NOT EQUAL TO SPACES  02483000
024840         MOVE 'RB1' TO RPRPTS-051BALTYPE                          02484000
024850         MOVE WS-REL-BAL1 (WS-SUB1) TO RPRPTS-051ACCTBAL          02485000
024860         MOVE WS-REL-BALREQ1 (WS-SUB1) TO RPRPTS-051REQDBAL       02486000
024870         MOVE 'Y' TO WS-BAL1-RPT-SW                               02487000
024880         GO TO RA-MESSAGE.                                        02488000
024890     IF WS-BAL2-RPT-SW IS EQUAL TO 'N'                            02489000
024900         AND WS-REL-BALCATCODE2 (WS-SUB1) IS NOT EQUAL TO SPACES  02490000
024910         MOVE 'RB2' TO RPRPTS-051BALTYPE                          02491000
024920         MOVE WS-REL-BAL2 (WS-SUB1) TO RPRPTS-051ACCTBAL          02492000
024930         MOVE WS-REL-BALREQ2 (WS-SUB1) TO RPRPTS-051REQDBAL       02493000
024940         MOVE 'Y' TO WS-BAL2-RPT-SW                               02494000
024950         GO TO RA-MESSAGE.                                        02495000
024960     IF WS-BAL3-RPT-SW IS EQUAL TO 'N'                            02496000
024970         AND WS-COMBCATCD1-FLAG IS EQUAL TO 'Y'                   02497000
024980         AND WS-SUB1 IS EQUAL TO +1                               02498000
024990         MOVE 'CB1' TO RPRPTS-051BALTYPE                          02499000
025000         MOVE WS-COMBINEBAL1 TO RPRPTS-051ACCTBAL                 02500000
025010         MOVE WS-7101COMBBALREQ1 TO RPRPTS-051REQDBAL             02501000
025020         MOVE 'Y' TO WS-BAL3-RPT-SW                               02502000
025030         GO TO RA-MESSAGE.                                        02503000
025040     IF WS-BAL4-RPT-SW IS EQUAL TO 'N'                            02504000
025050         AND WS-COMBCATCD2-FLAG IS EQUAL TO 'Y'                   02505000
025060         AND WS-SUB1 IS EQUAL TO +1                               02506000
025070         MOVE 'CB2' TO RPRPTS-051BALTYPE                          02507000
025080         MOVE WS-COMBINEBAL2 TO RPRPTS-051ACCTBAL                 02508000
025090         MOVE WS-7101COMBBALREQ2 TO RPRPTS-051REQDBAL             02509000
025100         MOVE 'Y' TO WS-BAL4-RPT-SW                               02510000
025110         GO TO RA-MESSAGE.                                        02511000
025120     IF WS-BAL5-RPT-SW IS EQUAL TO 'N'                            02512000
025130         AND WS-COMBCATCD3-FLAG IS EQUAL TO 'Y'                   02513000
025140         AND WS-SUB1 IS EQUAL TO +1                               02514000
025150         MOVE 'CB3' TO RPRPTS-051BALTYPE                          02515000
025160         MOVE WS-COMBINEBAL3 TO RPRPTS-051ACCTBAL                 02516000
025170         MOVE WS-7101COMBBALREQ3 TO RPRPTS-051REQDBAL             02517000
025180         MOVE 'Y' TO WS-BAL5-RPT-SW                               02518000
025190         GO TO RA-MESSAGE.                                        02519000
025200     IF WS-BAL6-RPT-SW IS EQUAL TO 'N'                            02520000
025210         AND WS-COMBCATCD4-FLAG IS EQUAL TO 'Y'                   02521000
025220         AND WS-SUB1 IS EQUAL TO +1                               02522000
025230         MOVE 'CB4' TO RPRPTS-051BALTYPE                          02523000
025240         MOVE WS-COMBINEBAL4 TO RPRPTS-051ACCTBAL                 02524000
025250         MOVE WS-7101COMBBALREQ4 TO RPRPTS-051REQDBAL             02525000
025260         MOVE 'Y' TO WS-BAL6-RPT-SW                               02526000
025270         GO TO RA-MESSAGE.                                        02527000
025280     MOVE ZEROS TO RPRPTS-051ACCTBAL.                             02528000
025290     MOVE ZEROS TO RPRPTS-051REQDBAL.                             02529000
025300 RA-MESSAGE.                                                      02530000
025310     IF WS-REPORT-SW IS EQUAL TO 'A'                              02531000
025320         GO TO RA-WRITE-RECORD.                                   02532000
025330     MOVE SPACES TO RPRPTS-051ERRORMSG.                           02533000
025340     MOVE ZEROS TO RPRPTS-051ERRORNBR.                            02534000
025350     ADD +1 TO WS-SUB2.                                           02535000
025360     IF RPRPTS-PRODCODE IS EQUAL TO RPRPTS-051HOLDPRODCODE        02536000
025370         AND RPRPTS-ACCOUNT IS EQUAL TO RPRPTS-051HOLDACCOUNT     02537000
025380         AND WS-SUB2 IS GREATER THAN +5                           02538000
025390         GO TO RA-EXIT.                                           02539000
025400     IF WS-SUB2 IS GREATER THAN +5                                02540000
025410         AND WS-BAL-RPT-SW IS EQUAL TO 'N'                        02541000
025420         AND WS-BAL1-RPT-SW IS EQUAL TO 'N'                       02542000
025430         AND WS-BAL2-RPT-SW IS EQUAL TO 'N'                       02543000
025440         AND WS-BAL3-RPT-SW IS EQUAL TO 'N'                       02544000
025450         AND WS-BAL4-RPT-SW IS EQUAL TO 'N'                       02545000
025460         AND WS-BAL5-RPT-SW IS EQUAL TO 'N'                       02546000
025470         AND WS-BAL6-RPT-SW IS EQUAL TO 'N'                       02547000
025480         GO TO RA-WRITE-RECORD.                                   02548000
025490     IF WS-SUB2 IS GREATER THAN +5                                02549000
025500         GO TO RA-EXIT.                                           02550000
025510     IF WS-REL-MSG-TABLE (WS-SUB1 WS-SUB2) IS EQUAL TO SPACES     02551000
025520         AND RPRPTS-051BALTYPE IS EQUAL TO SPACES                 02552000
025530         GO TO RA-END.                                            02553000
025540     IF WS-REL-MSG-TABLE (WS-SUB1 WS-SUB2) IS EQUAL TO SPACES     02554000
025550         GO TO RA-WRITE-RECORD.                                   02555000
025560     MOVE WS-REL-MSG (WS-SUB1 WS-SUB2) TO WS-2011-MSGNBR.         02556000
025570     PERFORM GET-MESSAGE.                                         02557000
025580     MOVE WS-MESSAGE TO RPRPTS-051ERRORMSG.                       02558000
P0149      IF WS-REL-MSGNBR (WS-SUB1 WS-SUB2) IS NOT NUMERIC            02559000
P0149          MOVE ZEROS TO RPRPTS-051ERRORNBR                         02559090
P0149      ELSE                                                         02559180
P0149          MOVE WS-REL-MSGNBR (WS-SUB1 WS-SUB2)                     02559270
P0149              TO RPRPTS-051ERRORNBR.                               02559360
025600 RA-WRITE-RECORD.                                                 02560000
025610     IF WS-RRPTPFC IS EQUAL TO '0'                                02561000
025620         GO TO RA-EXIT.                                           02562000
025630     MOVE WS-SUB1 TO RPRPTS-SRTNUMBER.                            02563000
025640     MOVE WS-RRPTCTL TO RPRPTS-RPTCTL.                            02564000
025650     MOVE WS-NUMOFREL TO RPRPTS-051NUMOFREL.                      02565000
025660     MOVE WS-NUMOFRELNOTQUAL TO RPRPTS-051NUMOFRELNOTQUAL.        02566000
025670     MOVE WS-NUMOFACTIVE TO RPRPTS-051NUMOFACTIVE.                02567000
025680     MOVE WS-NUMOFINACTIVE TO RPRPTS-051NUMOFINACTIVE.            02568000
025690     MOVE WS-NUMOFSUCCESS TO RPRPTS-051NUMOFSUCCESS.              02569000
025700     MOVE WS-NUMOFFAILED TO RPRPTS-051NUMOFFAILED.                02570000
025710     MOVE WS-NUMOFEXPTODAY TO RPRPTS-051NUMOFEXPTODAY.            02571000
025720     MOVE WS-NUMOFEXPIRED TO RPRPTS-051NUMOFEXPIRED.              02572000
025730     MOVE WS-NUMOFRELDEL TO RPRPTS-051NUMOFRELDEL.                02573000
025740     MOVE WS-NUMOFACCTDEL TO RPRPTS-051NUMOFACCTDEL.              02574000
025750     MOVE 'ASE' TO WS-RRPTS.                                      02575000
025760     PERFORM CALL-RPRPTS.                                         02576000
025770     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02577000
025780         GO TO AR-0044.                                           02578000
025790     MOVE SPACES TO RPRPTS-051BALTYPE.                            02579000
025800     MOVE ZEROS TO WS-NUMOFREL.                                   02580000
025810     MOVE ZEROS TO WS-NUMOFRELNOTQUAL.                            02581000
025820     MOVE ZEROS TO WS-NUMOFACTIVE.                                02582000
025830     MOVE ZEROS TO WS-NUMOFINACTIVE.                              02583000
025840     MOVE ZEROS TO WS-NUMOFSUCCESS.                               02584000
025850     MOVE ZEROS TO WS-NUMOFFAILED.                                02585000
025860     MOVE ZEROS TO WS-NUMOFEXPTODAY.                              02586000
025870     MOVE ZEROS TO WS-NUMOFEXPIRED.                               02587000
025880     MOVE ZEROS TO WS-NUMOFRELDEL.                                02588000
025890     MOVE ZEROS TO WS-NUMOFACCTDEL.                               02589000
025900     IF WS-SUB2 IS GREATER THAN +5                                02590000
025910         GO TO RA-EXIT.                                           02591000
025920 RA-END.                                                          02592000
025930     IF WS-REPORT-SW IS EQUAL TO 'A'                              02593000
025940         MOVE 'B' TO WS-REPORT-SW.                                02594000
025950     GO TO RA-BALANCE.                                            02595000
025960 RA-EXIT.                                                         02596000
025970     EXIT.                                                        02597000
025980******************************************************************02598000
025990 REPORT-054 SECTION.                                              02599000
026000 R054-START.                                                      02600000
026010     IF RPACTW-SC-INC-OPTION IS EQUAL TO 'N'                      02601000
026020         AND RPACTW-RATE-INC-OPTION IS EQUAL TO 'N'               02602000
026030         GO TO R054-EXIT.                                         02603000
026040     MOVE RPRPTS-RECORD TO WSRPTS-RECORD.                         02604000
026050     MOVE SPACES TO RPRPTS-DATA.                                  02605000
026060     MOVE 54 TO RPRPTS-RPTNBR.                                    02606000
026070     MOVE WS-REL-INST2 (WS-SUB1) TO RPRPTS-INST.                  02607000
026080     MOVE WS-REL-INST (WS-SUB1) TO RPRPTS-054PRIMINST.            02608000
026090     MOVE RPMST-PRODCODE TO RPRPTS-054PRIMPRODCODE.               02609000
026100     MOVE RPMST-ACCOUNT TO RPRPTS-054PRIMACCOUNT.                 02610000
026110     MOVE WS-REL-PRODCODE (WS-SUB1) TO RPRPTS-PRODCODE.           02611000
026120     MOVE WS-REL-ACCOUNT (WS-SUB1) TO RPRPTS-ACCOUNT.             02612000
026130     MOVE WS-REL-BRANCH (WS-SUB1) TO RPRPTS-BRANCH.               02613000
026140     MOVE WS-REL-ACCT-TYPE (WS-SUB1) TO RPRPTS-TYPE.              02614000
026150     MOVE RPMST-MODEL TO RPRPTS-MODEL.                            02615000
026160     MOVE WS-REL-RATEOPTION (WS-SUB1) to RPRPTS-054RATEOPTION.    02616000
026170     MOVE WS-REL-RATETYPE (WS-SUB1) to RPRPTS-054RATETYPE.        02617000
026180     MOVE WS-REL-DISCAMT-OVRD-FLAG (WS-SUB1)                      02618000
026190         TO RPRPTS-054DISCAMT-OVRD-FLAG.                          02619000
026200     MOVE WS-REL-DISCPCT-OVRD-FLAG (WS-SUB1)                      02620000
026210         TO RPRPTS-054DISCPCT-OVRD-FLAG.                          02621000
026220     MOVE WS-REL-RATEPCT-OVRD-FLAG (WS-SUB1)                      02622000
026230         TO RPRPTS-054RATEPCT-OVRD-FLAG.                          02623000
026240     IF RPACTW-SC-INC-OPTION IS EQUAL TO 'Y'                      02624000
026250         AND WS-REL-DISCAMT-OVRD-FLAG (WS-SUB1) IS EQUAL TO 'Y'   02625000
026260         MOVE WS-REL-DISCAMT-OVRD (WS-SUB1)                       02626000
026270             TO RPRPTS-054DISCAMT-OVRD                            02627000
026280     ELSE                                                         02628000
026290         MOVE ZEROS TO RPRPTS-054DISCAMT-OVRD.                    02629000
026300     IF RPACTW-SC-INC-OPTION IS EQUAL TO 'Y'                      02630000
026310         AND WS-REL-DISCPCT-OVRD-FLAG (WS-SUB1) IS EQUAL TO 'Y'   02631000
026320         MOVE WS-REL-DISCPCT-OVRD (WS-SUB1)                       02632000
026330             TO RPRPTS-054DISCPCT-OVRD                            02633000
026340     ELSE                                                         02634000
026350         MOVE ZEROS TO RPRPTS-054DISCPCT-OVRD.                    02635000
026360     IF RPACTW-RATE-INC-OPTION IS EQUAL TO 'Y'                    02636000
026370         AND WS-REL-RATEPCT-OVRD-FLAG (WS-SUB1) IS EQUAL TO 'Y'   02637000
026380         MOVE WS-REL-RATEPCT-OVRD (WS-SUB1)                       02638000
026390             TO RPRPTS-054RATEPCT-OVRD                            02639000
026400     ELSE                                                         02640000
026410         MOVE ZEROS TO RPRPTS-054RATEPCT-OVRD.                    02641000
026420     MOVE SPACES TO RPRPTS-054SPLITRATETABLE.                     02642000
026430     IF WS-REL-RATEOPTION (WS-SUB1) IS EQUAL TO '2'               02643000
026440         MOVE RPACTW-SPLIT-RATE-TABLE                             02644000
026450             TO RPRPTS-054SPLITRATETABLE.                         02645000
026460 R054-WRITE-RECORD.                                               02646000
026470     IF WS-RRPTPFC1 IS EQUAL TO '0'                               02647000
026480         GO TO R054-EXIT.                                         02648000
026490     MOVE ZEROS TO RPRPTS-SRTNUMBER.                              02649000
026500     MOVE WS-RRPTCTL1 TO RPRPTS-RPTCTL.                           02650000
026510     MOVE 'ASE' TO WS-RRPTS.                                      02651000
026520     PERFORM CALL-RPRPTS.                                         02652000
026530     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02653000
026540         GO TO AR-0048.                                           02654000
026550     MOVE WSRPTS-RECORD TO RPRPTS-RECORD.                         02655000
026560 R054-EXIT.                                                       02656000
026570     EXIT.                                                        02657000
026580******************************************************************02658000
026590 CALL-RCIF SECTION.                                               02659000
026600 CR-START.                                                        02660000
026610     MOVE WS-INST TO RPRF21-BASE-ACCT-INST.                       02661000
026620     MOVE WS-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.               02662000
026630     MOVE WS-ACCOUNT TO RPRF21-BASE-ACCT.                         02663000
026640     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          02664000
026650     MOVE SPACES TO RPRF21-BASE-CUSTOMER.                         02665000
026660     MOVE WS-FUNC TO RPRF21-FUNC.                                 02666000
026670     MOVE SPACES TO WS-FUNCTION.                                  02667000
026680     MOVE WS-RCIF-INTERFACE TO SR-060CALLNAME.                    02668000
026690 CR-GET-RCIF-INFO.                                                02669000
026700     CALL SR-060CALLNAME USING                                    02670000
026710         WS-LINKRCIF.                                             02671000
026720     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     02672000
026730         MOVE RPRF21-FUNCTION TO WS-FUNCTION                      02673000
026740         GO TO CR-EXIT.                                           02674000
026750 CR-EXIT.                                                         02675000
026760     EXIT.                                                        02676000
026770******************************************************************02677000
026780 GET-BALANCE SECTION.                                             02678000
026790 GB-START.                                                        02679000
026800     MOVE ZEROS TO WS-WORK-BALANCE.                               02680000
026810     IF WS-WORK-BALCD IS EQUAL TO ZEROS                           02681000
026820         OR WS-WORK-BALCD IS GREATER THAN 20                      02682000
026830         GO TO GB-EXIT.                                           02683000
026840     MOVE RPINT-BAL (WS-WORK-BALCD) TO WS-WORK-BALANCE.           02684000
026850 GB-EXIT.                                                         02685000
026860     EXIT.                                                        02686000
026870******************************************************************02687000
026880 GET-MESSAGE SECTION.                                             02688000
026890 GM-START.                                                        02689000
026900     MOVE SPACES TO MI2011-RECORD.                                02690000
026910     MOVE ZERO TO MIM-2011KINST.                                  02691000
026920     MOVE +2011 TO MIM-2011KREC.                                  02692000
026930     MOVE 50 TO MIM-2011KMANGER.                                  02693000
026940     MOVE WS-2011-MSGNBR TO MIM-2011KMSGNBR.                      02694000
026950     MOVE 'EN' TO MIM-2011KLANG.                                  02695000
026960     MOVE MIC-MST-2011-PRI TO MIC-MST-REC-PRI.                    02696000
026970     MOVE MI2011-RECORD TO MIMST-RECORD.                          02697000
026980     PERFORM MIC-MST-GET-REQUEST.                                 02698000
026990     IF WS-FUNCTION IS EQUAL TO SPACE                             02699000
027000         MOVE MIMST-RECORD TO MI2011-RECORD                       02700000
027010         MOVE MIM-2011MSGLEFT TO WS-MESSAGE                       02701000
027020     ELSE                                                         02702000
027030         MOVE MIM-2011KMSGNBR TO WS-2011-ERRORNBR                 02703000
027040         MOVE WS-2011-ERROR TO WS-MESSAGE.                        02704000
027050 GM-EXIT.                                                         02705000
027060     EXIT.                                                        02706000
027070******************************************************************02707000
027080 CHANGE-BANK SECTION.                                             02708000
027090 CB-START.                                                        02709000
027100     MOVE 'R  ' TO SR-APIFUNC.                                    02710000
027110     MOVE RPMST-INST TO RPBNK-INST.                               02711000
027120     PERFORM CALL-RPS-BNK.                                        02712000
027130     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02713000
027140         GO TO AR-0021.                                           02714000
027150     MOVE +4999 TO WS-MST-COUNT.                                  02715000
027160     MOVE RPBNK-CURDT TO WS-CURDTYYYYMMDD.                        02716000
027170     MOVE WS-CURDTMM TO WS-CRW-MONTH.                             02717000
027180     MOVE WS-CURDTMM TO WS-DATEMM.                                02718000
027190     MOVE WS-CURDTDD TO WS-DATEDD.                                02719000
027200     MOVE WS-CURDTYYYY TO WS-DATEYYYY.                            02720000
027210     MOVE WS-DATEMMDDYYYY TO SR-TODAY.                            02721000
027220     MOVE WS-DATEMMDDYYYY TO SR-FROMCAL.                          02722000
027230     PERFORM JULIAN-365.                                          02723000
027240     MOVE SR-TOJUL TO WS-CRW-CURDT-JUL.                           02724000
027250     MOVE SPACES TO MI0307-RECORD.                                02725000
027260     MOVE RPBNK-INST TO MIM-0307KINST.                            02726000
027270     MOVE 50 TO MIM-0307KAPPL.                                    02727000
027280     MOVE 3 TO MIM-0307KRECNBR.                                   02728000
027290     MOVE +0307 TO MIM-0307KREC.                                  02729000
027300     MOVE MIC-MST-0307-PRI TO MIC-MST-REC-PRI.                    02730000
027310     MOVE MI0307-RECORD TO MIMST-RECORD.                          02731000
027320     PERFORM MIC-MST-GET-REQUEST.                                 02732000
027330     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02733000
027340         GO TO AR-0022.                                           02734000
027350     MOVE MIMST-RECORD TO MI0307-RECORD.                          02735000
027360     MOVE MIM-DSRPTCTL (11) TO WS-RRPTCTL.                        02736000
027370     MOVE MIM-DSRPTCTL (15) TO WS-RRPTCTL1.                       02737000
027380     MOVE MIM-DSRPTCTL (16) TO WS-RRPTCTL2.                       02738000
027390 CB-REC7100.                                                      02739000
027400     MOVE SPACES TO MI7100-RECORD.                                02740000
027410     MOVE RPBNK-INST TO MIM-7100KINST.                            02741000
027420     MOVE +7100 TO MIM-7100KREC.                                  02742000
027430     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    02743000
027440     MOVE MI7100-RECORD TO MIMST-RECORD.                          02744000
027450     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           02745000
027460     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02746000
027470         GO TO AR-0023.                                           02747000
027480     MOVE MIMST-RECORD TO MI7100-RECORD.                          02748000
027490     IF MIM-7100KINST IS NOT EQUAL TO RPBNK-INST                  02749000
027500         GO TO AR-0024.                                           02750000
027510 CB-REC7101.                                                      02751000
027520     MOVE RPBNK-INST TO WS-RPMIM7101INST.                         02752000
027530     COMPUTE WS-RPMIM7101EFFDT = RPBNK-CURDT - 99999999.          02753000
027540     PERFORM LOAD-RPS-7101.                                       02754000
027550     IF WS-RPMIM7101ERROR IS EQUAL TO 'Y'                         02755000
027560         GO TO AR-0025.                                           02756000
027570 CB-REC7102.                                                      02757000
027580     MOVE RPBNK-INST TO WS-RPMIM7102INST.                         02758000
027590     PERFORM LOAD-RPS-7102.                                       02759000
027600     IF WS-RPMIM7102ERROR IS EQUAL TO 'Y'                         02760000
027610         GO TO AR-0026.                                           02761000
027620 CB-REC7103.                                                      02762000
027630     MOVE RPBNK-INST TO WS-RPMIM7103INST.                         02763000
027640     COMPUTE WS-RPMIM7103EFFDT = RPBNK-CURDT - 99999999.          02764000
027650     PERFORM LOAD-RPS-7103.                                       02765000
027660     IF WS-RPMIM7103ERROR IS EQUAL TO 'Y'                         02766000
027670         GO TO AR-0027.                                           02767000
027680 CB-REC7106.                                                      02768000
027690     MOVE RPBNK-INST TO WS-RPMIM7106INST.                         02769000
027700     PERFORM LOAD-RPS-7106.                                       02770000
027710     IF WS-RPMIM7106ERROR IS EQUAL TO 'Y'                         02771000
027720         GO TO AR-0028.                                           02772000
027730 CB-REC7109.                                                      02773000
027740     MOVE RPBNK-INST TO WS-RPMIM7109INST.                         02774000
027750     PERFORM LOAD-RPS-7109.                                       02775000
027760     IF WS-RPMIM7109ERROR IS EQUAL TO 'Y'                         02776000
027770         GO TO AR-0047.                                           02777000
027780 CB-REC7110.                                                      02778000
027790     MOVE RPBNK-INST TO WS-RPMIM7110INST.                         02779000
027800     PERFORM LOAD-RPS-7110.                                       02780000
027810     IF WS-RPMIM7110ERROR IS EQUAL TO 'Y'                         02781000
027820         GO TO AR-0052.                                           02782000
027830 CB-REC7112.                                                      02783000
027840     MOVE RPBNK-INST TO WS-RPMIM7112INST.                         02784000
027850     PERFORM LOAD-RPS-7112.                                       02785000
027860     IF WS-RPMIM7112ERROR IS EQUAL TO 'Y'                         02786000
027870         GO TO AR-0058.                                           02787000
027880 CB-REC7113.                                                      02788000
027890     MOVE RPBNK-INST TO WS-RPMIM7113INST.                         02789000
027900     PERFORM LOAD-RPS-7113.                                       02790000
027910     IF WS-RPMIM7113ERROR IS EQUAL TO 'Y'                         02791000
027920         GO TO AR-0059.                                           02792000
027930 CB-REC7114.                                                      02793000
027940     MOVE RPBNK-INST TO WS-RPMIM7114INST.                         02794000
027950     PERFORM LOAD-RPS-7114.                                       02795000
027960     IF WS-RPMIM7114ERROR IS EQUAL TO 'Y'                         02796000
027970         GO TO AR-0060.                                           02797000
027980 CB-REC2023.                                                      02798000
027990     MOVE RPBNK-INST TO WS-RPMIM2023INST.                         02799000
028000     PERFORM LOAD-RPS-2023.                                       02800000
028010     IF WS-RPMIM2023ERROR IS EQUAL TO 'Y'                         02801000
028020         GO TO AR-0029.                                           02802000
028030 CB-REC0237.                                                      02803000
028040     MOVE SPACES TO MI0237-RECORD.                                02804000
028050     MOVE RPBNK-INST TO MIM-0237KINST.                            02805000
028060     MOVE +0237 TO MIM-0237KREC.                                  02806000
028070     MOVE 50 TO MIM-0237KPROCMGR.                                 02807000
028080     MOVE 47 TO MIM-0237KINTAPPL.                                 02808000
028090     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    02809000
028100     MOVE MI0237-RECORD TO MIMST-RECORD.                          02810000
028110     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           02811000
028120     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02812000
028130         GO TO AR-0030.                                           02813000
028140     MOVE MIMST-RECORD TO MI0237-RECORD.                          02814000
028150     IF MIM-0237KINST IS NOT EQUAL TO RPBNK-INST                  02815000
028160         OR MIM-0237KPROCMGR IS NOT EQUAL TO 50                   02816000
028170         OR MIM-0237KINTAPPL IS NOT EQUAL TO 47                   02817000
028180         GO TO AR-0031.                                           02818000
028190     IF MIM-237BATINTFC IS EQUAL TO SPACES                        02819000
028200         GO TO AR-0032.                                           02820000
028210     MOVE MIM-237BATINTFC TO WS-RCIF-INTERFACE.                   02821000
028220 CB-EXIT.                                                         02822000
028230     EXIT.                                                        02823000
028240******************************************************************02824000
028250 PROCESS-SECONDARY-SERVICES SECTION.                              02825000
028260 PSS-START.                                                       02826000
028270     MOVE ZEROS TO WS-SUB7113.                                    02827000
028280     IF WS-REL-SECSVCPLAN (WS-SUB1) IS NOT EQUAL TO SPACES        02828000
028290         MOVE WS-REL-SECSVCPLAN (WS-SUB1) TO WS-SECSVCPLAN        02829000
028300         GO TO PSS-7113.                                          02830000
028310 PSS-7112.                                                        02831000
028320     IF WS-REL-SECSVCTABLE (WS-SUB1) IS EQUAL TO SPACES           02832000
028330         GO TO PSS-EXIT.                                          02833000
028340     MOVE WS-REL-SECSVCTABLE (WS-SUB1) TO WS-RPMIM7112SSTABLE.    02834000
028350     PERFORM SEARCH-RPS-7112.                                     02835000
028360     IF WS-RPMIM7112FOUND IS EQUAL TO 'N'                         02836000
028370         GO TO PSS-EXIT.                                          02837000
028380     MOVE ZEROS TO WS-SUB2.                                       02838000
028390     MOVE ZEROS TO WS-SECSVC-BAL.                                 02839000
028400     IF MIM-7112BALOPT IS EQUAL TO 'C'                            02840000
028410         MOVE RPACTW-COMBBAL1 TO WS-SECSVC-BAL                    02841000
028420         GO TO PSS-7112TABLE-LOOP.                                02842000
028430     IF MIM-7112BALOPT IS EQUAL TO 'D'                            02843000
028440         MOVE RPACTW-COMBBAL2 TO WS-SECSVC-BAL                    02844000
028450         GO TO PSS-7112TABLE-LOOP.                                02845000
028460     IF MIM-7112BALOPT IS EQUAL TO 'E'                            02846000
028470         MOVE RPACTW-COMBBAL3 TO WS-SECSVC-BAL                    02847000
028480         GO TO PSS-7112TABLE-LOOP.                                02848000
028490     IF MIM-7112BALOPT IS EQUAL TO 'F'                            02849000
028500         MOVE RPACTW-COMBBAL4 TO WS-SECSVC-BAL                    02850000
028510         GO TO PSS-7112TABLE-LOOP.                                02851000
028520     IF MIM-7112BALOPT IS NOT EQUAL TO 'G'                        02852000
028530         MOVE RPACTW-SECSVC-BAL TO WS-SECSVC-BAL                  02853000
028540         GO TO PSS-7112TABLE-LOOP.                                02854000
028550     MOVE RPACTW-COMBBAL1 TO WS-SECSVC-BAL.                       02855000
028560     IF RPACTW-COMBBAL2 IS GREATER THAN WS-SECSVC-BAL             02856000
028570         MOVE RPACTW-COMBBAL2 TO WS-SECSVC-BAL.                   02857000
028580     IF RPACTW-COMBBAL3 IS GREATER THAN WS-SECSVC-BAL             02858000
028590         MOVE RPACTW-COMBBAL3 TO WS-SECSVC-BAL.                   02859000
028600     IF RPACTW-COMBBAL4 IS GREATER THAN WS-SECSVC-BAL             02860000
028610         MOVE RPACTW-COMBBAL4 TO WS-SECSVC-BAL.                   02861000
028620 PSS-7112TABLE-LOOP.                                              02862000
028630     ADD +1 TO WS-SUB2.                                           02863000
028640     IF WS-SUB2 IS GREATER THAN +10                               02864000
028650         GO TO PSS-EXIT.                                          02865000
028660     IF WS-SUB2 IS EQUAL TO +1                                    02866000
028670         GO TO PSS-7112TABLE-CONT.                                02867000
028680     IF MIM-7112AMT (WS-SUB2) IS NOT GREATER THAN ZEROS           02868000
028690         GO TO PSS-EXIT.                                          02869000
028700 PSS-7112TABLE-CONT.                                              02870000
028710     IF WS-SECSVC-BAL IS NOT LESS THAN MIM-7112AMT (WS-SUB2)      02871000
028720         MOVE MIM-7112SECSERV (WS-SUB2) TO WS-SECSVCPLAN          02872000
028730         GO TO PSS-7112TABLE-LOOP.                                02873000
028740     IF WS-SECSVCPLAN IS EQUAL TO SPACES                          02874000
028750         GO TO PSS-EXIT.                                          02875000
028760 PSS-7113.                                                        02876000
028770     MOVE WS-SECSVCPLAN TO WS-RPMIM7113SSPLAN.                    02877000
028780     PERFORM SEARCH-RPS-7113.                                     02878000
028790     IF WS-RPMIM7113FOUND IS EQUAL TO 'N'                         02879000
028800         GO TO PSS-EXIT.                                          02880000
028810     MOVE ZEROS TO WS-SUB7113.                                    02881000
028820     MOVE ZEROS TO WS-SUBACTW.                                    02882000
028830 PSS-7113-LOOP.                                                   02883000
028840     ADD +1 TO WS-SUB7113.                                        02884000
028850     IF WS-SUB7113 IS GREATER THAN +20                            02885000
028860         GO TO PSS-EXIT.                                          02886000
028870     IF MIM-7113SECSVCCD (WS-SUB7113) IS EQUAL TO SPACE           02887000
028880         GO TO PSS-7113-LOOP.                                     02888000
028890 PSS-ACT-LOOP.                                                    02889000
028900     ADD +1 TO WS-SUBACTW.                                        02890000
028910     MOVE MIM-7113SECSVCCD (WS-SUB7113)                           02891000
028920         TO RPACTW-SECSERV (WS-SUBACTW).                          02892000
028930     GO TO PSS-7113-LOOP.                                         02893000
028940 PSS-EXIT.                                                        02894000
028950     EXIT.                                                        02895000
028960******************************************************************02896000
028970 CHECK-TRM-RESET SECTION.                                         02897000
028980 CTR-START.                                                       02898000
028990     IF WS-PRIM-SCNXT IS EQUAL TO ZEROS                           02899000
029000         AND (RPBNK-MONFLAG IS EQUAL TO 'B'                       02900000
029010         OR RPBNK-MONFLAG IS EQUAL TO 'L')                        02901000
029020         GO TO CTR-READ-TRM.                                      02902000
029030     IF WS-PRIM-SCNXT IS NOT LESS THAN RPBNK-CURDT                02903000
029040         AND WS-PRIM-SCNXT IS LESS THAN RPBNK-NPROCDTA            02904000
029050         GO TO CTR-READ-TRM.                                      02905000
029060     GO TO CTR-EXIT.                                              02906000
029070 CTR-READ-TRM.                                                    02907000
029080     MOVE RPMST-GRP-KEY TO RPTRM-GRP-KEY.                         02908000
029090     MOVE 'R U' TO SR-APIFUNC.                                    02909000
029100     PERFORM CALL-RPS-TRM.                                        02910000
029110     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02911000
029120         GO TO AR-0056.                                           02912000
029130     MOVE ZEROS TO WS-SUB1.                                       02913000
029140 CTR-INIT-TRM-LOOP.                                               02914000
029150     ADD +1 TO WS-SUB1.                                           02915000
029160     IF WS-SUB1 IS GREATER THAN WS-RPMIM7110MAXOCCURS             02916000
029170         GO TO CTR-REWRITE-TRM.                                   02917000
029180     MOVE ZEROS TO RPTRM-TRAN-DATE (WS-SUB1).                     02918000
029190     MOVE ZEROS TO RPTRM-TRAN-COUNT (WS-SUB1).                    02919000
029200     MOVE ZEROS TO RPTRM-TRAN-AMOUNT (WS-SUB1).                   02920000
029210     GO TO CTR-INIT-TRM-LOOP.                                     02921000
029220 CTR-REWRITE-TRM.                                                 02922000
029230     MOVE 'W  ' TO SR-APIFUNC.                                    02923000
029240     PERFORM CALL-RPS-TRM.                                        02924000
029250     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02925000
029260         GO TO AR-0057.                                           02926000
029270 CTR-EXIT.                                                        02927000
029280     EXIT.                                                        02928000
029290******************************************************************02929000
029300 DELETE-CASH-REWARD SECTION.                                      02930000
029310 DCR-START.                                                       02931000
029320     MOVE RPCRW-GRP-KEY TO WS-CRW-GRP-KEY.                        02932000
029330     MOVE RPCRW-GRP-DATA TO WS-CRW-GRP-DATA1.                     02933000
029340     MOVE 'D' TO WS-CRW-FUNCTION.                                 02934000
029350     WRITE RPCRWW-RECORD                                          02935000
029360         INVALID KEY                                              02936000
029370         GO TO AR-0037.                                           02937000
029380 DCR-EXIT.                                                        02938000
029390     EXIT.                                                        02939000
029400******************************************************************02940000
029410 UPDATE-CASH-REWARD SECTION.                                      02941000
029420 UCR-START.                                                       02942000
029430     MOVE MIM-7101CRWBALOPT TO RPCRW-BALOPT.                      02943000
029440     IF RPBNK-LPROCDT IS LESS THAN RPBNK-FIRSTDOY                 02944000
029450         AND RPBNK-CURDT IS NOT LESS THAN RPBNK-FIRSTDOY          02945000
029460         MOVE ZEROS TO RPCRW-AMT-YTD.                             02946000
029470     IF RPBNK-MONFLAG IS EQUAL TO 'F'                             02947000
029480         OR RPBNK-MONFLAG IS EQUAL TO 'B'                         02948000
029490         MOVE WS-CRW-COMBBAL TO RPCRW-MCOMBBAL (WS-CRW-MONTH)     02949000
029500         GO TO UCR-PAYMENT.                                       02950000
029510     IF RPBNK-CURDT IS NOT GREATER THAN RPCRW-DATE-OPEN           02951000
029520         MOVE WS-CRW-COMBBAL TO RPCRW-MCOMBBAL (WS-CRW-MONTH)     02952000
029530         GO TO UCR-PAYMENT.                                       02953000
029540     IF RPCRW-BALOPT IS EQUAL TO 'D'                              02954000
029550         MOVE WS-CRW-COMBBAL TO RPCRW-MCOMBBAL (WS-CRW-MONTH).    02955000
029560     IF RPCRW-BALOPT IS EQUAL TO 'L'                              02956000
029570         AND WS-CRW-COMBBAL IS LESS THAN                          02957000
029580             RPCRW-MCOMBBAL (WS-CRW-MONTH)                        02958000
029590         MOVE WS-CRW-COMBBAL TO RPCRW-MCOMBBAL (WS-CRW-MONTH).    02959000
029600     IF RPCRW-BALOPT IS EQUAL TO 'H'                              02960000
029610         AND WS-CRW-COMBBAL IS GREATER THAN                       02961000
029620             RPCRW-MCOMBBAL (WS-CRW-MONTH)                        02962000
029630         MOVE WS-CRW-COMBBAL TO RPCRW-MCOMBBAL (WS-CRW-MONTH).    02963000
029640 UCR-PAYMENT.                                                     02964000
029650     MOVE MIM-7101CRWPCT TO RPCRW-PCT-USED.                       02965000
029660     MOVE RPCRW-DATE-OPEN TO WS-CURDTYYYYMMDD.                    02966000
029670     IF RPCRW-LSTDATE IS GREATER THAN ZEROS                       02967000
029680         MOVE RPCRW-LSTDATE TO WS-CURDTYYYYMMDD.                  02968000
029690     MOVE WS-CURDTMM TO WS-DATEMM.                                02969000
029700     MOVE WS-CURDTDD TO WS-DATEDD.                                02970000
029710     MOVE WS-CURDTYYYY TO WS-DATEYYYY.                            02971000
029720     MOVE WS-DATEMMDDYYYY TO SR-FROMCAL.                          02972000
029730     MOVE RPCRW-NXTDATE TO WS-CURDTYYYYMMDD.                      02973000
029740     MOVE WS-CURDTMM TO WS-DATEMM.                                02974000
029750     MOVE WS-CURDTDD TO WS-DATEDD.                                02975000
029760     MOVE WS-CURDTYYYY TO WS-DATEYYYY.                            02976000
029770     MOVE WS-DATEMMDDYYYY TO SR-TOCAL.                            02977000
029780     PERFORM ELAPSED-MONTHS.                                      02978000
029790     IF SR-RESULT IS EQUAL TO ZEROS                               02979000
029800         MOVE +1 TO SR-RESULT.                                    02980000
029810     IF SR-RESULT IS GREATER THAN +12                             02981000
029820         MOVE +12 TO SR-RESULT.                                   02982000
029830     MOVE SR-RESULT TO WS-CRW-NUM-OF-MONTHS.                      02983000
029840     MOVE WS-CRW-MONTH TO WS-WORK-MONTH.                          02984000
029850     MOVE ZEROS TO WS-CRW-CALC-BAL.                               02985000
029860     MOVE ZEROS TO WS-CRW-WORK-BAL.                               02986000
029870     MOVE ZEROS TO WS-CRW-AMT.                                    02987000
029880 UCR-CALC-BALANCE.                                                02988000
029890     ADD RPCRW-MCOMBBAL (WS-WORK-MONTH) TO WS-CRW-CALC-BAL.       02989000
029900     SUBTRACT +1 FROM SR-RESULT.                                  02990000
029910     IF SR-RESULT IS EQUAL TO ZEROS                               02991000
029920         GO TO UCR-CALC-PAYMENT.                                  02992000
029930     SUBTRACT +1 FROM WS-WORK-MONTH.                              02993000
029940     IF WS-WORK-MONTH IS EQUAL TO ZEROS                           02994000
029950         MOVE +12 TO WS-WORK-MONTH.                               02995000
029960     GO TO UCR-CALC-BALANCE.                                      02996000
029970 UCR-CALC-PAYMENT.                                                02997000
029980     IF WS-CRW-CALC-BAL IS NOT GREATER THAN ZEROS                 02998000
029990         MOVE ZEROS TO WS-CRW-CALC-BAL.                           02999000
030000     COMPUTE WS-CRW-WORK-BAL =                                    03000000
030010         (WS-CRW-CALC-BAL / WS-CRW-NUM-OF-MONTHS).                03001000
030020     IF WS-CRW-WORK-BAL IS GREATER THAN MIM-7101CRWMAXCOMBBAL     03002000
030030         AND MIM-7101CRWMAXCOMBBAL IS GREATER THAN ZEROS          03003000
030040         MOVE MIM-7101CRWMAXCOMBBAL TO WS-CRW-WORK-BAL.           03004000
030050     IF RPCRW-LSTDATE IS GREATER THAN ZEROS                       03005000
030060         MOVE RPCRW-LSTDATE TO WS-CURDTYYYYMMDD                   03006000
030070     ELSE                                                         03007000
030080         MOVE RPCRW-DATE-OPEN TO WS-CURDTYYYYMMDD.                03008000
030090     MOVE WS-CURDTMM TO WS-DATEMM.                                03009000
030100     MOVE WS-CURDTDD TO WS-DATEDD.                                03010000
030110     MOVE WS-CURDTYYYY TO WS-DATEYYYY.                            03011000
030120     MOVE WS-DATEMMDDYYYY TO SR-FROMCAL.                          03012000
030130     PERFORM JULIAN-365.                                          03013000
030140     MOVE SR-TOJUL TO SR-FROMJUL.                                 03014000
030150     MOVE RPBNK-CURDT TO WS-CURDTYYYYMMDD.                        03015000
030160     MOVE WS-CURDTMM TO WS-DATEMM.                                03016000
030170     MOVE WS-CURDTDD TO WS-DATEDD.                                03017000
030180     MOVE WS-CURDTYYYY TO WS-DATEYYYY.                            03018000
030190     MOVE WS-DATEMMDDYYYY TO SR-FROMCAL.                          03019000
030200     PERFORM JULIAN-365.                                          03020000
030210     PERFORM ELAPSED-DAYS-365.                                    03021000
030220     IF RPCRW-LSTDATE IS EQUAL TO ZEROS                           03022000
030230         ADD +1 TO SR-RESULT.                                     03023000
030240     COMPUTE WS-CRW-AMT = ((WS-CRW-WORK-BAL * RPCRW-PCT-USED)     03024000
030250         / 365 * SR-RESULT).                                      03025000
030260     IF WS-CRW-AMT IS NOT GREATER THAN ZEROS                      03026000
030270         MOVE ZEROS TO WS-CRW-AMT.                                03027000
030280     IF WS-CRW-AMT IS GREATER THAN MIM-7101CRWMAXAMOUNT           03028000
030290         AND MIM-7101CRWMAXAMOUNT IS GREATER THAN ZEROS           03029000
030300         MOVE MIM-7101CRWMAXAMOUNT TO WS-CRW-AMT.                 03030000
030310     MOVE WS-CRW-AMT TO RPCRW-AMOUNT.                             03031000
030320     IF RPCRW-NXTDATE IS GREATER THAN RPBNK-CURDT                 03032000
030330         GO TO UCR-WRITE.                                         03033000
030340     IF WS-CRW-AMT IS EQUAL TO ZEROS                              03034000
030350         GO TO UCR-CALC-NEXT-DATE.                                03035000
030360     MOVE RPCRW-PRODCODE2 TO WS-RPMIM2023PRODCD.                  03036000
030370     PERFORM SEARCH-RPS-2023.                                     03037000
030380     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         03038000
030390         GO TO AR-0038.                                           03039000
030400     IF WS-2023-INTAPPL (INDX-2023) IS NOT EQUAL TO 01            03040000
030410         AND WS-2023-INTAPPL (INDX-2023) IS NOT EQUAL TO 04       03041000
030420         GO TO AR-0039.                                           03042000
030430     INITIALIZE RPPODX-RECORD.                                    03043000
030440     IF WS-2023-INTAPPL (INDX-2023) IS EQUAL TO 04                03044000
030450         MOVE 'S' TO RPPODX-ADES                                  03045000
030460     ELSE                                                         03046000
030470         MOVE 'D' TO RPPODX-ADES.                                 03047000
030480     MOVE RPCRW-INST2 TO RPPODX-INST.                             03048000
030490     MOVE RPCRW-ACCOUNT2 TO WS-CRW-ACCTX.                         03049000
030500     INSPECT WS-CRW-ACCTX REPLACING ALL ' ' BY '0'.               03050000
030510     IF WS-CRW-ACCT IS NOT NUMERIC                                03051000
030520         GO TO AR-0040.                                           03052000
030530     MOVE WS-CRW-ACCT TO RPPODX-ACCOUNT.                          03053000
030540     MOVE 0464 TO RPPODX-ITC.                                     03054000
030550     MOVE '0' TO RPPODX-DRCR.                                     03055000
030560     MOVE WS-CRW-CURDT-JUL TO RPPODX-EFFDT.                       03056000
030570     MOVE WS-CRW-AMT TO RPPODX-AMT.                               03057000
030580     IF RPPODX-ADES IS EQUAL TO 'S'                               03058000
030590         MOVE +1 TO RPPODX-SERIAL                                 03059000
030600     ELSE                                                         03060000
030610         MOVE +0 TO RPPODX-SERIAL.                                03061000
030620     MOVE +0 TO RPPODX-LLINT.                                     03062000
030630     MOVE RPCRW-ACCOUNT TO WS-CRW-ACCTX.                          03063000
030640     INSPECT WS-CRW-ACCTX REPLACING ALL ' ' BY '0'.               03064000
030650     IF WS-CRW-ACCT IS NOT NUMERIC                                03065000
030660         GO TO AR-0041.                                           03066000
030670     MOVE WS-CRW-ACCT TO RPPODX-SEQ.                              03067000
030680     MOVE 0464 TO RPPODX-EXTC.                                    03068000
030690     MOVE +50 TO RPPODX-SOURCE.                                   03069000
030700     MOVE +0 TO RPPODX-TOD.                                       03070000
030710     MOVE +0 TO RPPODX-FDAYS.                                     03071000
030720     MOVE +0 TO RPPODX-INIT.                                      03072000
030730     MOVE SPACES TO RPPODX-IDISP.                                 03073000
030740     MOVE +0 TO RPPODX-FITEM1.                                    03074000
030750     MOVE +0 TO RPPODX-FITEM2.                                    03075000
030760     MOVE +0 TO RPPODX-FITEM3.                                    03076000
030770     MOVE +0 TO RPPODX-FITEM4.                                    03077000
030780     MOVE +0 TO RPPODX-FITEM5.                                    03078000
030790     MOVE +0 TO RPPODX-LITEMS.                                    03079000
030800     MOVE +0 TO RPPODX-CASH.                                      03080000
030810     MOVE +0 TO RPPODX-SEQ1.                                      03081000
030820     MOVE SPACE TO RPPODX-CODE.                                   03082000
030830     WRITE RPPODX-RECORD                                          03083000
030840         INVALID KEY                                              03084000
030850         GO TO AR-0042.                                           03085000
030860 UCR-CALC-NEXT-DATE.                                              03086000
030870     MOVE WS-CRW-CALC-BAL TO RPCRW-LSTCOMBBALUSED.                03087000
030880     MOVE WS-CRW-AMT TO RPCRW-LAST-AMT.                           03088000
030890     ADD WS-CRW-AMT TO RPCRW-AMT-YTD.                             03089000
030900     MOVE RPBNK-CURDT TO RPCRW-LSTDATE.                           03090000
030910 UCR-CALC-NEXT-AGAIN.                                             03091000
030920     MOVE RPCRW-NXTDATE TO WS-CURDTYYYYMMDD.                      03092000
030930     MOVE WS-CURDTMM TO WS-DATEMM.                                03093000
030940     MOVE WS-CURDTDD TO WS-DATEDD.                                03094000
030950     MOVE WS-CURDTYYYY TO WS-DATEYYYY.                            03095000
030960     MOVE WS-DATEMMDDYYYY TO SR-FROMCAL.                          03096000
030970     PERFORM JULIAN-365.                                          03097000
030980     MOVE SR-TOJUL TO SR-CDATE.                                   03098000
030990     MOVE RPCRW-FREQ TO SR-CFREQ.                                 03099000
031000     MOVE RPCRW-TERM TO SR-CTERM.                                 03100000
031010     MOVE ZEROS TO SR-CDAYS.                                      03101000
031020     MOVE RPCRW-DAY TO SR-CDAY (1).                               03102000
031030     PERFORM NEXT-CYCLE-365.                                      03103000
031040     MOVE SR-CDATE TO SR-FROMJUL.                                 03104000
031050     PERFORM CALENDAR-365.                                        03105000
031060     MOVE SR-TOCAL TO WS-DATEMMDDYYYY.                            03106000
031070     MOVE WS-DATEMM TO WS-CURDTMM.                                03107000
031080     MOVE WS-DATEDD TO WS-CURDTDD.                                03108000
031090     MOVE WS-DATEYYYY TO WS-CURDTYYYY.                            03109000
031100     MOVE WS-CURDTYYYYMMDD TO RPCRW-NXTDATE.                      03110000
031110     IF RPCRW-NXTDATE IS LESS THAN RPBNK-NPROCDTA                 03111000
031120         GO TO UCR-CALC-NEXT-AGAIN.                               03112000
031130 UCR-WRITE.                                                       03113000
031140     MOVE RPCRW-GRP-KEY TO WS-CRW-GRP-KEY.                        03114000
031150     MOVE RPCRW-GRP-DATA TO WS-CRW-GRP-DATA1.                     03115000
031160     MOVE 'U' TO WS-CRW-FUNCTION.                                 03116000
031170     WRITE RPCRWW-RECORD                                          03117000
031180         INVALID KEY                                              03118000
031190         GO TO AR-0043.                                           03119000
031200 UCR-EXIT.                                                        03120000
031210     EXIT.                                                        03121000
031220******************************************************************03122000
031230*MIC-MST-API SECTION.                                             03123000
000000 COPY MIPMSTA.                                                    03124000
031250******************************************************************03125000
031260 GET-FILE-ORGANIZATION SECTION.                                   03126000
000000 COPY SRP093.                                                     03127000
031280******************************************************************03128000
031290 CALL-RPS-BNK SECTION.                                            03129000
000000 COPY RPPBNKB.                                                    03130000
031310******************************************************************03131000
031320 CALL-RPS-CRW SECTION.                                            03132000
000000 COPY RPPCRWB.                                                    03133000
031340******************************************************************03134000
031350 CALL-RPS-EVT SECTION.                                            03135000
000000 COPY RPPEVTB.                                                    03136000
031370******************************************************************03137000
031380 ADD-EVENT-HISTORY SECTION.                                       03138000
000000 COPY RPPEVTC.                                                    03139000
031400******************************************************************03140000
031410 CALL-RPS-INT SECTION.                                            03141000
000000 COPY RPPINTB.                                                    03142000
031430******************************************************************03143000
031440 CALL-RPS-MST SECTION.                                            03144000
000000 COPY RPPMSTB.                                                    03145000
031460******************************************************************03146000
031470 CALL-RPS-REL SECTION.                                            03147000
000000 COPY RPPRELB.                                                    03148000
031490******************************************************************03149000
031500 CALL-RPS-TRM SECTION.                                            03150000
000000 COPY RPPTRMB.                                                    03151000
031520******************************************************************03152000
000000 COPY RPP002.                                                     03153000
031540******************************************************************03154000
031550 LOAD-RPS-2023 SECTION.                                           03155000
000000 COPY RPP2023.                                                    03156000
031570******************************************************************03157000
031580 LOAD-RPS-7101 SECTION.                                           03158000
000000 COPY RPP7101.                                                    03159000
031600******************************************************************03160000
031610 LOAD-RPS-7102 SECTION.                                           03161000
000000 COPY RPP7102.                                                    03162000
031630******************************************************************03163000
031640 LOAD-RPS-7103 SECTION.                                           03164000
000000 COPY RPP7103.                                                    03165000
031660******************************************************************03166000
031670 LOAD-RPS-7106 SECTION.                                           03167000
000000 COPY RPP7106.                                                    03168000
031690******************************************************************03169000
031700 LOAD-RPS-7109 SECTION.                                           03170000
000000 COPY RPP7109.                                                    03171000
031720******************************************************************03172000
031730 LOAD-RPS-7110 SECTION.                                           03173000
000000 COPY RPP7110.                                                    03174000
031750******************************************************************03175000
031760 LOAD-RPS-7112 SECTION.                                           03176000
000000 COPY RPP7112.                                                    03177000
031780******************************************************************03178000
031790 LOAD-RPS-7113 SECTION.                                           03179000
000000 COPY RPP7113.                                                    03180000
031810******************************************************************03181000
031820 LOAD-RPS-7114 SECTION.                                           03182000
000000 COPY RPP7114.                                                    03183000
031840******************************************************************03184000
031850 SEARCH-RPS-2023 SECTION.                                         03185000
000000 COPY RPP2023S.                                                   03186000
031870******************************************************************03187000
031880 SEARCH-RPS-7101 SECTION.                                         03188000
000000 COPY RPP7101S.                                                   03189000
031900******************************************************************03190000
031910 SEARCH-RPS-7102 SECTION.                                         03191000
000000 COPY RPP7102S.                                                   03192000
031930******************************************************************03193000
031940 SEARCH-RPS-7103 SECTION.                                         03194000
000000 COPY RPP7103S.                                                   03195000
031960******************************************************************03196000
031970 SEARCH-RPS-7106 SECTION.                                         03197000
000000 COPY RPP7106S.                                                   03198000
031990******************************************************************03199000
032000 SEARCH-RPS-7109 SECTION.                                         03200000
000000 COPY RPP7109S.                                                   03201000
032020******************************************************************03202000
032030 SEARCH-RPS-7110 SECTION.                                         03203000
000000 COPY RPP7110S.                                                   03204000
032050******************************************************************03205000
032060 SEARCH-RPS-7112 SECTION.                                         03206000
000000 COPY RPP7112S.                                                   03207000
032080******************************************************************03208000
032090 SEARCH-RPS-7113 SECTION.                                         03209000
000000 COPY RPP7113S.                                                   03210000
032110******************************************************************03211000
032120 SEARCH-RPS-7114 SECTION.                                         03212000
000000 COPY RPP7114S.                                                   03213000
032140******************************************************************03214000
032150 JULIAN-365 SECTION.                                              03215000
000000 COPY SRP001.                                                     03216000
032170******************************************************************03217000
032180 CALENDAR-365 SECTION.                                            03218000
000000 COPY SRP003.                                                     03219000
032200******************************************************************03220000
032210 ELAPSED-DAYS-365 SECTION.                                        03221000
000000 COPY SRP005.                                                     03222000
032230***************************************************************** 03223000
032240 NEXT-CODASYL-365 SECTION.                                        03224000
000000 COPY SRP088.                                                     03225000
032260******************************************************************03226000
032270 CALL-RPRPTS SECTION.                                             03227000
000000 COPY RPPRPTS.                                                    03228000
032290******************************************************************03229000
032300 ELAPSED-MONTHS SECTION.                                          03230000
000000 COPY SRP101.                                                     03231000
032320******************************************************************03232000
032330 NEXT-DATE-365 SECTION.                                           03233000
000000 COPY SRP009.                                                     03234000
032350******************************************************************03235000
032360 NEXT-CYCLE-365 SECTION.                                          03236000
000000 COPY SRP022.                                                     03237000
032380******************************************************************03238000
032390 ABORT-ROUTINE SECTION.                                           03239000
032400 AR-0001.                                                         03240000
032410     MOVE 1 TO WS-ABCODE.                                         03241000
032420     GO TO AR-MSG.                                                03242000
032430 AR-0002.                                                         03243000
032440     MOVE 2 TO WS-ABCODE.                                         03244000
032450     GO TO AR-MSG.                                                03245000
032460 AR-0003.                                                         03246000
032470     MOVE 3 TO WS-ABCODE.                                         03247000
032480     GO TO AR-MSG.                                                03248000
032490 AR-0004.                                                         03249000
032500     MOVE 4 TO WS-ABCODE.                                         03250000
032510     GO TO AR-MSG.                                                03251000
032520 AR-0005.                                                         03252000
032530     MOVE 5 TO WS-ABCODE.                                         03253000
032540     GO TO AR-MSG.                                                03254000
032550 AR-0006.                                                         03255000
032560     MOVE 6 TO WS-ABCODE.                                         03256000
032570     GO TO AR-MSG.                                                03257000
032580 AR-0007.                                                         03258000
032590     MOVE 7 TO WS-ABCODE.                                         03259000
032600     GO TO AR-MSG.                                                03260000
032610 AR-0008.                                                         03261000
032620     MOVE 8 TO WS-ABCODE.                                         03262000
032630     GO TO AR-MSG.                                                03263000
032640 AR-0009.                                                         03264000
032650     MOVE 9 TO WS-ABCODE.                                         03265000
032660     GO TO AR-MSG.                                                03266000
032670 AR-0010.                                                         03267000
032680     MOVE 10 TO WS-ABCODE.                                        03268000
032690     GO TO AR-MSG.                                                03269000
032700 AR-0011.                                                         03270000
032710     MOVE 11 TO WS-ABCODE.                                        03271000
032720     GO TO AR-MSG.                                                03272000
032730 AR-0012.                                                         03273000
032740     MOVE 12 TO WS-ABCODE.                                        03274000
032750     GO TO AR-MSG.                                                03275000
032760 AR-0013.                                                         03276000
032770     MOVE 13 TO WS-ABCODE.                                        03277000
032780     GO TO AR-MSG.                                                03278000
032790 AR-0014.                                                         03279000
032800     MOVE 14 TO WS-ABCODE.                                        03280000
032810     GO TO AR-MSG.                                                03281000
032820 AR-0015.                                                         03282000
032830     MOVE 15 TO WS-ABCODE.                                        03283000
032840     GO TO AR-MSG.                                                03284000
032850 AR-0016.                                                         03285000
032860     MOVE 16 TO WS-ABCODE.                                        03286000
032870     GO TO AR-MSG.                                                03287000
032880 AR-0017.                                                         03288000
032890     MOVE 17 TO WS-ABCODE.                                        03289000
032900     GO TO AR-MSG.                                                03290000
032910 AR-0018.                                                         03291000
032920     MOVE 18 TO WS-ABCODE.                                        03292000
032930     GO TO AR-MSG.                                                03293000
032940 AR-0019.                                                         03294000
032950     MOVE 19 TO WS-ABCODE.                                        03295000
032960     GO TO AR-MSG.                                                03296000
032970 AR-0020.                                                         03297000
032980     MOVE 20 TO WS-ABCODE.                                        03298000
032990     GO TO AR-MSG.                                                03299000
033000 AR-0021.                                                         03300000
033010     MOVE 21 TO WS-ABCODE.                                        03301000
033020     GO TO AR-MSG.                                                03302000
033030 AR-0022.                                                         03303000
033040     MOVE 22 TO WS-ABCODE.                                        03304000
033050     GO TO AR-MSG.                                                03305000
033060 AR-0023.                                                         03306000
033070     MOVE 23 TO WS-ABCODE.                                        03307000
033080     GO TO AR-MSG.                                                03308000
033090 AR-0024.                                                         03309000
033100     MOVE 24 TO WS-ABCODE.                                        03310000
033110     GO TO AR-MSG.                                                03311000
033120 AR-0025.                                                         03312000
033130     MOVE 25 TO WS-ABCODE.                                        03313000
033140     GO TO AR-MSG.                                                03314000
033150 AR-0026.                                                         03315000
033160     MOVE 26 TO WS-ABCODE.                                        03316000
033170     GO TO AR-MSG.                                                03317000
033180 AR-0027.                                                         03318000
033190     MOVE 27 TO WS-ABCODE.                                        03319000
033200     GO TO AR-MSG.                                                03320000
033210 AR-0028.                                                         03321000
033220     MOVE 28 TO WS-ABCODE.                                        03322000
033230     GO TO AR-MSG.                                                03323000
033240 AR-0029.                                                         03324000
033250     MOVE 29 TO WS-ABCODE.                                        03325000
033260     GO TO AR-MSG.                                                03326000
033270 AR-0030.                                                         03327000
033280     MOVE 30 TO WS-ABCODE.                                        03328000
033290     GO TO AR-MSG.                                                03329000
033300 AR-0031.                                                         03330000
033310     MOVE 31 TO WS-ABCODE.                                        03331000
033320     GO TO AR-MSG.                                                03332000
033330 AR-0032.                                                         03333000
033340     MOVE 32 TO WS-ABCODE.                                        03334000
033350     GO TO AR-MSG.                                                03335000
033360 AR-0033.                                                         03336000
033370     MOVE 33 TO WS-ABCODE.                                        03337000
033380     GO TO AR-MSG.                                                03338000
033390 AR-0034.                                                         03339000
033400     MOVE 34 TO WS-ABCODE.                                        03340000
033410     GO TO AR-MSG.                                                03341000
033420 AR-0035.                                                         03342000
033430     MOVE 35 TO WS-ABCODE.                                        03343000
033440     GO TO AR-MSG.                                                03344000
033450 AR-0036.                                                         03345000
033460     MOVE 36 TO WS-ABCODE.                                        03346000
033470     GO TO AR-MSG.                                                03347000
033480 AR-0037.                                                         03348000
033490     MOVE 37 TO WS-ABCODE.                                        03349000
033500     GO TO AR-MSG.                                                03350000
033510 AR-0038.                                                         03351000
033520     MOVE 38 TO WS-ABCODE.                                        03352000
033530     GO TO AR-MSG.                                                03353000
033540 AR-0039.                                                         03354000
033550     MOVE 39 TO WS-ABCODE.                                        03355000
033560     GO TO AR-MSG.                                                03356000
033570 AR-0040.                                                         03357000
033580     MOVE 40 TO WS-ABCODE.                                        03358000
033590     GO TO AR-MSG.                                                03359000
033600 AR-0041.                                                         03360000
033610     MOVE 41 TO WS-ABCODE.                                        03361000
033620     GO TO AR-MSG.                                                03362000
033630 AR-0042.                                                         03363000
033640     MOVE 42 TO WS-ABCODE.                                        03364000
033650     GO TO AR-MSG.                                                03365000
033660 AR-0043.                                                         03366000
033670     MOVE 43 TO WS-ABCODE.                                        03367000
033680     GO TO AR-MSG.                                                03368000
033690 AR-0044.                                                         03369000
033700     MOVE 44 TO WS-ABCODE.                                        03370000
033710     GO TO AR-MSG.                                                03371000
033720 AR-0045.                                                         03372000
033730     MOVE 45 TO WS-ABCODE.                                        03373000
033740     GO TO AR-MSG.                                                03374000
033750 AR-0046.                                                         03375000
033760     MOVE 46 TO WS-ABCODE.                                        03376000
033770     GO TO AR-MSG.                                                03377000
033780 AR-0047.                                                         03378000
033790     MOVE 47 TO WS-ABCODE.                                        03379000
033800     GO TO AR-MSG.                                                03380000
033810 AR-0048.                                                         03381000
033820     MOVE 48 TO WS-ABCODE.                                        03382000
033830     GO TO AR-MSG.                                                03383000
033840 AR-0049.                                                         03384000
033850     MOVE 49 TO WS-ABCODE.                                        03385000
033860     GO TO AR-MSG.                                                03386000
033870 AR-0050.                                                         03387000
033880     MOVE 50 TO WS-ABCODE.                                        03388000
033890     GO TO AR-MSG.                                                03389000
033900 AR-0051.                                                         03390000
033910     MOVE 51 TO WS-ABCODE.                                        03391000
033920     GO TO AR-MSG.                                                03392000
033930 AR-0052.                                                         03393000
033940     MOVE 52 TO WS-ABCODE.                                        03394000
033950     GO TO AR-MSG.                                                03395000
033960 AR-0053.                                                         03396000
033970     MOVE 53 TO WS-ABCODE.                                        03397000
033980     GO TO AR-MSG.                                                03398000
033990 AR-0054.                                                         03399000
034000     MOVE 54 TO WS-ABCODE.                                        03400000
034010     GO TO AR-MSG.                                                03401000
034020 AR-0055.                                                         03402000
034030     MOVE 55 TO WS-ABCODE.                                        03403000
034040     GO TO AR-MSG.                                                03404000
034050 AR-0056.                                                         03405000
034060     MOVE 56 TO WS-ABCODE.                                        03406000
034070     GO TO AR-MSG.                                                03407000
034080 AR-0057.                                                         03408000
034090     MOVE 57 TO WS-ABCODE.                                        03409000
034100     GO TO AR-MSG.                                                03410000
034110 AR-0058.                                                         03411000
034120     MOVE 58 TO WS-ABCODE.                                        03412000
034130     GO TO AR-MSG.                                                03413000
034140 AR-0059.                                                         03414000
034150     MOVE 59 TO WS-ABCODE.                                        03415000
034160     GO TO AR-MSG.                                                03416000
034170 AR-0060.                                                         03417000
034180     MOVE 60 TO WS-ABCODE.                                        03418000
034190     GO TO AR-MSG.                                                03419000
034200 AR-0061.                                                         03420000
034210     MOVE 61 TO WS-ABCODE.                                        03421000
034220     GO TO AR-MSG.                                                03422000
034230 AR-0062.                                                         03423000
034240     MOVE 62 TO WS-ABCODE.                                        03424000
034250     GO TO AR-MSG.                                                03425000
034260 AR-0063.                                                         03426000
034270     MOVE 63 TO WS-ABCODE.                                        03427000
034280     GO TO AR-MSG.                                                03428000
034290 AR-0064.                                                         03429000
034300     MOVE 64 TO WS-ABCODE.                                        03430000
034310     GO TO AR-MSG.                                                03431000
034320 AR-0065.                                                         03432000
034330     MOVE 65 TO WS-ABCODE.                                        03433000
034340     GO TO AR-MSG.                                                03434000
034350 AR-MSG.                                                          03435000
034360     MOVE WS-FUNCTION TO WS-ABFC.                                 03436000
034370 AR-PRINT.                                                        03437000
000000 COPY SRP029.                                                     03438000
034390******************************************************************03439000
034400 END-ROUTINE SECTION.                                             03440000
034410 ER-START.                                                        03441000
034420     CLOSE RP-PODXFIL.                                            03442000
034430     CLOSE RP-CRWWFIL.                                            03443000
034440     MOVE 'GC ' TO SR-APIFUNC.                                    03444000
034450     PERFORM CALL-RPS-BNK.                                        03445000
034460     STOP RUN.                                                    03446000
