000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPD251.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*                                                                *00005000
000060*    RPD251 - CREATE NEW SORTED TRANSACTION WORK 2 FILE          *00006000
000070*                                                                *00007000
000080******************************************************************00008000
000090 ENVIRONMENT DIVISION.                                            00009000
000100 CONFIGURATION SECTION.                                           00010000
000110 SPECIAL-NAMES.                                                   00011000
000120     C01 IS C-01, C02 IS C-02, C03 IS C-03.                       00012000
000130 INPUT-OUTPUT SECTION.                                            00013000
000140 FILE-CONTROL.                                                    00014000
000000 COPY RPTRNWSS.                                                   00015000
000000 COPY RPTRNW2S.                                                   00016000
000000 COPY RPSORTS.                                                    00017000
000180 DATA DIVISION.                                                   00018000
000190 FILE SECTION.                                                    00019000
000000 COPY RPTRNWSF.                                                   00020000
000210 01  RP-TRNWSREC                 PIC X(043).                      00021000
000000 COPY RPTRNW2F.                                                   00022000
000230 01  RP-TRNW2REC                 PIC X(072).                      00023000
000000 COPY RPSRT081.                                                   00024000
000250 01  RP-SORTREC.                                                  00025000
000260     03  RP-S-SORT-KEY.                                           00026000
000270         05  RP-S-ACCT1-KEY.                                      00027000
000280             07  RP-S-INST           PIC 9(04).                   00028000
000290             07  RP-S-PRODCODE       PIC X(06).                   00029000
000300             07  RP-S-ACCOUNT        PIC X(18).                   00030000
000310             07  RP-S-MODEL          PIC X(10).                   00031000
000320         05  RP-S-ACCT2-KEY.                                      00032000
000330             07  RP-S-INST2          PIC 9(04).                   00033000
000340             07  RP-S-PRODCODE2      PIC X(06).                   00034000
000350             07  RP-S-ACCOUNT2       PIC X(18).                   00035000
000360         05  RP-S-EXTC               PIC 9(04).                   00036000
000370         05  RP-S-ITC                PIC X(04).                   00037000
000380     03  RP-S-SORT-DATA.                                          00038000
000390         05  RP-S-AMOUNT         PIC S9(11)V99   COMP-3.          00039000
000400*----------------------------------------------------------------*00040000
000410 WORKING-STORAGE SECTION.                                         00041000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00042000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00042001
000430 01  RPS-RLSELIT.                                                 00043000
000000 COPY RPWRLSE.                                                    00044000
000450 01  MIC-RLSELIT.                                                 00045000
000000 COPY MIWRLSE.                                                    00046000
000470 01  MIWPRI-AREAS.                                                00047000
000000 COPY MIWPRI.                                                     00048000
000490 01  SRW105-AREAS.                                                00049000
000000 COPY SRW105.                                                     00050000
000510*01  BICPBPRM.                                                    00051000
000000 COPY BICPBPRM.                                                   00052000
000530*01  BICRSRB.                                                     00053000
000000 COPY BICRSRB.                                                    00054000
000550*01  BICRPSB.                                                     00055000
000000 COPY BICRPSB.                                                    00056000
000570*01  BICRVERB.                                                    00057000
000000 COPY BICRVERB.                                                   00058000
000590*01  BICRSTAT.                                                    00059000
000000 COPY BICRSTAT.                                                   00060000
000610*01  BICRDBS.                                                     00061000
000000 COPY BICRDBS.                                                    00062000
000630 01  RPSEC-RECORD.                                                00063000
000000 COPY RPSSEC.                                                     00064000
000650 01  RPSECA-AREA.                                                 00065000
000000 COPY RPWSECA.                                                    00066000
000670 01  FILLER                      PIC X(08)       VALUE '*MISMST*'.00067000
000680 01  MIMST-RECORD.                                                00068000
000000 COPY MISMST.                                                     00069000
000700 01  MIWMSTA-AREAS.                                               00070000
000000 COPY MIWMSTA.                                                    00071000
000720 01  WS-ABEND.                                                    00072000
000000 COPY SRW028.                                                     00073000
000740 01  SRW060-AREAS.                                                00074000
000000 COPY SRW060.                                                     00075000
000760 01  WS-TRNWREC.                                                  00076000
000000 COPY RPSTRNW.                                                    00077000
000780 01  WS-STORAGE.                                                  00078000
000790     03  FILLER                  PIC X(18)       VALUE            00079000
000800         '*** WS-STORAGE ***'.                                    00080000
000810     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00081000
000820     03  WS-SUB1                 PIC S9(04)      COMP             00082000
000830                                                 VALUE +0.        00083000
000840     03  WS-SUB2                 PIC S9(04)      COMP             00084000
000850                                                 VALUE +0.        00085000
000860     03  WS-TRNW-EOF             PIC X(01)       VALUE 'N'.       00086000
000870     03  WS-SEC-EOF              PIC X(01)       VALUE 'N'.       00087000
000880     03  WS-SEC-KEY              PIC X(28).                       00088000
000890     03  WS-HOLD-SEC-KEY         PIC X(28).                       00089000
000900     03  WS-SEC-TABLE.                                            00090000
000910         05  WS-SEC-DATA                         OCCURS 10.       00091000
000920             07  WS-SEC-ACCT1-GRP.                                00092000
000930                 09  WS-SEC-INST                                  00093000
000940                                 PIC 9(04).                       00094000
000950                 09  WS-SEC-PRODCODE                              00095000
000960                                 PIC X(06).                       00096000
000970                 09  WS-SEC-ACCOUNT                               00097000
000980                                 PIC X(18).                       00098000
000990             07  WS-SEC-ACCT2-GRP.                                00099000
001000                 09  WS-SEC-INST2                                 00100000
001010                                 PIC 9(04).                       00101000
001020                 09  WS-SEC-PRODCODE2                             00102000
001030                                 PIC X(06).                       00103000
001040                 09  WS-SEC-ACCOUNT2                              00104000
001050                                 PIC X(18).                       00105000
001060                 09  WS-SEC-MODEL2                                00106000
001070                                 PIC X(10).                       00107000
001080******************************************************************00108000
001090 PROCEDURE DIVISION.                                              00109000
001100******************************************************************00110000
001110 INITIALIZATION SECTION.                                          00111000
001120 IN-START.                                                        00112000
001130     PERFORM GET-FILE-ORGANIZATION.                               00113000
001140     MOVE 'RPD251' TO SR-APIPROGLIT.                              00114000
001150     MOVE 'RPD251' TO WS-ABPROGID.                                00115000
001160     MOVE ZEROS TO WS-SUB1.                                       00116000
001170     MOVE SPACES TO WS-SEC-TABLE.                                 00117000
001180     OPEN INPUT RP-TRNWSFIL.                                      00118000
001190 IN-EXIT.                                                         00119000
001200     EXIT.                                                        00120000
001210******************************************************************00121000
001220 OPEN-API-FILES SECTION.                                          00122000
001230 OAF-START.                                                       00123000
001240     MOVE 'O R' TO SR-APIFUNC.                                    00124000
001250     PERFORM CALL-RPS-SEC.                                        00125000
001260     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00126000
001270         GO TO AR-0001.                                           00127000
001280 OAF-EXIT.                                                        00128000
001290     EXIT.                                                        00129000
001300******************************************************************00130000
001310 MAIN-LOGIC SECTION.                                              00131000
001320 ML-START.                                                        00132000
001330     MOVE ZEROS TO RPSEC-GRP-KEY.                                 00133000
001340     MOVE 200704 TO SORT-CORE-SIZE.                               00134000
001350     SORT RP-SORTFIL                                              00135000
001360         ASCENDING KEY                                            00136000
001370         RP-S-SORT-KEY                                            00137000
001380         INPUT PROCEDURE IS INPUT-TRNWFILE                        00138000
001390         GIVING RP-TRNW2FIL.                                      00139000
001400     IF SORT-RETURN IS NOT EQUAL TO ZERO                          00140000
001410         GO TO AR-0002.                                           00141000
001420 ML-END.                                                          00142000
001430     GO TO END-ROUTINE.                                           00143000
001440 ML-EXIT.                                                         00144000
001450     EXIT.                                                        00145000
001460******************************************************************00146000
001470 INPUT-TRNWFILE SECTION.                                          00147000
001480 IT-START.                                                        00148000
001490     READ RP-TRNWSFIL INTO WS-TRNWREC                             00149000
001500         AT END                                                   00150000
001510         GO TO IT-EXIT.                                           00151000
001520 IT-READNEXT-SEC.                                                 00152000
001530     MOVE 'N  ' TO SR-APIFUNC.                                    00153000
001540     PERFORM CALL-RPS-SEC.                                        00154000
001550     IF WS-FUNCTION IS EQUAL TO 'E'                               00155000
001560         GO TO IT-EXIT.                                           00156000
001570     IF WS-FUNCTION IS EQUAL TO 'E'                               00157000
001580         AND WS-SUB1 IS EQUAL TO ZEROS                            00158000
001590         GO TO IT-EXIT.                                           00159000
001600     IF WS-FUNCTION IS EQUAL TO 'E'                               00160000
001610         MOVE 'Y' TO WS-SEC-EOF                                   00161000
001620         GO TO IT-RELEASE-SORTREC.                                00162000
001630     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00163000
001640         GO TO AR-0003.                                           00164000
001650     MOVE RPSEC-ACCT1-GRP TO WS-SEC-KEY.                          00165000
001660     GO TO IT-PROCESS.                                            00166000
001670 IT-READNEXT-TRNW.                                                00167000
001680     READ RP-TRNWSFIL INTO WS-TRNWREC                             00168000
001690         AT END                                                   00169000
001700         GO TO IT-EXIT.                                           00170000
001710 IT-PROCESS.                                                      00171000
001720     IF RPTRNW-ACCT-KEY IS LESS THAN WS-SEC-KEY                   00172000
001730         AND WS-SUB1 IS GREATER THAN ZEROS                        00173000
001740         GO TO IT-RELEASE-SORTREC.                                00174000
001750     IF RPTRNW-ACCT-KEY IS LESS THAN WS-SEC-KEY                   00175000
001760         GO TO IT-READNEXT-TRNW.                                  00176000
001770     IF RPTRNW-ACCT-KEY IS GREATER THAN WS-SEC-KEY                00177000
001780         GO TO IT-READNEXT-SEC.                                   00178000
001790     MOVE RPSEC-ACCT1-GRP TO WS-HOLD-SEC-KEY.                     00179000
001800     ADD +1 TO WS-SUB1.                                           00180000
001810     MOVE RPSEC-INST TO WS-SEC-INST (WS-SUB1).                    00181000
001820     MOVE RPSEC-PRODCODE TO WS-SEC-PRODCODE (WS-SUB1).            00182000
001830     MOVE RPSEC-ACCOUNT TO WS-SEC-ACCOUNT (WS-SUB1).              00183000
001840     MOVE RPSEC-INST2 TO WS-SEC-INST2 (WS-SUB1).                  00184000
001850     MOVE RPSEC-PRODCODE2 TO WS-SEC-PRODCODE2 (WS-SUB1).          00185000
001860     MOVE RPSEC-ACCOUNT2 TO WS-SEC-ACCOUNT2 (WS-SUB1).            00186000
001870     MOVE RPSEC-MODEL2 TO WS-SEC-MODEL2 (WS-SUB1).                00187000
001880     GO TO IT-READNEXT-SEC.                                       00188000
001890 IT-READNEXT-TRNW2.                                               00189000
001900     READ RP-TRNWSFIL INTO WS-TRNWREC                             00190000
001910         AT END                                                   00191000
001920         GO TO IT-EXIT.                                           00192000
001930     IF RPTRNW-ACCT-KEY IS NOT EQUAL TO WS-HOLD-SEC-KEY           00193000
001940         AND WS-SEC-EOF IS EQUAL TO 'Y'                           00194000
001950         GO TO IT-EXIT.                                           00195000
001960     IF RPTRNW-ACCT-KEY IS NOT EQUAL TO WS-HOLD-SEC-KEY           00196000
001970         MOVE ZEROS TO WS-SUB1                                    00197000
001980         MOVE SPACES TO WS-SEC-TABLE                              00198000
001990         GO TO IT-PROCESS.                                        00199000
002000 IT-RELEASE-SORTREC.                                              00200000
002010     MOVE ZEROS TO WS-SUB2.                                       00201000
002020 IT-TABLE-LOOP.                                                   00202000
002030     ADD +1 TO WS-SUB2.                                           00203000
002040     IF WS-SUB2 IS GREATER THAN WS-SUB1                           00204000
002050         GO TO IT-READNEXT-TRNW2.                                 00205000
002060     IF WS-SEC-INST2 (WS-SUB2) IS EQUAL TO ZEROS                  00206000
002070         AND WS-SEC-PRODCODE2 (WS-SUB2) IS EQUAL TO SPACES        00207000
002080         AND WS-SEC-ACCOUNT2 (WS-SUB2) IS EQUAL TO SPACES         00208000
002090         MOVE WS-SEC-INST (WS-SUB2) TO RP-S-INST                  00209000
002100         MOVE WS-SEC-PRODCODE (WS-SUB2) TO RP-S-PRODCODE          00210000
002110         MOVE WS-SEC-ACCOUNT (WS-SUB2) TO RP-S-ACCOUNT            00211000
002120         MOVE WS-SEC-MODEL2 (WS-SUB2) TO RP-S-MODEL               00212000
002130         MOVE ZEROS TO RP-S-INST2                                 00213000
002140         MOVE SPACES TO RP-S-PRODCODE2                            00214000
002150         MOVE SPACES TO RP-S-ACCOUNT2                             00215000
002160     ELSE                                                         00216000
002170         MOVE WS-SEC-ACCT2-GRP (WS-SUB2) TO RP-S-ACCT1-KEY        00217000
002180         MOVE WS-SEC-ACCT1-GRP (WS-SUB2) TO RP-S-ACCT2-KEY.       00218000
002190     MOVE RPTRNW-EXTC TO RP-S-EXTC.                               00219000
002200     MOVE RPTRNW-ITC TO RP-S-ITC.                                 00220000
002210     MOVE RPTRNW-AMOUNT TO RP-S-AMOUNT.                           00221000
002220     RELEASE RP-SORTREC.                                          00222000
002230     GO TO IT-TABLE-LOOP.                                         00223000
002240 IT-EXIT.                                                         00224000
002250     EXIT.                                                        00225000
002260******************************************************************00226000
002270*MIC-MST-API SECTION.                                             00227000
000000 COPY MIPMSTA.                                                    00228000
002290******************************************************************00229000
002300 GET-FILE-ORGANIZATION SECTION.                                   00230000
000000 COPY SRP093.                                                     00231000
002320******************************************************************00232000
002330 CALL-RPS-SEC SECTION.                                            00233000
000000 COPY RPPSECB.                                                    00234000
002350******************************************************************00235000
002360 ABORT-ROUTINE SECTION.                                           00236000
002370 AR-0001.                                                         00237000
002380     MOVE 1 TO WS-ABCODE.                                         00238000
002390     GO TO AR-MSG.                                                00239000
002400 AR-0002.                                                         00240000
002410     MOVE 2 TO WS-ABCODE.                                         00241000
002420     GO TO AR-MSG.                                                00242000
002430 AR-0003.                                                         00243000
002440     MOVE 3 TO WS-ABCODE.                                         00244000
002450     GO TO AR-MSG.                                                00245000
002460 AR-MSG.                                                          00246000
002470     MOVE WS-FUNCTION TO WS-ABFC.                                 00247000
002480 AR-PRINT.                                                        00248000
000000 COPY SRP029.                                                     00249000
002500******************************************************************00250000
002510 END-ROUTINE SECTION.                                             00251000
002520 ER-START.                                                        00252000
002530     CLOSE RP-TRNWSFIL.                                           00253000
002540     MOVE 'GC ' TO SR-APIFUNC.                                    00254000
002550     PERFORM CALL-RPS-SEC.                                        00255000
002560     STOP RUN.                                                    00256000
