000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPD340.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*                                                                *00005000
000060*    RPD340 -  RP STOCK FORM REPORT SORT                         *00006000
000070*                                                                *00007000
000080******************************************************************00008000
000090 ENVIRONMENT DIVISION.                                            00009000
000100 CONFIGURATION SECTION.                                           00010000
000110 SPECIAL-NAMES.                                                   00011000
000120     C01 IS C-01, C02 IS C-02, C03 IS C-03.                       00012000
000130 INPUT-OUTPUT SECTION.                                            00013000
000140 FILE-CONTROL.                                                    00014000
000000 COPY RPCARDS.                                                    00015000
000000 COPY RPSORTS.                                                    00016000
000000 COPY RPRPT3S.                                                    00017000
000180 DATA DIVISION.                                                   00018000
000190 FILE SECTION.                                                    00019000
000000 COPY RPCARDF.                                                    00020000
000210 01  RPCARD-RECORD.                                               00021000
000220     03  RP-CARDDATA.                                             00022000
000230         05  RP-CARDCONTROL      PIC X(06).                       00023000
000240         05  RP-CARDMNTJRN       PIC X(01).                       00024000
000250         05  FILLER              PIC X(73).                       00025000
000000 COPY RPSRT421.                                                   00026000
000270 01  RPSORT-RECORD.                                               00027000
000280     03  FILLER                  PIC X(351).                      00028000
000290     03  RP-SORTKEY.                                              00029000
000300         05  RP-SORTKEYS         PIC X(55).                       00030000
000310         05  RP-SORTKEYT         PIC X(15).                       00031000
000000 COPY RPRPT3F.                                                    00032000
000330 01  RPRPT3-RECORD               PIC X(421).                      00033000
000340******************************************************************00034000
000350 WORKING-STORAGE SECTION.                                         00035000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00036000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00036001
000370 01  RPS-RLSELIT.                                                 00037000
000000 COPY RPWRLSE.                                                    00038000
000390 01  MIWPRI-AREAS.                                                00039000
000000 COPY MIWPRI.                                                     00040000
000410 01  RPWPRI-AREAS.                                                00041000
000000 COPY RPWPRI.                                                     00042000
000430 01  MIC-RLSELIT.                                                 00043000
000000 COPY MIWRLSE.                                                    00044000
000450 01  SRW105-AREAS.                                                00045000
000000 COPY SRW105.                                                     00046000
000470*01  BICPBPRM.                                                    00047000
000000 COPY BICPBPRM.                                                   00048000
000490*01  BICRSRB.                                                     00049000
000000 COPY BICRSRB.                                                    00050000
000510*01  BICRPSB.                                                     00051000
000000 COPY BICRPSB.                                                    00052000
000530*01  BICRVERB.                                                    00053000
000000 COPY BICRVERB.                                                   00054000
000550*01  BICRSTAT.                                                    00055000
000000 COPY BICRSTAT.                                                   00056000
000570*01  BICRDBS.                                                     00057000
000000 COPY BICRDBS.                                                    00058000
000590 01  FILLER                      PIC X(08)       VALUE '*RPSBNK*'.00059000
000600 01  RPBNK-RECORD.                                                00060000
000000 COPY RPSBNK.                                                     00061000
000620 01  FILLER                      PIC X(08)       VALUE '*RPRPTS*'.00062000
000630 01  RPRPTS-RECORD.                                               00063000
000000 COPY RPSRPTS.                                                    00064000
000650     03  WS-RPTSKEY              PIC X(70).                       00065000
000660 01  FILLER                      PIC X(08)       VALUE '*RPWBNKA'.00066000
000670 01  RPBNKA-AREA.                                                 00067000
000000 COPY RPWBNKA.                                                    00068000
000690 01  RPWRPTS-AREAS.                                               00069000
000000 COPY RPWRPTS.                                                    00070000
000710 01  FILLER                      PIC X(08)       VALUE '*MIMAST*'.00071000
000720 01  MIMST-RECORD.                                                00072000
000000 COPY MISMST.                                                     00073000
000740 01  FILLER                      PIC X(08)       VALUE '*MI0237*'.00074000
000750 01  MI0237-RECORD.                                               00075000
000000 COPY MIS0237A.                                                   00076000
000770 01  FILLER                      PIC X(08)       VALUE '*MI1001*'.00077000
000780 01  MI1001-RECORD.                                               00078000
000000 COPY MIS1001A.                                                   00079000
000800 01  FILLER                      PIC X(08)       VALUE '*MI7100*'.00080000
000810 01  MI7100-RECORD.                                               00081000
000000 COPY MIS7100.                                                    00082000
000830 01  MIWMSTA-AREAS.                                               00083000
000000 COPY MIWMSTA.                                                    00084000
000850 01  FILLER                      PIC X(08)       VALUE '*SRW015*'.00085000
000860 01  SRW015-AREAS.                                                00086000
000000 COPY SRW015.                                                     00087000
000880 01  FILLER                      PIC X(08)       VALUE '*SRW000*'.00088000
000890 01  SRW000-AREAS.                                                00089000
000000 COPY SRW000.                                                     00090000
000910 01  FILLER                      PIC X(08)       VALUE '*SRW060*'.00091000
000920 01  SRW060-AREAS.                                                00092000
000000 COPY SRW060.                                                     00093000
000940 01  FILLER                      PIC X(08)       VALUE '*SRW066*'.00094000
000950 01  SRW066-AREAS.                                                00095000
000000 COPY SRW066.                                                     00096000
000970 01  FILLER                      PIC X(08)       VALUE '*SRW028*'.00097000
000980 01  WS-ABEND.                                                    00098000
000000 COPY SRW028.                                                     00099000
001000 01  FILLER                      PIC X(08)       VALUE '*SRW033*'.00100000
001010 01  SRW033-AREAS.                                                00101000
000000 COPY SRW033.                                                     00102000
001030 01  FILLER                      PIC X(08)       VALUE '*RPRF21*'.00103000
001040 01  WS-LINKRCIF.                                                 00104000
000000 COPY MISCNT00      REPLACING                                     00105000
001060     ==:MICNT:== BY ==RPRF21==.                                   00106000
000000 COPY RPSRF21.                                                    00107000
001080 01  FILLER                      PIC X(08)       VALUE '*RPTKEY*'.00108000
001090 01  WS-RPTKEY.                                                   00109000
001100     03  WS-RPTKEYS.                                              00110000
001110         05  WS-RFORMX           PIC X(02).                       00111000
001120         05  WS-RSEPREP          PIC X(01).                       00112000
001130         05  WS-RHOLDCOX.                                         00113000
001140             07  WS-RHOLDCO      PIC S9(03)      COMP-3.          00114000
001150         05  WS-RINSTX.                                           00115000
001160             07  WS-RINST        PIC S9(03)      COMP-3.          00116000
001170         05  WS-RALTBRNBRX.                                       00117000
001180             07  WS-RALTBRNBR    PIC S9(05)      COMP-3.          00118000
001190         05  WS-RSPEC            PIC X(01).                       00119000
001200         05  WS-RREGNBRX.                                         00120000
001210             07  WS-RREGNBR      PIC S9(03)      COMP-3.          00121000
001220         05  WS-RRPTNBRX.                                         00122000
001230             07  WS-RRPTNBR      PIC S9(04)      COMP.            00123000
001240         05  WS-RBRNBRX.                                          00124000
001250             07  WS-RBRNBR       PIC S9(05)      COMP-3.          00125000
001260         05  WS-RTYPNBRX.                                         00126000
001270             07  WS-RTYPNBR      PIC S9(03)      COMP-3.          00127000
001280         05  WS-ROFFNBRX.                                         00128000
001290             07  WS-ROFFNBR      PIC X(09).                       00129000
001300             07  WS-ROFFNBRR                                      00130000
001310                         REDEFINES WS-ROFFNBR                     00131000
001320                                 PIC 9(09).                       00132000
001330         05  WS-RCUSTNBRX.                                        00133000
001340             07  WS-RCUSTNBR     PIC S9(18)      COMP-3.          00134000
001350         05  WS-RACCTNBRX.                                        00135000
001360             07  WS-RACCTNBR     PIC S9(18)      COMP-3.          00136000
001370         05  WS-RSORTNBRX.                                        00137000
001380             07  WS-RSORTNBR     PIC S9(11)      COMP-3.          00138000
001390     03  WS-RPTKEYT.                                              00139000
001400         05  WS-RCODESEQ.                                         00140000
001410             07  WS-RCODE1       PIC X(01).                       00141000
001420             07  WS-RAMOUNTX.                                     00142000
001430                 09  WS-RAMOUNT  PIC S9(09)V99   COMP-3.          00143000
001440             07  WS-RAMOUNTXR                                     00144000
001450                         REDEFINES WS-RAMOUNTX.                   00145000
001460                 09  WS-RSERIAL  PIC S9(11)      COMP-3.          00146000
001470             07  WS-RCODE2       PIC X(01).                       00147000
001480             07  WS-RSEQX.                                        00148000
001490                 09  WS-RSEQ     PIC S9(09)      COMP.            00149000
001500         05  WS-RRPTPFC          PIC X(01).                       00150000
001510         05  WS-RPAGEBRK.                                         00151000
001520             07  WS-RBRPAGE      PIC X(01).                       00152000
001530             07  WS-RTYPAGE      PIC X(01).                       00153000
001540 01  FILLER                      PIC X(08)       VALUE '*LRPTKY*'.00154000
001550 01  WS-LRPTKEY.                                                  00155000
001560     03  WS-LRPTKEYS.                                             00156000
001570         05  WS-LRFORMX          PIC X(02).                       00157000
001580         05  WS-LRSEPREP         PIC X(01).                       00158000
001590         05  WS-LRHOLDCOX.                                        00159000
001600             07  WS-LRHOLDCO     PIC S9(03)      COMP-3.          00160000
001610         05  WS-LRINSTX.                                          00161000
001620             07  WS-LRINST       PIC S9(03)      COMP-3.          00162000
001630         05  WS-LRALTBRNBRX.                                      00163000
001640             07  WS-LRALTBRNBR   PIC S9(05)      COMP-3.          00164000
001650         05  WS-LRSPEC           PIC X(01).                       00165000
001660         05  WS-LRREGNBRX.                                        00166000
001670             07  WS-LRREGNBR     PIC S9(03)      COMP-3.          00167000
001680         05  WS-LRRPTNBRX.                                        00168000
001690             07  WS-LRRPTNBR     PIC S9(04)      COMP.            00169000
001700         05  WS-LRBRNBRX.                                         00170000
001710             07  WS-LRBRNBR      PIC S9(05)      COMP-3.          00171000
001720         05  WS-LRTYPNBRX.                                        00172000
001730             07  WS-LRTYPNBR     PIC S9(03)      COMP-3.          00173000
001740         05  WS-LROFFNBRX.                                        00174000
001750             07  WS-LROFFNBR     PIC X(09).                       00175000
001760             07  WS-LROFFNBRR                                     00176000
001770                         REDEFINES WS-LROFFNBR                    00177000
001780                                 PIC 9(09).                       00178000
001790         05  WS-LRCUSTNBRX       PIC X(10).                       00179000
001800         05  WS-LRACCTNBRX.                                       00180000
001810             07  WS-LRACCTNBR    PIC S9(18)      COMP-3.          00181000
001820         05  WS-LRSORTNBRX.                                       00182000
001830             07  WS-LRSORTNBR    PIC S9(11)      COMP-3.          00183000
001840     03  WS-LRPTKEYT.                                             00184000
001850         05  WS-LRCODE1          PIC X(01).                       00185000
001860         05  WS-LRAMOUNTX.                                        00186000
001870             07  WS-LRAMOUNT     PIC S9(09)V99   COMP-3.          00187000
001880         05  WS-LRAMOUNTXR                                        00188000
001890                         REDEFINES WS-LRAMOUNTX.                  00189000
001900             07  WS-LRSERIAL     PIC S9(11)      COMP-3.          00190000
001910         05  WS-LRCODE2          PIC X(01).                       00191000
001920         05  WS-LRSEQ            PIC S9(09)      COMP.            00192000
001930         05  WS-LRRPTPFC         PIC X(01).                       00193000
001940         05  WS-LRPAGEBRK.                                        00194000
001950             07  WS-LRBRPAGE     PIC X(01).                       00195000
001960             07  WS-LRTYPAGE     PIC X(01).                       00196000
001970 01  FILLER                      PIC X(08)       VALUE '*WSWORK*'.00197000
001980 01  WS-WORKAREAS.                                                00198000
001990     03  WS-SUB                  PIC S9(05)      COMP-3           00199000
002000                                                 VALUE ZERO.      00200000
002010     03  WS-SUB1                 PIC S9(04)      COMP.            00201000
002020     03  WS-RPTCTL.                                               00202000
002030         05  WS-RPRPTSRT.                                         00203000
002040             07  WS-RPRPTSRT1    PIC X(01).                       00204000
002050             07  WS-RPRPTSRT2    PIC X(01).                       00205000
002060         05  WS-RPRPTFRM         PIC X(02).                       00206000
002070         05  WS-RPRPTPFC         PIC X(01).                       00207000
002080     03  WS-RPRPTSRTPAC          PIC S9(03)      COMP-3.          00208000
002090     03  WS-RPRPTSRTBIN          PIC S9(04)      COMP.            00209000
002100     03  WS-RPRPTSRTBINR REDEFINES WS-RPRPTSRTBIN.                00210000
002110         05  FILLER              PIC X(01).                       00211000
002120         05  WS-BYTE             PIC X(01).                       00212000
002130     03  WS-REPRECSEQ            PIC S9(09)      COMP             00213000
002140                                                 VALUE +0.        00214000
002150     03  WS-HOLDINST             PIC S9(03)      COMP-3           00215000
002160                                                 VALUE ZEROS.     00216000
002170     03  WS-HOLD1001INST         PIC S9(03)      COMP-3           00217000
002180                                                 VALUE ZEROS.     00218000
002190     03  WS-HOLDINST2            PIC S9(03)      COMP-3           00219000
002200                                                 VALUE ZEROS.     00220000
002210     03  WS-HOLDPRODCODE         PIC X(06)       VALUE SPACES.    00221000
002220     03  WS-HOLDACCOUNT          PIC X(18)       VALUE SPACES.    00222000
002230     03  WS-FUNCTION             PIC X(01).                       00223000
002240     03  WS-RPTSW                PIC X(01)       VALUE SPACE.     00224000
002250     03  WS-SORTRETURN           PIC S9(04).                      00225000
002260     03  WS-NAME                 PIC X(40)       VALUE SPACES.    00226000
002270     03  WS-RCIF-INTERFACE       PIC X(08)       VALUE SPACES.    00227000
002280 01  WS-SEG-WORK-AREAS.                                           00228000
002290     03  WS-SEG                  PIC 9(04)       COMP.            00229000
000000 COPY RPWSEG.                                                     00230000
002310***************************************************************** 00231000
002320 PROCEDURE DIVISION.                                              00232000
002330******************************************************************00233000
002340 SORT-ROUTINE SECTION.                                            00234000
002350 SR-START.                                                        00235000
002360     SORT RP-SORTFIL                                              00236000
002370         ASCENDING KEY                                            00237000
002380         RP-SORTKEY                                               00238000
002390         INPUT PROCEDURE INITIALIZATION-ROUTINE THRU READ-REPORTS 00239000
002400         GIVING RP-RPT3FIL.                                       00240000
002410     MOVE SORT-RETURN TO WS-SORTRETURN.                           00241000
002420     IF WS-SORTRETURN IS NOT EQUAL TO +0                          00242000
002430         GO TO AR-0001.                                           00243000
002440 SR-EXIT.                                                         00244000
002450     MOVE 'GC ' TO SR-APIFUNC.                                    00245000
002460     PERFORM CALL-RPS-BNK.                                        00246000
002470     STOP RUN.                                                    00247000
002480******************************************************************00248000
002490 INITIALIZATION-ROUTINE SECTION.                                  00249000
002500 IR-START.                                                        00250000
002510     PERFORM GET-FILE-ORGANIZATION.                               00251000
002520     PERFORM CALL-SEGID.                                          00252000
002530     IF RPWSEG-SEGRETURN IS EQUAL TO 'X'                          00253000
002540         GO TO AR-0010.                                           00254000
002550     MOVE 'RPD340' TO SR-APIPROGLIT.                              00255000
002560     MOVE 'RPD340' TO WS-ABPROGID.                                00256000
002570     MOVE ZERO TO WS-SUB.                                         00257000
002580     OPEN INPUT RP-CARDFIL.                                       00258000
002590     MOVE +1 TO WS-SEG.                                           00259000
002600     MOVE SPACE TO WS-RRPTS-ORGID.                                00260000
002610     READ RP-CARDFIL                                              00261000
002620         AT END                                                   00262000
002630         GO TO IR-RECN.                                           00263000
002640 IR-RECN.                                                         00264000
002650     CLOSE RP-CARDFIL.                                            00265000
002660******************************************************************00266000
002670 READ-REPORTS SECTION.                                            00267000
002680 RR-READ.                                                         00268000
002690     MOVE RPWSEG-ORGID (WS-SEG) TO WS-RRPTS-ORGID.                00269000
002700     MOVE 'N  ' TO WS-RRPTS.                                      00270000
002710     PERFORM CALL-RPTSFIL.                                        00271000
002720     IF WS-FUNCTION IS EQUAL TO 'E'                               00272000
002730         GO TO RR-END-OF-RPTS.                                    00273000
002740     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00274000
002750         GO TO AR-0002.                                           00275000
002760 RR-PROCESS.                                                      00276000
002770     IF RPRPTS-INST IS EQUAL TO ZEROS                             00277000
002780         GO TO RR-READ.                                           00278000
002790     MOVE 'X' TO WS-RPTSW.                                        00279000
002800 RR-READGO.                                                       00280000
002810     PERFORM BUILD-KEY.                                           00281000
002820     GO TO RR-READ.                                               00282000
002830 RR-END-OF-RPTS.                                                  00283000
002840     PERFORM CLOSE-RPRPTS-FILE.                                   00284000
002850     IF RPWSEG-ORGID (WS-SEG) IS EQUAL TO HIGH-VALUE              00285000
002860         GO TO RR-EXIT.                                           00286000
002870     ADD +1 TO WS-SEG.                                            00287000
002880     IF WS-SEG IS GREATER THAN 35                                 00288000
002890         GO TO RR-EXIT.                                           00289000
002900     IF RPWSEG-ORGID (WS-SEG) IS EQUAL TO HIGH-VALUE              00290000
002910         GO TO RR-EXIT.                                           00291000
002920     GO TO RR-READ.                                               00292000
002930 RR-EXIT.                                                         00293000
002940     EXIT.                                                        00294000
002950******************************************************************00295000
002960 BUILD-KEY SECTION.                                               00296000
002970 BK-START.                                                        00297000
002980     MOVE LOW-VALUES TO WS-RPTKEY.                                00298000
002990     MOVE RPRPTS-RPTCTL TO WS-RPTCTL.                             00299000
003000     IF RPRPTS-INST IS EQUAL TO WS-HOLDINST                       00300000
003010         GO TO BK-SEPREPNO.                                       00301000
003020     MOVE RPRPTS-INST TO WS-HOLDINST.                             00302000
003030     MOVE RPRPTS-INST TO RPBNK-INST.                              00303000
003040     MOVE 'R  ' TO SR-APIFUNC.                                    00304000
003050     PERFORM CALL-BANKFIL.                                        00305000
003060     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00306000
003070         GO TO AR-0003.                                           00307000
003080 BK-REC0237.                                                      00308000
003090     MOVE SPACES TO MI0237-RECORD.                                00309000
003100     MOVE RPBNK-INST TO MIM-0237KINST.                            00310000
003110     MOVE +0237 TO MIM-0237KREC.                                  00311000
003120     MOVE 50 TO MIM-0237KPROCMGR.                                 00312000
003130     MOVE 47 TO MIM-0237KINTAPPL.                                 00313000
003140     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    00314000
003150     MOVE MI0237-RECORD TO MIMST-RECORD.                          00315000
003160     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00316000
003170     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00317000
003180         GO TO AR-0007.                                           00318000
003190     MOVE MIMST-RECORD TO MI0237-RECORD.                          00319000
003200     IF MIM-0237KINST IS NOT EQUAL TO RPBNK-INST                  00320000
003210         OR MIM-0237KPROCMGR IS NOT EQUAL TO 50                   00321000
003220         OR MIM-0237KINTAPPL IS NOT EQUAL TO 47                   00322000
003230         GO TO AR-0008.                                           00323000
003240     IF MIM-237BATINTFC IS EQUAL TO SPACES                        00324000
003250         GO TO AR-0009.                                           00325000
003260     MOVE MIM-237BATINTFC TO WS-RCIF-INTERFACE.                   00326000
003270 BK-REC7100.                                                      00327000
003280     MOVE SPACES TO MI7100-RECORD.                                00328000
003290     MOVE RPBNK-INST TO MIM-7100KINST.                            00329000
003300     MOVE +7100 TO MIM-7100KREC.                                  00330000
003310     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00331000
003320     MOVE MI7100-RECORD TO MIMST-RECORD.                          00332000
003330     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00333000
003340     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00334000
003350         GO TO AR-0011.                                           00335000
003360     MOVE MIMST-RECORD TO MI7100-RECORD.                          00336000
003370     IF MIM-7100KINST IS NOT EQUAL TO RPBNK-INST                  00337000
003380         GO TO AR-0012.                                           00338000
003390 BK-SEPREPNO.                                                     00339000
003400     MOVE LOW-VALUES TO WS-RPRPTSRTBINR.                          00340000
003410     MOVE WS-RPRPTSRT1 TO WS-BYTE.                                00341000
003420     MOVE WS-RPRPTSRTBIN TO WS-RPRPTSRTPAC.                       00342000
003430     IF WS-RPRPTSRTPAC IS LESS THAN +240                          00343000
003440         ADD +57 TO WS-RPRPTSRTPAC.                               00344000
003450     SUBTRACT +240 FROM WS-RPRPTSRTPAC.                           00345000
003460 BK-BRANCHNBR.                                                    00346000
003470     IF WS-RPRPTSRTPAC IS NOT LESS THAN +8                        00347000
003480         MOVE RPRPTS-BRANCH TO WS-RBRNBR                          00348000
003490         SUBTRACT +8 FROM WS-RPRPTSRTPAC.                         00349000
003500     IF WS-RPRPTSRTPAC IS LESS THAN +4                            00350000
003510         GO TO BK-BANKNBR.                                        00351000
003520     SUBTRACT +4 FROM WS-RPRPTSRTPAC.                             00352000
003530     MOVE RPRPTS-BRANCH TO WS-RBRNBR.                             00353000
003540 BK-REGIONNBR.                                                    00354000
003550     IF WS-RPRPTSRTPAC IS LESS THAN +4                            00355000
003560         GO TO BK-BANKNBR.                                        00356000
003570     SUBTRACT +4 FROM WS-RPRPTSRTPAC.                             00357000
003580     MOVE 0 TO WS-RREGNBR.                                        00358000
003590 BK-BANKNBR.                                                      00359000
003600     MOVE SPACE TO WS-RBRPAGE.                                    00360000
003610     IF WS-RPRPTSRTPAC IS NOT LESS THAN +2                        00361000
003620         MOVE 'X' TO WS-RBRPAGE                                   00362000
003630         SUBTRACT +2 FROM WS-RPRPTSRTPAC.                         00363000
003640     MOVE RPRPTS-INST TO WS-RINST.                                00364000
003650 BK-HOLDCONBR.                                                    00365000
003660     IF WS-RPRPTSRTPAC IS LESS THAN +1                            00366000
003670         GO TO BK-START2.                                         00367000
003680     SUBTRACT +1 FROM WS-RPRPTSRTPAC.                             00368000
003690     IF RPRPTS-INST IS EQUAL TO WS-HOLD1001INST                   00369000
003700         GO TO BK-HOLDCONBRMOVE.                                  00370000
003710     MOVE RPRPTS-INST TO WS-HOLD1001INST.                         00371000
003720     MOVE SPACES TO MI1001-RECORD.                                00372000
003730     MOVE RPRPTS-INST TO MIM-1001KINST.                           00373000
003740     MOVE +1001 TO MIM-1001KREC.                                  00374000
003750     MOVE MIC-MST-1001-PRI TO MIC-MST-REC-PRI.                    00375000
003760     MOVE MI1001-RECORD TO MIMST-RECORD.                          00376000
003770     PERFORM MIC-MST-GET-REQUEST.                                 00377000
003780     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00378000
003790         GO TO AR-0004.                                           00379000
003800     MOVE MIMST-RECORD TO MI1001-RECORD.                          00380000
003810 BK-HOLDCONBRMOVE.                                                00381000
003820     MOVE MIM-1001HCO TO WS-RHOLDCO.                              00382000
003830 BK-START2.                                                       00383000
003840     MOVE LOW-VALUES TO WS-RPRPTSRTBINR.                          00384000
003850     MOVE WS-RPRPTSRT2 TO WS-BYTE.                                00385000
003860     MOVE WS-RPRPTSRTBIN TO WS-RPRPTSRTPAC.                       00386000
003870     IF WS-RPRPTSRTPAC IS LESS THAN +240                          00387000
003880         ADD +57 TO WS-RPRPTSRTPAC.                               00388000
003890     SUBTRACT +240 FROM WS-RPRPTSRTPAC.                           00389000
003900 BK-ACCTNBR.                                                      00390000
003910     MOVE SPACE TO WS-RTYPAGE.                                    00391000
003920     IF WS-RPRPTSRTPAC IS NOT LESS THAN +8                        00392000
003930         MOVE 'X' TO WS-RTYPAGE                                   00393000
003940         SUBTRACT +8 FROM WS-RPRPTSRTPAC.                         00394000
003950     MOVE RPRPTS-ACCOUNT TO WS-RACCTNBR.                          00395000
003960 BK-CUSTNBR.                                                      00396000
003970     IF WS-RPRPTSRTPAC IS NOT LESS THAN +4                        00397000
003980         MOVE 0 TO WS-RCUSTNBR                                    00398000
003990         SUBTRACT +4 FROM WS-RPRPTSRTPAC.                         00399000
004000 BK-OFFNBR.                                                       00400000
004010     IF WS-RPRPTSRTPAC IS NOT LESS THAN +2                        00401000
004020         MOVE RPRPTS-OFFICER TO WS-ROFFNBR                        00402000
004030         SUBTRACT +2 FROM WS-RPRPTSRTPAC.                         00403000
004040 BK-TYPENBR.                                                      00404000
004050     IF WS-RPRPTSRTPAC IS LESS THAN +1                            00405000
004060         GO TO BK-FINISH.                                         00406000
004070     MOVE RPRPTS-TYPE TO WS-RTYPNBR.                              00407000
004080     SUBTRACT +1 FROM WS-RPRPTSRTPAC.                             00408000
004090 BK-FINISH.                                                       00409000
004100     MOVE WS-RPRPTFRM TO WS-RFORMX.                               00410000
004110     MOVE RPRPTS-RPTNBR TO WS-RRPTNBR.                            00411000
004120     MOVE WS-RPRPTPFC TO WS-RRPTPFC.                              00412000
004130     MOVE RPRPTS-SPEC TO WS-RSPEC.                                00413000
004140     ADD +1 TO WS-REPRECSEQ.                                      00414000
004150     MOVE WS-REPRECSEQ TO WS-RSEQ.                                00415000
004160     MOVE 0 TO WS-RSORTNBR.                                       00416000
004170     IF RPRPTS-RPTNBR IS EQUAL TO +50                             00417000
004180         OR RPRPTS-RPTNBR IS EQUAL TO +51                         00418000
P0055          OR RPRPTS-RPTNBR IS EQUAL TO +56                         00418500
004190         PERFORM GET-CUSTOMER-NAME.                               00419000
004200 BK-RELEASE.                                                      00420000
004210     MOVE WS-RPTKEY TO WS-RPTSKEY.                                00421000
004220     RELEASE RPSORT-RECORD FROM RPRPTS-RECORD.                    00422000
004230 BK-EXIT.                                                         00423000
004240     EXIT.                                                        00424000
004250******************************************************************00425000
004260 GET-CUSTOMER-NAME SECTION.                                       00426000
004270 GCN-START.                                                       00427000
004280     IF RPRPTS-INST IS EQUAL TO WS-HOLDINST2                      00428000
004290         AND RPRPTS-PRODCODE IS EQUAL TO WS-HOLDPRODCODE          00429000
004300         AND RPRPTS-ACCOUNT IS EQUAL TO WS-HOLDACCOUNT            00430000
004310         GO TO GCN-MOVE-NAME.                                     00431000
004320     MOVE SPACES TO WS-NAME.                                      00432000
004330     MOVE RPRPTS-INST TO WS-HOLDINST2.                            00433000
004340     MOVE RPRPTS-PRODCODE TO WS-HOLDPRODCODE.                     00434000
004350     MOVE RPRPTS-ACCOUNT TO WS-HOLDACCOUNT.                       00435000
004360     MOVE RPRPTS-INST TO RPRF21-BASE-ACCT-INST.                   00436000
004370     MOVE RPRPTS-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.           00437000
004380     MOVE RPRPTS-ACCOUNT TO RPRF21-BASE-ACCT.                     00438000
004390     MOVE SPACES TO RPRF21-BASE-CUSTOMER.                         00439000
004400     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00440000
004410         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00441000
004420         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00442000
004430     MOVE 'A' TO RPRF21-FUNC.                                     00443000
004440     MOVE SPACES TO WS-FUNCTION.                                  00444000
004450     MOVE WS-RCIF-INTERFACE TO SR-060CALLNAME.                    00445000
004460 GCN-GET-RCIF-INFO.                                               00446000
004470     CALL SR-060CALLNAME USING                                    00447000
004480         WS-LINKRCIF.                                             00448000
004490     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     00449000
004500         MOVE 'CUSTOMER NAME NOT FOUND' TO WS-NAME                00450000
004510     ELSE                                                         00451000
004520         MOVE RPRF21-NAME TO WS-NAME.                             00452000
004530 GCN-MOVE-NAME.                                                   00453000
004540     MOVE WS-NAME TO RPRPTS-NAME.                                 00454000
004550 GCN-EXIT.                                                        00455000
004560     EXIT.                                                        00456000
004570******************************************************************00457000
004580 MIC-MST-API SECTION.                                             00458000
000000 COPY MIPMSTA.                                                    00459000
004600******************************************************            00460000
004610 GET-FILE-ORGANIZATION SECTION.                                   00461000
000000 COPY SRP093.                                                     00462000
004630***************************************************************** 00463000
004640 CALL-BANKFIL SECTION.                                            00464000
004650 CB-START.                                                        00465000
004660     PERFORM CALL-RPS-BNK.                                        00466000
004670     MOVE WS-FUNCTION TO WS-ABFC.                                 00467000
004680 CB-EXIT.                                                         00468000
004690     EXIT.                                                        00469000
004700******************************************************************00470000
004710 CALL-RPS-BNK SECTION.                                            00471000
000000 COPY RPPBNKB.                                                    00472000
004730***************************************************************** 00473000
004740 CALL-RPTSFIL SECTION.                                            00474000
004750 CR-START.                                                        00475000
004760     PERFORM CALL-RPRPTS.                                         00476000
004770     MOVE WS-FUNCTION TO WS-ABFC.                                 00477000
004780 CR-EXIT.                                                         00478000
004790     EXIT.                                                        00479000
004800******************************************************************00480000
004810 CALL-RPRPTS SECTION.                                             00481000
000000 COPY RPPRPTS.                                                    00482000
004830******************************************************************00483000
004840 CALENDAR-365 SECTION.                                            00484000
000000 COPY SRP003.                                                     00485000
004860***************************************************************** 00486000
004870 CALL-SEGID SECTION.                                              00487000
004880 CS-START.                                                        00488000
004890     MOVE MIC-MST-APPL-ORG TO RPWSEG-SEGID.                       00489000
000000     CALL 'RPSEGID' USING                                         00490000
004910         RPWSEG-SEGFIELDS.                                        00491000
004920 CS-EXIT.                                                         00492000
004930     EXIT.                                                        00493000
004940******************************************************************00494000
004950 CLOSE-RPRPTS-FILE SECTION.                                       00495000
004960 CRF-START.                                                       00496000
004970     MOVE 'C  ' TO WS-RRPTS.                                      00497000
004980     PERFORM CALL-RPTSFIL.                                        00498000
004990     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00499000
005000         GO TO AR-0005.                                           00500000
005010 CRF-EXIT.                                                        00501000
005020     EXIT.                                                        00502000
005030******************************************************************00503000
005040 ABORT-ROUTINE SECTION.                                           00504000
005050 AR-0001.                                                         00505000
005060     MOVE 01 TO WS-ABCODE.                                        00506000
005070     GO TO AR-MSG.                                                00507000
005080 AR-0002.                                                         00508000
005090     MOVE 02 TO WS-ABCODE.                                        00509000
005100     GO TO AR-MSG.                                                00510000
005110 AR-0003.                                                         00511000
005120     MOVE 03 TO WS-ABCODE.                                        00512000
005130     GO TO AR-MSG.                                                00513000
005140 AR-0004.                                                         00514000
005150     MOVE 04 TO WS-ABCODE.                                        00515000
005160     GO TO AR-MSG.                                                00516000
005170 AR-0005.                                                         00517000
005180     MOVE 05 TO WS-ABCODE.                                        00518000
005190     GO TO AR-MSG.                                                00519000
005200 AR-0006.                                                         00520000
005210     MOVE 06 TO WS-ABCODE.                                        00521000
005220     GO TO AR-MSG.                                                00522000
005230 AR-0007.                                                         00523000
005240     MOVE 07 TO WS-ABCODE.                                        00524000
005250     GO TO AR-MSG.                                                00525000
005260 AR-0008.                                                         00526000
005270     MOVE 08 TO WS-ABCODE.                                        00527000
005280     GO TO AR-MSG.                                                00528000
005290 AR-0009.                                                         00529000
005300     MOVE 09 TO WS-ABCODE.                                        00530000
005310     GO TO AR-MSG.                                                00531000
005320 AR-0010.                                                         00532000
005330     MOVE 10 TO WS-ABCODE.                                        00533000
005340     GO TO AR-MSG.                                                00534000
005350 AR-0011.                                                         00535000
005360     MOVE 11 TO WS-ABCODE.                                        00536000
005370     GO TO AR-MSG.                                                00537000
005380 AR-0012.                                                         00538000
005390     MOVE 12 TO WS-ABCODE.                                        00539000
005400     GO TO AR-MSG.                                                00540000
005410 AR-MSG.                                                          00541000
005420     MOVE WS-FUNCTION TO WS-ABFC.                                 00542000
005430     GO TO ABEND-ROUTINE.                                         00543000
005440******************************************************************00544000
005450 ABEND-ROUTINE SECTION.                                           00545000
005460 AB-PRINT.                                                        00546000
000000 COPY SRP029.                                                     00547000
005480******************************************************************00548000
