000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPD350.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*                                                                *00005000
000060*    RPD350 -  RELATIONSHIP PRICING STOCK FORM PRINT             *00006000
000070*                                                                *00007000
000080******************************************************************00008000
000090 ENVIRONMENT DIVISION.                                            00009000
000100 CONFIGURATION SECTION.                                           00010000
000110 SPECIAL-NAMES.                                                   00011000
000120     C01 IS C-01, C02 IS C-02, C03 IS C-03, CSP IS C-SP.          00012000
000130 INPUT-OUTPUT SECTION.                                            00013000
000140 FILE-CONTROL.                                                    00014000
000000 COPY RPCARDS.                                                    00015000
000000 COPY RPRPT3S.                                                    00016000
000000 COPY PRNTERS.                                                    00017000
000180 DATA DIVISION.                                                   00018000
000190 FILE SECTION.                                                    00019000
000000 COPY RPCARDF.                                                    00020000
000210 01  RPCARD-RECORD.                                               00021000
000220     03  RPCARD-SYSNBR           PIC X(02).                       00022000
000230     03  RPCARD-INST             PIC 9(03).                       00023000
000240     03  RPCARD-STARTRPT         PIC 9(03).                       00024000
000250     03  RPCARD-ENDRPT           PIC 9(03).                       00025000
000260     03  FILLER                  PIC X(69).                       00026000
000000 COPY RPRPT3F.                                                    00027000
000280 01  RPRPT3-RECORD               PIC X(421).                      00028000
000000 COPY PRNTERF.                                                    00029000
000300 01  PRINTERREC.                                                  00030000
000000 COPY SRW016.                                                     00031000
000320******************************************************************00032000
000330 WORKING-STORAGE SECTION.                                         00033000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00034000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00034001
000350 01  RLS-RLSELIT.                                                 00035000
000000 COPY RPWRLSE.                                                    00036000
000370 01  MIWPRI-AREAS.                                                00037000
000000 COPY MIWPRI.                                                     00038000
000390 01  RPWPRI-AREAS.                                                00039000
000000 COPY RPWPRI.                                                     00040000
000410 01  MIC-RLSELIT.                                                 00041000
000000 COPY MIWRLSE.                                                    00042000
000430 01  SRW105-AREAS.                                                00043000
000000 COPY SRW105.                                                     00044000
000450*01  BICPBPRM.                                                    00045000
000000 COPY BICPBPRM.                                                   00046000
000470*01  BICRSRB.                                                     00047000
000000 COPY BICRSRB.                                                    00048000
000490*01  BICRPSB.                                                     00049000
000000 COPY BICRPSB.                                                    00050000
000510*01  BICRVERB.                                                    00051000
000000 COPY BICRVERB.                                                   00052000
000530*01  BICRSTAT.                                                    00053000
000000 COPY BICRSTAT.                                                   00054000
000550*01  BICRDBS.                                                     00055000
000000 COPY BICRDBS.                                                    00056000
000570******************************************************************00057000
000580 01  FILLER                      PIC X(08)       VALUE '*MIMAST*'.00058000
000590 01  MIMST-RECORD.                                                00059000
000000 COPY MISMST.                                                     00060000
000610 01  FILLER                      PIC X(08)       VALUE '*MIMREC*'.00061000
000620 01  MI0242-RECORD.                                               00062000
000000 COPY MIS0242A.                                                   00063000
000640 01  MI1001-RECORD.                                               00064000
000000 COPY MIS1001A.                                                   00065000
000660 01  MI1003-RECORD.                                               00066000
000000 COPY MIS1003A.                                                   00067000
000680 01  MI1004-RECORD.                                               00068000
000000 COPY MIS1004A.                                                   00069000
000700 01  MI0020-RECORD.                                               00070000
000000 COPY MIS0020A.                                                   00071000
000720 01  MI0021-RECORD.                                               00072000
000000 COPY MIS0021A.                                                   00073000
000740 01  MI0211-RECORD.                                               00074000
000000 COPY MIS0211A.                                                   00075000
000760 01  MI0248-RECORD.                                               00076000
000000 COPY MIS0248A.                                                   00077000
000780 01  MI2001-RECORD.                                               00078000
000000 COPY MIS2001A.                                                   00079000
000800 01  MIWMSTA-AREAS.                                               00080000
000000 COPY MIWMSTA.                                                    00081000
000820 01  RPBNK-RECORD.                                                00082000
000000 COPY RPSBNK.                                                     00083000
000840 01  WS-RPT3REC.                                                  00084000
000000 COPY RPSRPTS.                                                    00085000
000860     03  WS-RPT3KEY              PIC X(70).                       00086000
000870 01  RPBNKA-AREA.                                                 00087000
000000 COPY RPWBNKA.                                                    00088000
000890 01  SRW000-AREAS.                                                00089000
000000 COPY SRW000.                                                     00090000
000910 01  SRW015-AREAS.                                                00091000
000000 COPY SRW015.                                                     00092000
000930 01  SRW066-AREAS.                                                00093000
000000 COPY SRW066.                                                     00094000
000950 01  WS-ABEND.                                                    00095000
000000 COPY SRW028.                                                     00096000
000970 01  SRW033-AREAS.                                                00097000
000000 COPY SRW033.                                                     00098000
000990 01  SRW044-AREAS.                                                00099000
000000 COPY SRW044.                                                     00100000
001010*----------------------------------------------------------------*00101000
001020*    SUBSCRIPT USAGE                                             *00102000
001030*        WS-SUB1 - REPORT NUMBER FOR GO TO DEPENDING ON.         *00103000
001040*        WS-SUB2 - WORK SUBSCRIPT.                               *00104000
001050*        WS-BKSUB- SUBSCRIPT FOR THE BANK PORTION OF THE REPORT  *00105000
001060*                  TABLE.                                        *00106000
001070*----------------------------------------------------------------*00107000
001080 01  WS-SUBSCRIPTS.                                               00108000
001090     03  WS-SUB1                 PIC S9(04)      COMP             00109000
001100                                                 VALUE ZERO.      00110000
001110     03  WS-SUB2                 PIC S9(04)      COMP             00111000
001120                                                 VALUE ZERO.      00112000
001130     03  WS-SUB3                 PIC S9(04)      COMP             00113000
001140                                                 VALUE ZERO.      00114000
001150     03  WS-BKSUB                PIC S9(04)      COMP             00115000
001160                                                 VALUE ZERO.      00116000
001170*----------------------------------------------------------------*00117000
001180 01  WS-STORAGE.                                                  00118000
001190     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00119000
001200     03  WS-INST                 PIC 9(03)       VALUE ZERO.      00120000
001210     03  WS-RPTSKEY.                                              00121000
001220         05  WS-RKFORMX          PIC X(02).                       00122000
001230         05  WS-RKSEPREPX        PIC X(01).                       00123000
001240         05  WS-RKHOLDCOX.                                        00124000
001250             07  WS-RKHOLDCO     PIC S9(03)      COMP-3.          00125000
001260         05  WS-RKINSTX.                                          00126000
001270             07  WS-RKINST       PIC S9(03)      COMP-3.          00127000
001280         05  WS-RKALTBRNBRX.                                      00128000
001290             07  WS-RKALTBRNBR   PIC S9(05)      COMP-3.          00129000
001300         05  WS-RKSPECX          PIC X(01).                       00130000
001310         05  WS-RKREGNBRX.                                        00131000
001320             07  WS-RKREGNBR     PIC S9(03)      COMP-3.          00132000
001330         05  WS-RKRPTNBRX.                                        00133000
001340             07  WS-RKRPTNBR     PIC S9(04)      COMP.            00134000
001350         05  WS-RKBRANCHX.                                        00135000
001360             07  WS-RKBRANCH     PIC S9(05)      COMP-3.          00136000
001370         05  WS-RKTYPEX.                                          00137000
001380             07  WS-RKTYPE       PIC S9(03)      COMP-3.          00138000
001390         05  WS-RKOFFX.                                           00139000
001400             07  WS-RKOFF        PIC X(09).                       00140000
001410         05  WS-RKCUSTX.                                          00141000
001420             07  WS-RKCUST       PIC X(10).                       00142000
001430         05  WS-RKACCTX.                                          00143000
001440             07  WS-RKACCT       PIC S9(18)      COMP-3.          00144000
001450         05  WS-RSORTNBRX.                                        00145000
001460             07  WS-RSORTNBR     PIC S9(11)      COMP-3.          00146000
001470         05  WS-RPTSKEYT.                                         00147000
001480             07  WS-RKCODE1      PIC X(01).                       00148000
001490             07  WS-RKAMOUNTX.                                    00149000
001500                 09  WS-RKAMOUNT PIC S9(09)V99   COMP-3.          00150000
001510             07  WS-RKAMOUNTXR                                    00151000
001520                         REDEFINES WS-RKAMOUNTX.                  00152000
001530                 09  WS-RKSERIAL PIC S9(11)      COMP-3.          00153000
001540             07  WS-RKCODE2      PIC X(01).                       00154000
001550             07  WS-RKSEQX.                                       00155000
001560                 09  WS-RKSEQ    PIC S9(09)      COMP.            00156000
001570             07  WS-RKRPTPFC     PIC X(01).                       00157000
001580             07  WS-RKPAGEBRK.                                    00158000
001590                 09  WS-RKBRPAGE PIC X(01).                       00159000
001600                 09  WS-RKTYPAGE PIC X(01).                       00160000
001610     03  WS-ALLBANKS             PIC X(01)       VALUE SPACE.     00161000
001620*                            SPACE - NO RECORDS READ.             00162000
001630*                                N - FOUND NON-ZERO INSTITUTION   00163000
001640*                                Y - FOUND ZERO INSTITUTION       00164000
001650     03  WS-BKSUBMAX             PIC S9(04)      COMP             00165000
001660                                                 VALUE +100.      00166000
001670     03  WS-RPTTABLE.                                             00167000
001680         05  WS-RTBKTABLE                        OCCURS 100.      00168000
001690             07  WS-RTINST       PIC S9(03)      COMP-3.          00169000
001700             07  WS-RTRPTGRP.                                     00170000
001710                 09  WS-RTRPT    PIC X(01)       OCCURS 0999.     00171000
001720     03  WS-EDITEDACCOUNT.                                        00172000
001730         05  WS-EDITACCTSV       PIC X(22).                       00173000
001740     03  WS-FIRSTSW              PIC X(01)       VALUE SPACES.    00174000
001750     03  WS-DSSTITLE             PIC X(30)       VALUE            00175000
001760            'RELATIOSHIP PRICING SYSTEM    '.                     00176000
001770     03  WS-HCONBR               PIC S9(03)      COMP-3.          00177000
001780     03  WS-SRLINES              PIC S9(03)      COMP-3.          00178000
001790     03  WS-HOLDKEY-AREA1003.                                     00179000
001800         05  WS-HOLD-1003KINST   PIC 9(04).                       00180000
001810         05  WS-HOLD-1003KREC    PIC 9(04).                       00181000
001820         05  WS-HOLD-1003KAPPL   PIC 9(02).                       00182000
001830         05  WS-HOLD-1003KTYPE   PIC 9(03).                       00183000
001840         05  WS-HOLD-1003KLANG   PIC X(02).                       00184000
001850         05  FILLER              PIC X(33)       VALUE SPACES.    00185000
001860     03  WS-HOLDKEY-AREA1004.                                     00186000
001870         05  WS-HOLD-1004KINST   PIC 9(04).                       00187000
001880         05  WS-HOLD-1004KREC    PIC 9(04).                       00188000
001890         05  WS-HOLD-1004KAPPL   PIC 9(02).                       00189000
001900         05  WS-HOLD-1004KCODE   PIC X(08).                       00190000
001910         05  WS-HOLD-1004KLANG   PIC X(02).                       00191000
001920         05  FILLER              PIC X(28)       VALUE SPACES.    00192000
001930     03  WS-HOLDKEY-AREA0242.                                     00193000
001940         05  WS-HOLD-0242KINST   PIC 9(04).                       00194000
001950         05  WS-HOLD-0242KREC    PIC 9(04).                       00195000
001960         05  WS-HOLD-0242KOFFICER                                 00196000
001970                                 PIC X(09).                       00197000
001980         05  FILLER              PIC X(31)       VALUE SPACES.    00198000
001990*----------------------------------------------------------------*00199000
002000 01  WS-LINKDATA.                                                 00200000
000000 COPY RPW002.                                                     00201000
002020*----------------------------------------------------------------*00202000
002030 01  WS-PRINTLINES.                                               00203000
002040     03  WS-PRTLINES.                                             00204000
002050         05  WS-PLENTRY                          OCCURS 0020.     00205000
002060             07  WS-PLCONT       PIC X(01).                       00206000
002070             07  WS-PLDATA       PIC X(132).                      00207000
002080     03  WS-PLSIZE               PIC S9(04)      COMP             00208000
002090                                                 VALUE +0020.     00209000
002100******************************************************************00210000
002110 PROCEDURE DIVISION.                                              00211000
002120******************************************************************00212000
002130 INITIALIZATION SECTION.                                          00213000
002140 IN-START.                                                        00214000
002150     PERFORM GET-FILE-ORGANIZATION.                               00215000
002160     MOVE 'RPD350' TO SR-APIPROGLIT.                              00216000
002170     MOVE 'RPD350' TO WS-ABPROGID.                                00217000
002180     OPEN INPUT                                                   00218000
002190         RP-CARDFIL                                               00219000
002200         RP-RPT3FIL                                               00220000
002210         OUTPUT                                                   00221000
002220         PRINTERFIL.                                              00222000
002230     MOVE SPACES TO PRINTERREC.                                   00223000
002240     MOVE SPACES TO WS-PRTLINES.                                  00224000
002250     MOVE SPACES TO WS-RPTTABLE.                                  00225000
002260     MOVE ZERO TO WS-BKSUB.                                       00226000
002270     MOVE ZEROS TO RPBNK-INST.                                    00227000
002280     MOVE 'R  ' TO SR-APIFUNC.                                    00228000
002290     PERFORM CALL-RPS-BNK.                                        00229000
002300     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00230000
002310         GO TO AR-0001.                                           00231000
002320     IF RPBNK-INCH IS EQUAL TO '8'                                00232000
002330         MOVE +78 TO SR-PAGE.                                     00233000
002340     MOVE RPBNK-CURDT TO SR-CYEAR-FIRST.                          00234000
002350     MOVE SR-CMM TO SR-TCMON.                                     00235000
002360     MOVE SR-CDD TO SR-TCDAY.                                     00236000
002370     MOVE SR-CYYYY TO SR-TCYR.                                    00237000
002380     MOVE SR-TOCAL TO SR-TODAY.                                   00238000
002390 IN-READ.                                                         00239000
002400     READ RP-CARDFIL                                              00240000
002410         AT END                                                   00241000
002420         GO TO IN-EOF.                                            00242000
002430     MOVE 'X' TO WS-FIRSTSW.                                      00243000
002440     IF RPCARD-SYSNBR IS NOT EQUAL TO '01'                        00244000
002450         GO TO AR-0002.                                           00245000
002460     IF RPCARD-STARTRPT IS NOT NUMERIC                            00246000
002470         OR RPCARD-STARTRPT IS EQUAL TO ZERO                      00247000
002480         GO TO AR-0003.                                           00248000
002490     IF RPCARD-ENDRPT IS EQUAL TO SPACES                          00249000
002500         MOVE RPCARD-STARTRPT TO RPCARD-ENDRPT.                   00250000
002510     IF RPCARD-ENDRPT IS NOT NUMERIC                              00251000
002520         GO TO AR-0004.                                           00252000
002530     IF RPCARD-INST IS EQUAL TO SPACE                             00253000
002540         MOVE ZERO TO RPCARD-INST.                                00254000
002550     IF RPCARD-INST IS NOT NUMERIC                                00255000
002560         GO TO AR-0005.                                           00256000
002570     IF RPCARD-INST IS GREATER THAN ZERO                          00257000
002580         AND WS-ALLBANKS IS EQUAL TO 'Y'                          00258000
002590         GO TO AR-0006.                                           00259000
002600     IF RPCARD-INST IS GREATER THAN ZERO                          00260000
002610         MOVE 'N' TO WS-ALLBANKS.                                 00261000
002620     IF RPCARD-INST IS EQUAL TO ZERO                              00262000
002630         AND WS-ALLBANKS IS EQUAL TO 'N'                          00263000
002640         GO TO AR-0007.                                           00264000
002650     IF RPCARD-INST IS EQUAL TO ZERO                              00265000
002660         MOVE 'Y' TO WS-ALLBANKS.                                 00266000
002670     MOVE RPCARD-STARTRPT TO WS-SUB1.                             00267000
002680     MOVE RPCARD-ENDRPT TO WS-SUB2.                               00268000
002690     IF WS-ALLBANKS IS EQUAL TO 'Y'                               00269000
002700         OR WS-BKSUB IS EQUAL TO +0                               00270000
002710         MOVE +1 TO WS-BKSUB                                      00271000
002720         MOVE RPCARD-INST TO WS-RTINST (WS-BKSUB)                 00272000
002730         GO TO IN-LOOP.                                           00273000
002740     IF WS-RTINST (WS-BKSUB) IS EQUAL TO RPCARD-INST              00274000
002750         GO TO IN-LOOP.                                           00275000
002760     ADD +1 TO WS-BKSUB.                                          00276000
002770     MOVE RPCARD-INST TO WS-RTINST (WS-BKSUB).                    00277000
002780 IN-LOOP.                                                         00278000
002790     IF WS-SUB1 IS NOT GREATER THAN WS-SUB2                       00279000
002800         MOVE 'X' TO WS-RTRPT (WS-BKSUB, WS-SUB1)                 00280000
002810         ADD +1 TO WS-SUB1                                        00281000
002820         GO TO IN-LOOP.                                           00282000
002830     GO TO IN-READ.                                               00283000
002840 IN-EOF.                                                          00284000
002850     IF WS-FIRSTSW IS EQUAL TO SPACES                             00285000
002860         MOVE ALL 'X' TO WS-RTRPTGRP (1)                          00286000
002870         MOVE +1 TO WS-BKSUB                                      00287000
002880         MOVE 'Y' TO WS-ALLBANKS.                                 00288000
002890     CLOSE RP-CARDFIL.                                            00289000
002900     MOVE LOW-VALUES TO WS-LASTKEY.                               00290000
002910     MOVE SPACES TO WS-FIRSTSW.                                   00291000
002920     MOVE SPACES TO SR-NAPASSFLAGS.                               00292000
002930     MOVE 'X' TO WS-INITSW.                                       00293000
002940     IF WS-ALLBANKS IS EQUAL TO 'N'                               00294000
002950         MOVE +0 TO WS-BKSUB.                                     00295000
002960 IN-EXIT.                                                         00296000
002970     EXIT.                                                        00297000
002980******************************************************************00298000
002990 MAIN-LOGIC SECTION.                                              00299000
003000 ML-START.                                                        00300000
003010     PERFORM READ-RPT3FIL.                                        00301000
003020     IF WS-FIRSTSW IS NOT EQUAL TO SPACES                         00302000
003030         GO TO ML-PROCESS.                                        00303000
003040     IF WS-RPTSKEY IS EQUAL TO HIGH-VALUES                        00304000
003050         GO TO END-ROUTINE.                                       00305000
003060     MOVE 'X' TO WS-FIRSTSW.                                      00306000
003070     MOVE WS-RPTSKEY TO WS-LASTKEY.                               00307000
003080     MOVE WS-RKFORMX TO SR-FORM.                                  00308000
003090     PERFORM CHANGE-FORMS.                                        00309000
003100     PERFORM CHANGE-BANK.                                         00310000
003110 ML-PROCESS.                                                      00311000
003120     MOVE SPACES TO WS-TOTSW.                                     00312000
003130     MOVE SPACES TO WS-KEYBYTES.                                  00313000
003140     IF WS-RKHOLDCOX IS NOT EQUAL TO WS-LKHOLDCOX                 00314000
003150         AND WS-LKHOLDCOX IS NOT EQUAL TO LOW-VALUES              00315000
003160         PERFORM ML-SETBK THRU ML-SETAC                           00316000
003170         MOVE 'X' TO WS-KBHC.                                     00317000
003180     IF WS-RKINSTX IS NOT EQUAL TO WS-LKINSTX                     00318000
003190         AND WS-LKINSTX IS NOT EQUAL TO LOW-VALUES                00319000
003200         PERFORM ML-SETRG THRU ML-SETAC                           00320000
003210         MOVE 'X' TO WS-KBBK.                                     00321000
003220     IF WS-RKREGNBRX IS NOT EQUAL TO WS-LKREGNBRX                 00322000
003230         AND WS-LKREGNBRX IS NOT EQUAL TO LOW-VALUES              00323000
003240         PERFORM ML-SETBR THRU ML-SETAC                           00324000
003250         MOVE 'X' TO WS-KBRG.                                     00325000
003260     IF WS-RKBRANCHX IS NOT EQUAL TO WS-LKBRANCHX                 00326000
003270         AND WS-LKBRANCHX IS NOT EQUAL TO LOW-VALUES              00327000
003280         PERFORM ML-SETTY THRU ML-SETAC                           00328000
003290         MOVE 'X' TO WS-KBBR.                                     00329000
003300     IF WS-RKTYPEX IS NOT EQUAL TO WS-LKTYPEX                     00330000
003310         AND WS-LKTYPEX IS NOT EQUAL TO LOW-VALUES                00331000
003320         PERFORM ML-SETOF THRU ML-SETAC                           00332000
003330         MOVE 'X' TO WS-KBTY.                                     00333000
003340     IF WS-RKOFFX IS NOT EQUAL TO WS-LKOFFX                       00334000
003350         AND WS-LKOFFX IS NOT EQUAL TO LOW-VALUES                 00335000
003360         PERFORM ML-SETCU THRU ML-SETAC                           00336000
003370         MOVE 'X' TO WS-KBOF.                                     00337000
003380     IF WS-RKCUSTX IS NOT EQUAL TO WS-LKCUSTX                     00338000
003390         AND WS-LKCUSTX IS NOT EQUAL TO LOW-VALUES                00339000
003400         PERFORM ML-SETAC                                         00340000
003410         MOVE 'X' TO WS-KBCU.                                     00341000
003420     IF WS-RKACCTX IS NOT EQUAL TO WS-LKACCTX                     00342000
003430         AND WS-LKACCTX IS NOT EQUAL TO LOW-VALUES                00343000
003440         MOVE 'X' TO WS-KBAC.                                     00344000
003450     IF WS-RKRPTNBRX IS NOT EQUAL TO WS-LKRPTNBRX                 00345000
003460         OR WS-RKSEPREPX IS NOT EQUAL TO WS-LKSEPREPX             00346000
003470         OR WS-RKSPECX IS NOT EQUAL TO WS-LKSPECX                 00347000
003480         PERFORM ML-SETHC THRU ML-SETAC.                          00348000
003490     IF WS-RKRPTNBRX IS NOT EQUAL TO WS-LKRPTNBRX                 00349000
003500         OR WS-RKHOLDCOX IS NOT EQUAL TO WS-LKHOLDCOX             00350000
003510         OR WS-RKINSTX IS NOT EQUAL TO WS-LKINSTX                 00351000
003520         OR WS-RKREGNBRX IS NOT EQUAL TO WS-LKREGNBRX             00352000
003530         OR WS-RKBRANCHX IS NOT EQUAL TO WS-LKBRANCHX             00353000
003540         OR WS-RKFORMX IS NOT EQUAL TO WS-LKFORMX                 00354000
003550         OR WS-RKSEPREPX IS NOT EQUAL TO WS-LKSEPREPX             00355000
003560         OR WS-RKSPECX IS NOT EQUAL TO WS-LKSPECX                 00356000
003570         MOVE 'X' TO WS-TOTSW                                     00357000
003580         GO TO ML-REPORT.                                         00358000
003590     IF WS-SBHC IS NOT EQUAL TO SPACES                            00359000
003600         OR WS-SBBK IS NOT EQUAL TO SPACES                        00360000
003610         PERFORM CHANGE-BANK                                      00361000
003620         GO TO ML-REPORT.                                         00362000
003630     GO TO ML-REPORT.                                             00363000
003640 ML-SETHC.                                                        00364000
003650     IF WS-LKHOLDCOX IS NOT EQUAL TO LOW-VALUES                   00365000
003660         MOVE ZEROS TO WS-INST                                    00366000
003670         MOVE 'X' TO WS-KBHC.                                     00367000
003680 ML-SETBK.                                                        00368000
003690     IF WS-LKINSTX IS NOT EQUAL TO LOW-VALUES                     00369000
003700         MOVE 'X' TO WS-KBBK.                                     00370000
003710 ML-SETRG.                                                        00371000
003720     IF WS-LKREGNBRX IS NOT EQUAL TO LOW-VALUES                   00372000
003730         MOVE 'X' TO WS-KBRG.                                     00373000
003740 ML-SETBR.                                                        00374000
003750     IF WS-LKBRANCHX IS NOT EQUAL TO LOW-VALUES                   00375000
003760         MOVE 'X' TO WS-KBBR.                                     00376000
003770 ML-SETTY.                                                        00377000
003780     IF WS-LKTYPEX IS NOT EQUAL TO LOW-VALUES                     00378000
003790         MOVE 'X' TO WS-KBTY.                                     00379000
003800 ML-SETOF.                                                        00380000
003810     IF WS-LKOFFX IS NOT EQUAL TO LOW-VALUES                      00381000
003820         MOVE 'X' TO WS-KBOF.                                     00382000
003830 ML-SETCU.                                                        00383000
003840     IF WS-LKCUSTX IS NOT EQUAL TO LOW-VALUES                     00384000
003850         MOVE 'X' TO WS-KBCU.                                     00385000
003860 ML-SETAC.                                                        00386000
003870     IF WS-LKACCTX IS NOT EQUAL TO LOW-VALUES                     00387000
003880         MOVE 'X' TO WS-KBAC.                                     00388000
003890 ML-REPORT.                                                       00389000
003900     PERFORM EDIT-ACCOUNT.                                        00390000
003910     MOVE WS-KEYBYTES TO WS-SAVEBYTES.                            00391000
003920     MOVE WS-LKRPTPFC TO SR-FICHE.                                00392000
003930     MOVE WS-LKBRPAGE TO WS-BBBR.                                 00393000
003940     MOVE WS-LKTYPAGE TO WS-BBTY.                                 00394000
003950     IF WS-BBTY IS EQUAL TO 'X'                                   00395000
003960         AND WS-KBTY IS EQUAL TO 'X'                              00396000
003970         MOVE 'G' TO WS-TOTSW.                                    00397000
003980     GO TO ML-REPORTGO.                                           00398000
003990 ML-REPORTA.                                                      00399000
004000     IF WS-BBBR IS EQUAL TO 'X'                                   00400000
004010         AND WS-KBBR IS EQUAL TO 'X'                              00401000
004020         MOVE 'X' TO WS-TOTSW.                                    00402000
004030     IF WS-BBTY IS EQUAL TO 'X'                                   00403000
004040         AND WS-KBTY IS EQUAL TO 'X'                              00404000
004050         MOVE 'X' TO WS-TOTSW.                                    00405000
004060 ML-REPORTGO.                                                     00406000
004070     MOVE WS-LKRPTNBR TO WS-SUB1.                                 00407000
004080     SUBTRACT +49 FROM WS-SUB1.                                   00408000
004090                                                                  00409000
004100     GO TO                                                        00410000
004110         ML-RPT050                                                00411000
004120         ML-RPT051                                                00412000
004130         ML-RPT052                                                00413000
004140         ML-RPT053                                                00414000
004150         ML-RPT054                                                00415000
004160         ML-RPT055                                                00416000
004170         ML-RPT056                                                00417000
004180         DEPENDING ON WS-SUB1.                                    00418000
004190 ML-RPTERR.                                                       00419000
004200     GO TO AR-0008.                                               00420000
004210 ML-RPT050.                                                       00421000
004220*----------------------------------------------------------------*00422000
004230*    REPORT 050 - ENROLLMENT REPORT                              *00423000
004240*----------------------------------------------------------------*00424000
000000     CALL 'RPG050' USING                                          00425000
004260         SRW015-AREAS                                             00426000
004270         SRW066-AREAS                                             00427000
004280         RPBNK-RECORD                                             00428000
004290         MIMST-RECORD                                             00429000
004300         WS-RPT3REC                                               00430000
004310         WS-LINKDATA                                              00431000
004320         WS-PRINTLINES.                                           00432000
004330     GO TO ML-RETURN.                                             00433000
004340 ML-RPT051.                                                       00434000
004350*----------------------------------------------------------------*00435000
004360*    REPORT 051 - INCENTIVE QUALIFICATION REPORT                 *00436000
004370*----------------------------------------------------------------*00437000
000000     CALL 'RPG051' USING                                          00438000
004390         SRW015-AREAS                                             00439000
004400         SRW066-AREAS                                             00440000
004410         RPBNK-RECORD                                             00441000
004420         MIMST-RECORD                                             00442000
004430         WS-RPT3REC                                               00443000
004440         WS-LINKDATA                                              00444000
004450         WS-PRINTLINES.                                           00445000
004460     GO TO ML-RETURN.                                             00446000
004470 ML-RPT052.                                                       00447000
004480*----------------------------------------------------------------*00448000
004490*    REPORT 052 - ACCOUNT INCENTIVE REPORT                       *00449000
004500*----------------------------------------------------------------*00450000
000000     CALL 'RPG052' USING                                          00451000
004520         SRW015-AREAS                                             00452000
004530         SRW066-AREAS                                             00453000
004540         RPBNK-RECORD                                             00454000
004550         MIMST-RECORD                                             00455000
004560         WS-RPT3REC                                               00456000
004570         WS-LINKDATA                                              00457000
004580         WS-PRINTLINES.                                           00458000
004590     GO TO ML-RETURN.                                             00459000
004600 ML-RPT053.                                                       00460000
004610*----------------------------------------------------------------*00461000
004620*    REPORT 053 - DUPLICATE ACCOUNT INCENTIVE REPORT             *00462000
004630*----------------------------------------------------------------*00463000
000000     CALL 'RPG053' USING                                          00464000
004650         SRW015-AREAS                                             00465000
004660         SRW066-AREAS                                             00466000
004670         RPBNK-RECORD                                             00467000
004680         MIMST-RECORD                                             00468000
004690         WS-RPT3REC                                               00469000
004700         WS-LINKDATA                                              00470000
004710         WS-PRINTLINES.                                           00471000
004720     GO TO ML-RETURN.                                             00472000
004730 ML-RPT054.                                                       00473000
004740*----------------------------------------------------------------*00474000
004750*    REPORT 054 - ACCOUNT INCENTIVE OVERRIDE REPORT              *00475000
004760*----------------------------------------------------------------*00476000
000000     CALL 'RPG054' USING                                          00477000
004780         SRW015-AREAS                                             00478000
004790         SRW066-AREAS                                             00479000
004800         RPBNK-RECORD                                             00480000
004810         MIMST-RECORD                                             00481000
004820         WS-RPT3REC                                               00482000
004830         WS-LINKDATA                                              00483000
004840         WS-PRINTLINES.                                           00484000
004850     GO TO ML-RETURN.                                             00485000
004860 ML-RPT055.                                                       00486000
004870*----------------------------------------------------------------*00487000
004880*    REPORT 055 - TRANSFERRED RELATIONSHIP REPORT                *00488000
004890*----------------------------------------------------------------*00489000
000000     CALL 'RPG055' USING                                          00490000
004910         SRW015-AREAS                                             00491000
004920         SRW066-AREAS                                             00492000
004930         RPBNK-RECORD                                             00493000
004940         MIMST-RECORD                                             00494000
004950         WS-RPT3REC                                               00495000
004960         WS-LINKDATA                                              00496000
004970         WS-PRINTLINES.                                           00497000
004980     GO TO ML-RETURN.                                             00498000
004990 ML-RPT056.                                                       00499000
005000*----------------------------------------------------------------*00500000
005010*    REPORT 056 - EXTERNAL ENROLLMENT REPORT                     *00501000
005020*----------------------------------------------------------------*00502000
000000     CALL 'RPG056' USING                                          00503000
005040         SRW015-AREAS                                             00504000
005050         SRW066-AREAS                                             00505000
005060         RPBNK-RECORD                                             00506000
005070         MIMST-RECORD                                             00507000
005080         WS-RPT3REC                                               00508000
005090         WS-LINKDATA                                              00509000
005100         WS-PRINTLINES.                                           00510000
005110 ML-RETURN.                                                       00511000
005120     IF WS-CONTROL IS EQUAL TO 'C'                                00512000
005130         PERFORM GET-MIC-PRI-NO                                   00513000
005140         PERFORM MIC-MST-GET-REQUEST                              00514000
005150         PERFORM MIC-MST-MOVE-DATA                                00515000
005160         MOVE WS-FUNCTION TO WS-LINKFUNCT                         00516000
005170         GO TO ML-REPORTGO.                                       00517000
005180     IF WS-CONTROL IS EQUAL TO 'N'                                00518000
005190         GO TO ML-REPORTGO.                                       00519000
005200 ML-CONT.                                                         00520000
005210     IF WS-CONTROL IS EQUAL TO 'R'                                00521000
005220         PERFORM READ-RPT3FIL                                     00522000
005230         GO TO ML-REPORTGO.                                       00523000
005240     PERFORM REPORT-PRINT.                                        00524000
005250     IF WS-CONTROL IS EQUAL TO 'A'                                00525000
005260         GO TO AR-0009.                                           00526000
005270     IF WS-HEADSW IS NOT EQUAL TO SPACES                          00527000
005280         MOVE SPACES TO WS-HEADSW                                 00528000
005290         MOVE +900 TO SR-LINES.                                   00529000
005300     IF WS-CONTROL IS EQUAL TO 'G'                                00530000
005310         GO TO ML-REPORTGO.                                       00531000
005320     IF WS-RPTSKEY IS EQUAL TO HIGH-VALUES                        00532000
005330         GO TO END-ROUTINE.                                       00533000
005340     IF WS-RKFORMX IS NOT EQUAL TO WS-LKFORMX                     00534000
005350         OR WS-RKRPTNBRX IS NOT EQUAL TO WS-LKRPTNBRX             00535000
005360         OR WS-RKSEPREPX IS NOT EQUAL TO WS-LKSEPREPX             00536000
005370         OR WS-RKINSTX IS NOT EQUAL TO WS-LKINSTX                 00537000
005380         OR WS-RKSPECX IS NOT EQUAL TO WS-LKSPECX                 00538000
005390         MOVE 'X' TO WS-INITSW.                                   00539000
005400     IF WS-RKFORMX IS NOT EQUAL TO WS-LKFORMX                     00540000
005410         MOVE WS-RKFORMX TO SR-FORM                               00541000
005420         MOVE WS-RKINST TO SR-INSTR                               00542000
005430         PERFORM CHANGE-FORMS.                                    00543000
005440     MOVE WS-RPTSKEY TO WS-LASTKEY.                               00544000
005450     IF WS-TOTSW IS NOT EQUAL TO SPACE                            00545000
005460         GO TO ML-PROCESS.                                        00546000
005470     GO TO ML-START.                                              00547000
005480 ML-EXIT.                                                         00548000
005490     EXIT.                                                        00549000
005500******************************************************************00550000
005510 GET-MIC-PRI-NO SECTION.                                          00551000
005520 GMPN-START.                                                      00552000
005530     IF MIMST-KREC IS EQUAL TO +0242                              00553000
005540         MOVE SPACES TO MI0242-RECORD                             00554000
005550         MOVE MIC-MST-0242-PRI TO MIC-MST-REC-PRI                 00555000
005560         MOVE WS-MIMKEYHOLD TO WS-HOLDKEY-AREA0242                00556000
005570         MOVE WS-HOLD-0242KINST TO MIM-0242KINST                  00557000
005580         MOVE WS-HOLD-0242KREC TO MIM-0242KREC                    00558000
005590         MOVE WS-HOLD-0242KOFFICER TO MIM-0242KOFFICER            00559000
005600         MOVE MI0242-RECORD TO MIMST-RECORD                       00560000
005610         GO TO GMPN-EXIT.                                         00561000
005620     IF MIMST-KREC IS EQUAL TO +1003                              00562000
005630         MOVE SPACES TO MI1003-RECORD                             00563000
005640         MOVE MIC-MST-1003-PRI TO MIC-MST-REC-PRI                 00564000
005650         MOVE WS-MIMKEYHOLD TO WS-HOLDKEY-AREA1003                00565000
005660         MOVE WS-HOLD-1003KINST TO MIM-1003KINST                  00566000
005670         MOVE WS-HOLD-1003KREC TO MIM-1003KREC                    00567000
005680         MOVE WS-HOLD-1003KAPPL TO MIM-1003KAPPL                  00568000
005690         MOVE WS-HOLD-1003KTYPE TO MIM-1003KTYPE                  00569000
005700         MOVE WS-HOLD-1003KLANG TO MIM-1003KLANG                  00570000
005710         MOVE MI1003-RECORD TO MIMST-RECORD                       00571000
005720         GO TO GMPN-EXIT.                                         00572000
005730     IF MIMST-KREC IS EQUAL TO +1004                              00573000
005740         MOVE SPACES TO MI1004-RECORD                             00574000
005750         MOVE MIC-MST-1004-PRI TO MIC-MST-REC-PRI                 00575000
005760         MOVE WS-MIMKEYHOLD TO WS-HOLDKEY-AREA1004                00576000
005770         MOVE WS-HOLD-1004KINST TO MIM-1004KINST                  00577000
005780         MOVE WS-HOLD-1004KREC TO MIM-1004KREC                    00578000
005790         MOVE WS-HOLD-1004KAPPL TO MIM-1004KAPPL                  00579000
005800         MOVE WS-HOLD-1004KCODE TO MIM-1004KCODE                  00580000
005810         MOVE WS-HOLD-1004KLANG TO MIM-1004KLANG                  00581000
005820         MOVE MI1004-RECORD TO MIMST-RECORD                       00582000
005830         GO TO GMPN-EXIT.                                         00583000
005840     GO TO AR-0017.                                               00584000
005850 GMPN-EXIT.                                                       00585000
005860     EXIT.                                                        00586000
005870******************************************************************00587000
005880 MIC-MST-MOVE-DATA SECTION.                                       00588000
005890 MMMD-START.                                                      00589000
005900     IF MIMST-KREC IS EQUAL TO +0242                              00590000
005910         MOVE MIMST-RECORD TO MI0242-RECORD                       00591000
005920         GO TO MMMD-EXIT.                                         00592000
005930     IF MIMST-KREC IS EQUAL TO +1003                              00593000
005940         MOVE MIMST-RECORD TO MI1003-RECORD                       00594000
005950         GO TO MMMD-EXIT.                                         00595000
005960     IF MIMST-KREC IS EQUAL TO +1004                              00596000
005970         MOVE MIMST-RECORD TO MI1004-RECORD                       00597000
005980         GO TO MMMD-EXIT.                                         00598000
005990     GO TO AR-0018.                                               00599000
006000 MMMD-EXIT.                                                       00600000
006010     EXIT.                                                        00601000
006020******************************************************************00602000
006030 EDIT-ACCOUNT SECTION.                                            00603000
006040 EA-START.                                                        00604000
006050     MOVE RPRPTS-ACCOUNT TO SR-AEACCOUNT.                         00605000
006060     IF RPRPTS-PRODCODE IS EQUAL TO 'DDA   '                      00606000
006070         MOVE WS-DSACCTLN TO SR-AEACCTLN                          00607000
006080         MOVE WS-RPEDIT TO SR-AEEDIT                              00608000
006090         PERFORM ACCOUNT-EDIT                                     00609000
006100         MOVE SR-AEACCTEDT TO WS-EDITEDACCOUNT                    00610000
006110         MOVE WS-EDITACCTSV TO WS-EDITACCT                        00611000
006120         MOVE WS-DDAAPPL TO WS-APPL                               00612000
006130         GO TO EA-EXIT.                                           00613000
006140     IF RPRPTS-PRODCODE IS EQUAL TO 'SAV   '                      00614000
006150         MOVE WS-RSSAVLN TO SR-AEACCTLN                           00615000
006160         MOVE WS-RPSAVEDIT TO SR-AEEDIT                           00616000
006170         PERFORM ACCOUNT-EDIT                                     00617000
006180         MOVE SR-AEACCTEDT TO WS-EDITEDACCOUNT                    00618000
006190         MOVE WS-EDITACCTSV TO WS-EDITACCT                        00619000
006200         MOVE WS-SAVAPPL TO WS-APPL                               00620000
006210         GO TO EA-EXIT.                                           00621000
006220     MOVE WS-RSODBLN TO SR-AEACCTLN.                              00622000
006230     MOVE WS-RSODBEDIT TO SR-AEEDIT.                              00623000
006240     MOVE WS-ODBAPPL TO WS-APPL.                                  00624000
006250     PERFORM ACCOUNT-EDIT.                                        00625000
006260     MOVE SR-AEACCTEDT TO WS-EDITEDACCOUNT.                       00626000
006270     MOVE WS-EDITACCTSV TO WS-EDITACCT.                           00627000
006280 EA-EXIT.                                                         00628000
006290     EXIT.                                                        00629000
006300******************************************************************00630000
006310 CHANGE-BANK SECTION.                                             00631000
006320 CB-START.                                                        00632000
006330     IF WS-INST IS EQUAL TO RPRPTS-INST                           00633000
006340         GO TO CB-CFBRANCH.                                       00634000
006350     MOVE RPRPTS-INST TO WS-INST.                                 00635000
006360     MOVE SPACES TO MI1001-RECORD.                                00636000
006370     MOVE RPRPTS-INST TO MIM-1001KINST.                           00637000
006380     MOVE +1001 TO MIM-1001KREC.                                  00638000
006390     MOVE MIC-MST-1001-PRI TO MIC-MST-REC-PRI.                    00639000
006400     MOVE MI1001-RECORD TO MIMST-RECORD.                          00640000
006410     PERFORM MIC-MST-GET-REQUEST.                                 00641000
006420     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00642000
006430         GO TO AR-0010.                                           00643000
006440     MOVE MIMST-RECORD TO MI1001-RECORD.                          00644000
006450     MOVE MIM-1001NAME TO SR-BKNAME.                              00645000
006460     MOVE MIM-1001ADDR (1) TO WS-BKADDR1.                         00646000
006470     MOVE MIM-1001ADDR (2) TO WS-BKADDR2.                         00647000
006480     MOVE MIM-1001ZIP TO WS-BKZIP.                                00648000
006490     MOVE MIM-1001KINST TO SR-INSTR.                              00649000
006500     MOVE MIM-1001HCO TO WS-HCONBR.                               00650000
006510 CB-CF0211.                                                       00651000
006520     MOVE ZEROS TO WS-DSACCTLN.                                   00652000
006530     MOVE ZEROS TO WS-RPEDIT.                                     00653000
006540     MOVE ZEROS TO WS-RSSAVLN.                                    00654000
006550     MOVE ZEROS TO WS-RPSAVEDIT.                                  00655000
006560     MOVE ZEROS TO WS-RSODBLN.                                    00656000
006570     MOVE ZEROS TO WS-RSODBEDIT.                                  00657000
006580     MOVE 01 TO WS-DDAAPPL.                                       00658000
006590     MOVE 04 TO WS-SAVAPPL.                                       00659000
006600     MOVE 03 TO WS-ODBAPPL.                                       00660000
006610     MOVE ZEROS TO WS-SUB3.                                       00661000
006620 CB-CF0211LOOP.                                                   00662000
006630     ADD +1 TO WS-SUB3.                                           00663000
006640     IF WS-SUB3 IS GREATER THAN +3                                00664000
006650         GO TO CB-CFHOLDCO.                                       00665000
006660     MOVE SPACES TO MI0211-RECORD.                                00666000
006670     MOVE RPRPTS-INST TO MIM-0211KINST.                           00667000
006680     MOVE +0211 TO MIM-0211KREC.                                  00668000
006690     IF WS-SUB3 IS EQUAL TO +1                                    00669000
006700         MOVE '01' TO MIM-0211KINTAPPL.                           00670000
006710     IF WS-SUB3 IS EQUAL TO +2                                    00671000
006720         MOVE '03' TO MIM-0211KINTAPPL.                           00672000
006730     IF WS-SUB3 IS EQUAL TO +3                                    00673000
006740         MOVE '04' TO MIM-0211KINTAPPL.                           00674000
006750     MOVE MIC-MST-0211-PRI TO MIC-MST-REC-PRI.                    00675000
006760     MOVE MI0211-RECORD TO MIMST-RECORD.                          00676000
006770     PERFORM MIC-MST-GET-REQUEST.                                 00677000
006780     IF WS-FUNCTION IS EQUAL TO SPACE                             00678000
006790         GO TO CB-CF0211DATA.                                     00679000
006800     MOVE ZEROS TO MIM-0211KINST.                                 00680000
006810     MOVE MIC-MST-0211-PRI TO MIC-MST-REC-PRI.                    00681000
006820     MOVE MI0211-RECORD TO MIMST-RECORD.                          00682000
006830     PERFORM MIC-MST-GET-REQUEST.                                 00683000
006840     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00684000
006850         GO TO AR-0011.                                           00685000
006860 CB-CF0211DATA.                                                   00686000
006870     MOVE MIMST-RECORD TO MI0211-RECORD.                          00687000
006880     IF WS-SUB3 IS EQUAL TO +1                                    00688000
006890         MOVE MIM-211ACCTLN TO WS-DSACCTLN                        00689000
006900         MOVE MIM-211ACCTED TO WS-RPEDIT.                         00690000
006910     IF WS-SUB3 IS EQUAL TO +2                                    00691000
006920         MOVE MIM-211ACCTLN TO WS-RSODBLN                         00692000
006930         MOVE MIM-211ACCTED TO WS-RSODBEDIT.                      00693000
006940     IF WS-SUB3 IS EQUAL TO +3                                    00694000
006950         MOVE MIM-211ACCTLN TO WS-RSSAVLN                         00695000
006960         MOVE MIM-211ACCTED TO WS-RPSAVEDIT.                      00696000
006970     GO TO CB-CF0211LOOP.                                         00697000
006980 CB-CFHOLDCO.                                                     00698000
006990     IF WS-LKHOLDCOX IS EQUAL TO LOW-VALUES                       00699000
007000         OR WS-LKHOLDCO IS EQUAL TO ZEROES                        00700000
007010         MOVE SPACES TO SR-HCNAME                                 00701000
007020         MOVE SPACES TO SR-HCNBR                                  00702000
007030         GO TO CB-CFBRANCH.                                       00703000
007040     MOVE SPACES TO MI0020-RECORD.                                00704000
007050     MOVE ZEROS TO MIM-0020KINST.                                 00705000
007060     MOVE +0020 TO MIM-0020KREC.                                  00706000
007070     MOVE WS-HCONBR TO MIM-0020KHOLDCO.                           00707000
007080     MOVE MIC-MST-0020-PRI TO MIC-MST-REC-PRI.                    00708000
007090     MOVE MI0020-RECORD TO MIMST-RECORD.                          00709000
007100     PERFORM MIC-MST-GET-REQUEST.                                 00710000
007110     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00711000
007120         GO TO AR-0012.                                           00712000
007130     MOVE MIMST-RECORD TO MI0020-RECORD.                          00713000
007140     MOVE MIM-HCNAME TO SR-HCNAME.                                00714000
007150     MOVE WS-HCONBR TO SR-HCNBRR.                                 00715000
007160 CB-CFBRANCH.                                                     00716000
007170     MOVE SPACES TO MI2001-RECORD.                                00717000
007180     MOVE RPRPTS-INST TO MIM-2001KINST.                           00718000
007190     MOVE RPRPTS-BRANCH TO MIM-2001KBRANCH.                       00719000
007200     MOVE +2001 TO MIM-2001KREC.                                  00720000
007210     MOVE MIC-MST-2001-PRI TO MIC-MST-REC-PRI.                    00721000
007220     MOVE MI2001-RECORD TO MIMST-RECORD.                          00722000
007230     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00723000
P0189      IF WS-FUNCTION IS EQUAL TO 'N'                               00724000
P0189          OR WS-FUNCTION IS EQUAL TO 'E'                           00724090
P0189          MOVE SPACES TO SR-BRNAME                                 00724180
P0189          MOVE SPACES TO SR-BRNBR                                  00724270
P0189          GO TO CB-CFREGION.                                       00724360
P0189      IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00724450
007250         GO TO AR-0013.                                           00725000
007260     MOVE MIMST-RECORD TO MI2001-RECORD.                          00726000
007270     IF MIM-2001KINST IS NOT EQUAL TO RPRPTS-INST                 00727000
007280         OR MIM-2001KREC IS NOT EQUAL TO +2001                    00728000
007290         OR MIM-2001KBRANCH IS NOT EQUAL TO RPRPTS-BRANCH         00729000
007300         MOVE SPACES TO SR-BRNAME                                 00730000
007310         MOVE SPACES TO SR-BRNBR                                  00731000
007320         GO TO CB-CFREGION.                                       00732000
007330     MOVE MIM-2001BRNAME TO SR-BRNAME.                            00733000
007340     MOVE RPRPTS-BRANCH TO SR-BRNBRR.                             00734000
007350     IF WS-LKBRANCHX IS EQUAL TO LOW-VALUES                       00735000
007360         MOVE SPACES TO SR-BRNAME                                 00736000
007370         MOVE SPACES TO SR-BRNBR.                                 00737000
007380     IF WS-LKBRPAGE IS NOT EQUAL TO 'X'                           00738000
007390         MOVE SPACES TO SR-BRNBR                                  00739000
007400         MOVE SPACES TO SR-BRNAME.                                00740000
007410 CB-CFREGION.                                                     00741000
007420     MOVE SPACES TO SR-RGNBR.                                     00742000
007430     MOVE SPACES TO SR-RGNAME.                                    00743000
007440 CB-SRSYSTEM.                                                     00744000
007450     MOVE WS-DSSTITLE TO SR-SYSTEM.                               00745000
007460     MOVE 50000 TO SR-RPTNBR.                                     00746000
007470     ADD WS-LKRPTNBR TO SR-RPTNBR.                                00747000
007480 CB-EXIT.                                                         00748000
007490     EXIT.                                                        00749000
007500******************************************************************00750000
007510 CHANGE-TYPE SECTION.                                             00751000
007520 CT-START.                                                        00752000
007530     MOVE SPACES TO MI1003-RECORD.                                00753000
007540     MOVE RPRPTS-INST TO MIM-1003KINST.                           00754000
007550     MOVE '03' TO MIM-1003KAPPL.                                  00755000
007560     IF RPRPTS-PRODCODE IS EQUAL TO 'DDA   '                      00756000
007570         MOVE '01' TO MIM-1003KAPPL.                              00757000
007580     IF RPRPTS-PRODCODE IS EQUAL TO 'SAV   '                      00758000
007590         MOVE '04' TO MIM-1003KAPPL.                              00759000
007600     MOVE RPRPTS-TYPE TO MIM-1003KTYPE.                           00760000
007610     MOVE MIC-MST-LANG-DEFAULT TO MIM-1003KLANG.                  00761000
007620     MOVE +1003 TO MIM-1003KREC.                                  00762000
007630     MOVE MIC-MST-1003-PRI TO MIC-MST-REC-PRI.                    00763000
007640     MOVE MI1003-RECORD TO MIMST-RECORD.                          00764000
007650     PERFORM MIC-MST-GET-REQUEST.                                 00765000
007660     MOVE MIMST-RECORD TO MI1003-RECORD.                          00766000
007670     MOVE RPRPTS-TYPE TO SR-RGNBR.                                00767000
007680     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00768000
007690         MOVE 'TYPE DESCRIPTION NOT ON FILE' TO SR-RGNAME         00769000
007700     ELSE                                                         00770000
007710         MOVE MIM-1003DESC TO SR-RGNAME.                          00771000
007720 CT-EXIT.                                                         00772000
007730     EXIT.                                                        00773000
007740***************************************************************** 00774000
007750 CHANGE-FORMS SECTION.                                            00775000
007760 CF-START.                                                        00776000
007770     MOVE WS-RKFORMX TO SRW-FNO.                                  00777000
007780     MOVE 'DS' TO SRW-APPL.                                       00778000
007790     PERFORM PRINT-SEGMENTATION.                                  00779000
007800 CF-CONTINUE.                                                     00780000
007810     MOVE WS-RKFORMX TO SR-FORM.                                  00781000
007820 CF-EXIT.                                                         00782000
007830     EXIT.                                                        00783000
007840******************************************************************00784000
007850 PRINT-SEGMENTATION SECTION.                                      00785000
000000 COPY SRP044.                                                     00786000
007870******************************************************************00787000
007880 REPORT-PRINT SECTION.                                            00788000
007890 RP-START.                                                        00789000
007900     MOVE SR-LINES TO WS-SRLINES.                                 00790000
007910     MOVE ZERO TO WS-SUB2.                                        00791000
007920 RP-LOOP.                                                         00792000
007930     ADD +1 TO WS-SUB2.                                           00793000
007940     IF WS-SUB2 IS GREATER THAN WS-PLSIZE                         00794000
007950         OR WS-PLENTRY (WS-SUB2) IS EQUAL TO SPACES               00795000
007960         GO TO RP-CLEAR.                                          00796000
007970     MOVE WS-PLDATA (WS-SUB2) TO PLINE1.                          00797000
007980     IF WS-PLCONT (WS-SUB2) IS EQUAL TO 'A'                       00798000
007990         PERFORM PR-C01 THRU PR-EXIT                              00799000
008000         GO TO RP-LOOP.                                           00800000
008010     IF WS-PLCONT (WS-SUB2) IS EQUAL TO 'B'                       00801000
008020         PERFORM PR-C02 THRU PR-EXIT                              00802000
008030         GO TO RP-LOOP.                                           00803000
008040     IF WS-PLCONT (WS-SUB2) IS EQUAL TO 'C'                       00804000
008050         PERFORM PR-C03 THRU PR-EXIT                              00805000
008060         GO TO RP-LOOP.                                           00806000
008070     IF WS-PLCONT (WS-SUB2) IS EQUAL TO '1'                       00807000
008080         PERFORM PR-01 THRU PR-EXIT                               00808000
008090         GO TO RP-LOOP.                                           00809000
008100     IF WS-PLCONT (WS-SUB2) IS EQUAL TO '2'                       00810000
008110         PERFORM PR-02 THRU PR-EXIT                               00811000
008120         GO TO RP-LOOP.                                           00812000
008130     IF WS-PLCONT (WS-SUB2) IS EQUAL TO '3'                       00813000
008140         PERFORM PR-03 THRU PR-EXIT                               00814000
008150         GO TO RP-LOOP.                                           00815000
008160     GO TO AR-0015.                                               00816000
008170 RP-CLEAR.                                                        00817000
008180     MOVE SPACES TO WS-PRTLINES.                                  00818000
008190     MOVE WS-SRLINES TO SR-LINES.                                 00819000
008200 RP-EXIT.                                                         00820000
008210     EXIT.                                                        00821000
008220******************************************************************00822000
008230 MIC-MST-API SECTION.                                             00823000
000000 COPY MIPMSTA.                                                    00824000
008250******************************************************************00825000
008260 GET-FILE-ORGANIZATION SECTION.                                   00826000
000000 COPY SRP093.                                                     00827000
008280******************************************************************00828000
008290 CALL-RPS-BNK SECTION.                                            00829000
000000 COPY RPPBNKB.                                                    00830000
008310******************************************************************00831000
008320 READ-RPT3FIL SECTION.                                            00832000
008330 RR-START.                                                        00833000
008340     READ RP-RPT3FIL                                              00834000
008350         AT END                                                   00835000
008360         MOVE HIGH-VALUES TO WS-RPTSKEY                           00836000
008370         GO TO RR-EXIT.                                           00837000
008380     MOVE RPRPT3-RECORD TO WS-RPT3REC.                            00838000
008390     MOVE RPRPTS-RPTNBR TO WS-SUB2.                               00839000
008400     IF WS-ALLBANKS IS EQUAL TO 'Y'                               00840000
008410         GO TO RR-TEST-RPT-NBR.                                   00841000
008420     IF WS-BKSUB IS GREATER THAN +0                               00842000
008430         AND WS-RTINST (WS-BKSUB) IS EQUAL TO RPRPTS-INST         00843000
008440         GO TO RR-TEST-RPT-NBR.                                   00844000
008450     MOVE +0 TO WS-BKSUB.                                         00845000
008460 RR-FIND-BK-LOOP.                                                 00846000
008470     ADD +1 TO WS-BKSUB.                                          00847000
008480     IF WS-BKSUB IS GREATER THAN WS-BKSUBMAX                      00848000
008490         OR WS-RTBKTABLE (WS-BKSUB) IS EQUAL TO SPACE             00849000
008500         MOVE +0 TO WS-BKSUB                                      00850000
008510         GO TO RR-START.                                          00851000
008520     IF WS-RTINST (WS-BKSUB) IS EQUAL TO RPRPTS-INST              00852000
008530         GO TO RR-TEST-RPT-NBR                                    00853000
008540     ELSE                                                         00854000
008550         GO TO RR-FIND-BK-LOOP.                                   00855000
008560 RR-TEST-RPT-NBR.                                                 00856000
008570     IF WS-RTRPT (WS-BKSUB, WS-SUB2) IS EQUAL TO SPACES           00857000
008580         GO TO RR-START.                                          00858000
008590     MOVE WS-RPT3KEY TO WS-RPTSKEY.                               00859000
008600 RR-EXIT.                                                         00860000
008610     EXIT.                                                        00861000
008620******************************************************************00862000
008630 CALENDAR-365 SECTION.                                            00863000
000000 COPY SRP003.                                                     00864000
008650******************************************************************00865000
008660 PRINTER-ROUTINE SECTION.                                         00866000
000000 COPY SRP017.                                                     00867000
008680******************************************************************00868000
008690 ACCOUNT-EDIT SECTION.                                            00869000
000000 COPY SRP033.                                                     00870000
008710******************************************************************00871000
008720 ABORT-ROUTINE SECTION.                                           00872000
008730 AR-0001.                                                         00873000
008740     MOVE 0001 TO WS-ABCODE.                                      00874000
008750     GO TO AR-MSG.                                                00875000
008760 AR-0002.                                                         00876000
008770     MOVE 0002 TO WS-ABCODE.                                      00877000
008780     GO TO AR-MSG.                                                00878000
008790 AR-0003.                                                         00879000
008800     MOVE 0003 TO WS-ABCODE.                                      00880000
008810     GO TO AR-MSG.                                                00881000
008820 AR-0004.                                                         00882000
008830     MOVE 0004 TO WS-ABCODE.                                      00883000
008840     GO TO AR-MSG.                                                00884000
008850 AR-0005.                                                         00885000
008860     MOVE 0005 TO WS-ABCODE.                                      00886000
008870     GO TO AR-MSG.                                                00887000
008880 AR-0006.                                                         00888000
008890     MOVE 0006 TO WS-ABCODE.                                      00889000
008900     GO TO AR-MSG.                                                00890000
008910 AR-0007.                                                         00891000
008920     MOVE 0007 TO WS-ABCODE.                                      00892000
008930     GO TO AR-MSG.                                                00893000
008940 AR-0008.                                                         00894000
008950     MOVE 0008 TO WS-ABCODE.                                      00895000
008960     GO TO AR-MSG.                                                00896000
008970 AR-0009.                                                         00897000
008980     MOVE 0009 TO WS-ABCODE.                                      00898000
008990     GO TO AR-MSG.                                                00899000
009000 AR-0010.                                                         00900000
009010     MOVE 0010 TO WS-ABCODE.                                      00901000
009020     GO TO AR-MSG.                                                00902000
009030 AR-0011.                                                         00903000
009040     MOVE 0011 TO WS-ABCODE.                                      00904000
009050     GO TO AR-MSG.                                                00905000
009060 AR-0012.                                                         00906000
009070     MOVE 0012 TO WS-ABCODE.                                      00907000
009080     GO TO AR-MSG.                                                00908000
009090 AR-0013.                                                         00909000
009100     MOVE 0013 TO WS-ABCODE.                                      00910000
009110     GO TO AR-MSG.                                                00911000
009120 AR-0014.                                                         00912000
009130     MOVE 0014 TO WS-ABCODE.                                      00913000
009140     GO TO AR-MSG.                                                00914000
009150 AR-0015.                                                         00915000
009160     MOVE 0015 TO WS-ABCODE.                                      00916000
009170     GO TO AR-MSG.                                                00917000
009180 AR-0016.                                                         00918000
009190     MOVE 0016 TO WS-ABCODE.                                      00919000
009200     GO TO AR-MSG.                                                00920000
009210 AR-0017.                                                         00921000
009220     MOVE 0017 TO WS-ABCODE.                                      00922000
009230     GO TO AR-MSG.                                                00923000
009240 AR-0018.                                                         00924000
009250     MOVE 0018 TO WS-ABCODE.                                      00925000
009260     GO TO AR-MSG.                                                00926000
009270 AR-0019.                                                         00927000
009280     MOVE 0019 TO WS-ABCODE.                                      00928000
009290     GO TO AR-MSG.                                                00929000
009300 AR-0020.                                                         00930000
009310     MOVE 0020 TO WS-ABCODE.                                      00931000
009320     GO TO AR-MSG.                                                00932000
009330 AR-0021.                                                         00933000
009340     MOVE 0021 TO WS-ABCODE.                                      00934000
009350     GO TO AR-MSG.                                                00935000
009360 AR-0022.                                                         00936000
009370     MOVE 0022 TO WS-ABCODE.                                      00937000
009380     GO TO AR-MSG.                                                00938000
009390 AR-0023.                                                         00939000
009400     MOVE 0023 TO WS-ABCODE.                                      00940000
009410     GO TO AR-MSG.                                                00941000
009420 AR-0024.                                                         00942000
009430     MOVE 0024 TO WS-ABCODE.                                      00943000
009440     GO TO AR-MSG.                                                00944000
009450 AR-0025.                                                         00945000
009460     MOVE 0025 TO WS-ABCODE.                                      00946000
009470     GO TO AR-MSG.                                                00947000
009480 AR-MSG.                                                          00948000
009490     MOVE WS-FUNCTION TO WS-ABFC.                                 00949000
009500 AR-PRINT.                                                        00950000
000000 COPY SRP029.                                                     00951000
009520******************************************************************00952000
009530 END-ROUTINE SECTION.                                             00953000
009540 ER-START.                                                        00954000
009550     PERFORM PR-C01 THRU PR-EXIT.                                 00955000
009560     MOVE 'C  ' TO SR-APIFUNC.                                    00956000
009570     PERFORM CALL-RPS-BNK.                                        00957000
009580     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00958000
009590         GO TO AR-0016.                                           00959000
009600 ER-CLOSE.                                                        00960000
000000 COPY SRP027.                                                     00961000
009620     CLOSE RP-RPT3FIL                                             00962000
009630         PRINTERFIL.                                              00963000
009640     MOVE 'GC ' TO SR-APIFUNC.                                    00964000
009650     PERFORM CALL-RPS-BNK.                                        00965000
009660     STOP RUN.                                                    00966000
009670******************************************************************00967000
