000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPG050.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPG050 - ENROLLMENT REPORT                                  *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  WS-MIM1006KEY.                                               00012000
000130     03  WS-MIM1006APPL          PIC 9(02).                       00013000
000140     03  WS-MIM1006FORM          PIC 9(03).                       00014000
000150     03  WS-MIM1006ERR           PIC 9(03).                       00015000
000160 01  SRW000-AREAS.                                                00016000
000000 COPY SRW000.                                                     00017000
000180 01  MIMST-RECORD.                                                00018000
000000 COPY MISMST.                                                     00019000
000200 01  MIWMSTA-AREAS.                                               00020000
000000 COPY MIWMSTA.                                                    00021000
000220 01  MIWPRI-AREAS.                                                00022000
000000 COPY MIWPRI.                                                     00023000
000240 01  MI1006-RECORD.                                               00024000
000000 COPY MIS1006A.                                                   00025000
000260 01  MI2023-RECORD.                                               00026000
000000 COPY MIS2023A.                                                   00027000
000280 01  SRW105-AREAS.                                                00028000
000000 COPY SRW105.                                                     00029000
000300*01  BICPBPRM.                                                    00030000
000000 COPY BICPBPRM.                                                   00031000
000320*01  BICRSRB.                                                     00032000
000000 COPY BICRSRB.                                                    00033000
000340*01  BICRPSB.                                                     00034000
000000 COPY BICRPSB.                                                    00035000
000360*01  BICRVERB.                                                    00036000
000000 COPY BICRVERB.                                                   00037000
000380*01  BICRSTAT.                                                    00038000
000000 COPY BICRSTAT.                                                   00039000
000400*01  BICRDBS.                                                     00040000
000000 COPY BICRDBS.                                                    00041000
000420*01  BICRLOG.                                                     00042000
000000 COPY BICRLOG.                                                    00043000
000440 01  MIC-RLSELIT.                                                 00044000
000000 COPY MIWRLSE.                                                    00045000
000460 01  RPW015-AREAS.                                                00046000
000000 COPY RPW015.                                                     00047000
000480 01  WS-RPMIM2023AREAS.                                           00048000
000000 COPY RPW2023.                                                    00049000
000500*----------------------------------------------------------------*00050000
000510 01  PRINTERREC.                                                  00051000
000000 COPY SRW016.                                                     00052000
000530     03  PLINE4          REDEFINES PLINE1.                        00053000
000540         05  P4-PRIMPRODCD       PIC X(06).                       00054000
000550         05  FILLER              PIC X(01).                       00055000
000560         05  P4-PRIMACCT         PIC X(22).                       00056000
000570         05  FILLER              PIC X(01).                       00057000
000580         05  P4-PRIMMODEL        PIC X(10).                       00058000
000590         05  FILLER              PIC X(01).                       00059000
000600         05  P4-PRIMBRANCH       PIC X(05).                       00060000
000610         05  FILLER              PIC X(01).                       00061000
000620         05  P4-PRIMTYPE         PIC X(03).                       00062000
000630         05  FILLER              PIC X(01).                       00063000
000640         05  P4-SECINST          PIC X(04).                       00064000
000650         05  FILLER              PIC X(01).                       00065000
000660         05  P4-SECPRODCD        PIC X(06).                       00066000
000670         05  FILLER              PIC X(01).                       00067000
000680         05  P4-SECBRANCH        PIC X(05).                       00068000
000690         05  FILLER              PIC X(01).                       00069000
000700         05  P4-SECTYPE          PIC X(03).                       00070000
000710         05  FILLER              PIC X(01).                       00071000
000720         05  P4-SECACCT          PIC X(18).                       00072000
000730         05  FILLER              PIC X(02).                       00073000
000740         05  P4-ERRORMSG         PIC X(35).                       00074000
000750         05  FILLER              PIC X(01).                       00075000
000760         05  P4-ERRORNBR         PIC 9(03).                       00076000
000770     03  PLINE5          REDEFINES   PLINE1.                      00077000
000780         05  P5-CUSTNAME         PIC X(40).                       00078000
000790         05  FILLER              PIC X(92).                       00079000
000800     03  PLINE6          REDEFINES   PLINE1.                      00080000
000810         05  FILLER              PIC X(16).                       00081000
000820         05  P6-DETAILLINE1      PIC X(75).                       00082000
000830         05  FILLER              PIC X(41).                       00083000
000840*----------------------------------------------------------------*00084000
000850 01  WS-SRW033.                                                   00085000
000000 COPY SRW033.                                                     00086000
000870*----------------------------------------------------------------*00087000
000880*    SUBSCRIPT USAGE                                             *00088000
000890*        WS-SUB1 - POINTER FOR LS-PRINTLINES.                    *00089000
000900*        WS-SUB2 - ROUTINE POINTER FOR RETURN.                   *00090000
000910*        WS-SUB3 - WORK SUBSCRIPT.                               *00091000
000920*        WS-SUB4 - WORK SUBSCRIPT.                               *00092000
000930*----------------------------------------------------------------*00093000
000940 01  WS-SUBSCRIPTS.                                               00094000
000950     03  WS-SUB1                 PIC S9(04)      COMP             00095000
000960                                                 VALUE ZERO.      00096000
000970     03  WS-SUB2                 PIC S9(04)      COMP             00097000
000980                                                 VALUE ZERO.      00098000
000990     03  WS-SUB3                 PIC S9(04)      COMP             00099000
001000                                                 VALUE ZERO.      00100000
001010     03  WS-SUB4                 PIC S9(04)      COMP             00101000
001020                                                 VALUE ZERO.      00102000
001030*----------------------------------------------------------------*00103000
001040 01  WS-HEADINGS.                                                 00104000
001050     03  FILLER                  PIC X(19)       VALUE            00105000
001060         '*** WS-HEADINGS ***'.                                   00106000
001070     03  WS-HEAD01.                                               00107000
001080         05  FILLER              PIC X(44)       VALUE            00108000
001090             '*-------------- PRIMARY KEY DATA -----------'.      00109000
001100         05  FILLER              PIC X(44)       VALUE            00110000
001110             '-----*                                      '.      00111000
001120         05  FILLER              PIC X(44)       VALUE            00112000
001130             '                                            '.      00113000
001140     03  WS-HEAD02.                                               00114000
001150         05  FILLER              PIC X(44)       VALUE            00115000
001160             'PRD CD            ACCOUNT NBR MODEL       BR'.      00116000
001170         05  FILLER              PIC X(44)       VALUE            00117000
001180             'CH TYP *--- SECONDARY ACCOUNT INFORMATION --'.      00118000
001190         05  FILLER              PIC X(44)       VALUE            00119000
001200             '--*  *----------- ERROR MESSAGE -----------*'.      00120000
001210     03  WS-HEAD03.                                               00121000
001220         05  FILLER              PIC X(44)       VALUE            00122000
001230             'CUSTOMER NAME                               '.      00123000
001240         05  FILLER              PIC X(44)       VALUE            00124000
001250             '       INST PRD CD  BRCH TYP     ACCOUNT NUM'.      00125000
001260         05  FILLER              PIC X(44)       VALUE            00126000
001270             'BER                                         '.      00127000
001280 01  WS-TOTALS.                                                   00128000
001290     03  FILLER                  PIC X(17)       VALUE            00129000
001300         '*** WS-TOTALS ***'.                                     00130000
001310     03  WS-TOTAL1.                                               00131000
001320         05  FILLER              PIC X(16)       VALUE            00132000
001330             '           INST '.                                  00133000
001340         05  WS-T1INST           PIC 9(04).                       00134000
001350         05  FILLER              PIC X(23)       VALUE            00135000
001360             '     SUCCESSFUL SETUPS '.                           00136000
001370         05  WS-T1SUCCESS        PIC ZZZ,ZZZ,ZZZ,ZZ9.             00137000
001380         05  FILLER              PIC X(74)       VALUE SPACES.    00138000
001390     03  WS-TOTAL2.                                               00139000
001400         05  FILLER              PIC X(20)       VALUE SPACES.    00140000
001410         05  FILLER              PIC X(23)       VALUE            00141000
001420             '         FAILED SETUPS '.                           00142000
001430         05  WS-T2FAILED         PIC ZZZ,ZZZ,ZZZ,ZZ9.             00143000
001440         05  FILLER              PIC X(74)       VALUE SPACES.    00144000
001450 01  WS-DETAIL.                                                   00145000
001460     03  WS-DETAIL-LINE1.                                         00146000
001470         05  FILLER              PIC X(23)       VALUE SPACES.    00147000
001480         05  FILLER              PIC X(15)       VALUE            00148000
001490             '** ADDED DATE: '.                                   00149000
001500         05  WS-ADDEDDATE        PIC X(10).                       00150000
001510         05  FILLER              PIC X(22)       VALUE            00151000
001520             '  ATTEMPTS REMAINING: '.                            00152000
001530         05  WS-ENROLLATTEMPTS   PIC 9(02).                       00153000
001540         05  FILLER              PIC X(03)       VALUE ' **'.     00154000
001550     03  WS-DETAIL-LINE2.                                         00155000
001560         05  FILLER              PIC X(48)       VALUE            00156000
001570             '** CASH REWARDS NEXT DATE HAS BEEN CHANGED FROM '.  00157000
001580         05  WS-CRWOLDNXTDT      PIC X(10).                       00158000
001590         05  FILLER              PIC X(04)       VALUE            00159000
001600             ' TO '.                                              00160000
001610         05  WS-CRWNEWNXTDT      PIC X(10).                       00161000
001620         05  FILLER              PIC X(03)       VALUE ' **'.     00162000
001630*----------------------------------------------------------------*00163000
001640 01  WS-RPW001-AREAS.                                             00164000
000000 COPY RPW001.                                                     00165000
001660*----------------------------------------------------------------*00166000
001670 01  WS-STORAGE.                                                  00167000
001680     03  WS-HEADSW               PIC X(01)       VALUE SPACE.     00168000
001690     03  WS-FUNCTION             PIC X(01)       VALUE SPACE.     00169000
001700     03  WS-EDITEDACCOUNT.                                        00170000
001710         05  WS-EDITACCT         PIC X(22).                       00171000
001720     03  WS-ACCOUNT-NUMBER-X.                                     00172000
001730         05  WS-ACCOUNT-NUMBER   PIC 9(18).                       00173000
001740     03  WS-CUST-NAME            PIC X(40)       VALUE SPACE.     00174000
001750     03  WS-EFTIMEX.                                              00175000
001760         05  WS-EFTIME           PIC 99B99B99.                    00176000
001770     03  WS-DATEIN               PIC 9(8).                        00177000
001780     03  FILLER          REDEFINES WS-DATEIN.                     00178000
001790         05  WS-DATEIN-YYYY      PIC X(04).                       00179000
001800         05  WS-DATEIN-MM        PIC X(02).                       00180000
001810         05  WS-DATEIN-DD        PIC X(02).                       00181000
001820     03  WS-DATEOUT.                                              00182000
001830         05  WS-DATEOUT-MM       PIC X(02).                       00183000
001840         05  FILLER              PIC X(01)       VALUE '/'.       00184000
001850         05  WS-DATEOUT-DD       PIC X(02).                       00185000
001860         05  FILLER              PIC X(01)       VALUE '/'.       00186000
001870         05  WS-DATEOUT-YYYY     PIC X(04).                       00187000
001880*----------------------------------------------------------------*00188000
001890     03  WS-REC-COUNT            PIC S9(04)      COMP.            00189000
001900     03  WS-SUCCESS-TOTAL        PIC S9(12)      COMP-3.          00190000
001910     03  WS-FAILED-TOTAL         PIC S9(12)      COMP-3.          00191000
001920     03  WS-50LASTINST           PIC S9(03)      COMP-3.          00192000
001930     03  WS-50LASTACCT           PIC S9(18)      COMP-3.          00193000
001940     03  WS-50LASTPRODCODE       PIC X(06).                       00194000
P0118      03  WS-50LASTMODEL          PIC X(10).                       00194500
001950     03  WS-50LASTOPENDATE       PIC 9(09)       COMP-3.          00195000
001960     03  WS-50LASTENROLLATTEMPTS PIC 9(02).                       00196000
001970     03  WS-50LASTCRWOLDNXTDT    PIC 9(09)       COMP-3.          00197000
001980     03  WS-50LASTCRWNEWNXTDT    PIC 9(09)       COMP-3.          00198000
001990******************************************************************00199000
P0118  LINKAGE SECTION.                                                 00200000
002010******************************************************************00201000
002020 01  LS-SRW015.                                                   00202000
000000 COPY SRW015.                                                     00203000
002040*----------------------------------------------------------------*00204000
002050 01  LS-SRW066.                                                   00205000
000000 COPY SRW066.                                                     00206000
002070*----------------------------------------------------------------*00207000
002080 01  LS-BANKREC.                                                  00208000
000000 COPY RPSBNK.                                                     00209000
002100*----------------------------------------------------------------*00210000
002110 01  LS-MASTREC.                                                  00211000
002120     03  LS-MAST                 PIC X(2000).                     00212000
002130*----------------------------------------------------------------*00213000
002140 01  LS-RPT3REC.                                                  00214000
000000 COPY RPSRPTS.                                                    00215000
002160     03  LSRPT3-KEY              PIC X(70).                       00216000
002170     03  LS-DSKEY        REDEFINES LSRPT3-KEY.                    00217000
002180         05  LS-DSFORMX          PIC X(02).                       00218000
002190         05  LS-DSSEPREPX        PIC X(01).                       00219000
002200         05  LS-DPHOLDCOX.                                        00220000
002210             07  LS-DPHOLDCO     PIC S9(03)      COMP-3.          00221000
002220         05  LS-DSINSTX.                                          00222000
002230             07  LS-DSINST       PIC S9(03)      COMP-3.          00223000
002240         05  LS-DSALTBRNBRX.                                      00224000
002250             07  LS-DSALTBRNBR   PIC S9(05)      COMP-3.          00225000
002260         05  LS-DSSPECX          PIC X(01).                       00226000
002270         05  LS-DSREGNBRX.                                        00227000
002280             07  LS-DSREGNBR     PIC S9(03)      COMP-3.          00228000
002290         05  LS-DPRPTNBRX.                                        00229000
002300             07  LS-DPRPTNBR     PIC S9(04)      COMP.            00230000
002310         05  LS-DSBRANCHX.                                        00231000
002320             07  LS-DSBRANCH     PIC S9(05)      COMP-3.          00232000
002330         05  LS-DSTYPEX.                                          00233000
002340             07  LS-DSTYPE       PIC S9(03)      COMP-3.          00234000
002350         05  LS-DSOFFX.                                           00235000
002360             07  LS-DSOFF        PIC X(09).                       00236000
002370         05  LS-DSCUSTX.                                          00237000
002380             07  LS-DSCUST       PIC X(10).                       00238000
002390         05  LS-DSACCTX.                                          00239000
002400             07  LS-DSACCT       PIC S9(18)      COMP-3.          00240000
002410         05  FILLER              PIC X(21).                       00241000
002420*----------------------------------------------------------------*00242000
002430 01  LS-LINKDATA.                                                 00243000
000000 COPY RPW003.                                                     00244000
002450*----------------------------------------------------------------*00245000
002460 01  LS-PRINTLINES.                                               00246000
002470     03  LS-PRTLINES.                                             00247000
002480         05  LS-PLENTRY                          OCCURS 0020.     00248000
002490             07  LS-PLCONT       PIC X(01).                       00249000
002500             07  LS-PLDATA       PIC X(132).                      00250000
002510     03  LS-PLSIZE               PIC S9(04)      COMP             00251000
002520                                                 VALUE +0020.     00252000
002530******************************************************************00253000
002540 PROCEDURE DIVISION                                               00254000
002550         USING                                                    00255000
002560         LS-SRW015                                                00256000
002570         LS-SRW066                                                00257000
002580         LS-BANKREC                                               00258000
002590         LS-MASTREC                                               00259000
002600         LS-RPT3REC                                               00260000
002610         LS-LINKDATA                                              00261000
002620         LS-PRINTLINES.                                           00262000
002630******************************************************************00263000
002640 CONTROL-ROUTINE SECTION.                                         00264000
002650 CR-START.                                                        00265000
002660     IF LS-CONTROL IS EQUAL TO SPACES                             00266000
002670         GO TO CR-EXIT.                                           00267000
002680     GO TO                                                        00268000
002690         TOTAL-ROUTINE                                            00269000
002700         TOTAL-ROUTINE                                            00270000
002710         TOTAL-ROUTINE                                            00271000
002720         TOTAL-ROUTINE                                            00272000
002730         TOTAL-ROUTINE                                            00273000
002740         TOTAL-ROUTINE                                            00274000
002750         TOTAL-ROUTINE                                            00275000
002760         TOTAL-ROUTINE                                            00276000
002770         TOTAL-ROUTINE                                            00277000
002780         REPORT-ROUTINE                                           00278000
002790         DEPENDING ON WS-SUB2.                                    00279000
002800 CR-EXIT.                                                         00280000
002810     GO TO INITIAL-ROUTINE.                                       00281000
002820******************************************************************00282000
002830 INITIAL-ROUTINE SECTION.                                         00283000
002840 IR-START.                                                        00284000
002850     IF LS-INITSW IS EQUAL TO SPACE                               00285000
002860         GO TO IR-EXIT.                                           00286000
002870     MOVE SPACE TO LS-INITSW.                                     00287000
002880     MOVE SPACE TO LS-HEADSW.                                     00288000
002890     MOVE SPACE TO WS-ACCTSW.                                     00289000
002900     MOVE +0 TO WS-50LASTINST.                                    00290000
002910     MOVE +0 TO WS-50LASTACCT.                                    00291000
002920     MOVE SPACES TO WS-50LASTPRODCODE.                            00292000
002930     MOVE ZEROS TO WS-50LASTOPENDATE.                             00293000
002940     MOVE ZEROS TO WS-50LASTENROLLATTEMPTS.                       00294000
002950     MOVE ZEROS TO WS-50LASTCRWOLDNXTDT.                          00295000
002960     MOVE ZEROS TO WS-50LASTCRWNEWNXTDT.                          00296000
002970     MOVE +0 TO WS-SUCCESS-TOTAL.                                 00297000
002980     MOVE +0 TO WS-FAILED-TOTAL.                                  00298000
002990     MOVE SPACES TO LS-PRTLINES.                                  00299000
003000     MOVE SPACES TO PLINE1.                                       00300000
003010     MOVE +900 TO SR-LINES.                                       00301000
003020     MOVE +0 TO SR-PGCTR.                                         00302000
003030     MOVE 'RELATIONSHIP PRICING' TO SR-SYSTEM.                    00303000
003040     MOVE 'ENROLLMENT REPORT' TO SR-REPORT.                       00304000
003050     MOVE 50050 TO SR-RPTNBR.                                     00305000
003060 IR-REC2023.                                                      00306000
003070     MOVE RPRPTS-INST TO WS-RPMIM2023INST.                        00307000
003080     PERFORM LOAD-RPS-2023.                                       00308000
003090 IR-EXIT.                                                         00309000
003100     GO TO TOTAL-ROUTINE.                                         00310000
003110******************************************************************00311000
003120 TOTAL-ROUTINE SECTION.                                           00312000
000000 COPY RPP001.                                                     00313000
003140******************************************************************00314000
003150 REPORT-ROUTINE SECTION.                                          00315000
003160 RR-START.                                                        00316000
003170     IF LS-TOTSW IS NOT EQUAL TO SPACE                            00317000
003180         MOVE SPACE TO LS-CONTROL                                 00318000
003190         GO TO RR-EXIT.                                           00319000
003200     IF LS-CONTROL IS NOT EQUAL TO SPACE                          00320000
003210         MOVE SPACE TO LS-CONTROL.                                00321000
003220 RR-HEADING.                                                      00322000
003230     MOVE +0 TO WS-SUB1.                                          00323000
003240     PERFORM R4-HEADCHECK.                                        00324000
003250 RR-IFCUST1.                                                      00325000
003260     MOVE RPRPTS-ACCOUNT TO WS-ACCOUNT-NUMBER-X.                  00326000
003270     IF WS-ACCOUNT-NUMBER IS EQUAL TO WS-50LASTACCT               00327000
003280         AND RPRPTS-PRODCODE IS EQUAL TO WS-50LASTPRODCODE        00328000
P0118          AND RPRPTS-MODEL IS EQUAL TO WS-50LASTMODEL              00328500
003290         GO TO RR-FINDTYPE.                                       00329000
003300     IF (WS-ACCOUNT-NUMBER IS NOT EQUAL TO WS-50LASTACCT          00330000
P0118          OR RPRPTS-PRODCODE IS NOT EQUAL TO WS-50LASTPRODCODE     00331000
P0118          OR RPRPTS-MODEL IS EQUAL TO WS-50LASTMODEL)              00331290
003320         AND WS-REC-COUNT IS EQUAL TO 1                           00332000
003330         MOVE 'N' TO WS-HEADSW                                    00333000
003340         MOVE WS-CUST-NAME TO P5-CUSTNAME                         00334000
003350         PERFORM PR-01 THRU PR-EXIT.                              00335000
003360     IF (WS-ACCOUNT-NUMBER IS NOT EQUAL TO WS-50LASTACCT          00336000
P0118          OR RPRPTS-PRODCODE IS NOT EQUAL TO WS-50LASTPRODCODE     00337000
P0118          OR RPRPTS-MODEL IS EQUAL TO WS-50LASTMODEL)              00337290
003380         AND WS-50LASTENROLLATTEMPTS IS GREATER THAN ZEROS        00338000
003390         MOVE 'N' TO WS-HEADSW                                    00339000
003400         MOVE WS-50LASTOPENDATE TO SR-CODASYL                     00340000
003410         MOVE SR-CODASYL-MM TO WS-DATEOUT-MM                      00341000
003420         MOVE SR-CODASYL-DD TO WS-DATEOUT-DD                      00342000
003430         MOVE SR-CODASYL-YYYY TO WS-DATEOUT-YYYY                  00343000
003440         MOVE WS-DATEOUT TO WS-ADDEDDATE                          00344000
003450         MOVE WS-50LASTENROLLATTEMPTS TO WS-ENROLLATTEMPTS        00345000
003460         MOVE WS-DETAIL-LINE1 TO P6-DETAILLINE1                   00346000
003470         PERFORM PR-01 THRU PR-EXIT.                              00347000
003480     IF (WS-ACCOUNT-NUMBER IS NOT EQUAL TO WS-50LASTACCT          00348000
P0118          OR RPRPTS-PRODCODE IS NOT EQUAL TO WS-50LASTPRODCODE     00349000
P0118          OR RPRPTS-MODEL IS EQUAL TO WS-50LASTMODEL)              00349290
003500         AND WS-50LASTCRWOLDNXTDT IS GREATER THAN ZEROS           00350000
003510         MOVE 'N' TO WS-HEADSW                                    00351000
003520         MOVE WS-50LASTCRWOLDNXTDT TO SR-CODASYL                  00352000
003530         MOVE SR-CODASYL-MM TO WS-DATEOUT-MM                      00353000
003540         MOVE SR-CODASYL-DD TO WS-DATEOUT-DD                      00354000
003550         MOVE SR-CODASYL-YYYY TO WS-DATEOUT-YYYY                  00355000
003560         MOVE WS-DATEOUT TO WS-CRWOLDNXTDT                        00356000
003570         MOVE WS-50LASTCRWNEWNXTDT TO SR-CODASYL                  00357000
003580         MOVE SR-CODASYL-MM TO WS-DATEOUT-MM                      00358000
003590         MOVE SR-CODASYL-DD TO WS-DATEOUT-DD                      00359000
003600         MOVE SR-CODASYL-YYYY TO WS-DATEOUT-YYYY                  00360000
003610         MOVE WS-DATEOUT TO WS-CRWNEWNXTDT                        00361000
003620         MOVE WS-DETAIL-LINE2 TO P6-DETAILLINE1                   00362000
003630         PERFORM PR-01 THRU PR-EXIT.                              00363000
003640     MOVE SPACES TO PLINE1.                                       00364000
003650     MOVE SPACES TO WS-CUST-NAME.                                 00365000
003660     MOVE 0 TO WS-REC-COUNT.                                      00366000
003670 RR-FINDTYPE.                                                     00367000
003680     ADD 1 TO WS-REC-COUNT.                                       00368000
003690     IF WS-REC-COUNT IS EQUAL TO 1                                00369000
003700         IF WS-HEADSW IS EQUAL TO 'Y'                             00370000
003710             MOVE 'N' TO WS-HEADSW                                00371000
003720         ELSE                                                     00372000
003730             MOVE SPACES TO PLINE1                                00373000
003740             PERFORM PR-01 THRU PR-EXIT.                          00374000
003750     IF WS-REC-COUNT IS EQUAL TO 1                                00375000
003760         MOVE SPACES TO WS-EDITEDACCOUNT                          00376000
003770         MOVE RPRPTS-PRODCODE TO RPW015-PRODCODE                  00377000
003780         MOVE RPRPTS-ACCOUNT TO RPW015-ACCOUNT                    00378000
003790         PERFORM EDIT-ACCOUNT                                     00379000
003800         MOVE RPW015-EDITEDACCOUNT TO P4-PRIMACCT                 00380000
003810         MOVE RPRPTS-PRODCODE TO P4-PRIMPRODCD                    00381000
003820         MOVE RPRPTS-MODEL TO P4-PRIMMODEL                        00382000
003830         MOVE RPRPTS-BRANCH TO P4-PRIMBRANCH                      00383000
003840         MOVE RPRPTS-TYPE TO P4-PRIMTYPE                          00384000
003850         MOVE RPRPTS-NAME TO WS-CUST-NAME                         00385000
003860         IF RPRPTS-050ERRORMSG IS EQUAL TO SPACES                 00386000
003870             ADD 1 TO WS-SUCCESS-TOTAL                            00387000
003880         ELSE                                                     00388000
003890             ADD 1 TO WS-FAILED-TOTAL                             00389000
003900             MOVE RPRPTS-050ERRORMSG TO P4-ERRORMSG               00390000
003910             GO TO RR-PRINT.                                      00391000
003920     IF WS-REC-COUNT IS EQUAL TO 2                                00392000
003930         MOVE RPRPTS-NAME TO P5-CUSTNAME                          00393000
003940         IF RPRPTS-050ERRORMSG IS NOT EQUAL TO SPACES             00394000
003950             MOVE RPRPTS-050ERRORMSG TO P4-ERRORMSG               00395000
003960             MOVE RPRPTS-050ERRORNBR TO P4-ERRORNBR               00396000
003970             GO TO RR-PRINT.                                      00397000
003980     MOVE RPRPTS-050SECINST TO P4-SECINST.                        00398000
003990     MOVE RPRPTS-050SECPRODCD TO P4-SECPRODCD.                    00399000
004000     MOVE RPRPTS-050SECBRANCH TO P4-SECBRANCH.                    00400000
004010     MOVE RPRPTS-050SECTYPE TO P4-SECTYPE.                        00401000
004020     MOVE RPRPTS-050SECACCT TO P4-SECACCT.                        00402000
004030 RR-PRINT.                                                        00403000
P0118      MOVE RPRPTS-MODEL TO WS-50LASTMODEL.                         00404000
P0118      MOVE RPRPTS-PRODCODE TO WS-50LASTPRODCODE.                   00404290
004050     MOVE RPRPTS-ACCOUNT TO WS-50LASTACCT.                        00405000
004060     MOVE RPRPTS-INST TO WS-50LASTINST.                           00406000
004070     MOVE RPRPTS-050OPENDATE TO WS-50LASTOPENDATE.                00407000
004080     MOVE RPRPTS-050ENROLLATTEMPTS TO WS-50LASTENROLLATTEMPTS.    00408000
004090     MOVE RPRPTS-050CRWOLDNXTDT TO WS-50LASTCRWOLDNXTDT.          00409000
004100     MOVE RPRPTS-050CRWNEWNXTDT TO WS-50LASTCRWNEWNXTDT.          00410000
004110     PERFORM PR-01 THRU PR-EXIT.                                  00411000
004120     MOVE SPACES TO PLINE1.                                       00412000
004130 RR-EXIT.                                                         00413000
004140     GO TO END-ROUTINE.                                           00414000
004150******************************************************************00415000
004160 R4-HEADCHECK SECTION.                                            00416000
004170 R4-HEADSTART.                                                    00417000
004180     IF LS-HEADSW IS NOT EQUAL TO SPACE                           00418000
004190         MOVE SPACE TO LS-HEADSW                                  00419000
004200         GO TO R4-HEADPRT.                                        00420000
004210     IF (SR-LINES + 4) IS NOT GREATER THAN SR-PAGE                00421000
004220         GO TO R4-HEADEXIT.                                       00422000
004230 R4-HEADPRT.                                                      00423000
004240     MOVE 'Y' TO WS-HEADSW.                                       00424000
004250     ADD +1 TO SR-PGCTR.                                          00425000
004260     PERFORM HEADING-ROUTINE.                                     00426000
004270     MOVE WS-HEAD01 TO PLINE1.                                    00427000
004280     PERFORM PR-01 THRU PR-EXIT.                                  00428000
004290     MOVE WS-HEAD02 TO PLINE1.                                    00429000
004300     PERFORM PR-01 THRU PR-EXIT.                                  00430000
004310     MOVE WS-HEAD03 TO PLINE1.                                    00431000
004320     PERFORM PR-02 THRU PR-EXIT.                                  00432000
004330 R4-HEADEXIT.                                                     00433000
004340     EXIT.                                                        00434000
004350******************************************************************00435000
004360 PRINT-TOTALS SECTION.                                            00436000
004370 PT-START.                                                        00437000
004380     IF WS-REC-COUNT IS EQUAL TO 1                                00438000
004390         MOVE WS-CUST-NAME TO P5-CUSTNAME                         00439000
004400         MOVE SPACES TO WS-CUST-NAME                              00440000
004410         PERFORM PR-01 THRU PR-EXIT.                              00441000
004420     IF WS-50LASTENROLLATTEMPTS IS GREATER THAN ZEROS             00442000
004430         MOVE WS-50LASTOPENDATE TO SR-CODASYL                     00443000
004440         MOVE SR-CODASYL-MM TO WS-DATEOUT-MM                      00444000
004450         MOVE SR-CODASYL-DD TO WS-DATEOUT-DD                      00445000
004460         MOVE SR-CODASYL-YYYY TO WS-DATEOUT-YYYY                  00446000
004470         MOVE WS-DATEOUT TO WS-ADDEDDATE                          00447000
004480         MOVE WS-50LASTENROLLATTEMPTS TO WS-ENROLLATTEMPTS        00448000
004490         MOVE WS-DETAIL-LINE1 TO P6-DETAILLINE1                   00449000
004500         MOVE ZEROS TO WS-50LASTOPENDATE                          00450000
004510         MOVE ZEROS TO WS-50LASTENROLLATTEMPTS                    00451000
004520         PERFORM PR-01 THRU PR-EXIT.                              00452000
004530     IF WS-50LASTCRWOLDNXTDT IS GREATER THAN ZEROS                00453000
004540         MOVE WS-50LASTCRWOLDNXTDT TO SR-CODASYL                  00454000
004550         MOVE SR-CODASYL-MM TO WS-DATEOUT-MM                      00455000
004560         MOVE SR-CODASYL-DD TO WS-DATEOUT-DD                      00456000
004570         MOVE SR-CODASYL-YYYY TO WS-DATEOUT-YYYY                  00457000
004580         MOVE WS-DATEOUT TO WS-CRWOLDNXTDT                        00458000
004590         MOVE WS-50LASTCRWNEWNXTDT TO SR-CODASYL                  00459000
004600         MOVE SR-CODASYL-MM TO WS-DATEOUT-MM                      00460000
004610         MOVE SR-CODASYL-DD TO WS-DATEOUT-DD                      00461000
004620         MOVE SR-CODASYL-YYYY TO WS-DATEOUT-YYYY                  00462000
004630         MOVE WS-DATEOUT TO WS-CRWNEWNXTDT                        00463000
004640         MOVE WS-DETAIL-LINE2 TO P6-DETAILLINE1                   00464000
004650         MOVE ZEROS TO WS-50LASTCRWOLDNXTDT                       00465000
004660         MOVE ZEROS TO WS-50LASTCRWNEWNXTDT                       00466000
004670         PERFORM PR-01 THRU PR-EXIT.                              00467000
004680     IF (SR-LINES + 5) IS GREATER THAN SR-PAGE                    00468000
004690         ADD +1 TO SR-PGCTR                                       00469000
004700         PERFORM HEADING-ROUTINE.                                 00470000
004710     MOVE SPACES TO PLINE1.                                       00471000
004720     PERFORM PR-02 THRU PR-EXIT.                                  00472000
004730     MOVE WS-50LASTINST TO WS-T1INST.                             00473000
004740     MOVE WS-SUCCESS-TOTAL TO WS-T1SUCCESS.                       00474000
004750     MOVE WS-TOTAL1 TO PLINE1.                                    00475000
004760     PERFORM PR-01 THRU PR-EXIT.                                  00476000
004770     MOVE WS-FAILED-TOTAL TO WS-T2FAILED.                         00477000
004780     MOVE WS-TOTAL2 TO PLINE1.                                    00478000
004790     PERFORM PR-01 THRU PR-EXIT.                                  00479000
004800 PT-EXIT.                                                         00480000
004810     EXIT.                                                        00481000
004820******************************************************************00482000
004830 MIC-MST-API SECTION.                                             00483000
000000 COPY MIPMSTA.                                                    00484000
004850******************************************************************00485000
004860 CHANGE-ACCOUNT SECTION.                                          00486000
004870 CA-START.                                                        00487000
004880 CA-EXIT.                                                         00488000
004890     EXIT.                                                        00489000
004900******************************************************************00490000
004910 PRINTER-ROUTINE SECTION.                                         00491000
000000 COPY SRP041.                                                     00492000
004930******************************************************************00493000
004940 CALENDAR-365 SECTION.                                            00494000
000000 COPY SRP003.                                                     00495000
004960******************************************************************00496000
004970 CONVERT-8-TO-6 SECTION.                                          00497000
000000 COPY SRP012.                                                     00498000
004990******************************************************************00499000
005000 ACCOUNT-EDIT SECTION.                                            00500000
000000 COPY SRP033.                                                     00501000
005020******************************************************************00502000
005030 EDIT-CODASYL-DATE SECTION.                                       00503000
000000 COPY SRP087.                                                     00504000
005050******************************************************************00505000
005060 HEADING-ROUTINE SECTION.                                         00506000
000000 COPY SRP016.                                                     00507000
005080******************************************************************00508000
005090 LOAD-RPS-2023 SECTION.                                           00509000
000000 COPY RPP2023.                                                    00510000
005110******************************************************************00511000
005120 SEARCH-RPS-2023 SECTION.                                         00512000
000000 COPY RPP2023S.                                                   00513000
005140******************************************************************00514000
005150 EDIT-ACCOUNT SECTION.                                            00515000
000000 COPY RPP015.                                                     00516000
005170******************************************************************00517000
005180 END-ROUTINE SECTION.                                             00518000
005190 ER-START.                                                        00519000
005200     GOBACK.                                                      00520000
005210******************************************************************00521000
