000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPG054.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPG054 - ACCOUNT INCENTIVE OVERRIDE REPORT                  *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  WS-MIM1006KEY.                                               00012000
000130     03  WS-MIM1006APPL          PIC 9(02).                       00013000
000140     03  WS-MIM1006FORM          PIC 9(03).                       00014000
000150     03  WS-MIM1006ERR           PIC 9(03).                       00015000
000160 01  SRW000-AREAS.                                                00016000
000000 COPY SRW000.                                                     00017000
000180 01  MIMST-RECORD.                                                00018000
000000 COPY MISMST.                                                     00019000
000200 01  MIWMSTA-AREAS.                                               00020000
000000 COPY MIWMSTA.                                                    00021000
000220 01  MIWPRI-AREAS.                                                00022000
000000 COPY MIWPRI.                                                     00023000
000240 01  MI1006-RECORD.                                               00024000
000000 COPY MIS1006A.                                                   00025000
000260 01  MI2023-RECORD.                                               00026000
000000 COPY MIS2023A.                                                   00027000
000280 01  SRW105-AREAS.                                                00028000
000000 COPY SRW105.                                                     00029000
000300*01  BICPBPRM.                                                    00030000
000000 COPY BICPBPRM.                                                   00031000
000320*01  BICRSRB.                                                     00032000
000000 COPY BICRSRB.                                                    00033000
000340*01  BICRPSB.                                                     00034000
000000 COPY BICRPSB.                                                    00035000
000360*01  BICRVERB.                                                    00036000
000000 COPY BICRVERB.                                                   00037000
000380*01  BICRSTAT.                                                    00038000
000000 COPY BICRSTAT.                                                   00039000
000400*01  BICRDBS.                                                     00040000
000000 COPY BICRDBS.                                                    00041000
000420*01  BICRLOG.                                                     00042000
000000 COPY BICRLOG.                                                    00043000
000440 01  MIC-RLSELIT.                                                 00044000
000000 COPY MIWRLSE.                                                    00045000
000460 01  RPW015-AREAS.                                                00046000
000000 COPY RPW015.                                                     00047000
000480 01  WS-RPMIM2023AREAS.                                           00048000
000000 COPY RPW2023.                                                    00049000
000500*----------------------------------------------------------------*00050000
000510 01  PRINTERREC.                                                  00051000
000000 COPY SRW016.                                                     00052000
000530     03  PLINE4          REDEFINES   PLINE1.                      00053000
000540         05  P4-PRODCODE         PIC X(06).                       00054000
000550         05  FILLER              PIC X(02).                       00055000
000560         05  P4-ACCOUNT          PIC X(22).                       00056000
000570         05  FILLER              PIC X(04).                       00057000
000580         05  P4-PRIMINST         PIC 9(04).                       00058000
000590         05  FILLER              PIC X(02).                       00059000
000600         05  P4-PRIMPRODCODE     PIC X(06).                       00060000
000610         05  FILLER              PIC X(05).                       00061000
000620         05  P4-PRIMACCOUNT      PIC X(22).                       00062000
000630         05  FILLER              PIC X(02).                       00063000
000640         05  P4-MODEL            PIC X(10).                       00064000
000650         05  FILLER              PIC X(03).                       00065000
000660         05  P4-DISCAMTX         PIC X(07).                       00066000
000670         05  P4-DISCAMT  REDEFINES P4-DISCAMTX                    00067000
000680                                 PIC ZZZ.99-.                     00068000
000690         05  FILLER              PIC X(03).                       00069000
000700         05  P4-DISCPCTX         PIC X(06).                       00070000
000710         05  P4-DISCPCT  REDEFINES P4-DISCPCTX                    00071000
000720                                 PIC .9(05).                      00072000
000730         05  FILLER              PIC X(02).                       00073000
000740         05  P4-RATEPCTX         PIC X(10).                       00074000
000750         05  P4-RATEPCT  REDEFINES P4-RATEPCTX                    00075000
000760                                 PIC .9(09).                      00076000
000770         05  FILLER              PIC X(03).                       00077000
000780         05  P4-RATETYPE         PIC X(01).                       00078000
000790         05  FILLER              PIC X(06).                       00079000
000800         05  P4-SPLITRATE        PIC X(01).                       00080000
000810         05  FILLER              PIC X(05).                       00081000
000820     03  PLINE5          REDEFINES   PLINE1.                      00082000
000830         05  FILLER              PIC X(22).                       00083000
000840         05  P5-TIERCOL1-HDR     PIC X(04).                       00084000
000850         05  FILLER              PIC X(01).                       00085000
000860         05  P5-BALANCE1         PIC ZZZ,ZZZ,ZZ9.                 00086000
000870         05  FILLER              PIC X(01).                       00087000
000880         05  P5-RATE1            PIC .9(09).                      00088000
000890         05  FILLER              PIC X(02).                       00089000
000900         05  P5-TIERCOL2-HDR     PIC X(04).                       00090000
000910         05  FILLER              PIC X(01).                       00091000
000920         05  P5-BALANCE2         PIC ZZZ,ZZZ,ZZ9.                 00092000
000930         05  FILLER              PIC X(01).                       00093000
000940         05  P5-RATE2            PIC .9(09).                      00094000
000950         05  FILLER              PIC X(02).                       00095000
000960         05  P5-TIERCOL3-HDR     PIC X(04).                       00096000
000970         05  FILLER              PIC X(01).                       00097000
000980         05  P5-BALANCE3         PIC ZZZ,ZZZ,ZZ9.                 00098000
000990         05  FILLER              PIC X(01).                       00099000
001000         05  P5-RATE3            PIC .9(09).                      00100000
001010         05  FILLER              PIC X(25).                       00101000
001020*----------------------------------------------------------------*00102000
001030 01  WS-SRW033.                                                   00103000
000000 COPY SRW033.                                                     00104000
001050*----------------------------------------------------------------*00105000
001060*    SUBSCRIPT USAGE                                             *00106000
001070*        WS-SUB1 - POINTER FOR LS-PRINTLINES.                    *00107000
001080*        WS-SUB2 - ROUTINE POINTER FOR RETURN.                   *00108000
001090*        WS-SUB3 - WORK SUBSCRIPT.                               *00109000
001100*        WS-SUB4 - WORK SUBSCRIPT.                               *00110000
001110*----------------------------------------------------------------*00111000
001120 01  WS-SUBSCRIPTS.                                               00112000
001130     03  WS-SUB1                 PIC S9(04)      COMP             00113000
001140                                                 VALUE ZERO.      00114000
001150     03  WS-SUB2                 PIC S9(04)      COMP             00115000
001160                                                 VALUE ZERO.      00116000
001170     03  WS-SUB3                 PIC S9(04)      COMP             00117000
001180                                                 VALUE ZERO.      00118000
001190     03  WS-SUB4                 PIC S9(04)      COMP             00119000
001200                                                 VALUE ZERO.      00120000
001210*----------------------------------------------------------------*00121000
001220 01  WS-HEADINGS.                                                 00122000
001230     03  FILLER                  PIC X(19)       VALUE            00123000
001240         '*** WS-HEADINGS ***'.                                   00124000
001250     03  WS-HEAD01.                                               00125000
001260         05  FILLER              PIC X(44)       VALUE            00126000
001270             'PROD CD         ACCOUNT NUMBER    INST  PRIM'.      00127000
001280         05  FILLER              PIC X(44)       VALUE            00128000
001290             ' PRD CD   PRIM ACCOUNT NUMBER  MODEL      DI'.      00129000
001300         05  FILLER              PIC X(44)       VALUE            00130000
001310             'SC AMT  DISC PCT    RATE PCT  TYPE  SPLIT   '.      00131000
001320     03  WS-HEAD02.                                               00132000
001330         05  FILLER              PIC X(44)       VALUE            00133000
001340             '      * SPLIT RATE *       BALANCE     RATE '.      00134000
001350         05  FILLER              PIC X(44)       VALUE            00135000
001360             '            BALANCE     RATE              BA'.      00136000
001370         05  FILLER              PIC X(44)       VALUE            00137000
001380             'LANCE     RATE                              '.      00138000
001390 01  WS-TOTALS.                                                   00139000
001400     03  FILLER                  PIC X(17)       VALUE            00140000
001410         '*** WS-TOTALS ***'.                                     00141000
001420     03  WS-TOTAL1.                                               00142000
001430         05  FILLER              PIC X(16)       VALUE            00143000
001440             '           INST '.                                  00144000
001450         05  WS-T1INST           PIC 9(04).                       00145000
001460         05  FILLER              PIC X(36)       VALUE            00146000
001470             '  TOTAL ACCOUNT INCENTIVE OVERRIDES '.              00147000
001480         05  WS-T1ACCTINCOVRD    PIC ZZZ,ZZZ,ZZZ,ZZ9.             00148000
001490         05  FILLER              PIC X(61)       VALUE SPACES.    00149000
001500*----------------------------------------------------------------*00150000
001510 01  WS-RPW001-AREAS.                                             00151000
000000 COPY RPW001.                                                     00152000
001530******************************************************************00153000
001540 01  WS-STORAGE.                                                  00154000
001550     03  WS-HEADSW               PIC X(01)       VALUE SPACE.     00155000
001560     03  WS-FUNCTION             PIC X(01)       VALUE SPACE.     00156000
001570     03  WS-EDITEDACCOUNT.                                        00157000
001580         05  WS-EDITACCT         PIC X(22).                       00158000
001590     03  WS-LASTACCOUNT          PIC X(18)       VALUE SPACES.    00159000
001600     03  WS-EFTIMEX.                                              00160000
001610         05  WS-EFTIME           PIC 99B99B99.                    00161000
001620     03  WS-DATEIN               PIC 9(8).                        00162000
001630     03  FILLER          REDEFINES WS-DATEIN.                     00163000
001640         05  WS-DATEIN-YYYY      PIC X(04).                       00164000
001650         05  WS-DATEIN-MM        PIC X(02).                       00165000
001660         05  WS-DATEIN-DD        PIC X(02).                       00166000
001670     03  WS-DATEOUT.                                              00167000
001680         05  WS-DATEOUT-MM       PIC X(02).                       00168000
001690         05  FILLER              PIC X(01)       VALUE '/'.       00169000
001700         05  WS-DATEOUT-DD       PIC X(02).                       00170000
001710         05  FILLER              PIC X(01)       VALUE '/'.       00171000
001720         05  WS-DATEOUT-YYYY     PIC X(04).                       00172000
001730*----------------------------------------------------------------*00173000
001740     03  WS-REC-COUNT            PIC S9(04)      COMP.            00174000
001750     03  WS-54LASTINST           PIC S9(03)      COMP-3.          00175000
001760     03  WS-EDITED-DATE.                                          00176000
001770         05  FILLER              PIC X(02).                       00177000
001780         05  WS-DATE-SLASH-1     PIC X.                           00178000
001790         05  FILLER              PIC X(02).                       00179000
001800         05  WS-DATE-SLASH-2     PIC X.                           00180000
001810         05  FILLER              PIC X(02).                       00181000
001820     03  WS-DATE-EDIT-AREA                                        00182000
001830                         REDEFINES WS-EDITED-DATE                 00183000
001840                                 PIC 99,99,99.                    00184000
001850     03  WS-NUMOFACCTINCOVRD     PIC S9(05)      COMP-3           00185000
001860                                                 VALUE ZEROS.     00186000
001870     03  WS-SPLITRATETABLE.                                       00187000
001880         05  WS-SPLITRATE-DATA                   OCCURS 15.       00188000
001890             07  WS-SPLITRATEAMT PIC S9(09)      COMP-3.          00189000
001900             07  WS-SPLITRATEPCT PIC SV9(09)     COMP-3.          00190000
001910     03  WS-SPLITRATE-TIER-HEADERS.                               00191000
001920         05  FILLER              PIC X(32)       VALUE            00192000
001930         ' (1) (2) (3) (4) (5) (6) (7) (8)'.                      00193000
001940         05  FILLER              PIC X(28)       VALUE            00194000
001950         ' (9)(10)(11)(12)(13)(14)(15)'.                          00195000
001960     03  WS-SPLITRATE-TIER-HEADERSX                               00196000
001970                         REDEFINES WS-SPLITRATE-TIER-HEADERS.     00197000
001980         05  WS-SPLITRATE-TIER-HDR                                00198000
001990                                 PIC X(04)       OCCURS 15.       00199000
002000******************************************************************00200000
002010 LINKAGE SECTION.                                                 00201000
002020******************************************************************00202000
002030 01  LS-SRW015.                                                   00203000
000000 COPY SRW015.                                                     00204000
002050*----------------------------------------------------------------*00205000
002060 01  LS-SRW066.                                                   00206000
000000 COPY SRW066.                                                     00207000
002080*----------------------------------------------------------------*00208000
002090 01  LS-BANKREC.                                                  00209000
000000 COPY RPSBNK.                                                     00210000
002110*----------------------------------------------------------------*00211000
002120 01  LS-MASTREC.                                                  00212000
002130     03  LS-MAST                 PIC X(2000).                     00213000
002140*----------------------------------------------------------------*00214000
002150 01  LS-RPT3REC.                                                  00215000
000000 COPY RPSRPTS.                                                    00216000
002170     03  LSRPT3-KEY              PIC X(70).                       00217000
002180     03  LS-DSKEY        REDEFINES LSRPT3-KEY.                    00218000
002190         05  LS-DSFORMX          PIC X(02).                       00219000
002200         05  LS-DSSEPREPX        PIC X(01).                       00220000
002210         05  LS-DPHOLDCOX.                                        00221000
002220             07  LS-DPHOLDCO     PIC S9(03)      COMP-3.          00222000
002230         05  LS-DSINSTX.                                          00223000
002240             07  LS-DSINST       PIC S9(03)      COMP-3.          00224000
002250         05  LS-DSALTBRNBRX.                                      00225000
002260             07  LS-DSALTBRNBR   PIC S9(05)      COMP-3.          00226000
002270         05  LS-DSSPECX          PIC X(01).                       00227000
002280         05  LS-DSREGNBRX.                                        00228000
002290             07  LS-DSREGNBR     PIC S9(03)      COMP-3.          00229000
002300         05  LS-DPRPTNBRX.                                        00230000
002310             07  LS-DPRPTNBR     PIC S9(04)      COMP.            00231000
002320         05  LS-DSBRANCHX.                                        00232000
002330             07  LS-DSBRANCH     PIC S9(05)      COMP-3.          00233000
002340         05  LS-DSTYPEX.                                          00234000
002350             07  LS-DSTYPE       PIC S9(03)      COMP-3.          00235000
002360         05  LS-DSOFFX.                                           00236000
002370             07  LS-DSOFF        PIC X(09).                       00237000
002380         05  LS-DSCUSTX.                                          00238000
002390             07  LS-DSCUST       PIC X(10).                       00239000
002400         05  LS-DSACCTX.                                          00240000
002410             07  LS-DSACCT       PIC S9(18)      COMP-3.          00241000
002420         05  FILLER              PIC X(21).                       00242000
002430*----------------------------------------------------------------*00243000
002440 01  LS-LINKDATA.                                                 00244000
000000 COPY RPW003.                                                     00245000
002460*----------------------------------------------------------------*00246000
002470 01  LS-PRINTLINES.                                               00247000
002480     03  LS-PRTLINES.                                             00248000
002490         05  LS-PLENTRY                          OCCURS 0020.     00249000
002500             07  LS-PLCONT       PIC X(01).                       00250000
002510             07  LS-PLDATA       PIC X(132).                      00251000
002520     03  LS-PLSIZE               PIC S9(04)      COMP             00252000
002530                                                 VALUE +0020.     00253000
002540******************************************************************00254000
002550 PROCEDURE DIVISION                                               00255000
002560         USING                                                    00256000
002570         LS-SRW015                                                00257000
002580         LS-SRW066                                                00258000
002590         LS-BANKREC                                               00259000
002600         LS-MASTREC                                               00260000
002610         LS-RPT3REC                                               00261000
002620         LS-LINKDATA                                              00262000
002630         LS-PRINTLINES.                                           00263000
002640******************************************************************00264000
002650 CONTROL-ROUTINE SECTION.                                         00265000
002660 CR-START.                                                        00266000
002670     IF LS-CONTROL IS EQUAL TO SPACES                             00267000
002680         GO TO CR-EXIT.                                           00268000
002690     GO TO                                                        00269000
002700         TOTAL-ROUTINE                                            00270000
002710         TOTAL-ROUTINE                                            00271000
002720         TOTAL-ROUTINE                                            00272000
002730         TOTAL-ROUTINE                                            00273000
002740         TOTAL-ROUTINE                                            00274000
002750         TOTAL-ROUTINE                                            00275000
002760         TOTAL-ROUTINE                                            00276000
002770         TOTAL-ROUTINE                                            00277000
002780         TOTAL-ROUTINE                                            00278000
002790         REPORT-ROUTINE                                           00279000
002800         DEPENDING ON WS-SUB2.                                    00280000
002810 CR-EXIT.                                                         00281000
002820     GO TO INITIAL-ROUTINE.                                       00282000
002830******************************************************************00283000
002840 INITIAL-ROUTINE SECTION.                                         00284000
002850 IR-START.                                                        00285000
002860     IF LS-INITSW IS EQUAL TO SPACE                               00286000
002870         GO TO IR-EXIT.                                           00287000
002880     MOVE SPACE TO LS-INITSW.                                     00288000
002890     MOVE SPACE TO LS-HEADSW.                                     00289000
002900     MOVE SPACE TO WS-ACCTSW.                                     00290000
002910     MOVE +0 TO WS-54LASTINST.                                    00291000
002920     MOVE SPACES TO LS-PRTLINES.                                  00292000
002930     MOVE SPACES TO PLINE1.                                       00293000
002940     MOVE +900 TO SR-LINES.                                       00294000
002950     MOVE +0 TO SR-PGCTR.                                         00295000
002960     MOVE 'RELATIONSHIP PRICING' TO SR-SYSTEM.                    00296000
002970     MOVE 'ACCOUNT INCENTIVE OVERRIDE REPORT' TO SR-REPORT.       00297000
002980     MOVE 50054 TO SR-RPTNBR.                                     00298000
002990 IR-REC2023.                                                      00299000
003000     MOVE RPRPTS-INST TO WS-RPMIM2023INST.                        00300000
003010     PERFORM LOAD-RPS-2023.                                       00301000
003020 IR-EXIT.                                                         00302000
003030     GO TO TOTAL-ROUTINE.                                         00303000
003040******************************************************************00304000
003050 TOTAL-ROUTINE SECTION.                                           00305000
000000 COPY RPP001.                                                     00306000
003070******************************************************************00307000
003080 REPORT-ROUTINE SECTION.                                          00308000
003090 RR-START.                                                        00309000
003100     IF LS-TOTSW IS NOT EQUAL TO SPACE                            00310000
003110         MOVE SPACE TO LS-CONTROL                                 00311000
003120         GO TO RR-EXIT.                                           00312000
003130     IF LS-CONTROL IS NOT EQUAL TO SPACE                          00313000
003140         MOVE SPACE TO LS-CONTROL.                                00314000
003150 RR-HEADING.                                                      00315000
003160     MOVE +0 TO WS-SUB1.                                          00316000
003170     PERFORM R4-HEADCHECK.                                        00317000
003180     MOVE SPACES TO PLINE1.                                       00318000
003190     MOVE SPACES TO WS-EDITEDACCOUNT.                             00319000
003200     MOVE RPRPTS-PRODCODE TO P4-PRODCODE.                         00320000
003210     MOVE RPRPTS-PRODCODE TO RPW015-PRODCODE.                     00321000
003220     MOVE RPRPTS-ACCOUNT TO RPW015-ACCOUNT.                       00322000
003230     PERFORM EDIT-ACCOUNT.                                        00323000
003240     MOVE RPW015-EDITEDACCOUNT TO P4-ACCOUNT.                     00324000
003250     MOVE RPRPTS-054PRIMINST TO P4-PRIMINST.                      00325000
003260     MOVE RPRPTS-054PRIMPRODCODE TO P4-PRIMPRODCODE.              00326000
003270     MOVE RPRPTS-054PRIMPRODCODE TO RPW015-PRODCODE.              00327000
003280     MOVE RPRPTS-054PRIMACCOUNT TO RPW015-ACCOUNT.                00328000
003290     PERFORM EDIT-ACCOUNT.                                        00329000
003300     MOVE RPW015-EDITEDACCOUNT TO P4-PRIMACCOUNT.                 00330000
003310     MOVE RPRPTS-MODEL TO P4-MODEL.                               00331000
003320     IF RPRPTS-054DISCAMT-OVRD-FLAG IS EQUAL TO 'Y'               00332000
003330         MOVE RPRPTS-054DISCAMT-OVRD TO P4-DISCAMT                00333000
003340     ELSE                                                         00334000
003350         MOVE '************' TO P4-DISCAMTX.                      00335000
003360     IF RPRPTS-054DISCPCT-OVRD-FLAG IS EQUAL TO 'Y'               00336000
003370         MOVE RPRPTS-054DISCPCT-OVRD TO P4-DISCPCT                00337000
003380     ELSE                                                         00338000
003390         MOVE '******' TO P4-DISCPCTX.                            00339000
003400     IF RPRPTS-054RATEPCT-OVRD-FLAG IS EQUAL TO 'Y'               00340000
003410         MOVE RPRPTS-054RATEPCT-OVRD TO P4-RATEPCT                00341000
003420     ELSE                                                         00342000
003430         MOVE '******' TO P4-RATEPCTX.                            00343000
003440     MOVE RPRPTS-054RATETYPE TO P4-RATETYPE                       00344000
003450     MOVE SPACES TO P4-SPLITRATE.                                 00345000
003460     IF RPRPTS-054RATEOPTION IS EQUAL TO '2'                      00346000
003470         MOVE 'S' TO P4-SPLITRATE.                                00347000
003480     PERFORM PR-01 THRU PR-EXIT.                                  00348000
003490     IF RPRPTS-ACCOUNT IS NOT EQUAL TO WS-LASTACCOUNT             00349000
003500         MOVE RPRPTS-ACCOUNT TO WS-LASTACCOUNT                    00350000
003510         ADD +1 TO WS-NUMOFACCTINCOVRD.                           00351000
003520     MOVE RPRPTS-INST TO WS-54LASTINST.                           00352000
003530     MOVE SPACES TO PLINE1.                                       00353000
003540     IF RPRPTS-052RATEOPTION IS NOT EQUAL TO '2'                  00354000
003550         GO TO RR-EXIT.                                           00355000
003560     MOVE RPRPTS-054SPLITRATETABLE TO WS-SPLITRATETABLE.          00356000
003570     PERFORM R5-HEADCHECK.                                        00357000
003580     MOVE +1 TO WS-SUB3.                                          00358000
003590     MOVE ZEROS TO WS-SUB4.                                       00359000
003600 RR-SPLITRATE-LOOP.                                               00360000
003610     ADD +1 TO WS-SUB4.                                           00361000
003620     MOVE SPACES TO PLINE1.                                       00362000
003630     MOVE WS-SPLITRATE-TIER-HDR (WS-SUB4) TO P5-TIERCOL1-HDR.     00363000
003640     MOVE WS-SPLITRATEAMT (WS-SUB4) TO P5-BALANCE1.               00364000
003650     MOVE WS-SPLITRATEPCT (WS-SUB4) TO P5-RATE1.                  00365000
003660     ADD +1 TO WS-SUB4.                                           00366000
003670     MOVE WS-SPLITRATE-TIER-HDR (WS-SUB4) TO P5-TIERCOL2-HDR.     00367000
003680     MOVE WS-SPLITRATEAMT (WS-SUB4) TO P5-BALANCE2.               00368000
003690     MOVE WS-SPLITRATEPCT (WS-SUB4) TO P5-RATE2.                  00369000
003700     ADD +1 TO WS-SUB4.                                           00370000
003710     MOVE WS-SPLITRATE-TIER-HDR (WS-SUB4) TO P5-TIERCOL3-HDR.     00371000
003720     MOVE WS-SPLITRATEAMT (WS-SUB4) TO P5-BALANCE3.               00372000
003730     MOVE WS-SPLITRATEPCT (WS-SUB4) TO P5-RATE3.                  00373000
003740     IF WS-SUB3 IS LESS THAN +5                                   00374000
003750         PERFORM PR-01 THRU PR-EXIT                               00375000
003760     ELSE                                                         00376000
003770         PERFORM PR-02 THRU PR-EXIT.                              00377000
003780     ADD +1 TO WS-SUB3.                                           00378000
003790     IF WS-SUB3 IS LESS THAN +6                                   00379000
003800         GO TO RR-SPLITRATE-LOOP.                                 00380000
003810     MOVE SPACES TO PLINE1.                                       00381000
003820 RR-EXIT.                                                         00382000
003830     GO TO END-ROUTINE.                                           00383000
003840******************************************************************00384000
003850 R4-HEADCHECK SECTION.                                            00385000
003860 R4-HEADSTART.                                                    00386000
003870     IF LS-HEADSW IS NOT EQUAL TO SPACE                           00387000
003880         MOVE SPACE TO LS-HEADSW                                  00388000
003890         GO TO R4-HEADPRT.                                        00389000
003900     IF (SR-LINES + 2) IS NOT GREATER THAN SR-PAGE                00390000
003910         GO TO R4-HEADEXIT.                                       00391000
003920 R4-HEADPRT.                                                      00392000
003930     ADD +1 TO SR-PGCTR.                                          00393000
003940     PERFORM HEADING-ROUTINE.                                     00394000
003950     MOVE WS-HEAD01 TO PLINE1.                                    00395000
003960     PERFORM PR-01 THRU PR-EXIT.                                  00396000
003970 R4-HEADEXIT.                                                     00397000
003980     EXIT.                                                        00398000
003990******************************************************************00399000
004000 R5-HEADCHECK SECTION.                                            00400000
004010 R5-HEADSTART.                                                    00401000
004020     IF (SR-LINES + 8) IS NOT GREATER THAN SR-PAGE                00402000
004030         MOVE WS-HEAD02 TO PLINE1                                 00403000
004040         PERFORM PR-02 THRU PR-EXIT                               00404000
004050         GO TO R5-HEADEXIT.                                       00405000
004060 R5-HEADPRT.                                                      00406000
004070     ADD +1 TO SR-PGCTR.                                          00407000
004080     PERFORM HEADING-ROUTINE.                                     00408000
004090     MOVE WS-HEAD02 TO PLINE1.                                    00409000
004100     PERFORM PR-02 THRU PR-EXIT.                                  00410000
004110 R5-HEADEXIT.                                                     00411000
004120     EXIT.                                                        00412000
004130******************************************************************00413000
004140 PRINT-TOTALS SECTION.                                            00414000
004150 PT-START.                                                        00415000
004160     IF (SR-LINES + 5) IS GREATER THAN SR-PAGE                    00416000
004170         ADD +1 TO SR-PGCTR                                       00417000
004180         PERFORM HEADING-ROUTINE.                                 00418000
004190     MOVE SPACES TO PLINE1.                                       00419000
004200     PERFORM PR-01 THRU PR-EXIT.                                  00420000
004210     MOVE WS-54LASTINST TO WS-T1INST.                             00421000
004220     MOVE WS-NUMOFACCTINCOVRD TO WS-T1ACCTINCOVRD.                00422000
004230     MOVE WS-TOTAL1 TO PLINE1.                                    00423000
004240     PERFORM PR-01 THRU PR-EXIT.                                  00424000
004250     MOVE ZEROS TO WS-NUMOFACCTINCOVRD.                           00425000
004260 PT-EXIT.                                                         00426000
004270     EXIT.                                                        00427000
004280******************************************************************00428000
004290 MIC-MST-API SECTION.                                             00429000
000000 COPY MIPMSTA.                                                    00430000
004310******************************************************************00431000
004320 CHANGE-ACCOUNT SECTION.                                          00432000
004330 CA-START.                                                        00433000
004340 CA-EXIT.                                                         00434000
004350     EXIT.                                                        00435000
004360******************************************************************00436000
004370 PRINTER-ROUTINE SECTION.                                         00437000
000000 COPY SRP041.                                                     00438000
004390******************************************************************00439000
004400 CALENDAR-365 SECTION.                                            00440000
000000 COPY SRP003.                                                     00441000
004420******************************************************************00442000
004430 CONVERT-8-TO-6 SECTION.                                          00443000
000000 COPY SRP012.                                                     00444000
004450******************************************************************00445000
004460 ACCOUNT-EDIT SECTION.                                            00446000
000000 COPY SRP033.                                                     00447000
004480******************************************************************00448000
004490 HEADING-ROUTINE SECTION.                                         00449000
000000 COPY SRP016.                                                     00450000
004510******************************************************************00451000
004520 LOAD-RPS-2023 SECTION.                                           00452000
000000 COPY RPP2023.                                                    00453000
004540******************************************************************00454000
004550 SEARCH-RPS-2023 SECTION.                                         00455000
000000 COPY RPP2023S.                                                   00456000
004570******************************************************************00457000
004580 EDIT-ACCOUNT SECTION.                                            00458000
000000 COPY RPP015.                                                     00459000
004600******************************************************************00460000
004610 END-ROUTINE SECTION.                                             00461000
004620 ER-START.                                                        00462000
004630     GOBACK.                                                      00463000
004640******************************************************************00464000
