000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPG051.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPG051 - INCENTIVE QUALIFICATION REPORT                     *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  WS-MIM1006KEY.                                               00012000
000130     03  WS-MIM1006APPL          PIC 9(02).                       00013000
000140     03  WS-MIM1006FORM          PIC 9(03).                       00014000
000150     03  WS-MIM1006ERR           PIC 9(03).                       00015000
000160 01  SRW000-AREAS.                                                00016000
000000 COPY SRW000.                                                     00017000
000180 01  MIMST-RECORD.                                                00018000
000000 COPY MISMST.                                                     00019000
000200 01  MIWMSTA-AREAS.                                               00020000
000000 COPY MIWMSTA.                                                    00021000
000220 01  MIWPRI-AREAS.                                                00022000
000000 COPY MIWPRI.                                                     00023000
000240 01  MI1006-RECORD.                                               00024000
000000 COPY MIS1006A.                                                   00025000
000260 01  MI2023-RECORD.                                               00026000
000000 COPY MIS2023A.                                                   00027000
000280 01  SRW105-AREAS.                                                00028000
000000 COPY SRW105.                                                     00029000
000300*01  BICPBPRM.                                                    00030000
000000 COPY BICPBPRM.                                                   00031000
000320*01  BICRSRB.                                                     00032000
000000 COPY BICRSRB.                                                    00033000
000340*01  BICRPSB.                                                     00034000
000000 COPY BICRPSB.                                                    00035000
000360*01  BICRVERB.                                                    00036000
000000 COPY BICRVERB.                                                   00037000
000380*01  BICRSTAT.                                                    00038000
000000 COPY BICRSTAT.                                                   00039000
000400*01  BICRDBS.                                                     00040000
000000 COPY BICRDBS.                                                    00041000
000420*01  BICRLOG.                                                     00042000
000000 COPY BICRLOG.                                                    00043000
000440 01  MIC-RLSELIT.                                                 00044000
000000 COPY MIWRLSE.                                                    00045000
000460 01  RPW015-AREAS.                                                00046000
000000 COPY RPW015.                                                     00047000
000480 01  WS-RPMIM2023AREAS.                                           00048000
000000 COPY RPW2023.                                                    00049000
000500*----------------------------------------------------------------*00050000
000510 01  PRINTERREC.                                                  00051000
000000 COPY SRW016.                                                     00052000
000530     03  PLINE4          REDEFINES   PLINE1.                      00053000
000540         05  P4-INST             PIC 9(04).                       00054000
000550         05  FILLER              PIC X(01).                       00055000
000560         05  P4-PRODCODE         PIC X(06).                       00056000
000570         05  FILLER              PIC X(02).                       00057000
000580         05  P4-ACCOUNT          PIC X(22).                       00058000
000590         05  FILLER              PIC X(01).                       00059000
000600         05  P4-BRANCH           PIC 9(05).                       00060000
000610         05  FILLER              PIC X(02).                       00061000
000620         05  P4-TYPE             PIC 9(03).                       00062000
000630         05  FILLER              PIC X(02).                       00063000
000640         05  P4-SCOPT            PIC X(01).                       00064000
000650         05  FILLER              PIC X(02).                       00065000
000660         05  P4-RATEOPT          PIC X(01).                       00066000
000670         05  FILLER              PIC X(01).                       00067000
000680         05  P4-BALTYPE          PIC X(03).                       00068000
000690         05  FILLER              PIC X(01).                       00069000
000700         05  P4-ACCTBAL          PIC Z,ZZZ,ZZZ,ZZ9.99-.           00070000
000710         05  FILLER              PIC X(01).                       00071000
000720         05  P4-ACCTBALREQ       PIC Z,ZZZ,ZZZ,ZZ9.99-.           00072000
000730         05  FILLER              PIC X(01).                       00073000
000740         05  P4-MSG              PIC X(35).                       00074000
000750         05  FILLER              PIC X(01).                       00075000
000760         05  P4-MSGNBR           PIC 9(03).                       00076000
000770     03  PLINE5          REDEFINES   PLINE1.                      00077000
000780         05  P5-CUSTNAME         PIC X(40).                       00078000
000790         05  FILLER              PIC X(01).                       00079000
000800         05  P5-MODEL            PIC X(10).                       00080000
000810         05  FILLER              PIC X(81).                       00081000
000820*----------------------------------------------------------------*00082000
000830 01  WS-SRW033.                                                   00083000
000000 COPY SRW033.                                                     00084000
000850*----------------------------------------------------------------*00085000
000860*    SUBSCRIPT USAGE                                             *00086000
000870*        WS-SUB1 - POINTER FOR LS-PRINTLINES.                    *00087000
000880*        WS-SUB2 - ROUTINE POINTER FOR RETURN.                   *00088000
000890*        WS-SUB3 - WORK SUBSCRIPT.                               *00089000
000900*        WS-SUB4 - WORK SUBSCRIPT.                               *00090000
000910*----------------------------------------------------------------*00091000
000920 01  WS-SUBSCRIPTS.                                               00092000
000930     03  WS-SUB1                 PIC S9(04)      COMP             00093000
000940                                                 VALUE ZERO.      00094000
000950     03  WS-SUB2                 PIC S9(04)      COMP             00095000
000960                                                 VALUE ZERO.      00096000
000970     03  WS-SUB3                 PIC S9(04)      COMP             00097000
000980                                                 VALUE ZERO.      00098000
000990     03  WS-SUB4                 PIC S9(04)      COMP             00099000
001000                                                 VALUE ZERO.      00100000
001010*----------------------------------------------------------------*00101000
001020 01  WS-HEADINGS.                                                 00102000
001030     03  FILLER                  PIC X(19)       VALUE            00103000
001040         '*** WS-HEADINGS ***'.                                   00104000
001050     03  WS-HEAD01.                                               00105000
001060         05  FILLER              PIC X(44)       VALUE            00106000
001070             '*------------------- ACCOUNT DATA ----------'.      00107000
001080         05  FILLER              PIC X(44)       VALUE            00108000
001090             '-------* *-------- BALANCE INFORMATION -----'.      00109000
001100         05  FILLER              PIC X(44)       VALUE            00110000
001110             '--*  *------------ MESSAGE AREA -----------*'.      00111000
001120     03  WS-HEAD02.                                               00112000
001130         05  FILLER              PIC X(44)       VALUE            00113000
001140             'INST PROD CD         ACCOUNT NUMBER  BRCH TY'.      00114000
001150         05  FILLER              PIC X(44)       VALUE            00115000
001160             'PE SC RT TYP  ACCOUNT BALANCE  BALANCE REQUI'.      00116000
001170         05  FILLER              PIC X(44)       VALUE            00117000
001180             'RED                                         '.      00118000
001190     03  WS-HEAD03.                                               00119000
001200         05  FILLER              PIC X(44)       VALUE            00120000
001210             'CUSTOMER NAME                            MOD'.      00121000
001220         05  FILLER              PIC X(44)       VALUE            00122000
001230             'EL                                          '.      00123000
001240         05  FILLER              PIC X(44)       VALUE            00124000
001250             '                                            '.      00125000
001260 01  WS-TOTALS.                                                   00126000
001270     03  FILLER                  PIC X(17)       VALUE            00127000
001280         '*** WS-TOTALS ***'.                                     00128000
001290     03  WS-TOTAL1.                                               00129000
001300         05  FILLER              PIC X(09)       VALUE SPACES.    00130000
001310         05  FILLER              PIC X(05)       VALUE            00131000
001320             'INST '.                                             00132000
001330         05  WS-T1INST           PIC 9(04).                       00133000
001340         05  FILLER              PIC X(05)       VALUE SPACES.    00134000
001350         05  FILLER              PIC X(24)       VALUE            00135000
001360             'RELATIONSHIPS PROCESSED '.                          00136000
001370         05  WS-T1REL            PIC Z,ZZZ,ZZZ,ZZ9.               00137000
001380         05  FILLER              PIC X(05)       VALUE SPACES.    00138000
001390         05  FILLER              PIC X(32)       VALUE            00139000
001400             '    RELATIONSHIPS NOT QUALIFIED '.                  00140000
001410         05  WS-T1RELNOTQUAL     PIC Z,ZZZ,ZZZ,ZZ9.               00141000
001420         05  FILLER              PIC X(22)       VALUE SPACES.    00142000
001430     03  WS-TOTAL2.                                               00143000
001440         05  FILLER              PIC X(23)       VALUE SPACES.    00144000
001450         05  FILLER              PIC X(24)       VALUE            00145000
001460             'RELATIONSHIPS QUALIFIED '.                          00146000
001470         05  WS-T2SUCCESS        PIC Z,ZZZ,ZZZ,ZZ9.               00147000
001480         05  FILLER              PIC X(05)       VALUE SPACES.    00148000
001490         05  FILLER              PIC X(32)       VALUE            00149000
001500             'RELATIONSHIPS FAILED TO QUALIFY '.                  00150000
001510         05  WS-T2FAILED         PIC Z,ZZZ,ZZZ,ZZ9.               00151000
001520         05  FILLER              PIC X(22)       VALUE SPACES.    00152000
001530     03  WS-TOTAL3.                                               00153000
001540         05  FILLER              PIC X(23)       VALUE SPACES.    00154000
001550         05  FILLER              PIC X(24)       VALUE            00155000
001560             '   RELATIONSHIPS ACTIVE '.                          00156000
001570         05  WS-T3ACTIVE         PIC Z,ZZZ,ZZZ,ZZ9.               00157000
001580         05  FILLER              PIC X(05)       VALUE SPACES.    00158000
001590         05  FILLER              PIC X(32)       VALUE            00159000
001600             '         RELATIONSHIPS INACTIVE '.                  00160000
001610         05  WS-T3INACTIVE       PIC Z,ZZZ,ZZZ,ZZ9.               00161000
001620         05  FILLER              PIC X(22)       VALUE SPACES.    00162000
001630     03  WS-TOTAL4.                                               00163000
001640         05  FILLER              PIC X(23)       VALUE SPACES.    00164000
001650         05  FILLER              PIC X(24)       VALUE            00165000
001660             '  RELATIONSHIPS EXPIRED '.                          00166000
001670         05  WS-T4EXPIRED        PIC Z,ZZZ,ZZZ,ZZ9.               00167000
001680         05  FILLER              PIC X(05)       VALUE SPACES.    00168000
001690         05  FILLER              PIC X(32)       VALUE            00169000
001700             '    RELATIONSHIPS EXPIRED TODAY '.                  00170000
001710         05  WS-T4EXPTODAY       PIC Z,ZZZ,ZZZ,ZZ9.               00171000
001720         05  FILLER              PIC X(22)       VALUE SPACES.    00172000
001730     03  WS-TOTAL5.                                               00173000
001740         05  FILLER              PIC X(23)       VALUE SPACES.    00174000
001750         05  FILLER              PIC X(24)       VALUE            00175000
001760             '  RELATIONSHIPS DELETED '.                          00176000
001770         05  WS-T5RELDEL         PIC Z,ZZZ,ZZZ,ZZ9.               00177000
001780         05  FILLER              PIC X(05)       VALUE SPACES.    00178000
001790         05  FILLER              PIC X(32)       VALUE            00179000
001800             '               ACCOUNTS DELETED '.                  00180000
001810         05  WS-T5ACCTDEL        PIC Z,ZZZ,ZZZ,ZZ9.               00181000
001820         05  FILLER              PIC X(22)       VALUE SPACES.    00182000
001830*----------------------------------------------------------------*00183000
001840 01  WS-RPW001-AREAS.                                             00184000
000000 COPY RPW001.                                                     00185000
001860******************************************************************00186000
001870 01  WS-STORAGE.                                                  00187000
001880     03  WS-HEADSW               PIC X(01)       VALUE SPACE.     00188000
001890     03  WS-CUSTLINESW           PIC X(01)       VALUE 'Y'.       00189000
001900     03  WS-FUNCTION             PIC X(01)       VALUE SPACE.     00190000
001910     03  WS-EDITEDACCOUNT.                                        00191000
001920         05  WS-EDITACCT         PIC X(22).                       00192000
001930     03  WS-EFTIMEX.                                              00193000
001940         05  WS-EFTIME           PIC 99B99B99.                    00194000
001950     03  WS-DATEIN               PIC 9(8).                        00195000
001960     03  FILLER          REDEFINES WS-DATEIN.                     00196000
001970         05  WS-DATEIN-YYYY      PIC X(04).                       00197000
001980         05  WS-DATEIN-MM        PIC X(02).                       00198000
001990         05  WS-DATEIN-DD        PIC X(02).                       00199000
002000     03  WS-DATEOUT.                                              00200000
002010         05  WS-DATEOUT-MM       PIC X(02).                       00201000
002020         05  FILLER              PIC X(01)       VALUE '/'.       00202000
002030         05  WS-DATEOUT-DD       PIC X(02).                       00203000
002040         05  FILLER              PIC X(01)       VALUE '/'.       00204000
002050         05  WS-DATEOUT-YYYY     PIC X(04).                       00205000
002060*----------------------------------------------------------------*00206000
002070     03  WS-REC-COUNT            PIC S9(04)      COMP.            00207000
002080     03  WS-51LASTINST1          PIC S9(03)      COMP-3.          00208000
002090     03  WS-51LASTACCT1          PIC X(18)       VALUE SPACES.    00209000
002100     03  WS-51LASTPRODCODE1      PIC X(06)       VALUE SPACES.    00210000
002110     03  WS-51LASTMODEL          PIC X(10)       VALUE SPACES.    00211000
002120     03  WS-51LASTINST2          PIC S9(03)      COMP-3           00212000
002130                                                 VALUE ZEROS.     00213000
002140     03  WS-51LASTACCT2          PIC X(18)       VALUE SPACES.    00214000
002150     03  WS-51LASTPRODCODE2      PIC X(06)       VALUE SPACES.    00215000
002160     03  WS-ACCOUNT-NUMBER       PIC X(18)       VALUE SPACES.    00216000
002170     03  WS-CUST-NAME            PIC X(40)       VALUE SPACES.    00217000
002180     03  WS-MODEL                PIC X(10)       VALUE SPACES.    00218000
002190     03  WS-EDITED-DATE.                                          00219000
002200         05  FILLER              PIC X(02).                       00220000
002210         05  WS-DATE-SLASH-1     PIC X.                           00221000
002220         05  FILLER              PIC X(02).                       00222000
002230         05  WS-DATE-SLASH-2     PIC X.                           00223000
002240         05  FILLER              PIC X(02).                       00224000
002250     03  WS-DATE-EDIT-AREA                                        00225000
002260                         REDEFINES WS-EDITED-DATE                 00226000
002270                                 PIC 99,99,99.                    00227000
002280     03  WS-NUMOFREL             PIC S9(05)      COMP-3           00228000
002290                                                 VALUE ZEROS.     00229000
002300     03  WS-NUMOFRELNOTQUAL      PIC S9(05)      COMP-3           00230000
002310                                                 VALUE ZEROS.     00231000
002320     03  WS-NUMOFACTIVE          PIC S9(05)      COMP-3           00232000
002330                                                 VALUE ZEROS.     00233000
002340     03  WS-NUMOFINACTIVE        PIC S9(05)      COMP-3           00234000
002350                                                 VALUE ZEROS.     00235000
002360     03  WS-NUMOFEXPIRED         PIC S9(05)      COMP-3           00236000
002370                                                 VALUE ZEROS.     00237000
002380     03  WS-NUMOFEXPTODAY        PIC S9(05)      COMP-3           00238000
002390                                                 VALUE ZEROS.     00239000
002400     03  WS-NUMOFRELDEL          PIC S9(05)      COMP-3           00240000
002410                                                 VALUE ZEROS.     00241000
002420     03  WS-NUMOFACCTDEL         PIC S9(05)      COMP-3           00242000
002430                                                 VALUE ZEROS.     00243000
002440     03  WS-NUMOFFAILED          PIC S9(13)      COMP-3           00244000
002450                                                 VALUE ZEROS.     00245000
002460     03  WS-NUMOFSUCCESS         PIC S9(13)      COMP-3           00246000
002470                                                 VALUE ZEROS.     00247000
002480******************************************************************00248000
002490 LINKAGE SECTION.                                                 00249000
002500******************************************************************00250000
002510 01  LS-SRW015.                                                   00251000
000000 COPY SRW015.                                                     00252000
002530*----------------------------------------------------------------*00253000
002540 01  LS-SRW066.                                                   00254000
000000 COPY SRW066.                                                     00255000
002560*----------------------------------------------------------------*00256000
002570 01  LS-BANKREC.                                                  00257000
000000 COPY RPSBNK.                                                     00258000
002590*----------------------------------------------------------------*00259000
002600 01  LS-MASTREC.                                                  00260000
002610     03  LS-MAST                 PIC X(2000).                     00261000
002620*----------------------------------------------------------------*00262000
002630 01  LS-RPT3REC.                                                  00263000
000000 COPY RPSRPTS.                                                    00264000
002650     03  LSRPT3-KEY              PIC X(70).                       00265000
002660     03  LS-DSKEY        REDEFINES LSRPT3-KEY.                    00266000
002670         05  LS-DSFORMX          PIC X(02).                       00267000
002680         05  LS-DSSEPREPX        PIC X(01).                       00268000
002690         05  LS-DPHOLDCOX.                                        00269000
002700             07  LS-DPHOLDCO     PIC S9(03)      COMP-3.          00270000
002710         05  LS-DSINSTX.                                          00271000
002720             07  LS-DSINST       PIC S9(03)      COMP-3.          00272000
002730         05  LS-DSALTBRNBRX.                                      00273000
002740             07  LS-DSALTBRNBR   PIC S9(05)      COMP-3.          00274000
002750         05  LS-DSSPECX          PIC X(01).                       00275000
002760         05  LS-DSREGNBRX.                                        00276000
002770             07  LS-DSREGNBR     PIC S9(03)      COMP-3.          00277000
002780         05  LS-DPRPTNBRX.                                        00278000
002790             07  LS-DPRPTNBR     PIC S9(04)      COMP.            00279000
002800         05  LS-DSBRANCHX.                                        00280000
002810             07  LS-DSBRANCH     PIC S9(05)      COMP-3.          00281000
002820         05  LS-DSTYPEX.                                          00282000
002830             07  LS-DSTYPE       PIC S9(03)      COMP-3.          00283000
002840         05  LS-DSOFFX.                                           00284000
002850             07  LS-DSOFF        PIC X(09).                       00285000
002860         05  LS-DSCUSTX.                                          00286000
002870             07  LS-DSCUST       PIC X(10).                       00287000
002880         05  LS-DSACCTX.                                          00288000
002890             07  LS-DSACCT       PIC S9(18)      COMP-3.          00289000
002900         05  FILLER              PIC X(21).                       00290000
002910*----------------------------------------------------------------*00291000
002920 01  LS-LINKDATA.                                                 00292000
000000 COPY RPW003.                                                     00293000
002940*----------------------------------------------------------------*00294000
002950 01  LS-PRINTLINES.                                               00295000
002960     03  LS-PRTLINES.                                             00296000
002970         05  LS-PLENTRY                          OCCURS 0020.     00297000
002980             07  LS-PLCONT       PIC X(01).                       00298000
002990             07  LS-PLDATA       PIC X(132).                      00299000
003000     03  LS-PLSIZE               PIC S9(04)      COMP             00300000
003010                                                 VALUE +0020.     00301000
003020******************************************************************00302000
003030 PROCEDURE DIVISION                                               00303000
003040         USING                                                    00304000
003050         LS-SRW015                                                00305000
003060         LS-SRW066                                                00306000
003070         LS-BANKREC                                               00307000
003080         LS-MASTREC                                               00308000
003090         LS-RPT3REC                                               00309000
003100         LS-LINKDATA                                              00310000
003110         LS-PRINTLINES.                                           00311000
003120******************************************************************00312000
003130 CONTROL-ROUTINE SECTION.                                         00313000
003140 CR-START.                                                        00314000
003150     IF LS-CONTROL IS EQUAL TO SPACES                             00315000
003160         GO TO CR-EXIT.                                           00316000
003170     GO TO                                                        00317000
003180         TOTAL-ROUTINE                                            00318000
003190         TOTAL-ROUTINE                                            00319000
003200         TOTAL-ROUTINE                                            00320000
003210         TOTAL-ROUTINE                                            00321000
003220         TOTAL-ROUTINE                                            00322000
003230         TOTAL-ROUTINE                                            00323000
003240         TOTAL-ROUTINE                                            00324000
003250         TOTAL-ROUTINE                                            00325000
003260         TOTAL-ROUTINE                                            00326000
003270         REPORT-ROUTINE                                           00327000
003280         DEPENDING ON WS-SUB2.                                    00328000
003290 CR-EXIT.                                                         00329000
003300     GO TO INITIAL-ROUTINE.                                       00330000
003310******************************************************************00331000
003320 INITIAL-ROUTINE SECTION.                                         00332000
003330 IR-START.                                                        00333000
003340     IF LS-INITSW IS EQUAL TO SPACE                               00334000
003350         GO TO IR-EXIT.                                           00335000
003360     MOVE SPACE TO LS-INITSW.                                     00336000
003370     MOVE SPACE TO LS-HEADSW.                                     00337000
003380     MOVE SPACE TO WS-ACCTSW.                                     00338000
003390     MOVE +0 TO WS-51LASTINST1.                                   00339000
003400     MOVE +0 TO WS-51LASTINST2.                                   00340000
003410     MOVE SPACES TO WS-51LASTACCT1.                               00341000
003420     MOVE SPACES TO WS-51LASTACCT2.                               00342000
003430     MOVE SPACES TO WS-51LASTPRODCODE1.                           00343000
003440     MOVE SPACES TO WS-51LASTPRODCODE2.                           00344000
003450     MOVE SPACES TO WS-51LASTMODEL.                               00345000
003460     MOVE SPACES TO LS-PRTLINES.                                  00346000
003470     MOVE SPACES TO PLINE1.                                       00347000
003480     MOVE +900 TO SR-LINES.                                       00348000
003490     MOVE +0 TO SR-PGCTR.                                         00349000
003500     MOVE 'RELATIONSHIP PRICING' TO SR-SYSTEM.                    00350000
003510     MOVE 'INCENTIVE QUALIFICATION REPORT' TO SR-REPORT.          00351000
003520     MOVE 50051 TO SR-RPTNBR.                                     00352000
003530 IR-REC2023.                                                      00353000
003540     MOVE RPRPTS-INST TO WS-RPMIM2023INST.                        00354000
003550     PERFORM LOAD-RPS-2023.                                       00355000
003560 IR-EXIT.                                                         00356000
003570     GO TO TOTAL-ROUTINE.                                         00357000
003580******************************************************************00358000
003590 TOTAL-ROUTINE SECTION.                                           00359000
000000 COPY RPP001.                                                     00360000
003610******************************************************************00361000
003620 REPORT-ROUTINE SECTION.                                          00362000
003630 RR-START.                                                        00363000
003640     IF LS-TOTSW IS NOT EQUAL TO SPACE                            00364000
003650         MOVE SPACE TO LS-CONTROL                                 00365000
003660         GO TO RR-EXIT.                                           00366000
003670     IF LS-CONTROL IS NOT EQUAL TO SPACE                          00367000
003680         MOVE SPACE TO LS-CONTROL.                                00368000
003690 RR-HEADING.                                                      00369000
003700     MOVE +0 TO WS-SUB1.                                          00370000
003710     PERFORM R4-HEADCHECK.                                        00371000
003720 RR-IFCUST1.                                                      00372000
003730     IF RPRPTS-ACCOUNT IS EQUAL TO WS-51LASTACCT1                 00373000
003740         AND RPRPTS-INST IS EQUAL TO WS-51LASTINST1               00374000
003750         AND RPRPTS-PRODCODE IS EQUAL TO WS-51LASTPRODCODE1       00375000
003760         AND RPRPTS-MODEL IS EQUAL TO WS-51LASTMODEL              00376000
003770         MOVE SPACES TO WS-CUSTLINESW                             00377000
003780         MOVE 'N' TO WS-HEADSW                                    00378000
003790         GO TO RR-FINDTYPE.                                       00379000
003800     IF (RPRPTS-ACCOUNT IS NOT EQUAL TO WS-51LASTACCT1            00380000
003810         OR RPRPTS-INST IS NOT EQUAL TO WS-51LASTINST1            00381000
003820         OR RPRPTS-PRODCODE IS NOT EQUAL TO WS-51LASTPRODCODE1    00382000
003830         OR RPRPTS-MODEL IS NOT EQUAL TO WS-51LASTMODEL)          00383000
P0197          AND WS-51LASTACCT1 IS NOT EQUAL TO SPACES                00383500
003840         AND WS-REC-COUNT IS EQUAL TO 1                           00384000
003850         MOVE 'N' TO WS-HEADSW                                    00385000
003860         MOVE WS-CUST-NAME TO P5-CUSTNAME                         00386000
003870         MOVE WS-MODEL TO P5-MODEL                                00387000
003880         PERFORM PR-01 THRU PR-EXIT.                              00388000
003890     IF (RPRPTS-ACCOUNT IS NOT EQUAL TO WS-51LASTACCT1            00389000
003900         OR RPRPTS-INST IS NOT EQUAL TO WS-51LASTINST1            00390000
003910         OR RPRPTS-PRODCODE IS NOT EQUAL TO WS-51LASTPRODCODE1    00391000
003920         OR RPRPTS-MODEL IS NOT EQUAL TO WS-51LASTMODEL)          00392000
003930         IF WS-HEADSW IS EQUAL TO 'Y'                             00393000
003940             MOVE 'N' TO WS-HEADSW                                00394000
003950         ELSE                                                     00395000
003960             MOVE SPACES TO PLINE1                                00396000
003970             PERFORM PR-01 THRU PR-EXIT                           00397000
003980         END-IF                                                   00398000
003990     END-IF.                                                      00399000
004000     MOVE SPACES TO PLINE1.                                       00400000
004010     MOVE SPACES TO WS-CUST-NAME.                                 00401000
004020     MOVE SPACES TO WS-MODEL.                                     00402000
004030     MOVE 'Y' TO WS-CUSTLINESW.                                   00403000
004040     MOVE 0 TO WS-REC-COUNT.                                      00404000
004050 RR-FINDTYPE.                                                     00405000
004060     ADD 1 TO WS-REC-COUNT.                                       00406000
004070     IF WS-REC-COUNT IS EQUAL TO 2                                00407000
004080         AND RPRPTS-INST IS EQUAL TO WS-51LASTINST1               00408000
004090         AND RPRPTS-ACCOUNT IS EQUAL TO WS-51LASTACCT1            00409000
004100         AND RPRPTS-PRODCODE IS EQUAL TO WS-51LASTPRODCODE1       00410000
004110         AND RPRPTS-MODEL IS EQUAL TO WS-51LASTMODEL              00411000
004120         AND (RPRPTS-051HOLDPRODCODE                              00412000
004130             IS NOT EQUAL TO WS-51LASTPRODCODE2                   00413000
004140         OR RPRPTS-051HOLDINST IS NOT EQUAL TO WS-51LASTINST2     00414000
004150         OR RPRPTS-051HOLDACCOUNT IS NOT EQUAL TO WS-51LASTACCT2) 00415000
004160         MOVE WS-CUST-NAME TO P5-CUSTNAME                         00416000
004170         MOVE WS-MODEL TO P5-MODEL                                00417000
004180         PERFORM PR-01 THRU PR-EXIT.                              00418000
004190     IF WS-REC-COUNT IS EQUAL TO 1                                00419000
004200         OR RPRPTS-051HOLDPRODCODE IS NOT EQUAL TO                00420000
004210             WS-51LASTPRODCODE2                                   00421000
004220         OR RPRPTS-051HOLDINST IS NOT EQUAL TO WS-51LASTINST2     00422000
004230         OR RPRPTS-051HOLDACCOUNT IS NOT EQUAL TO WS-51LASTACCT2  00423000
004240         MOVE SPACES TO WS-EDITEDACCOUNT                          00424000
004250         MOVE RPRPTS-051HOLDINST TO P4-INST                       00425000
004260         MOVE RPRPTS-051HOLDPRODCODE TO P4-PRODCODE               00426000
004270         MOVE RPRPTS-051HOLDPRODCODE TO RPW015-PRODCODE           00427000
004280         MOVE RPRPTS-051HOLDACCOUNT TO RPW015-ACCOUNT             00428000
004290         PERFORM EDIT-ACCOUNT                                     00429000
004300         MOVE RPW015-EDITEDACCOUNT TO P4-ACCOUNT                  00430000
004310         MOVE RPRPTS-051HOLDBRANCH TO P4-BRANCH                   00431000
004320         MOVE RPRPTS-051HOLDTYPE TO P4-TYPE                       00432000
004330         MOVE RPRPTS-051SCOPT TO P4-SCOPT                         00433000
004340         MOVE RPRPTS-051RTOPT TO P4-RATEOPT                       00434000
004350         MOVE RPRPTS-NAME TO WS-CUST-NAME                         00435000
004360         MOVE RPRPTS-MODEL TO WS-MODEL                            00436000
004370         IF RPRPTS-051ERRORMSG IS NOT EQUAL TO SPACES             00437000
004380             MOVE RPRPTS-051ERRORMSG TO P4-MSG                    00438000
004390             MOVE RPRPTS-051ERRORNBR TO P4-MSGNBR.                00439000
004400     IF WS-REC-COUNT IS EQUAL TO 2                                00440000
004410         AND RPRPTS-051HOLDPRODCODE                               00441000
004420             IS EQUAL TO WS-51LASTPRODCODE2                       00442000
004430         AND RPRPTS-051HOLDINST IS EQUAL TO WS-51LASTINST2        00443000
004440         AND RPRPTS-051HOLDACCOUNT IS EQUAL TO WS-51LASTACCT2     00444000
004450         MOVE WS-CUST-NAME TO P5-CUSTNAME                         00445000
004460         MOVE WS-MODEL TO P5-MODEL                                00446000
004470         IF RPRPTS-051ERRORMSG IS NOT EQUAL TO SPACES             00447000
004480             MOVE RPRPTS-051ERRORMSG TO P4-MSG                    00448000
004490             MOVE RPRPTS-051ERRORNBR TO P4-MSGNBR.                00449000
004500     IF WS-REC-COUNT IS GREATER THAN 2                            00450000
004510         AND RPRPTS-051HOLDPRODCODE                               00451000
004520             IS EQUAL TO WS-51LASTPRODCODE2                       00452000
004530         AND RPRPTS-051HOLDINST IS EQUAL TO WS-51LASTINST2        00453000
004540         AND RPRPTS-051HOLDACCOUNT IS EQUAL TO WS-51LASTACCT2     00454000
004550         IF RPRPTS-051ERRORMSG IS NOT EQUAL TO SPACES             00455000
004560             MOVE RPRPTS-051ERRORMSG TO P4-MSG                    00456000
004570             MOVE RPRPTS-051ERRORNBR TO P4-MSGNBR.                00457000
004580 RR-PRINT.                                                        00458000
004590     MOVE RPRPTS-051BALTYPE TO P4-BALTYPE.                        00459000
004600     MOVE RPRPTS-051ACCTBAL TO P4-ACCTBAL.                        00460000
004610     MOVE RPRPTS-051REQDBAL TO P4-ACCTBALREQ.                     00461000
004620     MOVE RPRPTS-PRODCODE TO WS-51LASTPRODCODE1.                  00462000
004630     MOVE RPRPTS-ACCOUNT TO WS-51LASTACCT1.                       00463000
004640     MOVE RPRPTS-MODEL TO WS-51LASTMODEL.                         00464000
004650     MOVE RPRPTS-051HOLDPRODCODE TO WS-51LASTPRODCODE2.           00465000
004660     MOVE RPRPTS-051HOLDINST TO WS-51LASTINST2.                   00466000
004670     MOVE RPRPTS-051HOLDACCOUNT TO WS-51LASTACCT2.                00467000
004680     MOVE RPRPTS-INST TO WS-51LASTINST1.                          00468000
004690     PERFORM PR-01 THRU PR-EXIT.                                  00469000
004700     MOVE SPACES TO PLINE1.                                       00470000
004710     ADD RPRPTS-051NUMOFREL TO WS-NUMOFREL.                       00471000
004720     ADD RPRPTS-051NUMOFRELNOTQUAL TO WS-NUMOFRELNOTQUAL.         00472000
004730     ADD RPRPTS-051NUMOFACTIVE TO WS-NUMOFACTIVE.                 00473000
004740     ADD RPRPTS-051NUMOFINACTIVE TO WS-NUMOFINACTIVE.             00474000
004750     ADD RPRPTS-051NUMOFEXPIRED TO WS-NUMOFEXPIRED.               00475000
004760     ADD RPRPTS-051NUMOFEXPTODAY TO WS-NUMOFEXPTODAY.             00476000
004770     ADD RPRPTS-051NUMOFRELDEL TO WS-NUMOFRELDEL.                 00477000
004780     ADD RPRPTS-051NUMOFACCTDEL TO WS-NUMOFACCTDEL.               00478000
004790     ADD RPRPTS-051NUMOFFAILED TO WS-NUMOFFAILED.                 00479000
004800     ADD RPRPTS-051NUMOFSUCCESS TO WS-NUMOFSUCCESS.               00480000
004810 RR-EXIT.                                                         00481000
004820     GO TO END-ROUTINE.                                           00482000
004830******************************************************************00483000
004840 R4-HEADCHECK SECTION.                                            00484000
004850 R4-HEADSTART.                                                    00485000
004860     IF LS-HEADSW IS NOT EQUAL TO SPACE                           00486000
004870         MOVE SPACE TO LS-HEADSW                                  00487000
004880         GO TO R4-HEADPRT.                                        00488000
004890     IF (SR-LINES + 4) IS NOT GREATER THAN SR-PAGE                00489000
004900         GO TO R4-HEADEXIT.                                       00490000
004910 R4-HEADPRT.                                                      00491000
004920     MOVE 'Y' TO WS-HEADSW.                                       00492000
004930     ADD +1 TO SR-PGCTR.                                          00493000
004940     PERFORM HEADING-ROUTINE.                                     00494000
004950     MOVE WS-HEAD01 TO PLINE1.                                    00495000
004960     PERFORM PR-01 THRU PR-EXIT.                                  00496000
004970     MOVE WS-HEAD02 TO PLINE1.                                    00497000
004980     PERFORM PR-01 THRU PR-EXIT.                                  00498000
004990     MOVE WS-HEAD03 TO PLINE1.                                    00499000
005000     PERFORM PR-02 THRU PR-EXIT.                                  00500000
005010 R4-HEADEXIT.                                                     00501000
005020     EXIT.                                                        00502000
005030******************************************************************00503000
005040 PRINT-TOTALS SECTION.                                            00504000
005050 PT-START.                                                        00505000
005060     IF WS-CUSTLINESW IS EQUAL TO 'Y'                             00506000
005070         IF (SR-LINES + 2) IS GREATER THAN SR-PAGE                00507000
005080             ADD +1 TO SR-PGCTR                                   00508000
005090             PERFORM HEADING-ROUTINE                              00509000
005100             MOVE WS-CUST-NAME TO P5-CUSTNAME                     00510000
005110             MOVE WS-MODEL TO P5-MODEL                            00511000
005120             PERFORM PR-01 THRU PR-EXIT                           00512000
005130             MOVE SPACES TO PLINE1                                00513000
005140             PERFORM PR-01 THRU PR-EXIT                           00514000
005150         ELSE                                                     00515000
005160             MOVE WS-CUST-NAME TO P5-CUSTNAME                     00516000
005170             MOVE WS-MODEL TO P5-MODEL                            00517000
005180             PERFORM PR-01 THRU PR-EXIT                           00518000
005190             MOVE SPACES TO PLINE1                                00519000
005200             PERFORM PR-01 THRU PR-EXIT.                          00520000
005210     IF (SR-LINES + 5) IS GREATER THAN SR-PAGE                    00521000
005220         ADD +1 TO SR-PGCTR                                       00522000
005230         PERFORM HEADING-ROUTINE.                                 00523000
005240     MOVE SPACES TO PLINE1.                                       00524000
005250     PERFORM PR-01 THRU PR-EXIT.                                  00525000
005260     MOVE WS-51LASTINST1 TO WS-T1INST.                            00526000
005270     MOVE WS-NUMOFREL TO WS-T1REL.                                00527000
005280     MOVE WS-NUMOFRELNOTQUAL TO WS-T1RELNOTQUAL.                  00528000
005290     MOVE WS-TOTAL1 TO PLINE1.                                    00529000
005300     PERFORM PR-01 THRU PR-EXIT.                                  00530000
005310     MOVE WS-NUMOFSUCCESS TO WS-T2SUCCESS.                        00531000
005320     MOVE WS-NUMOFFAILED TO WS-T2FAILED.                          00532000
005330     MOVE WS-TOTAL2 TO PLINE1.                                    00533000
005340     PERFORM PR-01 THRU PR-EXIT.                                  00534000
005350     MOVE WS-NUMOFACTIVE TO WS-T3ACTIVE.                          00535000
005360     MOVE WS-NUMOFINACTIVE TO WS-T3INACTIVE.                      00536000
005370     MOVE WS-TOTAL3 TO PLINE1.                                    00537000
005380     PERFORM PR-01 THRU PR-EXIT.                                  00538000
005390     MOVE WS-NUMOFEXPIRED TO WS-T4EXPIRED.                        00539000
005400     MOVE WS-NUMOFEXPTODAY TO WS-T4EXPTODAY.                      00540000
005410     MOVE WS-TOTAL4 TO PLINE1.                                    00541000
005420     PERFORM PR-01 THRU PR-EXIT.                                  00542000
005430     MOVE WS-NUMOFRELDEL TO WS-T5RELDEL.                          00543000
005440     MOVE WS-NUMOFACCTDEL TO WS-T5ACCTDEL.                        00544000
005450     MOVE WS-TOTAL5 TO PLINE1.                                    00545000
005460     PERFORM PR-01 THRU PR-EXIT.                                  00546000
005470     MOVE ZEROS TO WS-NUMOFREL.                                   00547000
005480     MOVE ZEROS TO WS-NUMOFRELNOTQUAL.                            00548000
005490     MOVE ZEROS TO WS-NUMOFACTIVE.                                00549000
005500     MOVE ZEROS TO WS-NUMOFINACTIVE.                              00550000
005510     MOVE ZEROS TO WS-NUMOFSUCCESS.                               00551000
005520     MOVE ZEROS TO WS-NUMOFFAILED.                                00552000
005530     MOVE ZEROS TO WS-NUMOFEXPTODAY.                              00553000
005540     MOVE ZEROS TO WS-NUMOFEXPIRED.                               00554000
005550     MOVE ZEROS TO WS-NUMOFRELDEL.                                00555000
005560     MOVE ZEROS TO WS-NUMOFACCTDEL.                               00556000
005570 PT-EXIT.                                                         00557000
005580     EXIT.                                                        00558000
005590******************************************************************00559000
005600 MIC-MST-API SECTION.                                             00560000
000000 COPY MIPMSTA.                                                    00561000
005620******************************************************************00562000
005630 CHANGE-ACCOUNT SECTION.                                          00563000
005640 CA-START.                                                        00564000
005650 CA-EXIT.                                                         00565000
005660     EXIT.                                                        00566000
005670******************************************************************00567000
005680 PRINTER-ROUTINE SECTION.                                         00568000
000000 COPY SRP041.                                                     00569000
005700******************************************************************00570000
005710 CALENDAR-365 SECTION.                                            00571000
000000 COPY SRP003.                                                     00572000
005730******************************************************************00573000
005740 CONVERT-8-TO-6 SECTION.                                          00574000
000000 COPY SRP012.                                                     00575000
005760******************************************************************00576000
005770 ACCOUNT-EDIT SECTION.                                            00577000
000000 COPY SRP033.                                                     00578000
005790******************************************************************00579000
005800 HEADING-ROUTINE SECTION.                                         00580000
000000 COPY SRP016.                                                     00581000
005820******************************************************************00582000
005830 LOAD-RPS-2023 SECTION.                                           00583000
000000 COPY RPP2023.                                                    00584000
005850******************************************************************00585000
005860 SEARCH-RPS-2023 SECTION.                                         00586000
000000 COPY RPP2023S.                                                   00587000
005880******************************************************************00588000
005890 EDIT-ACCOUNT SECTION.                                            00589000
000000 COPY RPP015.                                                     00590000
005910******************************************************************00591000
005920 END-ROUTINE SECTION.                                             00592000
005930 ER-START.                                                        00593000
005940     GOBACK.                                                      00594000
005950******************************************************************00595000
