000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPG056.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPG056 - EXTERNAL ENROLLMENT REPORT                         *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  WS-MIM1006KEY.                                               00012000
000130     03  WS-MIM1006APPL          PIC 9(02).                       00013000
000140     03  WS-MIM1006FORM          PIC 9(03).                       00014000
000150     03  WS-MIM1006ERR           PIC 9(03).                       00015000
000160 01  SRW000-AREAS.                                                00016000
000000 COPY SRW000.                                                     00017000
000180 01  MIMST-RECORD.                                                00018000
000000 COPY MISMST.                                                     00019000
000200 01  MIWMSTA-AREAS.                                               00020000
000000 COPY MIWMSTA.                                                    00021000
000220 01  MIWPRI-AREAS.                                                00022000
000000 COPY MIWPRI.                                                     00023000
000240 01  MI1006-RECORD.                                               00024000
000000 COPY MIS1006A.                                                   00025000
000260 01  MI2023-RECORD.                                               00026000
000000 COPY MIS2023A.                                                   00027000
000280 01  SRW105-AREAS.                                                00028000
000000 COPY SRW105.                                                     00029000
000300*01  BICPBPRM.                                                    00030000
000000 COPY BICPBPRM.                                                   00031000
000320*01  BICRSRB.                                                     00032000
000000 COPY BICRSRB.                                                    00033000
000340*01  BICRPSB.                                                     00034000
000000 COPY BICRPSB.                                                    00035000
000360*01  BICRVERB.                                                    00036000
000000 COPY BICRVERB.                                                   00037000
000380*01  BICRSTAT.                                                    00038000
000000 COPY BICRSTAT.                                                   00039000
000400*01  BICRDBS.                                                     00040000
000000 COPY BICRDBS.                                                    00041000
000420*01  BICRLOG.                                                     00042000
000000 COPY BICRLOG.                                                    00043000
000440 01  MIC-RLSELIT.                                                 00044000
000000 COPY MIWRLSE.                                                    00045000
000460 01  RPW015-AREAS.                                                00046000
000000 COPY RPW015.                                                     00047000
000480 01  WS-RPMIM2023AREAS.                                           00048000
000000 COPY RPW2023.                                                    00049000
000500*----------------------------------------------------------------*00050000
000510 01  PRINTERREC.                                                  00051000
000000 COPY SRW016.                                                     00052000
000530     03  PLINE4          REDEFINES PLINE1.                        00053000
000540         05  P4-PRIMPRODCD       PIC X(06).                       00054000
000550         05  FILLER              PIC X(01).                       00055000
000560         05  P4-PRIMACCT         PIC X(22).                       00056000
000570         05  FILLER              PIC X(01).                       00057000
000580         05  P4-PRIMMODEL        PIC X(10).                       00058000
000590         05  FILLER              PIC X(01).                       00059000
000600         05  P4-PRIMBRANCH       PIC X(05).                       00060000
000610         05  FILLER              PIC X(01).                       00061000
000620         05  P4-PRIMTYPE         PIC X(03).                       00062000
000630         05  FILLER              PIC X(01).                       00063000
000640         05  P4-SECINST          PIC X(04).                       00064000
000650         05  FILLER              PIC X(01).                       00065000
000660         05  P4-SECPRODCD        PIC X(06).                       00066000
000670         05  FILLER              PIC X(01).                       00067000
000680         05  P4-SECBRANCH        PIC X(05).                       00068000
000690         05  FILLER              PIC X(01).                       00069000
000700         05  P4-SECTYPE          PIC X(03).                       00070000
000710         05  FILLER              PIC X(01).                       00071000
000720         05  P4-SECACCT          PIC X(18).                       00072000
000730         05  FILLER              PIC X(02).                       00073000
000740         05  P4-ERRORMSG         PIC X(35).                       00074000
000750         05  FILLER              PIC X(01).                       00075000
000760         05  P4-ERRORNBR         PIC 9(03).                       00076000
000770     03  PLINE5          REDEFINES   PLINE1.                      00077000
000780         05  P5-CUSTNAME         PIC X(40).                       00078000
000790         05  FILLER              PIC X(92).                       00079000
000800*----------------------------------------------------------------*00080000
000810 01  WS-SRW033.                                                   00081000
000000 COPY SRW033.                                                     00082000
000830*----------------------------------------------------------------*00083000
000840*    SUBSCRIPT USAGE                                             *00084000
000850*        WS-SUB1 - POINTER FOR LS-PRINTLINES.                    *00085000
000860*        WS-SUB2 - ROUTINE POINTER FOR RETURN.                   *00086000
000870*        WS-SUB3 - WORK SUBSCRIPT.                               *00087000
000880*        WS-SUB4 - WORK SUBSCRIPT.                               *00088000
000890*----------------------------------------------------------------*00089000
000900 01  WS-SUBSCRIPTS.                                               00090000
000910     03  WS-SUB1                 PIC S9(04)      COMP             00091000
000920                                                 VALUE ZERO.      00092000
000930     03  WS-SUB2                 PIC S9(04)      COMP             00093000
000940                                                 VALUE ZERO.      00094000
000950     03  WS-SUB3                 PIC S9(04)      COMP             00095000
000960                                                 VALUE ZERO.      00096000
000970     03  WS-SUB4                 PIC S9(04)      COMP             00097000
000980                                                 VALUE ZERO.      00098000
000990*----------------------------------------------------------------*00099000
001000 01  WS-HEADINGS.                                                 00100000
001010     03  FILLER                  PIC X(19)       VALUE            00101000
001020         '*** WS-HEADINGS ***'.                                   00102000
001030     03  WS-HEAD01.                                               00103000
001040         05  FILLER              PIC X(44)       VALUE            00104000
001050             '*-------------- PRIMARY KEY DATA -----------'.      00105000
001060         05  FILLER              PIC X(44)       VALUE            00106000
001070             '-----*                                      '.      00107000
001080         05  FILLER              PIC X(44)       VALUE            00108000
001090             '                                            '.      00109000
001100     03  WS-HEAD02.                                               00110000
001110         05  FILLER              PIC X(44)       VALUE            00111000
001120             'PRD CD            ACCOUNT NBR MODEL       BR'.      00112000
001130         05  FILLER              PIC X(44)       VALUE            00113000
001140             'CH TYP *--- SECONDARY ACCOUNT INFORMATION --'.      00114000
001150         05  FILLER              PIC X(44)       VALUE            00115000
001160             '--*  *----------- ERROR MESSAGE -----------*'.      00116000
001170     03  WS-HEAD03.                                               00117000
001180         05  FILLER              PIC X(44)       VALUE            00118000
001190             'CUSTOMER NAME                               '.      00119000
001200         05  FILLER              PIC X(44)       VALUE            00120000
001210             '       INST PRD CD  BRCH TYP     ACCOUNT NUM'.      00121000
001220         05  FILLER              PIC X(44)       VALUE            00122000
001230             'BER                                         '.      00123000
001240 01  WS-TOTALS.                                                   00124000
001250     03  FILLER                  PIC X(17)       VALUE            00125000
001260         '*** WS-TOTALS ***'.                                     00126000
001270     03  WS-TOTAL1.                                               00127000
001280         05  FILLER              PIC X(16)       VALUE            00128000
001290             '           INST '.                                  00129000
001300         05  WS-T1INST           PIC 9(04).                       00130000
001310         05  FILLER              PIC X(23)       VALUE            00131000
001320             '     SUCCESSFUL SETUPS '.                           00132000
001330         05  WS-T1SUCCESS        PIC ZZZ,ZZZ,ZZZ,ZZ9.             00133000
001340         05  FILLER              PIC X(74)       VALUE SPACES.    00134000
001350     03  WS-TOTAL2.                                               00135000
001360         05  FILLER              PIC X(20)       VALUE SPACES.    00136000
001370         05  FILLER              PIC X(23)       VALUE            00137000
001380             '         FAILED SETUPS '.                           00138000
001390         05  WS-T2FAILED         PIC ZZZ,ZZZ,ZZZ,ZZ9.             00139000
001400         05  FILLER              PIC X(74)       VALUE SPACES.    00140000
P0148      03  WS-TOTAL3.                                               00140100
P0148          05  FILLER              PIC X(20)       VALUE SPACES.    00140200
P0148          05  FILLER              PIC X(23)       VALUE            00140300
P0148              ' RELATIONSHIPS EXPIRED '.                           00140400
P0148          05  WS-T3EXPIRED        PIC ZZZ,ZZZ,ZZZ,ZZ9.             00140500
P0148          05  FILLER              PIC X(74)       VALUE SPACES.    00140600
001410*----------------------------------------------------------------*00141000
001420 01  WS-RPW001-AREAS.                                             00142000
000000 COPY RPW001.                                                     00143000
001440*----------------------------------------------------------------*00144000
001450 01  WS-STORAGE.                                                  00145000
001460     03  WS-HEADSW               PIC X(01)       VALUE SPACE.     00146000
001470     03  WS-FUNCTION             PIC X(01)       VALUE SPACE.     00147000
001480     03  WS-EDITEDACCOUNT.                                        00148000
001490         05  WS-EDITACCT         PIC X(22).                       00149000
001520     03  WS-CUST-NAME            PIC X(40)       VALUE SPACE.     00152000
001530     03  WS-EFTIMEX.                                              00153000
001540         05  WS-EFTIME           PIC 99B99B99.                    00154000
001550     03  WS-DATEIN               PIC 9(8).                        00155000
001560     03  FILLER          REDEFINES WS-DATEIN.                     00156000
001570         05  WS-DATEIN-YYYY      PIC X(04).                       00157000
001580         05  WS-DATEIN-MM        PIC X(02).                       00158000
001590         05  WS-DATEIN-DD        PIC X(02).                       00159000
001600     03  WS-DATEOUT.                                              00160000
001610         05  WS-DATEOUT-MM       PIC X(02).                       00161000
001620         05  FILLER              PIC X(01)       VALUE '/'.       00162000
001630         05  WS-DATEOUT-DD       PIC X(02).                       00163000
001640         05  FILLER              PIC X(01)       VALUE '/'.       00164000
001650         05  WS-DATEOUT-YYYY     PIC X(04).                       00165000
001660*----------------------------------------------------------------*00166000
001670     03  WS-REC-COUNT            PIC S9(04)      COMP.            00167000
001680     03  WS-SUCCESS-TOTAL        PIC S9(12)      COMP-3.          00168000
001690     03  WS-FAILED-TOTAL         PIC S9(12)      COMP-3.          00169000
P0148      03  WS-EXPIRED-TOTAL        PIC S9(12)      COMP-3.          00169500
001700     03  WS-056LASTINST          PIC S9(03)      COMP-3.          00170000
P0181      03  WS-056LASTACCT          PIC X(18).                       00171000
001720     03  WS-056LASTPRODCODE      PIC X(06).                       00172000
P0148      03  WS-056LASTMODEL         PIC X(10).                       00172500
P0181      03  WS-056LASTFAILED        PIC X(01).                       00172700
001730******************************************************************00173000
001740 LINKAGE SECTION.                                                 00174000
001750******************************************************************00175000
001760 01  LS-SRW015.                                                   00176000
000000 COPY SRW015.                                                     00177000
001780*----------------------------------------------------------------*00178000
001790 01  LS-SRW066.                                                   00179000
000000 COPY SRW066.                                                     00180000
001810*----------------------------------------------------------------*00181000
001820 01  LS-BANKREC.                                                  00182000
000000 COPY RPSBNK.                                                     00183000
001840*----------------------------------------------------------------*00184000
001850 01  LS-MASTREC.                                                  00185000
001860     03  LS-MAST                 PIC X(2000).                     00186000
001870*----------------------------------------------------------------*00187000
001880 01  LS-RPT3REC.                                                  00188000
000000 COPY RPSRPTS.                                                    00189000
001900     03  LSRPT3-KEY              PIC X(70).                       00190000
001910     03  LS-DSKEY        REDEFINES LSRPT3-KEY.                    00191000
001920         05  LS-DSFORMX          PIC X(02).                       00192000
001930         05  LS-DSSEPREPX        PIC X(01).                       00193000
001940         05  LS-DPHOLDCOX.                                        00194000
001950             07  LS-DPHOLDCO     PIC S9(03)      COMP-3.          00195000
001960         05  LS-DSINSTX.                                          00196000
001970             07  LS-DSINST       PIC S9(03)      COMP-3.          00197000
001980         05  LS-DSALTBRNBRX.                                      00198000
001990             07  LS-DSALTBRNBR   PIC S9(05)      COMP-3.          00199000
002000         05  LS-DSSPECX          PIC X(01).                       00200000
002010         05  LS-DSREGNBRX.                                        00201000
002020             07  LS-DSREGNBR     PIC S9(03)      COMP-3.          00202000
002030         05  LS-DPRPTNBRX.                                        00203000
002040             07  LS-DPRPTNBR     PIC S9(04)      COMP.            00204000
002050         05  LS-DSBRANCHX.                                        00205000
002060             07  LS-DSBRANCH     PIC S9(05)      COMP-3.          00206000
002070         05  LS-DSTYPEX.                                          00207000
002080             07  LS-DSTYPE       PIC S9(03)      COMP-3.          00208000
002090         05  LS-DSOFFX.                                           00209000
002100             07  LS-DSOFF        PIC X(09).                       00210000
002110         05  LS-DSCUSTX.                                          00211000
002120             07  LS-DSCUST       PIC X(10).                       00212000
002130         05  LS-DSACCTX.                                          00213000
002140             07  LS-DSACCT       PIC S9(18)      COMP-3.          00214000
002150         05  FILLER              PIC X(21).                       00215000
002160*----------------------------------------------------------------*00216000
002170 01  LS-LINKDATA.                                                 00217000
000000 COPY RPW003.                                                     00218000
002190*----------------------------------------------------------------*00219000
002200 01  LS-PRINTLINES.                                               00220000
002210     03  LS-PRTLINES.                                             00221000
002220         05  LS-PLENTRY                          OCCURS 0020.     00222000
002230             07  LS-PLCONT       PIC X(01).                       00223000
002240             07  LS-PLDATA       PIC X(132).                      00224000
002250     03  LS-PLSIZE               PIC S9(04)      COMP             00225000
002260                                                 VALUE +0020.     00226000
002270******************************************************************00227000
002280 PROCEDURE DIVISION                                               00228000
002290         USING                                                    00229000
002300         LS-SRW015                                                00230000
002310         LS-SRW066                                                00231000
002320         LS-BANKREC                                               00232000
002330         LS-MASTREC                                               00233000
002340         LS-RPT3REC                                               00234000
002350         LS-LINKDATA                                              00235000
002360         LS-PRINTLINES.                                           00236000
002370******************************************************************00237000
002380 CONTROL-ROUTINE SECTION.                                         00238000
002390 CR-START.                                                        00239000
002400     IF LS-CONTROL IS EQUAL TO SPACES                             00240000
002410         GO TO CR-EXIT.                                           00241000
002420     GO TO                                                        00242000
002430         TOTAL-ROUTINE                                            00243000
002440         TOTAL-ROUTINE                                            00244000
002450         TOTAL-ROUTINE                                            00245000
002460         TOTAL-ROUTINE                                            00246000
002470         TOTAL-ROUTINE                                            00247000
002480         TOTAL-ROUTINE                                            00248000
002490         TOTAL-ROUTINE                                            00249000
002500         TOTAL-ROUTINE                                            00250000
002510         TOTAL-ROUTINE                                            00251000
002520         REPORT-ROUTINE                                           00252000
002530         DEPENDING ON WS-SUB2.                                    00253000
002540 CR-EXIT.                                                         00254000
002550     GO TO INITIAL-ROUTINE.                                       00255000
002560******************************************************************00256000
002570 INITIAL-ROUTINE SECTION.                                         00257000
002580 IR-START.                                                        00258000
002590     IF LS-INITSW IS EQUAL TO SPACE                               00259000
002600         GO TO IR-EXIT.                                           00260000
002610     MOVE SPACE TO LS-INITSW.                                     00261000
002620     MOVE SPACE TO LS-HEADSW.                                     00262000
002630     MOVE SPACE TO WS-ACCTSW.                                     00263000
002640     MOVE +0 TO WS-056LASTINST.                                   00264000
P0181      MOVE SPACES TO WS-056LASTACCT.                               00265000
002660     MOVE SPACES TO WS-056LASTPRODCODE.                           00266000
P0181      MOVE SPACES TO WS-056LASTFAILED.                             00266500
002670     MOVE +0 TO WS-SUCCESS-TOTAL.                                 00267000
002680     MOVE +0 TO WS-FAILED-TOTAL.                                  00268000
P0148      MOVE +0 TO WS-EXPIRED-TOTAL.                                 00268500
002690     MOVE SPACES TO LS-PRTLINES.                                  00269000
002700     MOVE SPACES TO PLINE1.                                       00270000
002710     MOVE +900 TO SR-LINES.                                       00271000
002720     MOVE +0 TO SR-PGCTR.                                         00272000
002730     MOVE 'RELATIONSHIP PRICING' TO SR-SYSTEM.                    00273000
002740     MOVE 'EXTERNAL ENROLLMENT REPORT' TO SR-REPORT.              00274000
002750     MOVE 50056 TO SR-RPTNBR.                                     00275000
002760 IR-REC2023.                                                      00276000
002770     MOVE RPRPTS-INST TO WS-RPMIM2023INST.                        00277000
002780     PERFORM LOAD-RPS-2023.                                       00278000
002790 IR-EXIT.                                                         00279000
002800     GO TO TOTAL-ROUTINE.                                         00280000
002810******************************************************************00281000
002820 TOTAL-ROUTINE SECTION.                                           00282000
000000 COPY RPP001.                                                     00283000
002840******************************************************************00284000
002850 REPORT-ROUTINE SECTION.                                          00285000
002860 RR-START.                                                        00286000
002870     IF LS-TOTSW IS NOT EQUAL TO SPACE                            00287000
002880         MOVE SPACE TO LS-CONTROL                                 00288000
002890         GO TO RR-EXIT.                                           00289000
002900     IF LS-CONTROL IS NOT EQUAL TO SPACE                          00290000
002910         MOVE SPACE TO LS-CONTROL.                                00291000
002920 RR-HEADING.                                                      00292000
002930     MOVE +0 TO WS-SUB1.                                          00293000
002940     PERFORM R4-HEADCHECK.                                        00294000
002950 RR-IFCUST1.                                                      00295000
P0181      IF RPRPTS-SRTNUMBER IS EQUAL TO 1                            00296000
P0181          GO TO RR-CONT.                                           00296190
P0181      IF RPRPTS-ACCOUNT IS EQUAL TO WS-056LASTACCT                 00296380
P0181          AND RPRPTS-PRODCODE IS EQUAL TO WS-056LASTPRODCODE       00296570
P0181          AND RPRPTS-MODEL IS EQUAL TO WS-056LASTMODEL             00296760
P0181          AND WS-056LASTFAILED IS EQUAL TO 'Y'                     00296950
P0181          AND WS-REC-COUNT IS EQUAL TO 2                           00297140
P0181          GO TO RR-CONT.                                           00297330
P0181      IF RPRPTS-ACCOUNT IS EQUAL TO WS-056LASTACCT                 00297520
P0181          AND RPRPTS-PRODCODE IS EQUAL TO WS-056LASTPRODCODE       00297710
P0148          AND RPRPTS-MODEL IS EQUAL TO WS-056LASTMODEL             00298500
002990         GO TO RR-FINDTYPE.                                       00299000
P0181  RR-CONT.                                                         00305500
P0196      IF (RPRPTS-ACCOUNT IS NOT EQUAL TO WS-056LASTACCT            00305550
P0196          OR RPRPTS-PRODCODE IS NOT EQUAL TO WS-056LASTPRODCODE    00305600
P0196          OR RPRPTS-MODEL IS NOT EQUAL TO WS-056LASTMODEL)         00305650
P0196          AND WS-056LASTACCT IS NOT EQUAL TO SPACES                00305700
P0196          AND WS-REC-COUNT IS EQUAL TO 1                           00305750
P0196          MOVE 'N' TO WS-HEADSW                                    00305800
P0196          MOVE WS-CUST-NAME TO P5-CUSTNAME                         00305850
P0196          PERFORM PR-01 THRU PR-EXIT.                              00305900
003060     MOVE SPACES TO PLINE1.                                       00306000
003070     MOVE SPACES TO WS-CUST-NAME.                                 00307000
003080     MOVE 0 TO WS-REC-COUNT.                                      00308000
P0181      MOVE SPACES TO WS-056LASTFAILED.                             00308500
003090 RR-FINDTYPE.                                                     00309000
003100     ADD 1 TO WS-REC-COUNT.                                       00310000
003110     IF WS-REC-COUNT IS EQUAL TO 1                                00311000
003120         IF WS-HEADSW IS EQUAL TO 'Y'                             00312000
003130             MOVE 'N' TO WS-HEADSW                                00313000
003140         ELSE                                                     00314000
003150             MOVE SPACES TO PLINE1                                00315000
003160             PERFORM PR-01 THRU PR-EXIT.                          00316000
003170     IF WS-REC-COUNT IS EQUAL TO 1                                00317000
003180         MOVE SPACES TO WS-EDITEDACCOUNT                          00318000
003190         MOVE RPRPTS-PRODCODE TO RPW015-PRODCODE                  00319000
003200         MOVE RPRPTS-ACCOUNT TO RPW015-ACCOUNT                    00320000
003210         PERFORM EDIT-ACCOUNT                                     00321000
003220         MOVE RPW015-EDITEDACCOUNT TO P4-PRIMACCT                 00322000
003230         MOVE RPRPTS-PRODCODE TO P4-PRIMPRODCD                    00323000
003240         MOVE RPRPTS-MODEL TO P4-PRIMMODEL                        00324000
003250         MOVE RPRPTS-BRANCH TO P4-PRIMBRANCH                      00325000
003260         MOVE RPRPTS-TYPE TO P4-PRIMTYPE                          00326000
003270         MOVE RPRPTS-NAME TO WS-CUST-NAME                         00327000
P0148          IF RPRPTS-056EXPIRED IS EQUAL TO 'Y'                     00327100
P0148              ADD 1 TO WS-EXPIRED-TOTAL                            00327200
P0148              MOVE RPRPTS-056ERRORMSG TO P4-ERRORMSG               00327300
P0148              GO TO RR-PRINT.                                      00327400
P0148          IF RPRPTS-056ERRORMSG IS NOT EQUAL TO SPACES             00327500
P0181              AND WS-REC-COUNT IS EQUAL TO 1                       00327530
P0181              MOVE 'Y' TO WS-056LASTFAILED                         00327560
P0148              ADD 1 TO WS-FAILED-TOTAL                             00327600
P0148              MOVE RPRPTS-056ERRORMSG TO P4-ERRORMSG               00327700
P0148              GO TO RR-PRINT.                                      00327800
003280         IF RPRPTS-056ERRORMSG IS EQUAL TO SPACES                 00328000
P0148              AND WS-REC-COUNT IS EQUAL TO 1                       00329000
P0148              ADD 1 TO WS-SUCCESS-TOTAL.                           00329990
003340     IF WS-REC-COUNT IS EQUAL TO 2                                00334000
003350         MOVE RPRPTS-NAME TO P5-CUSTNAME                          00335000
003360         IF RPRPTS-056ERRORMSG IS NOT EQUAL TO SPACES             00336000
003370             MOVE RPRPTS-056ERRORMSG TO P4-ERRORMSG               00337000
003380             MOVE RPRPTS-056ERRORNBR TO P4-ERRORNBR               00338000
003390             GO TO RR-PRINT.                                      00339000
003400     MOVE RPRPTS-056SECINST TO P4-SECINST.                        00340000
003410     MOVE RPRPTS-056SECPRODCD TO P4-SECPRODCD.                    00341000
003420     MOVE RPRPTS-056SECBRANCH TO P4-SECBRANCH.                    00342000
003430     MOVE RPRPTS-056SECTYPE TO P4-SECTYPE.                        00343000
003440     MOVE RPRPTS-056SECACCT TO P4-SECACCT.                        00344000
003450 RR-PRINT.                                                        00345000
003460     MOVE RPRPTS-PRODCODE TO WS-056LASTPRODCODE.                  00346000
003470     MOVE RPRPTS-ACCOUNT TO WS-056LASTACCT.                       00347000
P0148      MOVE RPRPTS-MODEL TO WS-056LASTMODEL.                        00347500
003480     MOVE RPRPTS-INST TO WS-056LASTINST.                          00348000
003490     PERFORM PR-01 THRU PR-EXIT.                                  00349000
003500     MOVE SPACES TO PLINE1.                                       00350000
003510 RR-EXIT.                                                         00351000
003520     GO TO END-ROUTINE.                                           00352000
003530******************************************************************00353000
003540 R4-HEADCHECK SECTION.                                            00354000
003550 R4-HEADSTART.                                                    00355000
003560     IF LS-HEADSW IS NOT EQUAL TO SPACE                           00356000
003570         MOVE SPACE TO LS-HEADSW                                  00357000
003580         GO TO R4-HEADPRT.                                        00358000
003590     IF (SR-LINES + 4) IS NOT GREATER THAN SR-PAGE                00359000
003600         GO TO R4-HEADEXIT.                                       00360000
003610 R4-HEADPRT.                                                      00361000
003620     MOVE 'Y' TO WS-HEADSW.                                       00362000
003630     ADD +1 TO SR-PGCTR.                                          00363000
003640     PERFORM HEADING-ROUTINE.                                     00364000
003650     MOVE WS-HEAD01 TO PLINE1.                                    00365000
003660     PERFORM PR-01 THRU PR-EXIT.                                  00366000
003670     MOVE WS-HEAD02 TO PLINE1.                                    00367000
003680     PERFORM PR-01 THRU PR-EXIT.                                  00368000
003690     MOVE WS-HEAD03 TO PLINE1.                                    00369000
003700     PERFORM PR-02 THRU PR-EXIT.                                  00370000
003710 R4-HEADEXIT.                                                     00371000
003720     EXIT.                                                        00372000
003730******************************************************************00373000
003740 PRINT-TOTALS SECTION.                                            00374000
003750 PT-START.                                                        00375000
003760     IF WS-REC-COUNT IS EQUAL TO 1                                00376000
003770         MOVE WS-CUST-NAME TO P5-CUSTNAME                         00377000
003780         MOVE SPACES TO WS-CUST-NAME                              00378000
003790         PERFORM PR-01 THRU PR-EXIT.                              00379000
003800     IF (SR-LINES + 3) IS GREATER THAN SR-PAGE                    00380000
003810         ADD +1 TO SR-PGCTR                                       00381000
003820         PERFORM HEADING-ROUTINE.                                 00382000
003830     MOVE SPACES TO PLINE1.                                       00383000
003840     PERFORM PR-02 THRU PR-EXIT.                                  00384000
003850     MOVE WS-056LASTINST TO WS-T1INST.                            00385000
003860     MOVE WS-SUCCESS-TOTAL TO WS-T1SUCCESS.                       00386000
003870     MOVE WS-TOTAL1 TO PLINE1.                                    00387000
003880     PERFORM PR-01 THRU PR-EXIT.                                  00388000
003890     MOVE WS-FAILED-TOTAL TO WS-T2FAILED.                         00389000
003900     MOVE WS-TOTAL2 TO PLINE1.                                    00390000
003910     PERFORM PR-01 THRU PR-EXIT.                                  00391000
P0148      MOVE WS-EXPIRED-TOTAL TO WS-T3EXPIRED.                       00391200
P0148      MOVE WS-TOTAL3 TO PLINE1.                                    00391400
P0148      PERFORM PR-01 THRU PR-EXIT.                                  00391600
003920 PT-EXIT.                                                         00392000
003930     EXIT.                                                        00393000
003940******************************************************************00394000
003950 MIC-MST-API SECTION.                                             00395000
000000 COPY MIPMSTA.                                                    00396000
003970******************************************************************00397000
003980 CHANGE-ACCOUNT SECTION.                                          00398000
003990 CA-START.                                                        00399000
004000 CA-EXIT.                                                         00400000
004010     EXIT.                                                        00401000
004020******************************************************************00402000
004030 PRINTER-ROUTINE SECTION.                                         00403000
000000 COPY SRP041.                                                     00404000
004050******************************************************************00405000
004060 CALENDAR-365 SECTION.                                            00406000
000000 COPY SRP003.                                                     00407000
004080******************************************************************00408000
004090 CONVERT-8-TO-6 SECTION.                                          00409000
000000 COPY SRP012.                                                     00410000
004110******************************************************************00411000
004120 ACCOUNT-EDIT SECTION.                                            00412000
000000 COPY SRP033.                                                     00413000
004140******************************************************************00414000
004150 EDIT-CODASYL-DATE SECTION.                                       00415000
000000 COPY SRP087.                                                     00416000
004170******************************************************************00417000
004180 HEADING-ROUTINE SECTION.                                         00418000
000000 COPY SRP016.                                                     00419000
004200******************************************************************00420000
004210 LOAD-RPS-2023 SECTION.                                           00421000
000000 COPY RPP2023.                                                    00422000
004230******************************************************************00423000
004240 SEARCH-RPS-2023 SECTION.                                         00424000
000000 COPY RPP2023S.                                                   00425000
004260******************************************************************00426000
004270 EDIT-ACCOUNT SECTION.                                            00427000
000000 COPY RPP015.                                                     00428000
004290******************************************************************00429000
004300 END-ROUTINE SECTION.                                             00430000
004310 ER-START.                                                        00431000
004320     GOBACK.                                                      00432000
004330******************************************************************00433000
