000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPG053.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPG053 - DUPLICATE ACCOUNT INCENTIVE REPORT                 *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  WS-MIM1006KEY.                                               00012000
000130     03  WS-MIM1006APPL          PIC 9(02).                       00013000
000140     03  WS-MIM1006FORM          PIC 9(03).                       00014000
000150     03  WS-MIM1006ERR           PIC 9(03).                       00015000
000160 01  SRW000-AREAS.                                                00016000
000000 COPY SRW000.                                                     00017000
000180 01  MIMST-RECORD.                                                00018000
000000 COPY MISMST.                                                     00019000
000200 01  MIWMSTA-AREAS.                                               00020000
000000 COPY MIWMSTA.                                                    00021000
000220 01  MIWPRI-AREAS.                                                00022000
000000 COPY MIWPRI.                                                     00023000
000240 01  MI1006-RECORD.                                               00024000
000000 COPY MIS1006A.                                                   00025000
000260 01  MI2023-RECORD.                                               00026000
000000 COPY MIS2023A.                                                   00027000
000280 01  SRW105-AREAS.                                                00028000
000000 COPY SRW105.                                                     00029000
000300*01  BICPBPRM.                                                    00030000
000000 COPY BICPBPRM.                                                   00031000
000320*01  BICRSRB.                                                     00032000
000000 COPY BICRSRB.                                                    00033000
000340*01  BICRPSB.                                                     00034000
000000 COPY BICRPSB.                                                    00035000
000360*01  BICRVERB.                                                    00036000
000000 COPY BICRVERB.                                                   00037000
000380*01  BICRSTAT.                                                    00038000
000000 COPY BICRSTAT.                                                   00039000
000400*01  BICRDBS.                                                     00040000
000000 COPY BICRDBS.                                                    00041000
000420*01  BICRLOG.                                                     00042000
000000 COPY BICRLOG.                                                    00043000
000440 01  MIC-RLSELIT.                                                 00044000
000000 COPY MIWRLSE.                                                    00045000
000460 01  RPW015-AREAS.                                                00046000
000000 COPY RPW015.                                                     00047000
000480 01  WS-RPMIM2023AREAS.                                           00048000
000000 COPY RPW2023.                                                    00049000
000500*----------------------------------------------------------------*00050000
000510 01  PRINTERREC.                                                  00051000
000000 COPY SRW016.                                                     00052000
000530     03  PLINE4          REDEFINES   PLINE1.                      00053000
000540         05  P4-PRODCODE         PIC X(06).                       00054000
000550         05  FILLER              PIC X(02).                       00055000
000560         05  P4-ACCOUNT          PIC X(22).                       00056000
000570         05  FILLER              PIC X(02).                       00057000
000580         05  P4-MODEL            PIC X(10).                       00058000
000590         05  FILLER              PIC X(03).                       00059000
000600         05  P4-SCOPT            PIC X(01).                       00060000
000610         05  FILLER              PIC X(03).                       00061000
000620         05  P4-RATEOPT          PIC X(01).                       00062000
000630         05  FILLER              PIC X(04).                       00063000
000640         05  P4-PRIMINST         PIC X(04).                       00064000
000650         05  FILLER              PIC X(02).                       00065000
000660         05  P4-PRIMPRODCODE     PIC X(06).                       00066000
000670         05  FILLER              PIC X(02).                       00067000
000680         05  P4-PRIMACCOUNT      PIC X(22).                       00068000
000690         05  FILLER              PIC X(42).                       00069000
000700*----------------------------------------------------------------*00070000
000710 01  WS-SRW033.                                                   00071000
000000 COPY SRW033.                                                     00072000
000730*----------------------------------------------------------------*00073000
000740*    SUBSCRIPT USAGE                                             *00074000
000750*        WS-SUB1 - POINTER FOR LS-PRINTLINES.                    *00075000
000760*        WS-SUB2 - ROUTINE POINTER FOR RETURN.                   *00076000
000770*        WS-SUB3 - WORK SUBSCRIPT.                               *00077000
000780*        WS-SUB4 - WORK SUBSCRIPT.                               *00078000
000790*----------------------------------------------------------------*00079000
000800 01  WS-SUBSCRIPTS.                                               00080000
000810     03  WS-SUB1                 PIC S9(04)      COMP             00081000
000820                                                 VALUE ZERO.      00082000
000830     03  WS-SUB2                 PIC S9(04)      COMP             00083000
000840                                                 VALUE ZERO.      00084000
000850     03  WS-SUB3                 PIC S9(04)      COMP             00085000
000860                                                 VALUE ZERO.      00086000
000870     03  WS-SUB4                 PIC S9(04)      COMP             00087000
000880                                                 VALUE ZERO.      00088000
000890*----------------------------------------------------------------*00089000
000900 01  WS-HEADINGS.                                                 00090000
000910     03  FILLER                  PIC X(19)       VALUE            00091000
000920         '*** WS-HEADINGS ***'.                                   00092000
000930     03  WS-HEAD01.                                               00093000
000940         05  FILLER              PIC X(44)       VALUE            00094000
000950             '*--------- ACCOUNT ----------*              '.      00095000
000960         05  FILLER              PIC X(44)       VALUE            00096000
000970             ' SC RT    *--------- PRIMARY ACCOUNT -------'.      00097000
000980         05  FILLER              PIC X(44)       VALUE            00098000
000990             '-*                                          '.      00099000
001000     03  WS-HEAD02.                                               00100000
001010         05  FILLER              PIC X(44)       VALUE            00101000
001020             'PROD CD         ACCOUNT NUMBER  MODEL       '.      00102000
001030         05  FILLER              PIC X(44)       VALUE            00103000
001040             'OPT OPT   INST  PROD CD         ACCOUNT NUMB'.      00104000
001050         05  FILLER              PIC X(44)       VALUE            00105000
001060             'ER                                          '.      00106000
001070 01  WS-TOTALS.                                                   00107000
001080     03  FILLER                  PIC X(17)       VALUE            00108000
001090         '*** WS-TOTALS ***'.                                     00109000
001100     03  WS-TOTAL1.                                               00110000
001110         05  FILLER              PIC X(16)       VALUE            00111000
001120             '           INST '.                                  00112000
001130         05  WS-T1INST           PIC 9(04).                       00113000
001140         05  FILLER              PIC X(33)       VALUE            00114000
001150             '       DUPLICATE ACCOUNT RECORDS '.                 00115000
001160         05  WS-T1DUPREC         PIC ZZZ,ZZZ,ZZZ,ZZ9.             00116000
001170         05  FILLER              PIC X(64)       VALUE SPACES.    00117000
001180*----------------------------------------------------------------*00118000
001190 01  WS-RPW001-AREAS.                                             00119000
000000 COPY RPW001.                                                     00120000
001210******************************************************************00121000
001220 01  WS-STORAGE.                                                  00122000
001230     03  WS-HEADSW               PIC X(01)       VALUE SPACE.     00123000
001240     03  WS-FUNCTION             PIC X(01)       VALUE SPACE.     00124000
001250     03  WS-EDITEDACCOUNT.                                        00125000
001260         05  WS-EDITACCT         PIC X(22).                       00126000
001270     03  WS-EFTIMEX.                                              00127000
001280         05  WS-EFTIME           PIC 99B99B99.                    00128000
001290     03  WS-DATEIN               PIC 9(8).                        00129000
001300     03  FILLER          REDEFINES WS-DATEIN.                     00130000
001310         05  WS-DATEIN-YYYY      PIC X(04).                       00131000
001320         05  WS-DATEIN-MM        PIC X(02).                       00132000
001330         05  WS-DATEIN-DD        PIC X(02).                       00133000
001340     03  WS-DATEOUT.                                              00134000
001350         05  WS-DATEOUT-MM       PIC X(02).                       00135000
001360         05  FILLER              PIC X(01)       VALUE '/'.       00136000
001370         05  WS-DATEOUT-DD       PIC X(02).                       00137000
001380         05  FILLER              PIC X(01)       VALUE '/'.       00138000
001390         05  WS-DATEOUT-YYYY     PIC X(04).                       00139000
001400*----------------------------------------------------------------*00140000
001410     03  WS-REC-COUNT            PIC S9(04)      COMP.            00141000
001420     03  WS-53LASTINST           PIC S9(03)      COMP-3.          00142000
001430     03  WS-EDITED-DATE.                                          00143000
001440         05  FILLER              PIC X(02).                       00144000
001450         05  WS-DATE-SLASH-1     PIC X.                           00145000
001460         05  FILLER              PIC X(02).                       00146000
001470         05  WS-DATE-SLASH-2     PIC X.                           00147000
001480         05  FILLER              PIC X(02).                       00148000
001490     03  WS-DATE-EDIT-AREA                                        00149000
001500                         REDEFINES WS-EDITED-DATE                 00150000
001510                                 PIC 99,99,99.                    00151000
001520     03  WS-NUMOFACTREC          PIC S9(05)      COMP-3           00152000
001530                                                 VALUE ZEROS.     00153000
001540     03  WS-NUMOFDUPREC          PIC S9(05)      COMP-3           00154000
001550                                                 VALUE ZEROS.     00155000
001560******************************************************************00156000
001570 LINKAGE SECTION.                                                 00157000
001580******************************************************************00158000
001590 01  LS-SRW015.                                                   00159000
000000 COPY SRW015.                                                     00160000
001610*----------------------------------------------------------------*00161000
001620 01  LS-SRW066.                                                   00162000
000000 COPY SRW066.                                                     00163000
001640*----------------------------------------------------------------*00164000
001650 01  LS-BANKREC.                                                  00165000
000000 COPY RPSBNK.                                                     00166000
001670*----------------------------------------------------------------*00167000
001680 01  LS-MASTREC.                                                  00168000
001690     03  LS-MAST                 PIC X(2000).                     00169000
001700*----------------------------------------------------------------*00170000
001710 01  LS-RPT3REC.                                                  00171000
000000 COPY RPSRPTS.                                                    00172000
001730     03  LSRPT3-KEY              PIC X(70).                       00173000
001740     03  LS-DSKEY        REDEFINES LSRPT3-KEY.                    00174000
001750         05  LS-DSFORMX          PIC X(02).                       00175000
001760         05  LS-DSSEPREPX        PIC X(01).                       00176000
001770         05  LS-DPHOLDCOX.                                        00177000
001780             07  LS-DPHOLDCO     PIC S9(03)      COMP-3.          00178000
001790         05  LS-DSINSTX.                                          00179000
001800             07  LS-DSINST       PIC S9(03)      COMP-3.          00180000
001810         05  LS-DSALTBRNBRX.                                      00181000
001820             07  LS-DSALTBRNBR   PIC S9(05)      COMP-3.          00182000
001830         05  LS-DSSPECX          PIC X(01).                       00183000
001840         05  LS-DSREGNBRX.                                        00184000
001850             07  LS-DSREGNBR     PIC S9(03)      COMP-3.          00185000
001860         05  LS-DPRPTNBRX.                                        00186000
001870             07  LS-DPRPTNBR     PIC S9(04)      COMP.            00187000
001880         05  LS-DSBRANCHX.                                        00188000
001890             07  LS-DSBRANCH     PIC S9(05)      COMP-3.          00189000
001900         05  LS-DSTYPEX.                                          00190000
001910             07  LS-DSTYPE       PIC S9(03)      COMP-3.          00191000
001920         05  LS-DSOFFX.                                           00192000
001930             07  LS-DSOFF        PIC X(09).                       00193000
001940         05  LS-DSCUSTX.                                          00194000
001950             07  LS-DSCUST       PIC X(10).                       00195000
001960         05  LS-DSACCTX.                                          00196000
001970             07  LS-DSACCT       PIC S9(18)      COMP-3.          00197000
001980         05  FILLER              PIC X(21).                       00198000
001990*----------------------------------------------------------------*00199000
002000 01  LS-LINKDATA.                                                 00200000
000000 COPY RPW003.                                                     00201000
002020*----------------------------------------------------------------*00202000
002030 01  LS-PRINTLINES.                                               00203000
002040     03  LS-PRTLINES.                                             00204000
002050         05  LS-PLENTRY                          OCCURS 0020.     00205000
002060             07  LS-PLCONT       PIC X(01).                       00206000
002070             07  LS-PLDATA       PIC X(132).                      00207000
002080     03  LS-PLSIZE               PIC S9(04)      COMP             00208000
002090                                                 VALUE +0020.     00209000
002100******************************************************************00210000
002110 PROCEDURE DIVISION                                               00211000
002120         USING                                                    00212000
002130         LS-SRW015                                                00213000
002140         LS-SRW066                                                00214000
002150         LS-BANKREC                                               00215000
002160         LS-MASTREC                                               00216000
002170         LS-RPT3REC                                               00217000
002180         LS-LINKDATA                                              00218000
002190         LS-PRINTLINES.                                           00219000
002200******************************************************************00220000
002210 CONTROL-ROUTINE SECTION.                                         00221000
002220 CR-START.                                                        00222000
002230     IF LS-CONTROL IS EQUAL TO SPACES                             00223000
002240         GO TO CR-EXIT.                                           00224000
002250     GO TO                                                        00225000
002260         TOTAL-ROUTINE                                            00226000
002270         TOTAL-ROUTINE                                            00227000
002280         TOTAL-ROUTINE                                            00228000
002290         TOTAL-ROUTINE                                            00229000
002300         TOTAL-ROUTINE                                            00230000
002310         TOTAL-ROUTINE                                            00231000
002320         TOTAL-ROUTINE                                            00232000
002330         TOTAL-ROUTINE                                            00233000
002340         TOTAL-ROUTINE                                            00234000
002350         REPORT-ROUTINE                                           00235000
002360         DEPENDING ON WS-SUB2.                                    00236000
002370 CR-EXIT.                                                         00237000
002380     GO TO INITIAL-ROUTINE.                                       00238000
002390******************************************************************00239000
002400 INITIAL-ROUTINE SECTION.                                         00240000
002410 IR-START.                                                        00241000
002420     IF LS-INITSW IS EQUAL TO SPACE                               00242000
002430         GO TO IR-EXIT.                                           00243000
002440     MOVE SPACE TO LS-INITSW.                                     00244000
002450     MOVE SPACE TO LS-HEADSW.                                     00245000
002460     MOVE SPACE TO WS-ACCTSW.                                     00246000
002470     MOVE +0 TO WS-53LASTINST.                                    00247000
002480     MOVE SPACES TO LS-PRTLINES.                                  00248000
002490     MOVE SPACES TO PLINE1.                                       00249000
002500     MOVE +900 TO SR-LINES.                                       00250000
002510     MOVE +0 TO SR-PGCTR.                                         00251000
002520     MOVE 'RELATIONSHIP PRICING' TO SR-SYSTEM.                    00252000
002530     MOVE 'DUPLICATE ACCOUNT INCENTIVE REPORT' TO SR-REPORT.      00253000
002540     MOVE 50053 TO SR-RPTNBR.                                     00254000
002550 IR-REC2023.                                                      00255000
002560     MOVE RPRPTS-INST TO WS-RPMIM2023INST.                        00256000
002570     PERFORM LOAD-RPS-2023.                                       00257000
002580 IR-EXIT.                                                         00258000
002590     GO TO TOTAL-ROUTINE.                                         00259000
002600******************************************************************00260000
002610 TOTAL-ROUTINE SECTION.                                           00261000
000000 COPY RPP001.                                                     00262000
002630******************************************************************00263000
002640 REPORT-ROUTINE SECTION.                                          00264000
002650 RR-START.                                                        00265000
002660     IF LS-TOTSW IS NOT EQUAL TO SPACE                            00266000
002670         MOVE SPACE TO LS-CONTROL                                 00267000
002680         GO TO RR-EXIT.                                           00268000
002690     IF LS-CONTROL IS NOT EQUAL TO SPACE                          00269000
002700         MOVE SPACE TO LS-CONTROL.                                00270000
002710 RR-HEADING.                                                      00271000
002720     MOVE +0 TO WS-SUB1.                                          00272000
002730     PERFORM R4-HEADCHECK.                                        00273000
002740     MOVE SPACES TO PLINE1.                                       00274000
002750     MOVE SPACES TO WS-EDITEDACCOUNT.                             00275000
002760     MOVE RPRPTS-PRODCODE TO P4-PRODCODE.                         00276000
002770     MOVE RPRPTS-PRODCODE TO RPW015-PRODCODE.                     00277000
002780     MOVE RPRPTS-ACCOUNT TO RPW015-ACCOUNT.                       00278000
002790     PERFORM EDIT-ACCOUNT.                                        00279000
002800     MOVE RPW015-EDITEDACCOUNT TO P4-ACCOUNT.                     00280000
002810     MOVE RPRPTS-053SCOPTION TO P4-SCOPT.                         00281000
002820     MOVE RPRPTS-053RTOPTION TO P4-RATEOPT.                       00282000
002830     MOVE RPRPTS-053PRIMINST TO P4-PRIMINST.                      00283000
002840     MOVE RPRPTS-053PRIMPRCD TO P4-PRIMPRODCODE.                  00284000
002850     MOVE RPRPTS-053PRIMPRCD TO RPW015-PRODCODE.                  00285000
002860     MOVE RPRPTS-053PRIMACCT TO RPW015-ACCOUNT.                   00286000
002870     PERFORM EDIT-ACCOUNT.                                        00287000
002880     MOVE RPW015-EDITEDACCOUNT TO P4-PRIMACCOUNT.                 00288000
002890     PERFORM PR-01 THRU PR-EXIT.                                  00289000
002900     MOVE RPRPTS-INST TO WS-53LASTINST.                           00290000
002910     MOVE SPACES TO PLINE1.                                       00291000
002920     ADD +1 TO WS-NUMOFDUPREC.                                    00292000
002930 RR-EXIT.                                                         00293000
002940     GO TO END-ROUTINE.                                           00294000
002950******************************************************************00295000
002960 R4-HEADCHECK SECTION.                                            00296000
002970 R4-HEADSTART.                                                    00297000
002980     IF LS-HEADSW IS NOT EQUAL TO SPACE                           00298000
002990         MOVE SPACE TO LS-HEADSW                                  00299000
003000         GO TO R4-HEADPRT.                                        00300000
003010     IF (SR-LINES + 4) IS NOT GREATER THAN SR-PAGE                00301000
003020         GO TO R4-HEADEXIT.                                       00302000
003030 R4-HEADPRT.                                                      00303000
003040     ADD +1 TO SR-PGCTR.                                          00304000
003050     PERFORM HEADING-ROUTINE.                                     00305000
003060     MOVE WS-HEAD01 TO PLINE1.                                    00306000
003070     PERFORM PR-01 THRU PR-EXIT.                                  00307000
003080     MOVE WS-HEAD02 TO PLINE1.                                    00308000
003090     PERFORM PR-02 THRU PR-EXIT.                                  00309000
003100 R4-HEADEXIT.                                                     00310000
003110     EXIT.                                                        00311000
003120******************************************************************00312000
003130 PRINT-TOTALS SECTION.                                            00313000
003140 PT-START.                                                        00314000
003150     IF (SR-LINES + 5) IS GREATER THAN SR-PAGE                    00315000
003160         ADD +1 TO SR-PGCTR                                       00316000
003170         PERFORM HEADING-ROUTINE.                                 00317000
003180     MOVE SPACES TO PLINE1.                                       00318000
003190     PERFORM PR-01 THRU PR-EXIT.                                  00319000
003200     MOVE WS-53LASTINST TO WS-T1INST.                             00320000
003210     MOVE WS-NUMOFDUPREC TO WS-T1DUPREC.                          00321000
003220     MOVE WS-TOTAL1 TO PLINE1.                                    00322000
003230     PERFORM PR-01 THRU PR-EXIT.                                  00323000
003240     MOVE ZEROS TO WS-NUMOFDUPREC.                                00324000
003250 PT-EXIT.                                                         00325000
003260     EXIT.                                                        00326000
003270******************************************************************00327000
003280 MIC-MST-API SECTION.                                             00328000
000000 COPY MIPMSTA.                                                    00329000
003300******************************************************************00330000
003310 CHANGE-ACCOUNT SECTION.                                          00331000
003320 CA-START.                                                        00332000
003330 CA-EXIT.                                                         00333000
003340     EXIT.                                                        00334000
003350******************************************************************00335000
003360 PRINTER-ROUTINE SECTION.                                         00336000
000000 COPY SRP041.                                                     00337000
003380******************************************************************00338000
003390 CALENDAR-365 SECTION.                                            00339000
000000 COPY SRP003.                                                     00340000
003410******************************************************************00341000
003420 CONVERT-8-TO-6 SECTION.                                          00342000
000000 COPY SRP012.                                                     00343000
003440******************************************************************00344000
003450 ACCOUNT-EDIT SECTION.                                            00345000
000000 COPY SRP033.                                                     00346000
003470******************************************************************00347000
003480 HEADING-ROUTINE SECTION.                                         00348000
000000 COPY SRP016.                                                     00349000
003500******************************************************************00350000
003510 LOAD-RPS-2023 SECTION.                                           00351000
000000 COPY RPP2023.                                                    00352000
003530******************************************************************00353000
003540 SEARCH-RPS-2023 SECTION.                                         00354000
000000 COPY RPP2023S.                                                   00355000
003560******************************************************************00356000
003570 EDIT-ACCOUNT SECTION.                                            00357000
000000 COPY RPP015.                                                     00358000
003590******************************************************************00359000
003600 END-ROUTINE SECTION.                                             00360000
003610 ER-START.                                                        00361000
003620     GOBACK.                                                      00362000
003630******************************************************************00363000
