000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPIRPTS.                                 00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPIRPTS - VSAM ACCESS ROUTINE FOR THE RELATIONSHIP PRICING  *00005000
000060*              SYSTEM EXCEPTION REPORTS FILE (ESDS FILE).        *00006000
000070*                                                                *00007000
000080*    CALLING PARAMATERS:                                         *00008000
000090*        CALL 'RPIRPTS' USING                                    *00009000
000100*            WS-DRPTSAREA                                        *00010000
000110*            RPRPTS-RECORD.                                      *00011000
000120*                                                                *00012000
000130*    THE FIRST POSITON OF WS-DRPTSAREA CONTAINS THE TYPE OF      *00013000
000140*    FILE I-O:                                                   *00014000
000150*        C - CLOSE THE FILE                                      *00015000
000160*        O - OPEN THE FILE                                       *00016000
000170*        R - READ A RECORD                                       *00017000
000180*        N - READ THE NEXT RECORD                                *00018000
000190*        W - WRITE A RECORD                                      *00019000
000200*        A - ADD A RECORD                                        *00020000
000210*    THE SECOND POSITION OF WS-DRPTSAREA IS THE FILE ACCESS      *00021000
000220*    METHOD:                                                     *00022000
000230*        S - SEQUENTIAL (DEFAULT)                                *00023000
000240*    THE THIRD POSITION OF WS-DRPTSAREA IS THE TYPE OF OPEN TO   *00024000
000250*    BE PERFOMED (USED IF THIS IS THE FIRST CALL TO A CLOSED     *00025000
000260*    FILE):                                                      *00026000
000270*        R - READ ONLY (OPEN INPUT)                              *00027000
000280*        U - UPDATE (OPEN I-O)                                   *00028000
000290*        L - LOAD (OPEN OUTPUT)                                  *00029000
000300*        E - LOAD EXTEND (OPEN EXTEND)                           *00030000
000310*    THE NEXT 50 POSITIONS ARE FOR ANY MESSAGES TO BE RETURNED   *00031000
000320*    TO THE CALLING PROGRAM WHEN AN ERROR CONDITION OCCURS.      *00032000
000330*                                                                *00033000
000340*    UPON RETURN THE FIRST POSITION WILL CONTAIN THE FOLLOWING   *00034000
000350*    RETURN CODES (THE OTHER POSITIONS WILL BE SPACES):          *00035000
000360*        E - END OF FILE. (APPLIES TO SEQUENTIAL READ).          *00036000
000370*        F - FILE IS FULL - ADD NOT MADE.                        *00037000
000380*        I - INVALID START.                                      *00038000
000390*        N - NO RECORD FOUND. (APPLIES TO RANDOM READ).          *00039000
000400*        O - I-O ERROR.                                          *00040000
000410*        X - INVALID FUNCTION CODE.                              *00041000
000420*        = - DUPLICATE FOUND WHEN ATTEMPTING ADD.                *00042000
000430******************************************************************00043000
000440 ENVIRONMENT DIVISION.                                            00044000
000450 INPUT-OUTPUT SECTION.                                            00045000
000460 FILE-CONTROL.                                                    00046000
000000 COPY RPRPTSSS.                                                   00047000
000480 DATA DIVISION.                                                   00048000
000490 FILE SECTION.                                                    00049000
000000 COPY RPRPTSSF.                                                   00050000
000510 01  RPRPTS-RECORDS.                                              00051000
000000 COPY RPSRPTS.                                                    00052000
000530******************************************************************00053000
000540 WORKING-STORAGE SECTION.                                         00054000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00055000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00055001
000560 01  WS-WORKAREAS.                                                00056000
000570     03  WS-ERRORSW              PIC X(01)       VALUE SPACE.     00057000
000580     03  WS-OPENDSW              PIC X(01)       VALUE SPACE.     00058000
000590     03  WS-OPENESW              PIC X(01)       VALUE SPACE.     00059000
000600     03  WS-OPENSSW              PIC X(01)       VALUE SPACE.     00060000
000610     03  WS-MESSAGE.                                              00061000
000620         05  FILLER              PIC X(03)       VALUE 'FS-'.     00062000
000630         05  WS-FILESTATUS.                                       00063000
000640             07  WS-FSKEY1       PIC X(01).                       00064000
000650             07  WS-FSKEY2       PIC X(01).                       00065000
000660         05  FILLER              PIC X(05)       VALUE ' KEY-'.   00066000
000670         05  FILLER              PIC X(03)       VALUE 'N/A'.     00067000
000680     03  WS-FILE-NAME            PIC X(06)       VALUE 'RPRPTS'.  00068000
000690     03  WS-SEARCHSTART          PIC X(01).                       00069000
000700******************************************************************00070000
000710 LINKAGE SECTION.                                                 00071000
000720 01  LS-FUNCTION.                                                 00072000
000730     03  LS-FUNCTION1            PIC X(01).                       00073000
000740     03  LS-FUNCTION2            PIC X(01).                       00074000
000750     03  LS-FUNCTION3            PIC X(01).                       00075000
000760     03  LS-RRPTS-ORGID          PIC X(01).                       00076000
000770     03  LS-MESSAGE              PIC X(50).                       00077000
000780 01  LS-RPTSREC.                                                  00078000
000000 COPY RPSRPTS.                                                    00079000
000800******************************************************************00080000
000810 PROCEDURE DIVISION                                               00081000
000820         USING                                                    00082000
000830         LS-FUNCTION                                              00083000
000840         LS-RPTSREC.                                              00084000
000850******************************************************************00085000
000860 MAIN-LOGIC SECTION.                                              00086000
000870 ML-START.                                                        00087000
000880     MOVE '00' TO WS-FILESTATUS.                                  00088000
000890     MOVE SPACES TO WS-ERRORSW.                                   00089000
000900     IF LS-FUNCTION1 IS EQUAL TO 'C'                              00090000
000910         PERFORM CLOSE-ROUTINE                                    00091000
000920         GO TO ML-EXIT.                                           00092000
000930     IF LS-FUNCTION1 IS EQUAL TO 'O'                              00093000
000940         PERFORM OPEN-ROUTINE                                     00094000
000950         GO TO ML-EXIT.                                           00095000
000960     IF WS-OPENSSW IS EQUAL TO SPACES                             00096000
000970         PERFORM OPEN-ROUTINE.                                    00097000
000980     IF LS-FUNCTION1 IS EQUAL TO 'N'                              00098000
000990         PERFORM READ-SEQUENTIAL                                  00099000
001000         GO TO ML-EXIT.                                           00100000
001010     IF LS-FUNCTION1 IS EQUAL TO 'W'                              00101000
001020         PERFORM UPDATE-ROUTINE                                   00102000
001030         GO TO ML-EXIT.                                           00103000
001040     IF LS-FUNCTION1 IS EQUAL TO 'A'                              00104000
001050         PERFORM ADD-ROUTINE                                      00105000
001060         GO TO ML-EXIT.                                           00106000
001070     MOVE 'X' TO WS-ERRORSW.                                      00107000
001080     GO TO ML-EXIT.                                               00108000
001090 ML-EXIT.                                                         00109000
001100     GO TO RETURN-ROUTINE.                                        00110000
001110******************************************************************00111000
001120 CLOSE-ROUTINE SECTION.                                           00112000
001130 CR-START.                                                        00113000
001140     IF WS-ERRORSW IS NOT EQUAL TO SPACES                         00114000
001150         GO TO CR-EXIT.                                           00115000
001160 CR-SEQ.                                                          00116000
001170     IF WS-OPENSSW IS EQUAL TO SPACES                             00117000
001180         GO TO CR-EXIT.                                           00118000
001190     CLOSE RP-RPTSFILS.                                           00119000
001200     IF WS-FILESTATUS IS NOT EQUAL TO '00'                        00120000
001210         MOVE 'O' TO WS-ERRORSW                                   00121000
001220         GO TO CR-EXIT.                                           00122000
001230     MOVE SPACES TO WS-OPENSSW.                                   00123000
001240 CR-EXIT.                                                         00124000
001250     EXIT.                                                        00125000
001260******************************************************************00126000
001270 OPEN-ROUTINE SECTION.                                            00127000
001280 OR-START.                                                        00128000
001290     IF WS-ERRORSW IS NOT EQUAL TO SPACES                         00129000
001300         GO TO OR-EXIT.                                           00130000
001310     IF LS-RRPTS-ORGID IS NOT EQUAL HIGH-VALUE                    00131000
000000     CALL 'MIA050' USING                                          00132000
001330         LS-RRPTS-ORGID                                           00133000
001340         WS-FILE-NAME                                             00134000
001350         WS-SEARCHSTART.                                          00135000
001360 OR-SEQ.                                                          00136000
001370     IF WS-OPENSSW IS NOT EQUAL TO SPACES                         00137000
001380         PERFORM CLOSE-ROUTINE.                                   00138000
001390     IF LS-FUNCTION3 IS EQUAL TO SPACES                           00139000
001400         MOVE 'R' TO LS-FUNCTION3.                                00140000
001410     IF LS-FUNCTION3 IS EQUAL TO 'R'                              00141000
001420         MOVE 'R' TO WS-OPENSSW                                   00142000
001430         OPEN INPUT RP-RPTSFILS                                   00143000
001440         GO TO OR-CHECKSTATUS.                                    00144000
001450     IF LS-FUNCTION3 IS EQUAL TO 'U'                              00145000
001460         MOVE 'U' TO WS-OPENSSW                                   00146000
001470         OPEN I-O RP-RPTSFILS                                     00147000
001480         GO TO OR-CHECKSTATUS.                                    00148000
001490     IF LS-FUNCTION3 IS EQUAL TO 'E'                              00149000
001500         MOVE 'E' TO WS-OPENSSW                                   00150000
001510         OPEN EXTEND RP-RPTSFILS                                  00151000
001520         GO TO OR-CHECKSTATUS.                                    00152000
001530     IF LS-FUNCTION3 IS EQUAL TO 'L'                              00153000
001540         MOVE 'L' TO WS-OPENSSW                                   00154000
001550         OPEN OUTPUT RP-RPTSFILS                                  00155000
001560         GO TO OR-CHECKSTATUS.                                    00156000
001570     MOVE 'X' TO WS-ERRORSW.                                      00157000
001580     GO TO OR-EXIT.                                               00158000
001590 OR-CHECKSTATUS.                                                  00159000
001600     IF WS-FILESTATUS IS NOT EQUAL TO '00'                        00160000
001610         AND WS-FILESTATUS IS NOT EQUAL TO '97'                   00161000
001620         MOVE 'O' TO WS-ERRORSW                                   00162000
001630         GO TO OR-EXIT.                                           00163000
001640     IF LS-FUNCTION3 IS EQUAL TO 'L'                              00164000
001650         PERFORM FORMAT-ROUTINE.                                  00165000
001660 OR-EXIT.                                                         00166000
001670     EXIT.                                                        00167000
001680******************************************************************00168000
001690 FORMAT-ROUTINE SECTION.                                          00169000
001700 FR-START.                                                        00170000
001710     IF WS-ERRORSW IS NOT EQUAL TO SPACES                         00171000
001720         GO TO FR-EXIT.                                           00172000
001730 FR-SEQ.                                                          00173000
001740     MOVE LOW-VALUES TO RPRPTS-RECORDS.                           00174000
001750     WRITE RPRPTS-RECORDS.                                        00175000
001760 FR-TESTSTATUS.                                                   00176000
001770     IF WS-FILESTATUS IS EQUAL TO '00'                            00177000
001780         GO TO FR-EXIT.                                           00178000
001790     MOVE 'O' TO WS-ERRORSW.                                      00179000
001800     IF WS-FILESTATUS IS EQUAL TO '24'                            00180000
001810         MOVE 'F' TO WS-ERRORSW.                                  00181000
001820 FR-EXIT.                                                         00182000
001830     EXIT.                                                        00183000
001840******************************************************************00184000
001850 READ-SEQUENTIAL SECTION.                                         00185000
001860 RS-START.                                                        00186000
001870     IF WS-ERRORSW IS NOT EQUAL TO SPACES                         00187000
001880         GO TO RS-EXIT.                                           00188000
001890 RS-SEQ.                                                          00189000
001900     READ RP-RPTSFILS                                             00190000
001910         NEXT RECORD                                              00191000
001920         AT END                                                   00192000
001930         GO TO RS-TESTSTATUS.                                     00193000
001940     MOVE RPRPTS-RECORDS TO LS-RPTSREC.                           00194000
001950 RS-TESTSTATUS.                                                   00195000
001960     IF WS-FILESTATUS IS EQUAL TO '00'                            00196000
001970         GO TO RS-GOOD.                                           00197000
001980     MOVE 'O' TO WS-ERRORSW.                                      00198000
001990     IF WS-FILESTATUS IS EQUAL TO '10'                            00199000
002000         MOVE 'E' TO WS-ERRORSW.                                  00200000
002010     GO TO RS-EXIT.                                               00201000
002020 RS-GOOD.                                                         00202000
002030     IF LS-RPTSREC IS EQUAL TO LOW-VALUES                         00203000
002040         GO TO RS-START.                                          00204000
002050 RS-EXIT.                                                         00205000
002060     EXIT.                                                        00206000
002070******************************************************************00207000
002080 UPDATE-ROUTINE SECTION.                                          00208000
002090 UR-START.                                                        00209000
002100     IF WS-ERRORSW IS NOT EQUAL TO SPACES                         00210000
002110         GO TO UR-EXIT.                                           00211000
002120 UR-SEQ.                                                          00212000
002130     MOVE LS-RPTSREC TO RPRPTS-RECORDS.                           00213000
002140     REWRITE RPRPTS-RECORDS.                                      00214000
002150 UR-TESTSTATUS.                                                   00215000
002160     IF WS-FILESTATUS IS EQUAL TO '00'                            00216000
002170         GO TO UR-EXIT.                                           00217000
002180     MOVE 'O' TO WS-ERRORSW.                                      00218000
002190 UR-EXIT.                                                         00219000
002200     EXIT.                                                        00220000
002210******************************************************************00221000
002220 ADD-ROUTINE SECTION.                                             00222000
002230 AR-START.                                                        00223000
002240     IF WS-ERRORSW IS NOT EQUAL TO SPACES                         00224000
002250         GO TO AR-EXIT.                                           00225000
002260 AR-SEQ.                                                          00226000
002270     MOVE LS-RPTSREC TO RPRPTS-RECORDS.                           00227000
002280     WRITE RPRPTS-RECORDS.                                        00228000
002290 AR-TESTSTATUS.                                                   00229000
002300     IF WS-FILESTATUS IS EQUAL TO '00'                            00230000
002310         GO TO AR-EXIT.                                           00231000
002320     MOVE 'O' TO WS-ERRORSW.                                      00232000
002330     IF WS-FILESTATUS IS EQUAL TO '22'                            00233000
002340         MOVE '=' TO WS-ERRORSW.                                  00234000
002350     IF WS-FILESTATUS IS EQUAL TO '24'                            00235000
002360         MOVE 'F' TO WS-ERRORSW.                                  00236000
002370 AR-EXIT.                                                         00237000
002380     EXIT.                                                        00238000
002390******************************************************************00239000
002400 RETURN-ROUTINE SECTION.                                          00240000
002410 RET-START.                                                       00241000
002420     MOVE SPACES TO LS-FUNCTION1                                  00242000
002430                    LS-FUNCTION2                                  00243000
002440                    LS-FUNCTION3                                  00244000
002450                    LS-MESSAGE.                                   00245000
002460     MOVE WS-ERRORSW TO LS-FUNCTION1.                             00246000
002470 RET-RETURN.                                                      00247000
002480     IF LS-FUNCTION1 IS EQUAL TO 'O'                              00248000
002490         OR LS-FUNCTION1 IS EQUAL TO 'I'                          00249000
002500         DISPLAY '* * * * * RPRPTS - VSAM FILE STATUS = '         00250000
002510         WS-FILESTATUS ' FOR ABORT * * * * *' UPON CONSOLE.       00251000
002520     MOVE WS-MESSAGE TO LS-MESSAGE.                               00252000
002530     GOBACK.                                                      00253000
002540******************************************************************00254000
