000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPJ0DP86.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*   RPJ0DP86 - RELATIONSHIP PRICING / DEPOSITS 8.6                00005000
000060*             INTERFACE EXTRACT FOR DEPOSITS RELEASE 8.6         *00006000
000070******************************************************************00007000
000080 ENVIRONMENT DIVISION.                                            00008000
000090 CONFIGURATION SECTION.                                           00009000
000100 DATA DIVISION.                                                   00010000
000110 FILE SECTION.                                                    00011000
000120******************************************************************00012000
000130 WORKING-STORAGE SECTION.                                         00013000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00014000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00014001
000150 01  RPS-RLSELIT.                                                 00015000
000000 COPY RPWRLSE.                                                    00016000
000170 01  DEP-RLSELIT.                                                 00017000
000000 COPY DPWRLSE.                                                    00018000
000190 01  SRW105-AREAS.                                                00019000
000000 COPY SRW105.                                                     00020000
000210*01  BICPBPRM.                                                    00021000
000000 COPY BICPBPRM.                                                   00022000
000230*01  BICRSRB.                                                     00023000
000000 COPY BICRSRB.                                                    00024000
000250*01  BICRPSB.                                                     00025000
000000 COPY BICRPSB.                                                    00026000
000270*01  BICRVERB.                                                    00027000
000000 COPY BICRVERB.                                                   00028000
000290*01  BICRSTAT.                                                    00029000
000000 COPY BICRSTAT.                                                   00030000
000310*01  BICRDBS.                                                     00031000
000000 COPY BICRDBS.                                                    00032000
000330*01  BICRLOG.                                                     00033000
000000 COPY BICRLOG.                                                    00034000
000350 01  FILLER                      PIC X(06)       VALUE 'DPDDM '.  00035000
000360 01  DPDDM-RECORD.                                                00036000
000000 COPY DPSDDM.                                                     00037000
000380 01  FILLER                      PIC X(06)       VALUE 'DPSVM '.  00038000
000390 01  DPSVM-RECORD.                                                00039000
000000 COPY DPSSVM.                                                     00040000
000410 01  DPWDDM-AREAS.                                                00041000
000000 COPY DPWDDMA.                                                    00042000
000430 01  DPWSVM-AREAS.                                                00043000
000000 COPY DPWSVMA.                                                    00044000
000450 01  MIWMSTA-AREAS.                                               00045000
000000 COPY MIWMSTA.                                                    00046000
000470 01  WS-WORKAREAS.                                                00047000
000480     03  WS-FILESTATUS.                                           00048000
000490         05  WS-FSKEY1           PIC X(01)       VALUE SPACES.    00049000
000500         05  WS-FSKEY2           PIC X(01)       VALUE SPACES.    00050000
000510     03  WS-DDMOPEN              PIC X(01)       VALUE SPACES.    00051000
000520     03  WS-SVMOPEN              PIC X(01)       VALUE SPACES.    00052000
000530     03  WS-UPD-USER             PIC X(08)       VALUE SPACES.    00053000
000540     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00054000
000550     03  WS-SUB1                 PIC S9(04)      COMP.            00055000
000560     03  WS-ACCT-MAX             PIC S9(04)      COMP             00056000
000570                                                 VALUE +500.      00057000
000580******************************************************************00058000
000590 LINKAGE SECTION.                                                 00059000
000600 01  WS-LINKDATA.                                                 00060000
000000 COPY MISCNT00      REPLACING                                     00061000
000620     ==:MICNT:== BY ==RPEXT00==.                                  00062000
000000 COPY RPSEXT00.                                                   00063000
000640******************************************************************00064000
000650 PROCEDURE DIVISION                                               00065000
000660         USING                                                    00066000
000670         WS-LINKDATA.                                             00067000
000680******************************************************************00068000
000690 INITIALIZATION SECTION.                                          00069000
000700 IN-START.                                                        00070000
000710     MOVE 'RPJ0DP86' TO SR-APIPROGLIT.                            00071000
000720     MOVE 'RPJ0DP86' TO WS-UPD-USER.                              00072000
000730     MOVE SPACES TO WS-FUNCTION.                                  00073000
000740     MOVE ZEROS TO RPEXT00-ABTRACE.                               00074000
000750     IF RPEXT00-APPLR IS NOT EQUAL TO '01'                        00075000
000760         AND RPEXT00-APPLR IS NOT EQUAL TO '04'                   00076000
000770         MOVE 'X' TO WS-FUNCTION                                  00077000
000780         MOVE 'X' TO RPEXT00-RETURN                               00078000
000790         MOVE 0001 TO RPEXT00-ABTRACE                             00079000
000800         GO TO RETURN-ROUTINE.                                    00080000
000810     IF RPEXT00-FUNC IS EQUAL TO 'O'                              00081000
000820         PERFORM OPEN-ROUTINE                                     00082000
000830         GO TO RETURN-ROUTINE.                                    00083000
000840     IF RPEXT00-FUNC IS EQUAL TO 'X'                              00084000
000850         GO TO EXTRACT-NONRP-ACCT.                                00085000
000860     IF RPEXT00-FUNC IS EQUAL TO 'C'                              00086000
000870         GO TO CLOSE-ROUTINE.                                     00087000
000880     MOVE 'X' TO WS-FUNCTION.                                     00088000
000890     MOVE 'X' TO RPEXT00-RETURN.                                  00089000
000900     MOVE 0002 TO RPEXT00-ABTRACE.                                00090000
000910     GO TO RETURN-ROUTINE.                                        00091000
000920 IN-EXIT.                                                         00092000
000930     EXIT.                                                        00093000
000940******************************************************************00094000
000950 OPEN-ROUTINE SECTION.                                            00095000
000960 OR-OPEN.                                                         00096000
000970     IF WS-DDMOPEN IS EQUAL TO 'Y'                                00097000
000980         AND WS-SVMOPEN IS EQUAL TO 'Y'                           00098000
000990         GO TO OR-EXIT.                                           00099000
001000     PERFORM GET-FILE-ORGANIZATION.                               00100000
001010     MOVE 'N' TO DEP-DDM-LOG.                                     00101000
001020     MOVE 'N' TO DEP-SVM-LOG.                                     00102000
001030     IF WS-DDMOPEN IS EQUAL TO 'Y'                                00103000
001040         GO TO OR-OPENSAV.                                        00104000
001050     MOVE 'Y' TO WS-DDMOPEN.                                      00105000
001060     MOVE RPEXT00-INST TO DPDDM-INST.                             00106000
001070     MOVE ZEROS TO DPDDM-ACCOUNT.                                 00107000
001080     PERFORM DEP-DDM-OPEN-REQUEST.                                00108000
001090     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00109000
001100         MOVE 'O' TO RPEXT00-RETURN                               00110000
001110         MOVE 0003 TO RPEXT00-ABTRACE                             00111000
001120         GO TO OR-END.                                            00112000
001130 OR-OPENSAV.                                                      00113000
001140     IF WS-SVMOPEN IS EQUAL TO 'Y'                                00114000
001150         GO TO OR-END.                                            00115000
001160     MOVE 'Y' TO WS-SVMOPEN.                                      00116000
001170     MOVE RPEXT00-INST TO DPSVM-INST.                             00117000
001180     MOVE ZEROS TO DPSVM-ACCOUNT.                                 00118000
001190     PERFORM DEP-SVM-OPEN-REQUEST.                                00119000
001200     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00120000
001210         MOVE 'O' TO RPEXT00-RETURN                               00121000
001220         MOVE 0004 TO RPEXT00-ABTRACE                             00122000
001230         GO TO OR-END.                                            00123000
001240 OR-END.                                                          00124000
001250     MOVE WS-FUNCTION TO RPEXT00-FUNCTION.                        00125000
001260     IF RPEXT00-ABTRACE IS NOT EQUAL TO ZEROS                     00126000
001270         GO TO RETURN-ROUTINE.                                    00127000
001280 OR-EXIT.                                                         00128000
001290     EXIT.                                                        00129000
001300******************************************************************00130000
001310 CLOSE-ROUTINE SECTION.                                           00131000
001320 CR-START.                                                        00132000
001330     IF WS-DDMOPEN IS NOT EQUAL TO 'Y'                            00133000
001340         GO TO CR-CLOSESAV.                                       00134000
001350     PERFORM DEP-DDM-CLOSE-REQUEST.                               00135000
001360     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00136000
001370         MOVE 'C' TO RPEXT00-RETURN                               00137000
001380         MOVE 0005 TO RPEXT00-ABTRACE                             00138000
001390         GO TO CR-END.                                            00139000
001400     MOVE SPACES TO WS-DDMOPEN.                                   00140000
001410 CR-CLOSESAV.                                                     00141000
001420     IF WS-SVMOPEN IS NOT EQUAL TO 'Y'                            00142000
001430         GO TO CR-END.                                            00143000
001440     PERFORM DEP-SVM-CLOSE-REQUEST.                               00144000
001450     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00145000
001460         MOVE 'C' TO RPEXT00-RETURN                               00146000
001470         MOVE 0006 TO RPEXT00-ABTRACE                             00147000
001480         GO TO CR-END.                                            00148000
001490     MOVE SPACES TO WS-SVMOPEN.                                   00149000
001500 CR-END.                                                          00150000
001510     MOVE WS-FUNCTION TO RPEXT00-FUNCTION.                        00151000
001520     GO TO RETURN-ROUTINE.                                        00152000
001530 CR-EXIT.                                                         00153000
001540     EXIT.                                                        00154000
001550******************************************************************00155000
001560 EXTRACT-NONRP-ACCT SECTION.                                      00156000
001570 ENA-START.                                                       00157000
001580     INITIALIZE RPEXT00-ACCOUNTS.                                 00158000
001590     MOVE +1 TO WS-SUB1.                                          00159000
001600     IF RPEXT00-APPLR IS NOT EQUAL TO '01'                        00160000
001610         GO TO ENA-SAVINGS.                                       00161000
001620     IF WS-DDMOPEN IS NOT EQUAL TO 'Y'                            00162000
001630         PERFORM OPEN-ROUTINE.                                    00163000
001640     PERFORM DEP-DDM-GET-EQUAL-REQUEST.                           00164000
001650     GO TO ENA-TEST-DDA.                                          00165000
001660 ENA-READNEXT-DDA.                                                00166000
001670     PERFORM DEP-DDM-GET-NEXT-REQUEST.                            00167000
001680 ENA-TEST-DDA.                                                    00168000
001690     IF WS-FUNCTION IS EQUAL TO 'E'                               00169000
001700         MOVE SPACE TO WS-FUNCTION                                00170000
001710         MOVE 'D' TO RPEXT00-RETURN                               00171000
001720         GO TO ENA-END.                                           00172000
001730     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00173000
001740         MOVE 'X' TO RPEXT00-RETURN                               00174000
001750         MOVE 0007 TO RPEXT00-ABTRACE                             00175000
001760         GO TO ENA-END.                                           00176000
001770     IF DPDDM-INST IS NOT EQUAL TO RPEXT00-INST                   00177000
001780         MOVE SPACE TO WS-FUNCTION                                00178000
001790         MOVE 'D' TO RPEXT00-RETURN                               00179000
001800         GO TO ENA-END.                                           00180000
001810 ENA-CHECK-DDA.                                                   00181000
001820     IF DPDDM-MSTATUS IS NOT EQUAL TO SPACES                      00182000
001830         GO TO ENA-READNEXT-DDA.                                  00183000
001840     IF DPDDM-RPSCD IS NOT EQUAL TO 'N'                           00184000
001850         OR DPDDM-INTRPSCD IS NOT EQUAL TO 'N'                    00185000
001860         GO TO ENA-READNEXT-DDA.                                  00186000
001870     MOVE DPDDM-ACCOUNT TO RPEXT00-ACCT (WS-SUB1).                00187000
001880     MOVE DPDDM-MTYPE TO RPEXT00-TYPE (WS-SUB1).                  00188000
001890     ADD +1 TO WS-SUB1.                                           00189000
001900     IF WS-SUB1 IS GREATER THAN WS-ACCT-MAX                       00190000
001910         MOVE SPACE TO WS-FUNCTION                                00191000
001920         MOVE 'M' TO RPEXT00-RETURN                               00192000
001930         GO TO ENA-END.                                           00193000
001940     GO TO ENA-READNEXT-DDA.                                      00194000
001950 ENA-SAVINGS.                                                     00195000
001960     IF RPEXT00-APPLR IS NOT EQUAL TO '04'                        00196000
001970         GO TO ENA-END.                                           00197000
001980     IF WS-SVMOPEN IS NOT EQUAL TO 'Y'                            00198000
001990         PERFORM OPEN-ROUTINE.                                    00199000
002000     PERFORM DEP-SVM-GET-EQUAL-REQUEST.                           00200000
002010     GO TO ENA-TEST-SAV.                                          00201000
002020 ENA-READNEXT-SAV.                                                00202000
002030     PERFORM DEP-SVM-GET-NEXT-REQUEST.                            00203000
002040 ENA-TEST-SAV.                                                    00204000
002050     IF WS-FUNCTION IS EQUAL TO 'E'                               00205000
002060         MOVE SPACE TO WS-FUNCTION                                00206000
002070         MOVE 'D' TO RPEXT00-RETURN                               00207000
002080         GO TO ENA-END.                                           00208000
002090     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00209000
002100         MOVE 'X' TO RPEXT00-RETURN                               00210000
002110         MOVE 0008 TO RPEXT00-ABTRACE                             00211000
002120         GO TO ENA-END.                                           00212000
002130     IF DPSVM-INST IS NOT EQUAL TO RPEXT00-INST                   00213000
002140         MOVE SPACE TO WS-FUNCTION                                00214000
002150         MOVE 'D' TO RPEXT00-RETURN                               00215000
002160         GO TO ENA-END.                                           00216000
002170 ENA-CHECK-SAV.                                                   00217000
002180     IF DPSVM-MSTATUS IS NOT EQUAL TO SPACES                      00218000
002190         GO TO ENA-READNEXT-SAV.                                  00219000
002200     IF DPSVM-RPSCD IS NOT EQUAL TO 'N'                           00220000
002210         OR DPSVM-INTRPSCD IS NOT EQUAL TO 'N'                    00221000
002220         GO TO ENA-READNEXT-SAV.                                  00222000
002230     MOVE DPSVM-ACCOUNT TO RPEXT00-ACCT (WS-SUB1).                00223000
002240     MOVE DPSVM-MTYPE TO RPEXT00-TYPE (WS-SUB1).                  00224000
002250     ADD +1 TO WS-SUB1.                                           00225000
002260     IF WS-SUB1 IS GREATER THAN WS-ACCT-MAX                       00226000
002270         MOVE SPACE TO WS-FUNCTION                                00227000
002280         MOVE 'M' TO RPEXT00-RETURN                               00228000
002290         GO TO ENA-END.                                           00229000
002300     GO TO ENA-READNEXT-SAV.                                      00230000
002310 ENA-END.                                                         00231000
002320     GO TO RETURN-ROUTINE.                                        00232000
002330 ENA-EXIT.                                                        00233000
002340     EXIT.                                                        00234000
002350******************************************************************00235000
002360 GET-FILE-ORGANIZATION SECTION.                                   00236000
000000 COPY SRP093.                                                     00237000
002380******************************************************************00238000
000000 COPY DPPDDMA.                                                    00239000
002400******************************************************************00240000
000000 COPY DPPSVMA.                                                    00241000
002420******************************************************************00242000
002430 RETURN-ROUTINE SECTION.                                          00243000
002440 RT-START.                                                        00244000
002450     MOVE WS-FUNCTION TO RPEXT00-FUNCTION.                        00245000
002460     GOBACK.                                                      00246000
002470******************************************************************00247000
