000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPK0RF21.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040*----------------------------------------------------------------*00004000
000050*    RPK0RF21 - RP PRODUCT INTERFACE TO RCIF 2.1                 *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 CONFIGURATION SECTION.                                           00008000
000090 DATA DIVISION.                                                   00009000
000100 FILE SECTION.                                                    00010000
000110******************************************************************00011000
000120 WORKING-STORAGE SECTION.                                         00012000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00013000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00013001
000140 01  RPS-RLSELIT.                                                 00014000
000000 COPY RPWRLSE.                                                    00015000
000160 01  RCF-RLSELIT.                                                 00016000
000000 COPY RFWRLSE.                                                    00017000
000180 01  MIC-RLSELIT.                                                 00018000
000000 COPY MIWRLSE.                                                    00019000
000200 01  SRW105-AREAS.                                                00020000
000000 COPY SRW105.                                                     00021000
000220 01  MIWMSTA-AREAS.                                               00022000
000000 COPY MIWMSTA.                                                    00023000
000240*01  BICPBPRM.                                                    00024000
000000 COPY BICPBPRM.                                                   00025000
000260*01  BICRSRB.                                                     00026000
000000 COPY BICRSRB.                                                    00027000
000280*01  BICRPSB.                                                     00028000
000000 COPY BICRPSB.                                                    00029000
000300*01  BICRVERB.                                                    00030000
000000 COPY BICRVERB.                                                   00031000
000320*01  BICRSTAT.                                                    00032000
000000 COPY BICRSTAT.                                                   00033000
000340*01  BICRDBS.                                                     00034000
000000 COPY BICRDBS.                                                    00035000
000360*01  BICRLOG.                                                     00036000
000000 COPY BICRLOG.                                                    00037000
000380*----------------------------------------------------------------*00038000
000390 01  RFWACCA-AREAS.                                               00039000
000000 COPY RFWACCA.                                                    00040000
000410 01  RFACC-RECORD.                                                00041000
000000 COPY RFSACC.                                                     00042000
000430*----------------------------------------------------------------*00043000
000440 01  RFWACTA-AREAS.                                               00044000
000000 COPY RFWACTA.                                                    00045000
000460 01  RFACT-RECORD.                                                00046000
000000 COPY RFSACT.                                                     00047000
000480*----------------------------------------------------------------*00048000
000490 01  RFWCACA-AREAS.                                               00049000
000000 COPY RFWCACA.                                                    00050000
000510 01  RFCAC-RECORD.                                                00051000
000000 COPY RFSCAC.                                                     00052000
000530*----------------------------------------------------------------*00053000
000540 01  RFWCRFA-AREAS.                                               00054000
000000 COPY RFWCRFA.                                                    00055000
000560 01  RFCRF-RECORD.                                                00056000
000000 COPY RFSCRF.                                                     00057000
000580*----------------------------------------------------------------*00058000
000590 01  RFWNONA-AREAS.                                               00059000
000000 COPY RFWNONA.                                                    00060000
000610 01  RFNON-RECORD.                                                00061000
000000 COPY RFSNON.                                                     00062000
000630*----------------------------------------------------------------*00063000
000640 01  WS-STORAGE.                                                  00064000
000650     03  WS-ACCOPEN              PIC X(01)       VALUE SPACES.    00065000
000660     03  WS-ACTOPEN              PIC X(01)       VALUE SPACES.    00066000
000670     03  WS-CACOPEN              PIC X(01)       VALUE SPACES.    00067000
000680     03  WS-CRFOPEN              PIC X(01)       VALUE SPACES.    00068000
000690     03  WS-NONOPEN              PIC X(01)       VALUE SPACES.    00069000
000700     03  WS-FUNCTION             PIC X(01)       VALUE SPACES.    00070000
000710     03  WS-FILEOPTIONS          PIC X(25)       VALUE SPACES.    00071000
000720     03  WS-FILEOPTS     REDEFINES WS-FILEOPTIONS.                00072000
000730         05  WS-FILEOPT          PIC X(01)       OCCURS 25.       00073000
000740     03  WS-UPD-USER             PIC X(08)       VALUE SPACE.     00074000
000750     03  WS-CAC-TABLE.                                            00075000
000760         05  WS-CAC-INFO                         OCCURS 33 TIMES. 00076000
000770             07  WS-CAC-INST     PIC 9(04).                       00077000
000780             07  WS-CAC-PRODCD   PIC X(06).                       00078000
000790             07  WS-CAC-ACCT     PIC X(18).                       00079000
000800             07  WS-CAC-RELNBR   PIC 9(02).                       00080000
000810         05 FILLER               PIC X(10)       VALUE SPACES.    00081000
000820     03  WS-SUB1                 PIC S9(04)      COMP             00082000
000830                                                 VALUE ZERO.      00083000
000840     03  WS-NEXTACC.                                              00084000
000850         05  WS-NEXT-ACCT        PIC X(28).                       00085000
000860         05  WS-NEXT-REL         PIC 9(03).                       00086000
000870         05  WS-NEXT-CUST        PIC X(26).                       00087000
000880     03  WS-ACC-TABLE.                                            00088000
000890         05  WS-ACC-INFO                         OCCURS 33 TIMES. 00089000
000900             07  WS-ACC-INST     PIC 9(04).                       00090000
000910             07  WS-ACC-CUST-TYPE                                 00091000
000920                                 PIC X(01).                       00092000
000930             07  WS-ACC-CUST     PIC X(21).                       00093000
000940             07  WS-ACC-RELNBR   PIC 9(02).                       00094000
000950             07  WS-ACC-PRIM     PIC 9(01).                       00095000
000960             07  WS-ACC-FILL     PIC X(01).                       00096000
000970         05  WS-ACC-FILLER       PIC X(10).                       00097000
000980******************************************************************00098000
000990 LINKAGE SECTION.                                                 00099000
001000******************************************************************00100000
001010 01  WS-LINKDATA.                                                 00101000
000000 COPY MISCNT00      REPLACING                                     00102000
001030             ==:MICNT:== BY ==RPRF21==.                           00103000
000000 COPY RPSRF21.                                                    00104000
001050******************************************************************00105000
001060 PROCEDURE DIVISION                                               00106000
001070         USING                                                    00107000
001080         WS-LINKDATA.                                             00108000
001090******************************************************************00109000
001100 INITIALIZATION SECTION.                                          00110000
001110 IN-START.                                                        00111000
001120     MOVE 'RPK0RF21' TO SR-APIPROGLIT.                            00112000
001130     MOVE 'RPK0RF21' TO WS-UPD-USER.                              00113000
001140     MOVE SPACES TO WS-FUNCTION.                                  00114000
001150     MOVE ZEROS TO RPRF21-ABTRACE.                                00115000
001160     IF RPRF21-FUNC IS EQUAL TO 'A'                               00116000
001170         GO TO GET-CUSTOMER-NAME.                                 00117000
001180     IF RPRF21-FUNC IS EQUAL TO 'N'                               00118000
001190         GO TO READ-ALL-CAC.                                      00119000
001200     IF RPRF21-FUNC IS EQUAL TO 'U'                               00120000
001210         GO TO CHECK-ACCT-RPS-REL.                                00121000
001220     IF RPRF21-FUNC IS EQUAL TO 'G'                               00122000
001230         GO TO GET-CUSTOMER-INFO.                                 00123000
001240     IF RPRF21-FUNC IS EQUAL TO 'R'                               00124000
001250         GO TO READ-ACCTTOCUST.                                   00125000
001260     IF RPRF21-FUNC IS EQUAL TO 'P'                               00126000
001270         GO TO READ-CUSTTOACCT.                                   00127000
001280     IF RPRF21-FUNC IS EQUAL TO 'T'                               00128000
001290         GO TO READ-ACT-REC.                                      00129000
001300     IF RPRF21-FUNC IS EQUAL TO 'X'                               00130000
001310         GO TO READ-ALL-ACC.                                      00131000
001320     IF RPRF21-FUNC IS EQUAL TO 'O'                               00132000
001330         PERFORM OPEN-ROUTINE                                     00133000
001340         GO TO RETURN-ROUTINE.                                    00134000
001350     IF RPRF21-FUNC IS EQUAL TO 'C'                               00135000
001360         GO TO CLOSE-ROUTINE.                                     00136000
001370     MOVE 'X' TO WS-FUNCTION.                                     00137000
001380     MOVE 'X' TO RPRF21-RETURN.                                   00138000
001390     MOVE 0001 TO RPRF21-ABTRACE.                                 00139000
001400     GO TO RETURN-ROUTINE.                                        00140000
001410 IN-EXIT.                                                         00141000
001420     EXIT.                                                        00142000
001430******************************************************************00143000
001440 OPEN-ROUTINE SECTION.                                            00144000
001450 OR-OPEN.                                                         00145000
001460     PERFORM GET-FILE-ORGANIZATION.                               00146000
001470     MOVE MIC-MST-APPL-ORG TO WS-FILEOPT (24).                    00147000
001480     IF WS-ACCOPEN IS EQUAL TO 'Y'                                00148000
001490         GO TO OR-OPENACT.                                        00149000
001500     MOVE 'Y' TO WS-ACCOPEN.                                      00150000
001510     PERFORM RCF-ACC-OPEN-REQUEST.                                00151000
001520     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00152000
001530         MOVE 'O' TO RPRF21-RETURN                                00153000
001540         MOVE 0002 TO RPRF21-ABTRACE                              00154000
001550         GO TO RETURN-ROUTINE.                                    00155000
001560 OR-OPENACT.                                                      00156000
001570     IF WS-ACTOPEN IS EQUAL TO 'Y'                                00157000
001580         GO TO OR-OPENCAC.                                        00158000
001590     MOVE 'Y' TO WS-ACTOPEN.                                      00159000
001600     PERFORM RCF-ACT-OPEN-REQUEST.                                00160000
001610     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00161000
001620         MOVE 'O' TO RPRF21-RETURN                                00162000
001630         MOVE 0003 TO RPRF21-ABTRACE                              00163000
001640         GO TO RETURN-ROUTINE.                                    00164000
001650 OR-OPENCAC.                                                      00165000
001660     IF WS-CACOPEN IS EQUAL TO 'Y'                                00166000
001670         GO TO OR-OPENCRF.                                        00167000
001680     MOVE 'Y' TO WS-CACOPEN.                                      00168000
001690     PERFORM RCF-CAC-OPEN-REQUEST.                                00169000
001700     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00170000
001710         MOVE 'O' TO RPRF21-RETURN                                00171000
001720         MOVE 0004 TO RPRF21-ABTRACE                              00172000
001730         GO TO RETURN-ROUTINE.                                    00173000
001740 OR-OPENCRF.                                                      00174000
001750     IF WS-CRFOPEN IS EQUAL TO 'Y'                                00175000
001760         GO TO OR-OPENNON.                                        00176000
001770     MOVE 'Y' TO WS-CRFOPEN.                                      00177000
001780     PERFORM RCF-CRF-OPEN-REQUEST.                                00178000
001790     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00179000
001800         MOVE 'O' TO RPRF21-RETURN                                00180000
001810         MOVE 0005 TO RPRF21-ABTRACE                              00181000
001820         GO TO RETURN-ROUTINE.                                    00182000
001830 OR-OPENNON.                                                      00183000
001840     IF WS-NONOPEN IS EQUAL TO 'Y'                                00184000
001850         GO TO OR-EXIT.                                           00185000
001860     MOVE 'Y' TO WS-NONOPEN.                                      00186000
001870     PERFORM RCF-NON-OPEN-REQUEST.                                00187000
001880     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00188000
001890         MOVE 'O' TO RPRF21-RETURN                                00189000
001900         MOVE 0006 TO RPRF21-ABTRACE                              00190000
001910         GO TO RETURN-ROUTINE.                                    00191000
001920 OR-EXIT.                                                         00192000
001930     EXIT.                                                        00193000
001940******************************************************************00194000
001950 CLOSE-ROUTINE SECTION.                                           00195000
001960 CR-START.                                                        00196000
001970     IF WS-ACCOPEN IS NOT EQUAL TO 'Y'                            00197000
001980         GO TO CR-CLOSEACT.                                       00198000
001990     PERFORM RCF-ACC-CLOSE-REQUEST.                               00199000
002000     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00200000
002010         MOVE 'C' TO RPRF21-RETURN                                00201000
002020         MOVE 0007 TO RPRF21-ABTRACE                              00202000
002030         GO TO RETURN-ROUTINE.                                    00203000
002040     MOVE SPACES TO WS-ACCOPEN.                                   00204000
002050 CR-CLOSEACT.                                                     00205000
002060     IF WS-ACTOPEN IS NOT EQUAL TO 'Y'                            00206000
002070         GO TO CR-CLOSECAC.                                       00207000
002080     PERFORM RCF-ACT-CLOSE-REQUEST.                               00208000
002090     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00209000
002100         MOVE 'C' TO RPRF21-RETURN                                00210000
002110         MOVE 0008 TO RPRF21-ABTRACE                              00211000
002120         GO TO RETURN-ROUTINE.                                    00212000
002130     MOVE SPACES TO WS-ACTOPEN.                                   00213000
002140 CR-CLOSECAC.                                                     00214000
002150     IF WS-CACOPEN IS NOT EQUAL TO 'Y'                            00215000
002160         GO TO CR-CLOSECRF.                                       00216000
002170     PERFORM RCF-CAC-CLOSE-REQUEST.                               00217000
002180     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00218000
002190         MOVE 'C' TO RPRF21-RETURN                                00219000
002200         MOVE 0009 TO RPRF21-ABTRACE                              00220000
002210         GO TO RETURN-ROUTINE.                                    00221000
002220     MOVE SPACES TO WS-CACOPEN.                                   00222000
002230 CR-CLOSECRF.                                                     00223000
002240     IF WS-CRFOPEN IS NOT EQUAL TO 'Y'                            00224000
002250         GO TO CR-CLOSENON.                                       00225000
002260     PERFORM RCF-CRF-CLOSE-REQUEST.                               00226000
002270     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00227000
002280         MOVE 'C' TO RPRF21-RETURN                                00228000
002290         MOVE 0010 TO RPRF21-ABTRACE                              00229000
002300         GO TO RETURN-ROUTINE.                                    00230000
002310     MOVE SPACES TO WS-CRFOPEN.                                   00231000
002320 CR-CLOSENON.                                                     00232000
002330     IF WS-NONOPEN IS NOT EQUAL TO 'Y'                            00233000
002340         GO TO CR-END.                                            00234000
002350     PERFORM RCF-NON-CLOSE-REQUEST.                               00235000
002360     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00236000
002370         MOVE 'C' TO RPRF21-RETURN                                00237000
002380         MOVE 0011 TO RPRF21-ABTRACE                              00238000
002390         GO TO RETURN-ROUTINE.                                    00239000
002400     MOVE SPACES TO WS-NONOPEN.                                   00240000
002410 CR-END.                                                          00241000
002420     GO TO RETURN-ROUTINE.                                        00242000
002430 CR-EXIT.                                                         00243000
002440     EXIT.                                                        00244000
002450***************************************************************** 00245000
002460 GET-CUSTOMER-NAME SECTION.                                       00246000
002470 GCN-START.                                                       00247000
002480     IF RPRF21-BASE-ACCOUNT IS NOT GREATER THAN SPACES            00248000
002490         MOVE 'I' TO WS-FUNCTION                                  00249000
002500         MOVE 'A' TO RPRF21-RETURN                                00250000
002510         MOVE 0012 TO RPRF21-ABTRACE                              00251000
002520         GO TO GCN-RETURN.                                        00252000
002530     IF WS-ACCOPEN IS NOT EQUAL TO 'Y'                            00253000
002540         OR WS-CRFOPEN IS NOT EQUAL TO 'Y'                        00254000
002550         OR WS-NONOPEN IS NOT EQUAL TO 'Y'                        00255000
002560         PERFORM OPEN-ROUTINE.                                    00256000
002570     MOVE LOW-VALUES TO RFACC-GRP-KEY.                            00257000
002580     MOVE RPRF21-BASE-ACCOUNT TO RFACC-ACCT-GRP.                  00258000
002590 GCN-GET-ACC.                                                     00259000
002600     PERFORM RCF-ACC-GET-GE-REQUEST.                              00260000
002610     IF WS-FUNCTION IS EQUAL TO 'E'                               00261000
002620         MOVE 'N' TO WS-FUNCTION                                  00262000
002630         MOVE 'A' TO RPRF21-RETURN                                00263000
002640         MOVE 0013 TO RPRF21-ABTRACE                              00264000
002650         GO TO GCN-RETURN.                                        00265000
002660     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00266000
002670         MOVE 'A' TO RPRF21-RETURN                                00267000
002680         MOVE 0014 TO RPRF21-ABTRACE                              00268000
002690         GO TO GCN-RETURN.                                        00269000
002700     IF RFACC-ACCT-GRP IS NOT EQUAL TO RPRF21-BASE-ACCOUNT        00270000
002710         MOVE 'N' TO WS-FUNCTION                                  00271000
002720         MOVE 'A' TO RPRF21-RETURN                                00272000
002730         MOVE 0015 TO RPRF21-ABTRACE                              00273000
002740         GO TO GCN-RETURN.                                        00274000
002750     MOVE RFACC-CUST-GRP TO RPRF21-BASE-CUSTOMER.                 00275000
002760     IF RFACC-CUST-GRP IS NOT GREATER THAN SPACES                 00276000
002770         MOVE 'I' TO WS-FUNCTION                                  00277000
002780         MOVE 'A' TO RPRF21-RETURN                                00278000
002790         MOVE 0016 TO RPRF21-ABTRACE                              00279000
002800         GO TO GCN-RETURN.                                        00280000
002810 GCN-CRF.                                                         00281000
002820     IF RFACC-CUST-TYPE IS NOT EQUAL TO 'R'                       00282000
002830         GO TO GCN-NON.                                           00283000
002840     MOVE RFACC-CUST-GRP TO RFCRF-GRP-KEY.                        00284000
002850     PERFORM RCF-CRF-GET-REQUEST.                                 00285000
002860     IF WS-FUNCTION IS EQUAL TO 'N'                               00286000
002870         MOVE 'A' TO RPRF21-RETURN                                00287000
002880         MOVE 0017 TO RPRF21-ABTRACE                              00288000
002890         GO TO GCN-RETURN.                                        00289000
002900     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00290000
002910         MOVE 'A' TO RPRF21-RETURN                                00291000
002920         MOVE 0018 TO RPRF21-ABTRACE                              00292000
002930         GO TO RETURN-ROUTINE.                                    00293000
002940     MOVE RFCRF-GRP-KEY TO RPRF21-BASE-CUSTOMER.                  00294000
002950     MOVE RFCRF-NAME TO RPRF21-NAME.                              00295000
002960     MOVE RFCRF-RECORD TO RPRF21-RETURNED-OBJECT.                 00296000
002970     GO TO GCN-RETURN.                                            00297000
002980 GCN-NON.                                                         00298000
002990     MOVE RFACC-CUST-GRP TO RFNON-GRP-KEY.                        00299000
003000     PERFORM RCF-NON-GET-REQUEST.                                 00300000
003010     IF WS-FUNCTION IS EQUAL TO 'N'                               00301000
003020         MOVE 'A' TO RPRF21-RETURN                                00302000
003030         MOVE 0019 TO RPRF21-ABTRACE                              00303000
003040         GO TO GCN-RETURN.                                        00304000
003050     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00305000
003060         MOVE 'A' TO RPRF21-RETURN                                00306000
003070         MOVE 0020 TO RPRF21-ABTRACE                              00307000
003080         GO TO RETURN-ROUTINE.                                    00308000
003090     MOVE RFNON-GRP-KEY TO RPRF21-BASE-CUSTOMER.                  00309000
003100     MOVE RFNON-NAME TO RPRF21-NAME.                              00310000
003110     MOVE RFNON-RECORD TO RPRF21-RETURNED-OBJECT.                 00311000
003120 GCN-RETURN.                                                      00312000
003130     GO TO RETURN-ROUTINE.                                        00313000
003140 GCN-EXIT.                                                        00314000
003150     EXIT.                                                        00315000
003160***************************************************************** 00316000
003170 READ-ACCTTOCUST SECTION.                                         00317000
003180 RA-START.                                                        00318000
003190     IF RPRF21-BASE-ACCOUNT IS NOT GREATER THAN SPACES            00319000
003200         MOVE 'I' TO WS-FUNCTION                                  00320000
003210         MOVE 'R' TO RPRF21-RETURN                                00321000
003220         MOVE 0021 TO RPRF21-ABTRACE                              00322000
003230         GO TO RA-RETURN.                                         00323000
003240     IF WS-ACCOPEN IS NOT EQUAL TO 'Y'                            00324000
003250         PERFORM OPEN-ROUTINE.                                    00325000
003260     MOVE LOW-VALUES TO RFACC-GRP-KEY.                            00326000
003270     MOVE RPRF21-BASE-ACCOUNT TO RFACC-ACCT-GRP.                  00327000
003280 RA-GET-ACC.                                                      00328000
003290     PERFORM RCF-ACC-GET-GE-REQUEST.                              00329000
003300     IF WS-FUNCTION IS EQUAL TO 'E'                               00330000
003310         MOVE 'N' TO WS-FUNCTION                                  00331000
003320         MOVE 'R' TO RPRF21-RETURN                                00332000
003330         MOVE 0022 TO RPRF21-ABTRACE                              00333000
003340         GO TO RA-RETURN.                                         00334000
003350     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00335000
003360         MOVE 'R' TO RPRF21-RETURN                                00336000
003370         MOVE 0023 TO RPRF21-ABTRACE                              00337000
003380         GO TO RETURN-ROUTINE.                                    00338000
003390     IF RFACC-ACCT-GRP IS NOT EQUAL TO RPRF21-BASE-ACCOUNT        00339000
003400         MOVE 'N' TO WS-FUNCTION                                  00340000
003410         MOVE 'R' TO RPRF21-RETURN                                00341000
003420         MOVE 0024 TO RPRF21-ABTRACE                              00342000
003430         GO TO RA-RETURN.                                         00343000
003440 RA-END.                                                          00344000
003450     MOVE RFACC-REL-NBR TO RPRF21-REL.                            00345000
003460     MOVE RFACC-CUST-GRP TO RPRF21-BASE-CUSTOMER.                 00346000
003470 RA-RETURN.                                                       00347000
003480     GO TO RETURN-ROUTINE.                                        00348000
003490 RA-EXIT.                                                         00349000
003500     EXIT.                                                        00350000
003510******************************************************************00351000
003520 READ-CUSTTOACCT SECTION.                                         00352000
003530 RC-START.                                                        00353000
003540     IF RPRF21-BASE-CUSTOMER IS NOT GREATER THAN SPACES           00354000
003550         MOVE 'I' TO WS-FUNCTION                                  00355000
003560         MOVE 'R' TO RPRF21-RETURN                                00356000
003570         MOVE 0025 TO RPRF21-ABTRACE                              00357000
003580         GO TO RC-RETURN.                                         00358000
003590     IF WS-CACOPEN IS NOT EQUAL TO 'Y'                            00359000
003600         PERFORM OPEN-ROUTINE.                                    00360000
003610     MOVE LOW-VALUES TO RFCAC-GRP-KEY.                            00361000
003620     MOVE RPRF21-BASE-CUSTOMER TO RFCAC-CUST-GRP.                 00362000
003630 RC-GET-CAC.                                                      00363000
003640     PERFORM RCF-CAC-GET-GE-REQUEST.                              00364000
003650     IF WS-FUNCTION IS EQUAL TO 'E'                               00365000
003660         MOVE 'N' TO WS-FUNCTION                                  00366000
003670         MOVE 'R' TO RPRF21-RETURN                                00367000
003680         MOVE 0026 TO RPRF21-ABTRACE                              00368000
003690         GO TO RC-RETURN.                                         00369000
003700     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00370000
003710         MOVE 'R' TO RPRF21-RETURN                                00371000
003720         MOVE 0027 TO RPRF21-ABTRACE                              00372000
003730         GO TO RETURN-ROUTINE.                                    00373000
003740     IF RFCAC-CUST-GRP IS NOT EQUAL TO RPRF21-BASE-CUSTOMER       00374000
003750         MOVE 'N' TO WS-FUNCTION                                  00375000
003760         MOVE 'R' TO RPRF21-RETURN                                00376000
003770         MOVE 0028 TO RPRF21-ABTRACE                              00377000
003780         GO TO RC-RETURN.                                         00378000
003790 RC-END.                                                          00379000
003800     MOVE RFCAC-ACCT-GRP TO RPRF21-BASE-ACCOUNT.                  00380000
003810 RC-RETURN.                                                       00381000
003820     GO TO RETURN-ROUTINE.                                        00382000
003830 RC-EXIT.                                                         00383000
003840     EXIT.                                                        00384000
003850******************************************************************00385000
003860 READ-ALL-CAC SECTION.                                            00386000
003870 RAC-START.                                                       00387000
003880     INITIALIZE WS-CAC-TABLE.                                     00388000
003890     IF RPRF21-BASE-CUSTOMER IS NOT GREATER THAN SPACES           00389000
003900         MOVE 'I' TO WS-FUNCTION                                  00390000
003910         MOVE 'N' TO RPRF21-RETURN                                00391000
003920         MOVE 0029 TO RPRF21-ABTRACE                              00392000
003930         GO TO RAC-RETURN.                                        00393000
003940     IF WS-CACOPEN IS NOT EQUAL TO 'Y'                            00394000
003950         OR WS-ACTOPEN IS NOT EQUAL TO 'Y'                        00395000
003960         PERFORM OPEN-ROUTINE.                                    00396000
003970     MOVE +1 TO WS-SUB1.                                          00397000
003980     MOVE LOW-VALUES TO RFCAC-GRP-KEY.                            00398000
003990     MOVE RPRF21-BASE-CUSTOMER TO RFCAC-CUST-GRP.                 00399000
004000     MOVE RPRF21-BASE-ACCOUNT TO RFCAC-ACCT-GRP.                  00400000
004010     PERFORM RCF-CAC-GET-GE-REQUEST.                              00401000
004020     GO TO RAC-TEST.                                              00402000
004030 RAC-NEXT-CAC.                                                    00403000
004040     PERFORM RCF-CAC-GET-NEXT-REQUEST.                            00404000
004050 RAC-TEST.                                                        00405000
004060     IF WS-FUNCTION IS EQUAL TO 'E'                               00406000
004070         MOVE SPACE TO WS-FUNCTION                                00407000
004080         MOVE 'D' TO RPRF21-RETURN                                00408000
004090         GO TO RAC-END.                                           00409000
004100     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00410000
004110         MOVE 'N' TO RPRF21-RETURN                                00411000
004120         MOVE 0030 TO RPRF21-ABTRACE                              00412000
004130         GO TO RETURN-ROUTINE.                                    00413000
004140     IF RFCAC-CUST-GRP IS NOT EQUAL TO RPRF21-BASE-CUSTOMER       00414000
004150         MOVE 'D' TO RPRF21-RETURN                                00415000
004160         GO TO RAC-END.                                           00416000
004170     IF RFCAC-ACCT-GRP IS EQUAL TO RPRF21-BASE-ACCOUNT            00417000
004180         GO TO RAC-NEXT-CAC.                                      00418000
004190     MOVE RFCAC-ACCT-GRP TO RFACT-GRP-KEY.                        00419000
004200     PERFORM RCF-ACT-GET-REQUEST.                                 00420000
004210     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00421000
004220         GO TO RAC-NEXT-CAC.                                      00422000
004230     IF RFACT-STATUS IS EQUAL TO 'O'                              00423000
004240         GO TO RAC-TEST-CONT.                                     00424000
004250     IF RPRF21-CLOSEDACCTOPT IS EQUAL TO 'Y'                      00425000
004260         AND RFACT-STATUS IS NOT EQUAL TO 'D'                     00426000
004270         MOVE 'O' TO RFACT-STATUS                                 00427000
004280         GO TO RAC-TEST-CONT.                                     00428000
004290     GO TO RAC-NEXT-CAC.                                          00429000
004300 RAC-TEST-CONT.                                                   00430000
P0122      MOVE RFACT-APPL-INST TO WS-CAC-INST (WS-SUB1).               00431000
004320     MOVE RFCAC-PRODCODE TO WS-CAC-PRODCD (WS-SUB1).              00432000
004330     MOVE RFCAC-ACCT TO WS-CAC-ACCT (WS-SUB1).                    00433000
004340     MOVE RFCAC-REL-NBR TO WS-CAC-RELNBR (WS-SUB1).               00434000
004350     IF WS-SUB1 IS EQUAL TO +33                                   00435000
004360         MOVE 'M' TO RPRF21-RETURN                                00436000
004370         GO TO RAC-END.                                           00437000
004380     ADD +1 TO WS-SUB1.                                           00438000
004390     GO TO RAC-NEXT-CAC.                                          00439000
004400 RAC-END.                                                         00440000
004410     MOVE WS-CAC-TABLE TO RPRF21-RETURNED-OBJECT.                 00441000
004420 RAC-RETURN.                                                      00442000
004430     GO TO RETURN-ROUTINE.                                        00443000
004440 RAC-EXIT.                                                        00444000
004450     EXIT.                                                        00445000
004460******************************************************************00446000
004470 READ-ALL-ACC SECTION.                                            00447000
004480 RAA-START.                                                       00448000
004490     INITIALIZE WS-ACC-TABLE.                                     00449000
004500     IF RPRF21-BASE-ACCOUNT IS NOT GREATER THAN SPACES            00450000
004510         MOVE 'I' TO WS-FUNCTION                                  00451000
004520         MOVE 'N' TO RPRF21-RETURN                                00452000
004530         MOVE 0021 TO RPRF21-ABTRACE                              00453000
004540         GO TO RAA-RETURN.                                        00454000
004550     IF WS-ACCOPEN IS NOT EQUAL TO 'Y'                            00455000
004560         OR WS-ACCOPEN IS NOT EQUAL TO 'Y'                        00456000
004570         PERFORM OPEN-ROUTINE.                                    00457000
004580     MOVE +1 TO WS-SUB1.                                          00458000
004590     MOVE LOW-VALUES TO RFACC-GRP-KEY.                            00459000
004600     MOVE RPRF21-BASE-ACCOUNT TO RFACC-ACCT-GRP.                  00460000
004610* ** CHECK FOR CONTINUATION                                       00461000
004620     IF RPRF21-RETURN IS EQUAL TO 'M'                             00462000
004630         MOVE RPRF21-RETURNED-OBJECT TO WS-NEXTACC                00463000
004640         MOVE WS-NEXT-REL TO RFACC-REL-GRP                        00464000
004650         MOVE WS-NEXT-CUST TO RFACC-CUST-GRP                      00465000
004660         GO TO RAA-NEXT-ACC.                                      00466000
004670     PERFORM RCF-ACC-GET-GE-REQUEST.                              00467000
004680     GO TO RAA-TEST.                                              00468000
004690 RAA-NEXT-ACC.                                                    00469000
004700     PERFORM RCF-ACC-GET-NEXT-REQUEST.                            00470000
004710 RAA-TEST.                                                        00471000
004720     IF WS-FUNCTION IS EQUAL TO 'E'                               00472000
004730         MOVE SPACE TO WS-FUNCTION                                00473000
004740         MOVE 'D' TO RPRF21-RETURN                                00474000
004750         GO TO RAA-END.                                           00475000
004760     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00476000
004770         MOVE 'N' TO RPRF21-RETURN                                00477000
004780         MOVE 0023 TO RPRF21-ABTRACE                              00478000
004790         GO TO RETURN-ROUTINE.                                    00479000
004800     IF RFACC-ACCT-GRP IS NOT EQUAL TO RPRF21-BASE-ACCOUNT        00480000
004810         GO TO RAA-END.                                           00481000
004820 RAA-TEST-CONT.                                                   00482000
004830     MOVE RFACC-CUST-INST TO WS-ACC-INST (WS-SUB1).               00483000
004840     MOVE RFACC-CUST-TYPE TO WS-ACC-CUST-TYPE (WS-SUB1).          00484000
004850     MOVE RFACC-CUST TO WS-ACC-CUST (WS-SUB1).                    00485000
004860     MOVE RFACC-REL-NBR TO WS-ACC-RELNBR (WS-SUB1).               00486000
004870     MOVE RFACC-PRIM-FLAG TO WS-ACC-PRIM (WS-SUB1).               00487000
004880     IF WS-SUB1 IS EQUAL TO +33                                   00488000
004890         MOVE 'M' TO RPRF21-RETURN                                00489000
004900         GO TO RAA-END.                                           00490000
004910     ADD +1 TO WS-SUB1.                                           00491000
004920     GO TO RAA-NEXT-ACC.                                          00492000
004930 RAA-END.                                                         00493000
004940     MOVE WS-ACC-TABLE TO RPRF21-RETURNED-OBJECT.                 00494000
004950 RAA-RETURN.                                                      00495000
004960     GO TO RETURN-ROUTINE.                                        00496000
004970 RAA-EXIT.                                                        00497000
004980     EXIT.                                                        00498000
004990******************************************************************00499000
005000 READ-ACT-REC SECTION.                                            00500000
005010 RAR-START.                                                       00501000
005020     IF RPRF21-BASE-ACCOUNT IS NOT GREATER THAN SPACES            00502000
005030         MOVE 'I' TO WS-FUNCTION                                  00503000
005040         MOVE 'T' TO RPRF21-RETURN                                00504000
005050         MOVE 0031 TO RPRF21-ABTRACE                              00505000
005060         GO TO RAR-RETURN.                                        00506000
005070     IF WS-ACTOPEN IS NOT EQUAL TO 'Y'                            00507000
005080         PERFORM OPEN-ROUTINE.                                    00508000
005090     MOVE LOW-VALUES TO RFACT-GRP-KEY.                            00509000
005100     MOVE RPRF21-BASE-ACCOUNT TO RFACT-GRP-KEY.                   00510000
005110 RAR-GET-ACT.                                                     00511000
005120     PERFORM RCF-ACT-GET-REQUEST.                                 00512000
005130     IF WS-FUNCTION IS EQUAL TO 'N'                               00513000
005140         MOVE 'N' TO WS-FUNCTION                                  00514000
005150         MOVE 'T' TO RPRF21-RETURN                                00515000
005160         MOVE 0032 TO RPRF21-ABTRACE                              00516000
005170         GO TO RAR-RETURN.                                        00517000
005180     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00518000
005190         MOVE 'T' TO RPRF21-RETURN                                00519000
005200         MOVE 0033 TO RPRF21-ABTRACE                              00520000
005210         GO TO RETURN-ROUTINE.                                    00521000
005220     IF RFACT-STATUS IS EQUAL TO 'O'                              00522000
005230         GO TO RAR-END.                                           00523000
005240     IF RPRF21-CLOSEDACCTOPT IS EQUAL TO 'Y'                      00524000
005250         AND RFACT-STATUS IS NOT EQUAL TO 'D'                     00525000
005260         MOVE 'O' TO RFACT-STATUS.                                00526000
005270 RAR-END.                                                         00527000
005280     MOVE RFACT-RECORD TO RPRF21-RETURNED-OBJECT.                 00528000
005290     MOVE RFACT-APPL-INST TO RPRF21-ACCT-ALT-INST.                00529000
005300 RAR-RETURN.                                                      00530000
005310     GO TO RETURN-ROUTINE.                                        00531000
005320 RAR-EXIT.                                                        00532000
005330     EXIT.                                                        00533000
005340******************************************************************00534000
005350 GET-CUSTOMER-INFO SECTION.                                       00535000
005360 GCI-START.                                                       00536000
005370     IF RPRF21-BASE-CUSTOMER IS NOT GREATER THAN SPACES           00537000
005380         MOVE 'I' TO WS-FUNCTION                                  00538000
005390         MOVE 'G' TO RPRF21-RETURN                                00539000
005400         MOVE 0035 TO RPRF21-ABTRACE                              00540000
005410         GO TO GCI-RETURN.                                        00541000
005420     IF WS-CRFOPEN IS NOT EQUAL TO 'Y'                            00542000
005430         OR WS-NONOPEN IS NOT EQUAL TO 'Y'                        00543000
005440         PERFORM OPEN-ROUTINE.                                    00544000
005450 GCI-CRF.                                                         00545000
005460     IF RPRF21-BASE-CUST-TYPE IS NOT EQUAL TO 'R'                 00546000
005470         GO TO GCI-NON.                                           00547000
005480     MOVE RPRF21-BASE-CUSTOMER TO RFCRF-GRP-KEY.                  00548000
005490     PERFORM RCF-CRF-GET-REQUEST.                                 00549000
005500     IF WS-FUNCTION IS EQUAL TO 'N'                               00550000
005510         MOVE 'G' TO RPRF21-RETURN                                00551000
005520         MOVE 0036 TO RPRF21-ABTRACE                              00552000
005530         GO TO GCI-RETURN.                                        00553000
005540     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00554000
005550         MOVE 'G' TO RPRF21-RETURN                                00555000
005560         MOVE 0037 TO RPRF21-ABTRACE                              00556000
005570         GO TO RETURN-ROUTINE.                                    00557000
005580     MOVE RFCRF-GRP-KEY TO RPRF21-BASE-CUSTOMER.                  00558000
005590     MOVE RFCRF-NAME TO RPRF21-NAME.                              00559000
005600     MOVE RFCRF-RECORD TO RPRF21-RETURNED-OBJECT.                 00560000
005610     GO TO GCI-RETURN.                                            00561000
005620 GCI-NON.                                                         00562000
005630     MOVE RPRF21-BASE-CUSTOMER TO RFNON-GRP-KEY.                  00563000
005640     PERFORM RCF-NON-GET-REQUEST.                                 00564000
005650     IF WS-FUNCTION IS EQUAL TO 'N'                               00565000
005660         MOVE 'G' TO RPRF21-RETURN                                00566000
005670         MOVE 0038 TO RPRF21-ABTRACE                              00567000
005680         GO TO GCI-RETURN.                                        00568000
005690     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00569000
005700         MOVE 'G' TO RPRF21-RETURN                                00570000
005710         MOVE 0039 TO RPRF21-ABTRACE                              00571000
005720         GO TO RETURN-ROUTINE.                                    00572000
005730     MOVE RFNON-GRP-KEY TO RPRF21-BASE-CUSTOMER.                  00573000
005740     MOVE RFNON-NAME TO RPRF21-NAME.                              00574000
005750     MOVE RFNON-RECORD TO RPRF21-RETURNED-OBJECT.                 00575000
005760 GCI-RETURN.                                                      00576000
005770     GO TO RETURN-ROUTINE.                                        00577000
005780 GCI-EXIT.                                                        00578000
005790     EXIT.                                                        00579000
005800******************************************************************00580000
005810 CHECK-ACCT-RPS-REL SECTION.                                      00581000
005820 CARR-START.                                                      00582000
005830     IF RPRF21-BASE-ACCOUNT IS NOT GREATER THAN SPACES            00583000
005840         MOVE 'I' TO WS-FUNCTION                                  00584000
005850         MOVE 'U' TO RPRF21-RETURN                                00585000
005860         MOVE 0040 TO RPRF21-ABTRACE                              00586000
005870         GO TO CARR-RETURN.                                       00587000
005880     IF WS-ACCOPEN IS NOT EQUAL TO 'Y'                            00588000
005890         OR WS-CACOPEN IS NOT EQUAL TO 'Y'                        00589000
005900         PERFORM OPEN-ROUTINE.                                    00590000
005910     MOVE LOW-VALUES TO RFACC-GRP-KEY.                            00591000
005920     MOVE RPRF21-BASE-ACCOUNT TO RFACC-ACCT-GRP.                  00592000
005930 CARR-GET-ACC.                                                    00593000
005940     PERFORM RCF-ACC-GET-GE-REQUEST.                              00594000
005950     IF WS-FUNCTION IS EQUAL TO 'E'                               00595000
005960         MOVE 'N' TO WS-FUNCTION                                  00596000
005970         MOVE 'U' TO RPRF21-RETURN                                00597000
005980         MOVE 0041 TO RPRF21-ABTRACE                              00598000
005990         GO TO CARR-RETURN.                                       00599000
006000     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00600000
006010         MOVE 'U' TO RPRF21-RETURN                                00601000
006020         MOVE 0042 TO RPRF21-ABTRACE                              00602000
006030         GO TO CARR-RETURN.                                       00603000
006040     IF RFACC-ACCT-GRP IS NOT EQUAL TO RPRF21-BASE-ACCOUNT        00604000
006050         MOVE 'N' TO WS-FUNCTION                                  00605000
006060         MOVE 'U' TO RPRF21-RETURN                                00606000
006070         MOVE 0043 TO RPRF21-ABTRACE                              00607000
006080         GO TO CARR-RETURN.                                       00608000
006090     IF RFACC-REL IS GREATER THAN +99                             00609000
006100         MOVE 'N' TO WS-FUNCTION                                  00610000
006110         MOVE 'U' TO RPRF21-RETURN                                00611000
006120         MOVE 0044 TO RPRF21-ABTRACE                              00612000
006130         GO TO CARR-RETURN.                                       00613000
006140     MOVE RFACC-CUST-GRP TO RPRF21-BASE-CUSTOMER.                 00614000
006150     IF RFACC-CUST-GRP IS NOT GREATER THAN SPACES                 00615000
006160         MOVE 'I' TO WS-FUNCTION                                  00616000
006170         MOVE 'U' TO RPRF21-RETURN                                00617000
006180         MOVE 0045 TO RPRF21-ABTRACE                              00618000
006190         GO TO CARR-RETURN.                                       00619000
006200 CARR-CAC.                                                        00620000
006210     MOVE LOW-VALUES TO RFCAC-GRP-KEY.                            00621000
006220     MOVE RPRF21-BASE-CUSTOMER TO RFCAC-CUST-GRP.                 00622000
006230     MOVE RFACC-INST TO RFCAC-ACCT-INST.                          00623000
006240     MOVE RPRF21-RPS-PRODCD TO RFCAC-PRODCODE.                    00624000
006250     PERFORM RCF-CAC-GET-GE-REQUEST.                              00625000
006260     IF WS-FUNCTION IS EQUAL TO 'E'                               00626000
006270         MOVE SPACE TO WS-FUNCTION                                00627000
006280         MOVE 'U' TO RPRF21-RETURN                                00628000
006290         GO TO CARR-RETURN.                                       00629000
006300     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00630000
006310         MOVE 'U' TO RPRF21-RETURN                                00631000
006320         MOVE 0046 TO RPRF21-ABTRACE                              00632000
006330         GO TO CARR-RETURN.                                       00633000
006340     IF RFCAC-CUST-GRP IS NOT EQUAL TO RPRF21-BASE-CUSTOMER       00634000
006350         MOVE SPACE TO WS-FUNCTION                                00635000
006360         MOVE 'U' TO RPRF21-RETURN                                00636000
006370         GO TO CARR-RETURN.                                       00637000
006380     IF RFCAC-ACCT-INST IS EQUAL TO RFACC-INST                    00638000
006390         AND RFCAC-PRODCODE IS EQUAL TO RPRF21-RPS-PRODCD         00639000
006400         MOVE 'N' TO WS-FUNCTION                                  00640000
006410         MOVE 'U' TO RPRF21-RETURN                                00641000
006420         MOVE 0047 TO RPRF21-ABTRACE                              00642000
006430         GO TO CARR-RETURN.                                       00643000
006440 CARR-RETURN.                                                     00644000
006450     GO TO RETURN-ROUTINE.                                        00645000
006460 CARR-EXIT.                                                       00646000
006470     EXIT.                                                        00647000
006480***************************************************************** 00648000
006490 GET-FILE-ORGANIZATION SECTION.                                   00649000
000000 COPY SRP093.                                                     00650000
006510******************************************************************00651000
000000 COPY RFPACCA.                                                    00652000
006530******************************************************************00653000
000000 COPY RFPACTA.                                                    00654000
006550******************************************************************00655000
000000 COPY RFPCACA.                                                    00656000
006570******************************************************************00657000
000000 COPY RFPCRFA.                                                    00658000
006590******************************************************************00659000
000000 COPY RFPNONA.                                                    00660000
006610******************************************************************00661000
006620 RETURN-ROUTINE SECTION.                                          00662000
006630 RT-START.                                                        00663000
006640     MOVE WS-FUNCTION TO RPRF21-FUNCTION.                         00664000
006650     GOBACK.                                                      00665000
006660******************************************************************00666000
