000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL100.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL100 -  RELATIONSHIP INQUIRY 1                            *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRCONS.                                                    00024000
000000 COPY BICRCONS.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRPAN.                                                     00028000
000000 COPY BICRPAN.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  RPV100K-PANL-DATA-BLOCK.                                     00032000
000000 COPY RPV100KW.                                                   00033000
000340 01  RPV100-PANL-DATA-BLOCK.                                      00034000
000000 COPY RPV100W.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00037000
000380     03  WS-NEXTKEY.                                              00038000
000390         05  WS-EXTID            PIC X(08).                       00039000
000400         05  WS-DELIM1           PIC X(01)       VALUE ','.       00040000
000410         05  WS-DATA.                                             00041000
000420             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00042000
000430             07  WS-DELIM2       PIC X(01)       VALUE ','.       00043000
000440             07  WS-ACCTX.                                        00044000
000450                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00045000
000460             07  WS-DELIM3       PIC X(01)       VALUE ','.       00046000
000470             07  WS-MODEL        PIC X(10)       VALUE SPACES.    00047000
000480         05  FILLER              PIC X(42)       VALUE SPACES.    00048000
000490     03  WS-MORE                 PIC X(05)       VALUE 'More:'.   00049000
000500     03  WS-LNKPROG1             PIC X(08)       VALUE 'RPLXXX01'.00050000
000510     03  WS-LKLGTH               PIC S9(04)      COMP             00051000
000520                                                 VALUE +4088.     00052000
000530     03  WS-PDATE                PIC 9(08).                       00053000
000540     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00054000
000550         05  WS-PDATE-YYYY       PIC 9(04).                       00055000
000560         05  WS-PDATE-MM         PIC 9(02).                       00056000
000570         05  WS-PDATE-DD         PIC 9(02).                       00057000
000580     03  WS-SUB1                 PIC S9(04)      COMP             00058000
000590                                                 VALUE +0000.     00059000
000600     03  WS-SUB2                 PIC S9(04)      COMP             00060000
000610                                                 VALUE +0000.     00061000
000620 01  WS-LINKMSG                  PIC X(4500).                     00062000
000630 01  RPXXX01-MESSAGE.                                             00063000
000000 COPY MISCNT00      REPLACING                                     00064000
000650             ==:MICNT:== BY ==RPXXX01==.                          00065000
000000 COPY RPSXXX01.                                                   00066000
000670 01  WS-TSQAREAS.                                                 00067000
000680     03  WS-TSQITEM              PIC S9(04)      COMP             00068000
000690                                                 VALUE +0001.     00069000
000700     03  WS-TSQLGTH              PIC S9(04)      COMP             00070000
000710                                                 VALUE +4096.     00071000
000720     03  WS-TSQKEY.                                               00072000
000730         05  WS-TSQID            PIC X(04).                       00073000
000740         05  WS-TSQTRMID         PIC X(04).                       00074000
000750 01  LS-TSQAREA.                                                  00075000
000760     03  LS-TSQKEY               PIC X(08).                       00076000
000770     03  LS-TSQDATA              PIC X(4088).                     00077000
000780 01  MIWPRI-AREAS.                                                00078000
000000 COPY MIWPRI.                                                     00079000
000800 01  MIWMSTA-AREAS.                                               00080000
000000 COPY MIWMSTA.                                                    00081000
000820 01  MIMST-RECORD.                                                00082000
000000 COPY MISMST.                                                     00083000
000840 01  MI2023-RECORD.                                               00084000
000000 COPY MIS2023A.                                                   00085000
000860 01  WS-ABORTCODES.                                               00086000
000870     03  WS-AB0009               PIC S9(04)      COMP             00087000
000880                                                 VALUE +0009.     00088000
000890     03  WS-AB0106               PIC S9(04)      COMP             00089000
000900                                                 VALUE +0106.     00090000
000910     03  WS-AB2033               PIC S9(04)      COMP             00091000
000920                                                 VALUE +2033.     00092000
000930     03  WS-AB6345               PIC S9(04)      COMP             00093000
000940                                                 VALUE +6345.     00094000
000950 01  WS-TRACECODES.                                               00095000
000960     03  WS-TR0001               PIC S9(04)      COMP             00096000
000970                                                 VALUE +0001.     00097000
000980     03  WS-TR0002               PIC S9(04)      COMP             00098000
000990                                                 VALUE +0002.     00099000
001000     03  WS-TR0003               PIC S9(04)      COMP             00100000
001010                                                 VALUE +0003.     00101000
001020 01  SLW096-AREAS.                                                00102000
000000 COPY SLW096.                                                     00103000
001040 01  RPW014-AREAS.                                                00104000
000000 COPY RPW014.                                                     00105000
001060 01  RPW033-AREAS.                                                00106000
000000 COPY RPW033.                                                     00107000
001080 01  RPW130-AREAS.                                                00108000
000000 COPY RPW130.                                                     00109000
001100 01  SRW000-AREAS.                                                00110000
000000 COPY SRW000.                                                     00111000
001120 01  SRW025-AREAS.                                                00112000
000000 COPY SRW025.                                                     00113000
001140 01  SRW030-AREAS.                                                00114000
000000 COPY SRW030.                                                     00115000
001160 01  SRW031-AREAS.                                                00116000
000000 COPY SRW031.                                                     00117000
001180 01  SRW105-AREAS.                                                00118000
000000 COPY SRW105.                                                     00119000
001200 01  SRW161-AREAS.                                                00120000
000000 COPY SRW161.                                                     00121000
001220 01  SRW170-AREAS.                                                00122000
000000 COPY SRW170.                                                     00123000
001240 COPY DFHAID.                                                     00124000
001250******************************************************************00125000
001260 LINKAGE SECTION.                                                 00126000
001270 01  DFHCOMMAREA.                                                 00127000
000000 COPY SLS1112.                                                    00128000
001290     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00129000
001300         05  COM-EDIT-DATE       PIC X(10).                       00130000
001310         05  COM-KEY-INFO.                                        00131000
001320             07  COM-KEY-OCCUR   PIC S9(04)      COMP-3.          00132000
001330         05  COM-KEY-FIELDS.                                      00133000
001340             07  COM-KEY-PRODCODE                                 00134000
001350                                 PIC X(06).                       00135000
001360             07  COM-KEY-ACCOUNT PIC X(18).                       00136000
001370             07  COM-KEY-ACCOUNT-N                                00137000
001380                         REDEFINES COM-KEY-ACCOUNT                00138000
001390                                 PIC 9(18).                       00139000
001400             07  COM-KEY-MODEL                                    00140000
001410                                 PIC X(10).                       00141000
001420             07  COM-KEY-IDNBRX  PIC X(18).                       00142000
001430             07  COM-KEY-IDNBR                                    00143000
001440                         REDEFINES COM-KEY-IDNBRX                 00144000
001450                                 PIC 9(18).                       00145000
001460         05  COM-PANEL-ACTION    PIC X(01)       VALUE SPACE.     00146000
001470             88  INITIAL-PANEL                   VALUE ' '.       00147000
001480             88  EDIT-PANEL                      VALUE 'E'.       00148000
001490         05  COM-FROM-PANEL      PIC X(01)       VALUE SPACE.     00149000
001500             88  FROM-KEY-PANEL                  VALUE 'K'.       00150000
001510             88  FROM-INFO-PANEL                 VALUE 'I'.       00151000
001520             88  FROM-HELP                       VALUE 'H'.       00152000
001530             88  FROM-BREAKAWAY                  VALUE 'B'.       00153000
001540         05  COM-KEY-FORMATTEDACCT                                00154000
001550                                 PIC X(22).                       00155000
001560         05  COM-KEY-MSGNBR      PIC X(06).                       00156000
001570         05  COM-KEY-COMMAND     PIC X(50).                       00157000
001580         05  COM-MORE            PIC X(01).                       00158000
001590         05  COM-RPXXX01-CURPAGE PIC S9(04)      COMP-3.          00159000
001600         05  COM-RPXXX01-OCCUR   PIC S9(04)      COMP-3.          00160000
001610         05  COM-CUST-TYPE       PIC X(01).                       00161000
001620         05  COM-CUST-NAME       PIC X(40).                       00162000
001630         05  COM-MODEL           PIC 9(05).                       00163000
001640         05  COM-MODEL-DESC      PIC X(20).                       00164000
001650         05  COM-PRIM-OPTION     PIC X(01).                       00165000
001660         05  COM-COMB-REQ1       PIC S9(13)V99   COMP-3.          00166000
001670         05  COM-COMB-REQ2       PIC S9(13)V99   COMP-3.          00167000
001680         05  COM-COMB-REQ3       PIC S9(13)V99   COMP-3.          00168000
001690         05  COM-COMB-REQ4       PIC S9(13)V99   COMP-3.          00169000
001700         05  COM-PRIM-BAL        PIC S9(13)V99   COMP-3.          00170000
001710         05  COM-PRIM-REQ        PIC S9(13)V99   COMP-3.          00171000
001720         05  COM-WK-PRODCODE     PIC X(06).                       00172000
001730         05  COM-IDNUMBER        PIC 9(18).                       00173000
001740******************************************************************00174000
001750*01  SLW096-2023RECORDS.                                          00175000
000000 COPY SLW096L.                                                    00176000
001770******************************************************************00177000
001780 PROCEDURE DIVISION.                                              00178000
001790******************************************************************00179000
001800 ENTRY-ROUTINE SECTION.                                           00180000
001810     MOVE 'RPL100' TO COM-ABPROGID.                               00181000
000000 COPY SLP771.                                                     00182000
001830******************************************************************00183000
001840 TRANSACTION-CLEAN-UP SECTION.                                    00184000
001850 TCU-START.                                                       00185000
001860 TCU-EXIT.                                                        00186000
001870     EXIT.                                                        00187000
001880******************************************************************00188000
001890 CICS-HANDLE-CONDITION SECTION.                                   00189000
000000 COPY SLP772.                                                     00190000
001910     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00191000
001920         GO TO CTSRI-EXIT.                                        00192000
001930     MOVE WS-AB2033 TO COM-ABORT.                                 00193000
001940     MOVE WS-TR0001 TO COM-ABTRACE.                               00194000
001950     GO TO ABORT-EXIT.                                            00195000
001960 CHC-EXIT.                                                        00196000
001970     EXIT.                                                        00197000
001980******************************************************************00198000
001990 ROUTING-ROUTINE SECTION.                                         00199000
002000 RR-START.                                                        00200000
002010     MOVE LOW-VALUES TO RPXXX01-MESSAGE.                          00201000
002020     MOVE LOW-VALUES TO RPV100-PANL-DATA-AREA.                    00202000
002030     MOVE LOW-VALUES TO RPV100K-PANL-DATA-AREA.                   00203000
002040     MOVE ALL ZEROS TO WS-MSGNBR.                                 00204000
002050     IF COM-RETURN IS EQUAL TO 'B'                                00205000
002060         OR COM-BKPGRMID IS EQUAL TO SPACE                        00206000
002070         MOVE 'RP00' TO WS-TSQFILEID                              00207000
002080     ELSE                                                         00208000
002090         MOVE 'RP01' TO WS-TSQFILEID.                             00209000
002100     MOVE 'RPI' TO WS-TSQSYSID.                                   00210000
002110     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00211000
002120     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00212000
002130     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00213000
002140         MOVE COM-PAN TO BICRPAN                                  00214000
002150         MOVE COM-PSB TO BICRPSB                                  00215000
002160         MOVE COM-SRB TO BICRSRB                                  00216000
002170     ELSE                                                         00217000
002180         MOVE '1' TO BPSB-LEVEL.                                  00218000
002190     IF COM-RETURN IS EQUAL TO 'B'                                00219000
002200         GO TO BREAKAWAY-RETURN.                                  00220000
002210     IF COM-RETURN IS EQUAL TO '0'                                00221000
002220         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00222000
002230         MOVE SPACES TO COM-WORKAREAS                             00223000
002240         MOVE '1' TO SRB-VERSION                                  00224000
002250         MOVE 'IPRP' TO SRB-APPL-ID                               00225000
002260         MOVE 'RPL100' TO SRB-PROG-ID                             00226000
002270         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00227000
002280         MOVE 'P' TO PAN-TYPE                                     00228000
002290         MOVE SPACE TO PAN-OVERLAY                                00229000
002300         MOVE SPACE TO PAN-CLOSE                                  00230000
002310         MOVE SPACE TO PAN-ALARM                                  00231000
002320         MOVE SPACE TO PAN-CURSOR-PAN                             00232000
002330         MOVE SPACE TO PAN-CURSOR-FLD                             00233000
002340         MOVE SPACE TO PAN-SET-FLD                                00234000
002350         MOVE SPACE TO PAN-SET-VID                                00235000
002360         MOVE SPACE TO PAN-SET-EMP                                00236000
002370         MOVE +0 TO COM-RPXXX01-CURPAGE                           00237000
002380         MOVE +0 TO COM-RPXXX01-OCCUR                             00238000
002390         MOVE PDB-RPV100K-NAME TO PAN-NAME                        00239000
002400         PERFORM PANEL-INIT                                       00240000
002410         MOVE BICRPAN TO COM-PAN                                  00241000
002420         MOVE BICRPSB TO COM-PSB                                  00242000
002430         MOVE BICRSRB TO COM-SRB                                  00243000
002440         PERFORM INITIALIZE-DATE                                  00244000
002450         GO TO PANEL-ROUTER.                                      00245000
002460     PERFORM PANEL-NAME-SET.                                      00246000
002470     IF COM-HELPSW IS EQUAL TO 'Y'                                00247000
002480         GO TO HELP-RETURN.                                       00248000
002490     PERFORM PANEL-RECEIVE.                                       00249000
002500     PERFORM PANEL-DATA-GET.                                      00250000
002510     PERFORM PANEL-PFKEY-SET.                                     00251000
002520     PERFORM VALIDATE-PFKEYS.                                     00252000
002530     IF EIBAID IS EQUAL TO DFHPF1                                 00253000
002540         GO TO GET-HELP.                                          00254000
002550     IF EIBAID IS EQUAL TO DFHPF6                                 00255000
002560         PERFORM BUILD-CRW-NEXTKEY                                00256000
002570         PERFORM COMPRESS-NEXTKEY                                 00257000
002580         MOVE WS-NEXTKEY TO RPV100-COMMAND                        00258000
002590         GO TO BREAK-AWAY.                                        00259000
002600     IF EIBAID IS EQUAL TO DFHPF11                                00260000
002610         GO TO BREAK-AWAY.                                        00261000
002620     IF (COM-RETURN IS EQUAL TO 'E'                               00262000
002630         OR COM-RETURN IS EQUAL TO '1')                           00263000
002640         AND (EIBAID IS EQUAL TO DFHPF2                           00264000
002650         OR EIBAID IS EQUAL TO DFHPF3                             00265000
002660         OR EIBAID IS EQUAL TO DFHPF4                             00266000
002670         OR EIBAID IS EQUAL TO DFHPF7                             00267000
002680         OR EIBAID IS EQUAL TO DFHPF8                             00268000
002690         OR EIBAID IS EQUAL TO DFHPF12)                           00269000
002700         GO TO CLOSE-TRANSACTION.                                 00270000
002710     IF COM-RETURN IS EQUAL TO '0'                                00271000
002720         OR COM-RETURN IS EQUAL TO 'E'                            00272000
002730         OR COM-RETURN IS EQUAL TO '1'                            00273000
002740         GO TO PANEL-ROUTER.                                      00274000
002750 RR-END.                                                          00275000
002760     GO TO CLOSE-TRANSACTION.                                     00276000
002770 RR-EXIT.                                                         00277000
002780     EXIT.                                                        00278000
002790******************************************************************00279000
002800 INITIALIZE-DATE SECTION.                                         00280000
002810 ID-START.                                                        00281000
002820     MOVE COM-DATE TO WS-CURDATE8.                                00282000
002830     MOVE '-' TO WS-CD8DSH1.                                      00283000
002840     MOVE '-' TO WS-CD8DSH2.                                      00284000
002850     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00285000
002860 ID-EXIT.                                                         00286000
002870     EXIT.                                                        00287000
002880******************************************************************00288000
002890 PANEL-NAME-SET SECTION.                                          00289000
002900 PNS-START.                                                       00290000
002910     IF COM-RETURN IS EQUAL TO '0'                                00291000
002920         MOVE PDB-RPV100K-NAME TO PAN-NAME.                       00292000
002930     IF COM-RETURN IS EQUAL TO 'E'                                00293000
002940         MOVE PDB-RPV100K-NAME TO PAN-NAME.                       00294000
002950     IF COM-RETURN IS EQUAL TO '1'                                00295000
002960         MOVE PDB-RPV100-NAME TO PAN-NAME.                        00296000
002970 PNS-EXIT.                                                        00297000
002980     EXIT.                                                        00298000
002990******************************************************************00299000
003000 PANEL-DATA-GET SECTION.                                          00300000
003010 PDG-START.                                                       00301000
003020     IF COM-RETURN IS EQUAL TO '0'                                00302000
003030         PERFORM PANEL-GET-RPV100K.                               00303000
003040     IF COM-RETURN IS EQUAL TO 'E'                                00304000
003050         PERFORM PANEL-GET-RPV100K                                00305000
003060         MOVE RPV100K-COMMAND TO WS-NEXTKEY                       00306000
003070         MOVE PDB-RPV100K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00307000
003080     IF COM-RETURN IS EQUAL TO '1'                                00308000
003090         PERFORM PANEL-GET-RPV100                                 00309000
003100         MOVE RPV100-COMMAND TO WS-NEXTKEY                        00310000
003110         MOVE PDB-RPV100-COMMAND-DCHG TO WS-COMMAND-DCHG.         00311000
003120 PDG-EXIT.                                                        00312000
003130     EXIT.                                                        00313000
003140******************************************************************00314000
003150 PANEL-PFKEY-SET SECTION.                                         00315000
003160 PPS-START.                                                       00316000
003170     MOVE 'N' TO WS-PF6-FLG.                                      00317000
003180* IF ALREADY IN BREAKAWAY MODE, DON'T SET PF6 KEY                 00318000
003190     IF COM-BKPGRMID IS NOT EQUAL TO SPACES                       00319000
003200         GO TO PPS-EXIT.                                          00320000
003210     IF COM-RETURN IS EQUAL TO '1'                                00321000
003220         AND RPV100-CRWPROD IS NOT EQUAL TO SPACES                00322000
003230         MOVE 'PRO2  ' TO WS-PF6                                  00323000
003240         MOVE 'Pro2  ' TO WS-PF6L                                 00324000
003250         MOVE 'A' TO WS-PF6-FLG.                                  00325000
003260 PPS-EXIT.                                                        00326000
003270     EXIT.                                                        00327000
003280******************************************************************00328000
003290 PANEL-ROUTER SECTION.                                            00329000
003300 PR-START.                                                        00330000
003310     IF COM-RETURN IS EQUAL TO '0'                                00331000
003320         GO TO PROCESS-KEY-PANEL.                                 00332000
003330     IF COM-RETURN IS EQUAL TO 'E'                                00333000
003340         GO TO PROCESS-KEY-PANEL.                                 00334000
003350     IF COM-RETURN IS EQUAL TO '1'                                00335000
003360         GO TO PROCESS-INFO-PANEL.                                00336000
003370     GO TO CLOSE-TRANSACTION.                                     00337000
003380 PR-EXIT.                                                         00338000
003390     EXIT.                                                        00339000
003400******************************************************************00340000
003410 HELP-RETURN SECTION.                                             00341000
000000 COPY SRP074.                                                     00342000
003430******************************************************************00343000
003440 HELP-RETURN-FINISH SECTION.                                      00344000
003450 HRF-START.                                                       00345000
003460     PERFORM PANEL-DATA-GET.                                      00346000
003470     MOVE 'H' TO COM-FROM-PANEL.                                  00347000
003480     GO TO PANEL-ROUTER.                                          00348000
003490 HRF-EXIT.                                                        00349000
003500     EXIT.                                                        00350000
003510******************************************************************00351000
003520 HELP-MISSING-FINISH SECTION.                                     00352000
003530 HMF-START.                                                       00353000
003540     MOVE 'H' TO COM-FROM-PANEL.                                  00354000
003550     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00355000
003560     GO TO PANEL-ROUTER.                                          00356000
003570 HMF-EXIT.                                                        00357000
003580     EXIT.                                                        00358000
003590******************************************************************00359000
003600 BREAK-AWAY SECTION.                                              00360000
000000 COPY SRP0752.                                                    00361000
003620******************************************************************00362000
003630 BREAKAWAY-RETURN-FINISH SECTION.                                 00363000
003640 BRF-START.                                                       00364000
003650     PERFORM PANEL-DATA-GET.                                      00365000
003660     MOVE 'B' TO COM-FROM-PANEL.                                  00366000
003670     GO TO PANEL-ROUTER.                                          00367000
003680 BRF-EXIT.                                                        00368000
003690     EXIT.                                                        00369000
003700******************************************************************00370000
003710 PROCESS-KEY-PANEL SECTION.                                       00371000
003720 PKP-START.                                                       00372000
003730     IF INITIAL-PANEL                                             00373000
003740         MOVE COM-NEXTKEY TO COM-EXTERNALID                       00374000
003750         GO TO PKP-COM-INIT.                                      00375000
003760     IF EDIT-PANEL                                                00376000
003770         AND FROM-INFO-PANEL                                      00377000
003780         MOVE SPACE TO COM-FROM-PANEL                             00378000
003790         GO TO PKP-RELOAD-PANEL.                                  00379000
003800 PKP-COM-INIT.                                                    00380000
003810     MOVE COM-NEXTKEY TO SR-PSLIST.                               00381000
003820     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00382000
003830         GO TO PKP-SEND-PANEL.                                    00383000
003840 PKP-BEGIN-EDITS.                                                 00384000
003850     IF EDIT-PANEL                                                00385000
003860         MOVE RPV100K-PRODCD TO COM-KEY-PRODCODE                  00386000
003870         MOVE RPV100K-ACCOUNT TO COM-KEY-ACCOUNT                  00387000
003880         MOVE RPV100K-MODEL TO COM-KEY-MODEL                      00388000
003890         MOVE RPV100K-IDNBR TO COM-KEY-IDNBRX                     00389000
003900         GO TO PKP-RETURN-EDITS.                                  00390000
003910     PERFORM PARAMETER-SEARCH.                                    00391000
003920     MOVE SR-PSPARM TO COM-EXTID.                                 00392000
003930     MOVE SR-PSPARM TO COM-EXTERNALID.                            00393000
003940     PERFORM PARAMETER-SEARCH.                                    00394000
003950     MOVE SR-PSPARM TO COM-KEY-PRODCODE.                          00395000
003960     PERFORM PARAMETER-SEARCH.                                    00396000
003970     MOVE SR-PSPARM TO COM-KEY-ACCOUNT.                           00397000
003980     PERFORM PARAMETER-SEARCH.                                    00398000
003990     MOVE SR-PSPARM TO COM-KEY-MODEL.                             00399000
004000     PERFORM PARAMETER-SEARCH.                                    00400000
004010     MOVE SR-PSPARM TO COM-KEY-IDNBRX.                            00401000
004020 PKP-RETURN-EDITS.                                                00402000
004030     IF COM-KEY-PRODCODE IS EQUAL TO SPACE                        00403000
004040         MOVE LOW-VALUE TO COM-KEY-PRODCODE.                      00404000
004050     IF COM-KEY-ACCOUNT IS EQUAL TO SPACE                         00405000
004060         MOVE LOW-VALUE TO COM-KEY-ACCOUNT.                       00406000
004070     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00407000
004080         MOVE LOW-VALUES TO COM-KEY-MODEL.                        00408000
004090     IF COM-KEY-IDNBRX IS EQUAL TO SPACES                         00409000
004100         MOVE LOW-VALUES TO COM-KEY-IDNBRX.                       00410000
004110     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00411000
004120         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00412000
004130         AND COM-KEY-IDNBRX IS GREATER THAN LOW-VALUE             00413000
004140         GO TO PKP-RETURN-CONT.                                   00414000
004150     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00415000
004160         MOVE '000002' TO WS-MSGNBR                               00416000
004170         GO TO PKP-RETURN-CONT.                                   00417000
004180     PERFORM EDIT-ACCOUNT-KEY.                                    00418000
004190 PKP-RETURN-CONT.                                                 00419000
004200     IF INITIAL-PANEL                                             00420000
004210         AND COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE               00421000
004220         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00422000
004230         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00423000
004240         AND COM-KEY-IDNBRX IS EQUAL TO LOW-VALUE                 00424000
004250         MOVE '000001' TO WS-MSGNBR                               00425000
004260         GO TO PKP-SEND-PANEL.                                    00426000
004270     IF COM-WKUNAME (1:2) IS EQUAL TO 'RF'                        00427000
004280         IF COM-RETURN IS NOT EQUAL TO 'E'                        00428000
004290             MOVE COM-KEY-PRODCODE TO COM-WK-PRODCODE             00429000
004300             MOVE COM-KEY-ACCOUNT TO COM-IDNUMBER                 00430000
004310             MOVE COM-KEY-ACCOUNT TO COM-KEY-IDNBRX               00431000
004320             MOVE LOW-VALUES TO COM-KEY-PRODCODE                  00432000
004330             MOVE LOW-VALUES TO COM-KEY-ACCOUNT                   00433000
004340         END-IF                                                   00434000
004350     END-IF.                                                      00435000
004360     MOVE COM-KEY-IDNBRX TO SR-JUSTIFYIN.                         00436000
004370     MOVE +0018 TO SR-JLGTH.                                      00437000
004380     PERFORM RIGHT-JUSTIFY.                                       00438000
004390     IF SR-JUSTIFYOUT IS EQUAL TO SPACE                           00439000
004400         MOVE ZEROS TO COM-KEY-IDNBRX                             00440000
004410     ELSE                                                         00441000
004420         MOVE SR-JUSTIFYOUT TO COM-KEY-IDNBRX.                    00442000
004430     IF COM-KEY-IDNBRX IS NOT NUMERIC                             00443000
004440         MOVE ZEROES TO COM-KEY-IDNBRX.                           00444000
004450     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00445000
004460     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00446000
004470     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00447000
004480         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00448000
004490     ELSE                                                         00449000
004500         MOVE ZERO TO COM-ACCOUNT.                                00450000
004510     IF FROM-BREAKAWAY                                            00451000
004520         OR FROM-HELP                                             00452000
004530         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00453000
004540         GO TO PKP-RELOAD-PANEL.                                  00454000
004550     IF COM-KEY-PRODCODE IS GREATER THAN SPACES                   00455000
004560         AND COM-KEY-ACCOUNT IS GREATER THAN SPACES               00456000
004570         AND COM-KEY-IDNBRX IS GREATER THAN ZEROS                 00457000
004580         MOVE '000002' TO WS-MSGNBR                               00458000
004590         GO TO PKP-RELOAD-PANEL.                                  00459000
004600 PKP-EDITS-READY.                                                 00460000
004610     MOVE SPACE TO COM-PANEL-ACTION.                              00461000
004620     MOVE '1' TO COM-RETURN.                                      00462000
004630     MOVE 'K' TO COM-FROM-PANEL.                                  00463000
004640     GO TO PANEL-ROUTER.                                          00464000
004650 PKP-RELOAD-PANEL.                                                00465000
004660     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00466000
004670         MOVE LOW-VALUES TO RPV100K-PRODCD                        00467000
004680     ELSE                                                         00468000
004690         MOVE COM-KEY-PRODCODE TO RPV100K-PRODCD.                 00469000
004700     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00470000
004710         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROS                     00471000
004720         MOVE LOW-VALUES TO RPV100K-ACCOUNT                       00472000
004730     ELSE                                                         00473000
004740         MOVE COM-KEY-ACCOUNT TO RPV100K-ACCOUNT.                 00474000
004750     MOVE COM-KEY-MODEL TO RPV100K-MODEL.                         00475000
004760     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00476000
004770         MOVE LOW-VALUES TO RPV100K-MODEL.                        00477000
004780     MOVE COM-KEY-IDNBRX TO RPV100K-IDNBR.                        00478000
004790     IF COM-KEY-IDNBRX IS NOT GREATER THAN ZEROS                  00479000
004800         MOVE LOW-VALUES TO RPV100K-IDNBR.                        00480000
004810 PKP-SEND-PANEL.                                                  00481000
004820     MOVE PDB-RPV100K-NAME TO PAN-NAME.                           00482000
004830     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00483000
004840     IF FROM-BREAKAWAY                                            00484000
004850         OR FROM-HELP                                             00485000
004860         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00486000
004870     ELSE                                                         00487000
004880         MOVE PDB-RPV100K-PRODCD TO PAN-SET-FLD.                  00488000
004890     PERFORM CALL-BISPAN-RPV100K.                                 00489000
004900     MOVE COM-OPERID TO RPV100K-OPERID.                           00490000
004910     MOVE COM-INST TO RPV100K-INST.                               00491000
004920     MOVE COM-EDIT-DATE TO RPV100K-SYSDATE.                       00492000
004930     IF RPV100K-PRODCD IS EQUAL TO SPACES                         00493000
004940         MOVE LOW-VALUES TO RPV100K-PRODCD.                       00494000
004950     MOVE RPV100K-ACCOUNT TO SR-JUSTIFYIN.                        00495000
004960     MOVE +18 TO SR-JLGTH.                                        00496000
004970     PERFORM LEFT-JUSTIFY.                                        00497000
004980     MOVE SR-JUSTIFYOUT TO RPV100K-ACCOUNT.                       00498000
004990     IF RPV100K-ACCOUNT IS EQUAL TO SPACES                        00499000
005000         MOVE LOW-VALUES TO RPV100K-ACCOUNT.                      00500000
005010     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00501000
005020         MOVE WS-HELPMSG TO WS-MSGNBR.                            00502000
005030     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00503000
005040         MOVE '000027' TO WS-MSGNBR                               00504000
005050     ELSE                                                         00505000
005060         PERFORM BUILD-NEXTKEY                                    00506000
005070         PERFORM COMPRESS-NEXTKEY                                 00507000
005080         MOVE WS-NEXTKEY TO RPV100K-COMMAND.                      00508000
005090     IF FROM-BREAKAWAY                                            00509000
005100         OR FROM-HELP                                             00510000
005110         MOVE SPACE TO COM-FROM-PANEL                             00511000
005120         MOVE COM-KEY-COMMAND TO RPV100K-COMMAND                  00512000
005130         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00513000
005140     ELSE                                                         00514000
005150         MOVE WS-NEXTKEY TO COM-KEY-COMMAND                       00515000
005160         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00516000
005170     MOVE 'E' TO COM-RETURN.                                      00517000
005180     PERFORM GET-MESSAGE.                                         00518000
005190     MOVE WS-MESSAGE TO RPV100K-MSGLINE.                          00519000
005200     PERFORM PANEL-PFKEY-SET.                                     00520000
005210     PERFORM BUILD-PFKEY-LINE.                                    00521000
005220     MOVE WS-PFLINE1 TO RPV100K-PFLINE1.                          00522000
005230     MOVE WS-PFLINE2 TO RPV100K-PFLINE2.                          00523000
005240     PERFORM PANEL-PUT-RPV100K.                                   00524000
005250     PERFORM PANEL-SEND.                                          00525000
005260     MOVE 'E' TO COM-PANEL-ACTION.                                00526000
005270     MOVE COM-INTID TO WS-TRANSID.                                00527000
005280     GO TO CICS-RETURN-TRANSID.                                   00528000
005290 PKP-EXIT.                                                        00529000
005300     EXIT.                                                        00530000
005310******************************************************************00531000
005320 PROCESS-INFO-PANEL SECTION.                                      00532000
005330 PIP-START.                                                       00533000
005340     IF FROM-HELP                                                 00534000
005350         OR FROM-BREAKAWAY                                        00535000
005360         MOVE SPACE TO COM-FROM-PANEL                             00536000
005370         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00537000
005380         MOVE PAN-CURSOR-FLD TO WS-CURSOR-FIELD                   00538000
005390         GO TO PIP-SEND-PANEL.                                    00539000
005400     MOVE 'E' TO COM-END.                                         00540000
005410     IF INITIAL-PANEL                                             00541000
005420         GO TO PIP-CONTINUE.                                      00542000
005430     MOVE COM-NEXTKEY TO WS-NEXTKEY.                              00543000
005440 PIP-PFKEYS.                                                      00544000
005450     MOVE ALL ZEROS TO WS-MSGNBR.                                 00545000
005460     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00546000
005470         GO TO PIP-SEND-PANEL.                                    00547000
005480     IF EIBAID IS EQUAL TO DFHENTER                               00548000
005490         MOVE '2' TO COM-RETURN                                   00549000
005500         MOVE SPACE TO COM-PANEL-ACTION                           00550000
005510         GO TO PANEL-ROUTER.                                      00551000
005520     GO TO PIP-SEND-PANEL.                                        00552000
005530 PIP-CONTINUE.                                                    00553000
005540     MOVE +0 TO RPXXX01-SUB.                                      00554000
005550     PERFORM RPXXX01-LINK-MESSAGE.                                00555000
005560     MOVE RPXXX01-KEY-IDNUMBER TO COM-KEY-IDNBR.                  00556000
005570     IF RPXXX01-KEY-MODEL IS NOT EQUAL TO COM-KEY-MODEL           00557000
005580         MOVE RPXXX01-KEY-MODEL TO COM-KEY-MODEL.                 00558000
005590 PIP-RPXXX01-RETURN-CHECK.                                        00559000
005600     IF RPXXX01-SELECT-RTN IS NOT EQUAL TO '1'                    00560000
005610         AND RPXXX01-SELECT-RTN IS NOT EQUAL TO '2'               00561000
005620         AND RPXXX01-SELECT-RTN IS NOT EQUAL TO '3'               00562000
005630         MOVE WS-AB6345 TO COM-ABORT                              00563000
005640         MOVE WS-TR0002 TO COM-ABTRACE                            00564000
005650         GO TO ABORT-EXIT.                                        00565000
005660     IF RPXXX01-SELECT-RTN IS EQUAL TO '1'                        00566000
005670         AND WS-MSGNBR IS GREATER THAN ZEROS                      00567000
005680         MOVE 'E' TO COM-RETURN                                   00568000
005690         MOVE 'E' TO COM-PANEL-ACTION                             00569000
005700         MOVE 'I' TO COM-FROM-PANEL                               00570000
005710         GO TO PANEL-ROUTER.                                      00571000
005720     IF RPXXX01-SELECT-RTN IS EQUAL TO '1'                        00572000
005730         AND EDIT-PANEL                                           00573000
005740         MOVE 'X' TO COM-RETURN                                   00574000
005750         GO TO PANEL-ROUTER.                                      00575000
005760     IF RPXXX01-SELECT-RTN IS EQUAL TO '1'                        00576000
005770         MOVE '000003' TO WS-MSGNBR                               00577000
005780         MOVE 'E' TO COM-RETURN                                   00578000
005790         MOVE 'E' TO COM-PANEL-ACTION                             00579000
005800         MOVE 'I' TO COM-FROM-PANEL                               00580000
005810         GO TO PANEL-ROUTER.                                      00581000
005820     IF RPXXX01-RETURN IS EQUAL TO 'E'                            00582000
005830         AND FROM-KEY-PANEL                                       00583000
005840         AND INITIAL-PANEL                                        00584000
005850         MOVE RPXXX01-MSGNBR TO WS-MSGNBR                         00585000
005860         MOVE 'E' TO COM-RETURN                                   00586000
005870         MOVE 'E' TO COM-PANEL-ACTION                             00587000
005880         MOVE 'I' TO COM-FROM-PANEL                               00588000
005890         GO TO PANEL-ROUTER.                                      00589000
005900 PIP-PAGING-CONTROLS.                                             00590000
005910     MOVE RPXXX01-CUST-TYPE TO COM-CUST-TYPE.                     00591000
005920     MOVE RPXXX01-CUST-NAME TO COM-CUST-NAME.                     00592000
005930     MOVE RPXXX01-MODEL-DESC TO COM-MODEL-DESC.                   00593000
005940     MOVE RPXXX01-PRIM-OPTION TO COM-PRIM-OPTION.                 00594000
005950     MOVE RPXXX01-COMB-REQ1 TO COM-COMB-REQ1.                     00595000
005960     MOVE RPXXX01-COMB-REQ2 TO COM-COMB-REQ2.                     00596000
005970     MOVE RPXXX01-COMB-REQ3 TO COM-COMB-REQ3.                     00597000
005980     MOVE RPXXX01-COMB-REQ4 TO COM-COMB-REQ4.                     00598000
005990     MOVE RPXXX01-PRIM-BAL TO COM-PRIM-BAL.                       00599000
006000     MOVE RPXXX01-PRIM-REQ TO COM-PRIM-REQ.                       00600000
006010     IF COM-PRODCODE IS EQUAL TO LOW-VALUES                       00601000
006020         MOVE RPXXX01-KEY-PRODCODE TO COM-PRODCODE                00602000
006030         MOVE RPXXX01-KEY-PRODCODE TO COM-KEY-PRODCODE            00603000
006040         MOVE RPXXX01-KEY-ACCOUNT TO COM-KEY-ACCOUNT              00604000
006050         MOVE RPXXX01-KEY-MODEL TO COM-KEY-MODEL.                 00605000
006060     PERFORM EDIT-INFO-PANEL.                                     00606000
006070 PIP-SEND-PANEL.                                                  00607000
006080     IF FROM-HELP                                                 00608000
006090         OR FROM-BREAKAWAY                                        00609000
006100         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00610000
006110         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00611000
006120     ELSE                                                         00612000
006130         MOVE PDB-RPV100-COMMAND TO PAN-SET-FLD.                  00613000
006140     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00614000
006150     PERFORM CALL-BISPAN-RPV100.                                  00615000
006160     MOVE COM-INST TO RPV100-INST.                                00616000
006170     MOVE COM-OPERID TO RPV100-OPERID.                            00617000
006180     MOVE COM-EDIT-DATE TO RPV100-SYSDATE.                        00618000
006190     MOVE COM-KEY-ACCOUNT TO RPV100-ACCOUNT.                      00619000
006200     MOVE COM-PRODCODE TO RPV100-PRODCD.                          00620000
006210     MOVE COM-KEY-MODEL TO RPV100-MODEL.                          00621000
006220     MOVE COM-CUST-NAME TO RPV100-CUSTNA.                         00622000
006230     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00623000
006240         MOVE WS-HELPMSG TO WS-MSGNBR.                            00624000
006250     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00625000
006260         MOVE '000027' TO WS-MSGNBR                               00626000
006270     ELSE                                                         00627000
006280         PERFORM BUILD-NEXTKEY                                    00628000
006290         PERFORM COMPRESS-NEXTKEY                                 00629000
006300         MOVE WS-NEXTKEY TO RPV100-COMMAND.                       00630000
006310     IF FROM-HELP                                                 00631000
006320         OR FROM-BREAKAWAY                                        00632000
006330         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00633000
006340         MOVE COM-KEY-COMMAND TO RPV100-COMMAND                   00634000
006350         MOVE SPACE TO COM-FROM-PANEL                             00635000
006360     ELSE                                                         00636000
006370         MOVE RPV100-COMMAND TO COM-KEY-COMMAND                   00637000
006380         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00638000
006390     PERFORM PANEL-PFKEY-SET.                                     00639000
006400     PERFORM BUILD-PFKEY-LINE.                                    00640000
006410     MOVE WS-PFLINE1 TO RPV100-PFLINE1.                           00641000
006420     MOVE WS-PFLINE2 TO RPV100-PFLINE2.                           00642000
006430     PERFORM GET-MESSAGE.                                         00643000
006440     MOVE WS-MESSAGE TO RPV100-MSGLINE.                           00644000
006450     PERFORM PANEL-PUT-RPV100.                                    00645000
006460     PERFORM PANEL-SEND.                                          00646000
006470     MOVE '1' TO COM-RETURN.                                      00647000
006480     MOVE 'I' TO COM-FROM-PANEL.                                  00648000
006490     MOVE 'E' TO COM-PANEL-ACTION.                                00649000
006500     MOVE COM-INTID TO WS-TRANSID.                                00650000
006510     GO TO CICS-RETURN-TRANSID.                                   00651000
006520 PIP-EXIT.                                                        00652000
006530     EXIT.                                                        00653000
006540******************************************************************00654000
006550 EDIT-INFO-PANEL SECTION.                                         00655000
006560 EIP-START.                                                       00656000
006570     MOVE RPXXX01-MODEL-DESC TO RPV100-MODDESC.                   00657000
006580     MOVE SPACES TO RPV100-RELTYPE.                               00658000
006590     IF RPXXX01-OUT-FLAG IS EQUAL TO 'Y'                          00659000
006600         MOVE '** OUTSIDE RELATIONSHIP **' TO RPV100-RELTYPE.     00660000
006610     MOVE RPXXX01-IDNUMBER TO RPV100-IDNBR.                       00661000
006620     MOVE RPXXX01-DATE-OPENED TO SR-CODASYL.                      00662000
006630     PERFORM EDIT-CODASYL-DATE.                                   00663000
006640     MOVE SR-CODASYL-EDITED TO RPV100-EROLLDT.                    00664000
006650     MOVE RPXXX01-LMNTDT TO SR-CODASYL.                           00665000
006660     PERFORM EDIT-CODASYL-DATE.                                   00666000
006670     MOVE SR-CODASYL-EDITED TO RPV100-MAINTDT.                    00667000
006680     MOVE RPXXX01-EXPIRE-DATE TO SR-CODASYL.                      00668000
006690     PERFORM EDIT-CODASYL-DATE.                                   00669000
006700     MOVE SR-CODASYL-EDITED TO RPV100-EXPREDT.                    00670000
006710     MOVE RPXXX01-EXTENSION-DATE TO SR-CODASYL.                   00671000
006720     PERFORM EDIT-CODASYL-DATE.                                   00672000
006730     MOVE SR-CODASYL-EDITED TO RPV100-EXTENDT.                    00673000
006740     IF RPXXX01-REL-STAT IS EQUAL TO 'A'                          00674000
006750         MOVE 'ACTIVE' TO RPV100-STATUS.                          00675000
006760     IF RPXXX01-REL-STAT IS EQUAL TO 'E'                          00676000
006770         MOVE 'EXPIRED' TO RPV100-STATUS.                         00677000
006780     IF RPXXX01-REL-STAT IS EQUAL TO 'I'                          00678000
006790         MOVE 'INACTIVE' TO RPV100-STATUS.                        00679000
006800     IF RPXXX01-QUAL-STAT IS EQUAL TO 'F'                         00680000
006810         MOVE 'INC FAIL' TO RPV100-QSTATUS.                       00681000
006820     IF RPXXX01-QUAL-STAT IS EQUAL TO 'N'                         00682000
006830         MOVE 'NONE' TO RPV100-QSTATUS.                           00683000
006840     IF RPXXX01-QUAL-STAT IS EQUAL TO 'P'                         00684000
006850         MOVE 'PASS' TO RPV100-QSTATUS.                           00685000
006860     IF RPXXX01-QUAL-STAT IS EQUAL TO 'R'                         00686000
006870         MOVE 'VAL FAIL' TO RPV100-QSTATUS.                       00687000
006880     MOVE RPXXX01-CRW-INST TO RPV100-CRWINST.                     00688000
006890     MOVE RPXXX01-CRW-PRODCODE TO RPV100-CRWPROD.                 00689000
006900     MOVE RPXXX01-CRW-ACCOUNT TO RPV100-CRWACCT.                  00690000
006910     MOVE RPXXX01-PRIM-BAL TO SR-EDITSGNV02.                      00691000
006920     MOVE SR-EDIT15X TO RPV100-PRIMBAL.                           00692000
006930     MOVE RPXXX01-PRIM-REQ TO SR-EDITSGNV02.                      00693000
006940     MOVE SR-EDIT15X TO RPV100-PRIBALR.                           00694000
006950     MOVE RPXXX01-COMB-BAL1 TO SR-EDITSGNV02.                     00695000
006960     MOVE SR-EDIT15X TO RPV100-CMBBAL1.                           00696000
006970     MOVE RPXXX01-COMB-REQ1 TO SR-EDITSGNV02.                     00697000
006980     MOVE SR-EDIT15X TO RPV100-CMBALR1.                           00698000
006990     MOVE RPXXX01-COMB-BAL2 TO SR-EDITSGNV02.                     00699000
007000     MOVE SR-EDIT15X TO RPV100-CMBBAL2.                           00700000
007010     MOVE RPXXX01-COMB-REQ2 TO SR-EDITSGNV02.                     00701000
007020     MOVE SR-EDIT15X TO RPV100-CMBALR2.                           00702000
007030     MOVE RPXXX01-COMB-BAL3 TO SR-EDITSGNV02.                     00703000
007040     MOVE SR-EDIT15X TO RPV100-CMBBAL3.                           00704000
007050     MOVE RPXXX01-COMB-REQ3 TO SR-EDITSGNV02.                     00705000
007060     MOVE SR-EDIT15X TO RPV100-CMBALR3.                           00706000
007070     MOVE RPXXX01-COMB-BAL4 TO SR-EDITSGNV02.                     00707000
007080     MOVE SR-EDIT15X TO RPV100-CMBBAL4.                           00708000
007090     MOVE RPXXX01-COMB-REQ4 TO SR-EDITSGNV02.                     00709000
007100     MOVE SR-EDIT15X TO RPV100-CMBALR4.                           00710000
007110 EIP-EXIT.                                                        00711000
007120     EXIT.                                                        00712000
007130******************************************************************00713000
007140 MORE-DATA-PANELS SECTION.                                        00714000
007150 MDP-START.                                                       00715000
007160     GO TO PANEL-ROUTER.                                          00716000
007170 MDP-EXIT.                                                        00717000
007180     EXIT.                                                        00718000
007190******************************************************************00719000
007200 CLOSE-TRANSACTION SECTION.                                       00720000
000000 COPY SRP0722.                                                    00721000
007220******************************************************************00722000
007230 PANEL-INIT SECTION.                                              00723000
000000 COPY SRP073.                                                     00724000
007250******************************************************************00725000
007260 BUILD-NEXTKEY SECTION.                                           00726000
007270 BXN-START.                                                       00727000
007280     MOVE SPACES TO WS-NEXTKEY.                                   00728000
007290     MOVE ',' TO WS-DELIM1.                                       00729000
007300     MOVE ',' TO WS-DELIM2.                                       00730000
007310     MOVE ',' TO WS-DELIM3.                                       00731000
007320     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00732000
007330     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00733000
007340         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00734000
007350     ELSE                                                         00735000
007360         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00736000
007370     IF COM-WKUNAME (1:2) IS EQUAL TO 'RF'                        00737000
007380         MOVE COM-WK-PRODCODE TO WS-PRODCODE                      00738000
007390         MOVE COM-IDNUMBER TO WS-ACCT.                            00739000
007400     MOVE COM-KEY-MODEL TO WS-MODEL.                              00740000
007410     MOVE COM-EXTERNALID TO WS-EXTID.                             00741000
007420 BXN-EXIT.                                                        00742000
007430     EXIT.                                                        00743000
007440******************************************************************00744000
007450 BUILD-CRW-NEXTKEY SECTION.                                       00745000
007460 BCRXN-START.                                                     00746000
007470     MOVE SPACES TO WS-NEXTKEY.                                   00747000
007480     MOVE ',' TO WS-DELIM1.                                       00748000
007490     MOVE ',' TO WS-DELIM2.                                       00749000
007500     MOVE RPV100-CRWPROD TO WS-PRODCODE.                          00750000
007510     MOVE RPV100-CRWACCT TO WS-ACCTX.                             00751000
007520     MOVE 'RPPRO2' TO WS-EXTID.                                   00752000
007530 BCRXN-EXIT.                                                      00753000
007540     EXIT.                                                        00754000
007550******************************************************************00755000
007560 ABORT-EXIT SECTION.                                              00756000
007570 AE-START.                                                        00757000
007580     MOVE EIBFN TO COM-ABEIBFN.                                   00758000
007590     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00759000
007600     GO TO CICS-ABORT-EXIT.                                       00760000
007610 AE-EXIT.                                                         00761000
007620     EXIT.                                                        00762000
007630******************************************************************00763000
007640 RPXXX01-LINK-MESSAGE SECTION.                                    00764000
007650 RPLM-START.                                                      00765000
007660     MOVE 'Y' TO RPXXX01-GLOBAL-CLOSE.                            00766000
007670     MOVE 'VKL' TO RPXXX01-APIFUNC.                               00767000
007680     MOVE WS-FILEOPTIONS TO RPXXX01-FILEOPTS.                     00768000
007690     MOVE COM-RETURN TO RPXXX01-RETURN.                           00769000
007700     MOVE COM-MODELID TO RPXXX01-MODELID.                         00770000
007710     MOVE COM-SECALT TO RPXXX01-SECALT.                           00771000
007720     MOVE COM-OPERID TO RPXXX01-OPERID.                           00772000
007730     MOVE COM-DATE TO RPXXX01-DATE.                               00773000
007740     MOVE COM-EXTERNALID TO RPXXX01-EXTERNALID.                   00774000
007750     MOVE WS-RPSAPPLNBR TO RPXXX01-APPL.                          00775000
007760     MOVE COM-INST TO RPXXX01-KEY-INST.                           00776000
007770     MOVE COM-PRODCODE TO RPXXX01-KEY-PRODCODE.                   00777000
007780     MOVE COM-KEY-ACCOUNT TO RPXXX01-KEY-ACCOUNT.                 00778000
007790     MOVE COM-KEY-MODEL TO RPXXX01-KEY-MODEL.                     00779000
007800     IF COM-KEY-MODEL IS EQUAL TO LOW-VALUES                      00780000
007810         MOVE SPACES TO RPXXX01-KEY-MODEL.                        00781000
007820     IF COM-KEY-IDNBR IS NUMERIC                                  00782000
007830         AND COM-KEY-IDNBR IS GREATER THAN ZEROS                  00783000
007840         MOVE COM-KEY-IDNBR TO RPXXX01-KEY-IDNUMBER.              00784000
007850     MOVE ZEROS TO RPXXX01-OCCUR.                                 00785000
007860     MOVE ZEROS TO RPXXX01-CURPAGE.                               00786000
007870     IF COM-CUST-TYPE IS NOT EQUAL TO 'R'                         00787000
007880         AND COM-CUST-TYPE IS NOT EQUAL TO 'C'                    00788000
007890         MOVE SPACES TO COM-CUST-TYPE                             00789000
007900         MOVE SPACES TO COM-CUST-NAME                             00790000
007910         MOVE ZEROES TO COM-MODEL                                 00791000
007920         MOVE SPACES TO COM-MODEL-DESC                            00792000
007930         MOVE SPACES TO COM-PRIM-OPTION                           00793000
007940         MOVE ZEROES TO COM-PRIM-BAL                              00794000
007950         MOVE ZEROES TO COM-PRIM-REQ                              00795000
007960         MOVE ZEROES TO COM-COMB-REQ1                             00796000
007970         MOVE ZEROES TO COM-COMB-REQ2                             00797000
007980         MOVE ZEROES TO COM-COMB-REQ3                             00798000
007990         MOVE ZEROES TO COM-COMB-REQ4.                            00799000
008000     MOVE COM-CUST-TYPE TO RPXXX01-CUST-TYPE.                     00800000
008010     MOVE COM-CUST-NAME TO RPXXX01-CUST-NAME.                     00801000
008020     MOVE COM-MODEL-DESC TO RPXXX01-MODEL-DESC.                   00802000
008030     MOVE COM-PRIM-OPTION TO RPXXX01-PRIM-OPTION.                 00803000
008040     MOVE COM-PRIM-BAL TO RPXXX01-PRIM-BAL.                       00804000
008050     MOVE COM-PRIM-REQ TO RPXXX01-PRIM-REQ.                       00805000
008060     MOVE COM-COMB-REQ1 TO RPXXX01-COMB-REQ1.                     00806000
008070     MOVE COM-COMB-REQ2 TO RPXXX01-COMB-REQ2.                     00807000
008080     MOVE COM-COMB-REQ3 TO RPXXX01-COMB-REQ3.                     00808000
008090     MOVE COM-COMB-REQ4 TO RPXXX01-COMB-REQ4.                     00809000
008100     MOVE COM-LANG TO RPXXX01-COM-LANG.                           00810000
008110     MOVE COM-CURN-CODE TO RPXXX01-COM-CURNCD.                    00811000
008120     MOVE COM-INST-OPTS TO RPXXX01-INST-OPTS.                     00812000
008130     EXEC CICS LINK                                               00813000
008140         PROGRAM('RPLXXX01')                                      00814000
008150         COMMAREA(RPXXX01-MESSAGE)                                00815000
008160         LENGTH(LENGTH OF RPXXX01-MESSAGE)                        00816000
008170         RESP(WS-CICS-RESPONSE)                                   00817000
008180         END-EXEC.                                                00818000
008190     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00819000
008200         MOVE 'RPLXXX01 LINK FAILED' TO COM-ABMSG                 00820000
008210         MOVE WS-TR0003 TO COM-ABTRACE                            00821000
008220         MOVE WS-AB0009 TO COM-ABORT                              00822000
008230         GO TO CICS-ABORT-EXIT.                                   00823000
008240     MOVE RPXXX01-FUNCTION TO WS-FUNCTION.                        00824000
008250     IF RPXXX01-ABORT IS NOT EQUAL TO ZERO                        00825000
008260         MOVE RPXXX01-ABORT TO COM-ABORT                          00826000
008270         MOVE RPXXX01-ABTRACE TO COM-ABTRACE                      00827000
008280         MOVE RPXXX01-ABEIBFN TO COM-ABEIBFN                      00828000
008290         MOVE RPXXX01-ABEIBRCODE TO COM-ABEIBRCODE                00829000
008300         MOVE RPXXX01-ABPROGID TO COM-ABPROGID                    00830000
008310         MOVE RPXXX01-SRBMDB TO COM-SRBMDB                        00831000
008320         MOVE RPXXX01-ABTYPE TO COM-ABTYPE                        00832000
008330         GO TO CICS-ABORT-EXIT.                                   00833000
008340     MOVE RPXXX01-ABORT TO COM-ABORT.                             00834000
008350     MOVE RPXXX01-MSGNBR TO WS-MSGNBR.                            00835000
008360 RPLM-EXIT.                                                       00836000
008370     EXIT.                                                        00837000
008380******************************************************************00838000
008390 CLOSE-PANEL SECTION.                                             00839000
008400 CP-START.                                                        00840000
008410     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00841000
008420     IF COM-RETURN IS EQUAL TO 'E'                                00842000
008430         PERFORM CALL-BISPAN-RPV100K.                             00843000
008440     IF COM-RETURN IS EQUAL TO '1'                                00844000
008450         PERFORM CALL-BISPAN-RPV100.                              00845000
008460 CP-EXIT.                                                         00846000
008470     EXIT.                                                        00847000
008480******************************************************************00848000
008490 CALL-BISPAN-RPV100K SECTION.                                     00849000
008500 CBD1-START.                                                      00850000
008510     CALL 'BISPAN' USING                                          00851000
008520         BICRPSB,                                                 00852000
008530         BICRSRB,                                                 00853000
008540         BICRPAN,                                                 00854000
008550         RPV100K-PANL-DATA-BLOCK,                                 00855000
008560         RPV100K-PANL-DATA-AREA.                                  00856000
008570 CBD1-EXIT.                                                       00857000
008580     EXIT.                                                        00858000
008590******************************************************************00859000
008600 CALL-BISPAN-RPV100 SECTION.                                      00860000
008610 CBD2-START.                                                      00861000
008620     CALL 'BISPAN' USING                                          00862000
008630         BICRPSB,                                                 00863000
008640         BICRSRB,                                                 00864000
008650         BICRPAN,                                                 00865000
008660         RPV100-PANL-DATA-BLOCK,                                  00866000
008670         RPV100-PANL-DATA-AREA.                                   00867000
008680 CBD2-EXIT.                                                       00868000
008690     EXIT.                                                        00869000
008700******************************************************************00870000
008710 PANEL-GET-RPV100 SECTION.                                        00871000
008720 PANEL-GET-RPV100-START.                                          00872000
008730     MOVE 'N' TO RPV100-SW-SET-CURSOR.                            00873000
008740     MOVE PDB-RPV100-NAME TO PAN-NAME.                            00874000
008750     MOVE REQ-GET TO PAN-REQ-VERB.                                00875000
008760     CALL 'BISPAN' USING                                          00876000
008770         BICRPSB                                                  00877000
008780         BICRSRB                                                  00878000
008790         BICRPAN                                                  00879000
008800         RPV100-PANL-DATA-BLOCK,                                  00880000
008810         RPV100-PANL-DATA-AREA.                                   00881000
008820 PANEL-GET-RPV100-EXIT.                                           00882000
008830     EXIT.                                                        00883000
008840******************************************************************00884000
008850 PANEL-PUT-RPV100 SECTION.                                        00885000
008860 PANEL-PUT-RPV100-START.                                          00886000
008870     MOVE PDB-RPV100-NAME TO PAN-NAME.                            00887000
008880     MOVE REQ-PUT TO PAN-REQ-VERB.                                00888000
008890     CALL 'BISPAN' USING                                          00889000
008900         BICRPSB                                                  00890000
008910         BICRSRB                                                  00891000
008920         BICRPAN                                                  00892000
008930         RPV100-PANL-DATA-BLOCK,                                  00893000
008940         RPV100-PANL-DATA-AREA.                                   00894000
008950 PANEL-PUT-RPV100-EXIT.                                           00895000
008960     EXIT.                                                        00896000
008970******************************************************************00897000
008980 PANEL-GET-RPV100K SECTION.                                       00898000
008990 PANEL-GET-RPV100K-START.                                         00899000
009000     MOVE 'N' TO RPV100K-SW-SET-CURSOR.                           00900000
009010     MOVE PDB-RPV100K-NAME TO PAN-NAME.                           00901000
009020     MOVE REQ-GET TO PAN-REQ-VERB.                                00902000
009030     CALL 'BISPAN' USING                                          00903000
009040         BICRPSB                                                  00904000
009050         BICRSRB                                                  00905000
009060         BICRPAN                                                  00906000
009070         RPV100K-PANL-DATA-BLOCK,                                 00907000
009080         RPV100K-PANL-DATA-AREA.                                  00908000
009090 PANEL-GET-RPV100K-EXIT.                                          00909000
009100     EXIT.                                                        00910000
009110******************************************************************00911000
009120 PANEL-PUT-RPV100K SECTION.                                       00912000
009130 PANEL-PUT-RPV100K-START.                                         00913000
009140     MOVE PDB-RPV100K-NAME TO PAN-NAME.                           00914000
009150     MOVE REQ-PUT TO PAN-REQ-VERB.                                00915000
009160     CALL 'BISPAN' USING                                          00916000
009170         BICRPSB                                                  00917000
009180         BICRSRB                                                  00918000
009190         BICRPAN                                                  00919000
009200         RPV100K-PANL-DATA-BLOCK,                                 00920000
009210         RPV100K-PANL-DATA-AREA.                                  00921000
009220 PANEL-PUT-RPV100K-EXIT.                                          00922000
009230     EXIT.                                                        00923000
009240******************************************************************00924000
009250 MIC-MST-API SECTION.                                             00925000
000000 COPY MIPMSTA.                                                    00926000
009270******************************************************************00927000
009280 EDIT-ACCOUNT-KEY SECTION.                                        00928000
009290 EAK-START.                                                       00929000
009300     MOVE COM-INST TO RPW130-INST.                                00930000
009310     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 00931000
009320     MOVE COM-KEY-PRODCODE TO RPW130-PRODCODE.                    00932000
009330     MOVE COM-KEY-ACCOUNT TO RPW130-ACCOUNTINPUT.                 00933000
009340     MOVE 'V' TO RPW130-FUNCTION.                                 00934000
009350     PERFORM ACCOUNT-KEY-EDIT.                                    00935000
009360     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00936000
009370         MOVE '500001' TO WS-MSGNBR                               00937000
009380         GO TO EAK-EXIT.                                          00938000
009390     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00939000
009400     MOVE RPW130-ACCOUNTKEY TO COM-KEY-ACCOUNT.                   00940000
009410     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          00941000
009420     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      00942000
009430     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                00943000
009440 EAK-EXIT.                                                        00944000
009450     EXIT.                                                        00945000
009460******************************************************************00946000
009470 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 00947000
000000 COPY RPP033.                                                     00948000
009490******************************************************************00949000
009500 ACCOUNT-KEY-EDIT SECTION.                                        00950000
000000 COPY RPP130.                                                     00951000
009520******************************************************************00952000
009530 LEFT-JUSTIFY SECTION.                                            00953000
000000 COPY SRP025.                                                     00954000
009550******************************************************************00955000
009560 RIGHT-JUSTIFY SECTION.                                           00956000
000000 COPY SRP026.                                                     00957000
009580******************************************************************00958000
009590 PARAMETER-SEARCH SECTION.                                        00959000
000000 COPY SRP030.                                                     00960000
009610******************************************************************00961000
009620 COMPRESS-NEXTKEY SECTION.                                        00962000
000000 COPY SRP070.                                                     00963000
009640******************************************************************00964000
009650 GET-MESSAGE SECTION.                                             00965000
000000 COPY SRP071.                                                     00966000
009670******************************************************************00967000
009680 EDIT-CODASYL-DATE SECTION.                                       00968000
000000 COPY SRP087.                                                     00969000
009700******************************************************************00970000
009710 SRP170-ROUTINE SECTION.                                          00971000
000000 COPY SRP170.                                                     00972000
009730******************************************************************00973000
009740 BUILD-PFKEY-LINE SECTION.                                        00974000
000000 COPY SRP710.                                                     00975000
009760******************************************************************00976000
009770 VALIDATE-PFKEYS SECTION.                                         00977000
000000 COPY SRP711.                                                     00978000
009790******************************************************************00979000
009800 SLP096-GET-2023-RECORD SECTION.                                  00980000
000000 COPY SLP096.                                                     00981000
009820******************************************************************00982000
009830 CICS-XCTL SECTION.                                               00983000
000000 COPY SLP704.                                                     00984000
009850******************************************************************00985000
009860 CICS-RETURN-TRANSID SECTION.                                     00986000
000000 COPY SLP710.                                                     00987000
009880******************************************************************00988000
009890 TSQ-DELETE SECTION.                                              00989000
009900 TSQD-START.                                                      00990000
009910 TSQD-EXIT.                                                       00991000
009920     EXIT.                                                        00992000
009930******************************************************************00993000
009940 CICS-TSQ-READ SECTION.                                           00994000
000000 COPY SLP744.                                                     00995000
009960******************************************************************00996000
009970 CICS-ABORT-EXIT SECTION.                                         00997000
000000 COPY SLP798.                                                     00998000
009990******************************************************************00999000
