000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL102.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL102 -  RELATIONSHIP INQUIRY 2                            *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRCONS.                                                    00024000
000000 COPY BICRCONS.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRPAN.                                                     00028000
000000 COPY BICRPAN.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  RPV102K-PANL-DATA-BLOCK.                                     00032000
000000 COPY RPV102KW.                                                   00033000
000340 01  RPV102-PANL-DATA-BLOCK.                                      00034000
000000 COPY RPV102W.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00037000
000380     03  WS-NEXTKEY.                                              00038000
000390         05  WS-EXTID            PIC X(08).                       00039000
000400         05  WS-DELIM1           PIC X(01)       VALUE ','.       00040000
000410         05  WS-DATA.                                             00041000
000420             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00042000
000430             07  WS-DELIM2       PIC X(01)       VALUE ','.       00043000
000440             07  WS-ACCTX.                                        00044000
000450                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00045000
000460             07  WS-DELIM3       PIC X(01)       VALUE ','.       00046000
000470             07  WS-MODEL        PIC X(10)       VALUE SPACES.    00047000
000480         05  FILLER              PIC X(42)       VALUE SPACES.    00048000
000490     03  WS-MORE                 PIC X(05)       VALUE 'More:'.   00049000
000500     03  WS-LNKPROG1             PIC X(08)       VALUE 'RPLXXX01'.00050000
000510     03  WS-LKLGTH               PIC S9(04)      COMP             00051000
000520                                                 VALUE +4088.     00052000
000530     03  WS-PDATE                PIC 9(08).                       00053000
000540     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00054000
000550         05  WS-PDATE-YYYY       PIC 9(04).                       00055000
000560         05  WS-PDATE-MM         PIC 9(02).                       00056000
000570         05  WS-PDATE-DD         PIC 9(02).                       00057000
000580     03  WS-SUB1                 PIC S9(04)      COMP             00058000
000590                                                 VALUE +0000.     00059000
000600     03  WS-SUB2                 PIC S9(04)      COMP             00060000
000610                                                 VALUE +0000.     00061000
000620 01  WS-LINKMSG                  PIC X(4500).                     00062000
000630 01  RPXXX01-MESSAGE.                                             00063000
000000 COPY MISCNT00      REPLACING                                     00064000
000650             ==:MICNT:== BY ==RPXXX01==.                          00065000
000000 COPY RPSXXX01.                                                   00066000
000670 01  WS-TSQAREAS.                                                 00067000
000680     03  WS-TSQITEM              PIC S9(04)      COMP             00068000
000690                                                 VALUE +0001.     00069000
000700     03  WS-TSQLGTH              PIC S9(04)      COMP             00070000
000710                                                 VALUE +4096.     00071000
000720     03  WS-TSQKEY.                                               00072000
000730         05  WS-TSQID            PIC X(04).                       00073000
000740         05  WS-TSQTRMID         PIC X(04).                       00074000
000750 01  LS-TSQAREA.                                                  00075000
000760     03  LS-TSQKEY               PIC X(08).                       00076000
000770     03  LS-TSQDATA              PIC X(4088).                     00077000
000780 01  MIWPRI-AREAS.                                                00078000
000000 COPY MIWPRI.                                                     00079000
000800 01  MIWMSTA-AREAS.                                               00080000
000000 COPY MIWMSTA.                                                    00081000
000820 01  MIMST-RECORD.                                                00082000
000000 COPY MISMST.                                                     00083000
000840 01  MI2023-RECORD.                                               00084000
000000 COPY MIS2023A.                                                   00085000
000860 01  WS-ABORTCODES.                                               00086000
000870     03  WS-AB0009               PIC S9(04)      COMP             00087000
000880                                                 VALUE +0009.     00088000
000890     03  WS-AB0106               PIC S9(04)      COMP             00089000
000900                                                 VALUE +0106.     00090000
000910     03  WS-AB2033               PIC S9(04)      COMP             00091000
000920                                                 VALUE +2033.     00092000
000930     03  WS-AB6345               PIC S9(04)      COMP             00093000
000940                                                 VALUE +6345.     00094000
000950 01  WS-TRACECODES.                                               00095000
000960     03  WS-TR0001               PIC S9(04)      COMP             00096000
000970                                                 VALUE +0001.     00097000
000980     03  WS-TR0002               PIC S9(04)      COMP             00098000
000990                                                 VALUE +0002.     00099000
001000     03  WS-TR0003               PIC S9(04)      COMP             00100000
001010                                                 VALUE +0003.     00101000
001020 01  SLW096-AREAS.                                                00102000
000000 COPY SLW096.                                                     00103000
001040 01  RPW014-AREAS.                                                00104000
000000 COPY RPW014.                                                     00105000
001060 01  RPW033-AREAS.                                                00106000
000000 COPY RPW033.                                                     00107000
001080 01  RPW130-AREAS.                                                00108000
000000 COPY RPW130.                                                     00109000
001100 01  SRW000-AREAS.                                                00110000
000000 COPY SRW000.                                                     00111000
001120 01  SRW025-AREAS.                                                00112000
000000 COPY SRW025.                                                     00113000
001140 01  SRW030-AREAS.                                                00114000
000000 COPY SRW030.                                                     00115000
001160 01  SRW031-AREAS.                                                00116000
000000 COPY SRW031.                                                     00117000
001180 01  SRW105-AREAS.                                                00118000
000000 COPY SRW105.                                                     00119000
001200 01  SRW161-AREAS.                                                00120000
000000 COPY SRW161.                                                     00121000
001220 01  SRW170-AREAS.                                                00122000
000000 COPY SRW170.                                                     00123000
001240 COPY DFHAID.                                                     00124000
001250******************************************************************00125000
001260 LINKAGE SECTION.                                                 00126000
001270 01  DFHCOMMAREA.                                                 00127000
000000 COPY SLS1112.                                                    00128000
001290     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00129000
001300         05  COM-EDIT-DATE       PIC X(10).                       00130000
001310         05  COM-KEY-INFO.                                        00131000
001320             07  COM-KEY-OCCUR   PIC S9(04)      COMP-3.          00132000
001330         05  COM-KEY-FIELDS.                                      00133000
001340             07  COM-KEY-PRODCODE                                 00134000
001350                                 PIC X(06).                       00135000
001360             07  COM-KEY-ACCOUNT PIC X(18).                       00136000
001370             07  COM-KEY-ACCOUNT-N                                00137000
001380                         REDEFINES COM-KEY-ACCOUNT                00138000
001390                                 PIC 9(18).                       00139000
001400             07  COM-KEY-MODEL                                    00140000
001410                                 PIC X(10).                       00141000
001420             07  COM-KEY-IDNBRX  PIC X(18).                       00142000
001430             07  COM-KEY-IDNBR                                    00143000
001440                         REDEFINES COM-KEY-IDNBRX                 00144000
001450                                 PIC 9(18).                       00145000
001460         05  COM-PANEL-ACTION    PIC X(01)       VALUE SPACE.     00146000
001470             88  INITIAL-PANEL                   VALUE ' '.       00147000
001480             88  EDIT-PANEL                      VALUE 'E'.       00148000
001490         05  COM-FROM-PANEL      PIC X(01)       VALUE SPACE.     00149000
001500             88  FROM-KEY-PANEL                  VALUE 'K'.       00150000
001510             88  FROM-INFO-PANEL                 VALUE 'I'.       00151000
001520             88  FROM-HELP                       VALUE 'H'.       00152000
001530             88  FROM-BREAKAWAY                  VALUE 'B'.       00153000
001540         05  COM-KEY-FORMATTEDACCT                                00154000
001550                                 PIC X(22).                       00155000
001560         05  COM-KEY-MSGNBR      PIC X(06).                       00156000
001570         05  COM-KEY-COMMAND     PIC X(50).                       00157000
001580         05  COM-FIRST-KEY       PIC X(28).                       00158000
001590         05  COM-LAST-KEY        PIC X(28).                       00159000
001600         05  COM-MORE            PIC X(01).                       00160000
001610         05  COM-RPXXX01-CURPAGE PIC S9(04)      COMP-3.          00161000
001620         05  COM-RPXXX01-OCCUR   PIC S9(04)      COMP-3.          00162000
001630         05  COM-CUST-TYPE       PIC X(01).                       00163000
001640         05  COM-CUST-NAME       PIC X(40).                       00164000
001650         05  COM-MODEL           PIC 9(05).                       00165000
001660         05  COM-MODEL-DESC      PIC X(20).                       00166000
001670         05  COM-PRIM-OPTION     PIC X(01).                       00167000
001680         05  COM-WK-PRODCODE     PIC X(06).                       00168000
001690         05  COM-IDNUMBER        PIC 9(18).                       00169000
001700******************************************************************00170000
001710*01  SLW096-2023RECORDS.                                          00171000
000000 COPY SLW096L.                                                    00172000
001730******************************************************************00173000
001740 PROCEDURE DIVISION.                                              00174000
001750******************************************************************00175000
001760 ENTRY-ROUTINE SECTION.                                           00176000
001770     MOVE 'RPL102' TO COM-ABPROGID.                               00177000
000000 COPY SLP771.                                                     00178000
001790******************************************************************00179000
001800 TRANSACTION-CLEAN-UP SECTION.                                    00180000
001810 TCU-START.                                                       00181000
001820 TCU-EXIT.                                                        00182000
001830     EXIT.                                                        00183000
001840******************************************************************00184000
001850 CICS-HANDLE-CONDITION SECTION.                                   00185000
000000 COPY SLP772.                                                     00186000
001870     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00187000
001880         GO TO CTSRI-EXIT.                                        00188000
001890     MOVE WS-AB2033 TO COM-ABORT.                                 00189000
001900     MOVE WS-TR0001 TO COM-ABTRACE.                               00190000
001910     GO TO ABORT-EXIT.                                            00191000
001920 CHC-EXIT.                                                        00192000
001930     EXIT.                                                        00193000
001940******************************************************************00194000
001950 ROUTING-ROUTINE SECTION.                                         00195000
001960 RR-START.                                                        00196000
001970     MOVE LOW-VALUES TO RPXXX01-MESSAGE.                          00197000
001980     MOVE LOW-VALUES TO RPV102-PANL-DATA-AREA.                    00198000
001990     MOVE LOW-VALUES TO RPV102K-PANL-DATA-AREA.                   00199000
002000     MOVE ALL ZEROS TO WS-MSGNBR.                                 00200000
002010     IF COM-RETURN IS EQUAL TO 'B'                                00201000
002020         OR COM-BKPGRMID IS EQUAL TO SPACE                        00202000
002030         MOVE 'RP00' TO WS-TSQFILEID                              00203000
002040     ELSE                                                         00204000
002050         MOVE 'RP01' TO WS-TSQFILEID.                             00205000
002060     MOVE 'RPI' TO WS-TSQSYSID.                                   00206000
002070     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00207000
002080     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00208000
002090     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00209000
002100         MOVE COM-PAN TO BICRPAN                                  00210000
002110         MOVE COM-PSB TO BICRPSB                                  00211000
002120         MOVE COM-SRB TO BICRSRB                                  00212000
002130     ELSE                                                         00213000
002140         MOVE '1' TO BPSB-LEVEL.                                  00214000
002150     IF COM-RETURN IS EQUAL TO 'B'                                00215000
002160         GO TO BREAKAWAY-RETURN.                                  00216000
002170     IF COM-RETURN IS EQUAL TO '0'                                00217000
002180         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00218000
002190         MOVE SPACES TO COM-WORKAREAS                             00219000
002200         MOVE '1' TO SRB-VERSION                                  00220000
002210         MOVE 'IPRP' TO SRB-APPL-ID                               00221000
002220         MOVE 'RPL102' TO SRB-PROG-ID                             00222000
002230         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00223000
002240         MOVE 'P' TO PAN-TYPE                                     00224000
002250         MOVE SPACE TO PAN-OVERLAY                                00225000
002260         MOVE SPACE TO PAN-CLOSE                                  00226000
002270         MOVE SPACE TO PAN-ALARM                                  00227000
002280         MOVE SPACE TO PAN-CURSOR-PAN                             00228000
002290         MOVE SPACE TO PAN-CURSOR-FLD                             00229000
002300         MOVE SPACE TO PAN-SET-FLD                                00230000
002310         MOVE SPACE TO PAN-SET-VID                                00231000
002320         MOVE SPACE TO PAN-SET-EMP                                00232000
002330         MOVE +0 TO COM-RPXXX01-CURPAGE                           00233000
002340         MOVE +0 TO COM-RPXXX01-OCCUR                             00234000
002350         MOVE PDB-RPV102K-NAME TO PAN-NAME                        00235000
002360         PERFORM PANEL-INIT                                       00236000
002370         MOVE BICRPAN TO COM-PAN                                  00237000
002380         MOVE BICRPSB TO COM-PSB                                  00238000
002390         MOVE BICRSRB TO COM-SRB                                  00239000
002400         PERFORM INITIALIZE-DATE                                  00240000
002410         GO TO PANEL-ROUTER.                                      00241000
002420     PERFORM PANEL-NAME-SET.                                      00242000
002430     IF COM-HELPSW IS EQUAL TO 'Y'                                00243000
002440         GO TO HELP-RETURN.                                       00244000
002450     PERFORM PANEL-RECEIVE.                                       00245000
002460     PERFORM PANEL-DATA-GET.                                      00246000
002470     PERFORM PANEL-PFKEY-SET.                                     00247000
002480     PERFORM VALIDATE-PFKEYS.                                     00248000
002490     IF EIBAID IS EQUAL TO DFHPF1                                 00249000
002500         GO TO GET-HELP.                                          00250000
002510     IF EIBAID IS EQUAL TO DFHPF11                                00251000
002520         GO TO BREAK-AWAY.                                        00252000
002530     IF (COM-RETURN IS EQUAL TO 'E'                               00253000
002540         OR COM-RETURN IS EQUAL TO '1')                           00254000
002550         AND (EIBAID IS EQUAL TO DFHPF2                           00255000
002560         OR EIBAID IS EQUAL TO DFHPF3                             00256000
002570         OR EIBAID IS EQUAL TO DFHPF4                             00257000
002580         OR EIBAID IS EQUAL TO DFHPF7                             00258000
002590         OR EIBAID IS EQUAL TO DFHPF8                             00259000
002600         OR EIBAID IS EQUAL TO DFHPF12)                           00260000
002610         GO TO CLOSE-TRANSACTION.                                 00261000
002620     IF COM-RETURN IS EQUAL TO '0'                                00262000
002630         OR COM-RETURN IS EQUAL TO 'E'                            00263000
002640         OR COM-RETURN IS EQUAL TO '1'                            00264000
002650         GO TO PANEL-ROUTER.                                      00265000
002660 RR-END.                                                          00266000
002670     GO TO CLOSE-TRANSACTION.                                     00267000
002680 RR-EXIT.                                                         00268000
002690     EXIT.                                                        00269000
002700******************************************************************00270000
002710 INITIALIZE-DATE SECTION.                                         00271000
002720 ID-START.                                                        00272000
002730     MOVE COM-DATE TO WS-CURDATE8.                                00273000
002740     MOVE '-' TO WS-CD8DSH1.                                      00274000
002750     MOVE '-' TO WS-CD8DSH2.                                      00275000
002760     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00276000
002770 ID-EXIT.                                                         00277000
002780     EXIT.                                                        00278000
002790******************************************************************00279000
002800 PANEL-NAME-SET SECTION.                                          00280000
002810 PNS-START.                                                       00281000
002820     IF COM-RETURN IS EQUAL TO '0'                                00282000
002830         MOVE PDB-RPV102K-NAME TO PAN-NAME.                       00283000
002840     IF COM-RETURN IS EQUAL TO 'E'                                00284000
002850         MOVE PDB-RPV102K-NAME TO PAN-NAME.                       00285000
002860     IF COM-RETURN IS EQUAL TO '1'                                00286000
002870         MOVE PDB-RPV102-NAME TO PAN-NAME.                        00287000
002880 PNS-EXIT.                                                        00288000
002890     EXIT.                                                        00289000
002900******************************************************************00290000
002910 PANEL-DATA-GET SECTION.                                          00291000
002920 PDG-START.                                                       00292000
002930     IF COM-RETURN IS EQUAL TO '0'                                00293000
002940         PERFORM PANEL-GET-RPV102K.                               00294000
002950     IF COM-RETURN IS EQUAL TO 'E'                                00295000
002960         PERFORM PANEL-GET-RPV102K                                00296000
002970         MOVE RPV102K-COMMAND TO WS-NEXTKEY                       00297000
002980         MOVE PDB-RPV102K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00298000
002990     IF COM-RETURN IS EQUAL TO '1'                                00299000
003000         PERFORM PANEL-GET-RPV102                                 00300000
003010         MOVE RPV102-COMMAND TO WS-NEXTKEY                        00301000
003020         MOVE PDB-RPV102-COMMAND-DCHG TO WS-COMMAND-DCHG.         00302000
003030 PDG-EXIT.                                                        00303000
003040     EXIT.                                                        00304000
003050******************************************************************00305000
003060 PANEL-PFKEY-SET SECTION.                                         00306000
003070 PPS-START.                                                       00307000
003080 PPS-EXIT.                                                        00308000
003090     EXIT.                                                        00309000
003100******************************************************************00310000
003110 PANEL-ROUTER SECTION.                                            00311000
003120 PR-START.                                                        00312000
003130     IF COM-RETURN IS EQUAL TO '0'                                00313000
003140         GO TO PROCESS-KEY-PANEL.                                 00314000
003150     IF COM-RETURN IS EQUAL TO 'E'                                00315000
003160         GO TO PROCESS-KEY-PANEL.                                 00316000
003170     IF COM-RETURN IS EQUAL TO '1'                                00317000
003180         GO TO PROCESS-INFO-PANEL.                                00318000
003190     GO TO CLOSE-TRANSACTION.                                     00319000
003200 PR-EXIT.                                                         00320000
003210     EXIT.                                                        00321000
003220******************************************************************00322000
003230 HELP-RETURN SECTION.                                             00323000
000000 COPY SRP074.                                                     00324000
003250******************************************************************00325000
003260 HELP-RETURN-FINISH SECTION.                                      00326000
003270 HRF-START.                                                       00327000
003280     PERFORM PANEL-DATA-GET.                                      00328000
003290     MOVE 'H' TO COM-FROM-PANEL.                                  00329000
003300     GO TO PANEL-ROUTER.                                          00330000
003310 HRF-EXIT.                                                        00331000
003320     EXIT.                                                        00332000
003330******************************************************************00333000
003340 HELP-MISSING-FINISH SECTION.                                     00334000
003350 HMF-START.                                                       00335000
003360     MOVE 'H' TO COM-FROM-PANEL.                                  00336000
003370     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00337000
003380     GO TO PANEL-ROUTER.                                          00338000
003390 HMF-EXIT.                                                        00339000
003400     EXIT.                                                        00340000
003410******************************************************************00341000
003420 BREAK-AWAY SECTION.                                              00342000
000000 COPY SRP0752.                                                    00343000
003440******************************************************************00344000
003450 BREAKAWAY-RETURN-FINISH SECTION.                                 00345000
003460 BRF-START.                                                       00346000
003470     PERFORM PANEL-DATA-GET.                                      00347000
003480     MOVE 'B' TO COM-FROM-PANEL.                                  00348000
003490     GO TO PANEL-ROUTER.                                          00349000
003500 BRF-EXIT.                                                        00350000
003510     EXIT.                                                        00351000
003520******************************************************************00352000
003530 PROCESS-KEY-PANEL SECTION.                                       00353000
003540 PKP-START.                                                       00354000
003550     IF INITIAL-PANEL                                             00355000
003560         MOVE COM-NEXTKEY TO COM-EXTERNALID                       00356000
003570         GO TO PKP-COM-INIT.                                      00357000
003580     IF EDIT-PANEL                                                00358000
003590         AND FROM-INFO-PANEL                                      00359000
003600         MOVE SPACE TO COM-FROM-PANEL                             00360000
003610         GO TO PKP-RELOAD-PANEL.                                  00361000
003620 PKP-COM-INIT.                                                    00362000
003630     MOVE COM-NEXTKEY TO SR-PSLIST.                               00363000
003640     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00364000
003650         GO TO PKP-SEND-PANEL.                                    00365000
003660 PKP-BEGIN-EDITS.                                                 00366000
003670     IF EDIT-PANEL                                                00367000
003680         MOVE RPV102K-PRODCD TO COM-KEY-PRODCODE                  00368000
003690         MOVE RPV102K-ACCOUNT TO COM-KEY-ACCOUNT                  00369000
003700         MOVE RPV102K-MODEL TO COM-KEY-MODEL                      00370000
003710         MOVE RPV102K-IDNBR TO COM-KEY-IDNBRX                     00371000
003720         GO TO PKP-RETURN-EDITS.                                  00372000
003730     PERFORM PARAMETER-SEARCH.                                    00373000
003740     MOVE SR-PSPARM TO COM-EXTID.                                 00374000
003750     MOVE SR-PSPARM TO COM-EXTERNALID.                            00375000
003760     PERFORM PARAMETER-SEARCH.                                    00376000
003770     MOVE SR-PSPARM TO COM-KEY-PRODCODE.                          00377000
003780     PERFORM PARAMETER-SEARCH.                                    00378000
003790     MOVE SR-PSPARM TO COM-KEY-ACCOUNT.                           00379000
003800     PERFORM PARAMETER-SEARCH.                                    00380000
003810     MOVE SR-PSPARM TO COM-KEY-MODEL.                             00381000
003820     PERFORM PARAMETER-SEARCH.                                    00382000
003830     MOVE SR-PSPARM TO COM-KEY-IDNBRX.                            00383000
003840 PKP-RETURN-EDITS.                                                00384000
003850     IF COM-KEY-PRODCODE IS EQUAL TO SPACE                        00385000
003860         MOVE LOW-VALUE TO COM-KEY-PRODCODE.                      00386000
003870     IF COM-KEY-ACCOUNT IS EQUAL TO SPACE                         00387000
003880         MOVE LOW-VALUE TO COM-KEY-ACCOUNT.                       00388000
003890     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00389000
003900         MOVE LOW-VALUES TO COM-KEY-MODEL.                        00390000
003910     IF COM-KEY-IDNBRX IS EQUAL TO SPACES                         00391000
003920         MOVE LOW-VALUES TO COM-KEY-IDNBRX.                       00392000
003930     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00393000
003940         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00394000
003950         AND COM-KEY-IDNBRX IS GREATER THAN LOW-VALUE             00395000
003960         GO TO PKP-RETURN-CONT.                                   00396000
003970     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00397000
003980         MOVE '000002' TO WS-MSGNBR                               00398000
003990         GO TO PKP-RETURN-CONT.                                   00399000
004000     PERFORM EDIT-ACCOUNT-KEY.                                    00400000
004010 PKP-RETURN-CONT.                                                 00401000
004020     IF INITIAL-PANEL                                             00402000
004030         AND COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE               00403000
004040         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00404000
004050         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00405000
004060         AND COM-KEY-IDNBRX IS EQUAL TO LOW-VALUE                 00406000
004070         MOVE '000001' TO WS-MSGNBR                               00407000
004080         GO TO PKP-SEND-PANEL.                                    00408000
004090     IF COM-WKUNAME (1:2) IS EQUAL TO 'RF'                        00409000
004100         IF COM-RETURN IS NOT EQUAL TO 'E'                        00410000
004110             MOVE COM-KEY-PRODCODE TO COM-WK-PRODCODE             00411000
004120             MOVE COM-KEY-ACCOUNT TO COM-IDNUMBER                 00412000
004130             MOVE COM-KEY-ACCOUNT TO COM-KEY-IDNBRX               00413000
004140             MOVE LOW-VALUES TO COM-KEY-PRODCODE                  00414000
004150             MOVE LOW-VALUES TO COM-KEY-ACCOUNT                   00415000
004160         END-IF                                                   00416000
004170     END-IF.                                                      00417000
004180     MOVE COM-KEY-IDNBRX TO SR-JUSTIFYIN.                         00418000
004190     MOVE +0018 TO SR-JLGTH.                                      00419000
004200     PERFORM RIGHT-JUSTIFY.                                       00420000
004210     IF SR-JUSTIFYOUT IS EQUAL TO SPACE                           00421000
004220         MOVE ZEROS TO COM-KEY-IDNBRX                             00422000
004230     ELSE                                                         00423000
004240         MOVE SR-JUSTIFYOUT TO COM-KEY-IDNBRX.                    00424000
004250     IF COM-KEY-IDNBRX IS NOT NUMERIC                             00425000
004260         MOVE ZEROES TO COM-KEY-IDNBRX.                           00426000
004270     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00427000
004280     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00428000
004290     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00429000
004300         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00430000
004310     ELSE                                                         00431000
004320         MOVE ZERO TO COM-ACCOUNT.                                00432000
004330     IF FROM-BREAKAWAY                                            00433000
004340         OR FROM-HELP                                             00434000
004350         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00435000
004360         GO TO PKP-RELOAD-PANEL.                                  00436000
004370     IF COM-KEY-PRODCODE IS GREATER THAN SPACES                   00437000
004380         AND COM-KEY-ACCOUNT IS GREATER THAN SPACES               00438000
004390         AND COM-KEY-IDNBRX IS GREATER THAN ZEROS                 00439000
004400         MOVE '000002' TO WS-MSGNBR                               00440000
004410         GO TO PKP-RELOAD-PANEL.                                  00441000
004420 PKP-EDITS-READY.                                                 00442000
004430     MOVE SPACE TO COM-PANEL-ACTION.                              00443000
004440     MOVE '1' TO COM-RETURN.                                      00444000
004450     MOVE 'K' TO COM-FROM-PANEL.                                  00445000
004460     GO TO PANEL-ROUTER.                                          00446000
004470 PKP-RELOAD-PANEL.                                                00447000
004480     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00448000
004490         MOVE LOW-VALUES TO RPV102K-PRODCD                        00449000
004500     ELSE                                                         00450000
004510         MOVE COM-KEY-PRODCODE TO RPV102K-PRODCD.                 00451000
004520     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00452000
004530         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROS                     00453000
004540         MOVE LOW-VALUES TO RPV102K-ACCOUNT                       00454000
004550     ELSE                                                         00455000
004560         MOVE COM-KEY-ACCOUNT TO RPV102K-ACCOUNT.                 00456000
004570     MOVE COM-KEY-MODEL TO RPV102K-MODEL.                         00457000
004580     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00458000
004590         MOVE LOW-VALUES TO RPV102K-MODEL.                        00459000
004600     MOVE COM-KEY-IDNBRX TO RPV102K-IDNBR.                        00460000
004610     IF COM-KEY-IDNBRX IS NOT GREATER THAN ZEROS                  00461000
004620         MOVE LOW-VALUES TO RPV102K-IDNBR.                        00462000
004630 PKP-SEND-PANEL.                                                  00463000
004640     MOVE PDB-RPV102K-NAME TO PAN-NAME.                           00464000
004650     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00465000
004660     IF FROM-BREAKAWAY                                            00466000
004670         OR FROM-HELP                                             00467000
004680         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00468000
004690     ELSE                                                         00469000
004700         MOVE PDB-RPV102K-PRODCD TO PAN-SET-FLD.                  00470000
004710     PERFORM CALL-BISPAN-RPV102K.                                 00471000
004720     MOVE COM-OPERID TO RPV102K-OPERID.                           00472000
004730     MOVE COM-INST TO RPV102K-INST.                               00473000
004740     MOVE COM-EDIT-DATE TO RPV102K-SYSDATE.                       00474000
004750     IF RPV102K-PRODCD IS EQUAL TO SPACES                         00475000
004760         MOVE LOW-VALUES TO RPV102K-PRODCD.                       00476000
004770     MOVE RPV102K-ACCOUNT TO SR-JUSTIFYIN.                        00477000
004780     MOVE +18 TO SR-JLGTH.                                        00478000
004790     PERFORM LEFT-JUSTIFY.                                        00479000
004800     MOVE SR-JUSTIFYOUT TO RPV102K-ACCOUNT.                       00480000
004810     IF RPV102K-ACCOUNT IS EQUAL TO SPACES                        00481000
004820         MOVE LOW-VALUES TO RPV102K-ACCOUNT.                      00482000
004830     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00483000
004840         MOVE WS-HELPMSG TO WS-MSGNBR.                            00484000
004850     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00485000
004860         MOVE '000027' TO WS-MSGNBR                               00486000
004870     ELSE                                                         00487000
004880         PERFORM BUILD-NEXTKEY                                    00488000
004890         PERFORM COMPRESS-NEXTKEY                                 00489000
004900         MOVE WS-NEXTKEY TO RPV102K-COMMAND.                      00490000
004910     IF FROM-BREAKAWAY                                            00491000
004920         OR FROM-HELP                                             00492000
004930         MOVE SPACE TO COM-FROM-PANEL                             00493000
004940         MOVE COM-KEY-COMMAND TO RPV102K-COMMAND                  00494000
004950         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00495000
004960     ELSE                                                         00496000
004970         MOVE WS-NEXTKEY TO COM-KEY-COMMAND                       00497000
004980         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00498000
004990     MOVE 'E' TO COM-RETURN.                                      00499000
005000     PERFORM GET-MESSAGE.                                         00500000
005010     MOVE WS-MESSAGE TO RPV102K-MSGLINE.                          00501000
005020     PERFORM PANEL-PFKEY-SET.                                     00502000
005030     PERFORM BUILD-PFKEY-LINE.                                    00503000
005040     MOVE WS-PFLINE1 TO RPV102K-PFLINE1.                          00504000
005050     MOVE WS-PFLINE2 TO RPV102K-PFLINE2.                          00505000
005060     PERFORM PANEL-PUT-RPV102K.                                   00506000
005070     PERFORM PANEL-SEND.                                          00507000
005080     MOVE 'E' TO COM-PANEL-ACTION.                                00508000
005090     MOVE COM-INTID TO WS-TRANSID.                                00509000
005100     GO TO CICS-RETURN-TRANSID.                                   00510000
005110 PKP-EXIT.                                                        00511000
005120     EXIT.                                                        00512000
005130******************************************************************00513000
005140 PROCESS-INFO-PANEL SECTION.                                      00514000
005150 PIP-START.                                                       00515000
005160     IF FROM-HELP                                                 00516000
005170         OR FROM-BREAKAWAY                                        00517000
005180         GO TO PIP-SEND-PANEL.                                    00518000
005190     IF INITIAL-PANEL                                             00519000
005200         MOVE +1 TO RPXXX01-PAGES-TO-READ                         00520000
005210         MOVE +1 TO COM-RPXXX01-CURPAGE                           00521000
005220         MOVE SPACES TO COM-FIRST-KEY                             00522000
005230         MOVE COM-RPXXX01-CURPAGE TO RPXXX01-CURPAGE              00523000
005240         GO TO PIP-CONTINUE.                                      00524000
005250 PIP-PFKEYS.                                                      00525000
005260     MOVE ALL ZEROS TO WS-MSGNBR.                                 00526000
005270     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00527000
005280         GO TO PIP-SEND-PANEL.                                    00528000
005290     IF EIBAID IS EQUAL TO DFHPF2                                 00529000
005300         AND COM-RPXXX01-CURPAGE IS GREATER THAN +1               00530000
005310         MOVE +1 TO COM-RPXXX01-CURPAGE                           00531000
005320         MOVE COM-RPXXX01-CURPAGE TO RPXXX01-CURPAGE              00532000
005330         MOVE +1 TO RPXXX01-PAGES-TO-READ                         00533000
005340         MOVE SPACES TO COM-FIRST-KEY                             00534000
005350         MOVE SPACES TO RPXXX01-KEY-ACCT2-GRP                     00535000
005360         GO TO PIP-CONTINUE.                                      00536000
005370     IF EIBAID IS EQUAL TO DFHPF7                                 00537000
005380         AND COM-RPXXX01-CURPAGE IS GREATER THAN +1               00538000
005390         SUBTRACT +1 FROM COM-RPXXX01-CURPAGE                     00539000
005400         MOVE COM-RPXXX01-CURPAGE TO RPXXX01-CURPAGE              00540000
005410         MOVE RPXXX01-CURPAGE TO RPXXX01-PAGES-TO-READ            00541000
005420         MOVE COM-FIRST-KEY TO RPXXX01-KEY-ACCT2-GRP              00542000
005430         GO TO PIP-CONTINUE.                                      00543000
005440     IF EIBAID IS EQUAL TO DFHPF8                                 00544000
005450         AND COM-KEY-OCCUR IS LESS THAN +06                       00545000
005460         MOVE '000046' TO WS-MSGNBR                               00546000
005470         GO TO PIP-SEND-PANEL.                                    00547000
005480     IF EIBAID IS EQUAL TO DFHENTER                               00548000
005490         AND COM-KEY-OCCUR IS LESS THAN +06                       00549000
005500         AND NOT FROM-BREAKAWAY                                   00550000
005510         MOVE 'X' TO COM-RETURN                                   00551000
005520         GO TO PANEL-ROUTER.                                      00552000
005530     IF EIBAID IS EQUAL TO DFHPF8                                 00553000
005540         OR EIBAID IS EQUAL TO DFHENTER                           00554000
005550         ADD +1 TO COM-RPXXX01-CURPAGE                            00555000
005560         MOVE COM-RPXXX01-CURPAGE TO RPXXX01-CURPAGE              00556000
005570         MOVE +1 TO RPXXX01-PAGES-TO-READ                         00557000
005580         MOVE COM-LAST-KEY TO RPXXX01-KEY-ACCT2-GRP               00558000
005590         GO TO PIP-CONTINUE.                                      00559000
005600 PIP-CONTINUE.                                                    00560000
005610     MOVE +0 TO RPXXX01-SUB.                                      00561000
005620 PIP-RPXXX01-LOOP.                                                00562000
005630     ADD +1 TO RPXXX01-SUB.                                       00563000
005640     IF RPXXX01-SUB IS GREATER THAN RPXXX01-PAGES-TO-READ         00564000
005650         GO TO PIP-RPXXX01-RETURN-CHECK.                          00565000
005660     PERFORM RPXXX01-LINK-MESSAGE.                                00566000
005670     MOVE RPXXX01-KEY-IDNUMBER TO COM-KEY-IDNBR.                  00567000
005680     IF RPXXX01-KEY-MODEL IS NOT EQUAL TO COM-KEY-MODEL           00568000
005690         MOVE RPXXX01-KEY-MODEL TO COM-KEY-MODEL.                 00569000
005700     GO TO PIP-RPXXX01-LOOP.                                      00570000
005710 PIP-RPXXX01-RETURN-CHECK.                                        00571000
005720     IF RPXXX01-SELECT-RTN IS NOT EQUAL TO '1'                    00572000
005730         AND RPXXX01-SELECT-RTN IS NOT EQUAL TO '2'               00573000
005740         AND RPXXX01-SELECT-RTN IS NOT EQUAL TO '3'               00574000
005750         MOVE WS-AB6345 TO COM-ABORT                              00575000
005760         MOVE WS-TR0002 TO COM-ABTRACE                            00576000
005770         GO TO ABORT-EXIT.                                        00577000
005780     IF RPXXX01-SELECT-RTN IS EQUAL TO '3'                        00578000
005790         MOVE 'Y' TO COM-MORE                                     00579000
005800     ELSE                                                         00580000
005810         MOVE SPACES TO COM-MORE.                                 00581000
005820     IF RPXXX01-SELECT-RTN IS EQUAL TO '1'                        00582000
005830         AND WS-MSGNBR IS GREATER THAN ZEROS                      00583000
005840         MOVE 'E' TO COM-RETURN                                   00584000
005850         MOVE 'E' TO COM-PANEL-ACTION                             00585000
005860         MOVE 'I' TO COM-FROM-PANEL                               00586000
005870         GO TO PANEL-ROUTER.                                      00587000
005880     IF RPXXX01-SELECT-RTN IS EQUAL TO '1'                        00588000
005890         AND EDIT-PANEL                                           00589000
005900         MOVE 'X' TO COM-RETURN                                   00590000
005910         GO TO PANEL-ROUTER.                                      00591000
005920     IF RPXXX01-SELECT-RTN IS EQUAL TO '1'                        00592000
005930         MOVE '000003' TO WS-MSGNBR                               00593000
005940         MOVE 'E' TO COM-RETURN                                   00594000
005950         MOVE 'E' TO COM-PANEL-ACTION                             00595000
005960         MOVE 'I' TO COM-FROM-PANEL                               00596000
005970         GO TO PANEL-ROUTER.                                      00597000
005980     IF RPXXX01-RETURN IS EQUAL TO 'E'                            00598000
005990         AND FROM-KEY-PANEL                                       00599000
006000         AND INITIAL-PANEL                                        00600000
006010         MOVE RPXXX01-MSGNBR TO WS-MSGNBR                         00601000
006020         MOVE 'E' TO COM-RETURN                                   00602000
006030         MOVE 'E' TO COM-PANEL-ACTION                             00603000
006040         MOVE 'I' TO COM-FROM-PANEL                               00604000
006050         GO TO PANEL-ROUTER.                                      00605000
006060 PIP-PAGING-CONTROLS.                                             00606000
006070     IF COM-FIRST-KEY IS EQUAL TO SPACES                          00607000
006080         MOVE RPXXX01-RET-KEY (1) TO COM-FIRST-KEY.               00608000
006090     MOVE RPXXX01-CUST-TYPE TO COM-CUST-TYPE.                     00609000
006100     MOVE RPXXX01-CUST-NAME TO COM-CUST-NAME.                     00610000
006110     MOVE RPXXX01-MODEL-DESC TO COM-MODEL-DESC.                   00611000
006120     MOVE RPXXX01-PRIM-OPTION TO COM-PRIM-OPTION.                 00612000
006130     MOVE RPXXX01-RET-KEY (RPXXX01-OCCUR) TO COM-LAST-KEY.        00613000
006140     MOVE RPXXX01-CURPAGE TO COM-RPXXX01-CURPAGE.                 00614000
006150     MOVE RPXXX01-OCCUR TO COM-KEY-OCCUR.                         00615000
006160     IF COM-PRODCODE IS EQUAL TO LOW-VALUES                       00616000
006170         MOVE RPXXX01-KEY-PRODCODE TO COM-PRODCODE                00617000
006180         MOVE RPXXX01-KEY-PRODCODE TO COM-KEY-PRODCODE            00618000
006190         MOVE RPXXX01-KEY-ACCOUNT TO COM-KEY-ACCOUNT              00619000
006200         MOVE RPXXX01-KEY-MODEL TO COM-KEY-MODEL.                 00620000
006210     PERFORM EDIT-INFO-PANEL.                                     00621000
006220 PIP-SEND-PANEL.                                                  00622000
006230     IF FROM-HELP                                                 00623000
006240         OR FROM-BREAKAWAY                                        00624000
006250         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00625000
006260         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00626000
006270     ELSE                                                         00627000
006280         MOVE PDB-RPV102-COMMAND TO PAN-SET-FLD.                  00628000
006290     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00629000
006300     PERFORM CALL-BISPAN-RPV102.                                  00630000
006310     MOVE COM-INST TO RPV102-INST.                                00631000
006320     MOVE COM-OPERID TO RPV102-OPERID.                            00632000
006330     MOVE COM-EDIT-DATE TO RPV102-SYSDATE.                        00633000
006340     MOVE COM-KEY-ACCOUNT TO RPV102-ACCOUNT.                      00634000
006350     MOVE COM-PRODCODE TO RPV102-PRODCD.                          00635000
006360     MOVE COM-KEY-MODEL TO RPV102-MODEL.                          00636000
006370     MOVE COM-CUST-NAME TO RPV102-CUSTNA.                         00637000
006380     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00638000
006390         MOVE WS-HELPMSG TO WS-MSGNBR.                            00639000
006400     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00640000
006410         MOVE '000027' TO WS-MSGNBR                               00641000
006420     ELSE                                                         00642000
006430         PERFORM BUILD-NEXTKEY                                    00643000
006440         PERFORM COMPRESS-NEXTKEY                                 00644000
006450         MOVE WS-NEXTKEY TO RPV102-COMMAND.                       00645000
006460     IF FROM-HELP                                                 00646000
006470         OR FROM-BREAKAWAY                                        00647000
006480         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00648000
006490         MOVE COM-KEY-COMMAND TO RPV102-COMMAND                   00649000
006500         MOVE SPACE TO COM-FROM-PANEL                             00650000
006510     ELSE                                                         00651000
006520         MOVE RPV102-COMMAND TO COM-KEY-COMMAND                   00652000
006530         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00653000
006540     PERFORM PANEL-PFKEY-SET.                                     00654000
006550     MOVE SPACES TO RPV102-MORE.                                  00655000
006560     MOVE 'E' TO COM-END.                                         00656000
006570     IF COM-MORE IS EQUAL TO 'Y'                                  00657000
006580         MOVE WS-MORE TO RPV102-MORE                              00658000
006590         MOVE '+' TO RPV102-PLUS                                  00659000
006600         MOVE 'F' TO COM-END                                      00660000
006610     ELSE                                                         00661000
006620         MOVE 'N' TO WS-PF8-FLG                                   00662000
006630         MOVE SPACE TO RPV102-PLUS.                               00663000
006640     IF COM-RPXXX01-CURPAGE IS GREATER THAN +1                    00664000
006650         MOVE WS-MORE TO RPV102-MORE                              00665000
006660         MOVE '-' TO RPV102-MINUS                                 00666000
006670         MOVE 'P' TO COM-END                                      00667000
006680     ELSE                                                         00668000
006690         MOVE 'P' TO WS-PF7-FLG                                   00669000
006700         MOVE SPACE TO RPV102-MINUS.                              00670000
006710     IF COM-MORE IS EQUAL TO 'Y'                                  00671000
006720         AND COM-RPXXX01-CURPAGE IS GREATER THAN +1               00672000
006730         MOVE 'B' TO COM-END.                                     00673000
006740     IF COM-WKUCOUNT IS GREATER THAN ZERO                         00674000
006750         AND COM-WKUPOSITION IS GREATER THAN +1                   00675000
006760         AND COM-END IS NOT EQUAL TO 'P'                          00676000
006770         MOVE 'A' TO WS-PF7-FLG.                                  00677000
006780     IF COM-WKUCOUNT IS GREATER THAN ZERO                         00678000
006790         AND COM-WKUPOSITION IS LESS THAN COM-WKUCOUNT            00679000
006800         AND COM-END IS NOT EQUAL TO 'F'                          00680000
006810         MOVE 'A' TO WS-PF8-FLG.                                  00681000
006820 PIP-COMPLETE-SEND.                                               00682000
006830     PERFORM BUILD-PFKEY-LINE.                                    00683000
006840     MOVE WS-PFLINE1 TO RPV102-PFLINE1.                           00684000
006850     MOVE WS-PFLINE2 TO RPV102-PFLINE2.                           00685000
006860     PERFORM GET-MESSAGE.                                         00686000
006870     MOVE WS-MESSAGE TO RPV102-MSGLINE.                           00687000
006880     PERFORM PANEL-PUT-RPV102.                                    00688000
006890     PERFORM PANEL-SEND.                                          00689000
006900     MOVE '1' TO COM-RETURN.                                      00690000
006910     MOVE 'I' TO COM-FROM-PANEL.                                  00691000
006920     MOVE 'E' TO COM-PANEL-ACTION.                                00692000
006930     MOVE COM-INTID TO WS-TRANSID.                                00693000
006940     GO TO CICS-RETURN-TRANSID.                                   00694000
006950 PIP-EXIT.                                                        00695000
006960     EXIT.                                                        00696000
006970******************************************************************00697000
006980 EDIT-INFO-PANEL SECTION.                                         00698000
006990 EIP-START.                                                       00699000
007000     MOVE RPXXX01-KEY-MODEL TO RPV102K-MODEL.                     00700000
007010     MOVE RPXXX01-MODEL-DESC TO RPV102-MODDESC.                   00701000
007020     MOVE SPACES TO RPV102-RELTYPE.                               00702000
007030     IF RPXXX01-OUT-FLAG IS EQUAL TO 'Y'                          00703000
007040         MOVE '** OUTSIDE RELATIONSHIP **' TO RPV102-RELTYPE.     00704000
007050     MOVE RPXXX01-IDNUMBER TO RPV102-IDNBR.                       00705000
007060     MOVE +0 TO WS-SUB1.                                          00706000
007070 EIP-LOOP.                                                        00707000
007080     ADD +0001 TO WS-SUB1.                                        00708000
007090     IF WS-SUB1 IS GREATER THAN +05                               00709000
007100         GO TO EIP-EXIT.                                          00710000
007110     IF WS-SUB1 IS GREATER THAN RPXXX01-OCCUR                     00711000
007120         MOVE SPACE TO RPV102-INSTX (WS-SUB1)                     00712000
007130         MOVE SPACE TO RPV102-PRODCDX (WS-SUB1)                   00713000
007140         MOVE SPACE TO RPV102-ACCTX (WS-SUB1)                     00714000
007150         MOVE SPACE TO RPV102-CATCDE1 (WS-SUB1)                   00715000
007160         MOVE SPACE TO RPV102-ABAL1 (WS-SUB1)                     00716000
007170         MOVE SPACE TO RPV102-REQBAL1 (WS-SUB1)                   00717000
007180         MOVE SPACE TO RPV102-CATCDE2 (WS-SUB1)                   00718000
007190         MOVE SPACE TO RPV102-ABAL2 (WS-SUB1)                     00719000
007200         MOVE SPACE TO RPV102-REQBAL2 (WS-SUB1)                   00720000
007210         GO TO EIP-LOOP.                                          00721000
007220     MOVE RPXXX01-RET-INST (WS-SUB1)                              00722000
007230         TO RPV102-INSTX (WS-SUB1).                               00723000
007240     MOVE RPXXX01-RET-PRODCODE (WS-SUB1)                          00724000
007250         TO RPV102-PRODCDX (WS-SUB1).                             00725000
007260     MOVE RPXXX01-RET-ACCOUNT (WS-SUB1) TO RPV102-ACCTX (WS-SUB1).00726000
007270     IF RPXXX01-RET-PRODCODE (WS-SUB1) IS EQUAL TO SPACES         00727000
007280         AND RPXXX01-RET-ACCOUNT (WS-SUB1) IS EQUAL TO SPACES     00728000
007290         MOVE RPXXX01-KEY-INST TO RPV102-INSTX (WS-SUB1)          00729000
007300         MOVE RPXXX01-KEY-PRODCODE TO RPV102-PRODCDX (WS-SUB1)    00730000
007310         MOVE RPXXX01-KEY-ACCOUNT TO RPV102-ACCTX (WS-SUB1).      00731000
007320     MOVE RPXXX01-RET-CATCD-01 (WS-SUB1)                          00732000
007330         TO RPV102-CATCDE1 (WS-SUB1).                             00733000
007340     MOVE RPXXX01-RET-BAL-01 (WS-SUB1) TO SR-EDITSGNV02.          00734000
007350     MOVE SR-EDIT15X TO RPV102-ABAL1 (WS-SUB1).                   00735000
007360     MOVE RPXXX01-RET-REQ-01 (WS-SUB1) TO SR-EDITSGNV02.          00736000
007370     MOVE SR-EDIT15X TO RPV102-REQBAL1 (WS-SUB1).                 00737000
007380     MOVE RPXXX01-RET-CATCD-02 (WS-SUB1)                          00738000
007390         TO RPV102-CATCDE2 (WS-SUB1).                             00739000
007400     MOVE RPXXX01-RET-BAL-02 (WS-SUB1) TO SR-EDITSGNV02.          00740000
007410     MOVE SR-EDIT16X TO RPV102-ABAL2 (WS-SUB1).                   00741000
007420     MOVE RPXXX01-RET-REQ-02 (WS-SUB1) TO SR-EDITSGNV02.          00742000
007430     MOVE SR-EDIT16X TO RPV102-REQBAL2 (WS-SUB1).                 00743000
007440     GO TO EIP-LOOP.                                              00744000
007450 EIP-EXIT.                                                        00745000
007460     EXIT.                                                        00746000
007470******************************************************************00747000
007480 MORE-DATA-PANELS SECTION.                                        00748000
007490 MDP-START.                                                       00749000
007500     GO TO PANEL-ROUTER.                                          00750000
007510 MDP-EXIT.                                                        00751000
007520     EXIT.                                                        00752000
007530******************************************************************00753000
007540 CLOSE-TRANSACTION SECTION.                                       00754000
000000 COPY SRP0722.                                                    00755000
007560******************************************************************00756000
007570 PANEL-INIT SECTION.                                              00757000
000000 COPY SRP073.                                                     00758000
007590******************************************************************00759000
007600 BUILD-NEXTKEY SECTION.                                           00760000
007610 BXN-START.                                                       00761000
007620     MOVE SPACES TO WS-NEXTKEY.                                   00762000
007630     MOVE ',' TO WS-DELIM1.                                       00763000
007640     MOVE ',' TO WS-DELIM2.                                       00764000
007650     MOVE ',' TO WS-DELIM3.                                       00765000
007660     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00766000
007670     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00767000
007680         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00768000
007690     ELSE                                                         00769000
007700         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00770000
007710     IF COM-WKUNAME (1:2) IS EQUAL TO 'RF'                        00771000
007720         MOVE COM-WK-PRODCODE TO WS-PRODCODE                      00772000
007730         MOVE COM-IDNUMBER TO WS-ACCT.                            00773000
007740     MOVE COM-KEY-MODEL TO WS-MODEL.                              00774000
007750     MOVE COM-EXTERNALID TO WS-EXTID.                             00775000
007760 BXN-EXIT.                                                        00776000
007770     EXIT.                                                        00777000
007780******************************************************************00778000
007790 ABORT-EXIT SECTION.                                              00779000
007800 AE-START.                                                        00780000
007810     MOVE EIBFN TO COM-ABEIBFN.                                   00781000
007820     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00782000
007830     GO TO CICS-ABORT-EXIT.                                       00783000
007840 AE-EXIT.                                                         00784000
007850     EXIT.                                                        00785000
007860******************************************************************00786000
007870 RPXXX01-LINK-MESSAGE SECTION.                                    00787000
007880 RPLM-START.                                                      00788000
007890     MOVE 'Y' TO RPXXX01-GLOBAL-CLOSE.                            00789000
007900     MOVE 'VKL' TO RPXXX01-APIFUNC.                               00790000
007910     MOVE WS-FILEOPTIONS TO RPXXX01-FILEOPTS.                     00791000
007920     MOVE COM-RETURN TO RPXXX01-RETURN.                           00792000
007930     MOVE COM-SECALT TO RPXXX01-SECALT.                           00793000
007940     MOVE COM-OPERID TO RPXXX01-OPERID.                           00794000
007950     MOVE COM-DATE TO RPXXX01-DATE.                               00795000
007960     MOVE COM-EXTERNALID TO RPXXX01-EXTERNALID.                   00796000
007970     MOVE WS-RPSAPPLNBR TO RPXXX01-APPL.                          00797000
007980     MOVE COM-INST TO RPXXX01-KEY-INST.                           00798000
007990     MOVE COM-PRODCODE TO RPXXX01-KEY-PRODCODE.                   00799000
008000     MOVE COM-KEY-ACCOUNT TO RPXXX01-KEY-ACCOUNT.                 00800000
008010     MOVE COM-KEY-MODEL TO RPXXX01-KEY-MODEL.                     00801000
008020     IF COM-KEY-MODEL IS EQUAL TO LOW-VALUES                      00802000
008030         MOVE SPACES TO RPXXX01-KEY-MODEL.                        00803000
008040     IF COM-KEY-IDNBR IS NUMERIC                                  00804000
008050         AND COM-KEY-IDNBR IS GREATER THAN ZEROS                  00805000
008060         MOVE COM-KEY-IDNBR TO RPXXX01-KEY-IDNUMBER.              00806000
008070     MOVE COM-RPXXX01-OCCUR TO RPXXX01-OCCUR.                     00807000
008080     MOVE COM-RPXXX01-CURPAGE TO RPXXX01-CURPAGE.                 00808000
008090     IF COM-CUST-TYPE IS NOT EQUAL TO 'R'                         00809000
008100         AND COM-CUST-TYPE IS NOT EQUAL TO 'C'                    00810000
008110         MOVE SPACES TO COM-CUST-TYPE                             00811000
008120         MOVE SPACES TO COM-CUST-NAME                             00812000
008130         MOVE ZEROES TO COM-MODEL                                 00813000
008140         MOVE SPACES TO COM-MODEL-DESC                            00814000
008150         MOVE SPACES TO COM-PRIM-OPTION.                          00815000
008160     MOVE COM-CUST-TYPE TO RPXXX01-CUST-TYPE.                     00816000
008170     MOVE COM-CUST-NAME TO RPXXX01-CUST-NAME.                     00817000
008180     MOVE COM-MODEL-DESC TO RPXXX01-MODEL-DESC.                   00818000
008190     MOVE COM-PRIM-OPTION TO RPXXX01-PRIM-OPTION.                 00819000
008200     MOVE COM-LANG TO RPXXX01-COM-LANG.                           00820000
008210     MOVE COM-CURN-CODE TO RPXXX01-COM-CURNCD.                    00821000
008220     MOVE COM-INST-OPTS TO RPXXX01-INST-OPTS.                     00822000
008230     EXEC CICS LINK                                               00823000
008240         PROGRAM('RPLXXX01')                                      00824000
008250         COMMAREA(RPXXX01-MESSAGE)                                00825000
008260         LENGTH(LENGTH OF RPXXX01-MESSAGE)                        00826000
008270         RESP(WS-CICS-RESPONSE)                                   00827000
008280         END-EXEC.                                                00828000
008290     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00829000
008300         MOVE 'RPLXXX01 LINK FAILED' TO COM-ABMSG                 00830000
008310         MOVE WS-TR0003 TO COM-ABTRACE                            00831000
008320         MOVE WS-AB0009 TO COM-ABORT                              00832000
008330         GO TO CICS-ABORT-EXIT.                                   00833000
008340     MOVE RPXXX01-FUNCTION TO WS-FUNCTION.                        00834000
008350     IF RPXXX01-ABORT IS NOT EQUAL TO ZERO                        00835000
008360         MOVE RPXXX01-ABORT TO COM-ABORT                          00836000
008370         MOVE RPXXX01-ABTRACE TO COM-ABTRACE                      00837000
008380         MOVE RPXXX01-ABEIBFN TO COM-ABEIBFN                      00838000
008390         MOVE RPXXX01-ABEIBRCODE TO COM-ABEIBRCODE                00839000
008400         MOVE RPXXX01-ABPROGID TO COM-ABPROGID                    00840000
008410         MOVE RPXXX01-SRBMDB TO COM-SRBMDB                        00841000
008420         MOVE RPXXX01-ABTYPE TO COM-ABTYPE                        00842000
008430         GO TO CICS-ABORT-EXIT.                                   00843000
008440     MOVE RPXXX01-ABORT TO COM-ABORT.                             00844000
008450     MOVE RPXXX01-MSGNBR TO WS-MSGNBR.                            00845000
008460     IF RPXXX01-OCCUR IS EQUAL TO +06                             00846000
008470         AND RPXXX01-SUB IS LESS THAN RPXXX01-PAGES-TO-READ       00847000
008480         MOVE RPXXX01-RET-KEY (06) TO RPXXX01-KEY-ACCT2-GRP.      00848000
008490 RPLM-EXIT.                                                       00849000
008500     EXIT.                                                        00850000
008510******************************************************************00851000
008520 CLOSE-PANEL SECTION.                                             00852000
008530 CP-START.                                                        00853000
008540     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00854000
008550     IF COM-RETURN IS EQUAL TO 'E'                                00855000
008560         PERFORM CALL-BISPAN-RPV102K.                             00856000
008570     IF COM-RETURN IS EQUAL TO '1'                                00857000
008580         PERFORM CALL-BISPAN-RPV102.                              00858000
008590 CP-EXIT.                                                         00859000
008600     EXIT.                                                        00860000
008610******************************************************************00861000
008620 CALL-BISPAN-RPV102K SECTION.                                     00862000
008630 CBD1-START.                                                      00863000
008640     CALL 'BISPAN' USING                                          00864000
008650         BICRPSB,                                                 00865000
008660         BICRSRB,                                                 00866000
008670         BICRPAN,                                                 00867000
008680         RPV102K-PANL-DATA-BLOCK,                                 00868000
008690         RPV102K-PANL-DATA-AREA.                                  00869000
008700 CBD1-EXIT.                                                       00870000
008710     EXIT.                                                        00871000
008720******************************************************************00872000
008730 CALL-BISPAN-RPV102 SECTION.                                      00873000
008740 CBD2-START.                                                      00874000
008750     CALL 'BISPAN' USING                                          00875000
008760         BICRPSB,                                                 00876000
008770         BICRSRB,                                                 00877000
008780         BICRPAN,                                                 00878000
008790         RPV102-PANL-DATA-BLOCK,                                  00879000
008800         RPV102-PANL-DATA-AREA.                                   00880000
008810 CBD2-EXIT.                                                       00881000
008820     EXIT.                                                        00882000
008830******************************************************************00883000
008840 PANEL-GET-RPV102 SECTION.                                        00884000
008850 PANEL-GET-RPV102-START.                                          00885000
008860     MOVE 'N' TO RPV102-SW-SET-CURSOR.                            00886000
008870     MOVE PDB-RPV102-NAME TO PAN-NAME.                            00887000
008880     MOVE REQ-GET TO PAN-REQ-VERB.                                00888000
008890     CALL 'BISPAN' USING                                          00889000
008900         BICRPSB                                                  00890000
008910         BICRSRB                                                  00891000
008920         BICRPAN                                                  00892000
008930         RPV102-PANL-DATA-BLOCK,                                  00893000
008940         RPV102-PANL-DATA-AREA.                                   00894000
008950 PANEL-GET-RPV102-EXIT.                                           00895000
008960     EXIT.                                                        00896000
008970******************************************************************00897000
008980 PANEL-PUT-RPV102 SECTION.                                        00898000
008990 PANEL-PUT-RPV102-START.                                          00899000
009000     MOVE PDB-RPV102-NAME TO PAN-NAME.                            00900000
009010     MOVE REQ-PUT TO PAN-REQ-VERB.                                00901000
009020     CALL 'BISPAN' USING                                          00902000
009030         BICRPSB                                                  00903000
009040         BICRSRB                                                  00904000
009050         BICRPAN                                                  00905000
009060         RPV102-PANL-DATA-BLOCK,                                  00906000
009070         RPV102-PANL-DATA-AREA.                                   00907000
009080 PANEL-PUT-RPV102-EXIT.                                           00908000
009090     EXIT.                                                        00909000
009100******************************************************************00910000
009110 PANEL-GET-RPV102K SECTION.                                       00911000
009120 PANEL-GET-RPV102K-START.                                         00912000
009130     MOVE 'N' TO RPV102K-SW-SET-CURSOR.                           00913000
009140     MOVE PDB-RPV102K-NAME TO PAN-NAME.                           00914000
009150     MOVE REQ-GET TO PAN-REQ-VERB.                                00915000
009160     CALL 'BISPAN' USING                                          00916000
009170         BICRPSB                                                  00917000
009180         BICRSRB                                                  00918000
009190         BICRPAN                                                  00919000
009200         RPV102K-PANL-DATA-BLOCK,                                 00920000
009210         RPV102K-PANL-DATA-AREA.                                  00921000
009220 PANEL-GET-RPV102K-EXIT.                                          00922000
009230     EXIT.                                                        00923000
009240******************************************************************00924000
009250 PANEL-PUT-RPV102K SECTION.                                       00925000
009260 PANEL-PUT-RPV102K-START.                                         00926000
009270     MOVE PDB-RPV102K-NAME TO PAN-NAME.                           00927000
009280     MOVE REQ-PUT TO PAN-REQ-VERB.                                00928000
009290     CALL 'BISPAN' USING                                          00929000
009300         BICRPSB                                                  00930000
009310         BICRSRB                                                  00931000
009320         BICRPAN                                                  00932000
009330         RPV102K-PANL-DATA-BLOCK,                                 00933000
009340         RPV102K-PANL-DATA-AREA.                                  00934000
009350 PANEL-PUT-RPV102K-EXIT.                                          00935000
009360     EXIT.                                                        00936000
009370******************************************************************00937000
009380 MIC-MST-API SECTION.                                             00938000
000000 COPY MIPMSTA.                                                    00939000
009400******************************************************************00940000
009410 EDIT-ACCOUNT-KEY SECTION.                                        00941000
009420 EAK-START.                                                       00942000
009430     MOVE COM-INST TO RPW130-INST.                                00943000
009440     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 00944000
009450     MOVE COM-KEY-PRODCODE TO RPW130-PRODCODE.                    00945000
009460     MOVE COM-KEY-ACCOUNT TO RPW130-ACCOUNTINPUT.                 00946000
009470     MOVE 'V' TO RPW130-FUNCTION.                                 00947000
009480     PERFORM ACCOUNT-KEY-EDIT.                                    00948000
009490     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00949000
009500         MOVE '500001' TO WS-MSGNBR                               00950000
009510         GO TO EAK-EXIT.                                          00951000
009520     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00952000
009530     MOVE RPW130-ACCOUNTKEY TO COM-KEY-ACCOUNT.                   00953000
009540     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          00954000
009550     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      00955000
009560     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                00956000
009570 EAK-EXIT.                                                        00957000
009580     EXIT.                                                        00958000
009590******************************************************************00959000
009600 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 00960000
000000 COPY RPP033.                                                     00961000
009620******************************************************************00962000
009630 ACCOUNT-KEY-EDIT SECTION.                                        00963000
000000 COPY RPP130.                                                     00964000
009650******************************************************************00965000
009660 LEFT-JUSTIFY SECTION.                                            00966000
000000 COPY SRP025.                                                     00967000
009680******************************************************************00968000
009690 RIGHT-JUSTIFY SECTION.                                           00969000
000000 COPY SRP026.                                                     00970000
009710******************************************************************00971000
009720 PARAMETER-SEARCH SECTION.                                        00972000
000000 COPY SRP030.                                                     00973000
009740******************************************************************00974000
009750 COMPRESS-NEXTKEY SECTION.                                        00975000
000000 COPY SRP070.                                                     00976000
009770******************************************************************00977000
009780 GET-MESSAGE SECTION.                                             00978000
000000 COPY SRP071.                                                     00979000
009800******************************************************************00980000
009810 EDIT-CODASYL-DATE SECTION.                                       00981000
000000 COPY SRP087.                                                     00982000
009830******************************************************************00983000
009840 SRP170-ROUTINE SECTION.                                          00984000
000000 COPY SRP170.                                                     00985000
009860******************************************************************00986000
009870 BUILD-PFKEY-LINE SECTION.                                        00987000
000000 COPY SRP710.                                                     00988000
009890******************************************************************00989000
009900 VALIDATE-PFKEYS SECTION.                                         00990000
000000 COPY SRP711.                                                     00991000
009920******************************************************************00992000
009930 SLP096-GET-2023-RECORD SECTION.                                  00993000
000000 COPY SLP096.                                                     00994000
009950******************************************************************00995000
009960 CICS-XCTL SECTION.                                               00996000
000000 COPY SLP704.                                                     00997000
009980******************************************************************00998000
009990 CICS-RETURN-TRANSID SECTION.                                     00999000
000000 COPY SLP710.                                                     01000000
010010******************************************************************01001000
010020 TSQ-DELETE SECTION.                                              01002000
010030 TSQD-START.                                                      01003000
010040 TSQD-EXIT.                                                       01004000
010050     EXIT.                                                        01005000
010060******************************************************************01006000
010070 CICS-TSQ-READ SECTION.                                           01007000
000000 COPY SLP744.                                                     01008000
010090******************************************************************01009000
010100 CICS-ABORT-EXIT SECTION.                                         01010000
000000 COPY SLP798.                                                     01011000
010120******************************************************************01012000
