000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL140.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL140 - RELATIONSHIP EVENT INQUIRY                         *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  RPW014-AREAS.                                                00016000
000000 COPY RPW014.                                                     00017000
000180 01  RPW033-AREAS.                                                00018000
000000 COPY RPW033.                                                     00019000
000200 01  RPW130-AREAS.                                                00020000
000000 COPY RPW130.                                                     00021000
000220*01  BICRSRB.                                                     00022000
000000 COPY BICRSRB.                                                    00023000
000240*01  BICRPSB.                                                     00024000
000000 COPY BICRPSB.                                                    00025000
000260*01  BICRVERB.                                                    00026000
000000 COPY BICRVERB.                                                   00027000
000280*01  BICRSTAT.                                                    00028000
000000 COPY BICRSTAT.                                                   00029000
000300*01  BICRCONS.                                                    00030000
000000 COPY BICRCONS.                                                   00031000
000320*01  BICRDBS.                                                     00032000
000000 COPY BICRDBS.                                                    00033000
000340*01  BICRPAN.                                                     00034000
000000 COPY BICRPAN.                                                    00035000
000360 01  SRW710-AREAS.                                                00036000
000000 COPY SRW710.                                                     00037000
000380 01  RPV140K-PANL-DATA-BLOCK.                                     00038000
000000 COPY RPV140KW.                                                   00039000
000400 01  RPV140-PANL-DATA-BLOCK.                                      00040000
000000 COPY RPV140W.                                                    00041000
000420 01  WS-WORKAREAS.                                                00042000
000430     03  WS-NEXTKEY.                                              00043000
000440         05  WS-EXTID            PIC X(08).                       00044000
000450         05  WS-DELIM1           PIC X(01)       VALUE ','.       00045000
000460         05  WS-DATA.                                             00046000
000470             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00047000
000480             07  WS-DELIM2       PIC X(01)       VALUE ','.       00048000
000490             07  WS-ACCTX.                                        00049000
000500                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00050000
000510             07  WS-DELIM3       PIC X(01)       VALUE ','.       00051000
000520             07  WS-SDATE        PIC X(10)       VALUE SPACES.    00052000
000530         05  FILLER              PIC X(42)       VALUE SPACES.    00053000
000540     03  WS-MORE                 PIC X(05)       VALUE 'More:'.   00054000
000550     03  WS-LNKPROG              PIC X(08)       VALUE 'RPLEVT01'.00055000
000560     03  WS-LKLGTH               PIC S9(04)      COMP             00056000
000570                                                 VALUE +4088.     00057000
000580     03  WS-PDATE                PIC 9(08).                       00058000
000590     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00059000
000600         05  WS-PDATE-YYYY       PIC 9(04).                       00060000
000610         05  WS-PDATE-MM         PIC 9(02).                       00061000
000620         05  WS-PDATE-DD         PIC 9(02).                       00062000
000630     03  WS-START-DATE           PIC 9(09).                       00063000
000640     03  WS-RAWDATE              PIC X(10).                       00064000
000650     03  WS-BEGDATE              PIC 9(08).                       00065000
000660     03  WS-ERR-DATE             PIC X(01).                       00066000
000670     03  WS-RAT95                PIC 9.99999.                     00067000
000680     03  WS-RAT95WHOLE   REDEFINES WS-RAT95.                      00068000
000690         05  WS-FILLER           PIC X(01).                       00069000
000700         05  WS-RAT95X           PIC X(06).                       00070000
000710     03  WS-RAT99                PIC 9.9(09).                     00071000
000720     03  WS-RAT99WHOLE   REDEFINES WS-RAT99.                      00072000
000730         05  WS-FILLER           PIC X(01).                       00073000
000740         05  WS-RAT99X           PIC X(10).                       00074000
000750     03  WS-AMT9                 PIC ZZZZ,ZZ9.99-.                00075000
000760     03  WS-AMT9WHOLE    REDEFINES WS-AMT9.                       00076000
000770         05  WS-FILLER           PIC X(02).                       00077000
000780         05  WS-AMT9X            PIC X(10).                       00078000
000790     03  WS-DISPALL              PIC X(01)       VALUE 'N'.       00079000
000800     03  WS-SCHGLIT.                                              00080000
000810         05  WS-FILLER           PIC X(25)       VALUE            00081000
000820             '-------------------------'.                         00082000
000830         05  WS-FILLER           PIC X(25)       VALUE            00083000
000840             '-- Service Charge -------'.                         00084000
000850         05  WS-FILLER           PIC X(25)       VALUE            00085000
000860             '-------------------------'.                         00086000
000870     03  WS-RATELIT.                                              00087000
000880         05  WS-FILLER           PIC X(25)       VALUE            00088000
000890             '-------------------------'.                         00089000
000900         05  WS-FILLER           PIC X(25)       VALUE            00090000
000910             '------- Rate ------------'.                         00091000
000920         05  WS-FILLER           PIC X(25)       VALUE            00092000
000930             '-------------------------'.                         00093000
000940     03  WS-SCLIT01.                                              00094000
000950         05  WS-FILLER           PIC X(16)       VALUE            00095000
000960             'Incentive  . . :'.                                  00096000
000970     03  WS-SCLIT02.                                              00097000
000980         05  WS-FILLER           PIC X(16)       VALUE            00098000
000990             'Discount Amt . :'.                                  00099000
001000     03  WS-SCLIT03.                                              00100000
001010         05  WS-FILLER           PIC X(16)       VALUE            00101000
001020             'Discount Pct . :'.                                  00102000
001030     03  WS-RTLIT01.                                              00103000
001040         05  WS-FILLER           PIC X(16)       VALUE            00104000
001050             'Incentive  . . :'.                                  00105000
001060     03  WS-RTLIT02.                                              00106000
001070         05  WS-FILLER           PIC X(16)       VALUE            00107000
001080             'Rate Pct . . . :'.                                  00108000
001090     03  WS-RTLIT03.                                              00109000
001100         05  WS-FILLER           PIC X(16)       VALUE            00110000
001110             'Rate Option  . :'.                                  00111000
001120     03  WS-RTLIT04.                                              00112000
001130         05  WS-FILLER           PIC X(16)       VALUE            00113000
001140             'Rate Type  . . :'.                                  00114000
001150 01  WS-LINKMSG                  PIC X(4500).                     00115000
001160 01  RPEVT01-MESSAGE.                                             00116000
000000 COPY MISCNT00      REPLACING                                     00117000
001180             ==:MICNT:== BY ==RPEVT01==.                          00118000
000000 COPY RPSEVT01.                                                   00119000
001200 01  WS-TSQAREAS.                                                 00120000
001210     03  WS-TSQITEM              PIC S9(04)      COMP             00121000
001220                                                 VALUE +0001.     00122000
001230     03  WS-TSQLGTH              PIC S9(04)      COMP             00123000
001240                                                 VALUE +4096.     00124000
001250     03  WS-TSQKEY.                                               00125000
001260         05  WS-TSQID            PIC X(04).                       00126000
001270         05  WS-TSQTRMID         PIC X(04).                       00127000
001280 01  LS-TSQAREA.                                                  00128000
001290     03  LS-TSQKEY               PIC X(08).                       00129000
001300     03  LS-TSQDATA              PIC X(4088).                     00130000
001310 01  MIWPRI-AREAS.                                                00131000
000000 COPY MIWPRI.                                                     00132000
001330 01  MIWMSTA-AREAS.                                               00133000
000000 COPY MIWMSTA.                                                    00134000
001350 01  MIMST-RECORD.                                                00135000
000000 COPY MISMST.                                                     00136000
001370 01  MI2023-RECORD.                                               00137000
000000 COPY MIS2023A.                                                   00138000
001390 01  WS-ABORTCODES.                                               00139000
001400     03  WS-AB0009               PIC S9(04)      COMP             00140000
001410                                                 VALUE +0009.     00141000
001420     03  WS-AB0106               PIC S9(04)      COMP             00142000
001430                                                 VALUE +0106.     00143000
001440     03  WS-AB2033               PIC S9(04)      COMP             00144000
001450                                                 VALUE +2033.     00145000
001460     03  WS-AB6345               PIC S9(04)      COMP             00146000
001470                                                 VALUE +6345.     00147000
001480 01  WS-TRACECODES.                                               00148000
001490     03  WS-TR0001               PIC S9(04)      COMP             00149000
001500                                                 VALUE +0001.     00150000
001510     03  WS-TR0002               PIC S9(04)      COMP             00151000
001520                                                 VALUE +0002.     00152000
001530     03  WS-TR0003               PIC S9(04)      COMP             00153000
001540                                                 VALUE +0003.     00154000
001550 01  SLW096-AREAS.                                                00155000
000000 COPY SLW096.                                                     00156000
001570 01  SRW025-AREAS.                                                00157000
000000 COPY SRW025.                                                     00158000
001590 01  SRW030-AREAS.                                                00159000
000000 COPY SRW030.                                                     00160000
001610 01  SRW031-AREAS.                                                00161000
000000 COPY SRW031.                                                     00162000
001630 01  SRW105-AREAS.                                                00163000
000000 COPY SRW105.                                                     00164000
001650 01  SRW170-AREAS.                                                00165000
000000 COPY SRW170.                                                     00166000
001670 01  SRW161-AREAS.                                                00167000
000000 COPY SRW161.                                                     00168000
001690 01  SRW000-AREAS.                                                00169000
000000 COPY SRW000.                                                     00170000
001710 COPY DFHAID.                                                     00171000
001720******************************************************************00172000
001730 LINKAGE SECTION.                                                 00173000
001740 01  DFHCOMMAREA.                                                 00174000
000000 COPY SLS1112.                                                    00175000
001760     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00176000
001770         05  COM-PROGRAM-ID      PIC X(06).                       00177000
001780         05  COM-EDIT-DATE       PIC X(10).                       00178000
001790         05  COM-KEY-INFO.                                        00179000
001800             07  COM-KEY-OCCUR   PIC S9(04)      COMP-3.          00180000
001810         05  COM-PANEL-ACTION    PIC X(01).                       00181000
001820             88  INITIAL-PANEL                   VALUE ' '.       00182000
001830             88  EDIT-PANEL                      VALUE 'E'.       00183000
001840         05  COM-FROM-PANEL      PIC X(01).                       00184000
001850             88  FROM-KEY-PANEL                  VALUE 'K'.       00185000
001860             88  FROM-INFO-PANEL                 VALUE 'I'.       00186000
001870             88  FROM-HELP                       VALUE 'H'.       00187000
001880             88  FROM-BREAKAWAY                  VALUE 'B'.       00188000
001890         05  COM-KEY-FIELDS.                                      00189000
001900             07  COM-KEY-PRODCODE                                 00190000
001910                                 PIC X(06).                       00191000
001920             07  COM-KEY-ACCOUNT PIC X(18).                       00192000
001930             07  COM-KEY-ACCOUNT-N                                00193000
001940                         REDEFINES COM-KEY-ACCOUNT                00194000
001950                                 PIC 9(18).                       00195000
001960             07  COM-KEY-SDATE   PIC 9(08).                       00196000
001970         05  COM-KEY-MSGNBR      PIC X(06).                       00197000
001980         05  COM-KEY-COMMAND     PIC X(50).                       00198000
001990         05  COM-KEY-FORMATTEDACCT                                00199000
002000                                 PIC X(22).                       00200000
002010         05  COM-RPEVT01-CURPAGE PIC S9(04)      COMP-3.          00201000
002020         05  COM-RPEVT01-OCCUR   PIC S9(04)      COMP-3.          00202000
002030         05  COM-CUST-TYPE       PIC X(01).                       00203000
002040         05  COM-CUST-NAME       PIC X(40).                       00204000
002050         05  COM-FIRST-KEY       PIC X(77).                       00205000
002060         05  COM-LAST-KEY        PIC X(77).                       00206000
002070         05  COM-PREV-KEY        pic X(77).                       00207000
002080         05  COM-MORE            PIC X(01).                       00208000
002090         05  COM-OCCUR           PIC S9(03)      COMP-3.          00209000
002100         05  COM-PF7END          PIC x(01).                       00210000
002110         05  COM-PF8END          PIC x(01).                       00211000
002120******************************************************************00212000
002130*01  SLW096-2023RECORDS.                                          00213000
000000 COPY SLW096L.                                                    00214000
002150******************************************************************00215000
002160 PROCEDURE DIVISION.                                              00216000
002170******************************************************************00217000
002180 ENTRY-ROUTINE SECTION.                                           00218000
002190     MOVE 'RPL140' TO COM-ABPROGID.                               00219000
000000 COPY SLP771.                                                     00220000
002210******************************************************************00221000
002220 TRANSACTION-CLEAN-UP SECTION.                                    00222000
002230 TCU-START.                                                       00223000
002240 TCU-EXIT.                                                        00224000
002250     EXIT.                                                        00225000
002260******************************************************************00226000
002270 CICS-HANDLE-CONDITION SECTION.                                   00227000
000000 COPY SLP772.                                                     00228000
002290     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00229000
002300         GO TO CTSRI-EXIT.                                        00230000
002310     MOVE WS-AB2033 TO COM-ABORT.                                 00231000
002320     MOVE WS-TR0001 TO COM-ABTRACE.                               00232000
002330     GO TO ABORT-EXIT.                                            00233000
002340 CHC-EXIT.                                                        00234000
002350     EXIT.                                                        00235000
002360******************************************************************00236000
002370 ROUTING-ROUTINE SECTION.                                         00237000
002380 RR-START.                                                        00238000
002390     MOVE LOW-VALUES TO RPEVT01-MESSAGE.                          00239000
002400     MOVE LOW-VALUES TO RPV140-PANL-DATA-AREA.                    00240000
002410     MOVE LOW-VALUES TO RPV140K-PANL-DATA-AREA.                   00241000
002420     MOVE ALL ZEROS TO WS-MSGNBR.                                 00242000
002430     IF COM-RETURN IS EQUAL TO 'B'                                00243000
002440         OR COM-BKPGRMID IS EQUAL TO SPACE                        00244000
002450         MOVE 'RP00' TO WS-TSQFILEID                              00245000
002460     ELSE                                                         00246000
002470         MOVE 'RP01' TO WS-TSQFILEID.                             00247000
002480     MOVE 'RPI' TO WS-TSQSYSID.                                   00248000
002490     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00249000
002500         MOVE COM-PAN TO BICRPAN                                  00250000
002510         MOVE COM-PSB TO BICRPSB                                  00251000
002520         MOVE COM-SRB TO BICRSRB                                  00252000
002530     ELSE                                                         00253000
002540         MOVE '1' TO BPSB-LEVEL.                                  00254000
002550     IF COM-RETURN IS EQUAL TO 'B'                                00255000
002560         GO TO BREAKAWAY-RETURN.                                  00256000
002570     IF COM-RETURN IS EQUAL TO '0'                                00257000
002580         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00258000
002590         MOVE SPACES TO COM-WORKAREAS                             00259000
002600         MOVE '1' TO SRB-VERSION                                  00260000
002610         MOVE 'IPRP' TO SRB-APPL-ID                               00261000
002620         MOVE 'RPL140' TO SRB-PROG-ID                             00262000
002630         MOVE 'RPL140' TO COM-PROGRAM-ID                          00263000
002640         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00264000
002650         MOVE 'P' TO PAN-TYPE                                     00265000
002660         MOVE SPACE TO PAN-OVERLAY                                00266000
002670         MOVE SPACE TO PAN-CLOSE                                  00267000
002680         MOVE SPACE TO PAN-ALARM                                  00268000
002690         MOVE SPACE TO PAN-CURSOR-PAN                             00269000
002700         MOVE SPACE TO PAN-CURSOR-FLD                             00270000
002710         MOVE SPACE TO PAN-SET-FLD                                00271000
002720         MOVE SPACE TO PAN-SET-VID                                00272000
002730         MOVE SPACE TO PAN-SET-EMP                                00273000
002740         MOVE +0 TO COM-RPEVT01-CURPAGE                           00274000
002750         MOVE +0 TO COM-RPEVT01-OCCUR                             00275000
002760         MOVE PDB-RPV140K-NAME TO PAN-NAME                        00276000
002770         PERFORM PANEL-INIT                                       00277000
002780         MOVE BICRPAN TO COM-PAN                                  00278000
002790         MOVE BICRPSB TO COM-PSB                                  00279000
002800         MOVE BICRSRB TO COM-SRB                                  00280000
002810         PERFORM INITIALIZE-DATE                                  00281000
002820         GO TO PANEL-ROUTER.                                      00282000
002830     PERFORM PANEL-NAME-SET.                                      00283000
002840     IF COM-HELPSW IS EQUAL TO 'Y'                                00284000
002850         GO TO HELP-RETURN.                                       00285000
002860     PERFORM PANEL-RECEIVE.                                       00286000
002870     PERFORM PANEL-DATA-GET.                                      00287000
002880     PERFORM PANEL-PFKEY-SET.                                     00288000
002890     PERFORM VALIDATE-PFKEYS.                                     00289000
002900     IF EIBAID IS EQUAL TO DFHPF1                                 00290000
002910         GO TO GET-HELP.                                          00291000
002920     IF EIBAID IS EQUAL TO DFHPF11                                00292000
002930         GO TO BREAK-AWAY.                                        00293000
002940     IF (COM-RETURN IS EQUAL TO 'E'                               00294000
002950         OR COM-RETURN IS EQUAL TO '1')                           00295000
002960         AND (EIBAID IS EQUAL TO DFHPF2                           00296000
002970         OR EIBAID IS EQUAL TO DFHPF3                             00297000
002980         OR EIBAID IS EQUAL TO DFHPF4                             00298000
002990         OR EIBAID IS EQUAL TO DFHPF7                             00299000
003000         OR EIBAID IS EQUAL TO DFHPF8                             00300000
003010         OR EIBAID IS EQUAL TO DFHPF12)                           00301000
003020         GO TO CLOSE-TRANSACTION.                                 00302000
003030     IF COM-RETURN IS EQUAL TO '0'                                00303000
003040         OR COM-RETURN IS EQUAL TO 'E'                            00304000
003050         OR COM-RETURN IS EQUAL TO '1'                            00305000
003060         GO TO PANEL-ROUTER.                                      00306000
003070 RR-END.                                                          00307000
003080     GO TO CLOSE-TRANSACTION.                                     00308000
003090 RR-EXIT.                                                         00309000
003100     EXIT.                                                        00310000
003110******************************************************************00311000
003120 INITIALIZE-DATE SECTION.                                         00312000
003130 ID-START.                                                        00313000
003140     MOVE COM-DATE TO WS-CURDATE8.                                00314000
003150     MOVE '-' TO WS-CD8DSH1.                                      00315000
003160     MOVE '-' TO WS-CD8DSH2.                                      00316000
003170     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00317000
003180 ID-EXIT.                                                         00318000
003190     EXIT.                                                        00319000
003200******************************************************************00320000
003210 PANEL-NAME-SET SECTION.                                          00321000
003220 PNS-START.                                                       00322000
003230     IF COM-RETURN IS EQUAL TO '0'                                00323000
003240         MOVE PDB-RPV140K-NAME TO PAN-NAME.                       00324000
003250     IF COM-RETURN IS EQUAL TO 'E'                                00325000
003260         MOVE PDB-RPV140K-NAME TO PAN-NAME.                       00326000
003270     IF COM-RETURN IS EQUAL TO '1'                                00327000
003280         MOVE PDB-RPV140-NAME TO PAN-NAME.                        00328000
003290 PNS-EXIT.                                                        00329000
003300     EXIT.                                                        00330000
003310******************************************************************00331000
003320 PANEL-DATA-GET SECTION.                                          00332000
003330 PDG-START.                                                       00333000
003340     IF COM-RETURN IS EQUAL TO '0'                                00334000
003350         PERFORM PANEL-GET-RPV140K.                               00335000
003360     IF COM-RETURN IS EQUAL TO 'E'                                00336000
003370         PERFORM PANEL-GET-RPV140K                                00337000
003380         MOVE RPV140K-COMMAND TO WS-NEXTKEY                       00338000
003390         MOVE PDB-RPV140K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00339000
003400     IF COM-RETURN IS EQUAL TO '1'                                00340000
003410         PERFORM PANEL-GET-RPV140                                 00341000
003420         MOVE RPV140-COMMAND TO WS-NEXTKEY                        00342000
003430         MOVE PDB-RPV140-COMMAND-DCHG TO WS-COMMAND-DCHG.         00343000
003440 PDG-EXIT.                                                        00344000
003450     EXIT.                                                        00345000
003460******************************************************************00346000
003470 PANEL-PFKEY-SET SECTION.                                         00347000
003480 PPS-START.                                                       00348000
003490 PPS-EXIT.                                                        00349000
003500     EXIT.                                                        00350000
003510******************************************************************00351000
003520 PANEL-ROUTER SECTION.                                            00352000
003530 PR-START.                                                        00353000
003540     IF COM-RETURN IS EQUAL TO '0'                                00354000
003550         GO TO PROCESS-KEY-PANEL.                                 00355000
003560     IF COM-RETURN IS EQUAL TO 'E'                                00356000
003570         GO TO PROCESS-KEY-PANEL.                                 00357000
003580     IF COM-RETURN IS EQUAL TO '1'                                00358000
003590         GO TO PROCESS-INFO-PANEL.                                00359000
003600     GO TO CLOSE-TRANSACTION.                                     00360000
003610 PR-EXIT.                                                         00361000
003620     EXIT.                                                        00362000
003630******************************************************************00363000
003640 HELP-RETURN SECTION.                                             00364000
000000 COPY SRP074.                                                     00365000
003660******************************************************************00366000
003670 HELP-RETURN-FINISH SECTION.                                      00367000
003680 HRF-START.                                                       00368000
003690     PERFORM PANEL-DATA-GET.                                      00369000
003700     MOVE 'H' TO COM-FROM-PANEL.                                  00370000
003710     GO TO PANEL-ROUTER.                                          00371000
003720 HRF-EXIT.                                                        00372000
003730     EXIT.                                                        00373000
003740******************************************************************00374000
003750 HELP-MISSING-FINISH SECTION.                                     00375000
003760 HMF-START.                                                       00376000
003770     MOVE 'H' TO COM-FROM-PANEL.                                  00377000
003780     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00378000
003790     GO TO PANEL-ROUTER.                                          00379000
003800 HMF-EXIT.                                                        00380000
003810     EXIT.                                                        00381000
003820******************************************************************00382000
003830 BREAK-AWAY SECTION.                                              00383000
000000 COPY SRP0752.                                                    00384000
003850******************************************************************00385000
003860 BREAKAWAY-RETURN-FINISH SECTION.                                 00386000
003870 BRF-START.                                                       00387000
003880     PERFORM PANEL-DATA-GET.                                      00388000
003890     MOVE 'B' TO COM-FROM-PANEL.                                  00389000
003900     GO TO PANEL-ROUTER.                                          00390000
003910 BRF-EXIT.                                                        00391000
003920     EXIT.                                                        00392000
003930******************************************************************00393000
003940 PROCESS-KEY-PANEL SECTION.                                       00394000
003950 PKP-START.                                                       00395000
003960     IF INITIAL-PANEL                                             00396000
003970         MOVE COM-NEXTKEY TO COM-EXTERNALID                       00397000
003980         GO TO PKP-COM-INIT.                                      00398000
003990     IF EDIT-PANEL                                                00399000
004000         AND FROM-INFO-PANEL                                      00400000
004010         MOVE SPACE TO COM-FROM-PANEL                             00401000
004020         GO TO PKP-RELOAD-PANEL.                                  00402000
004030 PKP-COM-INIT.                                                    00403000
004040     MOVE COM-NEXTKEY TO SR-PSLIST.                               00404000
004050     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00405000
004060         GO TO PKP-SEND-PANEL.                                    00406000
004070 PKP-BEGIN-EDITS.                                                 00407000
004080     MOVE RPV140K-PRODCD TO RPW014-PRODCODE.                      00408000
004090     MOVE RPV140K-ACCOUNT TO RPW014-ACCT.                         00409000
004100     PERFORM EDIT-ACCOUNT-KEY.                                    00410000
004110     IF EDIT-PANEL                                                00411000
004120         GO TO PKP-RETURN-EDITS.                                  00412000
004130 PKP-RETURN-EDITS.                                                00413000
004140     MOVE RPW014-PRODCODE TO COM-PRODCODE.                        00414000
004150     MOVE RPW014-APPLNBR TO COM-APPL.                             00415000
004160     MOVE RPW014-DIALOGROUT TO COM-DIALOGROUT.                    00416000
004170     MOVE RPW014-PRODCODE TO COM-KEY-PRODCODE.                    00417000
004180     MOVE RPW014-ACCT TO COM-KEY-ACCOUNT.                         00418000
004190     MOVE RPW014-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          00419000
004200     IF COM-KEY-SDATE IS NOT NUMERIC                              00420000
004210         MOVE ZEROS TO COM-KEY-SDATE.                             00421000
004220     IF INITIAL-PANEL                                             00422000
004230         AND RPW014-PRODCODE IS EQUAL TO LOW-VALUES               00423000
004240         AND RPW014-ACCT IS EQUAL TO LOW-VALUES                   00424000
004250         MOVE '000001' TO WS-MSGNBR                               00425000
004260         GO TO PKP-SEND-PANEL.                                    00426000
004270     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00427000
004280     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00428000
004290     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00429000
004300         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00430000
004310     ELSE                                                         00431000
004320         MOVE ZERO TO COM-ACCOUNT.                                00432000
004330     MOVE RPV140K-EVTDATE TO WS-RAWDATE.                          00433000
004340     MOVE ZERO TO WS-BEGDATE.                                     00434000
004350     IF RPV140K-EVTDATE IS NOT EQUAL TO SPACES                    00435000
004360         AND RPV140K-EVTDATE IS NOT EQUAL TO LOW-VALUE            00436000
004370         MOVE RPV140K-EVTDATE TO SR-CODASYL-EDITED                00437000
004380         MOVE '-' TO SR-CDDELIM                                   00438000
004390         MOVE '3' TO SR-CDSEQ                                     00439000
004400         PERFORM DEEDIT-CODASYL-DATE                              00440000
004410         IF SR-CDERROR IS NOT EQUAL TO SPACE                      00441000
004420             MOVE PDB-RPV140K-EVTDATE TO PAN-SET-FLD              00442000
004430             PERFORM CALL-BISPAN-RPV140K                          00443000
004440             MOVE 'Y' TO WS-ERR-DATE                              00444000
004450             MOVE 000002 TO WS-MSGNBR                             00445000
004460             MOVE ZERO TO WS-BEGDATE                              00446000
004470             END-IF                                               00447000
004480         MOVE SR-CODASYL TO WS-START-DATE                         00448000
004490         MOVE WS-START-DATE TO WS-BEGDATE.                        00449000
004500     MOVE WS-BEGDATE TO RPEVT01-KEY-SDATE.                        00450000
004510     MOVE WS-BEGDATE TO COM-KEY-SDATE.                            00451000
004520*                                                                 00452000
004530     IF FROM-BREAKAWAY                                            00453000
004540         OR FROM-HELP                                             00454000
004550         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00455000
004560         GO TO PKP-RELOAD-PANEL.                                  00456000
004570 PKP-EDITS-READY.                                                 00457000
004580     MOVE SPACE TO COM-PANEL-ACTION.                              00458000
004590     MOVE '1' TO COM-RETURN.                                      00459000
004600     MOVE 'K' TO COM-FROM-PANEL.                                  00460000
004610     GO TO PANEL-ROUTER.                                          00461000
004620 PKP-RELOAD-PANEL.                                                00462000
004630     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00463000
004640         MOVE LOW-VALUES TO RPV140K-PRODCD                        00464000
004650     ELSE                                                         00465000
004660         MOVE COM-KEY-PRODCODE TO RPV140K-PRODCD.                 00466000
004670     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00467000
004680         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROES                    00468000
004690         MOVE LOW-VALUES TO RPV140K-ACCOUNT                       00469000
004700     ELSE                                                         00470000
004710         MOVE COM-KEY-ACCOUNT TO RPV140K-ACCOUNT.                 00471000
004720 PKP-SEND-PANEL.                                                  00472000
004730     MOVE PDB-RPV140K-NAME TO PAN-NAME.                           00473000
004740     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00474000
004750     IF FROM-BREAKAWAY                                            00475000
004760         OR FROM-HELP                                             00476000
004770         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00477000
004780     ELSE                                                         00478000
004790         MOVE PDB-RPV140K-PRODCD TO PAN-SET-FLD.                  00479000
004800     PERFORM CALL-BISPAN-RPV140K.                                 00480000
004810     MOVE COM-OPERID TO RPV140K-OPERID.                           00481000
004820     MOVE COM-INST TO RPV140K-INST.                               00482000
004830     MOVE COM-EDIT-DATE TO RPV140K-SYSDATE.                       00483000
004840     IF RPV140K-PRODCD IS EQUAL TO SPACES                         00484000
004850         MOVE LOW-VALUES TO RPV140K-PRODCD.                       00485000
004860     MOVE RPV140K-ACCOUNT TO SR-JUSTIFYIN.                        00486000
004870     MOVE +18 TO SR-JLGTH.                                        00487000
004880     PERFORM LEFT-JUSTIFY.                                        00488000
004890     MOVE SR-JUSTIFYOUT TO RPV140K-ACCOUNT.                       00489000
004900     IF RPV140K-ACCOUNT IS EQUAL TO SPACES                        00490000
004910         MOVE LOW-VALUES TO RPV140K-ACCOUNT.                      00491000
004920     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00492000
004930         MOVE WS-HELPMSG TO WS-MSGNBR.                            00493000
004940     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00494000
004950         MOVE '000027' TO WS-MSGNBR                               00495000
004960     ELSE                                                         00496000
004970         PERFORM BUILD-NEXTKEY                                    00497000
004980         PERFORM COMPRESS-NEXTKEY                                 00498000
004990         MOVE WS-NEXTKEY TO RPV140K-COMMAND.                      00499000
005000     IF FROM-BREAKAWAY                                            00500000
005010         OR FROM-HELP                                             00501000
005020         MOVE SPACE TO COM-FROM-PANEL                             00502000
005030         MOVE COM-KEY-COMMAND TO RPV140K-COMMAND                  00503000
005040         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00504000
005050     ELSE                                                         00505000
005060         MOVE WS-NEXTKEY TO COM-KEY-COMMAND                       00506000
005070         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00507000
005080     MOVE 'E' TO COM-RETURN.                                      00508000
005090     PERFORM GET-MESSAGE.                                         00509000
005100     MOVE WS-MESSAGE TO RPV140K-MSGLINE.                          00510000
005110     PERFORM PANEL-PFKEY-SET.                                     00511000
005120     PERFORM BUILD-PFKEY-LINE.                                    00512000
005130     MOVE WS-PFLINE1 TO RPV140K-PFLINE1.                          00513000
005140     MOVE WS-PFLINE2 TO RPV140K-PFLINE2.                          00514000
005150     PERFORM PANEL-PUT-RPV140K.                                   00515000
005160     PERFORM PANEL-SEND.                                          00516000
005170     MOVE 'E' TO COM-PANEL-ACTION.                                00517000
005180     MOVE COM-INTID TO WS-TRANSID.                                00518000
005190     GO TO CICS-RETURN-TRANSID.                                   00519000
005200 PKP-EXIT.                                                        00520000
005210     EXIT.                                                        00521000
005220******************************************************************00522000
005230 PROCESS-INFO-PANEL SECTION.                                      00523000
005240 PIP-START.                                                       00524000
005250     IF FROM-HELP                                                 00525000
005260         OR FROM-BREAKAWAY                                        00526000
005270         GO TO PIP-SEND-PANEL.                                    00527000
005280     IF INITIAL-PANEL                                             00528000
005290         MOVE +1 TO RPEVT01-PAGES-TO-READ                         00529000
005300         MOVE +0 TO COM-RPEVT01-CURPAGE                           00530000
005310         MOVE SPACES TO COM-FIRST-KEY                             00531000
005320         MOVE COM-RPEVT01-CURPAGE TO RPEVT01-CURPAGE              00532000
005330         GO TO PIP-CONTINUE.                                      00533000
005340 PIP-PFKEYS.                                                      00534000
005350     MOVE SPACES TO RPEVT01-REQUEST.                              00535000
005360     MOVE ALL ZEROS TO WS-MSGNBR.                                 00536000
005370     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00537000
005380         GO TO PIP-SEND-PANEL.                                    00538000
005390     IF EIBAID IS EQUAL TO DFHENTER                               00539000
005400         AND COM-PF8END IS EQUAL TO 'Y'                           00540000
005410         MOVE 'Y' TO WS-PFKEYERR                                  00541000
005420         GO TO PIP-SEND-PANEL.                                    00542000
005430     IF EIBAID IS EQUAL TO DFHPF2                                 00543000
005440         AND COM-RPEVT01-CURPAGE IS GREATER THAN +1               00544000
005450         MOVE +0 TO COM-RPEVT01-CURPAGE                           00545000
005460         MOVE COM-RPEVT01-CURPAGE TO RPEVT01-CURPAGE              00546000
005470         MOVE +1 TO RPEVT01-PAGES-TO-READ                         00547000
005480         MOVE SPACES TO COM-FIRST-KEY                             00548000
005490         MOVE SPACES TO RPEVT01-KEY-ACCT2-GRP                     00549000
005500         GO TO PIP-CONTINUE.                                      00550000
005510     IF EIBAID IS EQUAL TO DFHPF7                                 00551000
005520         AND COM-RPEVT01-CURPAGE IS GREATER THAN +1               00552000
005530         SUBTRACT +1 FROM COM-RPEVT01-CURPAGE                     00553000
005540         MOVE COM-RPEVT01-CURPAGE TO RPEVT01-CURPAGE              00554000
005550         MOVE RPEVT01-CURPAGE TO RPEVT01-PAGES-TO-READ            00555000
005560         MOVE COM-FIRST-KEY TO RPEVT01-GRP-KEY                    00556000
005570         MOVE 'PF7' TO RPEVT01-REQUEST                            00557000
005580         GO TO PIP-CONTINUE.                                      00558000
005590* * ****************************************************          00559000
005600*    IF EIBAID IS EQUAL TO DFHENTER                               00560000
005610*        AND COM-OCCUR IS LESS THAN +02                           00561000
005620*        AND NOT FROM-BREAKAWAY                                   00562000
005630*        MOVE 'X' TO COM-RETURN                                   00563000
005640*        GO TO PANEL-ROUTER.                                      00564000
005650* * ****************************************************          00565000
005660     IF EIBAID IS EQUAL TO DFHPF8                                 00566000
005670         OR EIBAID IS EQUAL TO DFHENTER                           00567000
005680         MOVE COM-RPEVT01-CURPAGE TO RPEVT01-CURPAGE              00568000
005690         MOVE +1 TO RPEVT01-PAGES-TO-READ                         00569000
005700         MOVE COM-LAST-KEY TO RPEVT01-GRP-KEY                     00570000
005710         MOVE 'PF8' TO RPEVT01-REQUEST                            00571000
005720         GO TO PIP-CONTINUE.                                      00572000
005730 PIP-CONTINUE.                                                    00573000
005740     PERFORM RPEVT01-LINK-MESSAGE.                                00574000
005750 PIP-RPEVT01-RETURN-CHECK.                                        00575000
005760     IF RPEVT01-SELECT-RTN IS EQUAL TO '1'                        00576000
005770         AND WS-MSGNBR IS GREATER THAN ZEROS                      00577000
005780         AND RPEVT01-PF7END IS EQUAL TO 'Y'                       00578000
005790         GO TO PIP-PAGING-CONTROLS.                               00579000
005800     IF RPEVT01-SELECT-RTN IS EQUAL TO '1'                        00580000
005810         AND WS-MSGNBR IS GREATER THAN ZEROS                      00581000
005820         AND RPEVT01-PF8END IS EQUAL TO 'Y'                       00582000
005830         GO TO PIP-PAGING-CONTROLS.                               00583000
005840     IF RPEVT01-SELECT-RTN IS EQUAL TO '1'                        00584000
005850         AND WS-MSGNBR IS GREATER THAN ZEROS                      00585000
005860         MOVE 'E' TO COM-RETURN                                   00586000
005870         MOVE 'E' TO COM-PANEL-ACTION                             00587000
005880         MOVE 'I' TO COM-FROM-PANEL                               00588000
005890         GO TO PANEL-ROUTER.                                      00589000
005900     IF RPEVT01-RETURN IS EQUAL TO 'E'                            00590000
005910         AND FROM-KEY-PANEL                                       00591000
005920         AND INITIAL-PANEL                                        00592000
005930         MOVE RPEVT01-MSGNBR TO WS-MSGNBR                         00593000
005940         MOVE 'E' TO COM-RETURN                                   00594000
005950         MOVE 'E' TO COM-PANEL-ACTION                             00595000
005960         MOVE 'I' TO COM-FROM-PANEL                               00596000
005970         GO TO PANEL-ROUTER.                                      00597000
005980 PIP-PAGING-CONTROLS.                                             00598000
005990     IF COM-FIRST-KEY IS EQUAL TO SPACES                          00599000
006000         MOVE RPEVT01-GRP-KEY TO COM-FIRST-KEY.                   00600000
006010     MOVE RPEVT01-CUST-TYPE TO COM-CUST-TYPE.                     00601000
006020     MOVE RPEVT01-CUST-NAME TO COM-CUST-NAME.                     00602000
006030     MOVE RPEVT01-GRP-KEY TO COM-LAST-KEY.                        00603000
006040     MOVE RPEVT01-CURPAGE TO COM-RPEVT01-CURPAGE.                 00604000
006050     MOVE RPEVT01-OCCUR TO COM-OCCUR.                             00605000
006060     PERFORM EDIT-INFO-PANEL.                                     00606000
006070 PIP-SEND-PANEL.                                                  00607000
006080     IF (FROM-HELP                                                00608000
006090         OR FROM-BREAKAWAY)                                       00609000
006100         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00610000
006110         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00611000
006120     ELSE                                                         00612000
006130         MOVE PDB-RPV140-COMMAND TO PAN-SET-FLD.                  00613000
006140     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00614000
006150     PERFORM CALL-BISPAN-RPV140.                                  00615000
006160     MOVE COM-INST TO RPV140-INST.                                00616000
006170     MOVE COM-OPERID TO RPV140-OPERID.                            00617000
006180     MOVE COM-EDIT-DATE TO RPV140-SYSDATE.                        00618000
006190     MOVE COM-CUST-NAME TO RPV140-CUSTNA.                         00619000
006200     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00620000
006210         MOVE WS-HELPMSG TO WS-MSGNBR.                            00621000
006220     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00622000
006230         MOVE '000027' TO WS-MSGNBR                               00623000
006240     ELSE                                                         00624000
006250         PERFORM BUILD-NEXTKEY                                    00625000
006260         PERFORM COMPRESS-NEXTKEY                                 00626000
006270         MOVE WS-NEXTKEY TO RPV140-COMMAND.                       00627000
006280     IF FROM-HELP                                                 00628000
006290         OR FROM-BREAKAWAY                                        00629000
006300         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00630000
006310         MOVE COM-KEY-COMMAND TO RPV140-COMMAND                   00631000
006320         MOVE SPACE TO COM-FROM-PANEL                             00632000
006330     ELSE                                                         00633000
006340         MOVE RPV140-COMMAND TO COM-KEY-COMMAND                   00634000
006350         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00635000
006360     PERFORM PANEL-PFKEY-SET.                                     00636000
006370     MOVE SPACES TO RPV140-MORE.                                  00637000
006380     MOVE 'E' TO COM-END.                                         00638000
006390     IF (COM-OCCUR IS GREATER THAN ZERO                           00639000
006400         AND COM-PF8END IS NOT EQUAL TO 'Y')                      00640000
006410         MOVE WS-MORE TO RPV140-MORE                              00641000
006420         MOVE '+' TO RPV140-PLUS                                  00642000
006430         MOVE 'F' TO COM-END                                      00643000
006440     ELSE                                                         00644000
006450         MOVE 'N' TO WS-PF8-FLG                                   00645000
006460         MOVE SPACE TO RPV140-PLUS.                               00646000
006470     IF COM-RPEVT01-CURPAGE IS GREATER THAN +1                    00647000
006480         MOVE WS-MORE TO RPV140-MORE                              00648000
006490         MOVE '-' TO RPV140-MINUS                                 00649000
006500         MOVE 'P' TO COM-END                                      00650000
006510     ELSE                                                         00651000
006520         MOVE 'N' TO WS-PF7-FLG                                   00652000
006530         MOVE SPACE TO RPV140-MINUS.                              00653000
006540     IF COM-OCCUR IS GREATER THAN +0                              00654000
006550         AND COM-RPEVT01-CURPAGE IS GREATER THAN +1               00655000
006560         AND COM-PF8END IS NOT EQUAL TO 'Y'                       00656000
006570         MOVE 'B' TO COM-END.                                     00657000
006580* **                                                              00658000
006590     IF COM-MORE IS EQUAL TO 'Y'                                  00659000
006600         AND COM-RPEVT01-CURPAGE IS GREATER THAN +1               00660000
006610         MOVE 'B' TO COM-END.                                     00661000
006620     IF COM-WKUCOUNT IS GREATER THAN ZERO                         00662000
006630         AND COM-WKUPOSITION IS GREATER THAN +1                   00663000
006640         AND COM-END IS NOT EQUAL TO 'P'                          00664000
006650         MOVE 'A' TO WS-PF7-FLG.                                  00665000
006660     IF COM-WKUCOUNT IS GREATER THAN ZERO                         00666000
006670         AND COM-WKUPOSITION IS LESS THAN COM-WKUCOUNT            00667000
006680         AND COM-END IS NOT EQUAL TO 'F'                          00668000
006690         MOVE 'A' TO WS-PF8-FLG.                                  00669000
006700* **                                                              00670000
006710 PIP-COMPLETE-SEND.                                               00671000
006720     PERFORM BUILD-PFKEY-LINE.                                    00672000
006730     MOVE WS-PFLINE1 TO RPV140-PFLINE1.                           00673000
006740     MOVE WS-PFLINE2 TO RPV140-PFLINE2.                           00674000
006750* ** ******************************************************       00675000
006760*    IF COM-PF7END IS EQUAL TO 'Y'                                00676000
006770*        MOVE ZERO TO WS-MSGNBR                                   00677000
006780*        MOVE SPACES TO WS-MESSAGE                                00678000
006790*        GO TO PIP-COMPLETE-SENDA.                                00679000
006800*    IF COM-PF8END IS EQUAL TO 'Y'                                00680000
006810*        MOVE ZERO TO WS-MSGNBR                                   00681000
006820*        MOVE SPACES TO WS-MESSAGE                                00682000
006830*        GO TO PIP-COMPLETE-SENDA.                                00683000
006840* ** ******************************************************       00684000
006850     PERFORM GET-MESSAGE.                                         00685000
006860 PIP-COMPLETE-SENDA.                                              00686000
006870     MOVE WS-MESSAGE TO RPV140-MSGLINE.                           00687000
006880     PERFORM PANEL-PUT-RPV140.                                    00688000
006890     PERFORM PANEL-SEND.                                          00689000
006900     MOVE '1' TO COM-RETURN.                                      00690000
006910     MOVE 'I' TO COM-FROM-PANEL.                                  00691000
006920     MOVE 'E' TO COM-PANEL-ACTION.                                00692000
006930     MOVE COM-INTID TO WS-TRANSID.                                00693000
006940     GO TO CICS-RETURN-TRANSID.                                   00694000
006950 PIP-EXIT.                                                        00695000
006960     EXIT.                                                        00696000
006970******************************************************************00697000
006980 EDIT-INFO-PANEL SECTION.                                         00698000
006990 EIP-START.                                                       00699000
007000     MOVE COM-KEY-ACCOUNT TO RPV140-ACCOUNT.                      00700000
007010     MOVE COM-KEY-PRODCODE TO RPV140-PRODCD.                      00701000
007020     MOVE RPEVT01-CUST-NAME TO RPV140-CUSTNA.                     00702000
007030* *  MOVE RPEVT01 TO RPV140.                                      00703000
007040     MOVE RPEVT01-EVENT-DATE TO RPV140-EVTDATE.                   00704000
007050     MOVE RPEVT01-EVENTEXP TO RPV140-EVENT.                       00705000
007060     MOVE RPEVT01-MODULEEXP TO RPV140-MODULE.                     00706000
007070     MOVE RPEVT01-INST2 TO RPV140-INST1.                          00707000
007080     MOVE RPEVT01-PRODCODE2 TO RPV140-PRODCD1.                    00708000
007090     MOVE RPEVT01-ACCOUNT2 TO RPV140-ACCOUNT1.                    00709000
007100     MOVE RPEVT01-MODEL2 TO RPV140-MODEL1.                        00710000
007110     MOVE RPEVT01-MODEL-DESC TO RPV140-MODLTY.                    00711000
007120     MOVE RPEVT01-MESSAGEEXP TO RPV140-MESSDES.                   00712000
007130     MOVE RPEVT01-IDNUMBER TO RPV140-IDNBR.                       00713000
007140*****************************************************             00714000
007150     IF WS-DISPALL IS EQUAL TO 'Y'                                00715000
007160         MOVE RPEVT01-SC-INC-OPTION TO RPV140-SVCCHGI             00716000
007170         MOVE RPEVT01-DISCOUNT-AMOUNT TO WS-AMT9                  00717000
007180         MOVE WS-AMT9X TO RPV140-SVCAMT                           00718000
007190         MOVE RPEVT01-DISCOUNT-PERCENT TO WS-RAT95                00719000
007200         MOVE WS-RAT95X TO RPV140-SVCPCT                          00720000
007210         MOVE RPEVT01-RATE-INC-OPTION TO RPV140-RATCHGI           00721000
007220         MOVE RPEVT01-RATE-PERCENT TO WS-RAT99                    00722000
007230         MOVE WS-RAT99X TO RPV140-RATPCT                          00723000
007240         MOVE RPEVT01-RATE-OPTION TO RPV140-RATOPT                00724000
007250         MOVE RPEVT01-RATE-TYPE TO RPV140-RATTYP                  00725000
P0173          GO TO EIP-EXIT.                                          00726000
P0173      IF WS-DISPALL IS EQUAL TO 'R'                                00726390
P0173          MOVE RPEVT01-RATE-INC-OPTION TO RPV140-RATCHGI           00726780
P0173          MOVE RPEVT01-RATE-PERCENT TO WS-RAT99                    00727170
P0173          MOVE WS-RAT99X TO RPV140-RATPCT                          00727560
P0173          MOVE RPEVT01-RATE-OPTION TO RPV140-RATOPT                00727950
P0173          MOVE RPEVT01-RATE-TYPE TO RPV140-RATTYP                  00728340
P0173          MOVE SPACES TO RPV140-SVCCHGI                            00728730
P0173          MOVE SPACES TO RPV140-SVCAMT                             00729120
P0173          MOVE SPACES TO RPV140-SVCPCT                             00729510
P0173          GO TO EIP-EXIT.                                          00729900
P0173      MOVE SPACES TO RPV140-SVCCHGI.                               00730290
P0173      MOVE SPACES TO RPV140-SVCAMT.                                00730680
P0173      MOVE SPACES TO RPV140-SVCPCT.                                00731070
P0173      MOVE SPACES TO RPV140-RATCHGI.                               00731460
P0173      MOVE SPACES TO RPV140-RATPCT.                                00731850
P0173      MOVE SPACES TO RPV140-RATOPT.                                00732240
P0173      MOVE SPACES TO RPV140-RATTYP.                                00732630
007340*****************************************************             00734000
007350 EIP-EXIT.                                                        00735000
007360     EXIT.                                                        00736000
007370******************************************************************00737000
007380 MORE-DATA-PANELS SECTION.                                        00738000
007390 MDP-START.                                                       00739000
007400     GO TO PANEL-ROUTER.                                          00740000
007410 MDP-EXIT.                                                        00741000
007420     EXIT.                                                        00742000
007430******************************************************************00743000
007440 CLOSE-TRANSACTION SECTION.                                       00744000
000000 COPY SRP0722.                                                    00745000
007460******************************************************************00746000
007470 PANEL-INIT SECTION.                                              00747000
000000 COPY SRP073.                                                     00748000
007490******************************************************************00749000
007500 TESTKEY-DATE SECTION.                                            00750000
007510 TKD-EXIT.                                                        00751000
007520     EXIT.                                                        00752000
007530******************************************************************00753000
007540 BUILD-NEXTKEY SECTION.                                           00754000
007550 BXN-START.                                                       00755000
007560     MOVE SPACES TO WS-NEXTKEY.                                   00756000
007570     MOVE ',' TO WS-DELIM1.                                       00757000
007580     MOVE ',' TO WS-DELIM2.                                       00758000
007590     MOVE ',' TO WS-DELIM3.                                       00759000
007600     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00760000
007610     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00761000
007620         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00762000
007630     ELSE                                                         00763000
007640         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00764000
007650     MOVE COM-KEY-SDATE TO WS-SDATE.                              00765000
007660     MOVE COM-EXTERNALID TO WS-EXTID.                             00766000
007670 BXN-EXIT.                                                        00767000
007680     EXIT.                                                        00768000
007690******************************************************************00769000
007700 ABORT-EXIT SECTION.                                              00770000
007710 AE-START.                                                        00771000
007720     MOVE EIBFN TO COM-ABEIBFN.                                   00772000
007730     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00773000
007740     GO TO CICS-ABORT-EXIT.                                       00774000
007750 AE-EXIT.                                                         00775000
007760     EXIT.                                                        00776000
007770******************************************************************00777000
007780 RPEVT01-LINK-MESSAGE SECTION.                                    00778000
007790 RPLM-START.                                                      00779000
007800     MOVE 'Y' TO RPEVT01-GLOBAL-CLOSE.                            00780000
007810     MOVE 'VKL' TO RPEVT01-APIFUNC.                               00781000
007820     MOVE WS-FILEOPTIONS TO RPEVT01-FILEOPTS.                     00782000
007830     MOVE COM-RETURN TO RPEVT01-RETURN.                           00783000
007840     MOVE COM-MODELID TO RPEVT01-MODELID.                         00784000
007850     MOVE COM-SECALT TO RPEVT01-SECALT.                           00785000
007860     MOVE COM-OPERID TO RPEVT01-OPERID.                           00786000
007870     MOVE COM-DATE TO RPEVT01-DATE.                               00787000
007880     MOVE COM-PF7END to RPEVT01-PF7END.                           00788000
007890     MOVE COM-PF8END to RPEVT01-PF8END.                           00789000
007900     MOVE COM-EXTERNALID TO RPEVT01-EXTERNALID.                   00790000
007910     MOVE COM-INST TO RPEVT01-KEY-INST.                           00791000
007920     MOVE COM-PRODCODE TO RPEVT01-KEY-PRODCODE.                   00792000
007930     MOVE COM-ACCOUNT TO RPEVT01-KEY-ACCOUNT.                     00793000
007940     IF COM-KEY-SDATE IS NOT NUMERIC                              00794000
007950         MOVE ZEROS TO RPEVT01-KEY-SDATE.                         00795000
007960     MOVE COM-KEY-SDATE TO RPEVT01-KEY-SDATE.                     00796000
007970     MOVE COM-PREV-KEY TO RPEVT01-PREV-KEY.                       00797000
007980     MOVE COM-LAST-KEY TO RPEVT01-THIS-KEY.                       00798000
007990     IF COM-OCCUR IS NOT NUMERIC                                  00799000
008000         MOVE ZERO TO COM-OCCUR.                                  00800000
008010     MOVE COM-OCCUR TO RPEVT01-OCCUR.                             00801000
008020     IF COM-RPEVT01-CURPAGE IS NOT NUMERIC                        00802000
008030         MOVE ZERO TO COM-RPEVT01-CURPAGE.                        00803000
008040     MOVE COM-RPEVT01-CURPAGE TO RPEVT01-CURPAGE.                 00804000
008050     IF COM-CUST-TYPE IS NOT EQUAL TO 'R'                         00805000
008060         AND COM-CUST-TYPE IS NOT EQUAL TO 'C'                    00806000
008070         MOVE SPACES TO COM-CUST-TYPE                             00807000
008080         MOVE SPACES TO COM-CUST-NAME.                            00808000
008090     MOVE COM-CUST-TYPE TO RPEVT01-CUST-TYPE.                     00809000
008100     MOVE COM-CUST-NAME TO RPEVT01-CUST-NAME.                     00810000
008110     MOVE COM-LANG TO RPEVT01-COM-LANG.                           00811000
008120     MOVE COM-CURN-CODE TO RPEVT01-COM-CURNCD.                    00812000
008130     MOVE COM-INST-OPTS TO RPEVT01-INST-OPTS.                     00813000
008140     EXEC CICS LINK                                               00814000
008150         PROGRAM('RPLEVT01')                                      00815000
008160         COMMAREA(RPEVT01-MESSAGE)                                00816000
008170         LENGTH(LENGTH OF RPEVT01-MESSAGE)                        00817000
008180         RESP(WS-CICS-RESPONSE)                                   00818000
008190         END-EXEC.                                                00819000
008200* RETURN                                                          00820000
008210     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00821000
008220         MOVE 'RPLEVT01 LINK FAILED' TO COM-ABMSG                 00822000
008230         MOVE WS-TR0003 TO COM-ABTRACE                            00823000
008240         MOVE WS-AB0009 TO COM-ABORT                              00824000
008250         GO TO CICS-ABORT-EXIT.                                   00825000
008260     MOVE RPEVT01-FUNCTION TO WS-FUNCTION.                        00826000
008270     IF RPEVT01-ABORT IS NOT EQUAL TO ZERO                        00827000
008280         MOVE RPEVT01-ABORT TO COM-ABORT                          00828000
008290         MOVE RPEVT01-ABTRACE TO COM-ABTRACE                      00829000
008300         MOVE RPEVT01-ABEIBFN TO COM-ABEIBFN                      00830000
008310         MOVE RPEVT01-ABEIBRCODE TO COM-ABEIBRCODE                00831000
008320         MOVE RPEVT01-ABPROGID TO COM-ABPROGID                    00832000
008330         MOVE RPEVT01-SRBMDB TO COM-SRBMDB                        00833000
008340         MOVE RPEVT01-ABTYPE TO COM-ABTYPE                        00834000
008350         GO TO CICS-ABORT-EXIT.                                   00835000
008360     MOVE RPEVT01-PF7END TO COM-PF7END.                           00836000
008370     MOVE RPEVT01-PF8END TO COM-PF8END.                           00837000
008380     MOVE RPEVT01-ABORT TO COM-ABORT.                             00838000
008390     MOVE RPEVT01-MSGNBR TO WS-MSGNBR.                            00839000
008400     MOVE RPEVT01-OCCUR TO COM-OCCUR.                             00840000
008410     MOVE RPEVT01-CURPAGE TO COM-RPEVT01-CURPAGE.                 00841000
008420     MOVE RPEVT01-THIS-KEY TO COM-LAST-KEY.                       00842000
008430     MOVE RPEVT01-PREV-KEY TO COM-PREV-KEY.                       00843000
008440     MOVE COM-LAST-KEY to RPEVT01-GRP-KEY.                        00844000
008450     MOVE 'N' TO WS-DISPALL.                                      00845000
008460     MOVE SPACES TO RPV140-SCHGLIT.                               00846000
008470     MOVE SPACES TO RPV140-SCHGL01.                               00847000
008480     MOVE SPACES TO RPV140-SCHGL02.                               00848000
008490     MOVE SPACES TO RPV140-SCHGL03.                               00849000
008500     MOVE SPACES TO RPV140-RATELIT.                               00850000
008510     MOVE SPACES TO RPV140-RATEL01.                               00851000
008520     MOVE SPACES TO RPV140-RATEL02.                               00852000
008530     MOVE SPACES TO RPV140-RATEL03.                               00853000
008540     MOVE SPACES TO RPV140-RATEL04.                               00854000
008550     IF RPEVT01-EVENT-CODE IS EQUAL TO '04'                       00855000
008560         AND RPEVT01-UPD-USER IS EQUAL TO 'RPD200  '              00856000
008570         MOVE 'Y' TO WS-DISPALL                                   00857000
008580         MOVE WS-SCHGLIT TO RPV140-SCHGLIT                        00858000
008590         MOVE WS-SCLIT01 TO RPV140-SCHGL01                        00859000
008600         MOVE WS-SCLIT02 TO RPV140-SCHGL02                        00860000
008610         MOVE WS-SCLIT03 TO RPV140-SCHGL03                        00861000
008620         MOVE WS-RATELIT TO RPV140-RATELIT                        00862000
008630         MOVE WS-RTLIT01 TO RPV140-RATEL01                        00863000
008640         MOVE WS-RTLIT02 TO RPV140-RATEL02                        00864000
008650         MOVE WS-RTLIT03 TO RPV140-RATEL03                        00865000
P0173          MOVE WS-RTLIT04 TO RPV140-RATEL04                        00866000
P0173          go to RPLM-EXIT.                                         00866080
P0173      IF RPEVT01-EVENT-CODE IS EQUAL TO '09'                       00866160
P0173          AND RPEVT01-UPD-USER IS EQUAL TO 'RPR205  '              00866240
P0173          MOVE 'R' TO WS-DISPALL                                   00866320
P0173          MOVE WS-RATELIT TO RPV140-RATELIT                        00866400
P0173          MOVE WS-RTLIT01 TO RPV140-RATEL01                        00866480
P0173          MOVE WS-RTLIT02 TO RPV140-RATEL02                        00866560
P0173          MOVE WS-RTLIT03 TO RPV140-RATEL03                        00866640
P0173          MOVE WS-RTLIT04 TO RPV140-RATEL04.                       00866720
008670 RPLM-EXIT.                                                       00867000
008680     EXIT.                                                        00868000
008690******************************************************************00869000
008700 CLOSE-PANEL SECTION.                                             00870000
008710 CP-START.                                                        00871000
008720     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00872000
008730     IF COM-RETURN IS EQUAL TO 'E'                                00873000
008740         PERFORM CALL-BISPAN-RPV140K.                             00874000
008750     IF COM-RETURN IS EQUAL TO '1'                                00875000
008760         PERFORM CALL-BISPAN-RPV140.                              00876000
008770 CP-EXIT.                                                         00877000
008780     EXIT.                                                        00878000
008790******************************************************************00879000
008800 CALL-BISPAN-RPV140K SECTION.                                     00880000
008810 CBD1-START.                                                      00881000
008820     CALL 'BISPAN' USING                                          00882000
008830         BICRPSB,                                                 00883000
008840         BICRSRB,                                                 00884000
008850         BICRPAN,                                                 00885000
008860         RPV140K-PANL-DATA-BLOCK,                                 00886000
008870         RPV140K-PANL-DATA-AREA.                                  00887000
008880 CBD1-EXIT.                                                       00888000
008890     EXIT.                                                        00889000
008900******************************************************************00890000
008910 CALL-BISPAN-RPV140 SECTION.                                      00891000
008920 CBD2-START.                                                      00892000
008930     CALL 'BISPAN' USING                                          00893000
008940         BICRPSB,                                                 00894000
008950         BICRSRB,                                                 00895000
008960         BICRPAN,                                                 00896000
008970         RPV140-PANL-DATA-BLOCK,                                  00897000
008980         RPV140-PANL-DATA-AREA.                                   00898000
008990 CBD2-EXIT.                                                       00899000
009000     EXIT.                                                        00900000
009010******************************************************************00901000
009020 PANEL-GET-RPV140 SECTION.                                        00902000
009030 PANEL-GET-RPV140-START.                                          00903000
009040     MOVE 'N' TO RPV140-SW-SET-CURSOR.                            00904000
009050     MOVE PDB-RPV140-NAME TO PAN-NAME.                            00905000
009060     MOVE REQ-GET TO PAN-REQ-VERB.                                00906000
009070     CALL 'BISPAN' USING                                          00907000
009080         BICRPSB                                                  00908000
009090         BICRSRB                                                  00909000
009100         BICRPAN                                                  00910000
009110         RPV140-PANL-DATA-BLOCK,                                  00911000
009120         RPV140-PANL-DATA-AREA.                                   00912000
009130 PANEL-GET-RPV140-EXIT.                                           00913000
009140     EXIT.                                                        00914000
009150******************************************************************00915000
009160 PANEL-PUT-RPV140 SECTION.                                        00916000
009170 PANEL-PUT-RPV140-START.                                          00917000
009180     MOVE PDB-RPV140-NAME TO PAN-NAME.                            00918000
009190     MOVE REQ-PUT TO PAN-REQ-VERB.                                00919000
009200     CALL 'BISPAN' USING                                          00920000
009210         BICRPSB                                                  00921000
009220         BICRSRB                                                  00922000
009230         BICRPAN                                                  00923000
009240         RPV140-PANL-DATA-BLOCK,                                  00924000
009250         RPV140-PANL-DATA-AREA.                                   00925000
009260 PANEL-PUT-RPV140-EXIT.                                           00926000
009270     EXIT.                                                        00927000
009280******************************************************************00928000
009290 PANEL-GET-RPV140K SECTION.                                       00929000
009300 PANEL-GET-RPV140K-START.                                         00930000
009310     MOVE 'N' TO RPV140K-SW-SET-CURSOR.                           00931000
009320     MOVE PDB-RPV140K-NAME TO PAN-NAME.                           00932000
009330     MOVE REQ-GET TO PAN-REQ-VERB.                                00933000
009340     CALL 'BISPAN' USING                                          00934000
009350         BICRPSB                                                  00935000
009360         BICRSRB                                                  00936000
009370         BICRPAN                                                  00937000
009380         RPV140K-PANL-DATA-BLOCK,                                 00938000
009390         RPV140K-PANL-DATA-AREA.                                  00939000
009400 PANEL-GET-RPV140K-EXIT.                                          00940000
009410     EXIT.                                                        00941000
009420******************************************************************00942000
009430 PANEL-PUT-RPV140K SECTION.                                       00943000
009440 PANEL-PUT-RPV140K-START.                                         00944000
009450     MOVE PDB-RPV140K-NAME TO PAN-NAME.                           00945000
009460     MOVE REQ-PUT TO PAN-REQ-VERB.                                00946000
009470     CALL 'BISPAN' USING                                          00947000
009480         BICRPSB                                                  00948000
009490         BICRSRB                                                  00949000
009500         BICRPAN                                                  00950000
009510         RPV140K-PANL-DATA-BLOCK,                                 00951000
009520         RPV140K-PANL-DATA-AREA.                                  00952000
009530 PANEL-PUT-RPV140K-EXIT.                                          00953000
009540     EXIT.                                                        00954000
009550******************************************************************00955000
009560 DEEDIT-CODASYL-DATE SECTION.                                     00956000
000000 COPY SRP086.                                                     00957000
009580******************************************************************00958000
009590 EDIT-CODASYL-DATE SECTION.                                       00959000
000000 COPY SRP087.                                                     00960000
009610******************************************************************00961000
009620 MIC-MST-API SECTION.                                             00962000
000000 COPY MIPMSTA.                                                    00963000
009640******************************************************************00964000
009650 EDIT-ACCOUNT-KEY SECTION.                                        00965000
000000 COPY RPP014.                                                     00966000
009670******************************************************************00967000
009680 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 00968000
000000 COPY RPP033.                                                     00969000
009700******************************************************************00970000
009710 ACCOUNT-KEY-EDIT SECTION.                                        00971000
000000 COPY RPP130.                                                     00972000
009730******************************************************************00973000
009740 LEFT-JUSTIFY SECTION.                                            00974000
000000 COPY SRP025.                                                     00975000
009760******************************************************************00976000
009770 RIGHT-JUSTIFY SECTION.                                           00977000
000000 COPY SRP026.                                                     00978000
009790******************************************************************00979000
009800 PARAMETER-SEARCH SECTION.                                        00980000
000000 COPY SRP030.                                                     00981000
009820******************************************************************00982000
009830 COMPRESS-NEXTKEY SECTION.                                        00983000
000000 COPY SRP070.                                                     00984000
009850******************************************************************00985000
009860 GET-MESSAGE SECTION.                                             00986000
000000 COPY SRP071.                                                     00987000
009880******************************************************************00988000
009890 SRP170-ROUTINE SECTION.                                          00989000
000000 COPY SRP170.                                                     00990000
009910******************************************************************00991000
009920 BUILD-PFKEY-LINE SECTION.                                        00992000
000000 COPY SRP710.                                                     00993000
009940******************************************************************00994000
009950 VALIDATE-PFKEYS SECTION.                                         00995000
000000 COPY SRP711.                                                     00996000
009970******************************************************************00997000
009980 SLP096-GET-2023-RECORD SECTION.                                  00998000
000000 COPY SLP096.                                                     00999000
010000******************************************************************01000000
010010 CICS-XCTL SECTION.                                               01001000
000000 COPY SLP704.                                                     01002000
010030******************************************************************01003000
010040 CICS-RETURN-TRANSID SECTION.                                     01004000
000000 COPY SLP710.                                                     01005000
010060******************************************************************01006000
010070 TSQ-DELETE SECTION.                                              01007000
010080 TSQD-START.                                                      01008000
010090 TSQD-EXIT.                                                       01009000
010100     EXIT.                                                        01010000
010110******************************************************************01011000
010120 CICS-TSQ-READ SECTION.                                           01012000
000000 COPY SLP744.                                                     01013000
010140******************************************************************01014000
010150 CICS-ABORT-EXIT SECTION.                                         01015000
000000 COPY SLP798.                                                     01016000
010170******************************************************************01017000
