000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL350.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL350 - ADD-ON RELATIONSHIP NEW                            *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRCONS.                                                    00024000
000000 COPY BICRCONS.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRPAN.                                                     00028000
000000 COPY BICRPAN.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  RPV350K-PANL-DATA-BLOCK.                                     00032000
000000 COPY RPV350KW.                                                   00033000
000340 01  RPV350-PANL-DATA-BLOCK.                                      00034000
000000 COPY RPV350W.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00037000
000380     03  WS-NEXTKEY.                                              00038000
000390         05  WS-EXTID            PIC X(08).                       00039000
000400         05  WS-DELIM1           PIC X(01)       VALUE ','.       00040000
000410         05  WS-DATA.                                             00041000
000420             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00042000
000430             07  WS-DELIM2       PIC X(01)       VALUE ','.       00043000
000440             07  WS-ACCTX.                                        00044000
000450                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00045000
000460             07  WS-DELIM3       PIC X(01)       VALUE ','.       00046000
000470             07  WS-MODEL        PIC X(10)       VALUE SPACES.    00047000
000480         05  FILLER              PIC X(33)       VALUE SPACES.    00048000
000490     03  WS-LNKPROG1             PIC X(08)       VALUE 'RPLXXX05'.00049000
000500     03  WS-LKLGTH               PIC S9(04)      COMP             00050000
000510                                                 VALUE +4088.     00051000
000520     03  WS-DCHG-TEST            PIC X(01)       VALUE SPACE.     00052000
000530         88  WS-DCHG-PROTECT                     VALUE 'P'.       00053000
000540         88  WS-DCHG-EDITERR                     VALUE 'E'.       00054000
000550         88  WS-DCHG-HIDDEN                      VALUE 'H'.       00055000
000560     03  WS-ERROR-COUNT          PIC S9(04)      COMP             00056000
000570                                                 VALUE ZERO.      00057000
000580     03  WS-PDATE                PIC 9(08).                       00058000
000590     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00059000
000600         05  WS-PDATE-YYYY       PIC 9(04).                       00060000
000610         05  WS-PDATE-MM         PIC 9(02).                       00061000
000620         05  WS-PDATE-DD         PIC 9(02).                       00062000
000630     03  WS-SUB1                 PIC S9(04)      COMP             00063000
000640                                                 VALUE +0000.     00064000
000650     03  WS-SUB2                 PIC S9(04)      COMP             00065000
000660                                                 VALUE +0000.     00066000
000670 01  WS-LINKMSG                  PIC X(4500).                     00067000
000680 01  RPXXX05-MESSAGE.                                             00068000
000000 COPY MISCNT00      REPLACING                                     00069000
000700             ==:MICNT:== BY ==RPXXX05==.                          00070000
000000 COPY RPSXXX05.                                                   00071000
000720 01  WS-TSQAREAS.                                                 00072000
000730     03  WS-TSQITEM              PIC S9(04)      COMP             00073000
000740                                                 VALUE +0001.     00074000
000750     03  WS-TSQLGTH              PIC S9(04)      COMP             00075000
000760                                                 VALUE +4096.     00076000
000770     03  WS-TSQKEY.                                               00077000
000780         05  WS-TSQID            PIC X(04).                       00078000
000790         05  WS-TSQTRMID         PIC X(04).                       00079000
000800 01  LS-TSQAREA.                                                  00080000
000810     03  LS-TSQKEY               PIC X(08).                       00081000
000820     03  LS-TSQDATA              PIC X(4088).                     00082000
000830 01  MIWPRI-AREAS.                                                00083000
000000 COPY MIWPRI.                                                     00084000
000850 01  MIWMSTA-AREAS.                                               00085000
000000 COPY MIWMSTA.                                                    00086000
000870 01  MIMST-RECORD.                                                00087000
000000 COPY MISMST.                                                     00088000
000890 01  MI2023-RECORD.                                               00089000
000000 COPY MIS2023A.                                                   00090000
000910 01  WS-ABORTCODES.                                               00091000
000920     03  WS-AB0009               PIC S9(04)      COMP             00092000
000930                                                 VALUE +0009.     00093000
000940     03  WS-AB0106               PIC S9(04)      COMP             00094000
000950                                                 VALUE +0106.     00095000
000960     03  WS-AB2033               PIC S9(04)      COMP             00096000
000970                                                 VALUE +2033.     00097000
000980     03  WS-AB6345               PIC S9(04)      COMP             00098000
000990                                                 VALUE +6345.     00099000
001000 01  WS-TRACECODES.                                               00100000
001010     03  WS-TR0001               PIC S9(04)      COMP             00101000
001020                                                 VALUE +0001.     00102000
001030     03  WS-TR0002               PIC S9(04)      COMP             00103000
001040                                                 VALUE +0002.     00104000
001050 01  SLW096-AREAS.                                                00105000
000000 COPY SLW096.                                                     00106000
001070 01  RPW014-AREAS.                                                00107000
000000 COPY RPW014.                                                     00108000
001090 01  RPW033-AREAS.                                                00109000
000000 COPY RPW033.                                                     00110000
001110 01  RPW130-AREAS.                                                00111000
000000 COPY RPW130.                                                     00112000
001130 01  SRW000-AREAS.                                                00113000
000000 COPY SRW000.                                                     00114000
001150 01  SRW025-AREAS.                                                00115000
000000 COPY SRW025.                                                     00116000
001170 01  SRW030-AREAS.                                                00117000
000000 COPY SRW030.                                                     00118000
001190 01  SRW031-AREAS.                                                00119000
000000 COPY SRW031.                                                     00120000
001210 01  SRW067-AREAS.                                                00121000
000000 COPY SRW067.                                                     00122000
001230 01  SRW105-AREAS.                                                00123000
000000 COPY SRW105.                                                     00124000
001250 01  SRW161-AREAS.                                                00125000
000000 COPY SRW161.                                                     00126000
001270 01  SRW166-AREAS.                                                00127000
000000 COPY SRW166.                                                     00128000
001290 01  SRW170-AREAS.                                                00129000
000000 COPY SRW170.                                                     00130000
001310 COPY DFHAID.                                                     00131000
001320******************************************************************00132000
001330 LINKAGE SECTION.                                                 00133000
001340 01  DFHCOMMAREA.                                                 00134000
000000 COPY SLS1112.                                                    00135000
001360     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00136000
001370         05  COM-EDIT-DATE       PIC X(10).                       00137000
001380         05  COM-KEY-FIELDS.                                      00138000
001390             07  COM-KEY-PRODCODE                                 00139000
001400                                 PIC X(06).                       00140000
001410             07  COM-KEY-ACCOUNT PIC X(18).                       00141000
001420             07  COM-KEY-ACCOUNT-N                                00142000
001430                         REDEFINES COM-KEY-ACCOUNT                00143000
001440                                 PIC 9(18).                       00144000
001450             07  COM-KEY-MODEL                                    00145000
001460                                 PIC X(10).                       00146000
001470             07  COM-KEY-IDNBRX  PIC X(18).                       00147000
001480             07  COM-KEY-IDNBR                                    00148000
001490                         REDEFINES COM-KEY-IDNBRX                 00149000
001500                                 PIC 9(18).                       00150000
001510         05  COM-PANEL-ACTION    PIC X(01).                       00151000
001520             88  INITIAL-PANEL                   VALUE ' '.       00152000
001530             88  EDIT-PANEL                      VALUE 'E'.       00153000
001540         05  COM-FROM-PANEL      PIC X(01).                       00154000
001550             88  FROM-KEY-PANEL                  VALUE 'K'.       00155000
001560             88  FROM-MAINT-PANEL                VALUE 'M'.       00156000
001570             88  FROM-HELP                       VALUE 'H'.       00157000
001580             88  FROM-BREAKAWAY                  VALUE 'B'.       00158000
001590         05  COM-KEY-FORMATTEDACCT                                00159000
001600                                 PIC X(22).                       00160000
001610         05  COM-KEY-MSGNBR      PIC X(06).                       00161000
001620         05  COM-KEY-COMMAND     PIC X(50).                       00162000
001630         05  COM-RCIF-KEY.                                        00163000
001640             07  COM-RCIF-CUST-INST                               00164000
001650                                 PIC 9(04).                       00165000
001660             07  COM-RCIF-CUST-TYPE                               00166000
001670                                 PIC X(01).                       00167000
001680             07  COM-RCIF-CUST.                                   00168000
001690                 09  COM-RCIF-ALPHA                               00169000
001700                                 PIC X(14).                       00170000
001710                 09  COM-RCIF-ACCUM                               00171000
001720                                 PIC 9(03).                       00172000
001730                 09  COM-RCIF-TIEBRKR                             00173000
001740                                 PIC 9(04).                       00174000
001750         05  COM-CUST-NAME       PIC X(40).                       00175000
001760         05  COM-REL-STAT        PIC X(01).                       00176000
001770         05  COM-IDNUMBER        PIC X(18).                       00177000
001780         05  COM-MODEL           PIC X(10).                       00178000
001790         05  COM-MODEL-DESC      PIC X(20).                       00179000
001800         05  COM-DCHG.                                            00180000
001810             07  COM-ADDINST-DCHG                                 00181000
001820                                 PIC X(01).                       00182000
001830             07  COM-ADDPROD-DCHG                                 00183000
001840                                 PIC X(01).                       00184000
001850             07  COM-ADDACCT-DCHG                                 00185000
001860                                 PIC X(01).                       00186000
001870******************************************************************00187000
001880*01  SLW096-2023RECORDS.                                          00188000
000000 COPY SLW096L.                                                    00189000
001900******************************************************************00190000
001910 PROCEDURE DIVISION.                                              00191000
001920******************************************************************00192000
001930 ENTRY-ROUTINE SECTION.                                           00193000
001940     MOVE 'RPL350' TO COM-ABPROGID.                               00194000
000000 COPY SLP771.                                                     00195000
001960******************************************************************00196000
001970 TRANSACTION-CLEAN-UP SECTION.                                    00197000
001980 TCU-START.                                                       00198000
001990 TCU-EXIT.                                                        00199000
002000     EXIT.                                                        00200000
002010******************************************************************00201000
002020 CICS-HANDLE-CONDITION SECTION.                                   00202000
000000 COPY SLP772.                                                     00203000
002040     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00204000
002050         GO TO CTSRI-EXIT.                                        00205000
002060     MOVE WS-AB2033 TO COM-ABORT.                                 00206000
002070     MOVE WS-TR0001 TO COM-ABTRACE.                               00207000
002080     GO TO ABORT-EXIT.                                            00208000
002090 CHC-EXIT.                                                        00209000
002100     EXIT.                                                        00210000
002110******************************************************************00211000
002120 ROUTING-ROUTINE SECTION.                                         00212000
002130 RR-START.                                                        00213000
002140     MOVE LOW-VALUES TO RPXXX05-MESSAGE.                          00214000
002150     MOVE LOW-VALUES TO RPV350-PANL-DATA-AREA.                    00215000
002160     MOVE LOW-VALUES TO RPV350K-PANL-DATA-AREA.                   00216000
002170     MOVE ALL ZEROS TO WS-MSGNBR.                                 00217000
002180     MOVE 'RP00' TO WS-TSQFILEID.                                 00218000
002190     MOVE 'RPI' TO WS-TSQSYSID.                                   00219000
002200     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00220000
002210     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00221000
002220     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00222000
002230         MOVE COM-PAN TO BICRPAN                                  00223000
002240         MOVE COM-PSB TO BICRPSB                                  00224000
002250         MOVE COM-SRB TO BICRSRB                                  00225000
002260     ELSE                                                         00226000
002270         MOVE '1' TO BPSB-LEVEL.                                  00227000
002280     IF COM-RETURN IS EQUAL TO 'B'                                00228000
002290         GO TO BREAKAWAY-RETURN.                                  00229000
002300     IF COM-RETURN IS EQUAL TO '0'                                00230000
002310         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00231000
002320         MOVE SPACES TO COM-WORKAREAS                             00232000
002330         MOVE '1' TO SRB-VERSION                                  00233000
002340         MOVE 'IPRP' TO SRB-APPL-ID                               00234000
002350         MOVE 'RPL350' TO SRB-PROG-ID                             00235000
002360         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00236000
002370         MOVE 'P' TO PAN-TYPE                                     00237000
002380         MOVE SPACE TO PAN-OVERLAY                                00238000
002390         MOVE SPACE TO PAN-CLOSE                                  00239000
002400         MOVE SPACE TO PAN-ALARM                                  00240000
002410         MOVE SPACE TO PAN-CURSOR-PAN                             00241000
002420         MOVE SPACE TO PAN-CURSOR-FLD                             00242000
002430         MOVE SPACE TO PAN-SET-FLD                                00243000
002440         MOVE SPACE TO PAN-SET-VID                                00244000
002450         MOVE SPACE TO PAN-SET-EMP                                00245000
002460         MOVE PDB-RPV350K-NAME TO PAN-NAME                        00246000
002470         PERFORM PANEL-INIT                                       00247000
002480         MOVE BICRPAN TO COM-PAN                                  00248000
002490         MOVE BICRPSB TO COM-PSB                                  00249000
002500         MOVE BICRSRB TO COM-SRB                                  00250000
002510         PERFORM INITIALIZE-DATE                                  00251000
002520         GO TO PANEL-ROUTER.                                      00252000
002530     PERFORM PANEL-NAME-SET.                                      00253000
002540     IF COM-HELPSW IS EQUAL TO 'Y'                                00254000
002550         GO TO HELP-RETURN.                                       00255000
002560     PERFORM PANEL-RECEIVE.                                       00256000
002570     PERFORM PANEL-DATA-GET.                                      00257000
002580     IF FROM-MAINT-PANEL                                          00258000
002590         PERFORM SET-DCHG-INDICATORS.                             00259000
002600     PERFORM PANEL-PFKEY-SET.                                     00260000
002610     PERFORM VALIDATE-PFKEYS.                                     00261000
002620     IF EIBAID IS EQUAL TO DFHPF1                                 00262000
002630         GO TO GET-HELP.                                          00263000
002640     IF EIBAID IS EQUAL TO DFHPF11                                00264000
002650         GO TO BREAK-AWAY.                                        00265000
002660     IF (COM-RETURN IS EQUAL TO 'E')                              00266000
002670         AND (EIBAID IS EQUAL TO DFHPF2                           00267000
002680         OR EIBAID IS EQUAL TO DFHPF3                             00268000
002690         OR EIBAID IS EQUAL TO DFHPF4                             00269000
002700         OR EIBAID IS EQUAL TO DFHPF7                             00270000
002710         OR EIBAID IS EQUAL TO DFHPF8                             00271000
002720         OR EIBAID IS EQUAL TO DFHPF12)                           00272000
002730         GO TO CLOSE-TRANSACTION.                                 00273000
002740     IF COM-RETURN IS EQUAL TO '1'                                00274000
002750         AND                                                      00275000
002760         (EIBAID IS EQUAL TO DFHPF12                              00276000
002770         OR EIBAID IS EQUAL TO DFHPF3)                            00277000
002780         GO TO CLOSE-TRANSACTION.                                 00278000
002790     IF COM-RETURN IS EQUAL TO '0'                                00279000
002800         OR COM-RETURN IS EQUAL TO 'E'                            00280000
002810         OR COM-RETURN IS EQUAL TO '1'                            00281000
002820         GO TO PANEL-ROUTER.                                      00282000
002830 RR-END.                                                          00283000
002840     GO TO CLOSE-TRANSACTION.                                     00284000
002850 RR-EXIT.                                                         00285000
002860     EXIT.                                                        00286000
002870******************************************************************00287000
002880 INITIALIZE-DATE SECTION.                                         00288000
002890 ID-START.                                                        00289000
002900     MOVE COM-DATE TO WS-CURDATE8.                                00290000
002910     MOVE '-' TO WS-CD8DSH1.                                      00291000
002920     MOVE '-' TO WS-CD8DSH2.                                      00292000
002930     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00293000
002940 ID-EXIT.                                                         00294000
002950     EXIT.                                                        00295000
002960******************************************************************00296000
002970 PANEL-NAME-SET SECTION.                                          00297000
002980 PNS-START.                                                       00298000
002990     IF COM-RETURN IS EQUAL TO '0'                                00299000
003000         MOVE PDB-RPV350K-NAME TO PAN-NAME.                       00300000
003010     IF COM-RETURN IS EQUAL TO 'E'                                00301000
003020         MOVE PDB-RPV350K-NAME TO PAN-NAME.                       00302000
003030     IF COM-RETURN IS EQUAL TO '1'                                00303000
003040         MOVE PDB-RPV350-NAME TO PAN-NAME.                        00304000
003050 PNS-EXIT.                                                        00305000
003060     EXIT.                                                        00306000
003070******************************************************************00307000
003080 PANEL-DATA-GET SECTION.                                          00308000
003090 PDG-START.                                                       00309000
003100     IF COM-RETURN IS EQUAL TO '0'                                00310000
003110         PERFORM PANEL-GET-RPV350K.                               00311000
003120     IF COM-RETURN IS EQUAL TO 'E'                                00312000
003130         PERFORM PANEL-GET-RPV350K                                00313000
003140         MOVE RPV350K-COMMAND TO WS-NEXTKEY                       00314000
003150         MOVE PDB-RPV350K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00315000
003160     IF COM-RETURN IS EQUAL TO '1'                                00316000
003170         PERFORM PANEL-GET-RPV350                                 00317000
003180         MOVE RPV350-COMMAND TO WS-NEXTKEY                        00318000
003190         MOVE PDB-RPV350-COMMAND-DCHG TO WS-COMMAND-DCHG.         00319000
003200 PDG-EXIT.                                                        00320000
003210     EXIT.                                                        00321000
003220******************************************************************00322000
003230 PANEL-PFKEY-SET SECTION.                                         00323000
003240 PPS-START.                                                       00324000
003250     IF COM-UPDATE IS EQUAL TO 'Y'                                00325000
003260         AND COM-RETURN IS EQUAL TO '1'                           00326000
003270         MOVE 'A' TO WS-PF9-FLG.                                  00327000
003280 PPS-EXIT.                                                        00328000
003290     EXIT.                                                        00329000
003300******************************************************************00330000
003310 PANEL-ROUTER SECTION.                                            00331000
003320 PR-START.                                                        00332000
003330     IF COM-RETURN IS EQUAL TO '0'                                00333000
003340         GO TO PROCESS-KEY-PANEL.                                 00334000
003350     IF COM-RETURN IS EQUAL TO 'E'                                00335000
003360         GO TO PROCESS-KEY-PANEL.                                 00336000
003370     IF COM-RETURN IS EQUAL TO '1'                                00337000
003380         GO TO PROCESS-MAINT-PANEL.                               00338000
003390     GO TO CLOSE-TRANSACTION.                                     00339000
003400 PR-EXIT.                                                         00340000
003410     EXIT.                                                        00341000
003420******************************************************************00342000
003430 HELP-RETURN SECTION.                                             00343000
000000 COPY SRP074.                                                     00344000
003450******************************************************************00345000
003460 HELP-RETURN-FINISH SECTION.                                      00346000
003470 HRF-START.                                                       00347000
003480     PERFORM PANEL-DATA-GET.                                      00348000
003490     MOVE 'H' TO COM-FROM-PANEL.                                  00349000
003500     GO TO PANEL-ROUTER.                                          00350000
003510 HRF-EXIT.                                                        00351000
003520     EXIT.                                                        00352000
003530******************************************************************00353000
003540 HELP-MISSING-FINISH SECTION.                                     00354000
003550 HMF-START.                                                       00355000
003560     MOVE 'H' TO COM-FROM-PANEL.                                  00356000
003570     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00357000
003580     GO TO PANEL-ROUTER.                                          00358000
003590 HMF-EXIT.                                                        00359000
003600     EXIT.                                                        00360000
003610******************************************************************00361000
003620 BREAK-AWAY SECTION.                                              00362000
000000 COPY SRP0752.                                                    00363000
003640******************************************************************00364000
003650 BREAKAWAY-RETURN-FINISH SECTION.                                 00365000
003660 BRF-START.                                                       00366000
003670     PERFORM PANEL-DATA-GET.                                      00367000
003680     MOVE 'B' TO COM-FROM-PANEL.                                  00368000
003690     GO TO PANEL-ROUTER.                                          00369000
003700 BRF-EXIT.                                                        00370000
003710     EXIT.                                                        00371000
003720******************************************************************00372000
003730 PROCESS-KEY-PANEL SECTION.                                       00373000
003740 PKP-START.                                                       00374000
003750     IF INITIAL-PANEL                                             00375000
003760         GO TO PKP-CONTINUE.                                      00376000
003770     IF EDIT-PANEL                                                00377000
003780         AND FROM-MAINT-PANEL                                     00378000
003790         MOVE SPACE TO COM-FROM-PANEL                             00379000
003800         GO TO PKP-RELOAD-PANEL.                                  00380000
003810 PKP-CONTINUE.                                                    00381000
003820     MOVE COM-NEXTKEY TO SR-PSLIST.                               00382000
003830     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00383000
003840         GO TO PKP-SEND-PANEL.                                    00384000
003850 PKP-BEGIN-EDITS.                                                 00385000
003860     IF EDIT-PANEL                                                00386000
003870         MOVE RPV350K-PRODCD TO COM-KEY-PRODCODE                  00387000
003880         MOVE RPV350K-ACCOUNT TO COM-KEY-ACCOUNT                  00388000
003890         MOVE RPV350K-MODEL TO COM-KEY-MODEL                      00389000
003900         MOVE RPV350K-IDNBR TO COM-KEY-IDNBRX                     00390000
003910         GO TO PKP-RETURN-EDITS.                                  00391000
003920     PERFORM PARAMETER-SEARCH.                                    00392000
003930     MOVE SR-PSPARM TO COM-EXTID.                                 00393000
003940     MOVE SR-PSPARM TO COM-EXTERNALID.                            00394000
003950     PERFORM PARAMETER-SEARCH.                                    00395000
003960     MOVE SR-PSPARM TO COM-KEY-PRODCODE.                          00396000
003970     PERFORM PARAMETER-SEARCH.                                    00397000
003980     MOVE SR-PSPARM TO COM-KEY-ACCOUNT.                           00398000
003990     PERFORM PARAMETER-SEARCH.                                    00399000
004000     MOVE SR-PSPARM TO COM-KEY-MODEL.                             00400000
004010     PERFORM PARAMETER-SEARCH.                                    00401000
004020     MOVE SR-PSPARM TO COM-KEY-IDNBRX.                            00402000
004030 PKP-RETURN-EDITS.                                                00403000
004040     IF COM-KEY-PRODCODE IS EQUAL TO SPACE                        00404000
004050         MOVE LOW-VALUE TO COM-KEY-PRODCODE.                      00405000
004060     IF COM-KEY-ACCOUNT IS EQUAL TO SPACE                         00406000
004070         MOVE LOW-VALUE TO COM-KEY-ACCOUNT.                       00407000
004080     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00408000
004090         MOVE LOW-VALUES TO COM-KEY-MODEL.                        00409000
004100     IF COM-KEY-IDNBRX IS EQUAL TO SPACES                         00410000
004110         MOVE LOW-VALUES TO COM-KEY-IDNBRX.                       00411000
004120     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00412000
004130         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00413000
004140         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00414000
004150         AND COM-KEY-IDNBRX IS GREATER THAN LOW-VALUES            00415000
004160         GO TO PKP-RETURN-CONT.                                   00416000
004170     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00417000
004180         MOVE '000002' TO WS-MSGNBR                               00418000
004190         GO TO PKP-RETURN-CONT.                                   00419000
004200     PERFORM EDIT-ACCOUNT-KEY.                                    00420000
004210 PKP-RETURN-CONT.                                                 00421000
004220     IF INITIAL-PANEL                                             00422000
004230         AND COM-KEY-PRODCODE IS EQUAL TO LOW-VALUES              00423000
004240         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUES               00424000
004250         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUES                 00425000
004260         AND COM-KEY-IDNBRX IS EQUAL TO LOW-VALUES                00426000
004270         MOVE '000001' TO WS-MSGNBR                               00427000
004280         GO TO PKP-SEND-PANEL.                                    00428000
004290     MOVE COM-KEY-IDNBRX TO SR-JUSTIFYIN.                         00429000
004300     MOVE +0018 TO SR-JLGTH.                                      00430000
004310     PERFORM RIGHT-JUSTIFY.                                       00431000
004320     IF SR-JUSTIFYOUT IS EQUAL TO SPACE                           00432000
004330         MOVE ZEROS TO COM-KEY-IDNBRX                             00433000
004340     ELSE                                                         00434000
004350         MOVE SR-JUSTIFYOUT TO COM-KEY-IDNBRX.                    00435000
004360     IF COM-KEY-IDNBRX IS NOT NUMERIC                             00436000
004370         MOVE ZEROES TO COM-KEY-IDNBRX.                           00437000
004380     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00438000
004390     MOVE COM-KEY-MODEL TO COM-MODEL.                             00439000
004400     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00440000
004410     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00441000
004420         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00442000
004430     ELSE                                                         00443000
004440         MOVE ZERO TO COM-ACCOUNT.                                00444000
004450     IF FROM-BREAKAWAY                                            00445000
004460         OR FROM-HELP                                             00446000
004470         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00447000
004480         GO TO PKP-RELOAD-PANEL.                                  00448000
004490     IF COM-KEY-PRODCODE IS GREATER THAN SPACES                   00449000
004500         AND COM-KEY-ACCOUNT IS GREATER THAN SPACES               00450000
004510         AND COM-KEY-MODEL IS GREATER THAN SPACES                 00451000
004520         AND COM-KEY-IDNBRX IS GREATER THAN ZEROS                 00452000
004530         MOVE '000002' TO WS-MSGNBR                               00453000
004540         GO TO PKP-RELOAD-PANEL.                                  00454000
004550 PKP-EDITS-READY.                                                 00455000
004560     MOVE SPACE TO COM-PANEL-ACTION.                              00456000
004570     MOVE '1' TO COM-RETURN.                                      00457000
004580     MOVE 'K' TO COM-FROM-PANEL.                                  00458000
004590     GO TO PANEL-ROUTER.                                          00459000
004600 PKP-RELOAD-PANEL.                                                00460000
004610     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00461000
004620         MOVE LOW-VALUES TO RPV350K-PRODCD                        00462000
004630     ELSE                                                         00463000
004640         MOVE COM-KEY-PRODCODE TO RPV350K-PRODCD.                 00464000
004650     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00465000
004660         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROS                     00466000
004670         MOVE LOW-VALUES TO RPV350K-ACCOUNT                       00467000
004680     ELSE                                                         00468000
004690         MOVE COM-KEY-ACCOUNT TO RPV350K-ACCOUNT.                 00469000
004700     MOVE COM-KEY-MODEL TO RPV350K-MODEL.                         00470000
004710     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00471000
004720         MOVE LOW-VALUES TO RPV350K-MODEL.                        00472000
004730     MOVE COM-KEY-IDNBRX TO RPV350K-IDNBR.                        00473000
004740     IF COM-KEY-IDNBRX IS NOT GREATER THAN ZEROS                  00474000
004750         MOVE LOW-VALUES TO RPV350K-IDNBR.                        00475000
004760 PKP-SEND-PANEL.                                                  00476000
004770     MOVE PDB-RPV350K-NAME TO PAN-NAME.                           00477000
004780     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00478000
004790     IF (FROM-HELP                                                00479000
004800         OR FROM-BREAKAWAY)                                       00480000
004810         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00481000
004820         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00482000
004830     ELSE                                                         00483000
004840         MOVE PDB-RPV350K-PRODCD TO PAN-SET-FLD.                  00484000
004850     PERFORM CALL-BISPAN-RPV350K.                                 00485000
004860     MOVE COM-OPERID TO RPV350K-OPERID.                           00486000
004870     MOVE COM-INST TO RPV350K-INST.                               00487000
004880     MOVE COM-EDIT-DATE TO RPV350K-SYSDATE.                       00488000
004890     IF RPV350K-PRODCD IS EQUAL TO SPACES                         00489000
004900         MOVE LOW-VALUES TO RPV350K-PRODCD.                       00490000
004910     MOVE RPV350K-ACCOUNT TO SR-JUSTLONGIN.                       00491000
004920     MOVE +18 TO SR-JLGTH.                                        00492000
004930     PERFORM LEFT-JUSTIFY.                                        00493000
004940     MOVE SR-JUSTLONGOUT TO RPV350K-ACCOUNT.                      00494000
004950     IF RPV350K-ACCOUNT IS EQUAL TO SPACES                        00495000
004960         MOVE LOW-VALUES TO RPV350K-ACCOUNT.                      00496000
004970     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00497000
004980         MOVE WS-HELPMSG TO WS-MSGNBR.                            00498000
004990     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00499000
005000         MOVE '000027' TO WS-MSGNBR                               00500000
005010     ELSE                                                         00501000
005020         PERFORM BUILD-NEXTKEY                                    00502000
005030         PERFORM COMPRESS-NEXTKEY                                 00503000
005040         MOVE WS-NEXTKEY TO RPV350K-COMMAND.                      00504000
005050     IF FROM-BREAKAWAY                                            00505000
005060         OR FROM-HELP                                             00506000
005070         MOVE SPACES TO COM-FROM-PANEL                            00507000
005080         MOVE COM-KEY-COMMAND TO RPV350K-COMMAND                  00508000
005090         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00509000
005100     ELSE                                                         00510000
005110         MOVE RPV350K-COMMAND TO COM-KEY-COMMAND                  00511000
005120         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00512000
005130     MOVE 'E' TO COM-RETURN.                                      00513000
005140     PERFORM GET-MESSAGE.                                         00514000
005150     MOVE WS-MESSAGE TO RPV350K-MSGLINE.                          00515000
005160     PERFORM PANEL-PFKEY-SET.                                     00516000
005170     PERFORM BUILD-PFKEY-LINE.                                    00517000
005180     MOVE WS-PFLINE1 TO RPV350K-PFLINE1.                          00518000
005190     MOVE WS-PFLINE2 TO RPV350K-PFLINE2.                          00519000
005200     PERFORM PANEL-PUT-RPV350K.                                   00520000
005210     PERFORM PANEL-SEND.                                          00521000
005220     MOVE 'E' TO COM-PANEL-ACTION.                                00522000
005230     MOVE COM-INTID TO WS-TRANSID.                                00523000
005240     GO TO CICS-RETURN-TRANSID.                                   00524000
005250 PKP-EXIT.                                                        00525000
005260     EXIT.                                                        00526000
005270******************************************************************00527000
005280 PROCESS-MAINT-PANEL SECTION.                                     00528000
005290 PMP-START.                                                       00529000
005300     IF FROM-HELP                                                 00530000
005310         OR FROM-BREAKAWAY                                        00531000
005320         MOVE SPACE TO COM-FROM-PANEL                             00532000
005330         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00533000
005340         MOVE PAN-CURSOR-FLD TO WS-CURSOR-FIELD                   00534000
005350         GO TO PMP-SEND-PANEL.                                    00535000
005360     MOVE 'E' TO COM-END.                                         00536000
005370     IF INITIAL-PANEL                                             00537000
005380         MOVE ALL 'N' TO COM-DCHG                                 00538000
005390         MOVE ALL 'N' TO RPXXX05-DCHG                             00539000
005400         MOVE LOW-VALUES TO RPV350-PANL-DATA-AREA                 00540000
005410         MOVE SPACE TO COM-PANEL-ACTION                           00541000
005420         MOVE 'VKL' TO RPXXX05-APIFUNC                            00542000
005430         GO TO PMP-LINK-TO-RPLXXX05.                              00543000
005440 PMP-PFKEYS.                                                      00544000
005450     MOVE ALL ZEROS TO WS-MSGNBR.                                 00545000
005460     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00546000
005470         MOVE SPACES TO WS-CURSOR-FIELD                           00547000
005480         GO TO PMP-SEND-PANEL.                                    00548000
005490     IF EIBAID IS EQUAL TO DFHPF4                                 00549000
005500         GO TO PMP-CONTINUE.                                      00550000
005510     MOVE COM-NEXTKEY TO WS-NEXTKEY.                              00551000
005520 PMP-CONTINUE.                                                    00552000
005530     MOVE ZERO TO WS-MSGNBR.                                      00553000
005540     MOVE +0 TO WS-ERROR-COUNT.                                   00554000
005550     MOVE COM-DCHG TO SRW166-FIELD.                               00555000
005560     MOVE 'E' TO SRW166-IN.                                       00556000
005570     MOVE 'Y' TO SRW166-OUT.                                      00557000
005580* MOVE THE LENGTH OF THE COM-DCHG FIELD:                          00558000
005590     MOVE +3 TO SRW166-LGTH.                                      00559000
005600     PERFORM EXAMINE-FIELD.                                       00560000
005610     MOVE SRW166-FIELD TO COM-DCHG.                               00561000
005620     MOVE ALL 'N' TO RPXXX05-DCHG.                                00562000
005630     MOVE COM-ADDINST-DCHG TO RPXXX05-ADD-INST-DCHG.              00563000
005640     MOVE COM-ADDPROD-DCHG TO RPXXX05-ADD-PRODCODE-DCHG.          00564000
005650     MOVE COM-ADDACCT-DCHG TO RPXXX05-ADD-ACCOUNT-DCHG.           00565000
005660     PERFORM MOVE-PANEL-TO-RECORD.                                00566000
005670     IF COM-DCHG IS EQUAL TO SPACES                               00567000
005680         AND (EIBAID IS EQUAL TO DFHPF3                           00568000
005690         OR EIBAID IS EQUAL TO DFHPF4)                            00569000
005700         GO TO CLOSE-TRANSACTION.                                 00570000
005710 PMP-LINK-TO-RPLXXX05.                                            00571000
005720     IF INITIAL-PANEL                                             00572000
005730         MOVE 'VKL' TO RPXXX05-APIFUNC.                           00573000
005740     IF EDIT-PANEL                                                00574000
005750         MOVE 'UPD' TO RPXXX05-APIFUNC.                           00575000
005760     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00576000
005770         OR EIBAID IS EQUAL TO DFHPF9                             00577000
005780         MOVE 'EDT' TO RPXXX05-APIFUNC.                           00578000
005790     PERFORM RPXXX05-LINK-MESSAGE.                                00579000
005800     IF RPXXX05-RETURN IS EQUAL TO 'E'                            00580000
005810         MOVE 'E' TO COM-RETURN                                   00581000
005820         MOVE 'E' TO COM-PANEL-ACTION                             00582000
005830         MOVE 'M' TO COM-FROM-PANEL                               00583000
005840         GO TO PANEL-ROUTER.                                      00584000
005850     IF RPXXX05-APIFUNC IS EQUAL TO 'EDT'                         00585000
005860         GO TO PMP-BUILD-MAINT-PANEL.                             00586000
005870     IF RPXXX05-APIFUNC IS EQUAL TO 'UPD'                         00587000
005880         AND RPXXX05-FUNCTION IS EQUAL TO SPACE                   00588000
005890         GO TO CLOSE-TRANSACTION.                                 00589000
005900     MOVE RPXXX05-RCIF-KEY TO COM-RCIF-KEY.                       00590000
005910     MOVE RPXXX05-CUST-NAME TO COM-CUST-NAME.                     00591000
005920     MOVE RPXXX05-REL-STAT TO COM-REL-STAT.                       00592000
005930     MOVE RPXXX05-IDNUMBER TO COM-IDNUMBER.                       00593000
005940     MOVE RPXXX05-KEY-MODEL TO COM-MODEL.                         00594000
005950     MOVE RPXXX05-KEY-MODEL TO COM-KEY-MODEL.                     00595000
005960     MOVE RPXXX05-MODEL-DESC TO COM-MODEL-DESC.                   00596000
005970     IF COM-PRODCODE IS EQUAL TO LOW-VALUES                       00597000
005980         MOVE RPXXX05-KEY-PRODCODE TO COM-PRODCODE                00598000
005990         MOVE RPXXX05-KEY-PRODCODE TO COM-KEY-PRODCODE            00599000
006000         MOVE RPXXX05-KEY-ACCOUNT TO COM-KEY-ACCOUNT              00600000
006010         MOVE RPXXX05-KEY-MODEL TO COM-KEY-MODEL.                 00601000
006020 PMP-BUILD-MAINT-PANEL.                                           00602000
006030     MOVE RPXXX05-ADD-INST-DCHG TO COM-ADDINST-DCHG.              00603000
006040     MOVE RPXXX05-ADD-PRODCODE-DCHG TO COM-ADDPROD-DCHG.          00604000
006050     MOVE RPXXX05-ADD-ACCOUNT-DCHG TO COM-ADDACCT-DCHG.           00605000
006060     PERFORM BUILD-MAINT-PANEL.                                   00606000
006070 PMP-SEND-PANEL.                                                  00607000
006080     IF WS-CURSOR-FIELD IS EQUAL TO SPACE                         00608000
006090         MOVE PDB-RPV350-COMMAND TO PAN-SET-FLD                   00609000
006100     ELSE                                                         00610000
006110         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                     00611000
006120     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00612000
006130     PERFORM CALL-BISPAN-RPV350.                                  00613000
006140     MOVE COM-INST TO RPV350-INST.                                00614000
006150     MOVE COM-OPERID TO RPV350-OPERID.                            00615000
006160     MOVE COM-PRODCODE TO RPV350-PRODCD.                          00616000
006170     MOVE COM-KEY-ACCOUNT TO RPV350-ACCOUNT.                      00617000
006180     MOVE COM-KEY-MODEL TO RPV350-MODEL.                          00618000
006190     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00619000
006200         MOVE ALL 'P' TO COM-DCHG                                 00620000
006210         MOVE PDB-RPV350-COMMAND TO WS-CURSOR-FIELD.              00621000
006220     PERFORM SET-ATTRIBUTES-AND-MESSAGES.                         00622000
006230     IF (FROM-HELP                                                00623000
006240         OR FROM-BREAKAWAY)                                       00624000
006250         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00625000
006260         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00626000
006270         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00627000
006280     ELSE                                                         00628000
006290         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD                      00629000
006300         MOVE WS-CURSOR-OCC TO PAN-SET-OCC.                       00630000
006310     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00631000
006320     PERFORM CALL-BISPAN-RPV350.                                  00632000
006330     MOVE COM-INST TO RPV350-INST.                                00633000
006340     MOVE COM-OPERID TO RPV350-OPERID.                            00634000
006350     MOVE COM-EDIT-DATE TO RPV350-SYSDATE.                        00635000
006360     IF WS-MSGNBR NOT NUMERIC                                     00636000
006370         MOVE ZERO TO WS-MSGNBR.                                  00637000
006380     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00638000
006390         MOVE WS-HELPMSG TO WS-MSGNBR.                            00639000
006400     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00640000
006410         MOVE '000027' TO WS-MSGNBR                               00641000
006420     ELSE                                                         00642000
006430         PERFORM BUILD-NEXTKEY                                    00643000
006440         PERFORM COMPRESS-NEXTKEY                                 00644000
006450         MOVE WS-NEXTKEY TO RPV350-COMMAND.                       00645000
006460     IF FROM-HELP                                                 00646000
006470         OR FROM-BREAKAWAY                                        00647000
006480         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00648000
006490         MOVE COM-KEY-COMMAND TO RPV350-COMMAND                   00649000
006500         MOVE SPACE TO COM-FROM-PANEL                             00650000
006510     ELSE                                                         00651000
006520         MOVE RPV350-COMMAND TO COM-KEY-COMMAND                   00652000
006530         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00653000
006540     PERFORM GET-MESSAGE.                                         00654000
006550     MOVE WS-MESSAGE TO RPV350-MSGLINE.                           00655000
006560     PERFORM PANEL-PFKEY-SET.                                     00656000
006570     MOVE 'E' TO COM-END.                                         00657000
006580     PERFORM BUILD-PFKEY-LINE.                                    00658000
006590     MOVE WS-PFLINE1 TO RPV350-PFLINE1.                           00659000
006600     MOVE WS-PFLINE2 TO RPV350-PFLINE2.                           00660000
006610     PERFORM PANEL-PUT-RPV350.                                    00661000
006620     PERFORM PANEL-SEND.                                          00662000
006630     MOVE '1' TO COM-RETURN.                                      00663000
006640     MOVE 'E' TO COM-PANEL-ACTION.                                00664000
006650     MOVE 'M' TO COM-FROM-PANEL.                                  00665000
006660     MOVE COM-INTID TO WS-TRANSID.                                00666000
006670     GO TO CICS-RETURN-TRANSID.                                   00667000
006680 PMP-EXIT.                                                        00668000
006690     EXIT.                                                        00669000
006700******************************************************************00670000
006710 MOVE-PANEL-TO-RECORD SECTION.                                    00671000
006720 MPTR-START.                                                      00672000
006730     MOVE COM-KEY-PRODCODE TO RPXXX05-KEY-PRODCODE.               00673000
006740     MOVE COM-KEY-ACCOUNT TO RPXXX05-KEY-ACCOUNT.                 00674000
006750     MOVE COM-KEY-MODEL TO RPXXX05-KEY-MODEL.                     00675000
006760     MOVE COM-KEY-IDNBR TO RPXXX05-KEY-IDNUMBER.                  00676000
006770     MOVE COM-RCIF-KEY TO RPXXX05-RCIF-KEY.                       00677000
006780     MOVE COM-CUST-NAME TO RPXXX05-CUST-NAME.                     00678000
006790     MOVE COM-REL-STAT TO RPXXX05-REL-STAT.                       00679000
006800     MOVE COM-IDNUMBER TO RPXXX05-IDNUMBER.                       00680000
006810     MOVE COM-MODEL-DESC TO RPXXX05-MODEL-DESC.                   00681000
006820     PERFORM PANEL-GET-RPV350.                                    00682000
006830     IF RPV350-ADDINST IS EQUAL TO LOW-VALUES                     00683000
006840         MOVE SPACES TO RPV350-ADDINST.                           00684000
006850     MOVE RPV350-ADDINST TO SR-JUSTIFYIN.                         00685000
006860     MOVE +0004 TO SR-JLGTH.                                      00686000
006870     PERFORM RIGHT-JUSTIFY.                                       00687000
006880     MOVE SR-JUSTIFYOUT TO RPXXX05-ADD-INST.                      00688000
006890     IF RPV350-ADDPROD IS EQUAL TO LOW-VALUES                     00689000
006900         MOVE SPACES TO RPV350-ADDPROD.                           00690000
006910     MOVE RPV350-ADDPROD TO RPXXX05-ADD-PRODCODE.                 00691000
006920     IF RPV350-ADDACCT IS EQUAL TO LOW-VALUES                     00692000
006930         MOVE SPACES TO RPV350-ADDACCT.                           00693000
006940     MOVE RPV350-ADDACCT TO SR-JUSTIFYIN.                         00694000
006950     MOVE +0018 TO SR-JLGTH.                                      00695000
006960     PERFORM RIGHT-JUSTIFY.                                       00696000
006970     MOVE SR-JUSTIFYOUT TO RPXXX05-ADD-ACCOUNT.                   00697000
006980 MPTR-EXIT.                                                       00698000
006990     EXIT.                                                        00699000
007000******************************************************************00700000
007010 BUILD-MAINT-PANEL SECTION.                                       00701000
007020 BMP-START.                                                       00702000
007030     MOVE COM-CUST-NAME TO RPV350-CUSTNA.                         00703000
007040     MOVE RPXXX05-KEY-MODEL TO RPV350-MODEL.                      00704000
007050     MOVE RPXXX05-MODEL-DESC TO RPV350-MODDESC.                   00705000
007060     MOVE RPXXX05-IDNUMBER TO RPV350-IDNBR.                       00706000
007070     IF RPXXX05-REL-STAT IS EQUAL TO 'A'                          00707000
007080         MOVE 'Active' TO RPV350-STATUS.                          00708000
007090     IF RPXXX05-REL-STAT IS EQUAL TO 'E'                          00709000
007100         MOVE 'Expired' TO RPV350-STATUS.                         00710000
007110     IF RPXXX05-REL-STAT IS EQUAL TO 'I'                          00711000
007120         MOVE 'Inactive' TO RPV350-STATUS.                        00712000
007130     MOVE RPXXX05-ADD-INST TO RPV350-ADDINST.                     00713000
007140     IF RPV350-ADDINST IS EQUAL TO SPACES                         00714000
007150         MOVE LOW-VALUES TO RPV350-ADDINST.                       00715000
007160     MOVE RPXXX05-ADD-PRODCODE TO RPV350-ADDPROD.                 00716000
007170     IF RPV350-ADDPROD IS EQUAL TO SPACES                         00717000
007180         MOVE LOW-VALUES TO RPV350-ADDPROD.                       00718000
007190     MOVE RPXXX05-ADD-ACCOUNT TO RPV350-ADDACCT.                  00719000
007200     IF RPV350-ADDACCT IS EQUAL TO SPACES                         00720000
007210         MOVE LOW-VALUES TO RPV350-ADDACCT.                       00721000
007220     MOVE PDB-RPV350-NAME TO PAN-NAME.                            00722000
007230 BMP-EXIT.                                                        00723000
007240     EXIT.                                                        00724000
007250******************************************************************00725000
007260 SET-DCHG-INDICATORS SECTION.                                     00726000
007270 SDI-START.                                                       00727000
007280     IF PDB-RPV350-ADDINST-DCHG IS EQUAL TO 'Y'                   00728000
007290         MOVE 'Y' TO COM-ADDINST-DCHG.                            00729000
007300     IF PDB-RPV350-ADDPROD-DCHG IS EQUAL TO 'Y'                   00730000
007310         MOVE 'Y' TO COM-ADDPROD-DCHG.                            00731000
007320     IF PDB-RPV350-ADDACCT-DCHG IS EQUAL TO 'Y'                   00732000
007330         MOVE 'Y' TO COM-ADDACCT-DCHG.                            00733000
007340 SDI-EXIT.                                                        00734000
007350     EXIT.                                                        00735000
007360******************************************************************00736000
007370 SET-ATTRIBUTES-AND-MESSAGES SECTION.                             00737000
007380 SAAM-START.                                                      00738000
007390     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00739000
007400     MOVE COM-ADDINST-DCHG TO WS-DCHG-TEST.                       00740000
007410     MOVE PDB-RPV350-ADDINST-VID TO PAN-SET-VID.                  00741000
007420     MOVE PDB-RPV350-ADDINST-EL TO PAN-SET-EMP.                   00742000
007430     MOVE PDB-RPV350-ADDINST TO PAN-SET-FLD.                      00743000
007440     PERFORM SET-ATTRIBUTE.                                       00744000
007450     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00745000
007460     MOVE COM-ADDPROD-DCHG TO WS-DCHG-TEST.                       00746000
007470     MOVE PDB-RPV350-ADDPROD-VID TO PAN-SET-VID.                  00747000
007480     MOVE PDB-RPV350-ADDPROD-EL TO PAN-SET-EMP.                   00748000
007490     MOVE PDB-RPV350-ADDPROD TO PAN-SET-FLD.                      00749000
007500     PERFORM SET-ATTRIBUTE.                                       00750000
007510     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00751000
007520     MOVE COM-ADDACCT-DCHG TO WS-DCHG-TEST.                       00752000
007530     MOVE PDB-RPV350-ADDACCT-VID TO PAN-SET-VID.                  00753000
007540     MOVE PDB-RPV350-ADDACCT-EL TO PAN-SET-EMP.                   00754000
007550     MOVE PDB-RPV350-ADDACCT TO PAN-SET-FLD.                      00755000
007560     PERFORM SET-ATTRIBUTE.                                       00756000
007570 SAAM-EXIT.                                                       00757000
007580     EXIT.                                                        00758000
007590******************************************************************00759000
007600 SET-ATTRIBUTE SECTION.                                           00760000
007610 SA-START.                                                        00761000
007620     IF WS-DCHG-EDITERR                                           00762000
007630         ADD +1 TO WS-ERROR-COUNT                                 00763000
007640         MOVE 'Y' TO WS-ERROR                                     00764000
007650         MOVE VIS-ERROR TO PAN-SET-VID                            00765000
007660         MOVE EMP-ERROR TO PAN-SET-EMP.                           00766000
007670     IF WS-DCHG-EDITERR                                           00767000
007680         AND WS-CURSOR-FIELD IS EQUAL TO SPACES                   00768000
007690         MOVE PAN-SET-FLD TO WS-CURSOR-FIELD                      00769000
007700         MOVE PAN-SET-OCC TO WS-CURSOR-OCC.                       00770000
007710     IF WS-DCHG-PROTECT                                           00771000
007720         MOVE VIS-DISPLAY TO PAN-SET-VID                          00772000
007730         MOVE EMP-NORMAL TO PAN-SET-EMP.                          00773000
007740     IF WS-DCHG-HIDDEN                                            00774000
007750         MOVE VIS-DISPLAY TO PAN-SET-VID                          00775000
007760         MOVE EMP-HIDDEN TO PAN-SET-EMP.                          00776000
007770     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00777000
007780     PERFORM CALL-BISPAN-RPV350.                                  00778000
007790 SA-EXIT.                                                         00779000
007800     EXIT.                                                        00780000
007810******************************************************************00781000
007820 MORE-DATA-PANELS SECTION.                                        00782000
007830 MDP-START.                                                       00783000
007840     GO TO PANEL-ROUTER.                                          00784000
007850 MDP-EXIT.                                                        00785000
007860     EXIT.                                                        00786000
007870******************************************************************00787000
007880 CLOSE-TRANSACTION SECTION.                                       00788000
000000 COPY SRP0722.                                                    00789000
007900******************************************************************00790000
007910 PANEL-INIT SECTION.                                              00791000
000000 COPY SRP073.                                                     00792000
007930******************************************************************00793000
007940 BUILD-NEXTKEY SECTION.                                           00794000
007950 BXN-START.                                                       00795000
007960     MOVE SPACES TO WS-NEXTKEY.                                   00796000
007970     MOVE ',' TO WS-DELIM1.                                       00797000
007980     MOVE ',' TO WS-DELIM2.                                       00798000
007990     MOVE ',' TO WS-DELIM3.                                       00799000
008000     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00800000
008010     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00801000
008020         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00802000
008030     ELSE                                                         00803000
008040         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00804000
008050     MOVE COM-KEY-MODEL TO WS-MODEL.                              00805000
008060     MOVE COM-EXTERNALID TO WS-EXTID.                             00806000
008070 BXN-EXIT.                                                        00807000
008080     EXIT.                                                        00808000
008090******************************************************************00809000
008100 ABORT-EXIT SECTION.                                              00810000
008110 AE-START.                                                        00811000
008120     MOVE EIBFN TO COM-ABEIBFN.                                   00812000
008130     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00813000
008140     GO TO CICS-ABORT-EXIT.                                       00814000
008150 AE-EXIT.                                                         00815000
008160     EXIT.                                                        00816000
008170******************************************************************00817000
008180 RPXXX05-LINK-MESSAGE SECTION.                                    00818000
008190 CRLM-START.                                                      00819000
008200     MOVE 'Y' TO RPXXX05-GLOBAL-CLOSE.                            00820000
008210     MOVE WS-FILEOPTIONS TO RPXXX05-FILEOPTS.                     00821000
008220     MOVE COM-RETURN TO RPXXX05-RETURN.                           00822000
008230     MOVE COM-DATE TO RPXXX05-DATE.                               00823000
008240     MOVE COM-MODELID TO RPXXX05-MODELID.                         00824000
008250     MOVE COM-SECALT TO RPXXX05-SECALT.                           00825000
008260     MOVE COM-EXTERNALID TO RPXXX05-EXTERNALID.                   00826000
008270     MOVE COM-EIBTRMID TO RPXXX05-TERMID.                         00827000
008280     MOVE COM-WKUNAME TO RPXXX05-WORKID.                          00828000
008290     MOVE COM-TRANSTART TO RPXXX05-TRANSTART.                     00829000
008300     MOVE COM-UPDATE TO RPXXX05-UPDATE.                           00830000
008310     MOVE COM-APPLSEQ TO RPXXX05-APPLSEQ.                         00831000
008320     MOVE WS-RPSAPPLNBR TO RPXXX05-APPL.                          00832000
008330     MOVE 'M' TO RPXXX05-FUNC.                                    00833000
008340     MOVE COM-INST TO RPXXX05-KEY-INST.                           00834000
008350     MOVE COM-PRODCODE TO RPXXX05-KEY-PRODCODE.                   00835000
008360     MOVE COM-KEY-ACCOUNT TO RPXXX05-KEY-ACCOUNT.                 00836000
008370     MOVE COM-KEY-MODEL TO RPXXX05-KEY-MODEL.                     00837000
008380     IF COM-KEY-MODEL IS EQUAL TO LOW-VALUES                      00838000
008390         MOVE SPACES TO RPXXX05-KEY-MODEL.                        00839000
008400     IF COM-KEY-IDNBR IS NUMERIC                                  00840000
008410         AND COM-KEY-IDNBR IS GREATER THAN ZEROS                  00841000
008420         MOVE COM-KEY-IDNBR TO RPXXX05-KEY-IDNUMBER               00842000
008430         MOVE 'Y' TO RPXXX05-KEY-IDNUMBER-DCHG.                   00843000
008440     MOVE COM-OPERID TO RPXXX05-OPERID.                           00844000
008450     MOVE COM-LANG TO RPXXX05-COM-LANG.                           00845000
008460     MOVE COM-CURN-CODE TO RPXXX05-COM-CURNCD.                    00846000
008470     MOVE COM-INST-OPTS TO RPXXX05-INST-OPTS.                     00847000
008480     EXEC CICS LINK                                               00848000
008490         PROGRAM('RPLXXX05')                                      00849000
008500         COMMAREA(RPXXX05-MESSAGE)                                00850000
008510         LENGTH(LENGTH OF RPXXX05-MESSAGE)                        00851000
008520         RESP(WS-CICS-RESPONSE)                                   00852000
008530         END-EXEC.                                                00853000
008540     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00854000
008550         MOVE 'RPLXXX05 LINK FAILED' TO COM-ABMSG                 00855000
008560         MOVE WS-TR0002 TO COM-ABTRACE                            00856000
008570         MOVE WS-AB0009 TO COM-ABORT                              00857000
008580         GO TO CICS-ABORT-EXIT.                                   00858000
008590     MOVE RPXXX05-FUNCTION TO WS-FUNCTION.                        00859000
008600     IF RPXXX05-ABORT IS NOT EQUAL TO ZERO                        00860000
008610         MOVE RPXXX05-ABORT TO COM-ABORT                          00861000
008620         MOVE RPXXX05-ABTRACE TO COM-ABTRACE                      00862000
008630         MOVE RPXXX05-ABEIBFN TO COM-ABEIBFN                      00863000
008640         MOVE RPXXX05-ABEIBRCODE TO COM-ABEIBRCODE                00864000
008650         MOVE RPXXX05-ABPROGID TO COM-ABPROGID                    00865000
008660         MOVE RPXXX05-SRBMDB TO COM-SRBMDB                        00866000
008670         MOVE RPXXX05-ABTYPE TO COM-ABTYPE                        00867000
008680         MOVE RPXXX05-ABMSG TO COM-ABMSG                          00868000
008690         GO TO CICS-ABORT-EXIT.                                   00869000
008700     MOVE RPXXX05-FUNC TO COM-FUNC.                               00870000
008710     MOVE RPXXX05-ABORT TO COM-ABORT.                             00871000
008720     MOVE RPXXX05-MSGNBR TO WS-MSGNBR.                            00872000
008730 CRLM-EXIT.                                                       00873000
008740     EXIT.                                                        00874000
008750******************************************************************00875000
008760 CLOSE-PANEL SECTION.                                             00876000
008770 CP-START.                                                        00877000
008780     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00878000
008790     IF COM-RETURN IS EQUAL TO 'E'                                00879000
008800         PERFORM CALL-BISPAN-RPV350K.                             00880000
008810     IF COM-RETURN IS EQUAL TO '1'                                00881000
008820         PERFORM CALL-BISPAN-RPV350.                              00882000
008830 CP-EXIT.                                                         00883000
008840     EXIT.                                                        00884000
008850******************************************************************00885000
008860 CALL-BISPAN-RPV350K SECTION.                                     00886000
008870 CBD1-START.                                                      00887000
008880     CALL 'BISPAN' USING                                          00888000
008890         BICRPSB,                                                 00889000
008900         BICRSRB,                                                 00890000
008910         BICRPAN,                                                 00891000
008920         RPV350K-PANL-DATA-BLOCK,                                 00892000
008930         RPV350K-PANL-DATA-AREA.                                  00893000
008940 CBD1-EXIT.                                                       00894000
008950     EXIT.                                                        00895000
008960******************************************************************00896000
008970 CALL-BISPAN-RPV350 SECTION.                                      00897000
008980 CBD2-START.                                                      00898000
008990     CALL 'BISPAN' USING                                          00899000
009000         BICRPSB,                                                 00900000
009010         BICRSRB,                                                 00901000
009020         BICRPAN,                                                 00902000
009030         RPV350-PANL-DATA-BLOCK,                                  00903000
009040         RPV350-PANL-DATA-AREA.                                   00904000
009050 CBD2-EXIT.                                                       00905000
009060     EXIT.                                                        00906000
009070******************************************************************00907000
009080 PANEL-GET-RPV350 SECTION.                                        00908000
009090 PANEL-GET-RPV350-START.                                          00909000
009100     MOVE 'N' TO RPV350-SW-SET-CURSOR.                            00910000
009110     MOVE PDB-RPV350-NAME TO PAN-NAME.                            00911000
009120     MOVE REQ-GET TO PAN-REQ-VERB.                                00912000
009130     CALL 'BISPAN' USING                                          00913000
009140         BICRPSB                                                  00914000
009150         BICRSRB                                                  00915000
009160         BICRPAN                                                  00916000
009170         RPV350-PANL-DATA-BLOCK,                                  00917000
009180         RPV350-PANL-DATA-AREA.                                   00918000
009190 PANEL-GET-RPV350-EXIT.                                           00919000
009200     EXIT.                                                        00920000
009210******************************************************************00921000
009220 PANEL-PUT-RPV350 SECTION.                                        00922000
009230 PANEL-PUT-RPV350-START.                                          00923000
009240     MOVE PDB-RPV350-NAME TO PAN-NAME.                            00924000
009250     MOVE REQ-PUT TO PAN-REQ-VERB.                                00925000
009260     CALL 'BISPAN' USING                                          00926000
009270         BICRPSB                                                  00927000
009280         BICRSRB                                                  00928000
009290         BICRPAN                                                  00929000
009300         RPV350-PANL-DATA-BLOCK,                                  00930000
009310         RPV350-PANL-DATA-AREA.                                   00931000
009320 PANEL-PUT-RPV350-EXIT.                                           00932000
009330     EXIT.                                                        00933000
009340******************************************************************00934000
009350 PANEL-GET-RPV350K SECTION.                                       00935000
009360 PANEL-GET-RPV350K-START.                                         00936000
009370     MOVE 'N' TO RPV350K-SW-SET-CURSOR.                           00937000
009380     MOVE PDB-RPV350K-NAME TO PAN-NAME.                           00938000
009390     MOVE REQ-GET TO PAN-REQ-VERB.                                00939000
009400     CALL 'BISPAN' USING                                          00940000
009410         BICRPSB                                                  00941000
009420         BICRSRB                                                  00942000
009430         BICRPAN                                                  00943000
009440         RPV350K-PANL-DATA-BLOCK,                                 00944000
009450         RPV350K-PANL-DATA-AREA.                                  00945000
009460 PANEL-GET-RPV350K-EXIT.                                          00946000
009470     EXIT.                                                        00947000
009480******************************************************************00948000
009490 PANEL-PUT-RPV350K SECTION.                                       00949000
009500 PANEL-PUT-RPV350K-START.                                         00950000
009510     MOVE PDB-RPV350K-NAME TO PAN-NAME.                           00951000
009520     MOVE REQ-PUT TO PAN-REQ-VERB.                                00952000
009530     CALL 'BISPAN' USING                                          00953000
009540         BICRPSB                                                  00954000
009550         BICRSRB                                                  00955000
009560         BICRPAN                                                  00956000
009570         RPV350K-PANL-DATA-BLOCK,                                 00957000
009580         RPV350K-PANL-DATA-AREA.                                  00958000
009590 PANEL-PUT-RPV350K-EXIT.                                          00959000
009600     EXIT.                                                        00960000
009610******************************************************************00961000
009620 MIC-MST-API SECTION.                                             00962000
000000 COPY MIPMSTA.                                                    00963000
009640******************************************************************00964000
009650 EDIT-ACCOUNT-KEY SECTION.                                        00965000
009660 EAK-START.                                                       00966000
009670     MOVE COM-INST TO RPW130-INST.                                00967000
009680     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 00968000
009690     MOVE COM-KEY-PRODCODE TO RPW130-PRODCODE.                    00969000
009700     MOVE COM-KEY-ACCOUNT TO RPW130-ACCOUNTINPUT.                 00970000
009710     MOVE 'V' TO RPW130-FUNCTION.                                 00971000
009720     PERFORM ACCOUNT-KEY-EDIT.                                    00972000
009730     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00973000
009740         MOVE '500003' TO WS-MSGNBR                               00974000
009750         GO TO EAK-EXIT.                                          00975000
009760     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00976000
009770     MOVE RPW130-ACCOUNTKEY TO COM-KEY-ACCOUNT.                   00977000
009780     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          00978000
009790     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      00979000
009800     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                00980000
009810 EAK-EXIT.                                                        00981000
009820     EXIT.                                                        00982000
009830******************************************************************00983000
009840 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 00984000
000000 COPY RPP033.                                                     00985000
009860******************************************************************00986000
009870 ACCOUNT-KEY-EDIT SECTION.                                        00987000
000000 COPY RPP130.                                                     00988000
009890******************************************************************00989000
009900 LEFT-JUSTIFY SECTION.                                            00990000
000000 COPY SRP068.                                                     00991000
009920******************************************************************00992000
009930 RIGHT-JUSTIFY SECTION.                                           00993000
000000 COPY SRP026.                                                     00994000
009950******************************************************************00995000
009960 PARAMETER-SEARCH SECTION.                                        00996000
000000 COPY SRP030.                                                     00997000
009980******************************************************************00998000
009990 COMPRESS-NEXTKEY SECTION.                                        00999000
000000 COPY SRP070.                                                     01000000
010010******************************************************************01001000
010020 GET-MESSAGE SECTION.                                             01002000
000000 COPY SRP071.                                                     01003000
010040******************************************************************01004000
010050 EDIT-CODASYL-DATE SECTION.                                       01005000
000000 COPY SRP087.                                                     01006000
010070******************************************************************01007000
010080 EXAMINE-FIELD SECTION.                                           01008000
000000 COPY SRP166.                                                     01009000
010100******************************************************************01010000
010110 SRP170-ROUTINE SECTION.                                          01011000
000000 COPY SRP170.                                                     01012000
010130******************************************************************01013000
010140 BUILD-PFKEY-LINE SECTION.                                        01014000
000000 COPY SRP710.                                                     01015000
010160******************************************************************01016000
010170 VALIDATE-PFKEYS SECTION.                                         01017000
000000 COPY SRP711.                                                     01018000
010190******************************************************************01019000
010200 SLP096-GET-2023-RECORD SECTION.                                  01020000
000000 COPY SLP096.                                                     01021000
010220******************************************************************01022000
010230 CICS-XCTL SECTION.                                               01023000
000000 COPY SLP704.                                                     01024000
010250******************************************************************01025000
010260 CICS-RETURN-TRANSID SECTION.                                     01026000
000000 COPY SLP710.                                                     01027000
010280******************************************************************01028000
010290 TSQ-DELETE SECTION.                                              01029000
010300 TSQD-START.                                                      01030000
010310 TSQD-EXIT.                                                       01031000
010320     EXIT.                                                        01032000
010330******************************************************************01033000
010340 CICS-TSQ-READ SECTION.                                           01034000
000000 COPY SLP744.                                                     01035000
010360******************************************************************01036000
010370 CICS-ABORT-EXIT SECTION.                                         01037000
000000 COPY SLP798.                                                     01038000
010390******************************************************************01039000
