000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL365.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL365 - ACCOUNT INCENTIVE OVERRIDE                         *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRCONS.                                                    00024000
000000 COPY BICRCONS.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRPAN.                                                     00028000
000000 COPY BICRPAN.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  RPV365K-PANL-DATA-BLOCK.                                     00032000
000000 COPY RPV365KW.                                                   00033000
000340 01  RPV365-PANL-DATA-BLOCK.                                      00034000
000000 COPY RPV365W.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00037000
000380     03  WS-NEXTKEY.                                              00038000
000390         05  WS-EXTID            PIC X(08).                       00039000
000400         05  WS-DELIM1           PIC X(01)       VALUE ','.       00040000
000410         05  WS-DATA.                                             00041000
000420             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00042000
000430             07  WS-DELIM2       PIC X(01)       VALUE ','.       00043000
000440             07  WS-ACCTX.                                        00044000
000450                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00045000
000460             07  WS-DELIM3       PIC X(01)       VALUE ','.       00046000
000470             07  WS-MODEL        PIC X(10)       VALUE SPACES.    00047000
000480         05  FILLER              PIC X(33)       VALUE SPACES.    00048000
000490     03  WS-MORE                 PIC X(05)       VALUE 'More:'.   00049000
000500     03  WS-LNKPROG1             PIC X(08)       VALUE 'RPLXXX10'.00050000
000510     03  WS-LKLGTH               PIC S9(04)      COMP             00051000
000520                                                 VALUE +4088.     00052000
000530     03  WS-DCHG-TEST            PIC X(01)       VALUE SPACE.     00053000
000540         88  WS-DCHG-PROTECT                     VALUE 'P'.       00054000
000550         88  WS-DCHG-EDITERR                     VALUE 'E'.       00055000
000560         88  WS-DCHG-HIDDEN                      VALUE 'H'.       00056000
000570     03  WS-ERROR-COUNT          PIC S9(04)      COMP             00057000
000580                                                 VALUE ZERO.      00058000
000590     03  WS-PDATE                PIC 9(08).                       00059000
000600     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00060000
000610         05  WS-PDATE-YYYY       PIC 9(04).                       00061000
000620         05  WS-PDATE-MM         PIC 9(02).                       00062000
000630         05  WS-PDATE-DD         PIC 9(02).                       00063000
000640     03  WS-SUB1                 PIC S9(04)      COMP             00064000
000650                                                 VALUE +0000.     00065000
000660     03  WS-SUB2                 PIC S9(04)      COMP             00066000
000670                                                 VALUE +0000.     00067000
000680 01  WS-LINKMSG                  PIC X(4500).                     00068000
000690 01  RPXXX10-MESSAGE.                                             00069000
000000 COPY MISCNT00      REPLACING                                     00070000
000710             ==:MICNT:== BY ==RPXXX10==.                          00071000
000000 COPY RPSXXX10.                                                   00072000
000730 01  WS-TSQAREAS.                                                 00073000
000740     03  WS-TSQITEM              PIC S9(04)      COMP             00074000
000750                                                 VALUE +0001.     00075000
000760     03  WS-TSQLGTH              PIC S9(04)      COMP             00076000
000770                                                 VALUE +4096.     00077000
000780     03  WS-TSQKEY.                                               00078000
000790         05  WS-TSQID            PIC X(04).                       00079000
000800         05  WS-TSQTRMID         PIC X(04).                       00080000
000810 01  LS-TSQAREA.                                                  00081000
000820     03  LS-TSQKEY               PIC X(08).                       00082000
000830     03  LS-TSQDATA              PIC X(4088).                     00083000
000840 01  MIWPRI-AREAS.                                                00084000
000000 COPY MIWPRI.                                                     00085000
000860 01  MIWMSTA-AREAS.                                               00086000
000000 COPY MIWMSTA.                                                    00087000
000880 01  MIMST-RECORD.                                                00088000
000000 COPY MISMST.                                                     00089000
000900 01  MI2023-RECORD.                                               00090000
000000 COPY MIS2023A.                                                   00091000
000920 01  WS-ABORTCODES.                                               00092000
000930     03  WS-AB0009               PIC S9(04)      COMP             00093000
000940                                                 VALUE +0009.     00094000
000950     03  WS-AB0106               PIC S9(04)      COMP             00095000
000960                                                 VALUE +0106.     00096000
000970     03  WS-AB2033               PIC S9(04)      COMP             00097000
000980                                                 VALUE +2033.     00098000
000990     03  WS-AB6345               PIC S9(04)      COMP             00099000
001000                                                 VALUE +6345.     00100000
001010 01  WS-TRACECODES.                                               00101000
001020     03  WS-TR0001               PIC S9(04)      COMP             00102000
001030                                                 VALUE +0001.     00103000
001040     03  WS-TR0002               PIC S9(04)      COMP             00104000
001050                                                 VALUE +0002.     00105000
001060 01  SLW096-AREAS.                                                00106000
000000 COPY SLW096.                                                     00107000
001080 01  RPW014-AREAS.                                                00108000
000000 COPY RPW014.                                                     00109000
001100 01  RPW033-AREAS.                                                00110000
000000 COPY RPW033.                                                     00111000
001120 01  RPW130-AREAS.                                                00112000
000000 COPY RPW130.                                                     00113000
001140 01  SRW000-AREAS.                                                00114000
000000 COPY SRW000.                                                     00115000
001160 01  SRW025-AREAS.                                                00116000
000000 COPY SRW025.                                                     00117000
001180 01  SRW030-AREAS.                                                00118000
000000 COPY SRW030.                                                     00119000
001200 01  SRW031-AREAS.                                                00120000
000000 COPY SRW031.                                                     00121000
001220 01  SRW067-AREAS.                                                00122000
000000 COPY SRW067.                                                     00123000
001240 01  SRW105-AREAS.                                                00124000
000000 COPY SRW105.                                                     00125000
001260 01  SRW161-AREAS.                                                00126000
000000 COPY SRW161.                                                     00127000
001280 01  SRW166-AREAS.                                                00128000
000000 COPY SRW166.                                                     00129000
001300 01  SRW170-AREAS.                                                00130000
000000 COPY SRW170.                                                     00131000
001320 COPY DFHAID.                                                     00132000
001330******************************************************************00133000
001340 LINKAGE SECTION.                                                 00134000
001350 01  DFHCOMMAREA.                                                 00135000
000000 COPY SLS1112.                                                    00136000
001370     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00137000
001380         05  COM-EDIT-DATE       PIC X(10).                       00138000
001390         05  COM-KEY-FIELDS.                                      00139000
001400             07  COM-KEY-INST    PIC 9(04).                       00140000
001410             07  COM-KEY-PRODCODE                                 00141000
001420                                 PIC X(06).                       00142000
001430             07  COM-KEY-ACCOUNT PIC X(18).                       00143000
001440             07  COM-KEY-ACCOUNT-N                                00144000
001450                         REDEFINES COM-KEY-ACCOUNT                00145000
001460                                 PIC 9(18).                       00146000
001470             07  COM-KEY-MODEL                                    00147000
001480                                 PIC X(10).                       00148000
001490         05  COM-NBR-OCCURS      PIC S9(05)      COMP-3.          00149000
001500         05  COM-END-FILE-INST   PIC X(01).                       00150000
001510         05  COM-PANEL-ACTION    PIC X(01).                       00151000
001520             88  INITIAL-PANEL                   VALUE ' '.       00152000
001530             88  EDIT-PANEL                      VALUE 'E'.       00153000
001540         05  COM-FROM-PANEL      PIC X(01).                       00154000
001550             88  FROM-KEY-PANEL                  VALUE 'K'.       00155000
001560             88  FROM-MAINT-PANEL                VALUE 'M'.       00156000
001570             88  FROM-HELP                       VALUE 'H'.       00157000
001580             88  FROM-BREAKAWAY                  VALUE 'B'.       00158000
001590         05  COM-KEY-FORMATTEDACCT                                00159000
001600                                 PIC X(22).                       00160000
001610         05  COM-KEY-MSGNBR      PIC X(06).                       00161000
001620         05  COM-KEY-COMMAND     PIC X(50).                       00162000
001630         05  COM-MODEL           PIC X(10).                       00163000
001640         05  COM-MODEL-DESC      PIC X(20).                       00164000
001650         05  COM-FIRST-KEY       PIC X(66).                       00165000
001660         05  COM-SELECT-KEY      PIC X(66).                       00166000
001670         05  COM-LAST-KEY        PIC X(66).                       00167000
001680         05  COM-MORE            PIC X(01).                       00168000
001690         05  COM-FIRSTSW         PIC X(01).                       00169000
001700         05  COM-SK-INST2-DCHG   PIC X(01).                       00170000
001710         05  COM-SK-PRODCODE2-DCHG                                00171000
001720                                 PIC X(01).                       00172000
001730         05  COM-SK-ACCOUNT2-DCHG                                 00173000
001740                                 PIC X(01).                       00174000
001750         05  COM-DISCAMT-OVRD-FLAG                                00175000
001760                                 PIC X(01).                       00176000
001770         05  COM-DISCPCT-OVRD-FLAG                                00177000
001780                                 PIC X(01).                       00178000
001790         05  COM-RATEPCT-OVRD-FLAG                                00179000
001800                                 PIC X(01).                       00180000
001810         05  COM-DISCAMT-OVRD    PIC S9(09)V99   COMP-3.          00181000
001820         05  COM-DISCPCT-OVRD    PIC SV9(05).                     00182000
001830         05  COM-RATEPCT-OVRD    PIC SV9(05).                     00183000
001840         05  COM-DISCOUNT-AMOUNT PIC S9(09)V99   COMP-3.          00184000
001850         05  COM-DISCOUNT-PERCENT                                 00185000
001860                                 PIC SV9(05).                     00186000
001870         05  COM-RATE-PERCENT    PIC SV9(05).                     00187000
001880         05  COM-DCHG.                                            00188000
001890             07  COM-ACTION1-DCHG                                 00189000
001900                                 PIC X(01).                       00190000
001910             07  COM-INCENT1-DCHG                                 00191000
001920                                 PIC X(01).                       00192000
001930             07  COM-ACTION2-DCHG                                 00193000
001940                                 PIC X(01).                       00194000
001950             07  COM-INCENT2-DCHG                                 00195000
001960                                 PIC X(01).                       00196000
001970             07  COM-ACTION3-DCHG                                 00197000
001980                                 PIC X(01).                       00198000
001990             07  COM-INCENT3-DCHG                                 00199000
002000                                 PIC X(01).                       00200000
002010******************************************************************00201000
002020*01  SLW096-2023RECORDS.                                          00202000
000000 COPY SLW096L.                                                    00203000
002040******************************************************************00204000
002050 PROCEDURE DIVISION.                                              00205000
002060******************************************************************00206000
002070 ENTRY-ROUTINE SECTION.                                           00207000
002080     MOVE 'RPL365' TO COM-ABPROGID.                               00208000
000000 COPY SLP771.                                                     00209000
002100******************************************************************00210000
002110 TRANSACTION-CLEAN-UP SECTION.                                    00211000
002120 TCU-START.                                                       00212000
002130 TCU-EXIT.                                                        00213000
002140     EXIT.                                                        00214000
002150******************************************************************00215000
002160 CICS-HANDLE-CONDITION SECTION.                                   00216000
000000 COPY SLP772.                                                     00217000
002180     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00218000
002190         GO TO CTSRI-EXIT.                                        00219000
002200     MOVE WS-AB2033 TO COM-ABORT.                                 00220000
002210     MOVE WS-TR0001 TO COM-ABTRACE.                               00221000
002220     GO TO ABORT-EXIT.                                            00222000
002230 CHC-EXIT.                                                        00223000
002240     EXIT.                                                        00224000
002250******************************************************************00225000
002260 ROUTING-ROUTINE SECTION.                                         00226000
002270 RR-START.                                                        00227000
002280     MOVE LOW-VALUES TO RPXXX10-MESSAGE.                          00228000
002290     MOVE LOW-VALUES TO RPV365-PANL-DATA-AREA.                    00229000
002300     MOVE LOW-VALUES TO RPV365K-PANL-DATA-AREA.                   00230000
002310     MOVE ALL ZEROS TO WS-MSGNBR.                                 00231000
002320     IF COM-RETURN IS EQUAL TO 'B'                                00232000
002330         OR COM-BKPGRMID IS EQUAL TO SPACE                        00233000
002340         MOVE 'RP00' TO WS-TSQFILEID                              00234000
002350     ELSE                                                         00235000
002360         MOVE 'RP01' TO WS-TSQFILEID.                             00236000
002370     MOVE 'RPI' TO WS-TSQSYSID.                                   00237000
002380     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00238000
002390     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00239000
002400     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00240000
002410         MOVE COM-PAN TO BICRPAN                                  00241000
002420         MOVE COM-PSB TO BICRPSB                                  00242000
002430         MOVE COM-SRB TO BICRSRB                                  00243000
002440     ELSE                                                         00244000
002450         MOVE '1' TO BPSB-LEVEL.                                  00245000
002460     IF COM-RETURN IS EQUAL TO 'B'                                00246000
002470         GO TO BREAKAWAY-RETURN.                                  00247000
002480     IF COM-RETURN IS EQUAL TO '0'                                00248000
002490         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00249000
002500         MOVE SPACES TO COM-WORKAREAS                             00250000
002510         MOVE '1' TO SRB-VERSION                                  00251000
002520         MOVE 'IPRP' TO SRB-APPL-ID                               00252000
002530         MOVE 'RPL365' TO SRB-PROG-ID                             00253000
002540         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00254000
002550         MOVE 'P' TO PAN-TYPE                                     00255000
002560         MOVE SPACE TO PAN-OVERLAY                                00256000
002570         MOVE SPACE TO PAN-CLOSE                                  00257000
002580         MOVE SPACE TO PAN-ALARM                                  00258000
002590         MOVE SPACE TO PAN-CURSOR-PAN                             00259000
002600         MOVE SPACE TO PAN-CURSOR-FLD                             00260000
002610         MOVE SPACE TO PAN-SET-FLD                                00261000
002620         MOVE SPACE TO PAN-SET-VID                                00262000
002630         MOVE SPACE TO PAN-SET-EMP                                00263000
002640         MOVE PDB-RPV365K-NAME TO PAN-NAME                        00264000
002650         PERFORM PANEL-INIT                                       00265000
002660         MOVE BICRPAN TO COM-PAN                                  00266000
002670         MOVE BICRPSB TO COM-PSB                                  00267000
002680         MOVE BICRSRB TO COM-SRB                                  00268000
002690         PERFORM INITIALIZE-DATE                                  00269000
002700         GO TO PANEL-ROUTER.                                      00270000
002710     PERFORM PANEL-NAME-SET.                                      00271000
002720     IF COM-HELPSW IS EQUAL TO 'Y'                                00272000
002730         GO TO HELP-RETURN.                                       00273000
002740     PERFORM PANEL-RECEIVE.                                       00274000
002750     PERFORM PANEL-DATA-GET.                                      00275000
002760     IF FROM-MAINT-PANEL                                          00276000
002770         PERFORM SET-DCHG-INDICATORS.                             00277000
002780     PERFORM PANEL-PFKEY-SET.                                     00278000
002790     PERFORM VALIDATE-PFKEYS.                                     00279000
002800     IF EIBAID IS EQUAL TO DFHPF1                                 00280000
002810         GO TO GET-HELP.                                          00281000
002820     IF EIBAID IS EQUAL TO DFHPF11                                00282000
002830         GO TO BREAK-AWAY.                                        00283000
002840     IF COM-RETURN IS EQUAL TO 'E'                                00284000
002850         AND (EIBAID IS EQUAL TO DFHPF2                           00285000
002860         OR EIBAID IS EQUAL TO DFHPF3                             00286000
002870         OR EIBAID IS EQUAL TO DFHPF4                             00287000
002880         OR EIBAID IS EQUAL TO DFHPF7                             00288000
002890         OR EIBAID IS EQUAL TO DFHPF8                             00289000
002900         OR EIBAID IS EQUAL TO DFHPF12)                           00290000
002910         GO TO CLOSE-TRANSACTION.                                 00291000
002920     IF COM-RETURN IS EQUAL TO '1'                                00292000
002930         AND EIBAID IS EQUAL TO DFHPF12                           00293000
002940         GO TO CLOSE-TRANSACTION.                                 00294000
002950     IF COM-RETURN IS EQUAL TO '0'                                00295000
002960         OR COM-RETURN IS EQUAL TO 'E'                            00296000
002970         OR COM-RETURN IS EQUAL TO '1'                            00297000
002980         GO TO PANEL-ROUTER.                                      00298000
002990 RR-END.                                                          00299000
003000     GO TO CLOSE-TRANSACTION.                                     00300000
003010 RR-EXIT.                                                         00301000
003020     EXIT.                                                        00302000
003030******************************************************************00303000
003040 INITIALIZE-DATE SECTION.                                         00304000
003050 ID-START.                                                        00305000
003060     MOVE COM-DATE TO WS-CURDATE8.                                00306000
003070     MOVE '-' TO WS-CD8DSH1.                                      00307000
003080     MOVE '-' TO WS-CD8DSH2.                                      00308000
003090     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00309000
003100 ID-EXIT.                                                         00310000
003110     EXIT.                                                        00311000
003120******************************************************************00312000
003130 PANEL-NAME-SET SECTION.                                          00313000
003140 PNS-START.                                                       00314000
003150     IF COM-RETURN IS EQUAL TO '0'                                00315000
003160         MOVE PDB-RPV365K-NAME TO PAN-NAME.                       00316000
003170     IF COM-RETURN IS EQUAL TO 'E'                                00317000
003180         MOVE PDB-RPV365K-NAME TO PAN-NAME.                       00318000
003190     IF COM-RETURN IS EQUAL TO '1'                                00319000
003200         MOVE PDB-RPV365-NAME TO PAN-NAME.                        00320000
003210 PNS-EXIT.                                                        00321000
003220     EXIT.                                                        00322000
003230******************************************************************00323000
003240 PANEL-DATA-GET SECTION.                                          00324000
003250 PDG-START.                                                       00325000
003260     IF COM-RETURN IS EQUAL TO '0'                                00326000
003270         PERFORM PANEL-GET-RPV365K.                               00327000
003280     IF COM-RETURN IS EQUAL TO 'E'                                00328000
003290         PERFORM PANEL-GET-RPV365K                                00329000
003300         MOVE RPV365K-COMMAND TO WS-NEXTKEY                       00330000
003310         MOVE PDB-RPV365K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00331000
003320     IF COM-RETURN IS EQUAL TO '1'                                00332000
003330         PERFORM PANEL-GET-RPV365                                 00333000
003340         MOVE RPV365-COMMAND TO WS-NEXTKEY                        00334000
003350         MOVE PDB-RPV365-COMMAND-DCHG TO WS-COMMAND-DCHG.         00335000
003360 PDG-EXIT.                                                        00336000
003370     EXIT.                                                        00337000
003380******************************************************************00338000
003390 PANEL-PFKEY-SET SECTION.                                         00339000
003400 PPS-START.                                                       00340000
003410     IF COM-UPDATE IS EQUAL TO 'Y'                                00341000
003420         AND COM-RETURN IS EQUAL TO '1'                           00342000
003430         MOVE 'A' TO WS-PF9-FLG.                                  00343000
003440 PPS-EXIT.                                                        00344000
003450     EXIT.                                                        00345000
003460******************************************************************00346000
003470 PANEL-ROUTER SECTION.                                            00347000
003480 PR-START.                                                        00348000
003490     IF COM-RETURN IS EQUAL TO '0'                                00349000
003500         GO TO PROCESS-KEY-PANEL.                                 00350000
003510     IF COM-RETURN IS EQUAL TO 'E'                                00351000
003520         GO TO PROCESS-KEY-PANEL.                                 00352000
003530     IF COM-RETURN IS EQUAL TO '1'                                00353000
003540         GO TO PROCESS-MAINT-PANEL.                               00354000
003550     GO TO CLOSE-TRANSACTION.                                     00355000
003560 PR-EXIT.                                                         00356000
003570     EXIT.                                                        00357000
003580******************************************************************00358000
003590 HELP-RETURN SECTION.                                             00359000
000000 COPY SRP074.                                                     00360000
003610******************************************************************00361000
003620 HELP-RETURN-FINISH SECTION.                                      00362000
003630 HRF-START.                                                       00363000
003640     PERFORM PANEL-DATA-GET.                                      00364000
003650     MOVE 'H' TO COM-FROM-PANEL.                                  00365000
003660     GO TO PANEL-ROUTER.                                          00366000
003670 HRF-EXIT.                                                        00367000
003680     EXIT.                                                        00368000
003690******************************************************************00369000
003700 HELP-MISSING-FINISH SECTION.                                     00370000
003710 HMF-START.                                                       00371000
003720     MOVE 'H' TO COM-FROM-PANEL.                                  00372000
003730     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00373000
003740     GO TO PANEL-ROUTER.                                          00374000
003750 HMF-EXIT.                                                        00375000
003760     EXIT.                                                        00376000
003770******************************************************************00377000
003780 BREAK-AWAY SECTION.                                              00378000
000000 COPY SRP0752.                                                    00379000
003800******************************************************************00380000
003810 BREAKAWAY-RETURN-FINISH SECTION.                                 00381000
003820 BRF-START.                                                       00382000
003830     PERFORM PANEL-DATA-GET.                                      00383000
003840     MOVE 'B' TO COM-FROM-PANEL.                                  00384000
003850     GO TO PANEL-ROUTER.                                          00385000
003860 BRF-EXIT.                                                        00386000
003870     EXIT.                                                        00387000
003880******************************************************************00388000
003890 PROCESS-KEY-PANEL SECTION.                                       00389000
003900 PKP-START.                                                       00390000
003910     IF INITIAL-PANEL                                             00391000
003920         MOVE COM-NEXTKEY TO COM-EXTERNALID                       00392000
003930         GO TO PKP-CONTINUE.                                      00393000
003940     IF EDIT-PANEL                                                00394000
003950         AND FROM-MAINT-PANEL                                     00395000
003960         MOVE SPACE TO COM-FROM-PANEL                             00396000
003970         GO TO PKP-RELOAD-PANEL.                                  00397000
003980 PKP-CONTINUE.                                                    00398000
003990     MOVE COM-NEXTKEY TO SR-PSLIST.                               00399000
004000     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00400000
004010         GO TO PKP-SEND-PANEL.                                    00401000
004020 PKP-BEGIN-EDITS.                                                 00402000
004030     IF EDIT-PANEL                                                00403000
004040         MOVE RPV365K-PRODCD TO COM-KEY-PRODCODE                  00404000
004050         MOVE RPV365K-ACCOUNT TO COM-KEY-ACCOUNT                  00405000
004060         MOVE RPV365K-MODEL TO COM-KEY-MODEL                      00406000
004070         GO TO PKP-RETURN-EDITS.                                  00407000
004080     PERFORM PARAMETER-SEARCH.                                    00408000
004090     MOVE SR-PSPARM TO COM-EXTID.                                 00409000
004100     MOVE SR-PSPARM TO COM-EXTERNALID.                            00410000
004110     PERFORM PARAMETER-SEARCH.                                    00411000
004120     MOVE SR-PSPARM TO COM-KEY-PRODCODE.                          00412000
004130     PERFORM PARAMETER-SEARCH.                                    00413000
004140     MOVE SR-PSPARM TO COM-KEY-ACCOUNT.                           00414000
004150     PERFORM PARAMETER-SEARCH.                                    00415000
004160     MOVE SR-PSPARM TO COM-KEY-MODEL.                             00416000
004170 PKP-RETURN-EDITS.                                                00417000
004180     IF COM-KEY-PRODCODE IS EQUAL TO SPACE                        00418000
004190         MOVE LOW-VALUE TO COM-KEY-PRODCODE.                      00419000
004200     IF COM-KEY-ACCOUNT IS EQUAL TO SPACE                         00420000
004210         MOVE LOW-VALUE TO COM-KEY-ACCOUNT.                       00421000
004220     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00422000
004230         MOVE LOW-VALUES TO COM-KEY-MODEL.                        00423000
004240     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00424000
004250         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00425000
004260         GO TO PKP-RETURN-CONT.                                   00426000
004270     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00427000
004280         MOVE '000002' TO WS-MSGNBR                               00428000
004290         GO TO PKP-RETURN-CONT.                                   00429000
004300     PERFORM EDIT-ACCOUNT-KEY.                                    00430000
004310 PKP-RETURN-CONT.                                                 00431000
004320     IF INITIAL-PANEL                                             00432000
004330         AND COM-KEY-PRODCODE IS EQUAL TO LOW-VALUES              00433000
004340         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUES               00434000
004350         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUES                 00435000
004360         MOVE '000001' TO WS-MSGNBR                               00436000
004370         GO TO PKP-SEND-PANEL.                                    00437000
004380     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00438000
004390     MOVE COM-KEY-MODEL   TO COM-MODEL.                           00439000
004400     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00440000
004410     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00441000
004420         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00442000
004430     ELSE                                                         00443000
004440         MOVE ZERO TO COM-ACCOUNT.                                00444000
004450     IF FROM-BREAKAWAY                                            00445000
004460         OR FROM-HELP                                             00446000
004470         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00447000
004480         GO TO PKP-RELOAD-PANEL.                                  00448000
004490     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00449000
004500         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00450000
004510         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00451000
004520         GO TO PKP-EDITS-READY.                                   00452000
004530     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00453000
004540         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00454000
004550     ELSE                                                         00455000
004560         MOVE ZERO TO COM-ACCOUNT.                                00456000
004570     IF WS-MSGNBR IS NOT EQUAL TO ZERO                            00457000
004580         GO TO PKP-RELOAD-PANEL.                                  00458000
004590 PKP-EDITS-READY.                                                 00459000
004600     MOVE SPACE TO COM-PANEL-ACTION.                              00460000
004610     MOVE '1' TO COM-RETURN.                                      00461000
004620     MOVE 'K' TO COM-FROM-PANEL.                                  00462000
004630     GO TO PANEL-ROUTER.                                          00463000
004640 PKP-RELOAD-PANEL.                                                00464000
004650     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00465000
004660         MOVE LOW-VALUES TO RPV365K-PRODCD                        00466000
004670     ELSE                                                         00467000
004680         MOVE COM-KEY-PRODCODE TO RPV365K-PRODCD.                 00468000
004690     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00469000
004700         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROS                     00470000
004710         MOVE LOW-VALUES TO RPV365K-ACCOUNT                       00471000
004720     ELSE                                                         00472000
004730         MOVE COM-KEY-ACCOUNT TO RPV365K-ACCOUNT.                 00473000
004740     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00474000
004750         OR COM-KEY-MODEL IS EQUAL TO ZEROS                       00475000
004760         MOVE LOW-VALUES TO RPV365K-MODEL                         00476000
004770     ELSE                                                         00477000
004780         MOVE COM-KEY-MODEL TO RPV365K-MODEL.                     00478000
004790 PKP-SEND-PANEL.                                                  00479000
004800     MOVE PDB-RPV365K-NAME TO PAN-NAME.                           00480000
004810     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00481000
004820     IF (FROM-HELP                                                00482000
004830         OR FROM-BREAKAWAY)                                       00483000
004840         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00484000
004850         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00485000
004860     ELSE                                                         00486000
004870         MOVE PDB-RPV365K-PRODCD TO PAN-SET-FLD.                  00487000
004880     PERFORM CALL-BISPAN-RPV365K.                                 00488000
004890     MOVE COM-OPERID TO RPV365K-OPERID.                           00489000
004900     MOVE COM-INST TO RPV365K-INST.                               00490000
004910     MOVE COM-EDIT-DATE TO RPV365K-SYSDATE.                       00491000
004920     IF RPV365K-PRODCD IS EQUAL TO SPACES                         00492000
004930         MOVE LOW-VALUES TO RPV365K-PRODCD.                       00493000
004940     MOVE RPV365K-ACCOUNT TO SR-JUSTLONGIN.                       00494000
004950     MOVE +18 TO SR-JLGTH.                                        00495000
004960     PERFORM LEFT-JUSTIFY.                                        00496000
004970     MOVE SR-JUSTLONGOUT TO RPV365K-ACCOUNT.                      00497000
004980     IF RPV365K-ACCOUNT IS EQUAL TO SPACES                        00498000
004990         MOVE LOW-VALUES TO RPV365K-ACCOUNT.                      00499000
005000     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00500000
005010         MOVE WS-HELPMSG TO WS-MSGNBR.                            00501000
005020     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00502000
005030         MOVE '000027' TO WS-MSGNBR                               00503000
005040     ELSE                                                         00504000
005050         PERFORM BUILD-NEXTKEY                                    00505000
005060         PERFORM COMPRESS-NEXTKEY                                 00506000
005070         MOVE WS-NEXTKEY TO RPV365K-COMMAND.                      00507000
005080     IF FROM-BREAKAWAY                                            00508000
005090         OR FROM-HELP                                             00509000
005100         MOVE SPACES TO COM-FROM-PANEL                            00510000
005110         MOVE COM-KEY-COMMAND TO RPV365K-COMMAND                  00511000
005120         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00512000
005130     ELSE                                                         00513000
005140         MOVE RPV365K-COMMAND TO COM-KEY-COMMAND                  00514000
005150         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00515000
005160     MOVE 'E' TO COM-RETURN.                                      00516000
005170     PERFORM GET-MESSAGE.                                         00517000
005180     MOVE WS-MESSAGE TO RPV365K-MSGLINE.                          00518000
005190     PERFORM PANEL-PFKEY-SET.                                     00519000
005200     PERFORM BUILD-PFKEY-LINE.                                    00520000
005210     MOVE WS-PFLINE1 TO RPV365K-PFLINE1.                          00521000
005220     MOVE WS-PFLINE2 TO RPV365K-PFLINE2.                          00522000
005230     PERFORM PANEL-PUT-RPV365K.                                   00523000
005240     PERFORM PANEL-SEND.                                          00524000
005250     MOVE 'E' TO COM-PANEL-ACTION.                                00525000
005260     MOVE COM-INTID TO WS-TRANSID.                                00526000
005270     GO TO CICS-RETURN-TRANSID.                                   00527000
005280 PKP-EXIT.                                                        00528000
005290     EXIT.                                                        00529000
005300******************************************************************00530000
005310 PROCESS-MAINT-PANEL SECTION.                                     00531000
005320 PMP-START.                                                       00532000
005330     IF FROM-HELP                                                 00533000
005340         OR FROM-BREAKAWAY                                        00534000
005350         MOVE SPACE TO COM-FROM-PANEL                             00535000
005360         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00536000
005370         MOVE PAN-CURSOR-FLD TO WS-CURSOR-FIELD                   00537000
005380         GO TO PMP-SEND-PANEL.                                    00538000
005390     IF INITIAL-PANEL                                             00539000
005400         MOVE ALL 'N' TO COM-DCHG                                 00540000
005410         MOVE ALL 'N' TO RPXXX10-MISC-DCHG                        00541000
005420         MOVE LOW-VALUES TO RPV365-PANL-DATA-AREA                 00542000
005430         MOVE SPACE TO COM-PANEL-ACTION                           00543000
005440         MOVE 'VKL' TO RPXXX10-APIFUNC                            00544000
005450         MOVE COM-INST TO COM-KEY-INST                            00545000
005460         MOVE LOW-VALUES TO COM-FIRST-KEY                         00546000
005470         GO TO PMP-LINK-TO-RPLXXX10.                              00547000
005480 PMP-PFKEYS.                                                      00548000
005490     MOVE ALL ZEROS TO WS-MSGNBR.                                 00549000
005500     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00550000
005510         MOVE SPACES TO WS-CURSOR-FIELD                           00551000
005520         GO TO PMP-SEND-PANEL.                                    00552000
005530     IF EIBAID IS EQUAL TO DFHPF8                                 00553000
005540         AND COM-END-FILE-INST IS EQUAL TO 'E'                    00554000
005550         MOVE '000046' TO WS-MSGNBR                               00555000
005560         GO TO PMP-SEND-PANEL.                                    00556000
005570     IF EIBAID IS EQUAL TO DFHPF8                                 00557000
005580         OR EIBAID IS EQUAL TO DFHENTER                           00558000
005590         AND COM-END-FILE-INST IS NOT EQUAL TO 'E'                00559000
005600         MOVE COM-SELECT-KEY TO RPXXX10-SELECTKEY                 00560000
005610         GO TO PMP-CONTINUE.                                      00561000
005620     IF EIBAID IS EQUAL TO DFHPF3                                 00562000
005630         OR EIBAID IS EQUAL TO DFHPF4                             00563000
005640         OR EIBAID IS EQUAL TO DFHPF2                             00564000
005650         OR EIBAID IS EQUAL TO DFHPF7                             00565000
005660         GO TO PMP-CONTINUE.                                      00566000
005670     MOVE COM-NEXTKEY TO WS-NEXTKEY.                              00567000
005680 PMP-CONTINUE.                                                    00568000
005690     MOVE ZERO TO WS-MSGNBR.                                      00569000
005700     MOVE +0 TO WS-ERROR-COUNT.                                   00570000
005710     MOVE COM-DCHG TO SRW166-FIELD.                               00571000
005720     MOVE 'E' TO SRW166-IN.                                       00572000
005730     MOVE 'Y' TO SRW166-OUT.                                      00573000
005740* MOVE THE LENGTH OF THE COM-DCHG FIELD:                          00574000
005750     MOVE +6 TO SRW166-LGTH.                                      00575000
005760     PERFORM EXAMINE-FIELD.                                       00576000
005770     MOVE SRW166-FIELD TO COM-DCHG.                               00577000
005780     MOVE ALL 'N' TO RPXXX10-MISC-DCHG.                           00578000
005790     MOVE COM-ACTION1-DCHG TO RPXXX10-DISCAMT-ACTION-DCHG.        00579000
005800     MOVE COM-INCENT1-DCHG TO RPXXX10-DISCAMT-OVRD-DCHG.          00580000
005810     MOVE COM-ACTION2-DCHG TO RPXXX10-DISCPCT-ACTION-DCHG.        00581000
005820     MOVE COM-INCENT2-DCHG TO RPXXX10-DISCPCT-OVRD-DCHG.          00582000
005830     MOVE COM-ACTION3-DCHG TO RPXXX10-RATEPCT-ACTION-DCHG.        00583000
005840     MOVE COM-INCENT3-DCHG TO RPXXX10-RATEPCT-OVRD-DCHG.          00584000
005850     PERFORM MOVE-PANEL-TO-RECORD.                                00585000
005860     IF COM-DCHG IS EQUAL TO ALL 'N'                              00586000
005870         AND (EIBAID IS EQUAL TO DFHPF3                           00587000
005880         OR EIBAID IS EQUAL TO DFHPF4)                            00588000
005890         GO TO CLOSE-TRANSACTION.                                 00589000
005900     IF EIBAID IS EQUAL TO DFHENTER                               00590000
005910         AND COM-END-FILE-INST IS EQUAL TO 'E'                    00591000
005920         MOVE COM-SELECT-KEY TO RPXXX10-SELECTKEY                 00592000
005930         MOVE 'D' TO COM-END.                                     00593000
005940     IF EIBAID IS EQUAL TO DFHPF2                                 00594000
005950         OR EIBAID IS EQUAL TO DFHPF3                             00595000
005960         OR EIBAID IS EQUAL TO DFHPF4                             00596000
005970         OR EIBAID IS EQUAL TO DFHPF7                             00597000
005980         MOVE COM-SELECT-KEY TO RPXXX10-SELECTKEY.                00598000
005990     IF INITIAL-PANEL                                             00599000
006000         MOVE 'VKL' TO RPXXX10-APIFUNC.                           00600000
006010     IF EDIT-PANEL                                                00601000
006020         MOVE 'UPD' TO RPXXX10-APIFUNC.                           00602000
006030 PMP-LINK-TO-RPLXXX10.                                            00603000
006040     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00604000
006050         OR EIBAID IS EQUAL TO DFHPF9                             00605000
006060         MOVE COM-SELECT-KEY TO RPXXX10-SELECTKEY                 00606000
006070         MOVE 'EDT' TO RPXXX10-APIFUNC.                           00607000
006080     PERFORM RPXXX10-LINK-MESSAGE.                                00608000
006090     MOVE RPXXX10-END-FILE-INST TO COM-END-FILE-INST.             00609000
006100     IF RPXXX10-RETURN IS EQUAL TO 'E'                            00610000
006110         MOVE 'E' TO COM-RETURN                                   00611000
006120         MOVE 'E' TO COM-PANEL-ACTION                             00612000
006130         MOVE 'M' TO COM-FROM-PANEL                               00613000
006140         GO TO PANEL-ROUTER.                                      00614000
006150     IF RPXXX10-APIFUNC IS EQUAL TO 'EDT'                         00615000
006160         GO TO PMP-BUILD-MAINT-PANEL.                             00616000
006170     IF (EIBAID IS EQUAL TO DFHPF2                                00617000
006180         OR EIBAID IS EQUAL TO DFHPF7)                            00618000
006190         AND (COM-END IS EQUAL TO 'P'                             00619000
006200         OR COM-END IS EQUAL TO 'B')                              00620000
006210         AND RPXXX10-APIFUNC IS NOT EQUAL TO 'VKL'                00621000
006220         AND COM-MORE IS EQUAL TO SPACE                           00622000
006230         MOVE ' ' TO COM-FIRSTSW                                  00623000
006240         MOVE 'VKL' TO RPXXX10-APIFUNC                            00624000
006250         MOVE COM-FIRST-KEY TO RPXXX10-SELECTKEY                  00625000
006260         GO TO PMP-LINK-TO-RPLXXX10.                              00626000
006270     IF EIBAID IS EQUAL TO DFHPF7                                 00627000
006280         AND (COM-END IS EQUAL TO 'P'                             00628000
006290         OR COM-END IS EQUAL TO 'B')                              00629000
006300         AND RPXXX10-SELECTKEY IS NOT EQUAL TO COM-LAST-KEY       00630000
006310         AND COM-END-FILE-INST IS NOT EQUAL TO 'E'                00631000
006320         MOVE 'X' TO COM-FIRSTSW                                  00632000
006330         MOVE 'X' TO COM-MORE                                     00633000
006340         MOVE 'UPD' TO RPXXX10-APIFUNC                            00634000
006350         MOVE RPXXX10-SELECTKEY TO COM-SELECT-KEY                 00635000
006360         GO TO PMP-LINK-TO-RPLXXX10.                              00636000
006370     MOVE SPACE TO COM-MORE.                                      00637000
006380     IF EIBAID IS EQUAL TO DFHENTER                               00638000
006390         AND COM-END IS EQUAL TO 'D'                              00639000
006400         GO TO CLOSE-TRANSACTION.                                 00640000
006410     IF EIBAID IS EQUAL TO DFHPF3                                 00641000
006420         OR EIBAID IS EQUAL TO DFHPF4                             00642000
006430         GO TO CLOSE-TRANSACTION.                                 00643000
006440     MOVE RPXXX10-DISCAMT-OVRD-FLAG TO COM-DISCAMT-OVRD-FLAG.     00644000
006450     MOVE RPXXX10-DISCPCT-OVRD-FLAG TO COM-DISCPCT-OVRD-FLAG.     00645000
006460     MOVE RPXXX10-RATEPCT-OVRD-FLAG TO COM-RATEPCT-OVRD-FLAG.     00646000
006470     MOVE RPXXX10-DISCAMT-OVRD TO COM-DISCAMT-OVRD.               00647000
006480     MOVE RPXXX10-DISCPCT-OVRD TO COM-DISCPCT-OVRD.               00648000
006490     MOVE RPXXX10-RATEPCT-OVRD TO COM-RATEPCT-OVRD.               00649000
006500     MOVE RPXXX10-DISCOUNT-AMOUNT TO COM-DISCOUNT-AMOUNT.         00650000
006510     MOVE RPXXX10-DISCOUNT-PERCENT TO COM-DISCOUNT-PERCENT.       00651000
006520     MOVE RPXXX10-RATE-PERCENT TO COM-RATE-PERCENT.               00652000
006530 PMP-BUILD-MAINT-PANEL.                                           00653000
006540     MOVE RPXXX10-SK-INST2-DCHG TO COM-SK-INST2-DCHG.             00654000
006550     MOVE RPXXX10-SK-PRODCODE2-DCHG TO COM-SK-PRODCODE2-DCHG.     00655000
006560     MOVE RPXXX10-SK-ACCOUNT2-DCHG TO COM-SK-ACCOUNT2-DCHG.       00656000
006570     MOVE RPXXX10-SK-MODEL TO COM-MODEL.                          00657000
006580     IF RPXXX10-SK-MODEL IS NOT EQUAL TO COM-KEY-MODEL            00658000
006590         MOVE RPXXX10-SK-MODEL TO COM-KEY-MODEL.                  00659000
006600     MOVE RPXXX10-MODEL-DESC TO COM-MODEL-DESC.                   00660000
006610     MOVE RPXXX10-DISCAMT-ACTION-DCHG TO COM-ACTION1-DCHG.        00661000
006620     MOVE RPXXX10-DISCAMT-OVRD-DCHG TO COM-INCENT1-DCHG.          00662000
006630     MOVE RPXXX10-DISCPCT-ACTION-DCHG TO COM-ACTION2-DCHG.        00663000
006640     MOVE RPXXX10-DISCPCT-OVRD-DCHG TO COM-INCENT2-DCHG.          00664000
006650     MOVE RPXXX10-RATEPCT-ACTION-DCHG TO COM-ACTION3-DCHG.        00665000
006660     MOVE RPXXX10-RATEPCT-OVRD-DCHG TO COM-INCENT3-DCHG.          00666000
006670     PERFORM BUILD-MAINT-PANEL.                                   00667000
006680     IF COM-LAST-KEY IS EQUAL TO SPACES                           00668000
006690         MOVE RPXXX10-SELECTKEY TO COM-LAST-KEY                   00669000
006700     ELSE                                                         00670000
006710         MOVE COM-SELECT-KEY TO COM-LAST-KEY.                     00671000
006720     MOVE RPXXX10-SELECTKEY TO COM-SELECT-KEY.                    00672000
006730     IF EIBAID IS EQUAL TO DFHPF9                                 00673000
006740         GO TO PMP-SEND-PANEL.                                    00674000
006750     IF COM-LAST-KEY IS EQUAL TO COM-FIRST-KEY                    00675000
006760         MOVE SPACE TO COM-FIRSTSW.                               00676000
006770     MOVE 'B' TO COM-END.                                         00677000
006780     IF COM-FIRSTSW IS EQUAL TO SPACE                             00678000
006790         MOVE 'F' TO COM-END.                                     00679000
006800     IF COM-FIRSTSW IS EQUAL TO SPACE                             00680000
006810         AND COM-END-FILE-INST IS EQUAL TO 'E'                    00681000
006820         MOVE 'E' TO COM-END.                                     00682000
006830     IF COM-FIRSTSW IS NOT EQUAL TO SPACE                         00683000
006840         AND COM-END-FILE-INST IS EQUAL TO 'E'                    00684000
006850         MOVE 'P' TO COM-END.                                     00685000
006860 PMP-SEND-PANEL.                                                  00686000
006870     IF WS-CURSOR-FIELD IS EQUAL TO SPACE                         00687000
006880         MOVE PDB-RPV365-COMMAND TO PAN-SET-FLD                   00688000
006890     ELSE                                                         00689000
006900         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                     00690000
006910     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00691000
006920     PERFORM CALL-BISPAN-RPV365.                                  00692000
006930     MOVE COM-INST TO RPV365-INST.                                00693000
006940     MOVE COM-OPERID TO RPV365-OPERID.                            00694000
006950     MOVE COM-PRODCODE TO RPV365-PRODCD.                          00695000
006960     MOVE COM-KEY-ACCOUNT TO RPV365-ACCOUNT.                      00696000
006970     MOVE COM-KEY-MODEL TO RPV365-MODEL.                          00697000
006980     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00698000
006990         MOVE ALL 'P' TO COM-DCHG                                 00699000
007000         MOVE PDB-RPV365-COMMAND TO WS-CURSOR-FIELD.              00700000
007010     PERFORM SET-ATTRIBUTES-AND-MESSAGES.                         00701000
007020     IF (FROM-HELP                                                00702000
007030         OR FROM-BREAKAWAY)                                       00703000
007040         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00704000
007050         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00705000
007060         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00706000
007070     ELSE                                                         00707000
007080         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD                      00708000
007090         MOVE WS-CURSOR-OCC TO PAN-SET-OCC.                       00709000
007100     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00710000
007110     PERFORM CALL-BISPAN-RPV365.                                  00711000
007120     MOVE COM-INST TO RPV365-INST.                                00712000
007130     MOVE COM-OPERID TO RPV365-OPERID.                            00713000
007140     MOVE COM-EDIT-DATE TO RPV365-SYSDATE.                        00714000
007150     IF WS-MSGNBR NOT NUMERIC                                     00715000
007160         MOVE ZERO TO WS-MSGNBR.                                  00716000
007170     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00717000
007180         MOVE WS-HELPMSG TO WS-MSGNBR.                            00718000
007190     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00719000
007200         MOVE '000027' TO WS-MSGNBR                               00720000
007210     ELSE                                                         00721000
007220         PERFORM BUILD-NEXTKEY                                    00722000
007230         PERFORM COMPRESS-NEXTKEY                                 00723000
007240         MOVE WS-NEXTKEY TO RPV365-COMMAND.                       00724000
007250     IF FROM-HELP                                                 00725000
007260         OR FROM-BREAKAWAY                                        00726000
007270         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00727000
007280         MOVE COM-KEY-COMMAND TO RPV365-COMMAND                   00728000
007290         MOVE SPACE TO COM-FROM-PANEL                             00729000
007300     ELSE                                                         00730000
007310         MOVE RPV365-COMMAND TO COM-KEY-COMMAND                   00731000
007320         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00732000
007330     PERFORM GET-MESSAGE.                                         00733000
007340     MOVE WS-MESSAGE TO RPV365-MSGLINE.                           00734000
007350     PERFORM PANEL-PFKEY-SET.                                     00735000
007360     MOVE SPACE TO RPV365-MORE.                                   00736000
007370     IF COM-END-FILE-INST IS NOT EQUAL TO 'E'                     00737000
007380         MOVE WS-MORE TO RPV365-MORE                              00738000
007390         MOVE '+' TO RPV365-PLUS                                  00739000
007400     ELSE                                                         00740000
007410         MOVE 'N' TO WS-PF8-FLG                                   00741000
007420         MOVE SPACE TO RPV365-PLUS.                               00742000
007430     IF COM-END IS EQUAL TO 'P'                                   00743000
007440         OR COM-END IS EQUAL TO 'B'                               00744000
007450         MOVE WS-MORE TO RPV365-MORE                              00745000
007460         MOVE '-' TO RPV365-MINUS                                 00746000
007470     ELSE                                                         00747000
007480         MOVE 'N' TO WS-PF7-FLG                                   00748000
007490         MOVE SPACE TO RPV365-MINUS.                              00749000
007500     IF COM-FIRSTSW IS EQUAL TO SPACE                             00750000
007510         MOVE COM-KEY-FIELDS TO COM-FIRST-KEY.                    00751000
007520     IF COM-FIRSTSW IS EQUAL TO SPACE                             00752000
007530         AND COM-END-FILE-INST IS NOT EQUAL TO 'E'                00753000
007540         MOVE 'X' TO COM-FIRSTSW.                                 00754000
007550     PERFORM BUILD-PFKEY-LINE.                                    00755000
007560     MOVE WS-PFLINE1 TO RPV365-PFLINE1.                           00756000
007570     MOVE WS-PFLINE2 TO RPV365-PFLINE2.                           00757000
007580     PERFORM PANEL-PUT-RPV365.                                    00758000
007590     PERFORM PANEL-SEND.                                          00759000
007600     MOVE '1' TO COM-RETURN.                                      00760000
007610     MOVE 'E' TO COM-PANEL-ACTION.                                00761000
007620     MOVE 'M' TO COM-FROM-PANEL.                                  00762000
007630     MOVE COM-INTID TO WS-TRANSID.                                00763000
007640     GO TO CICS-RETURN-TRANSID.                                   00764000
007650 PMP-EXIT.                                                        00765000
007660     EXIT.                                                        00766000
007670******************************************************************00767000
007680 MOVE-PANEL-TO-RECORD SECTION.                                    00768000
007690 MPTR-START.                                                      00769000
007700     MOVE COM-KEY-PRODCODE TO RPXXX10-SK-PRODCODE.                00770000
007710     MOVE COM-KEY-ACCOUNT TO RPXXX10-SK-ACCOUNT.                  00771000
007720     MOVE COM-KEY-MODEL TO RPXXX10-SK-MODEL.                      00772000
007730     MOVE COM-SK-INST2-DCHG TO RPXXX10-SK-INST2-DCHG.             00773000
007740     MOVE COM-SK-PRODCODE2-DCHG TO RPXXX10-SK-PRODCODE2-DCHG.     00774000
007750     MOVE COM-SK-ACCOUNT2-DCHG TO RPXXX10-SK-ACCOUNT2-DCHG.       00775000
007760     MOVE COM-MODEL-DESC TO RPXXX10-MODEL-DESC.                   00776000
007770     MOVE COM-DISCAMT-OVRD-FLAG TO RPXXX10-DISCAMT-OVRD-FLAG.     00777000
007780     MOVE COM-DISCPCT-OVRD-FLAG TO RPXXX10-DISCPCT-OVRD-FLAG.     00778000
007790     MOVE COM-RATEPCT-OVRD-FLAG TO RPXXX10-RATEPCT-OVRD-FLAG.     00779000
007800     MOVE COM-DISCOUNT-AMOUNT TO RPXXX10-DISCOUNT-AMOUNT.         00780000
007810     MOVE COM-DISCOUNT-PERCENT TO RPXXX10-DISCOUNT-PERCENT.       00781000
007820     MOVE COM-RATE-PERCENT TO RPXXX10-RATE-PERCENT.               00782000
007830     PERFORM PANEL-GET-RPV365.                                    00783000
007840 MPTR-ACTION1.                                                    00784000
007850     IF RPV365-ACTION1 IS EQUAL TO LOW-VALUES                     00785000
007860         MOVE SPACES TO RPV365-ACTION1.                           00786000
007870     MOVE RPV365-ACTION1 TO RPXXX10-DISCAMT-ACTION.               00787000
007880 MPTR-INCENT1.                                                    00788000
007890     MOVE '-' TO SR-EDITNEG.                                      00789000
007900     MOVE 02 TO SR-EDITDEC.                                       00790000
007910     MOVE 10 TO SR-EDITLGTH.                                      00791000
007920     MOVE RPV365-INCENT1 TO SR-EDITIN.                            00792000
007930     PERFORM STRIP-EDIT-VALIDATE.                                 00793000
007940     IF SR-EDITERR IS EQUAL TO 'Y'                                00794000
007950         MOVE 'E' TO RPXXX10-DISCAMT-OVRD-DCHG                    00795000
007960     ELSE                                                         00796000
007970         MOVE SR-EDITOUTV02 TO RPXXX10-DISCAMT-OVRD.              00797000
007980 MPTR-ACTION2.                                                    00798000
007990     IF RPV365-ACTION2 IS EQUAL TO LOW-VALUES                     00799000
008000         MOVE SPACES TO RPV365-ACTION2.                           00800000
008010     MOVE RPV365-ACTION2 TO RPXXX10-DISCPCT-ACTION.               00801000
008020 MPTR-INCENT2.                                                    00802000
008030     MOVE SPACE TO SR-EDITNEG.                                    00803000
008040     MOVE 05 TO SR-EDITDEC.                                       00804000
008050     MOVE 06 TO SR-EDITLGTH.                                      00805000
008060     MOVE RPV365-INCENT2 TO SR-EDITIN.                            00806000
008070     PERFORM STRIP-EDIT-VALIDATE.                                 00807000
008080     IF SR-EDITERR IS EQUAL TO 'Y'                                00808000
008090         MOVE 'E' TO RPXXX10-DISCPCT-OVRD-DCHG                    00809000
008100     ELSE                                                         00810000
008110         MOVE SR-EDITOUTV05 TO RPXXX10-DISCPCT-OVRD.              00811000
008120 MPTR-ACTION3.                                                    00812000
008130     IF RPV365-ACTION3 IS EQUAL TO LOW-VALUES                     00813000
008140         MOVE SPACES TO RPV365-ACTION3.                           00814000
008150     MOVE RPV365-ACTION3 TO RPXXX10-RATEPCT-ACTION.               00815000
008160 MPTR-INCENT3.                                                    00816000
008170     MOVE SPACE TO SR-EDITNEG.                                    00817000
008180     MOVE 05 TO SR-EDITDEC.                                       00818000
008190     MOVE 06 TO SR-EDITLGTH.                                      00819000
008200     MOVE RPV365-INCENT3 TO SR-EDITIN.                            00820000
008210     PERFORM STRIP-EDIT-VALIDATE.                                 00821000
008220     IF SR-EDITERR IS EQUAL TO 'Y'                                00822000
008230         MOVE 'E' TO RPXXX10-RATEPCT-OVRD-DCHG                    00823000
008240     ELSE                                                         00824000
008250         MOVE SR-EDITOUTV05 TO RPXXX10-RATEPCT-OVRD.              00825000
008260 MPTR-EXIT.                                                       00826000
008270     EXIT.                                                        00827000
008280******************************************************************00828000
008290 BUILD-MAINT-PANEL SECTION.                                       00829000
008300 BMP-START.                                                       00830000
008310     IF RPXXX10-SK-INST2 IS EQUAL TO ZEROS                        00831000
008320         AND RPXXX10-SK-PRODCODE2 IS EQUAL TO SPACE               00832000
008330         AND RPXXX10-SK-ACCOUNT2 IS EQUAL TO SPACE                00833000
008340         MOVE RPXXX10-SK-INST TO RPV365-PRIMINST                  00834000
008350         MOVE RPXXX10-SK-PRODCODE TO RPV365-PRIMPROD              00835000
008360         MOVE RPXXX10-SK-ACCOUNT TO RPV365-PRIMACCT               00836000
008370     ELSE                                                         00837000
008380         MOVE RPXXX10-SK-INST2 TO RPV365-PRIMINST                 00838000
008390         MOVE RPXXX10-SK-PRODCODE2 TO RPV365-PRIMPROD             00839000
008400         MOVE RPXXX10-SK-ACCOUNT2 TO RPV365-PRIMACCT.             00840000
008410     MOVE RPXXX10-SK-MODEL TO RPV365-MODEL.                       00841000
008420     MOVE RPXXX10-MODEL-DESC TO RPV365-DESC.                      00842000
008430     MOVE SPACES TO RPV365-OVRD1.                                 00843000
008440     IF RPXXX10-DISCAMT-ACTION-DCHG IS EQUAL TO 'N'               00844000
008450         MOVE LOW-VALUES TO RPV365-ACTION1                        00845000
008460     ELSE                                                         00846000
008470         MOVE RPXXX10-DISCAMT-ACTION TO RPV365-ACTION1.           00847000
008480     IF RPXXX10-DISCPCT-ACTION-DCHG IS EQUAL TO 'N'               00848000
008490         MOVE LOW-VALUES TO RPV365-ACTION2                        00849000
008500     ELSE                                                         00850000
008510         MOVE RPXXX10-DISCPCT-ACTION TO RPV365-ACTION2.           00851000
008520     IF RPXXX10-RATEPCT-ACTION-DCHG IS EQUAL TO 'N'               00852000
008530         MOVE LOW-VALUES TO RPV365-ACTION3                        00853000
008540     ELSE                                                         00854000
008550         MOVE RPXXX10-RATEPCT-ACTION TO RPV365-ACTION3.           00855000
008560     IF RPXXX10-DISCAMT-OVRD-FLAG IS EQUAL TO 'Y'                 00856000
008570         MOVE '(OVERRIDE)' TO RPV365-OVRD1.                       00857000
008580     MOVE SPACES TO RPV365-OVRD2.                                 00858000
008590     IF RPXXX10-DISCPCT-OVRD-FLAG IS EQUAL TO 'Y'                 00859000
008600         MOVE '(OVERRIDE)' TO RPV365-OVRD2.                       00860000
008610     IF RPXXX10-SC-OPTION IS EQUAL TO 'N'                         00861000
008620         MOVE 'P' TO COM-ACTION1-DCHG                             00862000
008630         MOVE 'P' TO COM-INCENT1-DCHG                             00863000
008640         MOVE 'P' TO COM-ACTION2-DCHG                             00864000
008650         MOVE 'P' TO COM-INCENT2-DCHG                             00865000
008660         MOVE '(NO INCENTIVE FROM MODEL)' TO RPV365-OVRD1         00866000
008670         MOVE '(NO INCENTIVE FROM MODEL)' TO RPV365-OVRD2.        00867000
008680     MOVE SPACES TO RPV365-OVRD3.                                 00868000
008690     IF RPXXX10-RATEPCT-OVRD-FLAG IS EQUAL TO 'Y'                 00869000
008700         MOVE '(OVERRIDE)' TO RPV365-OVRD3.                       00870000
008710     IF RPXXX10-RATE-OPTION IS EQUAL TO 'N'                       00871000
008720         MOVE 'P' TO COM-ACTION3-DCHG                             00872000
008730         MOVE 'P' TO COM-INCENT3-DCHG                             00873000
008740         MOVE '(NO INCENTIVE FROM MODEL)' TO RPV365-OVRD3.        00874000
008750     IF RPXXX10-DISCAMT-OVRD-DCHG IS NOT EQUAL TO 'E'             00875000
008760         MOVE RPXXX10-DISCAMT-OVRD TO SR-EDITSGNV02               00876000
008770         MOVE SR-EDIT10X TO RPV365-INCENT1                        00877000
008780         MOVE RPV365-INCENT1 TO SR-JUSTLONGIN                     00878000
008790         MOVE 10 TO SR-JLGTH                                      00879000
008800         PERFORM LEFT-JUSTIFY                                     00880000
008810         MOVE SR-JUSTLONGOUT TO RPV365-INCENT1.                   00881000
008820     IF RPXXX10-DISCPCT-OVRD-DCHG IS NOT EQUAL TO 'E'             00882000
008830         MOVE RPXXX10-DISCPCT-OVRD TO SR-EDITMSKV05               00883000
008840         MOVE SR-EDIT06X TO RPV365-INCENT2                        00884000
008850         MOVE RPV365-INCENT2 TO SR-JUSTLONGIN                     00885000
008860         MOVE 06 TO SR-JLGTH                                      00886000
008870         PERFORM LEFT-JUSTIFY                                     00887000
008880         MOVE SR-JUSTLONGOUT TO RPV365-INCENT2.                   00888000
008890     IF RPXXX10-RATEPCT-OVRD-DCHG IS NOT EQUAL TO 'E'             00889000
008900         MOVE RPXXX10-RATEPCT-OVRD TO SR-EDITMSKV05               00890000
008910         MOVE SR-EDIT06X TO RPV365-INCENT3                        00891000
008920         MOVE RPV365-INCENT3 TO SR-JUSTLONGIN                     00892000
008930         MOVE 06 TO SR-JLGTH                                      00893000
008940         PERFORM LEFT-JUSTIFY                                     00894000
008950         MOVE SR-JUSTLONGOUT TO RPV365-INCENT3.                   00895000
008960     MOVE COM-DISCOUNT-AMOUNT TO SR-EDITSGNV02.                   00896000
008970     MOVE SR-EDIT10X TO RPV365-DISCAMT.                           00897000
008980     MOVE RPV365-DISCAMT TO SR-JUSTLONGIN.                        00898000
008990     MOVE 10 TO SR-JLGTH.                                         00899000
009000     PERFORM LEFT-JUSTIFY.                                        00900000
009010     MOVE SR-JUSTLONGOUT TO RPV365-DISCAMT.                       00901000
009020     MOVE COM-DISCOUNT-PERCENT TO SR-EDITMSKV05.                  00902000
009030     MOVE SR-EDIT06X TO RPV365-DISCPCT.                           00903000
009040     MOVE RPV365-DISCPCT TO SR-JUSTLONGIN.                        00904000
009050     MOVE 06 TO SR-JLGTH.                                         00905000
009060     PERFORM LEFT-JUSTIFY.                                        00906000
009070     MOVE SR-JUSTLONGOUT TO RPV365-DISCPCT.                       00907000
009080     MOVE COM-RATE-PERCENT TO SR-EDITMSKV05.                      00908000
009090     MOVE SR-EDIT06X TO RPV365-BONRATE.                           00909000
009100     MOVE RPV365-BONRATE TO SR-JUSTLONGIN.                        00910000
009110     MOVE 06 TO SR-JLGTH.                                         00911000
009120     PERFORM LEFT-JUSTIFY.                                        00912000
009130     MOVE SR-JUSTLONGOUT TO RPV365-BONRATE.                       00913000
009140     MOVE PDB-RPV365-NAME TO PAN-NAME.                            00914000
009150 BMP-EXIT.                                                        00915000
009160     EXIT.                                                        00916000
009170******************************************************************00917000
009180 SET-DCHG-INDICATORS SECTION.                                     00918000
009190 SDI-START.                                                       00919000
009200     IF PDB-RPV365-ACTION1-DCHG IS EQUAL TO 'Y'                   00920000
009210         MOVE 'Y' TO COM-ACTION1-DCHG.                            00921000
009220     IF PDB-RPV365-INCENT1-DCHG IS EQUAL TO 'Y'                   00922000
009230         MOVE 'Y' TO COM-INCENT1-DCHG.                            00923000
009240     IF PDB-RPV365-ACTION2-DCHG IS EQUAL TO 'Y'                   00924000
009250         MOVE 'Y' TO COM-ACTION2-DCHG.                            00925000
009260     IF PDB-RPV365-INCENT2-DCHG IS EQUAL TO 'Y'                   00926000
009270         MOVE 'Y' TO COM-INCENT2-DCHG.                            00927000
009280     IF PDB-RPV365-ACTION3-DCHG IS EQUAL TO 'Y'                   00928000
009290         MOVE 'Y' TO COM-ACTION3-DCHG.                            00929000
009300     IF PDB-RPV365-INCENT3-DCHG IS EQUAL TO 'Y'                   00930000
009310         MOVE 'Y' TO COM-INCENT3-DCHG.                            00931000
009320 SDI-EXIT.                                                        00932000
009330     EXIT.                                                        00933000
009340******************************************************************00934000
009350 SET-ATTRIBUTES-AND-MESSAGES SECTION.                             00935000
009360 SAAM-START.                                                      00936000
009370     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00937000
009380     MOVE COM-ACTION1-DCHG TO WS-DCHG-TEST.                       00938000
009390     MOVE PDB-RPV365-ACTION1-VID TO PAN-SET-VID.                  00939000
009400     MOVE PDB-RPV365-ACTION1-EL TO PAN-SET-EMP.                   00940000
009410     MOVE PDB-RPV365-ACTION1 TO PAN-SET-FLD.                      00941000
009420     PERFORM SET-ATTRIBUTE.                                       00942000
009430     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00943000
009440     MOVE COM-INCENT1-DCHG TO WS-DCHG-TEST.                       00944000
009450     MOVE PDB-RPV365-INCENT1-VID TO PAN-SET-VID.                  00945000
009460     MOVE PDB-RPV365-INCENT1-EL TO PAN-SET-EMP.                   00946000
009470     MOVE PDB-RPV365-INCENT1 TO PAN-SET-FLD.                      00947000
009480     PERFORM SET-ATTRIBUTE.                                       00948000
009490     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00949000
009500     MOVE COM-ACTION2-DCHG TO WS-DCHG-TEST.                       00950000
009510     MOVE PDB-RPV365-ACTION2-VID TO PAN-SET-VID.                  00951000
009520     MOVE PDB-RPV365-ACTION2-EL TO PAN-SET-EMP.                   00952000
009530     MOVE PDB-RPV365-ACTION2 TO PAN-SET-FLD.                      00953000
009540     PERFORM SET-ATTRIBUTE.                                       00954000
009550     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00955000
009560     MOVE COM-INCENT2-DCHG TO WS-DCHG-TEST.                       00956000
009570     MOVE PDB-RPV365-INCENT2-VID TO PAN-SET-VID.                  00957000
009580     MOVE PDB-RPV365-INCENT2-EL TO PAN-SET-EMP.                   00958000
009590     MOVE PDB-RPV365-INCENT2 TO PAN-SET-FLD.                      00959000
009600     PERFORM SET-ATTRIBUTE.                                       00960000
009610     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00961000
009620     MOVE COM-ACTION3-DCHG TO WS-DCHG-TEST.                       00962000
009630     MOVE PDB-RPV365-ACTION3-VID TO PAN-SET-VID.                  00963000
009640     MOVE PDB-RPV365-ACTION3-EL TO PAN-SET-EMP.                   00964000
009650     MOVE PDB-RPV365-ACTION3 TO PAN-SET-FLD.                      00965000
009660     PERFORM SET-ATTRIBUTE.                                       00966000
009670     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00967000
009680     MOVE COM-INCENT3-DCHG TO WS-DCHG-TEST.                       00968000
009690     MOVE PDB-RPV365-INCENT3-VID TO PAN-SET-VID.                  00969000
009700     MOVE PDB-RPV365-INCENT3-EL TO PAN-SET-EMP.                   00970000
009710     MOVE PDB-RPV365-INCENT3 TO PAN-SET-FLD.                      00971000
009720     PERFORM SET-ATTRIBUTE.                                       00972000
009730 SAAM-EXIT.                                                       00973000
009740     EXIT.                                                        00974000
009750******************************************************************00975000
009760 SET-ATTRIBUTE SECTION.                                           00976000
009770 SA-START.                                                        00977000
009780     IF WS-DCHG-EDITERR                                           00978000
009790         ADD +1 TO WS-ERROR-COUNT                                 00979000
009800         MOVE 'Y' TO WS-ERROR                                     00980000
009810         MOVE VIS-ERROR TO PAN-SET-VID                            00981000
009820         MOVE EMP-ERROR TO PAN-SET-EMP.                           00982000
009830     IF WS-DCHG-EDITERR                                           00983000
009840         AND WS-CURSOR-FIELD IS EQUAL TO SPACES                   00984000
009850         MOVE PAN-SET-FLD TO WS-CURSOR-FIELD                      00985000
009860         MOVE PAN-SET-OCC TO WS-CURSOR-OCC.                       00986000
009870     IF WS-DCHG-PROTECT                                           00987000
009880         MOVE VIS-DISPLAY TO PAN-SET-VID                          00988000
009890         MOVE EMP-NORMAL TO PAN-SET-EMP.                          00989000
009900     IF WS-DCHG-HIDDEN                                            00990000
009910         MOVE VIS-DISPLAY TO PAN-SET-VID                          00991000
009920         MOVE EMP-HIDDEN TO PAN-SET-EMP.                          00992000
009930     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00993000
009940     PERFORM CALL-BISPAN-RPV365.                                  00994000
009950 SA-EXIT.                                                         00995000
009960     EXIT.                                                        00996000
009970******************************************************************00997000
009980 MORE-DATA-PANELS SECTION.                                        00998000
009990 MDP-START.                                                       00999000
010000     GO TO PANEL-ROUTER.                                          01000000
010010 MDP-EXIT.                                                        01001000
010020     EXIT.                                                        01002000
010030******************************************************************01003000
010040 CLOSE-TRANSACTION SECTION.                                       01004000
000000 COPY SRP0722.                                                    01005000
010060******************************************************************01006000
010070 PANEL-INIT SECTION.                                              01007000
000000 COPY SRP073.                                                     01008000
010090******************************************************************01009000
010100 BUILD-NEXTKEY SECTION.                                           01010000
010110 BXN-START.                                                       01011000
010120     MOVE SPACES TO WS-NEXTKEY.                                   01012000
010130     MOVE ',' TO WS-DELIM1.                                       01013000
010140     MOVE ',' TO WS-DELIM2.                                       01014000
010150     MOVE ',' TO WS-DELIM3.                                       01015000
010160     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        01016000
010170     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            01017000
010180         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         01018000
010190     ELSE                                                         01019000
010200         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       01020000
010210     MOVE COM-KEY-MODEL TO WS-MODEL.                              01021000
010220     MOVE COM-EXTERNALID TO WS-EXTID.                             01022000
010230 BXN-EXIT.                                                        01023000
010240     EXIT.                                                        01024000
010250******************************************************************01025000
010260 ABORT-EXIT SECTION.                                              01026000
010270 AE-START.                                                        01027000
010280     MOVE EIBFN TO COM-ABEIBFN.                                   01028000
010290     MOVE EIBRCODE TO COM-ABEIBRCODE.                             01029000
010300     GO TO CICS-ABORT-EXIT.                                       01030000
010310 AE-EXIT.                                                         01031000
010320     EXIT.                                                        01032000
010330******************************************************************01033000
010340 RPXXX10-LINK-MESSAGE SECTION.                                    01034000
010350 CRLM-START.                                                      01035000
010360     MOVE 'Y' TO RPXXX10-GLOBAL-CLOSE.                            01036000
010370     MOVE WS-FILEOPTIONS TO RPXXX10-FILEOPTS.                     01037000
010380     MOVE COM-RETURN TO RPXXX10-RETURN.                           01038000
010390     MOVE COM-DATE TO RPXXX10-DATE.                               01039000
010400     MOVE COM-MODELID TO RPXXX10-MODELID.                         01040000
010410     MOVE COM-SECALT TO RPXXX10-SECALT.                           01041000
010420     MOVE COM-EXTERNALID TO RPXXX10-EXTERNALID.                   01042000
010430     MOVE COM-EIBTRMID TO RPXXX10-TERMID.                         01043000
010440     MOVE COM-WKUNAME TO RPXXX10-WORKID.                          01044000
010450     MOVE COM-TRANSTART TO RPXXX10-TRANSTART.                     01045000
010460     MOVE COM-UPDATE TO RPXXX10-UPDATE.                           01046000
010470     MOVE COM-APPLSEQ TO RPXXX10-APPLSEQ.                         01047000
010480     MOVE WS-RPSAPPLNBR TO RPXXX10-APPL.                          01048000
010490     MOVE 'M' TO RPXXX10-FUNC.                                    01049000
010500     MOVE COM-INST TO RPXXX10-SK-INST.                            01050000
010510     MOVE COM-PRODCODE TO RPXXX10-SK-PRODCODE.                    01051000
010520     MOVE COM-KEY-ACCOUNT TO RPXXX10-SK-ACCOUNT.                  01052000
010530     MOVE COM-KEY-MODEL TO RPXXX10-SK-MODEL.                      01053000
010540     IF COM-KEY-MODEL IS EQUAL TO LOW-VALUES                      01054000
010550         MOVE SPACES TO RPXXX10-SK-MODEL.                         01055000
010560     IF RPXXX10-SK-INST IS GREATER THAN ZEROS                     01056000
010570         MOVE 'Y' TO RPXXX10-SK-INST-DCHG.                        01057000
010580     IF RPXXX10-SK-PRODCODE IS NOT EQUAL TO SPACES                01058000
010590         AND RPXXX10-SK-PRODCODE IS NOT EQUAL TO LOW-VALUES       01059000
010600         MOVE 'Y' TO RPXXX10-SK-PRODCODE-DCHG.                    01060000
010610     IF RPXXX10-SK-ACCOUNT IS NOT EQUAL TO SPACES                 01061000
010620         AND RPXXX10-SK-ACCOUNT IS NOT EQUAL TO LOW-VALUES        01062000
010630         MOVE 'Y' TO RPXXX10-SK-ACCOUNT-DCHG.                     01063000
010640     IF RPXXX10-SK-MODEL IS EQUAL TO LOW-VALUES                   01064000
010650         MOVE SPACES TO RPXXX10-SK-MODEL                          01065000
010660         MOVE 'N' TO RPXXX10-SK-MODEL-DCHG.                       01066000
010670     MOVE COM-OPERID TO RPXXX10-OPERID.                           01067000
010680     MOVE COM-LANG TO RPXXX10-COM-LANG.                           01068000
010690     MOVE COM-CURN-CODE TO RPXXX10-COM-CURNCD.                    01069000
010700     MOVE COM-INST-OPTS TO RPXXX10-INST-OPTS.                     01070000
010710     EXEC CICS LINK                                               01071000
010720         PROGRAM('RPLXXX10')                                      01072000
010730         COMMAREA(RPXXX10-MESSAGE)                                01073000
010740         LENGTH(LENGTH OF RPXXX10-MESSAGE)                        01074000
010750         RESP(WS-CICS-RESPONSE)                                   01075000
010760         END-EXEC.                                                01076000
010770     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     01077000
010780         MOVE 'RPLXXX10 LINK FAILED' TO COM-ABMSG                 01078000
010790         MOVE WS-TR0002 TO COM-ABTRACE                            01079000
010800         MOVE WS-AB0009 TO COM-ABORT                              01080000
010810         GO TO CICS-ABORT-EXIT.                                   01081000
010820     MOVE RPXXX10-FUNCTION TO WS-FUNCTION.                        01082000
010830     IF RPXXX10-ABORT IS NOT EQUAL TO ZERO                        01083000
010840         MOVE RPXXX10-ABORT TO COM-ABORT                          01084000
010850         MOVE RPXXX10-ABTRACE TO COM-ABTRACE                      01085000
010860         MOVE RPXXX10-ABEIBFN TO COM-ABEIBFN                      01086000
010870         MOVE RPXXX10-ABEIBRCODE TO COM-ABEIBRCODE                01087000
010880         MOVE RPXXX10-ABPROGID TO COM-ABPROGID                    01088000
010890         MOVE RPXXX10-SRBMDB TO COM-SRBMDB                        01089000
010900         MOVE RPXXX10-ABTYPE TO COM-ABTYPE                        01090000
010910         GO TO CICS-ABORT-EXIT.                                   01091000
010920     IF RPXXX10-SK-MODEL IS NOT EQUAL TO COM-KEY-MODEL            01092000
010930         MOVE RPXXX10-SK-MODEL TO COM-KEY-MODEL                   01093000
010940         MOVE RPXXX10-SK-MODEL TO COM-MODEL.                      01094000
010950     MOVE RPXXX10-FUNC TO COM-FUNC.                               01095000
010960     MOVE RPXXX10-ABORT TO COM-ABORT.                             01096000
010970     MOVE RPXXX10-MSGNBR TO WS-MSGNBR.                            01097000
010980 CRLM-EXIT.                                                       01098000
010990     EXIT.                                                        01099000
011000******************************************************************01100000
011010 CLOSE-PANEL SECTION.                                             01101000
011020 CP-START.                                                        01102000
011030     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       01103000
011040     IF COM-RETURN IS EQUAL TO 'E'                                01104000
011050         PERFORM CALL-BISPAN-RPV365K.                             01105000
011060     IF COM-RETURN IS EQUAL TO '1'                                01106000
011070         PERFORM CALL-BISPAN-RPV365.                              01107000
011080 CP-EXIT.                                                         01108000
011090     EXIT.                                                        01109000
011100******************************************************************01110000
011110 CALL-BISPAN-RPV365K SECTION.                                     01111000
011120 CBD1-START.                                                      01112000
011130     CALL 'BISPAN' USING                                          01113000
011140         BICRPSB,                                                 01114000
011150         BICRSRB,                                                 01115000
011160         BICRPAN,                                                 01116000
011170         RPV365K-PANL-DATA-BLOCK,                                 01117000
011180         RPV365K-PANL-DATA-AREA.                                  01118000
011190 CBD1-EXIT.                                                       01119000
011200     EXIT.                                                        01120000
011210******************************************************************01121000
011220 CALL-BISPAN-RPV365 SECTION.                                      01122000
011230 CBD2-START.                                                      01123000
011240     CALL 'BISPAN' USING                                          01124000
011250         BICRPSB,                                                 01125000
011260         BICRSRB,                                                 01126000
011270         BICRPAN,                                                 01127000
011280         RPV365-PANL-DATA-BLOCK,                                  01128000
011290         RPV365-PANL-DATA-AREA.                                   01129000
011300 CBD2-EXIT.                                                       01130000
011310     EXIT.                                                        01131000
011320******************************************************************01132000
011330 PANEL-GET-RPV365 SECTION.                                        01133000
011340 PANEL-GET-RPV365-START.                                          01134000
011350     MOVE 'N' TO RPV365-SW-SET-CURSOR.                            01135000
011360     MOVE PDB-RPV365-NAME TO PAN-NAME.                            01136000
011370     MOVE REQ-GET TO PAN-REQ-VERB.                                01137000
011380     CALL 'BISPAN' USING                                          01138000
011390         BICRPSB                                                  01139000
011400         BICRSRB                                                  01140000
011410         BICRPAN                                                  01141000
011420         RPV365-PANL-DATA-BLOCK,                                  01142000
011430         RPV365-PANL-DATA-AREA.                                   01143000
011440 PANEL-GET-RPV365-EXIT.                                           01144000
011450     EXIT.                                                        01145000
011460******************************************************************01146000
011470 PANEL-PUT-RPV365 SECTION.                                        01147000
011480 PANEL-PUT-RPV365-START.                                          01148000
011490     MOVE PDB-RPV365-NAME TO PAN-NAME.                            01149000
011500     MOVE REQ-PUT TO PAN-REQ-VERB.                                01150000
011510     CALL 'BISPAN' USING                                          01151000
011520         BICRPSB                                                  01152000
011530         BICRSRB                                                  01153000
011540         BICRPAN                                                  01154000
011550         RPV365-PANL-DATA-BLOCK,                                  01155000
011560         RPV365-PANL-DATA-AREA.                                   01156000
011570 PANEL-PUT-RPV365-EXIT.                                           01157000
011580     EXIT.                                                        01158000
011590******************************************************************01159000
011600 PANEL-GET-RPV365K SECTION.                                       01160000
011610 PANEL-GET-RPV365K-START.                                         01161000
011620     MOVE 'N' TO RPV365K-SW-SET-CURSOR.                           01162000
011630     MOVE PDB-RPV365K-NAME TO PAN-NAME.                           01163000
011640     MOVE REQ-GET TO PAN-REQ-VERB.                                01164000
011650     CALL 'BISPAN' USING                                          01165000
011660         BICRPSB                                                  01166000
011670         BICRSRB                                                  01167000
011680         BICRPAN                                                  01168000
011690         RPV365K-PANL-DATA-BLOCK,                                 01169000
011700         RPV365K-PANL-DATA-AREA.                                  01170000
011710 PANEL-GET-RPV365K-EXIT.                                          01171000
011720     EXIT.                                                        01172000
011730******************************************************************01173000
011740 PANEL-PUT-RPV365K SECTION.                                       01174000
011750 PANEL-PUT-RPV365K-START.                                         01175000
011760     MOVE PDB-RPV365K-NAME TO PAN-NAME.                           01176000
011770     MOVE REQ-PUT TO PAN-REQ-VERB.                                01177000
011780     CALL 'BISPAN' USING                                          01178000
011790         BICRPSB                                                  01179000
011800         BICRSRB                                                  01180000
011810         BICRPAN                                                  01181000
011820         RPV365K-PANL-DATA-BLOCK,                                 01182000
011830         RPV365K-PANL-DATA-AREA.                                  01183000
011840 PANEL-PUT-RPV365K-EXIT.                                          01184000
011850     EXIT.                                                        01185000
011860******************************************************************01186000
011870 MIC-MST-API SECTION.                                             01187000
000000 COPY MIPMSTA.                                                    01188000
011890******************************************************************01189000
011900 EDIT-ACCOUNT-KEY SECTION.                                        01190000
011910 EAK-START.                                                       01191000
011920     MOVE COM-INST TO RPW130-INST.                                01192000
011930     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 01193000
011940     MOVE COM-KEY-PRODCODE TO RPW130-PRODCODE.                    01194000
011950     MOVE COM-KEY-ACCOUNT TO RPW130-ACCOUNTINPUT.                 01195000
011960     MOVE 'V' TO RPW130-FUNCTION.                                 01196000
011970     PERFORM ACCOUNT-KEY-EDIT.                                    01197000
011980     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01198000
011990         MOVE '500003' TO WS-MSGNBR                               01199000
012000         GO TO EAK-EXIT.                                          01200000
012010     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       01201000
012020     MOVE RPW130-ACCOUNTKEY TO COM-KEY-ACCOUNT.                   01202000
012030     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          01203000
012040     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      01204000
012050     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                01205000
012060 EAK-EXIT.                                                        01206000
012070     EXIT.                                                        01207000
012080******************************************************************01208000
012090 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 01209000
000000 COPY RPP033.                                                     01210000
012110******************************************************************01211000
012120 ACCOUNT-KEY-EDIT SECTION.                                        01212000
000000 COPY RPP130.                                                     01213000
012140******************************************************************01214000
012150 LEFT-JUSTIFY SECTION.                                            01215000
000000 COPY SRP068.                                                     01216000
012170******************************************************************01217000
012180 RIGHT-JUSTIFY SECTION.                                           01218000
000000 COPY SRP026.                                                     01219000
012200******************************************************************01220000
012210 PARAMETER-SEARCH SECTION.                                        01221000
000000 COPY SRP030.                                                     01222000
012230******************************************************************01223000
012240 COMPRESS-NEXTKEY SECTION.                                        01224000
000000 COPY SRP070.                                                     01225000
012260******************************************************************01226000
012270 GET-MESSAGE SECTION.                                             01227000
000000 COPY SRP071.                                                     01228000
012290******************************************************************01229000
012300 EDIT-CODASYL-DATE SECTION.                                       01230000
000000 COPY SRP087.                                                     01231000
012320******************************************************************01232000
012330 STRIP-EDIT-VALIDATE SECTION.                                     01233000
000000 COPY SRP161.                                                     01234000
012350******************************************************************01235000
012360 EXAMINE-FIELD SECTION.                                           01236000
000000 COPY SRP166.                                                     01237000
012380******************************************************************01238000
012390 SRP170-ROUTINE SECTION.                                          01239000
000000 COPY SRP170.                                                     01240000
012410******************************************************************01241000
012420 BUILD-PFKEY-LINE SECTION.                                        01242000
000000 COPY SRP710.                                                     01243000
012440******************************************************************01244000
012450 VALIDATE-PFKEYS SECTION.                                         01245000
000000 COPY SRP711.                                                     01246000
012470******************************************************************01247000
012480 SLP096-GET-2023-RECORD SECTION.                                  01248000
000000 COPY SLP096.                                                     01249000
012500******************************************************************01250000
012510 CICS-XCTL SECTION.                                               01251000
000000 COPY SLP704.                                                     01252000
012530******************************************************************01253000
012540 CICS-RETURN-TRANSID SECTION.                                     01254000
000000 COPY SLP710.                                                     01255000
012560******************************************************************01256000
012570 TSQ-DELETE SECTION.                                              01257000
012580 TSQD-START.                                                      01258000
012590 TSQD-EXIT.                                                       01259000
012600     EXIT.                                                        01260000
012610******************************************************************01261000
012620 CICS-TSQ-READ SECTION.                                           01262000
000000 COPY SLP744.                                                     01263000
012640******************************************************************01264000
012650 CICS-ABORT-EXIT SECTION.                                         01265000
000000 COPY SLP798.                                                     01266000
012670******************************************************************01267000
