000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL370.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL370 - TRANSACTION ACCUMULATOR INQUIRY                    *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRCONS.                                                    00024000
000000 COPY BICRCONS.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRPAN.                                                     00028000
000000 COPY BICRPAN.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  RPV370K-PANL-DATA-BLOCK.                                     00032000
000000 COPY RPV370KW.                                                   00033000
000340 01  RPV370-PANL-DATA-BLOCK.                                      00034000
000000 COPY RPV370W.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00037000
000380     03  WS-NEXTKEY.                                              00038000
000390         05  WS-EXTID            PIC X(08).                       00039000
000400         05  WS-DELIM1           PIC X(01)       VALUE ','.       00040000
000410         05  WS-DATA.                                             00041000
000420             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00042000
000430             07  WS-DELIM2       PIC X(01)       VALUE ','.       00043000
000440             07  WS-ACCTX.                                        00044000
000450                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00045000
000460             07  WS-DELIM3       PIC X(01)       VALUE ','.       00046000
000470             07  WS-MODEL        PIC X(10)       VALUE SPACES.    00047000
000480         05  FILLER              PIC X(33)       VALUE SPACES.    00048000
000490     03  WS-MORE                 PIC X(05)       VALUE 'More:'.   00049000
000500     03  WS-LNKPROG1             PIC X(08)       VALUE 'RPLTRM01'.00050000
000510     03  WS-LKLGTH               PIC S9(04)      COMP             00051000
000520                                                 VALUE +4088.     00052000
000530     03  WS-DCHG-TEST            PIC X(01)       VALUE SPACE.     00053000
000540         88  WS-DCHG-PROTECT                     VALUE 'P'.       00054000
000550         88  WS-DCHG-EDITERR                     VALUE 'E'.       00055000
000560         88  WS-DCHG-HIDDEN                      VALUE 'H'.       00056000
000570     03  WS-ERROR-COUNT          PIC S9(04)      COMP             00057000
000580                                                 VALUE ZERO.      00058000
000590     03  WS-PDATE                PIC 9(08).                       00059000
000600     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00060000
000610         05  WS-PDATE-YYYY       PIC 9(04).                       00061000
000620         05  WS-PDATE-MM         PIC 9(02).                       00062000
000630         05  WS-PDATE-DD         PIC 9(02).                       00063000
000640     03  WS-FORMAT-DATE.                                          00064000
000650         05  WS-FORMAT-MM        PIC 9(02).                       00065000
000660         05  WS-FORMAT-DASH1     PIC X(01)       VALUE '-'.       00066000
000670         05  WS-FORMAT-DD        PIC 9(02).                       00067000
000680         05  WS-FORMAT-DASH2     PIC X(01)       VALUE '-'.       00068000
000690         05  WS-FORMAT-YYYY      PIC 9(04).                       00069000
000700     03  WS-SUB1                 PIC S9(04)      COMP             00070000
000710                                                 VALUE +0000.     00071000
000720     03  WS-SUB2                 PIC S9(04)      COMP             00072000
000730                                                 VALUE +0000.     00073000
000740     03  WS-TRAN-AMOUNT          PIC ZZ,ZZZ,ZZZ,ZZZ.99-.          00074000
000750     03  WS-REQ-AMOUNT           PIC ZZZ,ZZZ,ZZZ.99-.             00075000
000760     03  WS-COUNT                PIC ZZ,ZZ9.                      00076000
000770 01  WS-LINKMSG                  PIC X(4500).                     00077000
000780 01  RPTRM01-MESSAGE.                                             00078000
000000 COPY MISCNT00      REPLACING                                     00079000
000800             ==:MICNT:== BY ==RPTRM01==.                          00080000
000000 COPY RPSTRM01.                                                   00081000
000820 01  WS-TSQAREAS.                                                 00082000
000830     03  WS-TSQITEM              PIC S9(04)      COMP             00083000
000840                                                 VALUE +0001.     00084000
000850     03  WS-TSQLGTH              PIC S9(04)      COMP             00085000
000860                                                 VALUE +4096.     00086000
000870     03  WS-TSQKEY.                                               00087000
000880         05  WS-TSQID            PIC X(04).                       00088000
000890         05  WS-TSQTRMID         PIC X(04).                       00089000
000900 01  LS-TSQAREA.                                                  00090000
000910     03  LS-TSQKEY               PIC X(08).                       00091000
000920     03  LS-TSQDATA              PIC X(4088).                     00092000
000930 01  MIWPRI-AREAS.                                                00093000
000000 COPY MIWPRI.                                                     00094000
000950 01  MIWMSTA-AREAS.                                               00095000
000000 COPY MIWMSTA.                                                    00096000
000970 01  MIMST-RECORD.                                                00097000
000000 COPY MISMST.                                                     00098000
000990 01  MI2023-RECORD.                                               00099000
000000 COPY MIS2023A.                                                   00100000
001010 01  WS-ABORTCODES.                                               00101000
001020     03  WS-AB0009               PIC S9(04)      COMP             00102000
001030                                                 VALUE +0009.     00103000
001040     03  WS-AB0106               PIC S9(04)      COMP             00104000
001050                                                 VALUE +0106.     00105000
001060     03  WS-AB2033               PIC S9(04)      COMP             00106000
001070                                                 VALUE +2033.     00107000
001080     03  WS-AB6345               PIC S9(04)      COMP             00108000
001090                                                 VALUE +6345.     00109000
001100 01  WS-TRACECODES.                                               00110000
001110     03  WS-TR0001               PIC S9(04)      COMP             00111000
001120                                                 VALUE +0001.     00112000
001130     03  WS-TR0002               PIC S9(04)      COMP             00113000
001140                                                 VALUE +0002.     00114000
001150 01  SLW096-AREAS.                                                00115000
000000 COPY SLW096.                                                     00116000
001170 01  RPW014-AREAS.                                                00117000
000000 COPY RPW014.                                                     00118000
001190 01  RPW130-AREAS.                                                00119000
000000 COPY RPW130.                                                     00120000
001210 01  SRW000-AREAS.                                                00121000
000000 COPY SRW000.                                                     00122000
001230 01  SRW025-AREAS.                                                00123000
000000 COPY SRW025.                                                     00124000
001250 01  SRW030-AREAS.                                                00125000
000000 COPY SRW030.                                                     00126000
001270 01  SRW031-AREAS.                                                00127000
000000 COPY SRW031.                                                     00128000
001290 01  SRW067-AREAS.                                                00129000
000000 COPY SRW067.                                                     00130000
001310 01  SRW105-AREAS.                                                00131000
000000 COPY SRW105.                                                     00132000
001330 01  SRW161-AREAS.                                                00133000
000000 COPY SRW161.                                                     00134000
001350 01  SRW170-AREAS.                                                00135000
000000 COPY SRW170.                                                     00136000
001370 COPY DFHAID.                                                     00137000
001380******************************************************************00138000
001390 LINKAGE SECTION.                                                 00139000
001400 01  DFHCOMMAREA.                                                 00140000
000000 COPY SLS1112.                                                    00141000
001420     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00142000
001430         05  COM-EDIT-DATE       PIC X(10).                       00143000
001440         05  COM-KEY-INFO.                                        00144000
001450             07  COM-KEY-DATA.                                    00145000
001460                 09  COM-SK-INST PIC 9(04).                       00146000
001470                 09  COM-SK-PRODCODE                              00147000
001480                                 PIC X(06).                       00148000
001490                 09  COM-SK-ACCOUNT                               00149000
001500                                 PIC X(18).                       00150000
001510                 09  COM-SK-ACCOUNT-N                             00151000
001520                         REDEFINES COM-SK-ACCOUNT                 00152000
001530                                 PIC 9(18).                       00153000
001540                 09  COM-SK-MODEL                                 00154000
001550                                 PIC X(10).                       00155000
001560                 09  COM-SK-IDNBRX                                00156000
001570                                 PIC X(18).                       00157000
001580                 09  COM-SK-IDNBR                                 00158000
001590                             REDEFINES COM-SK-IDNBRX              00159000
001600                                 PIC 9(18).                       00160000
001610         05  COM-NBR-OCCURS      PIC S9(05)      COMP-3.          00161000
001620         05  COM-END-FILE-INST   PIC X(01).                       00162000
001630         05  COM-PANEL-ACTION    PIC X(01).                       00163000
001640             88  INITIAL-PANEL                   VALUE ' '.       00164000
001650             88  EDIT-PANEL                      VALUE 'E'.       00165000
001660         05  COM-FROM-PANEL      PIC X(01).                       00166000
001670             88  FROM-KEY-PANEL                  VALUE 'K'.       00167000
001680             88  FROM-INFO-PANEL                 VALUE 'I'.       00168000
001690             88  FROM-HELP                       VALUE 'H'.       00169000
001700             88  FROM-BREAKAWAY                  VALUE 'B'.       00170000
001710         05  COM-KEY-FORMATTEDACCT                                00171000
001720                                 PIC X(22).                       00172000
001730         05  COM-KEY-MSGNBR      PIC X(06).                       00173000
001740         05  COM-KEY-COMMAND     PIC X(50).                       00174000
001750         05  COM-FIRST-KEY       PIC X(56).                       00175000
001760         05  COM-SELECT-KEY      PIC X(56).                       00176000
001770         05  COM-LAST-KEY        PIC X(56).                       00177000
001780         05  COM-MORE            PIC X(01).                       00178000
001790         05  COM-FIRSTSW         PIC X(01).                       00179000
001800******************************************************************00180000
001810*01  SLW096-2023RECORDS.                                          00181000
000000 COPY SLW096L.                                                    00182000
001830******************************************************************00183000
001840 PROCEDURE DIVISION.                                              00184000
001850******************************************************************00185000
001860 ENTRY-ROUTINE SECTION.                                           00186000
001870     MOVE 'RPL370' TO COM-ABPROGID.                               00187000
000000 COPY SLP771.                                                     00188000
001890******************************************************************00189000
001900 TRANSACTION-CLEAN-UP SECTION.                                    00190000
001910 TCU-START.                                                       00191000
001920 TCU-EXIT.                                                        00192000
001930     EXIT.                                                        00193000
001940******************************************************************00194000
001950 CICS-HANDLE-CONDITION SECTION.                                   00195000
000000 COPY SLP772.                                                     00196000
001970     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00197000
001980         GO TO CTSRI-EXIT.                                        00198000
001990     MOVE WS-AB2033 TO COM-ABORT.                                 00199000
002000     MOVE WS-TR0001 TO COM-ABTRACE.                               00200000
002010     GO TO ABORT-EXIT.                                            00201000
002020 CHC-EXIT.                                                        00202000
002030     EXIT.                                                        00203000
002040******************************************************************00204000
002050 ROUTING-ROUTINE SECTION.                                         00205000
002060 RR-START.                                                        00206000
002070     MOVE LOW-VALUES TO RPTRM01-MESSAGE.                          00207000
002080     MOVE LOW-VALUES TO RPV370-PANL-DATA-AREA.                    00208000
002090     MOVE LOW-VALUES TO RPV370K-PANL-DATA-AREA.                   00209000
002100     MOVE ALL ZEROS TO WS-MSGNBR.                                 00210000
002110     MOVE 'RP00' TO WS-TSQFILEID.                                 00211000
002120     MOVE 'RPI' TO WS-TSQSYSID.                                   00212000
002130     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00213000
002140     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00214000
002150     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00215000
002160         MOVE COM-PAN TO BICRPAN                                  00216000
002170         MOVE COM-PSB TO BICRPSB                                  00217000
002180         MOVE COM-SRB TO BICRSRB                                  00218000
002190     ELSE                                                         00219000
002200         MOVE '1' TO BPSB-LEVEL.                                  00220000
002210     IF COM-RETURN IS EQUAL TO 'B'                                00221000
002220         GO TO BREAKAWAY-RETURN.                                  00222000
002230     IF COM-RETURN IS EQUAL TO '0'                                00223000
002240         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00224000
002250         MOVE SPACES TO COM-WORKAREAS                             00225000
002260         MOVE '1' TO SRB-VERSION                                  00226000
002270         MOVE 'IPRP' TO SRB-APPL-ID                               00227000
002280         MOVE 'RPL370' TO SRB-PROG-ID                             00228000
002290         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00229000
002300         MOVE 'P' TO PAN-TYPE                                     00230000
002310         MOVE SPACE TO PAN-OVERLAY                                00231000
002320         MOVE SPACE TO PAN-CLOSE                                  00232000
002330         MOVE SPACE TO PAN-ALARM                                  00233000
002340         MOVE SPACE TO PAN-CURSOR-PAN                             00234000
002350         MOVE SPACE TO PAN-CURSOR-FLD                             00235000
002360         MOVE SPACE TO PAN-SET-FLD                                00236000
002370         MOVE SPACE TO PAN-SET-VID                                00237000
002380         MOVE SPACE TO PAN-SET-EMP                                00238000
002390         MOVE PDB-RPV370K-NAME TO PAN-NAME                        00239000
002400         PERFORM PANEL-INIT                                       00240000
002410         MOVE BICRPAN TO COM-PAN                                  00241000
002420         MOVE BICRPSB TO COM-PSB                                  00242000
002430         MOVE BICRSRB TO COM-SRB                                  00243000
002440         PERFORM INITIALIZE-DATE                                  00244000
002450         GO TO PANEL-ROUTER.                                      00245000
002460     PERFORM PANEL-NAME-SET.                                      00246000
002470     IF COM-HELPSW IS EQUAL TO 'Y'                                00247000
002480         GO TO HELP-RETURN.                                       00248000
002490     PERFORM PANEL-RECEIVE.                                       00249000
002500     PERFORM PANEL-DATA-GET.                                      00250000
002510     PERFORM PANEL-PFKEY-SET.                                     00251000
002520     PERFORM VALIDATE-PFKEYS.                                     00252000
002530     IF EIBAID IS EQUAL TO DFHPF1                                 00253000
002540         GO TO GET-HELP.                                          00254000
002550     IF EIBAID IS EQUAL TO DFHPF11                                00255000
002560         GO TO BREAK-AWAY.                                        00256000
002570     IF (COM-RETURN IS EQUAL TO 'E')                              00257000
002580         AND (EIBAID IS EQUAL TO DFHPF2                           00258000
002590         OR EIBAID IS EQUAL TO DFHPF3                             00259000
002600         OR EIBAID IS EQUAL TO DFHPF4                             00260000
002610         OR EIBAID IS EQUAL TO DFHPF7                             00261000
002620         OR EIBAID IS EQUAL TO DFHPF8                             00262000
002630         OR EIBAID IS EQUAL TO DFHPF12)                           00263000
002640         GO TO CLOSE-TRANSACTION.                                 00264000
002650     IF COM-RETURN IS EQUAL TO '1'                                00265000
002660         AND EIBAID IS EQUAL TO DFHPF12                           00266000
002670         GO TO CLOSE-TRANSACTION.                                 00267000
002680     IF COM-RETURN IS EQUAL TO '0'                                00268000
002690         OR COM-RETURN IS EQUAL TO 'E'                            00269000
002700         OR COM-RETURN IS EQUAL TO '1'                            00270000
002710         GO TO PANEL-ROUTER.                                      00271000
002720 RR-END.                                                          00272000
002730     GO TO CLOSE-TRANSACTION.                                     00273000
002740 RR-EXIT.                                                         00274000
002750     EXIT.                                                        00275000
002760******************************************************************00276000
002770 INITIALIZE-DATE SECTION.                                         00277000
002780 ID-START.                                                        00278000
002790     MOVE COM-DATE TO WS-CURDATE8.                                00279000
002800     MOVE '-' TO WS-CD8DSH1.                                      00280000
002810     MOVE '-' TO WS-CD8DSH2.                                      00281000
002820     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00282000
002830 ID-EXIT.                                                         00283000
002840     EXIT.                                                        00284000
002850******************************************************************00285000
002860 PANEL-NAME-SET SECTION.                                          00286000
002870 PNS-START.                                                       00287000
002880     IF COM-RETURN IS EQUAL TO '0'                                00288000
002890         MOVE PDB-RPV370K-NAME TO PAN-NAME.                       00289000
002900     IF COM-RETURN IS EQUAL TO 'E'                                00290000
002910         MOVE PDB-RPV370K-NAME TO PAN-NAME.                       00291000
002920     IF COM-RETURN IS EQUAL TO '1'                                00292000
002930         MOVE PDB-RPV370-NAME TO PAN-NAME.                        00293000
002940 PNS-EXIT.                                                        00294000
002950     EXIT.                                                        00295000
002960******************************************************************00296000
002970 PANEL-DATA-GET SECTION.                                          00297000
002980 PDG-START.                                                       00298000
002990     IF COM-RETURN IS EQUAL TO '0'                                00299000
003000         PERFORM PANEL-GET-RPV370K.                               00300000
003010     IF COM-RETURN IS EQUAL TO 'E'                                00301000
003020         PERFORM PANEL-GET-RPV370K                                00302000
003030         MOVE RPV370K-COMMAND TO WS-NEXTKEY                       00303000
003040         MOVE PDB-RPV370K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00304000
003050     IF COM-RETURN IS EQUAL TO '1'                                00305000
003060         PERFORM PANEL-GET-RPV370                                 00306000
003070         MOVE RPV370-COMMAND TO WS-NEXTKEY                        00307000
003080         MOVE PDB-RPV370-COMMAND-DCHG TO WS-COMMAND-DCHG.         00308000
003090 PDG-EXIT.                                                        00309000
003100     EXIT.                                                        00310000
003110******************************************************************00311000
003120 PANEL-PFKEY-SET SECTION.                                         00312000
003130 PPS-START.                                                       00313000
003140 PPS-EXIT.                                                        00314000
003150     EXIT.                                                        00315000
003160******************************************************************00316000
003170 PANEL-ROUTER SECTION.                                            00317000
003180 PR-START.                                                        00318000
003190     IF COM-RETURN IS EQUAL TO '0'                                00319000
003200         GO TO PROCESS-KEY-PANEL.                                 00320000
003210     IF COM-RETURN IS EQUAL TO 'E'                                00321000
003220         GO TO PROCESS-KEY-PANEL.                                 00322000
003230     IF COM-RETURN IS EQUAL TO '1'                                00323000
003240         GO TO PROCESS-INFO-PANEL.                                00324000
003250     GO TO CLOSE-TRANSACTION.                                     00325000
003260 PR-EXIT.                                                         00326000
003270     EXIT.                                                        00327000
003280******************************************************************00328000
003290 HELP-RETURN SECTION.                                             00329000
000000 COPY SRP074.                                                     00330000
003310******************************************************************00331000
003320 HELP-RETURN-FINISH SECTION.                                      00332000
003330 HRF-START.                                                       00333000
003340     PERFORM PANEL-DATA-GET.                                      00334000
003350     MOVE 'H' TO COM-FROM-PANEL.                                  00335000
003360     GO TO PANEL-ROUTER.                                          00336000
003370 HRF-EXIT.                                                        00337000
003380     EXIT.                                                        00338000
003390******************************************************************00339000
003400 HELP-MISSING-FINISH SECTION.                                     00340000
003410 HMF-START.                                                       00341000
003420     MOVE 'H' TO COM-FROM-PANEL.                                  00342000
003430     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00343000
003440     GO TO PANEL-ROUTER.                                          00344000
003450 HMF-EXIT.                                                        00345000
003460     EXIT.                                                        00346000
003470******************************************************************00347000
003480 BREAK-AWAY SECTION.                                              00348000
000000 COPY SRP0752.                                                    00349000
003500******************************************************************00350000
003510 BREAKAWAY-RETURN-FINISH SECTION.                                 00351000
003520 BRF-START.                                                       00352000
003530     PERFORM PANEL-DATA-GET.                                      00353000
003540     MOVE 'B' TO COM-FROM-PANEL.                                  00354000
003550     GO TO PANEL-ROUTER.                                          00355000
003560 BRF-EXIT.                                                        00356000
003570     EXIT.                                                        00357000
003580******************************************************************00358000
003590 PROCESS-KEY-PANEL SECTION.                                       00359000
003600 PKP-START.                                                       00360000
003610     IF INITIAL-PANEL                                             00361000
003620         GO TO PKP-COM-INIT.                                      00362000
003630     IF EDIT-PANEL                                                00363000
003640         AND FROM-INFO-PANEL                                      00364000
003650         MOVE SPACE TO COM-FROM-PANEL                             00365000
003660         GO TO PKP-RELOAD-PANEL.                                  00366000
003670 PKP-COM-INIT.                                                    00367000
003680     MOVE COM-NEXTKEY TO SR-PSLIST.                               00368000
003690     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00369000
003700         GO TO PKP-SEND-PANEL.                                    00370000
003710 PKP-BEGIN-EDITS.                                                 00371000
003720     IF EDIT-PANEL                                                00372000
003730         MOVE RPV370K-PRODCD TO COM-SK-PRODCODE                   00373000
003740         MOVE RPV370K-ACCOUNT TO COM-SK-ACCOUNT                   00374000
003750         MOVE RPV370K-MODEL TO COM-SK-MODEL                       00375000
003760         MOVE RPV370K-IDNBR TO COM-SK-IDNBRX                      00376000
003770         GO TO PKP-RETURN-EDITS.                                  00377000
003780     PERFORM PARAMETER-SEARCH.                                    00378000
003790     MOVE SR-PSPARM TO COM-EXTID.                                 00379000
003800     MOVE SR-PSPARM TO COM-EXTERNALID.                            00380000
003810     PERFORM PARAMETER-SEARCH.                                    00381000
003820     MOVE SR-PSPARM TO COM-SK-PRODCODE.                           00382000
003830     PERFORM PARAMETER-SEARCH.                                    00383000
003840     MOVE SR-PSPARM TO COM-SK-ACCOUNT.                            00384000
003850     PERFORM PARAMETER-SEARCH.                                    00385000
003860     MOVE SR-PSPARM TO COM-SK-MODEL.                              00386000
003870     PERFORM PARAMETER-SEARCH.                                    00387000
003880     MOVE SR-PSPARM TO COM-SK-IDNBRX.                             00388000
003890 PKP-RETURN-EDITS.                                                00389000
003900     IF COM-SK-PRODCODE IS EQUAL TO SPACE                         00390000
003910         MOVE LOW-VALUE TO COM-SK-PRODCODE.                       00391000
003920     IF COM-SK-ACCOUNT IS EQUAL TO SPACE                          00392000
003930         MOVE LOW-VALUE TO COM-SK-ACCOUNT.                        00393000
003940     IF COM-SK-MODEL IS EQUAL TO SPACES                           00394000
003950         MOVE LOW-VALUES TO COM-SK-MODEL.                         00395000
003960     IF COM-SK-IDNBRX IS EQUAL TO SPACES                          00396000
003970         MOVE LOW-VALUES TO COM-SK-IDNBRX.                        00397000
003980     IF COM-SK-PRODCODE IS EQUAL TO LOW-VALUE                     00398000
003990         AND COM-SK-ACCOUNT IS EQUAL TO LOW-VALUE                 00399000
004000         AND COM-SK-IDNBRX IS GREATER THAN LOW-VALUE              00400000
004010         GO TO PKP-RETURN-CONT.                                   00401000
004020     IF COM-SK-PRODCODE IS EQUAL TO LOW-VALUE                     00402000
004030         MOVE '000002' TO WS-MSGNBR                               00403000
004040         GO TO PKP-RETURN-CONT.                                   00404000
004050     PERFORM EDIT-ACCOUNT-KEY.                                    00405000
004060 PKP-RETURN-CONT.                                                 00406000
004070     IF INITIAL-PANEL                                             00407000
004080         AND COM-SK-PRODCODE IS EQUAL TO LOW-VALUE                00408000
004090         AND COM-SK-ACCOUNT IS EQUAL TO LOW-VALUE                 00409000
004100         AND COM-SK-MODEL IS EQUAL TO LOW-VALUE                   00410000
004110         AND COM-SK-IDNBRX IS EQUAL TO LOW-VALUE                  00411000
004120         MOVE '000001' TO WS-MSGNBR                               00412000
004130         GO TO PKP-SEND-PANEL.                                    00413000
004140     MOVE COM-SK-IDNBRX TO SR-JUSTIFYIN.                          00414000
004150     MOVE +0018 TO SR-JLGTH.                                      00415000
004160     PERFORM RIGHT-JUSTIFY.                                       00416000
004170     IF SR-JUSTIFYOUT IS EQUAL TO SPACE                           00417000
004180         MOVE ZEROS TO COM-SK-IDNBRX                              00418000
004190     ELSE                                                         00419000
004200         MOVE SR-JUSTIFYOUT TO COM-SK-IDNBRX.                     00420000
004210     IF COM-SK-IDNBRX IS NOT NUMERIC                              00421000
004220         MOVE ZEROES TO COM-SK-IDNBRX.                            00422000
004230     MOVE COM-SK-PRODCODE TO COM-PRODCODE.                        00423000
004240     MOVE COM-SK-ACCOUNT TO COM-ACCOUNTALPHA.                     00424000
004250     IF COM-SK-ACCOUNT-N IS NUMERIC                               00425000
004260         MOVE COM-SK-ACCOUNT-N TO COM-ACCOUNT                     00426000
004270     ELSE                                                         00427000
004280         MOVE ZERO TO COM-ACCOUNT.                                00428000
004290     IF FROM-BREAKAWAY                                            00429000
004300         OR FROM-HELP                                             00430000
004310         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00431000
004320         GO TO PKP-RELOAD-PANEL.                                  00432000
004330     IF COM-SK-PRODCODE IS GREATER THAN SPACES                    00433000
004340         AND COM-SK-ACCOUNT IS GREATER THAN SPACES                00434000
004350         AND COM-SK-MODEL IS GREATER THAN SPACES                  00435000
004360         AND COM-SK-IDNBRX IS GREATER THAN ZEROS                  00436000
004370         MOVE '000002' TO WS-MSGNBR                               00437000
004380         GO TO PKP-RELOAD-PANEL.                                  00438000
004390 PKP-EDITS-READY.                                                 00439000
004400     MOVE SPACE TO COM-PANEL-ACTION.                              00440000
004410     MOVE '1' TO COM-RETURN.                                      00441000
004420     MOVE 'K' TO COM-FROM-PANEL.                                  00442000
004430     GO TO PANEL-ROUTER.                                          00443000
004440 PKP-RELOAD-PANEL.                                                00444000
004450     IF COM-SK-PRODCODE IS EQUAL TO SPACES                        00445000
004460         MOVE LOW-VALUES TO RPV370K-PRODCD                        00446000
004470     ELSE                                                         00447000
004480         MOVE COM-SK-PRODCODE TO RPV370K-PRODCD.                  00448000
004490     IF COM-SK-ACCOUNT IS EQUAL TO SPACES                         00449000
004500         OR COM-SK-ACCOUNT IS EQUAL TO ZEROS                      00450000
004510         MOVE LOW-VALUES TO RPV370K-ACCOUNT                       00451000
004520     ELSE                                                         00452000
004530         MOVE COM-SK-ACCOUNT TO RPV370K-ACCOUNT.                  00453000
004540     MOVE COM-SK-MODEL TO RPV370K-MODEL.                          00454000
004550     IF COM-SK-MODEL IS EQUAL TO SPACES                           00455000
004560         MOVE LOW-VALUES TO RPV370K-MODEL.                        00456000
004570     MOVE COM-SK-IDNBRX TO RPV370K-IDNBR.                         00457000
004580     IF COM-SK-IDNBRX IS NOT GREATER THAN ZEROS                   00458000
004590         MOVE LOW-VALUES TO RPV370K-IDNBR.                        00459000
004600 PKP-SEND-PANEL.                                                  00460000
004610     MOVE PDB-RPV370K-NAME TO PAN-NAME.                           00461000
004620     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00462000
004630     IF FROM-HELP                                                 00463000
004640         OR FROM-BREAKAWAY                                        00464000
004650         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00465000
004660         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00466000
004670     ELSE                                                         00467000
004680         IF WS-CURSOR-FIELD IS EQUAL TO SPACE                     00468000
004690             MOVE PDB-RPV370K-PRODCD TO PAN-SET-FLD               00469000
004700         ELSE                                                     00470000
004710             MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                 00471000
004720     PERFORM CALL-BISPAN-RPV370K.                                 00472000
004730     MOVE COM-OPERID TO RPV370K-OPERID.                           00473000
004740     MOVE COM-INST TO RPV370K-INST.                               00474000
004750     MOVE COM-EDIT-DATE TO RPV370K-SYSDATE.                       00475000
004760     IF RPV370K-PRODCD IS EQUAL TO SPACES                         00476000
004770         MOVE LOW-VALUES TO RPV370K-PRODCD.                       00477000
004780     MOVE RPV370K-ACCOUNT TO SR-JUSTLONGIN.                       00478000
004790     MOVE +18 TO SR-JLGTH.                                        00479000
004800     PERFORM LEFT-JUSTIFY.                                        00480000
004810     MOVE SR-JUSTLONGOUT TO RPV370K-ACCOUNT.                      00481000
004820     IF RPV370K-ACCOUNT IS EQUAL TO SPACES                        00482000
004830         MOVE LOW-VALUES TO RPV370K-ACCOUNT.                      00483000
004840     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00484000
004850         MOVE WS-HELPMSG TO WS-MSGNBR.                            00485000
004860     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00486000
004870         MOVE '000027' TO WS-MSGNBR                               00487000
004880     ELSE                                                         00488000
004890         PERFORM BUILD-NEXTKEY                                    00489000
004900         PERFORM COMPRESS-NEXTKEY                                 00490000
004910         MOVE WS-NEXTKEY TO RPV370K-COMMAND.                      00491000
004920     IF FROM-BREAKAWAY                                            00492000
004930         OR FROM-HELP                                             00493000
004940         MOVE SPACE TO COM-FROM-PANEL                             00494000
004950         MOVE COM-KEY-COMMAND TO RPV370K-COMMAND                  00495000
004960         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00496000
004970     ELSE                                                         00497000
004980         MOVE RPV370K-COMMAND TO COM-KEY-COMMAND                  00498000
004990         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00499000
005000     MOVE 'E' TO COM-RETURN.                                      00500000
005010     PERFORM GET-MESSAGE.                                         00501000
005020     MOVE WS-MESSAGE TO RPV370K-MSGLINE.                          00502000
005030     PERFORM PANEL-PFKEY-SET.                                     00503000
005040     PERFORM BUILD-PFKEY-LINE.                                    00504000
005050     MOVE WS-PFLINE1 TO RPV370K-PFLINE1.                          00505000
005060     MOVE WS-PFLINE2 TO RPV370K-PFLINE2.                          00506000
005070     PERFORM PANEL-PUT-RPV370K.                                   00507000
005080     PERFORM PANEL-SEND.                                          00508000
005090     MOVE 'E' TO COM-PANEL-ACTION.                                00509000
005100     MOVE COM-INTID TO WS-TRANSID.                                00510000
005110     GO TO CICS-RETURN-TRANSID.                                   00511000
005120 PKP-EXIT.                                                        00512000
005130     EXIT.                                                        00513000
005140******************************************************************00514000
005150 PROCESS-INFO-PANEL SECTION.                                      00515000
005160 PIP-START.                                                       00516000
005170     IF FROM-HELP                                                 00517000
005180         OR FROM-BREAKAWAY                                        00518000
005190         GO TO PIP-SEND-PANEL.                                    00519000
005200     IF INITIAL-PANEL                                             00520000
005210         MOVE COM-INST TO RPTRM01-SK-INST                         00521000
005220         MOVE COM-INST TO COM-SK-INST                             00522000
005230         MOVE COM-PRODCODE TO RPTRM01-SK-PRODCODE                 00523000
005240         MOVE COM-SK-ACCOUNT TO RPTRM01-SK-ACCOUNT                00524000
005250         MOVE COM-SK-MODEL TO RPTRM01-SK-MODEL                    00525000
005260         MOVE COM-SK-IDNBR TO RPTRM01-SK-IDNUMBER                 00526000
005270         MOVE SPACES TO COM-FIRST-KEY                             00527000
005280         MOVE ALL 'N' TO RPTRM01-MISC-DCHG                        00528000
005290         INITIALIZE RPTRM01-DATA-GRP                              00529000
005300         MOVE 'VKL' TO RPTRM01-APIFUNC                            00530000
005310         GO TO PIP-RPTRM01-LOOP.                                  00531000
005320 PIP-PFKEYS.                                                      00532000
005330     MOVE ALL ZEROS TO WS-MSGNBR.                                 00533000
005340     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00534000
005350         MOVE PDB-RPV370-COMMAND TO WS-CURSOR-FIELD               00535000
005360         GO TO PIP-SEND-PANEL.                                    00536000
005370     IF EIBAID IS EQUAL TO DFHPF4                                 00537000
005380         GO TO PIP-CONTINUE.                                      00538000
005390     MOVE COM-NEXTKEY TO WS-NEXTKEY.                              00539000
005400 PIP-CONTINUE.                                                    00540000
005410     PERFORM MOVE-PANEL-TO-RECORD.                                00541000
005420     IF EIBAID IS EQUAL TO DFHPF3                                 00542000
005430         OR EIBAID IS EQUAL TO DFHPF4                             00543000
005440         GO TO CLOSE-TRANSACTION.                                 00544000
005450     IF EIBAID IS EQUAL TO DFHENTER                               00545000
005460         AND COM-END-FILE-INST IS EQUAL TO 'E'                    00546000
005470         GO TO CLOSE-TRANSACTION.                                 00547000
005480     MOVE 'VKL' TO RPTRM01-APIFUNC.                               00548000
005490     MOVE RPTRM01-SK-IDNUMBER TO COM-SK-IDNBR.                    00549000
005500 PIP-RPTRM01-LOOP.                                                00550000
005510     PERFORM RPTRM01-LINK-MESSAGE.                                00551000
005520     MOVE RPTRM01-END-FILE-INST TO COM-END-FILE-INST.             00552000
005530     MOVE RPTRM01-NBR-OCCURS TO COM-NBR-OCCURS.                   00553000
005540     IF RPTRM01-MSGNBR IS NOT EQUAL TO ZEROS                      00554000
005550         GO TO PIP-RPTRM01-RETURN-CHECK.                          00555000
005560 PIP-RPTRM01-RETURN-CHECK.                                        00556000
005570     IF RPTRM01-RETURN IS EQUAL TO 'E'                            00557000
005580         MOVE 'E' TO COM-RETURN                                   00558000
005590         MOVE 'E' TO COM-PANEL-ACTION                             00559000
005600         MOVE 'I' TO COM-FROM-PANEL                               00560000
005610         GO TO PANEL-ROUTER.                                      00561000
005620     IF INITIAL-PANEL                                             00562000
005630         AND RPTRM01-END-FILE-INST IS EQUAL TO 'E'                00563000
005640         AND RPTRM01-NBR-OCCURS IS EQUAL TO ZEROS                 00564000
005650         MOVE 'E' TO COM-RETURN                                   00565000
005660         MOVE 'E' TO COM-PANEL-ACTION                             00566000
005670         MOVE 'I' TO COM-FROM-PANEL                               00567000
005680         MOVE '500057' TO WS-MSGNBR                               00568000
005690         GO TO PANEL-ROUTER.                                      00569000
005700 PIP-PAGING-CONTROLS.                                             00570000
005710     IF COM-PRODCODE IS EQUAL TO LOW-VALUES                       00571000
005720         MOVE RPTRM01-SK-PRODCODE TO COM-PRODCODE                 00572000
005730         MOVE RPTRM01-SK-PRODCODE TO COM-SK-PRODCODE              00573000
005740         MOVE RPTRM01-SK-ACCOUNT TO COM-SK-ACCOUNT                00574000
005750         MOVE RPTRM01-SK-MODEL TO COM-SK-MODEL.                   00575000
005760     IF COM-SK-IDNBR IS EQUAL TO LOW-VALUES                       00576000
005770         OR COM-SK-IDNBR IS EQUAL TO ZEROS                        00577000
005780         MOVE RPTRM01-SK-IDNUMBER TO COM-SK-IDNBR.                00578000
005790     IF RPTRM01-SK-MODEL IS NOT EQUAL TO COM-SK-MODEL             00579000
005800         MOVE RPTRM01-SK-MODEL TO COM-SK-MODEL.                   00580000
005810 PIP-BUILD-MAINT-PANEL.                                           00581000
005820     PERFORM BUILD-MAINT-PANEL.                                   00582000
005830     IF COM-LAST-KEY IS EQUAL TO SPACES                           00583000
005840         MOVE RPTRM01-SELECTKEY TO COM-LAST-KEY                   00584000
005850     ELSE                                                         00585000
005860         MOVE COM-SELECT-KEY TO COM-LAST-KEY.                     00586000
005870     MOVE RPTRM01-SELECTKEY TO COM-SELECT-KEY.                    00587000
005880     IF COM-LAST-KEY IS EQUAL TO COM-FIRST-KEY                    00588000
005890         MOVE SPACE TO COM-FIRSTSW.                               00589000
005900     MOVE 'B' TO COM-END.                                         00590000
005910     IF COM-FIRSTSW IS EQUAL TO SPACE                             00591000
005920         MOVE 'F' TO COM-END.                                     00592000
005930     IF COM-FIRSTSW IS EQUAL TO SPACE                             00593000
005940         AND COM-END-FILE-INST IS EQUAL TO 'E'                    00594000
005950         MOVE 'E' TO COM-END.                                     00595000
005960     IF COM-FIRSTSW IS NOT EQUAL TO SPACE                         00596000
005970         AND COM-END-FILE-INST IS EQUAL TO 'E'                    00597000
005980         MOVE 'P' TO COM-END.                                     00598000
005990 PIP-SEND-PANEL.                                                  00599000
006000     MOVE PDB-RPV370-NAME TO PAN-NAME.                            00600000
006010     MOVE COM-INST TO RPV370-INST.                                00601000
006020     MOVE COM-OPERID TO RPV370-OPERID.                            00602000
006030     MOVE COM-PRODCODE TO RPV370-PRODCD.                          00603000
006040     MOVE COM-SK-ACCOUNT TO RPV370-ACCOUNT.                       00604000
006050     MOVE COM-SK-MODEL TO RPV370-MODEL.                           00605000
006060     MOVE COM-SK-IDNBR TO RPV370-IDNBR.                           00606000
006070     IF (FROM-HELP                                                00607000
006080         OR FROM-BREAKAWAY)                                       00608000
006090         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00609000
006100         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00610000
006110         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00611000
006120     ELSE                                                         00612000
006130         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD                      00613000
006140         MOVE WS-CURSOR-OCC TO PAN-SET-OCC.                       00614000
006150     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00615000
006160     PERFORM CALL-BISPAN-RPV370.                                  00616000
006170     MOVE COM-INST TO RPV370-INST.                                00617000
006180     MOVE COM-OPERID TO RPV370-OPERID.                            00618000
006190     MOVE COM-EDIT-DATE TO RPV370-SYSDATE.                        00619000
006200     IF WS-MSGNBR NOT NUMERIC                                     00620000
006210         MOVE ZERO TO WS-MSGNBR.                                  00621000
006220     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00622000
006230         MOVE WS-HELPMSG TO WS-MSGNBR.                            00623000
006240     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00624000
006250         MOVE '000027' TO WS-MSGNBR                               00625000
006260     ELSE                                                         00626000
006270         PERFORM BUILD-NEXTKEY                                    00627000
006280         PERFORM COMPRESS-NEXTKEY                                 00628000
006290         MOVE WS-NEXTKEY TO RPV370-COMMAND.                       00629000
006300     IF FROM-HELP                                                 00630000
006310         OR FROM-BREAKAWAY                                        00631000
006320         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00632000
006330         MOVE COM-KEY-COMMAND TO RPV370-COMMAND                   00633000
006340         MOVE SPACE TO COM-FROM-PANEL                             00634000
006350     ELSE                                                         00635000
006360         MOVE RPV370-COMMAND TO COM-KEY-COMMAND                   00636000
006370         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00637000
006380     PERFORM GET-MESSAGE.                                         00638000
006390     MOVE WS-MESSAGE TO RPV370-MSGLINE.                           00639000
006400     PERFORM PANEL-PFKEY-SET.                                     00640000
006410     IF COM-FIRSTSW IS EQUAL TO SPACE                             00641000
006420         MOVE COM-KEY-DATA TO COM-FIRST-KEY.                      00642000
006430     MOVE 'X' TO COM-FIRSTSW.                                     00643000
006440     PERFORM BUILD-PFKEY-LINE.                                    00644000
006450     MOVE WS-PFLINE1 TO RPV370-PFLINE1.                           00645000
006460     MOVE WS-PFLINE2 TO RPV370-PFLINE2.                           00646000
006470     PERFORM PANEL-PUT-RPV370.                                    00647000
006480     PERFORM PANEL-SEND.                                          00648000
006490     MOVE '1' TO COM-RETURN.                                      00649000
006500     MOVE 'E' TO COM-PANEL-ACTION.                                00650000
006510     MOVE 'I' TO COM-FROM-PANEL.                                  00651000
006520     MOVE COM-INTID TO WS-TRANSID.                                00652000
006530     GO TO CICS-RETURN-TRANSID.                                   00653000
006540 PIP-EXIT.                                                        00654000
006550     EXIT.                                                        00655000
006560******************************************************************00656000
006570 BUILD-MAINT-PANEL SECTION.                                       00657000
006580 BMP-START.                                                       00658000
006590     MOVE +0 TO WS-SUB1.                                          00659000
006600     MOVE 'Fail' TO RPV370-TSTATUS.                               00660000
006610     IF RPTRM01-TRAN-VAL-SW IS EQUAL TO ZEROS                     00661000
006620         MOVE 'Pass' TO RPV370-TSTATUS.                           00662000
006630     MOVE RPTRM01-GRACE-EXPIRDATE TO WS-PDATE.                    00663000
006640     MOVE WS-PDATE-MM TO WS-FORMAT-MM.                            00664000
006650     MOVE WS-PDATE-DD TO WS-FORMAT-DD.                            00665000
006660     MOVE WS-PDATE-YYYY TO WS-FORMAT-YYYY.                        00666000
006670     MOVE WS-FORMAT-DATE TO RPV370-GEXPDT.                        00667000
006680     MOVE RPTRM01-7110DESCRIPTION TO RPV370-DESC.                 00668000
006690 BMP-LOOP.                                                        00669000
006700     ADD +0001 TO WS-SUB1.                                        00670000
006710     IF WS-SUB1 IS GREATER THAN +0012                             00671000
006720         GO TO BMP-EXIT.                                          00672000
006730     IF RPTRM01-7110ACCUM (WS-SUB1) IS EQUAL TO SPACES            00673000
006740         GO TO BMP-INITIAL-PANEL.                                 00674000
006750     IF RPTRM01-7110COND (WS-SUB1) IS EQUAL TO 'R'                00675000
006760         MOVE 'REQ' TO RPV370-COND.                               00676000
006770     IF RPTRM01-7110COND (WS-SUB1) IS EQUAL TO 'O'                00677000
006780         MOVE 'OR ' TO RPV370-COND.                               00678000
006790     IF RPTRM01-7110COND (WS-SUB1) IS EQUAL TO 'A'                00679000
006800         MOVE 'AND' TO RPV370-COND.                               00680000
006810     MOVE RPTRM01-7110ACCUM (WS-SUB1) TO WS-SUB2.                 00681000
006820     MOVE RPTRM01-7110ACCUM (WS-SUB1) TO RPV370-ACCUM.            00682000
006830     MOVE RPTRM01-7110REL (WS-SUB1) TO RPV370-RELAT.              00683000
006840     MOVE RPTRM01-7110OPTION (WS-SUB1) TO RPV370-OPTION.          00684000
006850     MOVE RPTRM01-TRAN-COUNT (WS-SUB2) TO WS-COUNT.               00685000
006860     MOVE WS-COUNT TO RPV370-TRMCNT.                              00686000
006870     MOVE RPTRM01-7110COUNT (WS-SUB1) TO WS-COUNT.                00687000
006880     MOVE WS-COUNT TO RPV370-RCOUNT.                              00688000
006890     MOVE RPTRM01-TRAN-AMOUNT (WS-SUB2) TO WS-TRAN-AMOUNT.        00689000
006900     MOVE WS-TRAN-AMOUNT TO RPV370-AMOUNT.                        00690000
006910     MOVE RPTRM01-7110AMOUNT (WS-SUB1) TO WS-REQ-AMOUNT.          00691000
006920     MOVE WS-REQ-AMOUNT TO RPV370-RAMOUNT.                        00692000
006930     MOVE PDB-RPV370-NAME TO PAN-NAME.                            00693000
006940     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00694000
006950     PERFORM PANEL-PUT-OCCUR-RPV370.                              00695000
006960     GO TO BMP-LOOP.                                              00696000
006970 BMP-INITIAL-PANEL-LOOP.                                          00697000
006980     ADD +0001 TO WS-SUB1.                                        00698000
006990     IF WS-SUB1 IS GREATER THAN +0012                             00699000
007000         GO TO BMP-EXIT.                                          00700000
007010 BMP-INITIAL-PANEL.                                               00701000
007020     MOVE SPACES TO RPV370-COND.                                  00702000
007030     MOVE SPACES TO RPV370-ACCUM.                                 00703000
007040     MOVE SPACES TO RPV370-RELAT.                                 00704000
007050     MOVE SPACES TO RPV370-OPTION.                                00705000
007060     MOVE SPACES TO RPV370-TRMCNT.                                00706000
007070     MOVE SPACES TO RPV370-RCOUNT.                                00707000
007080     MOVE SPACES TO RPV370-AMOUNT.                                00708000
007090     MOVE SPACES TO RPV370-RAMOUNT.                               00709000
007100     MOVE PDB-RPV370-NAME TO PAN-NAME.                            00710000
007110     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00711000
007120     PERFORM PANEL-PUT-OCCUR-RPV370.                              00712000
007130     GO TO BMP-INITIAL-PANEL-LOOP.                                00713000
007140 BMP-EXIT.                                                        00714000
007150     EXIT.                                                        00715000
007160******************************************************************00716000
007170 MOVE-PANEL-TO-RECORD SECTION.                                    00717000
007180 MPTR-START.                                                      00718000
007190     INITIALIZE RPTRM01-DATA-GRP.                                 00719000
007200     MOVE ALL 'N' TO RPTRM01-DATA-GRP-DCHG.                       00720000
007210 MPTR-EXIT.                                                       00721000
007220     EXIT.                                                        00722000
007230******************************************************************00723000
007240 MORE-DATA-PANELS SECTION.                                        00724000
007250 MDP-START.                                                       00725000
007260     GO TO PANEL-ROUTER.                                          00726000
007270 MDP-EXIT.                                                        00727000
007280     EXIT.                                                        00728000
007290******************************************************************00729000
007300 CLOSE-TRANSACTION SECTION.                                       00730000
000000 COPY SRP0722.                                                    00731000
007320******************************************************************00732000
007330 PANEL-INIT SECTION.                                              00733000
000000 COPY SRP073.                                                     00734000
007350******************************************************************00735000
007360 BUILD-NEXTKEY SECTION.                                           00736000
007370 BXN-START.                                                       00737000
007380     MOVE SPACES TO WS-NEXTKEY.                                   00738000
007390     MOVE ',' TO WS-DELIM1.                                       00739000
007400     MOVE ',' TO WS-DELIM2.                                       00740000
007410     MOVE ',' TO WS-DELIM3.                                       00741000
007420     MOVE COM-SK-PRODCODE TO WS-PRODCODE.                         00742000
007430     IF COM-SK-ACCOUNT IS NOT NUMERIC                             00743000
007440         MOVE COM-SK-ACCOUNT TO WS-ACCTX                          00744000
007450     ELSE                                                         00745000
007460         MOVE COM-SK-ACCOUNT-N TO WS-ACCT.                        00746000
007470     MOVE COM-SK-MODEL TO WS-MODEL.                               00747000
007480     MOVE COM-EXTERNALID TO WS-EXTID.                             00748000
007490 BXN-EXIT.                                                        00749000
007500     EXIT.                                                        00750000
007510******************************************************************00751000
007520 ABORT-EXIT SECTION.                                              00752000
007530 AE-START.                                                        00753000
007540     MOVE EIBFN TO COM-ABEIBFN.                                   00754000
007550     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00755000
007560     GO TO CICS-ABORT-EXIT.                                       00756000
007570 AE-EXIT.                                                         00757000
007580     EXIT.                                                        00758000
007590******************************************************************00759000
007600 RPTRM01-LINK-MESSAGE SECTION.                                    00760000
007610 CRLM-START.                                                      00761000
007620     MOVE 'Y' TO RPTRM01-GLOBAL-CLOSE.                            00762000
007630     MOVE WS-FILEOPTIONS TO RPTRM01-FILEOPTS.                     00763000
007640     MOVE COM-RETURN TO RPTRM01-RETURN.                           00764000
007650     MOVE COM-DATE TO RPTRM01-DATE.                               00765000
007660     MOVE COM-MODELID TO RPTRM01-MODELID.                         00766000
007670     MOVE COM-SECALT TO RPTRM01-SECALT.                           00767000
007680     MOVE COM-EXTERNALID TO RPTRM01-EXTERNALID.                   00768000
007690     MOVE COM-EIBTRMID TO RPTRM01-TERMID.                         00769000
007700     MOVE COM-WKUNAME TO RPTRM01-WORKID.                          00770000
007710     MOVE COM-TRANSTART TO RPTRM01-TRANSTART.                     00771000
007720     MOVE COM-UPDATE TO RPTRM01-UPDATE.                           00772000
007730     MOVE COM-APPLSEQ TO RPTRM01-APPLSEQ.                         00773000
007740     MOVE WS-RPSAPPLNBR TO RPTRM01-APPL.                          00774000
007750     IF RPTRM01-SK-INST IS GREATER THAN ZEROS                     00775000
007760         MOVE 'Y' TO RPTRM01-SK-INST-DCHG.                        00776000
007770     IF RPTRM01-SK-PRODCODE IS NOT EQUAL TO SPACES                00777000
007780         AND RPTRM01-SK-PRODCODE IS NOT EQUAL TO LOW-VALUES       00778000
007790         MOVE 'Y' TO RPTRM01-SK-PRODCODE-DCHG.                    00779000
007800     IF RPTRM01-SK-ACCOUNT IS NOT EQUAL TO SPACES                 00780000
007810         AND RPTRM01-SK-ACCOUNT IS NOT EQUAL TO LOW-VALUES        00781000
007820         MOVE 'Y' TO RPTRM01-SK-ACCOUNT-DCHG.                     00782000
007830     IF RPTRM01-SK-MODEL IS EQUAL TO LOW-VALUES                   00783000
007840         MOVE SPACES TO RPTRM01-SK-MODEL                          00784000
007850         MOVE 'N' TO RPTRM01-SK-MODEL-DCHG.                       00785000
007860     IF RPTRM01-SK-IDNUMBER IS GREATER THAN ZEROS                 00786000
007870         MOVE 'Y' TO RPTRM01-SK-IDNUMBER-DCHG.                    00787000
007880     MOVE 'Y' TO RPTRM01-NBR-OCCURS-DCHG.                         00788000
007890     MOVE +12 TO RPTRM01-NBR-OCCURS.                              00789000
007900     MOVE 'N' TO RPTRM01-END-FILE-INST-DCHG.                      00790000
007910     MOVE SPACES TO RPTRM01-END-FILE-INST.                        00791000
007920     MOVE COM-OPERID TO RPTRM01-OPERID.                           00792000
007930     MOVE COM-LANG TO RPTRM01-COM-LANG.                           00793000
007940     MOVE COM-CURN-CODE TO RPTRM01-COM-CURNCD.                    00794000
007950     MOVE COM-INST-OPTS TO RPTRM01-INST-OPTS.                     00795000
007960     EXEC CICS LINK                                               00796000
007970         PROGRAM('RPLTRM01')                                      00797000
007980         COMMAREA(RPTRM01-MESSAGE)                                00798000
007990         LENGTH(LENGTH OF RPTRM01-MESSAGE)                        00799000
008000         RESP(WS-CICS-RESPONSE)                                   00800000
008010         END-EXEC.                                                00801000
008020     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00802000
008030         MOVE 'RPLTRM01 LINK FAILED' TO COM-ABMSG                 00803000
008040         MOVE WS-TR0002 TO COM-ABTRACE                            00804000
008050         MOVE WS-AB0009 TO COM-ABORT                              00805000
008060         GO TO CICS-ABORT-EXIT.                                   00806000
008070     MOVE RPTRM01-FUNCTION TO WS-FUNCTION.                        00807000
008080     IF RPTRM01-ABORT IS NOT EQUAL TO ZERO                        00808000
008090         MOVE RPTRM01-ABORT TO COM-ABORT                          00809000
008100         MOVE RPTRM01-ABTRACE TO COM-ABTRACE                      00810000
008110         MOVE RPTRM01-ABEIBFN TO COM-ABEIBFN                      00811000
008120         MOVE RPTRM01-ABEIBRCODE TO COM-ABEIBRCODE                00812000
008130         MOVE RPTRM01-ABPROGID TO COM-ABPROGID                    00813000
008140         MOVE RPTRM01-SRBMDB TO COM-SRBMDB                        00814000
008150         MOVE RPTRM01-ABTYPE TO COM-ABTYPE                        00815000
008160         GO TO CICS-ABORT-EXIT.                                   00816000
008170     MOVE RPTRM01-ABORT TO COM-ABORT.                             00817000
008180     MOVE RPTRM01-MSGNBR TO WS-MSGNBR.                            00818000
008190 CRLM-EXIT.                                                       00819000
008200     EXIT.                                                        00820000
008210******************************************************************00821000
008220 CLOSE-PANEL SECTION.                                             00822000
008230 CP-START.                                                        00823000
008240     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00824000
008250     IF COM-RETURN IS EQUAL TO 'E'                                00825000
008260         PERFORM CALL-BISPAN-RPV370K.                             00826000
008270     IF COM-RETURN IS EQUAL TO '1'                                00827000
008280         PERFORM CALL-BISPAN-RPV370.                              00828000
008290 CP-EXIT.                                                         00829000
008300     EXIT.                                                        00830000
008310******************************************************************00831000
008320 CALL-BISPAN-RPV370K SECTION.                                     00832000
008330 CBD1-START.                                                      00833000
008340     CALL 'BISPAN' USING                                          00834000
008350         BICRPSB,                                                 00835000
008360         BICRSRB,                                                 00836000
008370         BICRPAN,                                                 00837000
008380         RPV370K-PANL-DATA-BLOCK,                                 00838000
008390         RPV370K-PANL-DATA-AREA.                                  00839000
008400 CBD1-EXIT.                                                       00840000
008410     EXIT.                                                        00841000
008420******************************************************************00842000
008430 CALL-BISPAN-RPV370 SECTION.                                      00843000
008440 CBD2-START.                                                      00844000
008450     CALL 'BISPAN' USING                                          00845000
008460         BICRPSB,                                                 00846000
008470         BICRSRB,                                                 00847000
008480         BICRPAN,                                                 00848000
008490         RPV370-PANL-DATA-BLOCK,                                  00849000
008500         RPV370-PANL-DATA-AREA.                                   00850000
008510 CBD2-EXIT.                                                       00851000
008520     EXIT.                                                        00852000
008530******************************************************************00853000
008540 PANEL-GET-RPV370 SECTION.                                        00854000
008550 PANEL-GET-RPV370-START.                                          00855000
008560     MOVE 'N' TO RPV370-SW-SET-CURSOR.                            00856000
008570     MOVE PDB-RPV370-NAME TO PAN-NAME.                            00857000
008580     MOVE REQ-GET TO PAN-REQ-VERB.                                00858000
008590     CALL 'BISPAN' USING                                          00859000
008600         BICRPSB                                                  00860000
008610         BICRSRB                                                  00861000
008620         BICRPAN                                                  00862000
008630         RPV370-PANL-DATA-BLOCK,                                  00863000
008640         RPV370-PANL-DATA-AREA.                                   00864000
008650 PANEL-GET-RPV370-EXIT.                                           00865000
008660     EXIT.                                                        00866000
008670******************************************************************00867000
008680 PANEL-PUT-RPV370 SECTION.                                        00868000
008690 PANEL-PUT-RPV370-START.                                          00869000
008700     MOVE PDB-RPV370-NAME TO PAN-NAME.                            00870000
008710     MOVE REQ-PUT TO PAN-REQ-VERB.                                00871000
008720     CALL 'BISPAN' USING                                          00872000
008730         BICRPSB                                                  00873000
008740         BICRSRB                                                  00874000
008750         BICRPAN                                                  00875000
008760         RPV370-PANL-DATA-BLOCK,                                  00876000
008770         RPV370-PANL-DATA-AREA.                                   00877000
008780 PANEL-PUT-RPV370-EXIT.                                           00878000
008790     EXIT.                                                        00879000
008800******************************************************************00880000
008810 PANEL-GET-RPV370K SECTION.                                       00881000
008820 PANEL-GET-RPV370K-START.                                         00882000
008830     MOVE 'N' TO RPV370K-SW-SET-CURSOR.                           00883000
008840     MOVE PDB-RPV370K-NAME TO PAN-NAME.                           00884000
008850     MOVE REQ-GET TO PAN-REQ-VERB.                                00885000
008860     CALL 'BISPAN' USING                                          00886000
008870         BICRPSB                                                  00887000
008880         BICRSRB                                                  00888000
008890         BICRPAN                                                  00889000
008900         RPV370K-PANL-DATA-BLOCK,                                 00890000
008910         RPV370K-PANL-DATA-AREA.                                  00891000
008920 PANEL-GET-RPV370K-EXIT.                                          00892000
008930     EXIT.                                                        00893000
008940******************************************************************00894000
008950 PANEL-PUT-RPV370K SECTION.                                       00895000
008960 PANEL-PUT-RPV370K-START.                                         00896000
008970     MOVE PDB-RPV370K-NAME TO PAN-NAME.                           00897000
008980     MOVE REQ-PUT TO PAN-REQ-VERB.                                00898000
008990     CALL 'BISPAN' USING                                          00899000
009000         BICRPSB                                                  00900000
009010         BICRSRB                                                  00901000
009020         BICRPAN                                                  00902000
009030         RPV370K-PANL-DATA-BLOCK,                                 00903000
009040         RPV370K-PANL-DATA-AREA.                                  00904000
009050 PANEL-PUT-RPV370K-EXIT.                                          00905000
009060     EXIT.                                                        00906000
009070******************************************************************00907000
009080 PANEL-GET-OCCUR-RPV370 SECTION.                                  00908000
009090 PGORPV370-START.                                                 00909000
009100     MOVE PDB-RPV370-NAME TO PAN-NAME.                            00910000
009110     MOVE REQ-GET-OCCUR TO PAN-REQ-VERB.                          00911000
009120     CALL 'BISPAN' USING                                          00912000
009130         BICRPSB                                                  00913000
009140         BICRSRB                                                  00914000
009150         BICRPAN                                                  00915000
009160         RPV370-PANL-DATA-BLOCK,                                  00916000
009170         RPV370-PANL-DATA-AREA.                                   00917000
009180 PGORPV370-EXIT.                                                  00918000
009190     EXIT.                                                        00919000
009200******************************************************************00920000
009210 PANEL-PUT-OCCUR-RPV370 SECTION.                                  00921000
009220 PPORPV370-START.                                                 00922000
009230     MOVE PDB-RPV370-NAME TO PAN-NAME.                            00923000
009240     MOVE REQ-PUT-OCCUR TO PAN-REQ-VERB.                          00924000
009250     CALL 'BISPAN' USING                                          00925000
009260         BICRPSB                                                  00926000
009270         BICRSRB                                                  00927000
009280         BICRPAN                                                  00928000
009290         RPV370-PANL-DATA-BLOCK,                                  00929000
009300         RPV370-PANL-DATA-AREA.                                   00930000
009310 PPORPV370-EXIT.                                                  00931000
009320     EXIT.                                                        00932000
009330******************************************************************00933000
009340 MIC-MST-API SECTION.                                             00934000
000000 COPY MIPMSTA.                                                    00935000
009360******************************************************************00936000
009370 EDIT-ACCOUNT-KEY SECTION.                                        00937000
009380 EAK-START.                                                       00938000
009390     MOVE COM-INST TO RPW130-INST.                                00939000
009400     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 00940000
009410     MOVE COM-SK-PRODCODE TO RPW130-PRODCODE.                     00941000
009420     MOVE COM-SK-ACCOUNT TO RPW130-ACCOUNTINPUT.                  00942000
009430     MOVE 'V' TO RPW130-FUNCTION.                                 00943000
009440     PERFORM ACCOUNT-KEY-EDIT.                                    00944000
009450     MOVE COM-SK-PRODCODE TO COM-PRODCODE.                        00945000
009460     MOVE RPW130-ACCOUNTKEY TO COM-SK-ACCOUNT.                    00946000
009470     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          00947000
009480     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      00948000
009490     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                00949000
009500 EAK-EXIT.                                                        00950000
009510     EXIT.                                                        00951000
009520******************************************************************00952000
009530 ACCOUNT-KEY-EDIT SECTION.                                        00953000
000000 COPY RPP130.                                                     00954000
009550******************************************************************00955000
009560 LEFT-JUSTIFY SECTION.                                            00956000
000000 COPY SRP068.                                                     00957000
009580******************************************************************00958000
009590 RIGHT-JUSTIFY SECTION.                                           00959000
000000 COPY SRP026.                                                     00960000
009610******************************************************************00961000
009620 PARAMETER-SEARCH SECTION.                                        00962000
000000 COPY SRP030.                                                     00963000
009640******************************************************************00964000
009650 COMPRESS-NEXTKEY SECTION.                                        00965000
000000 COPY SRP070.                                                     00966000
009670******************************************************************00967000
009680 GET-MESSAGE SECTION.                                             00968000
000000 COPY SRP071.                                                     00969000
009700******************************************************************00970000
009710 SRP170-ROUTINE SECTION.                                          00971000
000000 COPY SRP170.                                                     00972000
009730******************************************************************00973000
009740 BUILD-PFKEY-LINE SECTION.                                        00974000
000000 COPY SRP710.                                                     00975000
009760******************************************************************00976000
009770 VALIDATE-PFKEYS SECTION.                                         00977000
000000 COPY SRP711.                                                     00978000
009790******************************************************************00979000
009800 SLP096-GET-2023-RECORD SECTION.                                  00980000
000000 COPY SLP096.                                                     00981000
009820******************************************************************00982000
009830 CICS-XCTL SECTION.                                               00983000
000000 COPY SLP704.                                                     00984000
009850******************************************************************00985000
009860 CICS-RETURN-TRANSID SECTION.                                     00986000
000000 COPY SLP710.                                                     00987000
009880******************************************************************00988000
009890 TSQ-DELETE SECTION.                                              00989000
009900 TSQD-START.                                                      00990000
009910 TSQD-EXIT.                                                       00991000
009920     EXIT.                                                        00992000
009930******************************************************************00993000
009940 CICS-TSQ-READ SECTION.                                           00994000
000000 COPY SLP744.                                                     00995000
009960******************************************************************00996000
009970 CICS-ABORT-EXIT SECTION.                                         00997000
000000 COPY SLP798.                                                     00998000
009990******************************************************************00999000
