000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL300.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL300 - RELATIONSHIP NEW                                   *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
P0076  01  SRW000-AREAS.                                                00015300
000000 COPY SRW000.                                                     00015600
000160 01  SRW105-AREAS.                                                00016000
000000 COPY SRW105.                                                     00017000
000180*01  BICRSRB.                                                     00018000
000000 COPY BICRSRB.                                                    00019000
000200*01  BICRPSB.                                                     00020000
000000 COPY BICRPSB.                                                    00021000
000220*01  BICRVERB.                                                    00022000
000000 COPY BICRVERB.                                                   00023000
000240*01  BICRSTAT.                                                    00024000
000000 COPY BICRSTAT.                                                   00025000
000260*01  BICRCONS.                                                    00026000
000000 COPY BICRCONS.                                                   00027000
000280*01  BICRDBS.                                                     00028000
000000 COPY BICRDBS.                                                    00029000
000300*01  BICRPAN.                                                     00030000
000000 COPY BICRPAN.                                                    00031000
000320 01  SRW710-AREAS.                                                00032000
000000 COPY SRW710.                                                     00033000
000340 01  RPV300K-PANL-DATA-BLOCK.                                     00034000
000000 COPY RPV300KW.                                                   00035000
000360 01  RPV300-PANL-DATA-BLOCK.                                      00036000
000000 COPY RPV300W.                                                    00037000
000380 01  WS-WORKAREAS.                                                00038000
000390     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00039000
000400     03  WS-NEXTKEY.                                              00040000
000410         05  WS-EXTID            PIC X(08).                       00041000
000420         05  WS-DELIM1           PIC X(01)       VALUE ','.       00042000
000430         05  WS-DATA.                                             00043000
000440             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00044000
000450             07  WS-DELIM2       PIC X(01)       VALUE ','.       00045000
000460             07  WS-ACCTX.                                        00046000
000470                 09  WS-ACCT     PIC Z(18)       VALUE ZERO.      00047000
000480             07  WS-DELIM3       PIC X(01)       VALUE ','.       00048000
000490             07  WS-MODELX.                                       00049000
000500                 09  WS-MODEL    PIC X(10)       VALUE SPACES.    00050000
P0076              07  WS-DELIM4       PIC X(01)       VALUE ','.       00051000
P0076              07  WS-EXPDT        PIC X(10)       VALUE SPACES.    00051190
P0076          05  FILLER              PIC X(22)       VALUE SPACES.    00051380
000520     03  WS-SUB1                 PIC S9(04)      COMP             00052000
000530                                                 VALUE +0000.     00053000
000540     03  WS-PDATE                PIC 9(08).                       00054000
000550     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00055000
000560         05  WS-PDATE-YYYY       PIC 9(04).                       00056000
000570         05  WS-PDATE-MM         PIC 9(02).                       00057000
000580         05  WS-PDATE-DD         PIC 9(02).                       00058000
000590 01  WS-LINKMSG                  PIC X(4500).                     00059000
000600 01  RPXXX02-MESSAGE.                                             00060000
000000 COPY MISCNT00      REPLACING                                     00061000
000620             ==:MICNT:== BY ==RPXXX02==.                          00062000
000000 COPY RPSXXX02.                                                   00063000
000640 01  WS-TSQAREAS.                                                 00064000
000650     03  WS-TSQITEM              PIC S9(04)      COMP             00065000
000660                                                 VALUE +0001.     00066000
000670     03  WS-TSQLGTH              PIC S9(04)      COMP             00067000
000680                                                 VALUE +4096.     00068000
000690     03  WS-TSQKEY.                                               00069000
000700         05  WS-TSQID            PIC X(04).                       00070000
000710         05  WS-TSQTRMID         PIC X(04).                       00071000
000720 01  LS-TSQAREA.                                                  00072000
000730     03  LS-TSQKEY               PIC X(08).                       00073000
000740     03  LS-TSQDATA              PIC X(4088).                     00074000
000750 01  MIWPRI-AREAS.                                                00075000
000000 COPY MIWPRI.                                                     00076000
000770 01  MIWMSTA-AREAS.                                               00077000
000000 COPY MIWMSTA.                                                    00078000
000790 01  MIMST-RECORD.                                                00079000
000000 COPY MISMST.                                                     00080000
000810 01  MI2023-RECORD.                                               00081000
000000 COPY MIS2023A.                                                   00082000
000830 01  WS-ABORTCODES.                                               00083000
000840     03  WS-AB0009               PIC S9(04)      COMP             00084000
000850                                                 VALUE +0009.     00085000
000860     03  WS-AB0106               PIC S9(04)      COMP             00086000
000870                                                 VALUE +0106.     00087000
000880     03  WS-AB2033               PIC S9(04)      COMP             00088000
000890                                                 VALUE +2033.     00089000
000900 01  WS-TRACECODES.                                               00090000
000910     03  WS-TR0001               PIC S9(04)      COMP             00091000
000920                                                 VALUE +0001.     00092000
000930     03  WS-TR0002               PIC S9(04)      COMP             00093000
000940                                                 VALUE +0002.     00094000
000950 01  RPW014-AREAS.                                                00095000
000000 COPY RPW014.                                                     00096000
000970 01  RPW033-AREAS.                                                00097000
000000 COPY RPW033.                                                     00098000
000990 01  SLW096-AREAS.                                                00099000
000000 COPY SLW096.                                                     00100000
001010 01  SRW025-AREAS.                                                00101000
000000 COPY SRW025.                                                     00102000
001030 01  SRW030-AREAS.                                                00103000
000000 COPY SRW030.                                                     00104000
001050 01  SRW031-AREAS.                                                00105000
000000 COPY SRW031.                                                     00106000
001070 01  RPW130-AREAS.                                                00107000
000000 COPY RPW130.                                                     00108000
001090 01  SRW161-AREAS.                                                00109000
000000 COPY SRW161.                                                     00110000
001110 01  SRW166-AREAS.                                                00111000
000000 COPY SRW166.                                                     00112000
001130 01  SRW170-AREAS.                                                00113000
000000 COPY SRW170.                                                     00114000
001150 COPY DFHAID.                                                     00115000
001160******************************************************************00116000
001170 LINKAGE SECTION.                                                 00117000
001180 01  DFHCOMMAREA.                                                 00118000
000000 COPY SLS1112.                                                    00119000
001200     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00120000
001210         05  COM-EDIT-DATE       PIC X(10).                       00121000
001220         05  COM-PANEL-ACTION    PIC X(01).                       00122000
001230             88  INITIAL-PANEL                   VALUE ' '.       00123000
001240             88  EDIT-PANEL                      VALUE 'E'.       00124000
001250         05  COM-FROM-PANEL      PIC X(01).                       00125000
001260             88  FROM-KEY-PANEL                  VALUE 'K'.       00126000
001270             88  FROM-MAINT-PANEL                VALUE 'M'.       00127000
001280             88  FROM-BREAKAWAY                  VALUE 'B'.       00128000
001290             88  FROM-HELP                       VALUE 'H'.       00129000
001300         05  COM-KEY-FIELDS.                                      00130000
001310             07  COM-KEY-PRODCODE                                 00131000
001320                                 PIC X(06).                       00132000
001330             07  COM-KEY-ACCOUNT PIC X(18).                       00133000
001340             07  COM-KEY-ACCOUNT-N                                00134000
001350                         REDEFINES COM-KEY-ACCOUNT                00135000
001360                                 PIC 9(18).                       00136000
001370             07  COM-KEY-MODELX  PIC X(10).                       00137000
001380             07  COM-KEY-MODEL                                    00138000
001390                         REDEFINES COM-KEY-MODELX                 00139000
001400                                 PIC X(10).                       00140000
P0076              07  COM-KEY-EXPDT   PIC X(10).                       00140500
001410         05  COM-KEY-FORMATTEDACCT                                00141000
001420                                 PIC X(22).                       00142000
001430         05  COM-KEY-MSGNBR      PIC X(06).                       00143000
001440         05  COM-KEY-COMMAND     PIC X(50).                       00144000
001450         05  COM-MODEL-DESC      PIC X(20).                       00145000
001460         05  COM-RP-PRODCODE     PIC X(06).                       00146000
001470         05  COM-IDNBR-CHANGE    PIC X(01).                       00147000
001480         05  COM-CUST-NAME       PIC X(40).                       00148000
001490         05  COM-CUST-KEY        PIC X(26).                       00149000
001500         05  COM-KEY-BRANCH      PIC S9(05)      COMP-3.          00150000
001510         05  COM-ACCT-TYPE       PIC S9(03)      COMP-3.          00151000
001520         05  COM-IDNUMBER        PIC 9(18).                       00152000
001530         05  COM-ENROLLATTEMPTS  PIC 9(02).                       00153000
P0076          05  COM-EXPDT           PIC 9(08).                       00153500
001540         05  COM-CURSOR          PIC X(08).                       00154000
001550******************************************************************00155000
001560*01  SLW096-2023RECORDS.                                          00156000
000000 COPY SLW096L.                                                    00157000
001580******************************************************************00158000
001590 PROCEDURE DIVISION.                                              00159000
001600******************************************************************00160000
001610 ENTRY-ROUTINE SECTION.                                           00161000
001620     MOVE 'RPL300' TO COM-ABPROGID.                               00162000
000000 COPY SLP771.                                                     00163000
001640******************************************************************00164000
001650 TRANSACTION-CLEAN-UP SECTION.                                    00165000
001660 TCU-START.                                                       00166000
001670 TCU-EXIT.                                                        00167000
001680     EXIT.                                                        00168000
001690******************************************************************00169000
001700 CICS-HANDLE-CONDITION SECTION.                                   00170000
000000 COPY SLP772.                                                     00171000
001720     MOVE WS-AB2033 TO COM-ABORT.                                 00172000
001730     MOVE WS-TR0001 TO COM-ABTRACE.                               00173000
001740     GO TO ABORT-EXIT.                                            00174000
001750 CHC-EXIT.                                                        00175000
001760     EXIT.                                                        00176000
001770******************************************************************00177000
001780 ROUTING-ROUTINE SECTION.                                         00178000
001790 RR-START.                                                        00179000
001800     MOVE LOW-VALUES TO RPXXX02-MESSAGE.                          00180000
001810     MOVE LOW-VALUES TO RPV300K-PANL-DATA-AREA.                   00181000
001820     MOVE LOW-VALUES TO RPV300-PANL-DATA-AREA.                    00182000
001830     MOVE ZERO TO WS-MSGNBR.                                      00183000
001840     MOVE 'RP00' TO WS-TSQFILEID.                                 00184000
001850     MOVE 'RPI' TO WS-TSQSYSID.                                   00185000
001860     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00186000
001870         MOVE COM-PAN TO BICRPAN                                  00187000
001880         MOVE COM-PSB TO BICRPSB                                  00188000
001890         MOVE COM-SRB TO BICRSRB                                  00189000
001900     ELSE                                                         00190000
001910         MOVE '1' TO BPSB-LEVEL.                                  00191000
001920     IF COM-RETURN IS EQUAL TO 'B'                                00192000
001930         GO TO BREAKAWAY-RETURN.                                  00193000
001940     IF COM-RETURN IS EQUAL TO '0'                                00194000
001950         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00195000
001960         MOVE SPACES TO COM-WORKAREAS                             00196000
001970         MOVE '1' TO SRB-VERSION                                  00197000
001980         MOVE 'IPRP' TO SRB-APPL-ID                               00198000
001990         MOVE 'RPL300' TO SRB-PROG-ID                             00199000
002000         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00200000
002010         MOVE 'P' TO PAN-TYPE                                     00201000
002020         MOVE SPACE TO PAN-OVERLAY                                00202000
002030         MOVE SPACE TO PAN-CLOSE                                  00203000
002040         MOVE SPACE TO PAN-ALARM                                  00204000
002050         MOVE SPACE TO PAN-CURSOR-PAN                             00205000
002060         MOVE SPACE TO PAN-CURSOR-FLD                             00206000
002070         MOVE SPACE TO PAN-SET-FLD                                00207000
002080         MOVE SPACE TO PAN-SET-VID                                00208000
002090         MOVE SPACE TO PAN-SET-EMP                                00209000
002100         MOVE PDB-RPV300K-NAME TO PAN-NAME                        00210000
002110         PERFORM PANEL-INIT                                       00211000
002120         MOVE BICRPAN TO COM-PAN                                  00212000
002130         MOVE BICRPSB TO COM-PSB                                  00213000
002140         MOVE BICRSRB TO COM-SRB                                  00214000
002150         PERFORM INITIALIZE-DATES                                 00215000
002160         GO TO PANEL-ROUTER.                                      00216000
002170     PERFORM PANEL-NAME-SET.                                      00217000
002180     IF COM-HELPSW IS EQUAL TO 'Y'                                00218000
002190         GO TO HELP-RETURN.                                       00219000
002200     PERFORM PANEL-RECEIVE.                                       00220000
002210     PERFORM PANEL-DATA-GET.                                      00221000
002220     PERFORM PANEL-PFKEY-SET.                                     00222000
002230     PERFORM VALIDATE-PFKEYS.                                     00223000
002240     IF EIBAID IS EQUAL TO DFHPF1                                 00224000
002250         GO TO GET-HELP.                                          00225000
002260     IF EIBAID IS EQUAL TO DFHPF11                                00226000
002270         GO TO BREAK-AWAY.                                        00227000
002280     IF (COM-RETURN IS EQUAL TO 'E')                              00228000
002290         AND (EIBAID IS EQUAL TO DFHPF2                           00229000
002300         OR EIBAID IS EQUAL TO DFHPF3                             00230000
002310         OR EIBAID IS EQUAL TO DFHPF4                             00231000
002320         OR EIBAID IS EQUAL TO DFHPF7                             00232000
002330         OR EIBAID IS EQUAL TO DFHPF8                             00233000
002340         OR EIBAID IS EQUAL TO DFHPF12)                           00234000
002350         GO TO CLOSE-TRANSACTION.                                 00235000
002360     IF COM-RETURN IS EQUAL TO '1'                                00236000
002370         AND                                                      00237000
002380         (EIBAID IS EQUAL TO DFHPF3 OR                            00238000
002390         EIBAID IS EQUAL TO DFHPF12)                              00239000
002400         GO TO CLOSE-TRANSACTION.                                 00240000
002410     IF COM-RETURN IS EQUAL TO '0'                                00241000
002420         OR COM-RETURN IS EQUAL TO 'E'                            00242000
002430         OR COM-RETURN IS EQUAL TO '1'                            00243000
002440         GO TO PANEL-ROUTER.                                      00244000
002450 RR-END.                                                          00245000
002460     GO TO CLOSE-TRANSACTION.                                     00246000
002470 RR-EXIT.                                                         00247000
002480     EXIT.                                                        00248000
002490******************************************************************00249000
002500 INITIALIZE-DATES SECTION.                                        00250000
002510 ID-START.                                                        00251000
002520     MOVE COM-DATE TO WS-CURDATE8.                                00252000
002530     MOVE '-' TO WS-CD8DSH1.                                      00253000
002540     MOVE '-' TO WS-CD8DSH2.                                      00254000
002550     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00255000
002560 ID-EXIT.                                                         00256000
002570     EXIT.                                                        00257000
002580******************************************************************00258000
002590 PANEL-NAME-SET SECTION.                                          00259000
002600 PNS-START.                                                       00260000
002610     IF COM-RETURN IS EQUAL TO '0'                                00261000
002620         MOVE PDB-RPV300K-NAME TO PAN-NAME.                       00262000
002630     IF COM-RETURN IS EQUAL TO 'E'                                00263000
002640         MOVE PDB-RPV300-NAME TO PAN-NAME.                        00264000
002650     IF COM-RETURN IS EQUAL TO '1'                                00265000
002660         MOVE PDB-RPV300-NAME TO PAN-NAME.                        00266000
002670 PNS-EXIT.                                                        00267000
002680     EXIT.                                                        00268000
002690******************************************************************00269000
002700 PANEL-DATA-GET SECTION.                                          00270000
002710 PDG-START.                                                       00271000
002720     IF COM-RETURN IS EQUAL TO '0'                                00272000
002730         PERFORM PANEL-GET-RPV300K.                               00273000
002740     IF COM-RETURN IS EQUAL TO 'E'                                00274000
002750         PERFORM PANEL-GET-RPV300K                                00275000
002760         MOVE RPV300K-COMMAND TO WS-NEXTKEY                       00276000
002770         MOVE PDB-RPV300K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00277000
002780     IF COM-RETURN IS EQUAL TO '1'                                00278000
002790         PERFORM PANEL-GET-RPV300                                 00279000
002800         MOVE RPV300-COMMAND TO WS-NEXTKEY                        00280000
002810         MOVE PDB-RPV300-COMMAND-DCHG TO WS-COMMAND-DCHG.         00281000
002820 PDG-EXIT.                                                        00282000
002830     EXIT.                                                        00283000
002840******************************************************************00284000
002850 PANEL-PFKEY-SET SECTION.                                         00285000
002860 PPS-START.                                                       00286000
002870 PPS-EXIT.                                                        00287000
002880     EXIT.                                                        00288000
002890******************************************************************00289000
002900 PANEL-ROUTER SECTION.                                            00290000
002910 PR-START.                                                        00291000
002920     IF COM-RETURN IS EQUAL TO '0'                                00292000
002930         GO TO PROCESS-KEY-PANEL.                                 00293000
002940     IF COM-RETURN IS EQUAL TO 'E'                                00294000
002950         GO TO PROCESS-KEY-PANEL.                                 00295000
002960     IF COM-RETURN IS EQUAL TO '1'                                00296000
002970         GO TO PROCESS-MAINT-PANEL.                               00297000
002980     GO TO CLOSE-TRANSACTION.                                     00298000
002990 PR-EXIT.                                                         00299000
003000     EXIT.                                                        00300000
003010******************************************************************00301000
003020 HELP-RETURN SECTION.                                             00302000
000000 COPY SRP074.                                                     00303000
003040******************************************************************00304000
003050 HELP-RETURN-FINISH SECTION.                                      00305000
003060 HRF-START.                                                       00306000
003070     PERFORM PANEL-DATA-GET.                                      00307000
003080     MOVE 'H' TO COM-FROM-PANEL.                                  00308000
003090     GO TO PANEL-ROUTER.                                          00309000
003100 HRF-EXIT.                                                        00310000
003110     EXIT.                                                        00311000
003120******************************************************************00312000
003130 HELP-MISSING-FINISH SECTION.                                     00313000
003140 HMF-START.                                                       00314000
003150     MOVE 'H' TO COM-FROM-PANEL.                                  00315000
003160     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00316000
003170     GO TO PANEL-ROUTER.                                          00317000
003180 HMF-EXIT.                                                        00318000
003190     EXIT.                                                        00319000
003200******************************************************************00320000
003210 BREAK-AWAY SECTION.                                              00321000
000000 COPY SRP0752.                                                    00322000
003230******************************************************************00323000
003240 BREAKAWAY-RETURN-FINISH SECTION.                                 00324000
003250 BRF-START.                                                       00325000
003260     PERFORM PANEL-DATA-GET.                                      00326000
003270     MOVE 'B' TO COM-FROM-PANEL.                                  00327000
003280     GO TO PANEL-ROUTER.                                          00328000
003290 BRF-EXIT.                                                        00329000
003300     EXIT.                                                        00330000
003310******************************************************************00331000
003320 PROCESS-KEY-PANEL SECTION.                                       00332000
003330 PKP-START.                                                       00333000
003340     IF INITIAL-PANEL                                             00334000
003350         GO TO PKP-CONTINUE.                                      00335000
003360     IF EDIT-PANEL                                                00336000
003370         AND FROM-MAINT-PANEL                                     00337000
003380         MOVE SPACE TO COM-FROM-PANEL                             00338000
003390         GO TO PKP-RELOAD-PANEL.                                  00339000
003400 PKP-CONTINUE.                                                    00340000
003410     MOVE COM-NEXTKEY TO SR-PSLIST.                               00341000
003420     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00342000
003430         GO TO PKP-SEND-PANEL.                                    00343000
003440 PKP-BEGIN-EDITS.                                                 00344000
003450     IF EDIT-PANEL                                                00345000
003460         MOVE RPV300K-PRODCD TO COM-KEY-PRODCODE                  00346000
003470         MOVE RPV300K-ACCOUNT TO COM-KEY-ACCOUNT                  00347000
003480         MOVE RPV300K-MODEL TO COM-KEY-MODELX                     00348000
P0076          MOVE RPV300K-EXPDT TO COM-KEY-EXPDT                      00348500
003490         GO TO PKP-RETURN-EDITS.                                  00349000
003500     PERFORM PARAMETER-SEARCH.                                    00350000
003510     MOVE SR-PSPARM TO COM-EXTID.                                 00351000
003520     MOVE SR-PSPARM TO COM-EXTERNALID.                            00352000
003530     PERFORM PARAMETER-SEARCH.                                    00353000
003540     MOVE SR-PSPARM TO COM-KEY-PRODCODE.                          00354000
003550     PERFORM PARAMETER-SEARCH.                                    00355000
003560     MOVE SR-PSPARM TO COM-KEY-ACCOUNT.                           00356000
003570     PERFORM PARAMETER-SEARCH.                                    00357000
003580     MOVE SR-PSPARM TO COM-KEY-MODELX.                            00358000
P0076      PERFORM PARAMETER-SEARCH.                                    00358300
P0076      MOVE SR-PSPARM TO COM-KEY-EXPDT.                             00358600
003590 PKP-RETURN-EDITS.                                                00359000
003600     IF COM-KEY-PRODCODE IS EQUAL TO SPACE                        00360000
003610         MOVE LOW-VALUE TO COM-KEY-PRODCODE.                      00361000
003620     IF COM-KEY-ACCOUNT IS EQUAL TO SPACE                         00362000
003630         MOVE LOW-VALUE TO COM-KEY-ACCOUNT.                       00363000
003640     IF COM-KEY-MODELX IS EQUAL TO SPACES                         00364000
003650         MOVE LOW-VALUES TO COM-KEY-MODELX.                       00365000
P0076      IF COM-KEY-EXPDT IS EQUAL TO SPACES                          00365300
P0076          MOVE LOW-VALUES TO COM-KEY-EXPDT.                        00365600
003660     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00366000
003670         MOVE '000002' TO WS-MSGNBR                               00367000
003680         GO TO PKP-RETURN-CONT.                                   00368000
003690     PERFORM EDIT-ACCOUNT-KEY.                                    00369000
003700 PKP-RETURN-CONT.                                                 00370000
003710     IF INITIAL-PANEL                                             00371000
003720         AND COM-KEY-PRODCODE IS EQUAL TO LOW-VALUES              00372000
003730         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUES               00373000
003740         AND COM-KEY-MODELX IS EQUAL TO LOW-VALUES                00374000
003750         MOVE '000001' TO WS-MSGNBR                               00375000
003760         GO TO PKP-SEND-PANEL.                                    00376000
003770 PKP-RETURN-MODEL.                                                00377000
003780     IF COM-KEY-MODEL IS EQUAL TO LOW-VALUES                      00378000
003790         MOVE SPACES TO COM-KEY-MODEL.                            00379000
003800     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00380000
003810     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00381000
003820     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00382000
003830         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00383000
003840     ELSE                                                         00384000
003850         MOVE ZERO TO COM-ACCOUNT.                                00385000
P0076      MOVE ZEROS TO COM-EXPDT.                                     00385070
P0076      IF RPV300K-EXPDT IS NOT EQUAL TO SPACES                      00385140
P0076          AND RPV300K-EXPDT IS NOT EQUAL TO LOW-VALUE              00385210
P0076          MOVE RPV300K-EXPDT TO SR-CODASYL-EDITED                  00385280
P0076          MOVE '-' TO SR-CDDELIM                                   00385350
P0076          MOVE '3' TO SR-CDSEQ                                     00385420
P0076          PERFORM DEEDIT-CODASYL-DATE                              00385490
P0076          IF SR-CDERROR IS NOT EQUAL TO SPACE                      00385560
P0076              MOVE PDB-RPV300K-EXPDT TO PAN-SET-FLD                00385630
P0076              PERFORM CALL-BISPAN-RPV300K                          00385700
P0076              MOVE 500091 TO WS-MSGNBR                             00385770
P0076              END-IF                                               00385840
P0076          MOVE SR-CODASYL TO COM-EXPDT.                            00385910
003860     IF FROM-BREAKAWAY                                            00386000
003870         OR FROM-HELP                                             00387000
003880         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00388000
003890         GO TO PKP-RELOAD-PANEL.                                  00389000
003900     IF COM-KEY-MODELX IS EQUAL TO ZEROS                          00390000
003910         OR COM-KEY-MODELX IS EQUAL TO SPACES                     00391000
003920         MOVE PDB-RPV300K-MODEL TO WS-CURSOR-FIELD                00392000
003930         MOVE '000002' TO WS-MSGNBR                               00393000
003940         GO TO PKP-RELOAD-PANEL.                                  00394000
003950 PKP-EDITS-READY.                                                 00395000
003960     MOVE SPACE TO COM-PANEL-ACTION.                              00396000
003970     MOVE '1' TO COM-RETURN.                                      00397000
003980     MOVE 'K' TO COM-FROM-PANEL.                                  00398000
003990     GO TO PANEL-ROUTER.                                          00399000
004000 PKP-RELOAD-PANEL.                                                00400000
004010     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00401000
004020         MOVE LOW-VALUES TO RPV300K-PRODCD                        00402000
004030     ELSE                                                         00403000
004040         MOVE COM-KEY-PRODCODE TO RPV300K-PRODCD.                 00404000
004050     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00405000
004060         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROS                     00406000
004070         MOVE LOW-VALUES TO RPV300K-ACCOUNT                       00407000
004080     ELSE                                                         00408000
004090         MOVE COM-KEY-ACCOUNT TO RPV300K-ACCOUNT.                 00409000
004100     MOVE COM-KEY-MODELX TO RPV300K-MODEL.                        00410000
P0076      IF COM-KEY-EXPDT IS EQUAL TO SPACES                          00410100
P0076          OR COM-KEY-EXPDT IS EQUAL TO ZEROES                      00410200
P0076          MOVE LOW-VALUES TO RPV300K-EXPDT                         00410300
P0076      ELSE                                                         00410400
P0076          MOVE COM-KEY-EXPDT TO RPV300K-EXPDT.                     00410500
004110 PKP-SEND-PANEL.                                                  00411000
004120     MOVE PDB-RPV300K-NAME TO PAN-NAME.                           00412000
004130     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00413000
004140     IF (FROM-HELP                                                00414000
004150         OR FROM-BREAKAWAY)                                       00415000
004160         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00416000
004170         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00417000
004180     ELSE                                                         00418000
004190         IF WS-CURSOR-FIELD IS EQUAL TO SPACE                     00419000
004200             MOVE PDB-RPV300K-PRODCD TO PAN-SET-FLD               00420000
004210         ELSE                                                     00421000
004220             MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                 00422000
004230     PERFORM CALL-BISPAN-RPV300K.                                 00423000
004240     MOVE COM-OPERID TO RPV300K-OPERID.                           00424000
004250     MOVE COM-INST TO RPV300K-INST.                               00425000
004260     MOVE COM-EDIT-DATE TO RPV300K-SYSDATE.                       00426000
004270     IF RPV300K-PRODCD IS EQUAL TO SPACES                         00427000
004280         MOVE LOW-VALUES TO RPV300K-PRODCD.                       00428000
004290     MOVE RPV300K-ACCOUNT TO SR-JUSTIFYIN.                        00429000
004300     MOVE +18 TO SR-JLGTH.                                        00430000
004310     PERFORM LEFT-JUSTIFY.                                        00431000
004320     MOVE SR-JUSTIFYOUT TO RPV300K-ACCOUNT.                       00432000
004330     IF RPV300K-ACCOUNT IS EQUAL TO SPACES                        00433000
004340         MOVE LOW-VALUES TO RPV300K-ACCOUNT.                      00434000
P0076      IF RPV300K-EXPDT IS EQUAL TO SPACES                          00434300
P0076          MOVE LOW-VALUES TO RPV300K-EXPDT.                        00434600
004350     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00435000
004360         MOVE WS-HELPMSG TO WS-MSGNBR.                            00436000
004370     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00437000
004380         MOVE '000027' TO WS-MSGNBR                               00438000
004390     ELSE                                                         00439000
004400         PERFORM BUILD-NEXTKEY                                    00440000
004410         PERFORM COMPRESS-NEXTKEY                                 00441000
004420         MOVE WS-NEXTKEY TO RPV300K-COMMAND.                      00442000
004430     IF FROM-BREAKAWAY                                            00443000
004440         OR FROM-HELP                                             00444000
004450         MOVE SPACES TO COM-FROM-PANEL                            00445000
004460         MOVE COM-KEY-COMMAND TO RPV300K-COMMAND                  00446000
004470         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00447000
004480     ELSE                                                         00448000
004490         MOVE RPV300K-COMMAND TO COM-KEY-COMMAND                  00449000
004500         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00450000
004510     MOVE 'E' TO COM-RETURN.                                      00451000
004520     PERFORM GET-MESSAGE.                                         00452000
004530     MOVE WS-MESSAGE TO RPV300K-MSGLINE.                          00453000
004540     PERFORM PANEL-PFKEY-SET.                                     00454000
004550     PERFORM BUILD-PFKEY-LINE.                                    00455000
004560     MOVE WS-PFLINE1 TO RPV300K-PFLINE1.                          00456000
004570     MOVE WS-PFLINE2 TO RPV300K-PFLINE2.                          00457000
004580     PERFORM PANEL-PUT-RPV300K.                                   00458000
004590     PERFORM PANEL-SEND.                                          00459000
004600     MOVE 'E' TO COM-PANEL-ACTION.                                00460000
004610     MOVE COM-INTID TO WS-TRANSID.                                00461000
004620     GO TO CICS-RETURN-TRANSID.                                   00462000
004630 PKP-EXIT.                                                        00463000
004640     EXIT.                                                        00464000
004650******************************************************************00465000
004660 PROCESS-MAINT-PANEL SECTION.                                     00466000
004670 PMP-START.                                                       00467000
004680     IF FROM-BREAKAWAY                                            00468000
004690         OR FROM-HELP                                             00469000
004700         MOVE SPACE TO COM-FROM-PANEL                             00470000
004710         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00471000
004720         MOVE PAN-CURSOR-FLD TO WS-CURSOR-FIELD                   00472000
004730         GO TO PMP-SEND-PANEL.                                    00473000
004740     MOVE 'E' TO COM-END.                                         00474000
004750     IF INITIAL-PANEL                                             00475000
004760         MOVE LOW-VALUES TO RPV300-PANL-DATA-AREA                 00476000
004770         MOVE SPACES TO COM-PANEL-ACTION                          00477000
004780         MOVE 'VKL' TO RPXXX02-APIFUNC                            00478000
004790         GO TO PMP-LINK-TO-RPLXXX02.                              00479000
004800 PMP-PFKEYS.                                                      00480000
004810     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00481000
004820         MOVE SPACES TO WS-CURSOR-FIELD                           00482000
004830         GO TO PMP-SEND-PANEL.                                    00483000
004840     IF EIBAID IS EQUAL TO DFHPF4                                 00484000
004850         GO TO PMP-CONTINUE.                                      00485000
004860     MOVE COM-NEXTKEY TO WS-NEXTKEY.                              00486000
004870 PMP-CONTINUE.                                                    00487000
004880     MOVE ZERO TO WS-MSGNBR.                                      00488000
004890     PERFORM MOVE-PANEL-TO-RECORD.                                00489000
004900     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00490000
004910         OR COM-IDNBR-CHANGE IS EQUAL TO 'Y'                      00491000
004920         GO TO CLOSE-TRANSACTION.                                 00492000
004930 PMP-LINK-TO-RPLXXX02.                                            00493000
004940     IF INITIAL-PANEL                                             00494000
004950         MOVE 'VKL' TO RPXXX02-APIFUNC.                           00495000
004960     IF EDIT-PANEL                                                00496000
004970         MOVE 'UPD' TO RPXXX02-APIFUNC.                           00497000
004980     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00498000
004990         MOVE 'EDT' TO RPXXX02-APIFUNC.                           00499000
005000     PERFORM RPXXX02-LINK-MESSAGE.                                00500000
005010     IF RPXXX02-RETURN IS EQUAL TO 'E'                            00501000
005020         MOVE 'E' TO COM-PANEL-ACTION                             00502000
005030         MOVE 'E' TO COM-RETURN                                   00503000
005040         MOVE 'M' TO COM-FROM-PANEL                               00504000
005050         GO TO PANEL-ROUTER.                                      00505000
005060     IF RPXXX02-APIFUNC IS EQUAL TO 'UPD'                         00506000
005070         AND RPXXX02-IDNBR-CHANGE IS NOT EQUAL TO 'Y'             00507000
005080         GO TO CLOSE-TRANSACTION.                                 00508000
005090     MOVE RPXXX02-UPDATE TO COM-UPDATE.                           00509000
005100     IF RPXXX02-APIFUNC IS EQUAL TO 'VKL'                         00510000
005110         MOVE RPXXX02-CUST-NAME TO COM-CUST-NAME.                 00511000
005120 PMP-MOVE-RECORD-TO-PANEL.                                        00512000
005130     MOVE COM-PRODCODE TO RPV300-PRODCD.                          00513000
005140     MOVE COM-KEY-ACCOUNT TO RPV300-ACCOUNT.                      00514000
005150     PERFORM MOVE-RECORD-TO-PANEL.                                00515000
005160 PMP-SEND-PANEL.                                                  00516000
005170     IF WS-CURSOR-FIELD IS EQUAL TO SPACE                         00517000
005180         MOVE PDB-RPV300-COMMAND TO PAN-SET-FLD                   00518000
005190     ELSE                                                         00519000
005200         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                     00520000
005210     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00521000
005220     PERFORM CALL-BISPAN-RPV300.                                  00522000
005230     MOVE COM-INST TO RPV300-INST.                                00523000
005240     MOVE COM-OPERID TO RPV300-OPERID.                            00524000
005250     MOVE COM-EDIT-DATE TO RPV300-SYSDATE.                        00525000
005260     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00526000
005270         MOVE WS-HELPMSG TO WS-MSGNBR.                            00527000
005280     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00528000
005290         AND WS-MSGNBR IS EQUAL TO ZERO                           00529000
005300         MOVE '000027' TO WS-MSGNBR                               00530000
005310     ELSE                                                         00531000
005320         PERFORM BUILD-NEXTKEY                                    00532000
005330         PERFORM COMPRESS-NEXTKEY                                 00533000
005340         MOVE WS-NEXTKEY TO RPV300-COMMAND.                       00534000
005350     IF COM-IDNBR-CHANGE IS EQUAL TO 'Y'                          00535000
005360         MOVE '500002' TO WS-MSGNBR.                              00536000
005370     MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                            00537000
005380     PERFORM GET-MESSAGE.                                         00538000
005390     MOVE WS-MESSAGE TO RPV300-MSGLINE.                           00539000
005400     PERFORM PANEL-PFKEY-SET.                                     00540000
005410     PERFORM BUILD-PFKEY-LINE.                                    00541000
005420     MOVE WS-PFLINE1 TO RPV300-PFLINE1.                           00542000
005430     MOVE WS-PFLINE2 TO RPV300-PFLINE2.                           00543000
005440     PERFORM PANEL-PUT-RPV300.                                    00544000
005450     PERFORM PANEL-SEND.                                          00545000
005460     MOVE 'M' TO COM-FROM-PANEL.                                  00546000
005470     MOVE '1' TO COM-RETURN.                                      00547000
005480     MOVE 'E' TO COM-PANEL-ACTION.                                00548000
005490     MOVE COM-INTID TO WS-TRANSID.                                00549000
005500     GO TO CICS-RETURN-TRANSID.                                   00550000
005510 PMP-EXIT.                                                        00551000
005520     EXIT.                                                        00552000
005530******************************************************************00553000
005540 MOVE-PANEL-TO-RECORD SECTION.                                    00554000
005550 MPTR-START.                                                      00555000
005560     MOVE COM-KEY-MODEL TO RPXXX02-KEY-MODEL.                     00556000
005570     MOVE COM-MODEL-DESC TO RPXXX02-MODEL-DESC.                   00557000
005580     MOVE COM-CUST-KEY TO RPXXX02-CUST-KEY.                       00558000
005590     MOVE COM-CUST-NAME TO RPXXX02-CUST-NAME.                     00559000
005600     MOVE COM-KEY-BRANCH TO RPXXX02-BRANCH.                       00560000
005610     MOVE COM-ACCT-TYPE TO RPXXX02-ACCT-TYPE.                     00561000
005620     MOVE COM-IDNUMBER TO RPXXX02-IDNUMBER.                       00562000
005630     MOVE COM-RP-PRODCODE TO RPXXX02-RP-PRODCODE.                 00563000
005640     MOVE COM-ENROLLATTEMPTS TO RPXXX02-ENROLL-ATTEMPTS.          00564000
005650 MPTR-EXIT.                                                       00565000
005660     EXIT.                                                        00566000
005670******************************************************************00567000
005680 MOVE-RECORD-TO-PANEL SECTION.                                    00568000
005690 MRTP-START.                                                      00569000
005700     MOVE RPXXX02-IDNBR-CHANGE TO COM-IDNBR-CHANGE.               00570000
005710     MOVE RPXXX02-KEY-MODEL TO COM-KEY-MODEL.                     00571000
005720     MOVE COM-KEY-MODEL TO RPV300-MODEL.                          00572000
005730     MOVE RPXXX02-MODEL-DESC TO COM-MODEL-DESC.                   00573000
005740     MOVE COM-MODEL-DESC TO RPV300-MODDESC.                       00574000
005750     MOVE RPXXX02-CUST-NAME TO COM-CUST-NAME.                     00575000
005760     MOVE COM-CUST-NAME TO RPV300-CUSTNA.                         00576000
005770     MOVE RPXXX02-IDNUMBER TO COM-IDNUMBER.                       00577000
005780     MOVE COM-IDNUMBER TO RPV300-IDNBR.                           00578000
005790     MOVE RPXXX02-CUST-KEY TO COM-CUST-KEY.                       00579000
005800     MOVE RPXXX02-BRANCH TO COM-KEY-BRANCH.                       00580000
005810     MOVE RPXXX02-ACCT-TYPE TO COM-ACCT-TYPE.                     00581000
005820     MOVE RPXXX02-RP-PRODCODE TO COM-RP-PRODCODE.                 00582000
005830     MOVE RPXXX02-ENROLL-ATTEMPTS TO COM-ENROLLATTEMPTS.          00583000
P0076      MOVE RPXXX02-EXPIRATION-DATE TO COM-EXPDT.                   00583500
005840 MRTP-EXIT.                                                       00584000
005850     EXIT.                                                        00585000
005860******************************************************************00586000
005870 MORE-DATA-PANELS SECTION.                                        00587000
005880 MDP-START.                                                       00588000
005890     GO TO PANEL-ROUTER.                                          00589000
005900 MDP-EXIT.                                                        00590000
005910     EXIT.                                                        00591000
005920******************************************************************00592000
005930 CLOSE-TRANSACTION SECTION.                                       00593000
000000 COPY SRP0722.                                                    00594000
005950******************************************************************00595000
005960 PANEL-INIT SECTION.                                              00596000
000000 COPY SRP073.                                                     00597000
005980******************************************************************00598000
005990 BUILD-NEXTKEY SECTION.                                           00599000
006000 BXN-START.                                                       00600000
006010     MOVE SPACES TO WS-NEXTKEY.                                   00601000
006020     MOVE ',' TO WS-DELIM1.                                       00602000
006030     MOVE ',' TO WS-DELIM2.                                       00603000
006040     MOVE ',' TO WS-DELIM3.                                       00604000
P0076      MOVE ',' TO WS-DELIM4.                                       00604500
006050     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00605000
006060     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00606000
006070         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00607000
006080     ELSE                                                         00608000
006090         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00609000
006100     IF COM-KEY-MODELX IS NOT NUMERIC                             00610000
006110         MOVE COM-KEY-MODELX TO WS-MODELX                         00611000
006120     ELSE                                                         00612000
006130         MOVE COM-KEY-MODEL TO WS-MODEL.                          00613000
P0076      MOVE COM-KEY-EXPDT TO WS-EXPDT.                              00613500
006140     MOVE COM-EXTERNALID TO WS-EXTID.                             00614000
006150 BXN-EXIT.                                                        00615000
006160     EXIT.                                                        00616000
006170******************************************************************00617000
006180 ABORT-EXIT SECTION.                                              00618000
006190 AE-START.                                                        00619000
006200     MOVE EIBFN TO COM-ABEIBFN.                                   00620000
006210     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00621000
006220     GO TO CICS-ABORT-EXIT.                                       00622000
006230 AE-EXIT.                                                         00623000
006240     EXIT.                                                        00624000
006250******************************************************************00625000
006260 RPXXX02-LINK-MESSAGE SECTION.                                    00626000
006270 CXLM-START.                                                      00627000
006280     MOVE 'Y' TO RPXXX02-GLOBAL-CLOSE.                            00628000
006290     MOVE WS-FILEOPTIONS TO RPXXX02-FILEOPTS.                     00629000
006300     MOVE COM-RETURN TO RPXXX02-RETURN.                           00630000
006310     MOVE COM-MODELID TO RPXXX02-MODELID.                         00631000
006320     MOVE COM-SECALT TO RPXXX02-SECALT.                           00632000
006330     MOVE COM-OPERID TO RPXXX02-OPERID.                           00633000
006340     MOVE COM-DATE TO RPXXX02-DATE.                               00634000
006350     MOVE COM-EXTERNALID TO RPXXX02-EXTERNALID.                   00635000
006360     MOVE COM-EIBTRMID TO RPXXX02-TERMID.                         00636000
006370     MOVE COM-WKUNAME TO RPXXX02-WORKID.                          00637000
006380     MOVE COM-TRANSTART TO RPXXX02-TRANSTART.                     00638000
006390     MOVE COM-APPLSEQ TO RPXXX02-APPLSEQ.                         00639000
006400     MOVE COM-UPDATE TO RPXXX02-UPDATE.                           00640000
006410     MOVE WS-RPSAPPLNBR TO RPXXX02-APPL.                          00641000
006420     MOVE 'N' TO RPXXX02-FUNC.                                    00642000
006430     MOVE COM-INST TO RPXXX02-KEY-INST.                           00643000
006440     MOVE COM-PRODCODE TO RPXXX02-KEY-PRODCODE.                   00644000
006450     MOVE COM-KEY-ACCOUNT TO RPXXX02-KEY-ACCOUNT.                 00645000
006460     MOVE COM-KEY-MODEL TO RPXXX02-KEY-MODEL.                     00646000
P0076      MOVE COM-EXPDT TO RPXXX02-EXPIRATION-DATE.                   00646500
006470     MOVE ZERO TO RPXXX02-ERRCNT.                                 00647000
006480     MOVE ZERO TO RPXXX02-MSGNBR.                                 00648000
006490     MOVE COM-LANG TO RPXXX02-COM-LANG.                           00649000
006500     MOVE COM-CURN-CODE TO RPXXX02-COM-CURNCD.                    00650000
006510     MOVE COM-INST-OPTS TO RPXXX02-INST-OPTS.                     00651000
006520     EXEC CICS LINK                                               00652000
006530         PROGRAM('RPLXXX02')                                      00653000
006540         COMMAREA(RPXXX02-MESSAGE)                                00654000
006550         LENGTH(LENGTH OF RPXXX02-MESSAGE)                        00655000
006560         RESP(WS-CICS-RESPONSE)                                   00656000
006570         END-EXEC.                                                00657000
006580     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00658000
006590         MOVE 'RPLXXX02 LINK FAILED' TO COM-ABMSG                 00659000
006600         MOVE WS-TR0002 TO COM-ABTRACE                            00660000
006610         MOVE WS-AB0009 TO COM-ABORT                              00661000
006620         GO TO CICS-ABORT-EXIT.                                   00662000
006630     MOVE RPXXX02-FUNCTION TO WS-FUNCTION.                        00663000
006640     IF RPXXX02-ABORT IS NOT EQUAL TO ZERO                        00664000
006650         MOVE RPXXX02-ABORT TO COM-ABORT                          00665000
006660         MOVE RPXXX02-ABTRACE TO COM-ABTRACE                      00666000
006670         MOVE RPXXX02-ABEIBFN TO COM-ABEIBFN                      00667000
006680         MOVE RPXXX02-ABEIBRCODE TO COM-ABEIBRCODE                00668000
006690         MOVE RPXXX02-ABPROGID TO COM-ABPROGID                    00669000
006700         MOVE RPXXX02-SRBMDB TO COM-SRBMDB                        00670000
006710         MOVE RPXXX02-ABTYPE TO COM-ABTYPE                        00671000
006720         GO TO CICS-ABORT-EXIT.                                   00672000
006730     MOVE RPXXX02-FUNC TO COM-FUNC.                               00673000
006740     MOVE RPXXX02-ABORT TO COM-ABORT.                             00674000
006750     MOVE RPXXX02-MSGNBR TO WS-MSGNBR.                            00675000
006760 CXLM-EXIT.                                                       00676000
006770     EXIT.                                                        00677000
006780******************************************************************00678000
006790 CLOSE-PANEL SECTION.                                             00679000
006800 CP-START.                                                        00680000
006810     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       00681000
006820     IF COM-RETURN IS EQUAL TO 'E'                                00682000
006830         PERFORM CALL-BISPAN-RPV300K.                             00683000
006840     IF COM-RETURN IS EQUAL TO '1'                                00684000
006850         PERFORM CALL-BISPAN-RPV300.                              00685000
006860 CP-EXIT.                                                         00686000
006870     EXIT.                                                        00687000
006880******************************************************************00688000
006890 CALL-BISPAN-RPV300K SECTION.                                     00689000
006900 CBD1-START.                                                      00690000
006910     CALL 'BISPAN' USING                                          00691000
006920         BICRPSB,                                                 00692000
006930         BICRSRB,                                                 00693000
006940         BICRPAN,                                                 00694000
006950         RPV300K-PANL-DATA-BLOCK,                                 00695000
006960         RPV300K-PANL-DATA-AREA.                                  00696000
006970 CBD1-EXIT.                                                       00697000
006980     EXIT.                                                        00698000
006990******************************************************************00699000
007000 CALL-BISPAN-RPV300 SECTION.                                      00700000
007010 CBD2-START.                                                      00701000
007020     CALL 'BISPAN' USING                                          00702000
007030         BICRPSB,                                                 00703000
007040         BICRSRB,                                                 00704000
007050         BICRPAN,                                                 00705000
007060         RPV300-PANL-DATA-BLOCK,                                  00706000
007070         RPV300-PANL-DATA-AREA.                                   00707000
007080 CBD2-EXIT.                                                       00708000
007090     EXIT.                                                        00709000
007100******************************************************************00710000
007110 PANEL-GET-RPV300 SECTION.                                        00711000
007120 PANEL-GET-RPV300-START.                                          00712000
007130     MOVE 'N' TO RPV300-SW-SET-CURSOR.                            00713000
007140     MOVE PDB-RPV300-NAME TO PAN-NAME.                            00714000
007150     MOVE REQ-GET TO PAN-REQ-VERB.                                00715000
007160     CALL 'BISPAN' USING                                          00716000
007170         BICRPSB                                                  00717000
007180         BICRSRB                                                  00718000
007190         BICRPAN                                                  00719000
007200         RPV300-PANL-DATA-BLOCK,                                  00720000
007210         RPV300-PANL-DATA-AREA.                                   00721000
007220 PANEL-GET-RPV300-EXIT.                                           00722000
007230     EXIT.                                                        00723000
007240******************************************************************00724000
007250 PANEL-PUT-RPV300 SECTION.                                        00725000
007260 PANEL-PUT-RPV300-START.                                          00726000
007270     MOVE PDB-RPV300-NAME TO PAN-NAME.                            00727000
007280     MOVE REQ-PUT TO PAN-REQ-VERB.                                00728000
007290     CALL 'BISPAN' USING                                          00729000
007300         BICRPSB                                                  00730000
007310         BICRSRB                                                  00731000
007320         BICRPAN                                                  00732000
007330         RPV300-PANL-DATA-BLOCK,                                  00733000
007340         RPV300-PANL-DATA-AREA.                                   00734000
007350 PANEL-PUT-RPV300-EXIT.                                           00735000
007360     EXIT.                                                        00736000
007370******************************************************************00737000
007380 PANEL-GET-RPV300K SECTION.                                       00738000
007390 PANEL-GET-RPV300K-START.                                         00739000
007400     MOVE 'N' TO RPV300K-SW-SET-CURSOR.                           00740000
007410     MOVE PDB-RPV300K-NAME TO PAN-NAME.                           00741000
007420     MOVE REQ-GET TO PAN-REQ-VERB.                                00742000
007430     CALL 'BISPAN' USING                                          00743000
007440         BICRPSB                                                  00744000
007450         BICRSRB                                                  00745000
007460         BICRPAN                                                  00746000
007470         RPV300K-PANL-DATA-BLOCK,                                 00747000
007480         RPV300K-PANL-DATA-AREA.                                  00748000
007490 PANEL-GET-RPV300K-EXIT.                                          00749000
007500     EXIT.                                                        00750000
007510******************************************************************00751000
007520 PANEL-PUT-RPV300K SECTION.                                       00752000
007530 PANEL-PUT-RPV300K-START.                                         00753000
007540     MOVE PDB-RPV300K-NAME TO PAN-NAME.                           00754000
007550     MOVE REQ-PUT TO PAN-REQ-VERB.                                00755000
007560     CALL 'BISPAN' USING                                          00756000
007570         BICRPSB                                                  00757000
007580         BICRSRB                                                  00758000
007590         BICRPAN                                                  00759000
007600         RPV300K-PANL-DATA-BLOCK,                                 00760000
007610         RPV300K-PANL-DATA-AREA.                                  00761000
007620 PANEL-PUT-RPV300K-EXIT.                                          00762000
007630     EXIT.                                                        00763000
007640******************************************************************00764000
007650 MIC-MST-API SECTION.                                             00765000
000000 COPY MIPMSTA.                                                    00766000
007670******************************************************************00767000
007680 EDIT-ACCOUNT-KEY SECTION.                                        00768000
007690 EAK-START.                                                       00769000
007700     MOVE COM-INST TO RPW130-INST.                                00770000
007710     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 00771000
007720     MOVE COM-KEY-PRODCODE TO RPW130-PRODCODE.                    00772000
007730     MOVE COM-KEY-ACCOUNT TO RPW130-ACCOUNTINPUT.                 00773000
007740     MOVE 'V' TO RPW130-FUNCTION.                                 00774000
007750     PERFORM ACCOUNT-KEY-EDIT.                                    00775000
007760     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00776000
007770         MOVE '500003' TO WS-MSGNBR                               00777000
007780         GO TO EAK-EXIT.                                          00778000
007790     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00779000
007800     MOVE RPW130-ACCOUNTKEY TO COM-KEY-ACCOUNT.                   00780000
007810     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          00781000
007820     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      00782000
007830     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                00783000
007840 EAK-EXIT.                                                        00784000
007850     EXIT.                                                        00785000
007860******************************************************************00786000
007870 LEFT-JUSTIFY SECTION.                                            00787000
000000 COPY SRP025.                                                     00788000
007890******************************************************************00789000
007900 RIGHT-JUSTIFY SECTION.                                           00790000
000000 COPY SRP026.                                                     00791000
007920******************************************************************00792000
007930 PARAMETER-SEARCH SECTION.                                        00793000
000000 COPY SRP030.                                                     00794000
007950******************************************************************00795000
007960 COMPRESS-NEXTKEY SECTION.                                        00796000
000000 COPY SRP070.                                                     00797000
007980******************************************************************00798000
007990 GET-MESSAGE SECTION.                                             00799000
000000 COPY SRP071.                                                     00800000
P0076 ******************************************************************00800200
P0076  DEEDIT-CODASYL-DATE SECTION.                                     00800400
000000 COPY SRP086.                                                     00800600
008010******************************************************************00801000
008020 EXAMINE-FIELD SECTION.                                           00802000
000000 COPY SRP166.                                                     00803000
008040******************************************************************00804000
008050 SRP170-ROUTINE SECTION.                                          00805000
000000 COPY SRP170.                                                     00806000
008070******************************************************************00807000
008080 BUILD-PFKEY-LINE SECTION.                                        00808000
000000 COPY SRP710.                                                     00809000
008100******************************************************************00810000
008110 VALIDATE-PFKEYS SECTION.                                         00811000
000000 COPY SRP711.                                                     00812000
008130******************************************************************00813000
008140 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 00814000
000000 COPY RPP033.                                                     00815000
008160******************************************************************00816000
008170 ACCOUNT-KEY-EDIT SECTION.                                        00817000
000000 COPY RPP130.                                                     00818000
008190******************************************************************00819000
008200 SLP096-GET-2023-RECORD SECTION.                                  00820000
000000 COPY SLP096.                                                     00821000
008220******************************************************************00822000
008230 CICS-XCTL SECTION.                                               00823000
000000 COPY SLP704.                                                     00824000
008250******************************************************************00825000
008260 CICS-RETURN-TRANSID SECTION.                                     00826000
000000 COPY SLP710.                                                     00827000
008280******************************************************************00828000
008290 TSQ-DELETE SECTION.                                              00829000
008300 TSQD-START.                                                      00830000
008310 TSQD-EXIT.                                                       00831000
008320     EXIT.                                                        00832000
008330******************************************************************00833000
008340 CICS-ABORT-EXIT SECTION.                                         00834000
000000 COPY SLP798.                                                     00835000
008360******************************************************************00836000
