000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL355.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL355 - ADD-ON RELATIONSHIP NEW REVIEW                     *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRCONS.                                                    00024000
000000 COPY BICRCONS.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRPAN.                                                     00028000
000000 COPY BICRPAN.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  RPV355K-PANL-DATA-BLOCK.                                     00032000
000000 COPY RPV355KW.                                                   00033000
000340 01  RPV355-PANL-DATA-BLOCK.                                      00034000
000000 COPY RPV355W.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00037000
000380     03  WS-NEXTKEY.                                              00038000
000390         05  WS-EXTID            PIC X(08).                       00039000
000400         05  WS-DELIM1           PIC X(01)       VALUE ','.       00040000
000410         05  WS-DATA.                                             00041000
000420             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00042000
000430             07  WS-DELIM2       PIC X(01)       VALUE ','.       00043000
000440             07  WS-ACCTX.                                        00044000
000450                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00045000
000460             07  WS-DELIM3       PIC X(01)       VALUE ','.       00046000
000470             07  WS-MODEL        PIC X(10)       VALUE SPACES.    00047000
000480         05  FILLER              PIC X(33)       VALUE SPACES.    00048000
000490     03  WS-MORE                 PIC X(05)       VALUE 'More:'.   00049000
000500     03  WS-LNKPROG1             PIC X(08)       VALUE 'RPLXXX06'.00050000
000510     03  WS-LKLGTH               PIC S9(04)      COMP             00051000
000520                                                 VALUE +4088.     00052000
000530     03  WS-DCHG-TEST            PIC X(01)       VALUE SPACE.     00053000
000540         88  WS-DCHG-PROTECT                     VALUE 'P'.       00054000
000550         88  WS-DCHG-EDITERR                     VALUE 'E'.       00055000
000560         88  WS-DCHG-HIDDEN                      VALUE 'H'.       00056000
000570     03  WS-ERROR-COUNT          PIC S9(04)      COMP             00057000
000580                                                 VALUE ZERO.      00058000
000590     03  WS-PDATE                PIC 9(08).                       00059000
000600     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00060000
000610         05  WS-PDATE-YYYY       PIC 9(04).                       00061000
000620         05  WS-PDATE-MM         PIC 9(02).                       00062000
000630         05  WS-PDATE-DD         PIC 9(02).                       00063000
000640     03  WS-SUB1                 PIC S9(04)      COMP             00064000
000650                                                 VALUE +0000.     00065000
000660     03  WS-SUB2                 PIC S9(04)      COMP             00066000
000670                                                 VALUE +0000.     00067000
000680 01  WS-LINKMSG                  PIC X(4500).                     00068000
000690 01  RPXXX06-MESSAGE.                                             00069000
000000 COPY MISCNT00      REPLACING                                     00070000
000710             ==:MICNT:== BY ==RPXXX06==.                          00071000
000000 COPY RPSXXX06.                                                   00072000
000730 01  WS-TSQAREAS.                                                 00073000
000740     03  WS-TSQITEM              PIC S9(04)      COMP             00074000
000750                                                 VALUE +0001.     00075000
000760     03  WS-TSQLGTH              PIC S9(04)      COMP             00076000
000770                                                 VALUE +4096.     00077000
000780     03  WS-TSQKEY.                                               00078000
000790         05  WS-TSQID            PIC X(04).                       00079000
000800         05  WS-TSQTRMID         PIC X(04).                       00080000
000810 01  LS-TSQAREA.                                                  00081000
000820     03  LS-TSQKEY               PIC X(08).                       00082000
000830     03  LS-TSQDATA              PIC X(4088).                     00083000
000840 01  MIWPRI-AREAS.                                                00084000
000000 COPY MIWPRI.                                                     00085000
000860 01  MIWMSTA-AREAS.                                               00086000
000000 COPY MIWMSTA.                                                    00087000
000880 01  MIMST-RECORD.                                                00088000
000000 COPY MISMST.                                                     00089000
000900 01  MI2023-RECORD.                                               00090000
000000 COPY MIS2023A.                                                   00091000
000920 01  WS-ABORTCODES.                                               00092000
000930     03  WS-AB0009               PIC S9(04)      COMP             00093000
000940                                                 VALUE +0009.     00094000
000950     03  WS-AB0106               PIC S9(04)      COMP             00095000
000960                                                 VALUE +0106.     00096000
000970     03  WS-AB2033               PIC S9(04)      COMP             00097000
000980                                                 VALUE +2033.     00098000
000990     03  WS-AB6345               PIC S9(04)      COMP             00099000
001000                                                 VALUE +6345.     00100000
001010 01  WS-TRACECODES.                                               00101000
001020     03  WS-TR0001               PIC S9(04)      COMP             00102000
001030                                                 VALUE +0001.     00103000
001040     03  WS-TR0002               PIC S9(04)      COMP             00104000
001050                                                 VALUE +0002.     00105000
001060     03  WS-TR0003               PIC S9(04)      COMP             00106000
001070                                                 VALUE +0003.     00107000
001080 01  SLW096-AREAS.                                                00108000
000000 COPY SLW096.                                                     00109000
001100 01  RPW014-AREAS.                                                00110000
000000 COPY RPW014.                                                     00111000
001120 01  RPW033-AREAS.                                                00112000
000000 COPY RPW033.                                                     00113000
001140 01  RPW130-AREAS.                                                00114000
000000 COPY RPW130.                                                     00115000
001160 01  SRW000-AREAS.                                                00116000
000000 COPY SRW000.                                                     00117000
001180 01  SRW025-AREAS.                                                00118000
000000 COPY SRW025.                                                     00119000
001200 01  SRW030-AREAS.                                                00120000
000000 COPY SRW030.                                                     00121000
001220 01  SRW031-AREAS.                                                00122000
000000 COPY SRW031.                                                     00123000
001240 01  SRW105-AREAS.                                                00124000
000000 COPY SRW105.                                                     00125000
001260 01  SRW161-AREAS.                                                00126000
000000 COPY SRW161.                                                     00127000
001280 01  SRW166-AREAS.                                                00128000
000000 COPY SRW166.                                                     00129000
001300 01  SRW170-AREAS.                                                00130000
000000 COPY SRW170.                                                     00131000
001320 COPY DFHAID.                                                     00132000
001330******************************************************************00133000
001340 LINKAGE SECTION.                                                 00134000
001350 01  DFHCOMMAREA.                                                 00135000
000000 COPY SLS1112.                                                    00136000
001370     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00137000
001380         05  COM-EDIT-DATE       PIC X(10).                       00138000
001390         05  COM-KEY-INFO.                                        00139000
001400             07  COM-KEY-OCCUR   PIC S9(04)      COMP-3.          00140000
001410             07  COM-KEY-DATA                    OCCURS 11 TIMES. 00141000
001420                 09  COM-KD-GRP1.                                 00142000
001430                     11  COM-KD-INST                              00143000
001440                                 PIC 9(04).                       00144000
001450                     11  COM-KD-PRODCODE                          00145000
001460                                 PIC X(06).                       00146000
001470                     11  COM-KD-ACCOUNT                           00147000
001480                                 PIC X(18).                       00148000
001490                     11  COM-KD-ACCOUNT-N                         00149000
001500                         REDEFINES COM-KD-ACCOUNT                 00150000
001510                                 PIC 9(18).                       00151000
001520                     11  COM-KD-MODEL                             00152000
001530                                 PIC X(10).                       00153000
001540                 09  COM-KD-GRP2.                                 00154000
001550                     11  COM-KD-INST2                             00155000
001560                                 PIC 9(04).                       00156000
001570                     11  COM-KD-PRODCODE2                         00157000
001580                                 PIC X(06).                       00158000
001590                     11  COM-KD-ACCOUNT2                          00159000
001600                                 PIC X(18).                       00160000
001610                     11  COM-KD-ACCOUNT-N2                        00161000
001620                         REDEFINES COM-KD-ACCOUNT2                00162000
001630                                 PIC 9(18).                       00163000
001640         05  COM-KEY-FIELDS.                                      00164000
001650             07  COM-KEY-PRODCODE                                 00165000
001660                                 PIC X(06).                       00166000
001670             07  COM-KEY-ACCOUNT PIC X(18).                       00167000
001680             07  COM-KEY-ACCOUNT-N                                00168000
001690                         REDEFINES COM-KEY-ACCOUNT                00169000
001700                                 PIC 9(18).                       00170000
001710             07  COM-KEY-MODEL                                    00171000
001720                                 PIC X(10).                       00172000
001730             07  COM-KEY-IDNBRX  PIC X(18).                       00173000
001740             07  COM-KEY-IDNBR                                    00174000
001750                         REDEFINES COM-KEY-IDNBRX                 00175000
001760                                 PIC 9(18).                       00176000
001770         05  COM-PANEL-ACTION    PIC X(01).                       00177000
001780             88  INITIAL-PANEL                   VALUE ' '.       00178000
001790             88  EDIT-PANEL                      VALUE 'E'.       00179000
001800         05  COM-FROM-PANEL      PIC X(01).                       00180000
001810             88  FROM-KEY-PANEL                  VALUE 'K'.       00181000
001820             88  FROM-INFO-PANEL                 VALUE 'I'.       00182000
001830             88  FROM-HELP                       VALUE 'H'.       00183000
001840             88  FROM-BREAKAWAY                  VALUE 'B'.       00184000
001850         05  COM-KEY-FORMATTEDACCT                                00185000
001860                                 PIC X(22).                       00186000
001870         05  COM-KEY-MSGNBR      PIC X(06).                       00187000
001880         05  COM-KEY-COMMAND     PIC X(50).                       00188000
001890         05  COM-RCIF-KEY.                                        00189000
001900             07  COM-RCIF-CUST-INST                               00190000
001910                                 PIC 9(04).                       00191000
001920             07  COM-RCIF-CUST-TYPE                               00192000
001930                                 PIC X(01).                       00193000
001940             07  COM-RCIF-CUST.                                   00194000
001950                 09  COM-RCIF-ALPHA                               00195000
001960                                 PIC X(14).                       00196000
001970                 09  COM-RCIF-ACCUM                               00197000
001980                                 PIC 9(03).                       00198000
001990                 09  COM-RCIF-TIEBRKR                             00199000
002000                                 PIC 9(04).                       00200000
002010         05  COM-CUST-NAME       PIC X(40).                       00201000
002020         05  COM-REL-STAT        PIC X(01).                       00202000
002030         05  COM-IDNUMBER        PIC X(18).                       00203000
002040         05  COM-MODEL           PIC X(10).                       00204000
002050         05  COM-MODEL-DESC      PIC X(20).                       00205000
002060         05  COM-FIRST-KEY       PIC X(66).                       00206000
002070         05  COM-LAST-KEY        PIC X(66).                       00207000
002080         05  COM-MORE            PIC X(01).                       00208000
002090         05  COM-RPXXX06-CURPAGE PIC S9(04)      COMP-3.          00209000
002100         05  COM-DCHG.                                            00210000
002110             07  FILLER                          OCCURS 10 TIMES. 00211000
002120                 09  COM-DEL-DCHG                                 00212000
002130                                 PIC X(01).                       00213000
002140******************************************************************00214000
002150*01  SLW096-2023RECORDS.                                          00215000
000000 COPY SLW096L.                                                    00216000
002170******************************************************************00217000
002180 PROCEDURE DIVISION.                                              00218000
002190******************************************************************00219000
002200 ENTRY-ROUTINE SECTION.                                           00220000
002210     MOVE 'RPL355' TO COM-ABPROGID.                               00221000
000000 COPY SLP771.                                                     00222000
002230******************************************************************00223000
002240 TRANSACTION-CLEAN-UP SECTION.                                    00224000
002250 TCU-START.                                                       00225000
002260 TCU-EXIT.                                                        00226000
002270     EXIT.                                                        00227000
002280******************************************************************00228000
002290 CICS-HANDLE-CONDITION SECTION.                                   00229000
000000 COPY SLP772.                                                     00230000
002310     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00231000
002320         GO TO CTSRI-EXIT.                                        00232000
002330     MOVE WS-AB2033 TO COM-ABORT.                                 00233000
002340     MOVE WS-TR0001 TO COM-ABTRACE.                               00234000
002350     GO TO ABORT-EXIT.                                            00235000
002360 CHC-EXIT.                                                        00236000
002370     EXIT.                                                        00237000
002380******************************************************************00238000
002390 ROUTING-ROUTINE SECTION.                                         00239000
002400 RR-START.                                                        00240000
002410     MOVE LOW-VALUES TO RPXXX06-MESSAGE.                          00241000
002420     MOVE LOW-VALUES TO RPV355-PANL-DATA-AREA.                    00242000
002430     MOVE LOW-VALUES TO RPV355K-PANL-DATA-AREA.                   00243000
002440     MOVE ALL ZEROS TO WS-MSGNBR.                                 00244000
002450     MOVE 'RP00' TO WS-TSQFILEID.                                 00245000
002460     MOVE 'RPI' TO WS-TSQSYSID.                                   00246000
002470     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00247000
002480     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00248000
002490     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00249000
002500         MOVE COM-PAN TO BICRPAN                                  00250000
002510         MOVE COM-PSB TO BICRPSB                                  00251000
002520         MOVE COM-SRB TO BICRSRB                                  00252000
002530     ELSE                                                         00253000
002540         MOVE '1' TO BPSB-LEVEL.                                  00254000
002550     IF COM-RETURN IS EQUAL TO 'B'                                00255000
002560         GO TO BREAKAWAY-RETURN.                                  00256000
002570     IF COM-RETURN IS EQUAL TO '0'                                00257000
002580         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00258000
002590         MOVE SPACES TO COM-WORKAREAS                             00259000
002600         MOVE '1' TO SRB-VERSION                                  00260000
002610         MOVE 'IPRP' TO SRB-APPL-ID                               00261000
002620         MOVE 'RPL355' TO SRB-PROG-ID                             00262000
002630         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00263000
002640         MOVE 'P' TO PAN-TYPE                                     00264000
002650         MOVE SPACE TO PAN-OVERLAY                                00265000
002660         MOVE SPACE TO PAN-CLOSE                                  00266000
002670         MOVE SPACE TO PAN-ALARM                                  00267000
002680         MOVE SPACE TO PAN-CURSOR-PAN                             00268000
002690         MOVE SPACE TO PAN-CURSOR-FLD                             00269000
002700         MOVE SPACE TO PAN-SET-FLD                                00270000
002710         MOVE SPACE TO PAN-SET-VID                                00271000
002720         MOVE SPACE TO PAN-SET-EMP                                00272000
002730         MOVE +0 TO COM-RPXXX06-CURPAGE                           00273000
002740         MOVE +0 TO COM-KEY-OCCUR                                 00274000
002750         MOVE PDB-RPV355K-NAME TO PAN-NAME                        00275000
002760         PERFORM PANEL-INIT                                       00276000
002770         MOVE BICRPAN TO COM-PAN                                  00277000
002780         MOVE BICRPSB TO COM-PSB                                  00278000
002790         MOVE BICRSRB TO COM-SRB                                  00279000
002800         PERFORM INITIALIZE-DATE                                  00280000
002810         GO TO PANEL-ROUTER.                                      00281000
002820     PERFORM PANEL-NAME-SET.                                      00282000
002830     IF COM-HELPSW IS EQUAL TO 'Y'                                00283000
002840         GO TO HELP-RETURN.                                       00284000
002850     PERFORM PANEL-RECEIVE.                                       00285000
002860     PERFORM PANEL-DATA-GET.                                      00286000
002870     IF FROM-INFO-PANEL                                           00287000
002880         PERFORM SET-DCHG-INDICATORS.                             00288000
002890     PERFORM PANEL-PFKEY-SET.                                     00289000
002900     PERFORM VALIDATE-PFKEYS.                                     00290000
002910     IF EIBAID IS EQUAL TO DFHPF1                                 00291000
002920         GO TO GET-HELP.                                          00292000
002930     IF EIBAID IS EQUAL TO DFHPF11                                00293000
002940         GO TO BREAK-AWAY.                                        00294000
002950     IF (COM-RETURN IS EQUAL TO 'E')                              00295000
002960         AND (EIBAID IS EQUAL TO DFHPF2                           00296000
002970         OR EIBAID IS EQUAL TO DFHPF3                             00297000
002980         OR EIBAID IS EQUAL TO DFHPF4                             00298000
002990         OR EIBAID IS EQUAL TO DFHPF7                             00299000
003000         OR EIBAID IS EQUAL TO DFHPF8                             00300000
003010         OR EIBAID IS EQUAL TO DFHPF12)                           00301000
003020         GO TO CLOSE-TRANSACTION.                                 00302000
003030     IF COM-RETURN IS EQUAL TO '1'                                00303000
003040         AND                                                      00304000
003050         (EIBAID IS EQUAL TO DFHPF12                              00305000
003060         OR EIBAID IS EQUAL TO DFHPF3)                            00306000
003070         GO TO CLOSE-TRANSACTION.                                 00307000
003080     IF COM-RETURN IS EQUAL TO '0'                                00308000
003090         OR COM-RETURN IS EQUAL TO 'E'                            00309000
003100         OR COM-RETURN IS EQUAL TO '1'                            00310000
003110         GO TO PANEL-ROUTER.                                      00311000
003120 RR-END.                                                          00312000
003130     GO TO CLOSE-TRANSACTION.                                     00313000
003140 RR-EXIT.                                                         00314000
003150     EXIT.                                                        00315000
003160******************************************************************00316000
003170 INITIALIZE-DATE SECTION.                                         00317000
003180 ID-START.                                                        00318000
003190     MOVE COM-DATE TO WS-CURDATE8.                                00319000
003200     MOVE '-' TO WS-CD8DSH1.                                      00320000
003210     MOVE '-' TO WS-CD8DSH2.                                      00321000
003220     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00322000
003230 ID-EXIT.                                                         00323000
003240     EXIT.                                                        00324000
003250******************************************************************00325000
003260 PANEL-NAME-SET SECTION.                                          00326000
003270 PNS-START.                                                       00327000
003280     IF COM-RETURN IS EQUAL TO '0'                                00328000
003290         MOVE PDB-RPV355K-NAME TO PAN-NAME.                       00329000
003300     IF COM-RETURN IS EQUAL TO 'E'                                00330000
003310         MOVE PDB-RPV355K-NAME TO PAN-NAME.                       00331000
003320     IF COM-RETURN IS EQUAL TO '1'                                00332000
003330         MOVE PDB-RPV355-NAME TO PAN-NAME.                        00333000
003340 PNS-EXIT.                                                        00334000
003350     EXIT.                                                        00335000
003360******************************************************************00336000
003370 PANEL-DATA-GET SECTION.                                          00337000
003380 PDG-START.                                                       00338000
003390     IF COM-RETURN IS EQUAL TO '0'                                00339000
003400         PERFORM PANEL-GET-RPV355K.                               00340000
003410     IF COM-RETURN IS EQUAL TO 'E'                                00341000
003420         PERFORM PANEL-GET-RPV355K                                00342000
003430         MOVE RPV355K-COMMAND TO WS-NEXTKEY                       00343000
003440         MOVE PDB-RPV355K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00344000
003450     IF COM-RETURN IS EQUAL TO '1'                                00345000
003460         PERFORM PANEL-GET-RPV355                                 00346000
003470         MOVE RPV355-COMMAND TO WS-NEXTKEY                        00347000
003480         MOVE PDB-RPV355-COMMAND-DCHG TO WS-COMMAND-DCHG.         00348000
003490 PDG-EXIT.                                                        00349000
003500     EXIT.                                                        00350000
003510******************************************************************00351000
003520 PANEL-PFKEY-SET SECTION.                                         00352000
003530 PPS-START.                                                       00353000
003540 PPS-EXIT.                                                        00354000
003550     EXIT.                                                        00355000
003560******************************************************************00356000
003570 PANEL-ROUTER SECTION.                                            00357000
003580 PR-START.                                                        00358000
003590     IF COM-RETURN IS EQUAL TO '0'                                00359000
003600         GO TO PROCESS-KEY-PANEL.                                 00360000
003610     IF COM-RETURN IS EQUAL TO 'E'                                00361000
003620         GO TO PROCESS-KEY-PANEL.                                 00362000
003630     IF COM-RETURN IS EQUAL TO '1'                                00363000
003640         GO TO PROCESS-INFO-PANEL.                                00364000
003650     GO TO CLOSE-TRANSACTION.                                     00365000
003660 PR-EXIT.                                                         00366000
003670     EXIT.                                                        00367000
003680******************************************************************00368000
003690 HELP-RETURN SECTION.                                             00369000
000000 COPY SRP074.                                                     00370000
003710******************************************************************00371000
003720 HELP-RETURN-FINISH SECTION.                                      00372000
003730 HRF-START.                                                       00373000
003740     PERFORM PANEL-DATA-GET.                                      00374000
003750     MOVE 'H' TO COM-FROM-PANEL.                                  00375000
003760     GO TO PANEL-ROUTER.                                          00376000
003770 HRF-EXIT.                                                        00377000
003780     EXIT.                                                        00378000
003790******************************************************************00379000
003800 HELP-MISSING-FINISH SECTION.                                     00380000
003810 HMF-START.                                                       00381000
003820     MOVE 'H' TO COM-FROM-PANEL.                                  00382000
003830     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00383000
003840     GO TO PANEL-ROUTER.                                          00384000
003850 HMF-EXIT.                                                        00385000
003860     EXIT.                                                        00386000
003870******************************************************************00387000
003880 BREAK-AWAY SECTION.                                              00388000
000000 COPY SRP0752.                                                    00389000
003900******************************************************************00390000
003910 BREAKAWAY-RETURN-FINISH SECTION.                                 00391000
003920 BRF-START.                                                       00392000
003930     PERFORM PANEL-DATA-GET.                                      00393000
003940     MOVE 'B' TO COM-FROM-PANEL.                                  00394000
003950     GO TO PANEL-ROUTER.                                          00395000
003960 BRF-EXIT.                                                        00396000
003970     EXIT.                                                        00397000
003980******************************************************************00398000
003990 PROCESS-KEY-PANEL SECTION.                                       00399000
004000 PKP-START.                                                       00400000
004010     IF INITIAL-PANEL                                             00401000
004020         MOVE COM-NEXTKEY TO COM-EXTERNALID                       00402000
004030         GO TO PKP-COM-INIT.                                      00403000
004040     IF EDIT-PANEL                                                00404000
004050         AND FROM-INFO-PANEL                                      00405000
004060         MOVE SPACE TO COM-FROM-PANEL                             00406000
004070         GO TO PKP-RELOAD-PANEL.                                  00407000
004080 PKP-COM-INIT.                                                    00408000
004090     MOVE COM-NEXTKEY TO SR-PSLIST.                               00409000
004100     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00410000
004110         GO TO PKP-SEND-PANEL.                                    00411000
004120 PKP-BEGIN-EDITS.                                                 00412000
004130     IF EDIT-PANEL                                                00413000
004140         MOVE RPV355K-PRODCD TO COM-KEY-PRODCODE                  00414000
004150         MOVE RPV355K-ACCOUNT TO COM-KEY-ACCOUNT                  00415000
004160         MOVE RPV355K-MODEL TO COM-KEY-MODEL                      00416000
004170         MOVE RPV355K-IDNBR TO COM-KEY-IDNBRX                     00417000
004180         GO TO PKP-RETURN-EDITS.                                  00418000
004190     PERFORM PARAMETER-SEARCH.                                    00419000
004200     MOVE SR-PSPARM TO COM-EXTID.                                 00420000
004210     MOVE SR-PSPARM TO COM-EXTERNALID.                            00421000
004220     PERFORM PARAMETER-SEARCH.                                    00422000
004230     MOVE SR-PSPARM TO COM-KEY-PRODCODE.                          00423000
004240     PERFORM PARAMETER-SEARCH.                                    00424000
004250     MOVE SR-PSPARM TO COM-KEY-ACCOUNT.                           00425000
004260     PERFORM PARAMETER-SEARCH.                                    00426000
004270     MOVE SR-PSPARM TO COM-KEY-MODEL.                             00427000
004280     PERFORM PARAMETER-SEARCH.                                    00428000
004290     MOVE SR-PSPARM TO COM-KEY-IDNBRX.                            00429000
004300 PKP-RETURN-EDITS.                                                00430000
004310     IF COM-KEY-PRODCODE IS EQUAL TO SPACE                        00431000
004320         MOVE LOW-VALUE TO COM-KEY-PRODCODE.                      00432000
004330     IF COM-KEY-ACCOUNT IS EQUAL TO SPACE                         00433000
004340         MOVE LOW-VALUE TO COM-KEY-ACCOUNT.                       00434000
004350     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00435000
004360         MOVE LOW-VALUES TO COM-KEY-MODEL.                        00436000
004370     IF COM-KEY-IDNBRX IS EQUAL TO SPACES                         00437000
004380         MOVE LOW-VALUES TO COM-KEY-IDNBRX.                       00438000
004390     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00439000
004400         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00440000
004410         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00441000
004420         AND COM-KEY-IDNBRX IS GREATER THAN LOW-VALUE             00442000
004430         GO TO PKP-RETURN-CONT.                                   00443000
004440     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00444000
004450         MOVE '000002' TO WS-MSGNBR                               00445000
004460         GO TO PKP-RETURN-CONT.                                   00446000
004470     PERFORM EDIT-ACCOUNT-KEY.                                    00447000
004480 PKP-RETURN-CONT.                                                 00448000
004490     IF INITIAL-PANEL                                             00449000
004500         AND COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE               00450000
004510         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00451000
004520         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00452000
004530         AND COM-KEY-IDNBRX IS EQUAL TO LOW-VALUE                 00453000
004540         MOVE '000001' TO WS-MSGNBR                               00454000
004550         GO TO PKP-SEND-PANEL.                                    00455000
004560     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00456000
004570     MOVE COM-KEY-MODEL TO COM-MODEL.                             00457000
004580     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00458000
004590     IF FROM-BREAKAWAY                                            00459000
004600         OR FROM-HELP                                             00460000
004610         GO TO PKP-RELOAD-PANEL.                                  00461000
004620     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00462000
004630         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00463000
004640         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00464000
004650         AND COM-KEY-IDNBRX IS EQUAL TO LOW-VALUE                 00465000
004660         GO TO PKP-EDITS-READY.                                   00466000
004670     MOVE COM-KEY-IDNBRX TO SR-JUSTIFYIN.                         00467000
004680     MOVE +0018 TO SR-JLGTH.                                      00468000
004690     PERFORM RIGHT-JUSTIFY.                                       00469000
004700     IF SR-JUSTIFYOUT IS EQUAL TO SPACE                           00470000
004710         MOVE ZEROS TO COM-KEY-IDNBRX                             00471000
004720     ELSE                                                         00472000
004730         MOVE SR-JUSTIFYOUT TO COM-KEY-IDNBRX.                    00473000
004740     IF COM-KEY-IDNBRX IS NOT NUMERIC                             00474000
004750         MOVE ZEROES TO COM-KEY-IDNBRX.                           00475000
004760     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00476000
004770         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00477000
004780     ELSE                                                         00478000
004790         MOVE ZERO TO COM-ACCOUNT.                                00479000
004800     IF WS-MSGNBR IS NOT EQUAL TO ZERO                            00480000
004810         GO TO PKP-RELOAD-PANEL.                                  00481000
004820     IF COM-KEY-PRODCODE IS GREATER THAN SPACES                   00482000
004830         AND COM-KEY-ACCOUNT IS GREATER THAN SPACES               00483000
004840         AND COM-KEY-IDNBRX IS GREATER THAN ZEROS                 00484000
004850         MOVE '000002' TO WS-MSGNBR                               00485000
004860         GO TO PKP-RELOAD-PANEL.                                  00486000
004870 PKP-EDITS-READY.                                                 00487000
004880     MOVE SPACE TO COM-PANEL-ACTION.                              00488000
004890     MOVE '1' TO COM-RETURN.                                      00489000
004900     MOVE 'K' TO COM-FROM-PANEL.                                  00490000
004910     GO TO PANEL-ROUTER.                                          00491000
004920 PKP-RELOAD-PANEL.                                                00492000
004930     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00493000
004940         MOVE LOW-VALUES TO RPV355K-PRODCD                        00494000
004950     ELSE                                                         00495000
004960         MOVE COM-KEY-PRODCODE TO RPV355K-PRODCD.                 00496000
004970     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00497000
004980         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROS                     00498000
004990         MOVE LOW-VALUES TO RPV355K-ACCOUNT                       00499000
005000     ELSE                                                         00500000
005010         MOVE COM-KEY-ACCOUNT TO RPV355K-ACCOUNT.                 00501000
005020     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00502000
005030         MOVE LOW-VALUES TO RPV355K-MODEL                         00503000
005040     ELSE                                                         00504000
005050         MOVE COM-KEY-MODEL TO RPV355K-MODEL.                     00505000
005060     MOVE COM-KEY-IDNBRX TO RPV355K-IDNBR.                        00506000
005070     IF COM-KEY-IDNBRX IS NOT GREATER THAN ZEROS                  00507000
005080         MOVE LOW-VALUES TO RPV355K-IDNBR.                        00508000
005090 PKP-SEND-PANEL.                                                  00509000
005100     MOVE PDB-RPV355K-NAME TO PAN-NAME.                           00510000
005110     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00511000
005120     IF FROM-HELP                                                 00512000
005130         OR FROM-BREAKAWAY                                        00513000
005140         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD.                      00514000
005150     IF WS-CURSOR-FIELD IS EQUAL TO SPACE                         00515000
005160         MOVE PDB-RPV355K-PRODCD TO PAN-SET-FLD                   00516000
005170     ELSE                                                         00517000
005180         MOVE WS-CURSOR-FIELD TO PAN-SET-FLD.                     00518000
005190     PERFORM CALL-BISPAN-RPV355K.                                 00519000
005200     MOVE COM-OPERID TO RPV355K-OPERID.                           00520000
005210     MOVE COM-INST TO RPV355K-INST.                               00521000
005220     MOVE COM-EDIT-DATE TO RPV355K-SYSDATE.                       00522000
005230     IF RPV355K-PRODCD IS EQUAL TO SPACES                         00523000
005240         MOVE LOW-VALUES TO RPV355K-PRODCD.                       00524000
005250     MOVE RPV355K-ACCOUNT TO SR-JUSTIFYIN.                        00525000
005260     MOVE +18 TO SR-JLGTH.                                        00526000
005270     PERFORM LEFT-JUSTIFY.                                        00527000
005280     MOVE SR-JUSTIFYOUT TO RPV355K-ACCOUNT.                       00528000
005290     IF RPV355K-ACCOUNT IS EQUAL TO SPACES                        00529000
005300         MOVE LOW-VALUES TO RPV355K-ACCOUNT.                      00530000
005310     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00531000
005320         MOVE WS-HELPMSG TO WS-MSGNBR.                            00532000
005330     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00533000
005340         MOVE '000027' TO WS-MSGNBR                               00534000
005350     ELSE                                                         00535000
005360         PERFORM BUILD-NEXTKEY                                    00536000
005370         PERFORM COMPRESS-NEXTKEY                                 00537000
005380         MOVE WS-NEXTKEY TO RPV355K-COMMAND.                      00538000
005390     IF FROM-BREAKAWAY                                            00539000
005400         OR FROM-HELP                                             00540000
005410         MOVE SPACE TO COM-FROM-PANEL                             00541000
005420         MOVE COM-KEY-COMMAND TO RPV355K-COMMAND                  00542000
005430         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00543000
005440     ELSE                                                         00544000
005450         MOVE WS-NEXTKEY TO COM-KEY-COMMAND                       00545000
005460         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00546000
005470     MOVE 'E' TO COM-RETURN.                                      00547000
005480     PERFORM GET-MESSAGE.                                         00548000
005490     MOVE WS-MESSAGE TO RPV355K-MSGLINE.                          00549000
005500     PERFORM PANEL-PFKEY-SET.                                     00550000
005510     PERFORM BUILD-PFKEY-LINE.                                    00551000
005520     MOVE WS-PFLINE1 TO RPV355K-PFLINE1.                          00552000
005530     MOVE WS-PFLINE2 TO RPV355K-PFLINE2.                          00553000
005540     PERFORM PANEL-PUT-RPV355K.                                   00554000
005550     PERFORM PANEL-SEND.                                          00555000
005560     MOVE 'E' TO COM-PANEL-ACTION.                                00556000
005570     MOVE COM-INTID TO WS-TRANSID.                                00557000
005580     GO TO CICS-RETURN-TRANSID.                                   00558000
005590 PKP-EXIT.                                                        00559000
005600     EXIT.                                                        00560000
005610******************************************************************00561000
005620 PROCESS-INFO-PANEL SECTION.                                      00562000
005630 PIP-START.                                                       00563000
005640     IF FROM-HELP                                                 00564000
005650         OR FROM-BREAKAWAY                                        00565000
005660         GO TO PIP-SEND-PANEL.                                    00566000
005670     IF INITIAL-PANEL                                             00567000
005680         MOVE COM-INST TO RPXXX06-KEY-INST                        00568000
005690         MOVE COM-PRODCODE TO RPXXX06-KEY-PRODCODE                00569000
005700         MOVE COM-KEY-ACCOUNT TO RPXXX06-KEY-ACCOUNT              00570000
005710         MOVE COM-KEY-MODEL TO RPXXX06-KEY-MODEL                  00571000
005720         MOVE +0 TO RPXXX06-SUB                                   00572000
005730         MOVE SPACES TO COM-DCHG                                  00573000
005740         MOVE +1 TO RPXXX06-PAGES-TO-READ                         00574000
005750         MOVE +1 TO COM-RPXXX06-CURPAGE                           00575000
005760         MOVE COM-RPXXX06-CURPAGE TO RPXXX06-CURPAGE              00576000
005770         MOVE SPACES TO COM-FIRST-KEY                             00577000
005780         MOVE 'VKL' TO RPXXX06-APIFUNC                            00578000
005790         GO TO PIP-RPXXX06-LOOP.                                  00579000
005800 PIP-PFKEYS.                                                      00580000
005810     MOVE ALL ZEROS TO WS-MSGNBR.                                 00581000
005820     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00582000
005830         MOVE PDB-RPV355-COMMAND TO WS-CURSOR-FIELD               00583000
005840         GO TO PIP-SEND-PANEL.                                    00584000
005850     IF EIBAID IS EQUAL TO DFHPF2                                 00585000
005860         AND COM-RPXXX06-CURPAGE IS GREATER THAN +1               00586000
005870         MOVE +1 TO RPXXX06-CURPAGE                               00587000
005880         MOVE +1 TO RPXXX06-PAGES-TO-READ                         00588000
005890         MOVE COM-FIRST-KEY TO RPXXX06-KEY-RECORD                 00589000
005900         GO TO PIP-CONTINUE.                                      00590000
005910     IF EIBAID IS EQUAL TO DFHPF7                                 00591000
005920         AND COM-RPXXX06-CURPAGE IS GREATER THAN +1               00592000
005930         MOVE COM-RPXXX06-CURPAGE TO RPXXX06-CURPAGE              00593000
005940         SUBTRACT +1 FROM RPXXX06-CURPAGE                         00594000
005950         MOVE RPXXX06-CURPAGE TO RPXXX06-PAGES-TO-READ            00595000
005960         MOVE COM-FIRST-KEY TO RPXXX06-KEY-RECORD                 00596000
005970         GO TO PIP-CONTINUE.                                      00597000
005980     IF EIBAID IS EQUAL TO DFHPF8                                 00598000
005990         AND COM-KEY-OCCUR IS LESS THAN +11                       00599000
006000         MOVE '000046' TO WS-MSGNBR                               00600000
006010         GO TO PIP-SEND-PANEL.                                    00601000
006020     IF EIBAID IS EQUAL TO DFHPF8                                 00602000
006030         OR EIBAID IS EQUAL TO DFHENTER                           00603000
006040         MOVE COM-RPXXX06-CURPAGE TO RPXXX06-CURPAGE              00604000
006050         ADD +1 TO RPXXX06-CURPAGE                                00605000
006060         MOVE +1 TO RPXXX06-PAGES-TO-READ                         00606000
006070         MOVE COM-LAST-KEY TO RPXXX06-KEY-RECORD                  00607000
006080         GO TO PIP-CONTINUE.                                      00608000
006090     IF EIBAID IS EQUAL TO DFHPF3                                 00609000
006100         OR EIBAID IS EQUAL TO DFHPF4                             00610000
006110         GO TO PIP-CONTINUE.                                      00611000
006120 PIP-CONTINUE.                                                    00612000
006130     MOVE +0 TO WS-ERROR-COUNT.                                   00613000
006140     MOVE COM-DCHG TO SRW166-FIELD.                               00614000
006150     MOVE 'E' TO SRW166-IN.                                       00615000
006160     MOVE 'Y' TO SRW166-OUT.                                      00616000
006170* MOVE THE LENGTH OF THE COM-DCHG FIELD:                          00617000
006180     MOVE +10 TO SRW166-LGTH.                                     00618000
006190     PERFORM EXAMINE-FIELD.                                       00619000
006200     MOVE SRW166-FIELD TO COM-DCHG.                               00620000
006210     MOVE COM-DCHG TO RPXXX06-DCHG.                               00621000
006220     PERFORM MOVE-PANEL-TO-RECORD.                                00622000
006230     MOVE +0 TO RPXXX06-SUB.                                      00623000
006240     IF COM-DCHG IS EQUAL TO SPACES                               00624000
006250         AND (EIBAID IS EQUAL TO DFHPF3                           00625000
006260         OR EIBAID IS EQUAL TO DFHPF4)                            00626000
006270         GO TO CLOSE-TRANSACTION.                                 00627000
006280     IF RPXXX06-PAGES-TO-READ IS NOT NUMERIC                      00628000
006290         MOVE +0001 TO RPXXX06-PAGES-TO-READ.                     00629000
006300     IF INITIAL-PANEL                                             00630000
006310         MOVE 'VKL' TO RPXXX06-APIFUNC.                           00631000
006320     IF EDIT-PANEL                                                00632000
006330         MOVE 'UPD' TO RPXXX06-APIFUNC.                           00633000
006340 PIP-RPXXX06-LOOP.                                                00634000
006350     ADD +1 TO RPXXX06-SUB.                                       00635000
006360     IF RPXXX06-SUB IS GREATER THAN RPXXX06-PAGES-TO-READ         00636000
006370         GO TO PIP-RPXXX06-RETURN-CHECK.                          00637000
006380     PERFORM RPXXX06-LINK-MESSAGE.                                00638000
006390     IF RPXXX06-MSGNBR IS NOT EQUAL TO ZEROS                      00639000
006400         AND RPXXX06-SUB IS EQUAL TO +0001                        00640000
006410         MOVE COM-RPXXX06-CURPAGE TO RPXXX06-CURPAGE              00641000
006420         GO TO PIP-RPXXX06-RETURN-CHECK.                          00642000
006430     IF RPXXX06-SUB IS EQUAL TO +0001                             00643000
006440         MOVE RPXXX06-KEY-IDNUMBER TO COM-KEY-IDNBR               00644000
006450         MOVE SPACES TO RPXXX06-DCHG.                             00645000
006460     GO TO PIP-RPXXX06-LOOP.                                      00646000
006470 PIP-RPXXX06-RETURN-CHECK.                                        00647000
006480     IF RPXXX06-RETURN IS EQUAL TO 'E'                            00648000
006490         MOVE 'E' TO COM-RETURN                                   00649000
006500         MOVE 'E' TO COM-PANEL-ACTION                             00650000
006510         MOVE 'I' TO COM-FROM-PANEL                               00651000
006520         GO TO PANEL-ROUTER.                                      00652000
006530     IF RPXXX06-SELECT-RTN IS NOT EQUAL TO '1'                    00653000
006540         AND RPXXX06-SELECT-RTN IS NOT EQUAL TO '2'               00654000
006550         AND RPXXX06-SELECT-RTN IS NOT EQUAL TO '3'               00655000
006560         MOVE WS-AB6345 TO COM-ABORT                              00656000
006570         MOVE WS-TR0002 TO COM-ABTRACE                            00657000
006580         GO TO ABORT-EXIT.                                        00658000
006590     IF RPXXX06-SELECT-RTN IS EQUAL TO '1'                        00659000
006600         AND EDIT-PANEL                                           00660000
006610         MOVE 'X' TO COM-RETURN                                   00661000
006620         GO TO PANEL-ROUTER.                                      00662000
006630     IF RPXXX06-SELECT-RTN IS EQUAL TO '1'                        00663000
006640         MOVE '000003' TO WS-MSGNBR                               00664000
006650         MOVE 'E' TO COM-RETURN                                   00665000
006660         MOVE 'E' TO COM-PANEL-ACTION                             00666000
006670         MOVE 'I' TO COM-FROM-PANEL                               00667000
006680         GO TO PANEL-ROUTER.                                      00668000
006690     IF RPXXX06-APIFUNC IS EQUAL TO 'EDT'                         00669000
006700         GO TO PIP-BUILD-MAINT-PANEL.                             00670000
006710 PIP-PAGING-CONTROLS.                                             00671000
006720     IF EIBAID IS EQUAL TO DFHPF3                                 00672000
006730         OR EIBAID IS EQUAL TO DFHPF4                             00673000
006740         GO TO CLOSE-TRANSACTION.                                 00674000
006750     IF RPXXX06-SELECT-RTN IS LESS THAN '3'                       00675000
006760         AND COM-KEY-OCCUR IS LESS THAN +11                       00676000
006770         AND EIBAID IS NOT EQUAL TO DFHPF7                        00677000
006780         AND EDIT-PANEL                                           00678000
006790         MOVE 'X' TO COM-RETURN                                   00679000
006800         GO TO PANEL-ROUTER.                                      00680000
006810     IF COM-FIRST-KEY IS EQUAL TO SPACES                          00681000
006820         MOVE RPXXX06-GRP-KEY (1) TO COM-FIRST-KEY.               00682000
006830     MOVE RPXXX06-GRP-KEY (RPXXX06-OCCUR) TO COM-LAST-KEY.        00683000
006840     MOVE RPXXX06-CURPAGE TO COM-RPXXX06-CURPAGE.                 00684000
006850     MOVE RPXXX06-OCCUR TO COM-KEY-OCCUR.                         00685000
006860     MOVE RPXXX06-RCIF-KEY TO COM-RCIF-KEY.                       00686000
006870     MOVE RPXXX06-CUST-NAME TO COM-CUST-NAME.                     00687000
006880     MOVE RPXXX06-REL-STAT TO COM-REL-STAT.                       00688000
006890     MOVE RPXXX06-IDNUMBER TO COM-IDNUMBER.                       00689000
006900     MOVE RPXXX06-KEY-MODEL TO COM-MODEL.                         00690000
006910     MOVE RPXXX06-MODEL-DESC TO COM-MODEL-DESC.                   00691000
006920     IF COM-PRODCODE IS EQUAL TO LOW-VALUES                       00692000
006930         MOVE RPXXX06-KEY-PRODCODE TO COM-PRODCODE                00693000
006940         MOVE RPXXX06-KEY-PRODCODE TO COM-KEY-PRODCODE            00694000
006950         MOVE RPXXX06-KEY-ACCOUNT TO COM-KEY-ACCOUNT              00695000
006960         MOVE RPXXX06-KEY-MODEL TO COM-KEY-MODEL.                 00696000
006970     IF RPXXX06-KEY-MODEL IS NOT EQUAL TO COM-KEY-MODEL           00697000
006980         MOVE RPXXX06-KEY-MODEL TO COM-KEY-MODEL.                 00698000
006990 PIP-BUILD-MAINT-PANEL.                                           00699000
007000     MOVE RPXXX06-DCHG TO COM-DCHG.                               00700000
007010     PERFORM SET-ATTRIBUTES-AND-MESSAGES.                         00701000
007020     PERFORM BUILD-MAINT-PANEL.                                   00702000
007030     MOVE +0 TO WS-SUB2.                                          00703000
007040 PIP-LOOP.                                                        00704000
007050     ADD +1 TO WS-SUB2.                                           00705000
007060     IF WS-SUB2 IS GREATER THAN COM-KEY-OCCUR                     00706000
007070         GO TO PIP-SEND-PANEL.                                    00707000
007080     MOVE RPXXX06-GRP-KEY (WS-SUB2) TO                            00708000
007090         COM-KEY-DATA (WS-SUB2).                                  00709000
007100     GO TO PIP-LOOP.                                              00710000
007110 PIP-SEND-PANEL.                                                  00711000
007120     MOVE PDB-RPV355-NAME TO PAN-NAME.                            00712000
007130     MOVE COM-INST TO RPV355-INST.                                00713000
007140     MOVE COM-OPERID TO RPV355-OPERID.                            00714000
007150     MOVE COM-PRODCODE TO RPV355-PRODCD.                          00715000
007160     MOVE COM-KEY-ACCOUNT TO RPV355-ACCOUNT.                      00716000
007170     MOVE COM-KEY-MODEL TO RPV355-MODEL.                          00717000
007180     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00718000
007190         MOVE ALL 'P' TO COM-DCHG                                 00719000
007200         MOVE PDB-RPV355-COMMAND TO WS-CURSOR-FIELD.              00720000
007210     PERFORM SET-ATTRIBUTES-AND-MESSAGES.                         00721000
007220     IF (FROM-HELP                                                00722000
007230         OR FROM-BREAKAWAY)                                       00723000
007240         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00724000
007250         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00725000
007260         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00726000
007270     ELSE                                                         00727000
007280         IF WS-CURSOR-FIELD IS EQUAL TO SPACE                     00728000
007290             MOVE PDB-RPV355-DELETE TO PAN-SET-FLD                00729000
007300             MOVE +1 TO PAN-SET-OCC                               00730000
007310         ELSE                                                     00731000
007320             MOVE WS-CURSOR-FIELD TO PAN-SET-FLD                  00732000
007330             MOVE WS-CURSOR-OCC TO PAN-SET-OCC.                   00733000
007340     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00734000
007350     PERFORM CALL-BISPAN-RPV355.                                  00735000
007360     MOVE COM-INST TO RPV355-INST.                                00736000
007370     MOVE COM-OPERID TO RPV355-OPERID.                            00737000
007380     MOVE COM-EDIT-DATE TO RPV355-SYSDATE.                        00738000
007390     IF WS-MSGNBR NOT NUMERIC                                     00739000
007400         MOVE ZERO TO WS-MSGNBR.                                  00740000
007410     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00741000
007420         MOVE WS-HELPMSG TO WS-MSGNBR.                            00742000
007430     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00743000
007440         MOVE '000027' TO WS-MSGNBR                               00744000
007450     ELSE                                                         00745000
007460         PERFORM BUILD-NEXTKEY                                    00746000
007470         PERFORM COMPRESS-NEXTKEY                                 00747000
007480         MOVE WS-NEXTKEY TO RPV355-COMMAND.                       00748000
007490     IF FROM-HELP                                                 00749000
007500         OR FROM-BREAKAWAY                                        00750000
007510         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00751000
007520         MOVE COM-KEY-COMMAND TO RPV355-COMMAND                   00752000
007530         MOVE SPACE TO COM-FROM-PANEL                             00753000
007540     ELSE                                                         00754000
007550         MOVE RPV355-COMMAND TO COM-KEY-COMMAND                   00755000
007560         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00756000
007570     PERFORM GET-MESSAGE.                                         00757000
007580     MOVE WS-MESSAGE TO RPV355-MSGLINE.                           00758000
007590     PERFORM PANEL-PFKEY-SET.                                     00759000
007600     MOVE SPACE TO RPV355-MORE.                                   00760000
007610     MOVE 'E' TO COM-END.                                         00761000
007620     IF COM-KEY-OCCUR IS GREATER THAN +10                         00762000
007630         MOVE WS-MORE TO RPV355-MORE                              00763000
007640         MOVE '+' TO RPV355-PLUS                                  00764000
007650         MOVE 'F' TO COM-END                                      00765000
007660     ELSE                                                         00766000
007670         MOVE 'N' TO WS-PF8-FLG                                   00767000
007680         MOVE SPACE TO RPV355-PLUS.                               00768000
007690     IF COM-RPXXX06-CURPAGE IS GREATER THAN +1                    00769000
007700         MOVE WS-MORE TO RPV355-MORE                              00770000
007710         MOVE '-' TO RPV355-MINUS                                 00771000
007720         MOVE 'P' TO COM-END                                      00772000
007730     ELSE                                                         00773000
007740         MOVE 'N' TO WS-PF7-FLG                                   00774000
007750         MOVE SPACE TO RPV355-MINUS.                              00775000
007760     IF COM-KEY-OCCUR IS GREATER THAN +10                         00776000
007770         AND COM-RPXXX06-CURPAGE IS GREATER THAN +1               00777000
007780         MOVE 'B' TO COM-END.                                     00778000
007790     IF COM-WKUCOUNT IS GREATER THAN ZERO                         00779000
007800         AND COM-WKUPOSITION IS GREATER THAN +1                   00780000
007810         AND COM-END IS NOT EQUAL TO 'P'                          00781000
007820         MOVE 'A' TO WS-PF7-FLG.                                  00782000
007830     IF COM-WKUCOUNT IS GREATER THAN ZERO                         00783000
007840         AND COM-WKUPOSITION IS LESS THAN COM-WKUCOUNT            00784000
007850         AND COM-END IS NOT EQUAL TO 'F'                          00785000
007860         MOVE 'A' TO WS-PF8-FLG.                                  00786000
007870     PERFORM BUILD-PFKEY-LINE.                                    00787000
007880     MOVE WS-PFLINE1 TO RPV355-PFLINE1.                           00788000
007890     MOVE WS-PFLINE2 TO RPV355-PFLINE2.                           00789000
007900     PERFORM PANEL-PUT-RPV355.                                    00790000
007910     PERFORM PANEL-SEND.                                          00791000
007920     MOVE '1' TO COM-RETURN.                                      00792000
007930     MOVE 'E' TO COM-PANEL-ACTION.                                00793000
007940     MOVE 'I' TO COM-FROM-PANEL.                                  00794000
007950     MOVE COM-INTID TO WS-TRANSID.                                00795000
007960     GO TO CICS-RETURN-TRANSID.                                   00796000
007970 PIP-EXIT.                                                        00797000
007980     EXIT.                                                        00798000
007990******************************************************************00799000
008000 BUILD-MAINT-PANEL SECTION.                                       00800000
008010 BMP-START.                                                       00801000
008020     MOVE COM-CUST-NAME TO RPV355-CUSTNA.                         00802000
008030     MOVE RPXXX06-KEY-MODEL TO RPV355-MODEL.                      00803000
008040     MOVE RPXXX06-MODEL-DESC TO RPV355-MODDESC.                   00804000
008050     MOVE RPXXX06-IDNUMBER TO RPV355-IDNBR.                       00805000
008060     IF RPXXX06-REL-STAT IS EQUAL TO 'A'                          00806000
008070         MOVE 'ACTIVE' TO RPV355-STATUS.                          00807000
008080     IF RPXXX06-REL-STAT IS EQUAL TO 'E'                          00808000
008090         MOVE 'EXPIRED' TO RPV355-STATUS.                         00809000
008100     IF RPXXX06-REL-STAT IS EQUAL TO 'I'                          00810000
008110         MOVE 'INACTIVE' TO RPV355-STATUS.                        00811000
008120     MOVE +0 TO WS-SUB1.                                          00812000
008130 BMP-LOOP.                                                        00813000
008140     ADD +0001 TO WS-SUB1.                                        00814000
008150     IF WS-SUB1 IS GREATER THAN +0010                             00815000
008160         GO TO BMP-EXIT.                                          00816000
008170     IF WS-SUB1 IS GREATER THAN RPXXX06-OCCUR                     00817000
008180         PERFORM PANEL-SPACE                                      00818000
008190         GO TO BMP-EXIT.                                          00819000
008200     MOVE RPXXX06-DEL (WS-SUB1) TO RPV355-DELETE.                 00820000
008210     IF RPV355-DELETE IS EQUAL TO SPACES                          00821000
008220         OR RPV355-DELETE IS EQUAL TO LOW-VALUES                  00822000
008230         MOVE LOW-VALUES TO RPV355-DELETE.                        00823000
008240     MOVE RPXXX06-INST2 (WS-SUB1) TO RPV355-ADDINST.              00824000
008250     MOVE RPXXX06-PRODCODE2 (WS-SUB1) TO RPV355-ADDPROD.          00825000
008260     MOVE RPXXX06-ACCOUNT2 (WS-SUB1) TO RPV355-ADDACCT.           00826000
008270     MOVE PDB-RPV355-NAME TO PAN-NAME.                            00827000
008280     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00828000
008290     PERFORM PANEL-PUT-OCCUR-RPV355.                              00829000
008300     GO TO BMP-LOOP.                                              00830000
008310 BMP-EXIT.                                                        00831000
008320     EXIT.                                                        00832000
008330******************************************************************00833000
008340 PANEL-SPACE SECTION.                                             00834000
008350 PS-START.                                                        00835000
008360     MOVE SPACES TO RPV355-DELETE.                                00836000
008370     MOVE SPACES TO RPV355-ADDINST.                               00837000
008380     MOVE SPACES TO RPV355-ADDPROD.                               00838000
008390     MOVE SPACES TO RPV355-ADDACCT.                               00839000
008400     PERFORM PANEL-PUT-OCCUR-RPV355.                              00840000
008410     IF PAN-STAT IS EQUAL TO STAT-END                             00841000
008420         GO TO PS-EXIT.                                           00842000
008430     GO TO PS-START.                                              00843000
008440 PS-EXIT.                                                         00844000
008450     EXIT.                                                        00845000
008460******************************************************************00846000
008470 SET-DCHG-INDICATORS SECTION.                                     00847000
008480 SDI-START.                                                       00848000
008490     MOVE +0 TO WS-SUB1.                                          00849000
008500 SDI-LOOP.                                                        00850000
008510     ADD +0001 TO WS-SUB1.                                        00851000
008520     IF WS-SUB1 IS GREATER THAN +10                               00852000
008530         GO TO SDI-EXIT.                                          00853000
008540     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00854000
008550     PERFORM PANEL-GET-OCCUR-RPV355.                              00855000
008560     IF COM-DEL-DCHG (WS-SUB1) IS EQUAL TO SPACE                  00856000
008570         MOVE PDB-RPV355-DELETE-DCHG TO COM-DEL-DCHG (WS-SUB1).   00857000
008580     GO TO SDI-LOOP.                                              00858000
008590 SDI-EXIT.                                                        00859000
008600     EXIT.                                                        00860000
008610******************************************************************00861000
008620 SET-ATTRIBUTES-AND-MESSAGES SECTION.                             00862000
008630 SAAM-START.                                                      00863000
008640     MOVE ZERO TO WS-SUB1.                                        00864000
008650 SAAM-LOOP.                                                       00865000
008660     ADD +1 TO WS-SUB1.                                           00866000
008670     IF WS-SUB1 IS GREATER THAN COM-KEY-OCCUR                     00867000
008680         GO TO SAAM-PROTECT.                                      00868000
008690     IF WS-SUB1 IS GREATER THAN +0010                             00869000
008700         GO TO SAAM-EXIT.                                         00870000
008710     MOVE WS-SUB1 TO PAN-SET-OCC.                                 00871000
008720     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00872000
008730     MOVE COM-DEL-DCHG (WS-SUB1) TO WS-DCHG-TEST.                 00873000
008740     MOVE PDB-RPV355-DELETE-VID TO PAN-SET-VID.                   00874000
008750     MOVE PDB-RPV355-DELETE-EL TO PAN-SET-EMP.                    00875000
008760     MOVE PDB-RPV355-DELETE TO PAN-SET-FLD.                       00876000
008770     PERFORM SET-ATTRIBUTE.                                       00877000
008780     GO TO SAAM-LOOP.                                             00878000
008790 SAAM-PROTECT.                                                    00879000
008800     MOVE VIS-DISPLAY TO PAN-SET-VID.                             00880000
008810     MOVE EMP-HIDDEN TO PAN-SET-EMP.                              00881000
008820     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00882000
008830 SAAM-PROTECT-LOOP.                                               00883000
008840     IF WS-SUB1 IS GREATER THAN +0010                             00884000
008850         GO TO SAAM-EXIT.                                         00885000
008860     MOVE WS-SUB1 TO PAN-SET-OCC.                                 00886000
008870     MOVE PDB-RPV355-DELETE TO PAN-SET-FLD.                       00887000
008880     PERFORM CALL-BISPAN-RPV355.                                  00888000
008890     ADD +1 TO WS-SUB1.                                           00889000
008900     GO TO SAAM-PROTECT-LOOP.                                     00890000
008910 SAAM-EXIT.                                                       00891000
008920     EXIT.                                                        00892000
008930******************************************************************00893000
008940 SET-ATTRIBUTE SECTION.                                           00894000
008950 SA-START.                                                        00895000
008960     IF WS-DCHG-EDITERR                                           00896000
008970         ADD +1 TO WS-ERROR-COUNT                                 00897000
008980         MOVE 'Y' TO WS-ERROR                                     00898000
008990         MOVE VIS-ERROR TO PAN-SET-VID                            00899000
009000         MOVE EMP-ERROR TO PAN-SET-EMP.                           00900000
009010     IF WS-DCHG-EDITERR                                           00901000
009020         AND WS-CURSOR-FIELD IS EQUAL TO SPACES                   00902000
009030         MOVE PAN-SET-FLD TO WS-CURSOR-FIELD                      00903000
009040         MOVE PAN-SET-OCC TO WS-CURSOR-OCC.                       00904000
009050     IF WS-DCHG-PROTECT                                           00905000
009060         MOVE VIS-DISPLAY TO PAN-SET-VID                          00906000
009070         MOVE EMP-NORMAL TO PAN-SET-EMP.                          00907000
009080     IF WS-DCHG-HIDDEN                                            00908000
009090         MOVE VIS-DISPLAY TO PAN-SET-VID                          00909000
009100         MOVE EMP-HIDDEN TO PAN-SET-EMP.                          00910000
009110     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00911000
009120     PERFORM CALL-BISPAN-RPV355.                                  00912000
009130 SA-EXIT.                                                         00913000
009140     EXIT.                                                        00914000
009150******************************************************************00915000
009160 MOVE-PANEL-TO-RECORD SECTION.                                    00916000
009170 MPTR-START.                                                      00917000
009180     MOVE COM-KEY-OCCUR TO RPXXX06-OCCUR.                         00918000
009190     MOVE COM-KEY-PRODCODE TO RPXXX06-KEY-PRODCODE.               00919000
009200     MOVE COM-KEY-ACCOUNT TO RPXXX06-KEY-ACCOUNT.                 00920000
009210     MOVE COM-KEY-MODEL TO RPXXX06-KEY-MODEL.                     00921000
009220     MOVE COM-KEY-IDNBR TO RPXXX06-KEY-IDNUMBER.                  00922000
009230     MOVE COM-RCIF-KEY TO RPXXX06-RCIF-KEY.                       00923000
009240     MOVE COM-CUST-NAME TO RPXXX06-CUST-NAME.                     00924000
009250     MOVE COM-REL-STAT TO RPXXX06-REL-STAT.                       00925000
009260     MOVE COM-IDNUMBER TO RPXXX06-IDNUMBER.                       00926000
009270     MOVE COM-MODEL-DESC TO RPXXX06-MODEL-DESC.                   00927000
009280     MOVE SPACES TO RPXXX06-DATA-GRP.                             00928000
009290     MOVE +0 TO WS-SUB1.                                          00929000
009300 MPTR-LOOP.                                                       00930000
009310     ADD +0001 TO WS-SUB1.                                        00931000
009320     IF WS-SUB1 IS GREATER THAN COM-KEY-OCCUR                     00932000
009330         OR WS-SUB1 IS GREATER THAN +0010                         00933000
009340         GO TO MPTR-EXIT.                                         00934000
009350     MOVE COM-KEY-DATA (WS-SUB1) TO RPXXX06-GRP-KEY (WS-SUB1).    00935000
009360     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00936000
009370     PERFORM PANEL-GET-OCCUR-RPV355.                              00937000
009380     IF RPV355-DELETE IS EQUAL TO LOW-VALUES                      00938000
009390         MOVE SPACES TO RPV355-DELETE.                            00939000
009400     MOVE RPV355-DELETE TO RPXXX06-DEL (WS-SUB1).                 00940000
009410     GO TO MPTR-LOOP.                                             00941000
009420 MPTR-EXIT.                                                       00942000
009430     EXIT.                                                        00943000
009440******************************************************************00944000
009450 MORE-DATA-PANELS SECTION.                                        00945000
009460 MDP-START.                                                       00946000
009470     GO TO PANEL-ROUTER.                                          00947000
009480 MDP-EXIT.                                                        00948000
009490     EXIT.                                                        00949000
009500******************************************************************00950000
009510 CLOSE-TRANSACTION SECTION.                                       00951000
000000 COPY SRP0722.                                                    00952000
009530******************************************************************00953000
009540 PANEL-INIT SECTION.                                              00954000
000000 COPY SRP073.                                                     00955000
009560******************************************************************00956000
009570 BUILD-NEXTKEY SECTION.                                           00957000
009580 BXN-START.                                                       00958000
009590     MOVE SPACES TO WS-NEXTKEY.                                   00959000
009600     MOVE ',' TO WS-DELIM1.                                       00960000
009610     MOVE ',' TO WS-DELIM2.                                       00961000
009620     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        00962000
009630     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            00963000
009640         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         00964000
009650     ELSE                                                         00965000
009660         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       00966000
009670     MOVE COM-KEY-MODEL to WS-MODEL.                              00967000
009680     MOVE COM-EXTERNALID TO WS-EXTID.                             00968000
009690 BXN-EXIT.                                                        00969000
009700     EXIT.                                                        00970000
009710******************************************************************00971000
009720 ABORT-EXIT SECTION.                                              00972000
009730 AE-START.                                                        00973000
009740     MOVE EIBFN TO COM-ABEIBFN.                                   00974000
009750     MOVE EIBRCODE TO COM-ABEIBRCODE.                             00975000
009760     GO TO CICS-ABORT-EXIT.                                       00976000
009770 AE-EXIT.                                                         00977000
009780     EXIT.                                                        00978000
009790******************************************************************00979000
009800 RPXXX06-LINK-MESSAGE SECTION.                                    00980000
009810 CRLM-START.                                                      00981000
009820     MOVE 'Y' TO RPXXX06-GLOBAL-CLOSE.                            00982000
009830     MOVE WS-FILEOPTIONS TO RPXXX06-FILEOPTS.                     00983000
009840     MOVE COM-RETURN TO RPXXX06-RETURN.                           00984000
009850     MOVE COM-DATE TO RPXXX06-DATE.                               00985000
009860     MOVE COM-MODELID TO RPXXX06-MODELID.                         00986000
009870     MOVE COM-SECALT TO RPXXX06-SECALT.                           00987000
009880     MOVE COM-EXTERNALID TO RPXXX06-EXTERNALID.                   00988000
009890     MOVE COM-EIBTRMID TO RPXXX06-TERMID.                         00989000
009900     MOVE COM-WKUNAME TO RPXXX06-WORKID.                          00990000
009910     MOVE COM-TRANSTART TO RPXXX06-TRANSTART.                     00991000
009920     MOVE COM-UPDATE TO RPXXX06-UPDATE.                           00992000
009930     MOVE COM-APPLSEQ TO RPXXX06-APPLSEQ.                         00993000
009940     MOVE WS-RPSAPPLNBR TO RPXXX06-APPL.                          00994000
009950     IF RPXXX06-KEY-MODEL IS EQUAL TO LOW-VALUES                  00995000
009960         MOVE SPACES TO RPXXX06-KEY-MODEL.                        00996000
009970     MOVE ZEROS TO RPXXX06-KEY-IDNUMBER.                          00997000
009980     IF COM-KEY-IDNBR IS NUMERIC                                  00998000
009990         AND COM-KEY-IDNBR IS GREATER THAN ZEROS                  00999000
010000         MOVE COM-KEY-IDNBR TO RPXXX06-KEY-IDNUMBER.              01000000
010010     MOVE COM-OPERID TO RPXXX06-OPERID.                           01001000
010020     MOVE COM-LANG TO RPXXX06-COM-LANG.                           01002000
010030     MOVE COM-CURN-CODE TO RPXXX06-COM-CURNCD.                    01003000
010040     MOVE COM-INST-OPTS TO RPXXX06-INST-OPTS.                     01004000
010050     EXEC CICS LINK                                               01005000
010060         PROGRAM('RPLXXX06')                                      01006000
010070         COMMAREA(RPXXX06-MESSAGE)                                01007000
010080         LENGTH(LENGTH OF RPXXX06-MESSAGE)                        01008000
010090         RESP(WS-CICS-RESPONSE)                                   01009000
010100         END-EXEC.                                                01010000
010110     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     01011000
010120         MOVE 'RPLXXX06 LINK FAILED' TO COM-ABMSG                 01012000
010130         MOVE WS-TR0003 TO COM-ABTRACE                            01013000
010140         MOVE WS-AB0009 TO COM-ABORT                              01014000
010150         GO TO CICS-ABORT-EXIT.                                   01015000
010160     MOVE RPXXX06-FUNCTION TO WS-FUNCTION.                        01016000
010170     IF RPXXX06-ABORT IS NOT EQUAL TO ZERO                        01017000
010180         MOVE RPXXX06-ABORT TO COM-ABORT                          01018000
010190         MOVE RPXXX06-ABTRACE TO COM-ABTRACE                      01019000
010200         MOVE RPXXX06-ABEIBFN TO COM-ABEIBFN                      01020000
010210         MOVE RPXXX06-ABEIBRCODE TO COM-ABEIBRCODE                01021000
010220         MOVE RPXXX06-ABPROGID TO COM-ABPROGID                    01022000
010230         MOVE RPXXX06-SRBMDB TO COM-SRBMDB                        01023000
010240         MOVE RPXXX06-ABTYPE TO COM-ABTYPE                        01024000
010250         GO TO CICS-ABORT-EXIT.                                   01025000
010260     MOVE RPXXX06-ABORT TO COM-ABORT.                             01026000
010270     MOVE RPXXX06-MSGNBR TO WS-MSGNBR.                            01027000
010280     IF RPXXX06-OCCUR IS EQUAL TO +11                             01028000
010290         AND RPXXX06-SUB IS LESS THAN RPXXX06-PAGES-TO-READ       01029000
010300         MOVE RPXXX06-GRP-KEY (11) TO RPXXX06-KEY-RECORD.         01030000
010310 CRLM-EXIT.                                                       01031000
010320     EXIT.                                                        01032000
010330******************************************************************01033000
010340 CLOSE-PANEL SECTION.                                             01034000
010350 CP-START.                                                        01035000
010360     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       01036000
010370     IF COM-RETURN IS EQUAL TO 'E'                                01037000
010380         PERFORM CALL-BISPAN-RPV355K.                             01038000
010390     IF COM-RETURN IS EQUAL TO '1'                                01039000
010400         PERFORM CALL-BISPAN-RPV355.                              01040000
010410 CP-EXIT.                                                         01041000
010420     EXIT.                                                        01042000
010430******************************************************************01043000
010440 CALL-BISPAN-RPV355K SECTION.                                     01044000
010450 CBD1-START.                                                      01045000
010460     CALL 'BISPAN' USING                                          01046000
010470         BICRPSB,                                                 01047000
010480         BICRSRB,                                                 01048000
010490         BICRPAN,                                                 01049000
010500         RPV355K-PANL-DATA-BLOCK,                                 01050000
010510         RPV355K-PANL-DATA-AREA.                                  01051000
010520 CBD1-EXIT.                                                       01052000
010530     EXIT.                                                        01053000
010540******************************************************************01054000
010550 CALL-BISPAN-RPV355 SECTION.                                      01055000
010560 CBD2-START.                                                      01056000
010570     CALL 'BISPAN' USING                                          01057000
010580         BICRPSB,                                                 01058000
010590         BICRSRB,                                                 01059000
010600         BICRPAN,                                                 01060000
010610         RPV355-PANL-DATA-BLOCK,                                  01061000
010620         RPV355-PANL-DATA-AREA.                                   01062000
010630 CBD2-EXIT.                                                       01063000
010640     EXIT.                                                        01064000
010650******************************************************************01065000
010660 PANEL-GET-RPV355 SECTION.                                        01066000
010670 PANEL-GET-RPV355-START.                                          01067000
010680     MOVE 'N' TO RPV355-SW-SET-CURSOR.                            01068000
010690     MOVE PDB-RPV355-NAME TO PAN-NAME.                            01069000
010700     MOVE REQ-GET TO PAN-REQ-VERB.                                01070000
010710     CALL 'BISPAN' USING                                          01071000
010720         BICRPSB                                                  01072000
010730         BICRSRB                                                  01073000
010740         BICRPAN                                                  01074000
010750         RPV355-PANL-DATA-BLOCK,                                  01075000
010760         RPV355-PANL-DATA-AREA.                                   01076000
010770 PANEL-GET-RPV355-EXIT.                                           01077000
010780     EXIT.                                                        01078000
010790******************************************************************01079000
010800 PANEL-PUT-RPV355 SECTION.                                        01080000
010810 PANEL-PUT-RPV355-START.                                          01081000
010820     MOVE PDB-RPV355-NAME TO PAN-NAME.                            01082000
010830     MOVE REQ-PUT TO PAN-REQ-VERB.                                01083000
010840     CALL 'BISPAN' USING                                          01084000
010850         BICRPSB                                                  01085000
010860         BICRSRB                                                  01086000
010870         BICRPAN                                                  01087000
010880         RPV355-PANL-DATA-BLOCK,                                  01088000
010890         RPV355-PANL-DATA-AREA.                                   01089000
010900 PANEL-PUT-RPV355-EXIT.                                           01090000
010910     EXIT.                                                        01091000
010920******************************************************************01092000
010930 PANEL-GET-RPV355K SECTION.                                       01093000
010940 PANEL-GET-RPV355K-START.                                         01094000
010950     MOVE 'N' TO RPV355K-SW-SET-CURSOR.                           01095000
010960     MOVE PDB-RPV355K-NAME TO PAN-NAME.                           01096000
010970     MOVE REQ-GET TO PAN-REQ-VERB.                                01097000
010980     CALL 'BISPAN' USING                                          01098000
010990         BICRPSB                                                  01099000
011000         BICRSRB                                                  01100000
011010         BICRPAN                                                  01101000
011020         RPV355K-PANL-DATA-BLOCK,                                 01102000
011030         RPV355K-PANL-DATA-AREA.                                  01103000
011040 PANEL-GET-RPV355K-EXIT.                                          01104000
011050     EXIT.                                                        01105000
011060******************************************************************01106000
011070 PANEL-PUT-RPV355K SECTION.                                       01107000
011080 PANEL-PUT-RPV355K-START.                                         01108000
011090     MOVE PDB-RPV355K-NAME TO PAN-NAME.                           01109000
011100     MOVE REQ-PUT TO PAN-REQ-VERB.                                01110000
011110     CALL 'BISPAN' USING                                          01111000
011120         BICRPSB                                                  01112000
011130         BICRSRB                                                  01113000
011140         BICRPAN                                                  01114000
011150         RPV355K-PANL-DATA-BLOCK,                                 01115000
011160         RPV355K-PANL-DATA-AREA.                                  01116000
011170 PANEL-PUT-RPV355K-EXIT.                                          01117000
011180     EXIT.                                                        01118000
011190******************************************************************01119000
011200 PANEL-GET-OCCUR-RPV355 SECTION.                                  01120000
011210 PGORPV355-START.                                                 01121000
011220     MOVE PDB-RPV355-NAME TO PAN-NAME.                            01122000
011230     MOVE REQ-GET-OCCUR TO PAN-REQ-VERB.                          01123000
011240     CALL 'BISPAN' USING                                          01124000
011250         BICRPSB                                                  01125000
011260         BICRSRB                                                  01126000
011270         BICRPAN                                                  01127000
011280         RPV355-PANL-DATA-BLOCK,                                  01128000
011290         RPV355-PANL-DATA-AREA.                                   01129000
011300 PGORPV355-EXIT.                                                  01130000
011310     EXIT.                                                        01131000
011320******************************************************************01132000
011330 PANEL-PUT-OCCUR-RPV355 SECTION.                                  01133000
011340 PPORPV355-START.                                                 01134000
011350     MOVE PDB-RPV355-NAME TO PAN-NAME.                            01135000
011360     MOVE REQ-PUT-OCCUR TO PAN-REQ-VERB.                          01136000
011370     CALL 'BISPAN' USING                                          01137000
011380         BICRPSB                                                  01138000
011390         BICRSRB                                                  01139000
011400         BICRPAN                                                  01140000
011410         RPV355-PANL-DATA-BLOCK,                                  01141000
011420         RPV355-PANL-DATA-AREA.                                   01142000
011430 PPORPV355-EXIT.                                                  01143000
011440     EXIT.                                                        01144000
011450******************************************************************01145000
011460 MIC-MST-API SECTION.                                             01146000
000000 COPY MIPMSTA.                                                    01147000
011480******************************************************************01148000
011490 EDIT-ACCOUNT-KEY SECTION.                                        01149000
011500 EAK-START.                                                       01150000
011510     MOVE COM-INST TO RPW130-INST.                                01151000
011520     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 01152000
011530     MOVE COM-KEY-PRODCODE TO RPW130-PRODCODE.                    01153000
011540     MOVE COM-KEY-ACCOUNT TO RPW130-ACCOUNTINPUT.                 01154000
011550     MOVE 'V' TO RPW130-FUNCTION.                                 01155000
011560     PERFORM ACCOUNT-KEY-EDIT.                                    01156000
011570     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       01157000
011580     MOVE RPW130-ACCOUNTKEY TO COM-KEY-ACCOUNT.                   01158000
011590     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          01159000
011600     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      01160000
011610     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                01161000
011620 EAK-EXIT.                                                        01162000
011630     EXIT.                                                        01163000
011640******************************************************************01164000
011650 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 01165000
000000 COPY RPP033.                                                     01166000
011670******************************************************************01167000
011680 ACCOUNT-KEY-EDIT SECTION.                                        01168000
000000 COPY RPP130.                                                     01169000
011700******************************************************************01170000
011710 LEFT-JUSTIFY SECTION.                                            01171000
000000 COPY SRP025.                                                     01172000
011730******************************************************************01173000
011740 RIGHT-JUSTIFY SECTION.                                           01174000
000000 COPY SRP026.                                                     01175000
011760******************************************************************01176000
011770 PARAMETER-SEARCH SECTION.                                        01177000
000000 COPY SRP030.                                                     01178000
011790******************************************************************01179000
011800 COMPRESS-NEXTKEY SECTION.                                        01180000
000000 COPY SRP070.                                                     01181000
011820******************************************************************01182000
011830 GET-MESSAGE SECTION.                                             01183000
000000 COPY SRP071.                                                     01184000
011850******************************************************************01185000
011860 EXAMINE-FIELD SECTION.                                           01186000
000000 COPY SRP166.                                                     01187000
011880******************************************************************01188000
011890 SRP170-ROUTINE SECTION.                                          01189000
000000 COPY SRP170.                                                     01190000
011910******************************************************************01191000
011920 BUILD-PFKEY-LINE SECTION.                                        01192000
000000 COPY SRP710.                                                     01193000
011940******************************************************************01194000
011950 VALIDATE-PFKEYS SECTION.                                         01195000
000000 COPY SRP711.                                                     01196000
011970******************************************************************01197000
011980 SLP096-GET-2023-RECORD SECTION.                                  01198000
000000 COPY SLP096.                                                     01199000
012000******************************************************************01200000
012010 CICS-XCTL SECTION.                                               01201000
000000 COPY SLP704.                                                     01202000
012030******************************************************************01203000
012040 CICS-RETURN-TRANSID SECTION.                                     01204000
000000 COPY SLP710.                                                     01205000
012060******************************************************************01206000
012070 TSQ-DELETE SECTION.                                              01207000
012080 TSQD-START.                                                      01208000
012090 TSQD-EXIT.                                                       01209000
012100     EXIT.                                                        01210000
012110******************************************************************01211000
012120 CICS-TSQ-READ SECTION.                                           01212000
000000 COPY SLP744.                                                     01213000
012140******************************************************************01214000
012150 CICS-ABORT-EXIT SECTION.                                         01215000
000000 COPY SLP798.                                                     01216000
012170******************************************************************01217000
