000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPL310.                                  00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPL310 - RELATIONSHIP MAINTENANCE                           *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRCONS.                                                    00024000
000000 COPY BICRCONS.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRPAN.                                                     00028000
000000 COPY BICRPAN.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  RPV310K-PANL-DATA-BLOCK.                                     00032000
000000 COPY RPV310KW.                                                   00033000
000340 01  RPV310-PANL-DATA-BLOCK.                                      00034000
000000 COPY RPV310W.                                                    00035000
000360 01  WS-WORKAREAS.                                                00036000
000370     03  WS-RPSAPPLNBR           PIC 9(02)       VALUE 50.        00037000
000380     03  WS-NEXTKEY.                                              00038000
000390         05  WS-EXTID            PIC X(08).                       00039000
000400         05  WS-DELIM1           PIC X(01)       VALUE ','.       00040000
000410         05  WS-DATA.                                             00041000
000420             07  WS-PRODCODE     PIC X(06)       VALUE SPACES.    00042000
000430             07  WS-DELIM2       PIC X(01)       VALUE ','.       00043000
000440             07  WS-ACCTX.                                        00044000
000450                 09  WS-ACCT     PIC Z(18)       VALUE ZEROS.     00045000
000460             07  WS-DELIM3       PIC X(01)       VALUE ','.       00046000
000470             07  WS-MODEL        PIC X(10)       VALUE SPACES.    00047000
000480         05  FILLER              PIC X(33)       VALUE SPACES.    00048000
000490     03  WS-MORE                 PIC X(05)       VALUE 'More:'.   00049000
000500     03  WS-LNKPROG1             PIC X(08)       VALUE 'RPLXXX03'.00050000
000510     03  WS-LKLGTH               PIC S9(04)      COMP             00051000
000520                                                 VALUE +4088.     00052000
000530     03  WS-DCHG-TEST            PIC X(01)       VALUE SPACE.     00053000
000540         88  WS-DCHG-PROTECT                     VALUE 'P'.       00054000
000550         88  WS-DCHG-EDITERR                     VALUE 'E'.       00055000
000560         88  WS-DCHG-HIDDEN                      VALUE 'N'.       00056000
000570     03  WS-ERROR-COUNT          PIC S9(04)      COMP             00057000
000580                                                 VALUE ZERO.      00058000
000590     03  WS-PDATE                PIC 9(08).                       00059000
000600     03  WS-PDATE-R      REDEFINES WS-PDATE.                      00060000
000610         05  WS-PDATE-YYYY       PIC 9(04).                       00061000
000620         05  WS-PDATE-MM         PIC 9(02).                       00062000
000630         05  WS-PDATE-DD         PIC 9(02).                       00063000
P0063      03  WS-NOTPRESENT           PIC 9(06)       VALUE            00063100
P0063                                                  500016.          00063200
P0063      03  WS-NOCUSTOMER           PIC X(01)       VALUE            00063300
P0063                                                  'N'.             00063400
P0063      03  WS-NOFOUNDCUST          PIC X(30)       VALUE            00063500
P0063          'NO CUSTOMER FOUND IN RCIF     '.                        00063600
000640     03  WS-SUB1                 PIC S9(04)      COMP             00064000
000650                                                 VALUE +0000.     00065000
000660     03  WS-SUB2                 PIC S9(04)      COMP             00066000
000670                                                 VALUE +0000.     00067000
000680 01  WS-LINKMSG                  PIC X(4500).                     00068000
000690 01  RPXXX03-MESSAGE.                                             00069000
000000 COPY MISCNT00      REPLACING                                     00070000
000710             ==:MICNT:== BY ==RPXXX03==.                          00071000
000000 COPY RPSXXX03.                                                   00072000
000730 01  WS-TSQAREAS.                                                 00073000
000740     03  WS-TSQITEM              PIC S9(04)      COMP             00074000
000750                                                 VALUE +0001.     00075000
000760     03  WS-TSQLGTH              PIC S9(04)      COMP             00076000
000770                                                 VALUE +4096.     00077000
000780     03  WS-TSQKEY.                                               00078000
000790         05  WS-TSQID            PIC X(04).                       00079000
000800         05  WS-TSQTRMID         PIC X(04).                       00080000
000810 01  LS-TSQAREA.                                                  00081000
000820     03  LS-TSQKEY               PIC X(08).                       00082000
000830     03  LS-TSQDATA              PIC X(4088).                     00083000
000840 01  MIWPRI-AREAS.                                                00084000
000000 COPY MIWPRI.                                                     00085000
000860 01  MIWMSTA-AREAS.                                               00086000
000000 COPY MIWMSTA.                                                    00087000
000880 01  MIMST-RECORD.                                                00088000
000000 COPY MISMST.                                                     00089000
000900 01  MI2023-RECORD.                                               00090000
000000 COPY MIS2023A.                                                   00091000
000920 01  WS-ABORTCODES.                                               00092000
000930     03  WS-AB0009               PIC S9(04)      COMP             00093000
000940                                                 VALUE +0009.     00094000
000950     03  WS-AB0106               PIC S9(04)      COMP             00095000
000960                                                 VALUE +0106.     00096000
000970     03  WS-AB2033               PIC S9(04)      COMP             00097000
000980                                                 VALUE +2033.     00098000
000990     03  WS-AB6345               PIC S9(04)      COMP             00099000
001000                                                 VALUE +6345.     00100000
001010 01  WS-TRACECODES.                                               00101000
001020     03  WS-TR0001               PIC S9(04)      COMP             00102000
001030                                                 VALUE +0001.     00103000
001040     03  WS-TR0002               PIC S9(04)      COMP             00104000
001050                                                 VALUE +0002.     00105000
001060     03  WS-TR0003               PIC S9(04)      COMP             00106000
001070                                                 VALUE +0003.     00107000
001080 01  SLW096-AREAS.                                                00108000
000000 COPY SLW096.                                                     00109000
001100 01  RPW014-AREAS.                                                00110000
000000 COPY RPW014.                                                     00111000
001120 01  RPW033-AREAS.                                                00112000
000000 COPY RPW033.                                                     00113000
001140 01  RPW130-AREAS.                                                00114000
000000 COPY RPW130.                                                     00115000
001160 01  SRW000-AREAS.                                                00116000
000000 COPY SRW000.                                                     00117000
001180 01  SRW025-AREAS.                                                00118000
000000 COPY SRW025.                                                     00119000
001200 01  SRW030-AREAS.                                                00120000
000000 COPY SRW030.                                                     00121000
001220 01  SRW031-AREAS.                                                00122000
000000 COPY SRW031.                                                     00123000
001240 01  SRW105-AREAS.                                                00124000
000000 COPY SRW105.                                                     00125000
001260 01  SRW161-AREAS.                                                00126000
000000 COPY SRW161.                                                     00127000
001280 01  SRW166-AREAS.                                                00128000
000000 COPY SRW166.                                                     00129000
001300 01  SRW170-AREAS.                                                00130000
000000 COPY SRW170.                                                     00131000
001320 COPY DFHAID.                                                     00132000
001330******************************************************************00133000
001340 LINKAGE SECTION.                                                 00134000
001350 01  DFHCOMMAREA.                                                 00135000
000000 COPY SLS1112.                                                    00136000
001370     03  COM-WORKAREAS   REDEFINES COM-WORKAREA.                  00137000
001380         05  COM-EDIT-DATE       PIC X(10).                       00138000
001390         05  COM-KEY-INFO.                                        00139000
001400             07  COM-KEY-OCCUR   PIC S9(04)      COMP-3.          00140000
001410             07  COM-KEY-DATA                    OCCURS 08 TIMES. 00141000
001420                 09  COM-KD-ACCT1-GRP.                            00142000
001430                     11  COM-KD-INST                              00143000
001440                                 PIC 9(04).                       00144000
001450                     11  COM-KD-PRODCODE                          00145000
001460                                 PIC X(06).                       00146000
001470                     11  COM-KD-ACCOUNT                           00147000
001480                                 PIC X(18).                       00148000
001490                     11  COM-KD-ACCOUNT-N                         00149000
001500                         REDEFINES COM-KD-ACCOUNT                 00150000
001510                                 PIC 9(18).                       00151000
001520                     11  COM-KD-MODEL                             00152000
001530                                 PIC X(10).                       00153000
001540                 09  COM-KD-ACCT2-GRP.                            00154000
001550                     11  COM-KD-INST2                             00155000
001560                                 PIC 9(04).                       00156000
001570                     11  COM-KD-PRODCODE2                         00157000
001580                                 PIC X(06).                       00158000
001590                     11  COM-KD-ACCOUNT2                          00159000
001600                                 PIC X(18).                       00160000
001610                     11  COM-KD-ACCOUNT-N2                        00161000
001620                         REDEFINES COM-KD-ACCOUNT2                00162000
001630                                 PIC 9(18).                       00163000
001640                 09  COM-KD-ACCT-TYPE                             00164000
001650                                 PIC S9(03)      COMP-3.          00165000
001660                 09  COM-KD-BRANCH                                00166000
001670                                 PIC S9(05)      COMP-3.          00167000
001680                 09  COM-KD-ACCT-STATUS                           00168000
001690                                 PIC X(01).                       00169000
001700                 09  COM-KD-APPL PIC 9(02).                       00170000
001710         05  COM-KEY-FIELDS.                                      00171000
001720             07  COM-KEY-PRODCODE                                 00172000
001730                                 PIC X(06).                       00173000
001740             07  COM-KEY-ACCOUNT PIC X(18).                       00174000
001750             07  COM-KEY-ACCOUNT-N                                00175000
001760                         REDEFINES COM-KEY-ACCOUNT                00176000
001770                                 PIC 9(18).                       00177000
001780             07  COM-KEY-MODEL                                    00178000
001790                                 PIC X(10).                       00179000
001800             07  COM-KEY-IDNBRX  PIC X(18).                       00180000
001810             07  COM-KEY-IDNBR                                    00181000
001820                         REDEFINES COM-KEY-IDNBRX                 00182000
001830                                 PIC 9(18).                       00183000
001840         05  COM-PANEL-ACTION    PIC X(01).                       00184000
001850             88  INITIAL-PANEL                   VALUE ' '.       00185000
001860             88  EDIT-PANEL                      VALUE 'E'.       00186000
001870         05  COM-FROM-PANEL      PIC X(01).                       00187000
001880             88  FROM-KEY-PANEL                  VALUE 'K'.       00188000
001890             88  FROM-INFO-PANEL                 VALUE 'I'.       00189000
001900             88  FROM-HELP                       VALUE 'H'.       00190000
001910             88  FROM-BREAKAWAY                  VALUE 'B'.       00191000
001920         05  COM-KEY-FORMATTEDACCT                                00192000
001930                                 PIC X(22).                       00193000
001940         05  COM-KEY-MSGNBR      PIC X(06).                       00194000
001950         05  COM-KEY-COMMAND     PIC X(50).                       00195000
001960         05  COM-FIRST-KEY       PIC X(66).                       00196000
001970         05  COM-LAST-KEY        PIC X(66).                       00197000
001980         05  COM-MORE            PIC X(01).                       00198000
001990         05  COM-RCIF-KEY        PIC X(26).                       00199000
002000         05  COM-CUST-NAME       PIC X(40).                       00200000
002010         05  COM-CLOSE-FLAG      PIC X(01).                       00201000
002020         05  COM-PRIM-ONLY       PIC X(01).                       00202000
002030         05  COM-RPXXX03-CURPAGE PIC S9(04)      COMP-3.          00203000
002040         05  COM-DCHG.                                            00204000
002050             07  COM-DELETE-DCHG PIC X(01).                       00205000
002060             07  FILLER                          OCCURS 08 TIMES. 00206000
002070                 09  COM-ACTION-DCHG                              00207000
002080                                 PIC X(01).                       00208000
002090         05  COM-ADDITIONAL.                                      00209000
002100             07  COM-SECONDARY       PIC X(3000).                 00210000
002110             07  COM-PASSING                                      00211000
002120                         REDEFINES COM-SECONDARY.                 00212000
002130                 09  COM-SVDISPACCT                               00213000
002140                                 PIC X(1400).                     00214000
002150                 09  COM-SVALL   PIC S9(03)      COMP-3.          00215000
002160                 09  COM-SVSCSUB PIC S9(03)      COMP-3.          00216000
002170                 09  COM-SVSECONDARYCUST                          00217000
002180                                 PIC S9(03)      COMP-3.          00218000
002190                 09  COM-SVSECCUSTNOW                             00219000
002200                                 PIC X(01).                       00220000
002210                 09  COM-FIRST-RCIF-KEY                           00221000
002220                                 PIC X(26).                       00222000
002230                 09  COM-REST    PIC X(1567).                     00223000
002240             07  COM-SECONDARY2  PIC X(0098).                     00224000
002250                                                                  00225000
002260                                                                  00226000
002270                                                                  00227000
002280                                                                  00228000
002290******************************************************************00229000
002300*01  SLW096-2023RECORDS.                                          00230000
000000 COPY SLW096L.                                                    00231000
002320******************************************************************00232000
002330 PROCEDURE DIVISION.                                              00233000
002340******************************************************************00234000
002350 ENTRY-ROUTINE SECTION.                                           00235000
002360     MOVE 'RPL310' TO COM-ABPROGID.                               00236000
000000 COPY SLP771.                                                     00237000
002380******************************************************************00238000
002390 TRANSACTION-CLEAN-UP SECTION.                                    00239000
002400 TCU-START.                                                       00240000
002410 TCU-EXIT.                                                        00241000
002420     EXIT.                                                        00242000
002430******************************************************************00243000
002440 CICS-HANDLE-CONDITION SECTION.                                   00244000
000000 COPY SLP772.                                                     00245000
002460     IF WS-RETURNX IS EQUAL TO 'SLP744'                           00246000
002470         GO TO CTSRI-EXIT.                                        00247000
002480     MOVE WS-AB2033 TO COM-ABORT.                                 00248000
002490     MOVE WS-TR0001 TO COM-ABTRACE.                               00249000
002500     GO TO ABORT-EXIT.                                            00250000
002510 CHC-EXIT.                                                        00251000
002520     EXIT.                                                        00252000
002530******************************************************************00253000
002540 ROUTING-ROUTINE SECTION.                                         00254000
002550 RR-START.                                                        00255000
002560     MOVE LOW-VALUES TO RPXXX03-MESSAGE.                          00256000
002570     MOVE LOW-VALUES TO RPV310-PANL-DATA-AREA.                    00257000
002580     MOVE LOW-VALUES TO RPV310K-PANL-DATA-AREA.                   00258000
002590     MOVE ALL ZEROS TO WS-MSGNBR.                                 00259000
002600     MOVE 'RP00' TO WS-TSQFILEID.                                 00260000
002610     MOVE 'RPI' TO WS-TSQSYSID.                                   00261000
002620     MOVE COM-DATE-DELIM TO SR-CDDELIM.                           00262000
002630     MOVE COM-DATE-SEQ TO SR-CDSEQ.                               00263000
002640     IF COM-SRBTAG IS EQUAL TO '**BSRB**'                         00264000
002650         MOVE COM-PAN TO BICRPAN                                  00265000
002660         MOVE COM-PSB TO BICRPSB                                  00266000
002670         MOVE COM-SRB TO BICRSRB                                  00267000
002680     ELSE                                                         00268000
002690         MOVE '1' TO BPSB-LEVEL.                                  00269000
002700     IF COM-RETURN IS EQUAL TO 'B'                                00270000
002710         GO TO BREAKAWAY-RETURN.                                  00271000
002720     IF COM-RETURN IS EQUAL TO '0'                                00272000
002730         MOVE COM-SSDATASET TO BPSB-MAP-DIR                       00273000
002740         MOVE SPACES TO COM-WORKAREAS                             00274000
002750         MOVE '1' TO SRB-VERSION                                  00275000
002760         MOVE 'IPRP' TO SRB-APPL-ID                               00276000
002770         MOVE 'RPL310' TO SRB-PROG-ID                             00277000
002780         MOVE RPS-RLSE-LIT TO SRB-RELEASE                         00278000
002790         MOVE 'P' TO PAN-TYPE                                     00279000
002800         MOVE SPACE TO PAN-OVERLAY                                00280000
002810         MOVE SPACE TO PAN-CLOSE                                  00281000
002820         MOVE SPACE TO PAN-ALARM                                  00282000
002830         MOVE SPACE TO PAN-CURSOR-PAN                             00283000
002840         MOVE SPACE TO PAN-CURSOR-FLD                             00284000
002850         MOVE SPACE TO PAN-SET-FLD                                00285000
002860         MOVE SPACE TO PAN-SET-VID                                00286000
002870         MOVE SPACE TO PAN-SET-EMP                                00287000
002880         MOVE +0 TO COM-RPXXX03-CURPAGE                           00288000
002890         MOVE +0 TO COM-KEY-OCCUR                                 00289000
002900         MOVE PDB-RPV310K-NAME TO PAN-NAME                        00290000
002910         PERFORM PANEL-INIT                                       00291000
002920         MOVE BICRPAN TO COM-PAN                                  00292000
002930         MOVE BICRPSB TO COM-PSB                                  00293000
002940         MOVE BICRSRB TO COM-SRB                                  00294000
002950         PERFORM INITIALIZE-DATE                                  00295000
002960         GO TO PANEL-ROUTER.                                      00296000
002970     PERFORM PANEL-NAME-SET.                                      00297000
002980     IF COM-HELPSW IS EQUAL TO 'Y'                                00298000
002990         GO TO HELP-RETURN.                                       00299000
003000     PERFORM PANEL-RECEIVE.                                       00300000
003010     PERFORM PANEL-DATA-GET.                                      00301000
003020     IF FROM-INFO-PANEL                                           00302000
003030         PERFORM SET-DCHG-INDICATORS.                             00303000
003040     PERFORM PANEL-PFKEY-SET.                                     00304000
003050     PERFORM VALIDATE-PFKEYS.                                     00305000
003060     IF EIBAID IS EQUAL TO DFHPF1                                 00306000
003070         GO TO GET-HELP.                                          00307000
003080     IF EIBAID IS EQUAL TO DFHPF11                                00308000
003090         GO TO BREAK-AWAY.                                        00309000
003100     IF (COM-RETURN IS EQUAL TO 'E')                              00310000
003110         AND (EIBAID IS EQUAL TO DFHPF2                           00311000
003120         OR EIBAID IS EQUAL TO DFHPF3                             00312000
003130         OR EIBAID IS EQUAL TO DFHPF4                             00313000
003140         OR EIBAID IS EQUAL TO DFHPF7                             00314000
003150         OR EIBAID IS EQUAL TO DFHPF8                             00315000
003160         OR EIBAID IS EQUAL TO DFHPF12)                           00316000
003170         GO TO CLOSE-TRANSACTION.                                 00317000
003180     IF COM-RETURN IS EQUAL TO '1'                                00318000
003190         AND EIBAID IS EQUAL TO DFHPF12                           00319000
003200         GO TO CLOSE-TRANSACTION.                                 00320000
003210     IF COM-RETURN IS EQUAL TO '0'                                00321000
003220         OR COM-RETURN IS EQUAL TO 'E'                            00322000
003230         OR COM-RETURN IS EQUAL TO '1'                            00323000
003240         GO TO PANEL-ROUTER.                                      00324000
003250 RR-END.                                                          00325000
003260     GO TO CLOSE-TRANSACTION.                                     00326000
003270 RR-EXIT.                                                         00327000
003280     EXIT.                                                        00328000
003290******************************************************************00329000
003300 INITIALIZE-DATE SECTION.                                         00330000
003310 ID-START.                                                        00331000
003320     MOVE COM-DATE TO WS-CURDATE8.                                00332000
003330     MOVE '-' TO WS-CD8DSH1.                                      00333000
003340     MOVE '-' TO WS-CD8DSH2.                                      00334000
003350     MOVE WS-CURDATE8X TO COM-EDIT-DATE.                          00335000
003360 ID-EXIT.                                                         00336000
003370     EXIT.                                                        00337000
003380******************************************************************00338000
003390 PANEL-NAME-SET SECTION.                                          00339000
003400 PNS-START.                                                       00340000
003410     IF COM-RETURN IS EQUAL TO '0'                                00341000
003420         MOVE PDB-RPV310K-NAME TO PAN-NAME.                       00342000
003430     IF COM-RETURN IS EQUAL TO 'E'                                00343000
003440         MOVE PDB-RPV310K-NAME TO PAN-NAME.                       00344000
003450     IF COM-RETURN IS EQUAL TO '1'                                00345000
003460         MOVE PDB-RPV310-NAME TO PAN-NAME.                        00346000
003470 PNS-EXIT.                                                        00347000
003480     EXIT.                                                        00348000
003490******************************************************************00349000
003500 PANEL-DATA-GET SECTION.                                          00350000
003510 PDG-START.                                                       00351000
003520     IF COM-RETURN IS EQUAL TO '0'                                00352000
003530         PERFORM PANEL-GET-RPV310K.                               00353000
003540     IF COM-RETURN IS EQUAL TO 'E'                                00354000
003550         PERFORM PANEL-GET-RPV310K                                00355000
003560         MOVE RPV310K-COMMAND TO WS-NEXTKEY                       00356000
003570         MOVE PDB-RPV310K-COMMAND-DCHG TO WS-COMMAND-DCHG.        00357000
003580     IF COM-RETURN IS EQUAL TO '1'                                00358000
003590         PERFORM PANEL-GET-RPV310                                 00359000
003600         MOVE RPV310-COMMAND TO WS-NEXTKEY                        00360000
003610         MOVE PDB-RPV310-COMMAND-DCHG TO WS-COMMAND-DCHG.         00361000
003620 PDG-EXIT.                                                        00362000
003630     EXIT.                                                        00363000
003640******************************************************************00364000
003650 PANEL-PFKEY-SET SECTION.                                         00365000
003660 PPS-START.                                                       00366000
003670 PPS-EXIT.                                                        00367000
003680     EXIT.                                                        00368000
003690******************************************************************00369000
003700 PANEL-ROUTER SECTION.                                            00370000
003710 PR-START.                                                        00371000
003720     IF COM-RETURN IS EQUAL TO '0'                                00372000
003730         GO TO PROCESS-KEY-PANEL.                                 00373000
003740     IF COM-RETURN IS EQUAL TO 'E'                                00374000
003750         GO TO PROCESS-KEY-PANEL.                                 00375000
003760     IF COM-RETURN IS EQUAL TO '1'                                00376000
003770         GO TO PROCESS-INFO-PANEL.                                00377000
003780     GO TO CLOSE-TRANSACTION.                                     00378000
003790 PR-EXIT.                                                         00379000
003800     EXIT.                                                        00380000
003810******************************************************************00381000
003820 HELP-RETURN SECTION.                                             00382000
000000 COPY SRP074.                                                     00383000
003840******************************************************************00384000
003850 HELP-RETURN-FINISH SECTION.                                      00385000
003860 HRF-START.                                                       00386000
003870     PERFORM PANEL-DATA-GET.                                      00387000
003880     MOVE 'H' TO COM-FROM-PANEL.                                  00388000
003890     GO TO PANEL-ROUTER.                                          00389000
003900 HRF-EXIT.                                                        00390000
003910     EXIT.                                                        00391000
003920******************************************************************00392000
003930 HELP-MISSING-FINISH SECTION.                                     00393000
003940 HMF-START.                                                       00394000
003950     MOVE 'H' TO COM-FROM-PANEL.                                  00395000
003960     MOVE WS-HELPMSG TO COM-KEY-MSGNBR.                           00396000
003970     GO TO PANEL-ROUTER.                                          00397000
003980 HMF-EXIT.                                                        00398000
003990     EXIT.                                                        00399000
004000******************************************************************00400000
004010 BREAK-AWAY SECTION.                                              00401000
000000 COPY SRP0752.                                                    00402000
004030******************************************************************00403000
004040 BREAKAWAY-RETURN-FINISH SECTION.                                 00404000
004050 BRF-START.                                                       00405000
004060     PERFORM PANEL-DATA-GET.                                      00406000
004070     MOVE 'B' TO COM-FROM-PANEL.                                  00407000
004080     GO TO PANEL-ROUTER.                                          00408000
004090 BRF-EXIT.                                                        00409000
004100     EXIT.                                                        00410000
004110******************************************************************00411000
004120 PROCESS-KEY-PANEL SECTION.                                       00412000
004130 PKP-START.                                                       00413000
004140     IF INITIAL-PANEL                                             00414000
004150         GO TO PKP-CONTINUE.                                      00415000
004160     IF EDIT-PANEL                                                00416000
004170         AND FROM-INFO-PANEL                                      00417000
004180         MOVE SPACE TO COM-FROM-PANEL                             00418000
004190         GO TO PKP-RELOAD-PANEL.                                  00419000
004200 PKP-CONTINUE.                                                    00420000
004210     MOVE COM-NEXTKEY TO SR-PSLIST.                               00421000
004220     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00422000
004230         GO TO PKP-SEND-PANEL.                                    00423000
004240 PKP-BEGIN-EDITS.                                                 00424000
004250     IF EDIT-PANEL                                                00425000
004260         MOVE RPV310K-PRODCD TO COM-KEY-PRODCODE                  00426000
004270         MOVE RPV310K-ACCOUNT TO COM-KEY-ACCOUNT                  00427000
004280         MOVE RPV310K-MODEL TO COM-KEY-MODEL                      00428000
004290         MOVE RPV310K-IDNBR TO COM-KEY-IDNBRX                     00429000
004300         GO TO PKP-RETURN-EDITS.                                  00430000
004310     PERFORM PARAMETER-SEARCH.                                    00431000
004320     MOVE SR-PSPARM TO COM-EXTID.                                 00432000
004330     MOVE SR-PSPARM TO COM-EXTERNALID.                            00433000
004340     PERFORM PARAMETER-SEARCH.                                    00434000
004350     MOVE SR-PSPARM TO COM-KEY-PRODCODE.                          00435000
004360     PERFORM PARAMETER-SEARCH.                                    00436000
004370     MOVE SR-PSPARM TO COM-KEY-ACCOUNT.                           00437000
004380     PERFORM PARAMETER-SEARCH.                                    00438000
004390     MOVE SR-PSPARM TO COM-KEY-MODEL.                             00439000
004400     PERFORM PARAMETER-SEARCH.                                    00440000
004410     MOVE SR-PSPARM TO COM-KEY-IDNBRX.                            00441000
004420 PKP-RETURN-EDITS.                                                00442000
004430     IF COM-KEY-PRODCODE IS EQUAL TO SPACE                        00443000
004440         MOVE LOW-VALUE TO COM-KEY-PRODCODE.                      00444000
004450     IF COM-KEY-ACCOUNT IS EQUAL TO SPACE                         00445000
004460         MOVE LOW-VALUE TO COM-KEY-ACCOUNT.                       00446000
004470     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00447000
004480         MOVE LOW-VALUES TO COM-KEY-MODEL.                        00448000
004490     IF COM-KEY-IDNBRX IS EQUAL TO SPACES                         00449000
004500         MOVE LOW-VALUES TO COM-KEY-IDNBRX.                       00450000
004510     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00451000
004520         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUE                00452000
004530         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUE                  00453000
004540         AND COM-KEY-IDNBRX IS GREATER THAN LOW-VALUES            00454000
004550         GO TO PKP-RETURN-CONT.                                   00455000
004560     IF COM-KEY-PRODCODE IS EQUAL TO LOW-VALUE                    00456000
004570         MOVE '000002' TO WS-MSGNBR                               00457000
004580         GO TO PKP-RETURN-CONT.                                   00458000
004590     PERFORM EDIT-ACCOUNT-KEY.                                    00459000
004600 PKP-RETURN-CONT.                                                 00460000
004610     IF INITIAL-PANEL                                             00461000
004620         AND COM-KEY-PRODCODE IS EQUAL TO LOW-VALUES              00462000
004630         AND COM-KEY-ACCOUNT IS EQUAL TO LOW-VALUES               00463000
004640         AND COM-KEY-MODEL IS EQUAL TO LOW-VALUES                 00464000
004650         AND COM-KEY-IDNBRX IS EQUAL TO LOW-VALUES                00465000
004660         MOVE '000001' TO WS-MSGNBR                               00466000
004670         GO TO PKP-SEND-PANEL.                                    00467000
004680     MOVE COM-KEY-IDNBRX TO SR-JUSTIFYIN.                         00468000
004690     MOVE +0018 TO SR-JLGTH.                                      00469000
004700     PERFORM RIGHT-JUSTIFY.                                       00470000
004710     IF SR-JUSTIFYOUT IS EQUAL TO SPACE                           00471000
004720         MOVE ZEROS TO COM-KEY-IDNBRX                             00472000
004730     ELSE                                                         00473000
004740         MOVE SR-JUSTIFYOUT TO COM-KEY-IDNBRX.                    00474000
004750     IF COM-KEY-IDNBRX IS NOT NUMERIC                             00475000
004760         MOVE ZEROES TO COM-KEY-IDNBRX.                           00476000
004770     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       00477000
004780     MOVE COM-KEY-ACCOUNT TO COM-ACCOUNTALPHA.                    00478000
004790     IF COM-KEY-ACCOUNT-N IS NUMERIC                              00479000
004800         MOVE COM-KEY-ACCOUNT-N TO COM-ACCOUNT                    00480000
004810     ELSE                                                         00481000
004820         MOVE ZERO TO COM-ACCOUNT.                                00482000
004830     IF FROM-BREAKAWAY                                            00483000
004840         OR FROM-HELP                                             00484000
004850         OR WS-MSGNBR IS NOT EQUAL TO ZERO                        00485000
004860         GO TO PKP-RELOAD-PANEL.                                  00486000
004870     IF COM-KEY-PRODCODE IS GREATER THAN SPACES                   00487000
004880         AND COM-KEY-ACCOUNT IS GREATER THAN SPACES               00488000
004890         AND COM-KEY-MODEL IS GREATER THAN SPACES                 00489000
004900         AND COM-KEY-IDNBRX IS GREATER THAN ZEROS                 00490000
004910         MOVE '000002' TO WS-MSGNBR                               00491000
004920         GO TO PKP-RELOAD-PANEL.                                  00492000
004930 PKP-EDITS-READY.                                                 00493000
004940     MOVE SPACE TO COM-PANEL-ACTION.                              00494000
004950     MOVE '1' TO COM-RETURN.                                      00495000
004960     MOVE 'K' TO COM-FROM-PANEL.                                  00496000
004970     GO TO PANEL-ROUTER.                                          00497000
004980 PKP-RELOAD-PANEL.                                                00498000
004990     IF COM-KEY-PRODCODE IS EQUAL TO SPACES                       00499000
005000         MOVE LOW-VALUES TO RPV310K-PRODCD                        00500000
005010     ELSE                                                         00501000
005020         MOVE COM-KEY-PRODCODE TO RPV310K-PRODCD.                 00502000
005030     IF COM-KEY-ACCOUNT IS EQUAL TO SPACES                        00503000
005040         OR COM-KEY-ACCOUNT IS EQUAL TO ZEROS                     00504000
005050         MOVE LOW-VALUES TO RPV310K-ACCOUNT                       00505000
005060     ELSE                                                         00506000
005070         MOVE COM-KEY-ACCOUNT TO RPV310K-ACCOUNT.                 00507000
005080     MOVE COM-KEY-MODEL TO RPV310K-MODEL.                         00508000
005090     IF COM-KEY-MODEL IS EQUAL TO SPACES                          00509000
005100         MOVE LOW-VALUES TO RPV310K-MODEL.                        00510000
005110     MOVE COM-KEY-IDNBRX TO RPV310K-IDNBR.                        00511000
005120     IF COM-KEY-IDNBRX IS NOT GREATER THAN ZEROS                  00512000
005130         MOVE LOW-VALUES TO RPV310K-IDNBR.                        00513000
005140 PKP-SEND-PANEL.                                                  00514000
005150     MOVE PDB-RPV310K-NAME TO PAN-NAME.                           00515000
005160     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00516000
005170     IF (FROM-HELP                                                00517000
005180         OR FROM-BREAKAWAY)                                       00518000
005190         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00519000
005200         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00520000
005210     ELSE                                                         00521000
005220         MOVE PDB-RPV310K-PRODCD TO PAN-SET-FLD.                  00522000
005230     PERFORM CALL-BISPAN-RPV310K.                                 00523000
005240     MOVE COM-OPERID TO RPV310K-OPERID.                           00524000
005250     MOVE COM-INST TO RPV310K-INST.                               00525000
005260     MOVE COM-EDIT-DATE TO RPV310K-SYSDATE.                       00526000
005270     IF RPV310K-PRODCD IS EQUAL TO SPACES                         00527000
005280         MOVE LOW-VALUES TO RPV310K-PRODCD.                       00528000
005290     MOVE RPV310K-ACCOUNT TO SR-JUSTIFYIN.                        00529000
005300     MOVE +18 TO SR-JLGTH.                                        00530000
005310     PERFORM LEFT-JUSTIFY.                                        00531000
005320     MOVE SR-JUSTIFYOUT TO RPV310K-ACCOUNT.                       00532000
005330     IF RPV310K-ACCOUNT IS EQUAL TO SPACES                        00533000
005340         MOVE LOW-VALUES TO RPV310K-ACCOUNT.                      00534000
005350     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00535000
005360         MOVE WS-HELPMSG TO WS-MSGNBR.                            00536000
005370     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00537000
005380         MOVE '000027' TO WS-MSGNBR                               00538000
005390     ELSE                                                         00539000
005400         PERFORM BUILD-NEXTKEY                                    00540000
005410         PERFORM COMPRESS-NEXTKEY                                 00541000
005420         MOVE WS-NEXTKEY TO RPV310K-COMMAND.                      00542000
005430     IF FROM-BREAKAWAY                                            00543000
005440         OR FROM-HELP                                             00544000
005450         MOVE SPACES TO COM-FROM-PANEL                            00545000
005460         MOVE COM-KEY-COMMAND TO RPV310K-COMMAND                  00546000
005470         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00547000
005480     ELSE                                                         00548000
005490         MOVE RPV310K-COMMAND TO COM-KEY-COMMAND                  00549000
005500         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00550000
005510     MOVE 'E' TO COM-RETURN.                                      00551000
005520     PERFORM GET-MESSAGE.                                         00552000
005530     MOVE WS-MESSAGE TO RPV310K-MSGLINE.                          00553000
005540     PERFORM PANEL-PFKEY-SET.                                     00554000
005550     PERFORM BUILD-PFKEY-LINE.                                    00555000
005560     MOVE WS-PFLINE1 TO RPV310K-PFLINE1.                          00556000
005570     MOVE WS-PFLINE2 TO RPV310K-PFLINE2.                          00557000
005580     PERFORM PANEL-PUT-RPV310K.                                   00558000
005590     PERFORM PANEL-SEND.                                          00559000
005600     MOVE 'E' TO COM-PANEL-ACTION.                                00560000
005610     MOVE COM-INTID TO WS-TRANSID.                                00561000
005620     GO TO CICS-RETURN-TRANSID.                                   00562000
005630 PKP-EXIT.                                                        00563000
005640     EXIT.                                                        00564000
005650******************************************************************00565000
005660 PROCESS-INFO-PANEL SECTION.                                      00566000
005670 PIP-START.                                                       00567000
005680     IF FROM-HELP                                                 00568000
005690         OR FROM-BREAKAWAY                                        00569000
005700         GO TO PIP-SEND-PANEL.                                    00570000
005710     IF INITIAL-PANEL                                             00571000
005720         MOVE +0 TO RPXXX03-SUB                                   00572000
005730         MOVE SPACES TO COM-DCHG                                  00573000
005740         MOVE +1 TO RPXXX03-PAGES-TO-READ                         00574000
005750         MOVE +1 TO COM-RPXXX03-CURPAGE                           00575000
005760         MOVE COM-RPXXX03-CURPAGE TO RPXXX03-CURPAGE              00576000
005770         MOVE SPACES TO COM-FIRST-KEY                             00577000
005780         MOVE SPACE TO COM-PANEL-ACTION                           00578000
005790         MOVE 'VKL' TO RPXXX03-APIFUNC                            00579000
005800         GO TO PIP-RPXXX03-LOOP.                                  00580000
005810 PIP-PFKEYS.                                                      00581000
005820     MOVE ALL ZEROS TO WS-MSGNBR.                                 00582000
005830     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00583000
005840         MOVE PDB-RPV310-COMMAND TO WS-CURSOR-FIELD               00584000
005850         GO TO PIP-SEND-PANEL.                                    00585000
005860     IF EIBAID IS EQUAL TO DFHPF2                                 00586000
005870         AND COM-RPXXX03-CURPAGE IS GREATER THAN +1               00587000
005880         MOVE +1 TO RPXXX03-CURPAGE                               00588000
005890         MOVE +1 TO RPXXX03-PAGES-TO-READ                         00589000
005900         MOVE COM-FIRST-KEY TO RPXXX03-KEY-RECORD                 00590000
005910         MOVE COM-FIRST-RCIF-KEY TO RPXXX03-RCIF-KEY              00591000
005920         MOVE ZERO TO RPXXX03-ALL                                 00592000
005930         MOVE RPXXX03-ALL TO COM-SVALL                            00593000
005940         INITIALIZE RPXXX03-DISP-DATA                             00594000
005950         MOVE RPXXX03-DISP-DATA TO COM-SVDISPACCT                 00595000
005960         GO TO PIP-CONTINUE.                                      00596000
005970     IF EIBAID IS EQUAL TO DFHPF7                                 00597000
005980         AND COM-RPXXX03-CURPAGE IS GREATER THAN +1               00598000
005990         MOVE COM-RPXXX03-CURPAGE TO RPXXX03-CURPAGE              00599000
006000         SUBTRACT +1 FROM RPXXX03-CURPAGE                         00600000
006010         MOVE RPXXX03-CURPAGE TO RPXXX03-PAGES-TO-READ            00601000
006020         MOVE COM-FIRST-KEY TO RPXXX03-KEY-RECORD                 00602000
006030         MOVE COM-FIRST-RCIF-KEY TO RPXXX03-RCIF-KEY              00603000
006040         MOVE RPXXX03-RCIF-KEY TO COM-RCIF-KEY                    00604000
006050         MOVE ZERO TO RPXXX03-ALL                                 00605000
006060         MOVE RPXXX03-ALL TO COM-SVALL                            00606000
006070         INITIALIZE RPXXX03-DISP-DATA                             00607000
006080         MOVE RPXXX03-DISP-DATA TO COM-SVDISPACCT                 00608000
006090         GO TO PIP-CONTINUE.                                      00609000
006100     IF EIBAID IS EQUAL TO DFHPF8                                 00610000
006110         AND COM-KEY-OCCUR IS LESS THAN +0009                     00611000
006120         MOVE '000046' TO WS-MSGNBR                               00612000
006130         GO TO PIP-SEND-PANEL.                                    00613000
006140     IF EIBAID IS EQUAL TO DFHPF8                                 00614000
006150         OR EIBAID IS EQUAL TO DFHENTER                           00615000
006160         MOVE COM-RPXXX03-CURPAGE TO RPXXX03-CURPAGE              00616000
006170         ADD +1 TO RPXXX03-CURPAGE                                00617000
006180         MOVE +1 TO RPXXX03-PAGES-TO-READ                         00618000
006190         MOVE COM-LAST-KEY TO RPXXX03-KEY-RECORD                  00619000
006200         GO TO PIP-CONTINUE.                                      00620000
006210     IF EIBAID IS EQUAL TO DFHPF3                                 00621000
006220         OR EIBAID IS EQUAL TO DFHPF4                             00622000
006230         MOVE COM-LAST-KEY TO RPXXX03-KEY-RECORD                  00623000
006240         GO TO PIP-CONTINUE.                                      00624000
006250 PIP-CONTINUE.                                                    00625000
006260     MOVE +0 TO WS-ERROR-COUNT.                                   00626000
006270     MOVE COM-DCHG TO SRW166-FIELD.                               00627000
006280     MOVE 'E' TO SRW166-IN.                                       00628000
006290     MOVE 'Y' TO SRW166-OUT.                                      00629000
006300* MOVE THE LENGTH OF THE COM-DCHG FIELD:                          00630000
006310     MOVE +9 TO SRW166-LGTH.                                      00631000
006320     PERFORM EXAMINE-FIELD.                                       00632000
006330     MOVE SRW166-FIELD TO COM-DCHG.                               00633000
006340     MOVE COM-DCHG TO RPXXX03-DCHG.                               00634000
006350     PERFORM MOVE-PANEL-TO-RECORD.                                00635000
006360     MOVE +0 TO RPXXX03-SUB.                                      00636000
006370     IF COM-DCHG IS EQUAL TO SPACES                               00637000
006380         AND (EIBAID IS EQUAL TO DFHPF3                           00638000
006390         OR EIBAID IS EQUAL TO DFHPF4)                            00639000
006400         GO TO CLOSE-TRANSACTION.                                 00640000
006410     IF RPXXX03-PAGES-TO-READ IS NOT NUMERIC                      00641000
006420         MOVE +0001 TO RPXXX03-PAGES-TO-READ.                     00642000
006430     IF INITIAL-PANEL                                             00643000
006440         MOVE 'VKL' TO RPXXX03-APIFUNC.                           00644000
006450     IF EDIT-PANEL                                                00645000
006460         MOVE 'UPD' TO RPXXX03-APIFUNC.                           00646000
006470 PIP-RPXXX03-LOOP.                                                00647000
006480     ADD +1 TO RPXXX03-SUB.                                       00648000
006490     IF RPXXX03-SUB IS GREATER THAN RPXXX03-PAGES-TO-READ         00649000
006500         GO TO PIP-RPXXX03-RETURN-CHECK.                          00650000
006510     PERFORM RPXXX03-LINK-MESSAGE.                                00651000
P0063 * **                                                              00651100
P0063      MOVE 'N' TO WS-NOCUSTOMER.                                   00651200
P0063      IF RPXXX03-CUST-NAME IS EQUAL TO WS-NOFOUNDCUST              00651300
P0063          MOVE 'Y' TO WS-NOCUSTOMER.                               00651400
P0063 * **                                                              00651500
006520     IF RPXXX03-KEY-MODEL IS NOT EQUAL TO COM-KEY-MODEL           00652000
006530         MOVE RPXXX03-KEY-MODEL TO COM-KEY-MODEL.                 00653000
006540     IF RPXXX03-MSGNBR IS NOT EQUAL TO ZEROS                      00654000
006550         AND RPXXX03-SUB IS EQUAL TO +0001                        00655000
006560         MOVE COM-RPXXX03-CURPAGE TO RPXXX03-CURPAGE              00656000
006570         GO TO PIP-RPXXX03-RETURN-CHECK.                          00657000
006580     IF RPXXX03-SUB IS EQUAL TO +0001                             00658000
006590         MOVE RPXXX03-KEY-IDNUMBER TO COM-KEY-IDNBR               00659000
006600         MOVE SPACES TO RPXXX03-DCHG.                             00660000
006610     GO TO PIP-RPXXX03-LOOP.                                      00661000
006620 PIP-RPXXX03-RETURN-CHECK.                                        00662000
006630     IF RPXXX03-RETURN IS EQUAL TO 'E'                            00663000
006640         MOVE 'E' TO COM-RETURN                                   00664000
006650         MOVE 'E' TO COM-PANEL-ACTION                             00665000
006660         MOVE 'I' TO COM-FROM-PANEL                               00666000
006670         GO TO PANEL-ROUTER.                                      00667000
006680     IF RPXXX03-SELECT-RTN IS NOT EQUAL TO '1'                    00668000
006690         AND RPXXX03-SELECT-RTN IS NOT EQUAL TO '2'               00669000
006700         AND RPXXX03-SELECT-RTN IS NOT EQUAL TO '3'               00670000
006710         MOVE WS-AB6345 TO COM-ABORT                              00671000
006720         MOVE WS-TR0002 TO COM-ABTRACE                            00672000
006730         GO TO ABORT-EXIT.                                        00673000
006740     IF RPXXX03-SELECT-RTN IS EQUAL TO '1'                        00674000
006750         AND EDIT-PANEL                                           00675000
006760         MOVE 'E' TO COM-END                                      00676000
006770         MOVE 'X' TO COM-RETURN                                   00677000
006780         GO TO PANEL-ROUTER.                                      00678000
006790     IF RPXXX03-SELECT-RTN IS EQUAL TO '1'                        00679000
006800         MOVE '000003' TO WS-MSGNBR                               00680000
006810         MOVE 'E' TO COM-RETURN                                   00681000
006820         MOVE 'E' TO COM-PANEL-ACTION                             00682000
006830         MOVE 'I' TO COM-FROM-PANEL                               00683000
006840         GO TO PANEL-ROUTER.                                      00684000
006850     IF RPXXX03-APIFUNC IS EQUAL TO 'EDT'                         00685000
006860         GO TO PIP-BUILD-MAINT-PANEL.                             00686000
006870 PIP-PAGING-CONTROLS.                                             00687000
006880     IF EIBAID IS EQUAL TO DFHPF3                                 00688000
006890         OR EIBAID IS EQUAL TO DFHPF4                             00689000
006900         GO TO CLOSE-TRANSACTION.                                 00690000
006910     IF RPXXX03-SELECT-RTN IS LESS THAN '3'                       00691000
006920         AND COM-KEY-OCCUR IS LESS THAN +0009                     00692000
006930         AND EIBAID IS NOT EQUAL TO DFHPF7                        00693000
006940         AND EDIT-PANEL                                           00694000
006950         MOVE 'X' TO COM-RETURN                                   00695000
006960         GO TO PANEL-ROUTER.                                      00696000
006970     IF COM-FIRST-KEY IS EQUAL TO SPACES                          00697000
006980         MOVE RPXXX03-FIRST-RCIF-KEY TO COM-FIRST-RCIF-KEY        00698000
006990         MOVE RPXXX03-RET-GRP-KEY (1) TO COM-FIRST-KEY.           00699000
007000     MOVE RPXXX03-RCIF-KEY TO COM-RCIF-KEY.                       00700000
007010     MOVE RPXXX03-CUST-NAME TO COM-CUST-NAME.                     00701000
007020     MOVE RPXXX03-CLOSE-FLAG TO COM-CLOSE-FLAG.                   00702000
007030     MOVE RPXXX03-PRIM-ONLY TO COM-PRIM-ONLY.                     00703000
007040     MOVE RPXXX03-RET-GRP-KEY (RPXXX03-OCCUR) TO COM-LAST-KEY.    00704000
007050     MOVE RPXXX03-CURPAGE TO COM-RPXXX03-CURPAGE.                 00705000
007060     MOVE RPXXX03-OCCUR TO COM-KEY-OCCUR.                         00706000
007070     IF COM-PRODCODE IS EQUAL TO LOW-VALUES                       00707000
007080         MOVE RPXXX03-KEY-PRODCODE TO COM-PRODCODE                00708000
007090         MOVE RPXXX03-KEY-PRODCODE TO COM-KEY-PRODCODE            00709000
007100         MOVE RPXXX03-KEY-ACCOUNT TO COM-KEY-ACCOUNT              00710000
007110         MOVE RPXXX03-KEY-MODEL TO COM-KEY-MODEL.                 00711000
007120 PIP-BUILD-MAINT-PANEL.                                           00712000
007130     MOVE RPXXX03-DCHG TO COM-DCHG.                               00713000
007140     PERFORM BUILD-MAINT-PANEL.                                   00714000
007150     MOVE +0 TO WS-SUB2.                                          00715000
007160 PIP-LOOP.                                                        00716000
007170     ADD +1 TO WS-SUB2.                                           00717000
007180     IF WS-SUB2 IS GREATER THAN COM-KEY-OCCUR                     00718000
007190         OR WS-SUB2 IS GREATER THAN +0008                         00719000
007200         GO TO PIP-SEND-PANEL.                                    00720000
007210     MOVE RPXXX03-RET-GRP-KEY (WS-SUB2)                           00721000
007220         TO COM-KEY-DATA (WS-SUB2).                               00722000
007230     MOVE RPXXX03-RET-ACCT-TYPE (WS-SUB2)                         00723000
007240         TO COM-KD-ACCT-TYPE (WS-SUB2).                           00724000
007250     MOVE RPXXX03-RET-BRANCH (WS-SUB2) TO COM-KD-BRANCH (WS-SUB2).00725000
007260     MOVE RPXXX03-RET-ACCT-STATUS (WS-SUB2)                       00726000
007270         TO COM-KD-ACCT-STATUS (WS-SUB2).                         00727000
007280     MOVE RPXXX03-RET-APPL (WS-SUB2) TO COM-KD-APPL (WS-SUB2).    00728000
007290     GO TO PIP-LOOP.                                              00729000
007300 PIP-SEND-PANEL.                                                  00730000
007310     MOVE PDB-RPV310-NAME TO PAN-NAME.                            00731000
007320     MOVE COM-INST TO RPV310-INST.                                00732000
007330     MOVE COM-OPERID TO RPV310-OPERID.                            00733000
007340     MOVE COM-PRODCODE TO RPV310-PRODCD.                          00734000
007350     MOVE COM-KEY-ACCOUNT TO RPV310-ACCOUNT.                      00735000
007360     MOVE COM-KEY-MODEL TO RPV310-MODEL.                          00736000
007370     IF RPV310-DELETE IS EQUAL TO SPACES                          00737000
007380         MOVE LOW-VALUES TO RPV310-DELETE.                        00738000
007390     IF RPXXX03-EXPIRE-FLAG IS EQUAL TO 'E'                       00739000
007400         OR COM-PRIM-ONLY IS EQUAL TO 'Y'                         00740000
007410         OR COM-CLOSE-FLAG IS EQUAL TO 'Y'                        00741000
007420         MOVE ALL 'P' TO COM-DCHG (2:8)                           00742000
007430         MOVE PDB-RPV310-COMMAND TO WS-CURSOR-FIELD.              00743000
007440     IF COM-UPDATE IS NOT EQUAL TO 'Y'                            00744000
007450         MOVE ALL 'P' TO COM-DCHG                                 00745000
007460         MOVE PDB-RPV310-COMMAND TO WS-CURSOR-FIELD.              00746000
007470     PERFORM SET-ATTRIBUTES-AND-MESSAGES.                         00747000
007480     IF (FROM-HELP                                                00748000
007490         OR FROM-BREAKAWAY)                                       00749000
007500         AND PAN-CURSOR-FLD IS NOT EQUAL TO SPACES                00750000
007510         MOVE PAN-CURSOR-FLD TO PAN-SET-FLD                       00751000
007520         MOVE PAN-CURSOR-OCC TO PAN-SET-OCC                       00752000
007530     ELSE                                                         00753000
007540         IF WS-CURSOR-FIELD IS EQUAL TO SPACE                     00754000
007550             MOVE PDB-RPV310-ACTION TO PAN-SET-FLD                00755000
007560             MOVE +1 TO PAN-SET-OCC                               00756000
007570         ELSE                                                     00757000
007580             MOVE WS-CURSOR-FIELD TO PAN-SET-FLD                  00758000
007590             MOVE WS-CURSOR-OCC TO PAN-SET-OCC.                   00759000
007600     IF PAN-SET-FLD IS EQUAL TO 'ACTION'                          00760000
007610         AND COM-KEY-OCCUR IS EQUAL TO ZERO                       00761000
007620         MOVE 'COMMAND' TO PAN-SET-FLD.                           00762000
007630     MOVE REQ-SET-CURSOR TO PAN-REQ-VERB.                         00763000
007640     PERFORM CALL-BISPAN-RPV310.                                  00764000
007650     MOVE COM-INST TO RPV310-INST.                                00765000
007660     MOVE COM-OPERID TO RPV310-OPERID.                            00766000
007670     MOVE COM-EDIT-DATE TO RPV310-SYSDATE.                        00767000
007680     IF WS-MSGNBR NOT NUMERIC                                     00768000
007690         MOVE ZERO TO WS-MSGNBR.                                  00769000
007700     IF WS-MSGNBR IS EQUAL TO ZERO                                00770000
007710         AND RPXXX03-CLOSE-FLAG IS EQUAL TO 'Y'                   00771000
007720         MOVE '500045' TO WS-MSGNBR.                              00772000
007730     IF WS-MSGNBR IS EQUAL TO ZERO                                00773000
007740         AND RPXXX03-EXPIRE-FLAG IS EQUAL TO 'T'                  00774000
007750         MOVE '500046' TO WS-MSGNBR.                              00775000
007760     IF WS-HELPMSG IS NOT EQUAL TO ZERO                           00776000
007770         MOVE WS-HELPMSG TO WS-MSGNBR.                            00777000
007780     IF WS-PFKEYERR IS EQUAL TO 'Y'                               00778000
007790         MOVE '000027' TO WS-MSGNBR                               00779000
007800     ELSE                                                         00780000
007810         PERFORM BUILD-NEXTKEY                                    00781000
007820         PERFORM COMPRESS-NEXTKEY                                 00782000
007830         MOVE WS-NEXTKEY TO RPV310-COMMAND.                       00783000
007840     IF FROM-HELP                                                 00784000
007850         OR FROM-BREAKAWAY                                        00785000
007860         MOVE COM-KEY-MSGNBR TO WS-MSGNBR                         00786000
007870         MOVE COM-KEY-COMMAND TO RPV310-COMMAND                   00787000
007880         MOVE SPACE TO COM-FROM-PANEL                             00788000
007890     ELSE                                                         00789000
007900         MOVE RPV310-COMMAND TO COM-KEY-COMMAND                   00790000
007910         MOVE WS-MSGNBR TO COM-KEY-MSGNBR.                        00791000
007920     PERFORM GET-MESSAGE.                                         00792000
007930     MOVE WS-MESSAGE TO RPV310-MSGLINE.                           00793000
007940     PERFORM PANEL-PFKEY-SET.                                     00794000
007950     MOVE SPACE TO RPV310-MORE.                                   00795000
007960     MOVE 'E' TO COM-END.                                         00796000
007970     IF COM-KEY-OCCUR IS GREATER THAN +0008                       00797000
007980         MOVE WS-MORE TO RPV310-MORE                              00798000
007990         MOVE '+' TO RPV310-PLUS                                  00799000
008000         MOVE 'F' TO COM-END                                      00800000
008010     ELSE                                                         00801000
008020         MOVE 'N' TO WS-PF8-FLG                                   00802000
008030         MOVE SPACE TO RPV310-PLUS.                               00803000
008040     IF COM-RPXXX03-CURPAGE IS GREATER THAN +1                    00804000
008050         MOVE WS-MORE TO RPV310-MORE                              00805000
008060         MOVE '-' TO RPV310-MINUS                                 00806000
008070         MOVE 'P' TO COM-END                                      00807000
008080     ELSE                                                         00808000
008090         MOVE 'N' TO WS-PF7-FLG                                   00809000
008100         MOVE SPACE TO RPV310-MINUS.                              00810000
008110     IF COM-KEY-OCCUR IS GREATER THAN +0008                       00811000
008120         AND COM-RPXXX03-CURPAGE IS GREATER THAN +1               00812000
008130         MOVE 'B' TO COM-END.                                     00813000
008140     IF COM-WKUCOUNT IS GREATER THAN ZERO                         00814000
008150         AND COM-WKUPOSITION IS GREATER THAN +1                   00815000
008160         AND COM-END IS NOT EQUAL TO 'P'                          00816000
008170         MOVE 'A' TO WS-PF7-FLG.                                  00817000
008180     IF COM-WKUCOUNT IS GREATER THAN ZERO                         00818000
008190         AND COM-WKUPOSITION IS LESS THAN COM-WKUCOUNT            00819000
008200         AND COM-END IS NOT EQUAL TO 'F'                          00820000
008210         MOVE 'A' TO WS-PF8-FLG.                                  00821000
008220     PERFORM BUILD-PFKEY-LINE.                                    00822000
008230     MOVE WS-PFLINE1 TO RPV310-PFLINE1.                           00823000
008240     MOVE WS-PFLINE2 TO RPV310-PFLINE2.                           00824000
008250     PERFORM PANEL-PUT-RPV310.                                    00825000
008260     PERFORM PANEL-SEND.                                          00826000
008270     MOVE '1' TO COM-RETURN.                                      00827000
008280     MOVE 'E' TO COM-PANEL-ACTION.                                00828000
008290     MOVE 'I' TO COM-FROM-PANEL.                                  00829000
008300     MOVE COM-INTID TO WS-TRANSID.                                00830000
008310     GO TO CICS-RETURN-TRANSID.                                   00831000
008320 PIP-EXIT.                                                        00832000
008330     EXIT.                                                        00833000
008340******************************************************************00834000
008350 BUILD-MAINT-PANEL SECTION.                                       00835000
008360 BMP-START.                                                       00836000
008370     MOVE COM-CUST-NAME TO RPV310-CUSTNA.                         00837000
008380     MOVE RPXXX03-KEY-MODEL TO RPV310-MODEL.                      00838000
008390     MOVE RPXXX03-MODEL-DESC TO RPV310-MODDESC.                   00839000
008400     IF RPXXX03-OUT-FLAG IS EQUAL TO 'Y'                          00840000
008410         MOVE '** OUTSIDE RELATIONSHIP **' TO RPV310-RELTYPE.     00841000
008420     MOVE RPXXX03-IDNUMBER TO RPV310-IDNBR.                       00842000
008430     IF RPXXX03-REL-STAT IS EQUAL TO 'A'                          00843000
008440         MOVE 'Active' TO RPV310-STATUS.                          00844000
008450     IF RPXXX03-REL-STAT IS EQUAL TO 'E'                          00845000
008460         MOVE 'Expired' TO RPV310-STATUS.                         00846000
008470     IF RPXXX03-REL-STAT IS EQUAL TO 'I'                          00847000
008480         MOVE 'Inactive' TO RPV310-STATUS.                        00848000
008490     IF RPXXX03-EXPIRE-FLAG IS EQUAL TO 'E'                       00849000
008500         MOVE 'Expired' TO RPV310-STATUS.                         00850000
008510     MOVE RPXXX03-DELETE TO RPV310-DELETE.                        00851000
008520     IF RPV310-DELETE IS EQUAL TO SPACES                          00852000
008530         OR RPV310-DELETE IS EQUAL TO LOW-VALUES                  00853000
008540         MOVE LOW-VALUES TO RPV310-DELETE.                        00854000
008550     MOVE +0 TO WS-SUB1.                                          00855000
008560 BMP-LOOP.                                                        00856000
008570     ADD +0001 TO WS-SUB1.                                        00857000
008580     IF WS-SUB1 IS GREATER THAN +0008                             00858000
008590         GO TO BMP-EXIT.                                          00859000
008600     IF WS-SUB1 IS GREATER THAN RPXXX03-OCCUR                     00860000
008610         OR RPXXX03-RET-GRP-KEY (WS-SUB1) IS EQUAL TO SPACES      00861000
008620         PERFORM PANEL-SPACE                                      00862000
008630         GO TO BMP-EXIT.                                          00863000
008640     MOVE RPXXX03-ACTION (WS-SUB1) TO RPV310-ACTION.              00864000
008650     IF RPV310-ACTION IS EQUAL TO SPACES                          00865000
008660         OR RPV310-ACTION IS EQUAL TO LOW-VALUES                  00866000
008670         MOVE WS-SUB1 TO PAN-SET-OCC                              00867000
008680         MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB                      00868000
008690         MOVE COM-ACTION-DCHG (WS-SUB1) TO WS-DCHG-TEST           00869000
008700         MOVE PDB-RPV310-ACTION-VID TO PAN-SET-VID                00870000
008710         MOVE PDB-RPV310-ACTION-EL TO PAN-SET-EMP                 00871000
008720         MOVE PDB-RPV310-ACTION TO PAN-SET-FLD                    00872000
008730         PERFORM SET-ATTRIBUTE                                    00873000
008740         MOVE LOW-VALUES TO RPV310-ACTION.                        00874000
008750     MOVE RPXXX03-RET-INST2 (WS-SUB1) TO RPV310-INSTX.            00875000
008760     MOVE RPXXX03-RET-PRODCODE2 (WS-SUB1) TO RPV310-PRODCDX.      00876000
008770     MOVE RPXXX03-RET-ACCOUNT2 (WS-SUB1) TO RPV310-ACCTX.         00877000
008780     MOVE SPACES TO RPV310-STATUSX.                               00878000
008790     IF RPXXX03-RET-ACCT-STATUS (WS-SUB1) IS NOT EQUAL TO SPACE   00879000
008800         MOVE 'Selected' TO RPV310-STATUSX.                       00880000
008810     IF RPXXX03-RET-ACCT-STATUS (WS-SUB1) IS EQUAL TO 'R'         00881000
008820         MOVE 'Removed' TO RPV310-STATUSX.                        00882000
008830     MOVE SPACES TO RPV310-MESSAGEX.                              00883000
008840     IF RPXXX03-RET-ACCT-STATUS (WS-SUB1) IS EQUAL TO 'U'         00884000
008850         MOVE '(Add-On Account)' TO RPV310-MESSAGEX.              00885000
008860     MOVE PDB-RPV310-NAME TO PAN-NAME.                            00886000
008870     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00887000
008880     PERFORM PANEL-PUT-OCCUR-RPV310.                              00888000
008890     GO TO BMP-LOOP.                                              00889000
008900 BMP-EXIT.                                                        00890000
008910     EXIT.                                                        00891000
008920******************************************************************00892000
008930 PANEL-SPACE SECTION.                                             00893000
008940 PS-START.                                                        00894000
008950     MOVE SPACES TO RPV310-ACTION.                                00895000
008960     MOVE SPACES TO RPV310-INSTX.                                 00896000
008970     MOVE SPACES TO RPV310-PRODCDX.                               00897000
008980     MOVE SPACES TO RPV310-MODEL.                                 00898000
008990     MOVE SPACES TO RPV310-ACCTX.                                 00899000
009000     MOVE SPACES TO RPV310-STATUSX.                               00900000
009010     MOVE SPACES TO RPV310-MESSAGEX.                              00901000
009020     PERFORM PANEL-PUT-OCCUR-RPV310.                              00902000
009030     IF PAN-STAT IS EQUAL TO STAT-END                             00903000
009040         GO TO PS-EXIT.                                           00904000
009050     GO TO PS-START.                                              00905000
009060 PS-EXIT.                                                         00906000
009070     EXIT.                                                        00907000
009080******************************************************************00908000
009090 SET-DCHG-INDICATORS SECTION.                                     00909000
009100 SDI-START.                                                       00910000
009110     IF COM-DELETE-DCHG IS EQUAL TO SPACE                         00911000
009120         MOVE PDB-RPV310-DELETE-DCHG TO COM-DELETE-DCHG.          00912000
009130     MOVE +0 TO WS-SUB1.                                          00913000
009140 SDI-LOOP.                                                        00914000
009150     ADD +0001 TO WS-SUB1.                                        00915000
009160     IF WS-SUB1 IS GREATER THAN +0008                             00916000
009170         GO TO SDI-EXIT.                                          00917000
009180     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                00918000
009190     PERFORM PANEL-GET-OCCUR-RPV310.                              00919000
009200     IF COM-ACTION-DCHG (WS-SUB1) IS EQUAL TO SPACE               00920000
009210         MOVE PDB-RPV310-ACTION-DCHG TO COM-ACTION-DCHG (WS-SUB1).00921000
009220     GO TO SDI-LOOP.                                              00922000
009230 SDI-EXIT.                                                        00923000
009240     EXIT.                                                        00924000
009250******************************************************************00925000
009260 SET-ATTRIBUTES-AND-MESSAGES SECTION.                             00926000
009270 SAAM-START.                                                      00927000
009280     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00928000
009290     MOVE COM-DELETE-DCHG TO WS-DCHG-TEST.                        00929000
009300     MOVE PDB-RPV310-DELETE-VID TO PAN-SET-VID.                   00930000
009310     MOVE PDB-RPV310-DELETE-EL TO PAN-SET-EMP.                    00931000
009320     MOVE PDB-RPV310-DELETE TO PAN-SET-FLD.                       00932000
009330     MOVE ZEROS TO PAN-SET-OCC.                                   00933000
009340     PERFORM SET-ATTRIBUTE.                                       00934000
009350     MOVE ZERO TO WS-SUB1.                                        00935000
009360 SAAM-LOOP.                                                       00936000
009370     ADD +1 TO WS-SUB1.                                           00937000
009380     IF WS-SUB1 IS GREATER THAN COM-KEY-OCCUR                     00938000
009390         OR WS-SUB1 IS GREATER THAN +0008                         00939000
009400         GO TO SAAM-PROTECT.                                      00940000
009410     MOVE WS-SUB1 TO PAN-SET-OCC.                                 00941000
009420     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00942000
009430     MOVE COM-ACTION-DCHG (WS-SUB1) TO WS-DCHG-TEST.              00943000
009440     MOVE PDB-RPV310-ACTION-VID TO PAN-SET-VID.                   00944000
009450     MOVE PDB-RPV310-ACTION-EL TO PAN-SET-EMP.                    00945000
009460     MOVE PDB-RPV310-ACTION TO PAN-SET-FLD.                       00946000
009470     PERFORM SET-ATTRIBUTE.                                       00947000
009480     GO TO SAAM-LOOP.                                             00948000
009490 SAAM-PROTECT.                                                    00949000
009500     MOVE VIS-DISPLAY TO PAN-SET-VID.                             00950000
009510     MOVE EMP-HIDDEN TO PAN-SET-EMP.                              00951000
009520     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00952000
009530 SAAM-PROTECT-LOOP.                                               00953000
009540     IF WS-SUB1 IS GREATER THAN +0008                             00954000
009550         GO TO SAAM-EXIT.                                         00955000
009560     MOVE WS-SUB1 TO PAN-SET-OCC.                                 00956000
009570     MOVE PDB-RPV310-ACTION TO PAN-SET-FLD.                       00957000
009580     PERFORM CALL-BISPAN-RPV310.                                  00958000
009590     ADD +1 TO WS-SUB1.                                           00959000
009600     GO TO SAAM-PROTECT-LOOP.                                     00960000
009610 SAAM-EXIT.                                                       00961000
009620     EXIT.                                                        00962000
009630******************************************************************00963000
009640 SET-ATTRIBUTE SECTION.                                           00964000
009650 SA-START.                                                        00965000
009660     IF WS-DCHG-EDITERR                                           00966000
009670         ADD +1 TO WS-ERROR-COUNT                                 00967000
009680         MOVE 'Y' TO WS-ERROR                                     00968000
009690         MOVE VIS-ERROR TO PAN-SET-VID                            00969000
009700         MOVE EMP-ERROR TO PAN-SET-EMP.                           00970000
009710     IF WS-DCHG-EDITERR                                           00971000
009720         AND WS-CURSOR-FIELD IS EQUAL TO SPACES                   00972000
009730         MOVE PAN-SET-FLD TO WS-CURSOR-FIELD                      00973000
009740         MOVE PAN-SET-OCC TO WS-CURSOR-OCC.                       00974000
009750     IF WS-DCHG-PROTECT                                           00975000
009760         MOVE VIS-DISPLAY TO PAN-SET-VID                          00976000
009770         MOVE EMP-NORMAL TO PAN-SET-EMP.                          00977000
009780     IF WS-DCHG-HIDDEN                                            00978000
009790         MOVE VIS-DISPLAY TO PAN-SET-VID                          00979000
009800         MOVE EMP-HIDDEN TO PAN-SET-EMP.                          00980000
009810     MOVE REQ-SET-ATTRIB TO PAN-REQ-VERB.                         00981000
009820     PERFORM CALL-BISPAN-RPV310.                                  00982000
009830 SA-EXIT.                                                         00983000
009840     EXIT.                                                        00984000
009850******************************************************************00985000
009860 MOVE-PANEL-TO-RECORD SECTION.                                    00986000
009870 MPTR-START.                                                      00987000
009880     MOVE COM-KEY-OCCUR TO RPXXX03-OCCUR.                         00988000
009890     MOVE SPACES TO RPXXX03-GRP-DATA.                             00989000
009900     MOVE COM-RCIF-KEY TO RPXXX03-RCIF-KEY.                       00990000
009910     MOVE COM-CUST-NAME TO RPXXX03-CUST-NAME.                     00991000
009920     MOVE COM-CLOSE-FLAG TO RPXXX03-CLOSE-FLAG.                   00992000
009930     MOVE COM-PRIM-ONLY TO RPXXX03-PRIM-ONLY.                     00993000
009940     IF RPV310-DELETE IS EQUAL TO LOW-VALUES                      00994000
009950         MOVE SPACES TO RPV310-DELETE.                            00995000
009960     MOVE RPV310-DELETE TO RPXXX03-DELETE.                        00996000
009970     MOVE +0 TO WS-SUB1.                                          00997000
009980 MPTR-LOOP.                                                       00998000
009990     ADD +0001 TO WS-SUB1.                                        00999000
010000     IF WS-SUB1 IS GREATER THAN COM-KEY-OCCUR                     01000000
010010         OR WS-SUB1 IS GREATER THAN +0008                         01001000
010020         GO TO MPTR-EXIT.                                         01002000
010030     MOVE COM-KEY-DATA (WS-SUB1) TO RPXXX03-RET-GRP-KEY (WS-SUB1).01003000
010040     MOVE COM-KD-ACCT-TYPE (WS-SUB1)                              01004000
010050         TO RPXXX03-RET-ACCT-TYPE (WS-SUB1).                      01005000
010060     MOVE COM-KD-BRANCH (WS-SUB1) TO RPXXX03-RET-BRANCH (WS-SUB1).01006000
010070     MOVE COM-KD-ACCT-STATUS (WS-SUB1)                            01007000
010080         TO RPXXX03-RET-ACCT-STATUS (WS-SUB1).                    01008000
010090     MOVE COM-KD-APPL (WS-SUB1) TO RPXXX03-RET-APPL (WS-SUB1).    01009000
010100     MOVE WS-SUB1 TO PAN-NEXT-OCC.                                01010000
010110     PERFORM PANEL-GET-OCCUR-RPV310.                              01011000
010120     IF RPV310-ACTION IS EQUAL TO LOW-VALUES                      01012000
010130         MOVE SPACES TO RPV310-ACTION.                            01013000
010140     MOVE RPV310-ACTION TO RPXXX03-ACTION (WS-SUB1).              01014000
010150     GO TO MPTR-LOOP.                                             01015000
010160 MPTR-EXIT.                                                       01016000
010170     EXIT.                                                        01017000
010180******************************************************************01018000
010190 MORE-DATA-PANELS SECTION.                                        01019000
010200 MDP-START.                                                       01020000
010210     GO TO PANEL-ROUTER.                                          01021000
010220 MDP-EXIT.                                                        01022000
010230     EXIT.                                                        01023000
010240******************************************************************01024000
010250 CLOSE-TRANSACTION SECTION.                                       01025000
000000 COPY SRP0722.                                                    01026000
010270******************************************************************01027000
010280 PANEL-INIT SECTION.                                              01028000
000000 COPY SRP073.                                                     01029000
010300******************************************************************01030000
010310 BUILD-NEXTKEY SECTION.                                           01031000
010320 BXN-START.                                                       01032000
010330     MOVE SPACES TO WS-NEXTKEY.                                   01033000
010340     MOVE ',' TO WS-DELIM1.                                       01034000
010350     MOVE ',' TO WS-DELIM2.                                       01035000
010360     MOVE ',' TO WS-DELIM3.                                       01036000
010370     MOVE COM-KEY-PRODCODE TO WS-PRODCODE.                        01037000
010380     MOVE COM-KEY-MODEL TO WS-MODEL.                              01038000
010390     IF COM-KEY-ACCOUNT IS NOT NUMERIC                            01039000
010400         MOVE COM-KEY-ACCOUNT TO WS-ACCTX                         01040000
010410     ELSE                                                         01041000
010420         MOVE COM-KEY-ACCOUNT-N TO WS-ACCT.                       01042000
010430     MOVE COM-EXTERNALID TO WS-EXTID.                             01043000
010440 BXN-EXIT.                                                        01044000
010450     EXIT.                                                        01045000
010460******************************************************************01046000
010470 ABORT-EXIT SECTION.                                              01047000
010480 AE-START.                                                        01048000
010490     MOVE EIBFN TO COM-ABEIBFN.                                   01049000
010500     MOVE EIBRCODE TO COM-ABEIBRCODE.                             01050000
010510     GO TO CICS-ABORT-EXIT.                                       01051000
010520 AE-EXIT.                                                         01052000
010530     EXIT.                                                        01053000
010540******************************************************************01054000
010550 RPXXX03-LINK-MESSAGE SECTION.                                    01055000
010560 CRLM-START.                                                      01056000
010570     MOVE 'Y' TO RPXXX03-GLOBAL-CLOSE.                            01057000
010580     MOVE WS-FILEOPTIONS TO RPXXX03-FILEOPTS.                     01058000
010590     MOVE COM-RETURN TO RPXXX03-RETURN.                           01059000
010600     MOVE COM-DATE TO RPXXX03-DATE.                               01060000
010610     MOVE COM-MODELID TO RPXXX03-MODELID.                         01061000
010620     MOVE COM-SECALT TO RPXXX03-SECALT.                           01062000
010630     MOVE COM-EXTERNALID TO RPXXX03-EXTERNALID.                   01063000
010640     MOVE COM-EIBTRMID TO RPXXX03-TERMID.                         01064000
010650     MOVE COM-WKUNAME TO RPXXX03-WORKID.                          01065000
010660     MOVE COM-TRANSTART TO RPXXX03-TRANSTART.                     01066000
010670     MOVE COM-UPDATE TO RPXXX03-UPDATE.                           01067000
010680     MOVE COM-APPLSEQ TO RPXXX03-APPLSEQ.                         01068000
010690     MOVE WS-RPSAPPLNBR TO RPXXX03-APPL.                          01069000
010700     MOVE 'M' TO RPXXX03-FUNC.                                    01070000
010710     MOVE COM-INST TO RPXXX03-KEY-INST.                           01071000
010720     MOVE COM-PRODCODE TO RPXXX03-KEY-PRODCODE.                   01072000
010730     MOVE COM-KEY-ACCOUNT TO RPXXX03-KEY-ACCOUNT.                 01073000
010740     MOVE COM-KEY-MODEL TO RPXXX03-KEY-MODEL.                     01074000
010750     IF COM-KEY-IDNBR IS NUMERIC                                  01075000
010760         AND COM-KEY-IDNBR IS GREATER THAN ZEROS                  01076000
010770         MOVE COM-KEY-IDNBR TO RPXXX03-KEY-IDNUMBER.              01077000
010780     MOVE COM-OPERID TO RPXXX03-OPERID.                           01078000
010790     MOVE COM-LANG TO RPXXX03-COM-LANG.                           01079000
010800     MOVE COM-CURN-CODE TO RPXXX03-COM-CURNCD.                    01080000
010810     MOVE COM-INST-OPTS TO RPXXX03-INST-OPTS.                     01081000
010820* ** SECONDARY CUSTOMER INFO                                      01082000
010830     IF COM-SVALL IS NUMERIC                                      01083000
010840         MOVE COM-SVALL TO RPXXX03-ALL                            01084000
010850         ELSE                                                     01085000
010860         MOVE ZERO TO RPXXX03-ALL.                                01086000
010870     IF COM-SVSCSUB IS NUMERIC                                    01087000
010880         MOVE COM-SVSCSUB TO RPXXX03-SCSUB                        01088000
010890         ELSE                                                     01089000
010900         MOVE ZERO TO RPXXX03-SCSUB.                              01090000
010910     IF COM-SVSECONDARYCUST IS NUMERIC                            01091000
010920         MOVE COM-SVSECONDARYCUST TO RPXXX03-SECONDARY-CUST       01092000
010930         ELSE                                                     01093000
010940         MOVE ZERO TO RPXXX03-SECONDARY-CUST.                     01094000
010950     MOVE COM-SVSECCUSTNOW TO RPXXX03-SECCUSTNOW.                 01095000
010960     MOVE COM-SVDISPACCT TO RPXXX03-DISP-DATA.                    01096000
010970* **                                                              01097000
010980     EXEC CICS LINK                                               01098000
010990         PROGRAM('RPLXXX03')                                      01099000
011000         COMMAREA(RPXXX03-MESSAGE)                                01100000
011010         LENGTH(LENGTH OF RPXXX03-MESSAGE)                        01101000
011020         RESP(WS-CICS-RESPONSE)                                   01102000
011030         END-EXEC.                                                01103000
011040     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     01104000
011050         MOVE 'RPLXXX03 LINK FAILED' TO COM-ABMSG                 01105000
011060         MOVE WS-TR0003 TO COM-ABTRACE                            01106000
011070         MOVE WS-AB0009 TO COM-ABORT                              01107000
011080         GO TO CICS-ABORT-EXIT.                                   01108000
011090     MOVE RPXXX03-FUNCTION TO WS-FUNCTION.                        01109000
011100     IF RPXXX03-ABORT IS NOT EQUAL TO ZERO                        01110000
011110         MOVE RPXXX03-ABORT TO COM-ABORT                          01111000
011120         MOVE RPXXX03-ABTRACE TO COM-ABTRACE                      01112000
011130         MOVE RPXXX03-ABEIBFN TO COM-ABEIBFN                      01113000
011140         MOVE RPXXX03-ABEIBRCODE TO COM-ABEIBRCODE                01114000
011150         MOVE RPXXX03-ABPROGID TO COM-ABPROGID                    01115000
011160         MOVE RPXXX03-SRBMDB TO COM-SRBMDB                        01116000
011170         MOVE RPXXX03-ABTYPE TO COM-ABTYPE                        01117000
011180         GO TO CICS-ABORT-EXIT.                                   01118000
011190     MOVE RPXXX03-FUNC TO COM-FUNC.                               01119000
011200     MOVE RPXXX03-ABORT TO COM-ABORT.                             01120000
011210     MOVE RPXXX03-MSGNBR TO WS-MSGNBR.                            01121000
011220     IF RPXXX03-OCCUR IS EQUAL TO +0009                           01122000
011230         AND RPXXX03-SUB IS LESS THAN RPXXX03-PAGES-TO-READ       01123000
011240         MOVE RPXXX03-RET-GRP-KEY (9) TO RPXXX03-KEY-RECORD.      01124000
011250     IF RPXXX03-ALL IS NUMERIC                                    01125000
011260         MOVE RPXXX03-ALL TO COM-SVALL                            01126000
011270         ELSE                                                     01127000
011280         MOVE ZERO TO COM-SVALL.                                  01128000
011290     IF RPXXX03-SCSUB IS NUMERIC                                  01129000
011300         MOVE RPXXX03-SCSUB TO COM-SVSCSUB                        01130000
011310         ELSE                                                     01131000
011320         MOVE ZERO TO COM-SVSCSUB.                                01132000
011330     IF RPXXX03-SECONDARY-CUST IS NUMERIC                         01133000
011340         MOVE RPXXX03-SECONDARY-CUST TO COM-SVSECONDARYCUST       01134000
011350         ELSE                                                     01135000
011360         MOVE ZERO TO COM-SVSECONDARYCUST.                        01136000
011370     MOVE RPXXX03-SECCUSTNOW TO COM-SVSECCUSTNOW.                 01137000
011380     MOVE RPXXX03-DISP-DATA TO COM-SVDISPACCT.                    01138000
011390 CRLM-EXIT.                                                       01139000
011400     EXIT.                                                        01140000
011410******************************************************************01141000
011420 CLOSE-PANEL SECTION.                                             01142000
011430 CP-START.                                                        01143000
011440     MOVE REQ-GLOBAL-CLOSE TO PAN-REQ-VERB.                       01144000
011450     IF COM-RETURN IS EQUAL TO 'E'                                01145000
011460         PERFORM CALL-BISPAN-RPV310K.                             01146000
011470     IF COM-RETURN IS EQUAL TO '1'                                01147000
011480         PERFORM CALL-BISPAN-RPV310.                              01148000
011490 CP-EXIT.                                                         01149000
011500     EXIT.                                                        01150000
011510******************************************************************01151000
011520 CALL-BISPAN-RPV310K SECTION.                                     01152000
011530 CBD1-START.                                                      01153000
011540     MOVE PDB-RPV310K-NAME TO PAN-NAME.                           01154000
011550     CALL 'BISPAN' USING                                          01155000
011560         BICRPSB,                                                 01156000
011570         BICRSRB,                                                 01157000
011580         BICRPAN,                                                 01158000
011590         RPV310K-PANL-DATA-BLOCK,                                 01159000
011600         RPV310K-PANL-DATA-AREA.                                  01160000
011610 CBD1-EXIT.                                                       01161000
011620     EXIT.                                                        01162000
011630******************************************************************01163000
011640 CALL-BISPAN-RPV310 SECTION.                                      01164000
011650 CBD2-START.                                                      01165000
011660     MOVE PDB-RPV310-NAME TO PAN-NAME.                            01166000
011670     CALL 'BISPAN' USING                                          01167000
011680         BICRPSB,                                                 01168000
011690         BICRSRB,                                                 01169000
011700         BICRPAN,                                                 01170000
011710         RPV310-PANL-DATA-BLOCK,                                  01171000
011720         RPV310-PANL-DATA-AREA.                                   01172000
011730 CBD2-EXIT.                                                       01173000
011740     EXIT.                                                        01174000
011750******************************************************************01175000
011760 PANEL-GET-RPV310 SECTION.                                        01176000
011770 PANEL-GET-RPV310-START.                                          01177000
011780     MOVE 'N' TO RPV310-SW-SET-CURSOR.                            01178000
011790     MOVE PDB-RPV310-NAME TO PAN-NAME.                            01179000
011800     MOVE REQ-GET TO PAN-REQ-VERB.                                01180000
011810     CALL 'BISPAN' USING                                          01181000
011820         BICRPSB                                                  01182000
011830         BICRSRB                                                  01183000
011840         BICRPAN                                                  01184000
011850         RPV310-PANL-DATA-BLOCK,                                  01185000
011860         RPV310-PANL-DATA-AREA.                                   01186000
011870 PANEL-GET-RPV310-EXIT.                                           01187000
011880     EXIT.                                                        01188000
011890******************************************************************01189000
011900 PANEL-PUT-RPV310 SECTION.                                        01190000
011910 PANEL-PUT-RPV310-START.                                          01191000
011920     MOVE PDB-RPV310-NAME TO PAN-NAME.                            01192000
011930     MOVE REQ-PUT TO PAN-REQ-VERB.                                01193000
011940     CALL 'BISPAN' USING                                          01194000
011950         BICRPSB                                                  01195000
011960         BICRSRB                                                  01196000
011970         BICRPAN                                                  01197000
011980         RPV310-PANL-DATA-BLOCK,                                  01198000
011990         RPV310-PANL-DATA-AREA.                                   01199000
012000 PANEL-PUT-RPV310-EXIT.                                           01200000
012010     EXIT.                                                        01201000
012020******************************************************************01202000
012030 PANEL-GET-RPV310K SECTION.                                       01203000
012040 PANEL-GET-RPV310K-START.                                         01204000
012050     MOVE 'N' TO RPV310K-SW-SET-CURSOR.                           01205000
012060     MOVE PDB-RPV310K-NAME TO PAN-NAME.                           01206000
012070     MOVE REQ-GET TO PAN-REQ-VERB.                                01207000
012080     CALL 'BISPAN' USING                                          01208000
012090         BICRPSB                                                  01209000
012100         BICRSRB                                                  01210000
012110         BICRPAN                                                  01211000
012120         RPV310K-PANL-DATA-BLOCK,                                 01212000
012130         RPV310K-PANL-DATA-AREA.                                  01213000
012140 PANEL-GET-RPV310K-EXIT.                                          01214000
012150     EXIT.                                                        01215000
012160******************************************************************01216000
012170 PANEL-PUT-RPV310K SECTION.                                       01217000
012180 PANEL-PUT-RPV310K-START.                                         01218000
012190     MOVE PDB-RPV310K-NAME TO PAN-NAME.                           01219000
012200     MOVE REQ-PUT TO PAN-REQ-VERB.                                01220000
012210     CALL 'BISPAN' USING                                          01221000
012220         BICRPSB                                                  01222000
012230         BICRSRB                                                  01223000
012240         BICRPAN                                                  01224000
012250         RPV310K-PANL-DATA-BLOCK,                                 01225000
012260         RPV310K-PANL-DATA-AREA.                                  01226000
012270 PANEL-PUT-RPV310K-EXIT.                                          01227000
012280     EXIT.                                                        01228000
012290******************************************************************01229000
012300 PANEL-GET-OCCUR-RPV310 SECTION.                                  01230000
012310 PGORPV310-START.                                                 01231000
012320     MOVE PDB-RPV310-NAME TO PAN-NAME.                            01232000
012330     MOVE REQ-GET-OCCUR TO PAN-REQ-VERB.                          01233000
012340     CALL 'BISPAN' USING                                          01234000
012350         BICRPSB                                                  01235000
012360         BICRSRB                                                  01236000
012370         BICRPAN                                                  01237000
012380         RPV310-PANL-DATA-BLOCK,                                  01238000
012390         RPV310-PANL-DATA-AREA.                                   01239000
012400 PGORPV310-EXIT.                                                  01240000
012410     EXIT.                                                        01241000
012420******************************************************************01242000
012430 PANEL-PUT-OCCUR-RPV310 SECTION.                                  01243000
012440 PPORPV310-START.                                                 01244000
012450     MOVE PDB-RPV310-NAME TO PAN-NAME.                            01245000
012460     MOVE REQ-PUT-OCCUR TO PAN-REQ-VERB.                          01246000
012470     CALL 'BISPAN' USING                                          01247000
012480         BICRPSB                                                  01248000
012490         BICRSRB                                                  01249000
012500         BICRPAN                                                  01250000
012510         RPV310-PANL-DATA-BLOCK,                                  01251000
012520         RPV310-PANL-DATA-AREA.                                   01252000
012530 PPORPV310-EXIT.                                                  01253000
012540     EXIT.                                                        01254000
012550******************************************************************01255000
012560 MIC-MST-API SECTION.                                             01256000
000000 COPY MIPMSTA.                                                    01257000
012580******************************************************************01258000
012590 EDIT-ACCOUNT-KEY SECTION.                                        01259000
012600 EAK-START.                                                       01260000
012610     MOVE COM-INST TO RPW130-INST.                                01261000
012620     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 01262000
012630     MOVE COM-KEY-PRODCODE TO RPW130-PRODCODE.                    01263000
012640     MOVE COM-KEY-ACCOUNT TO RPW130-ACCOUNTINPUT.                 01264000
012650     MOVE 'V' TO RPW130-FUNCTION.                                 01265000
012660     PERFORM ACCOUNT-KEY-EDIT.                                    01266000
012670     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01267000
012680         MOVE '500003' TO WS-MSGNBR                               01268000
012690         GO TO EAK-EXIT.                                          01269000
012700     MOVE COM-KEY-PRODCODE TO COM-PRODCODE.                       01270000
012710     MOVE RPW130-ACCOUNTKEY TO COM-KEY-ACCOUNT.                   01271000
012720     MOVE RPW130-FORMATTEDACCT TO COM-KEY-FORMATTEDACCT.          01272000
012730     MOVE RPW130-2023INTAPPL211 TO COM-APPL.                      01273000
012740     MOVE RPW130-2023DIALOGROUT TO COM-DIALOGROUT.                01274000
012750 EAK-EXIT.                                                        01275000
012760     EXIT.                                                        01276000
012770******************************************************************01277000
012780 FORMAT-ACCOUNT-LEFTJUST SECTION.                                 01278000
000000 COPY RPP033.                                                     01279000
012800******************************************************************01280000
012810 ACCOUNT-KEY-EDIT SECTION.                                        01281000
000000 COPY RPP130.                                                     01282000
012830******************************************************************01283000
012840 LEFT-JUSTIFY SECTION.                                            01284000
000000 COPY SRP025.                                                     01285000
012860******************************************************************01286000
012870 RIGHT-JUSTIFY SECTION.                                           01287000
000000 COPY SRP026.                                                     01288000
012890******************************************************************01289000
012900 PARAMETER-SEARCH SECTION.                                        01290000
000000 COPY SRP030.                                                     01291000
012920******************************************************************01292000
012930 COMPRESS-NEXTKEY SECTION.                                        01293000
000000 COPY SRP070.                                                     01294000
012950******************************************************************01295000
012960 GET-MESSAGE SECTION.                                             01296000
000000 COPY SRP071.                                                     01297000
012980******************************************************************01298000
012990 EDIT-CODASYL-DATE SECTION.                                       01299000
000000 COPY SRP087.                                                     01300000
013010******************************************************************01301000
013020 EXAMINE-FIELD SECTION.                                           01302000
000000 COPY SRP166.                                                     01303000
013040******************************************************************01304000
013050 SRP170-ROUTINE SECTION.                                          01305000
000000 COPY SRP170.                                                     01306000
013070******************************************************************01307000
013080 BUILD-PFKEY-LINE SECTION.                                        01308000
000000 COPY SRP710.                                                     01309000
013100******************************************************************01310000
013110 VALIDATE-PFKEYS SECTION.                                         01311000
000000 COPY SRP711.                                                     01312000
013130******************************************************************01313000
013140 SLP096-GET-2023-RECORD SECTION.                                  01314000
000000 COPY SLP096.                                                     01315000
013160******************************************************************01316000
013170 CICS-XCTL SECTION.                                               01317000
000000 COPY SLP704.                                                     01318000
013190******************************************************************01319000
013200 CICS-RETURN-TRANSID SECTION.                                     01320000
000000 COPY SLP710.                                                     01321000
013220******************************************************************01322000
013230 TSQ-DELETE SECTION.                                              01323000
013240 TSQD-START.                                                      01324000
013250 TSQD-EXIT.                                                       01325000
013260     EXIT.                                                        01326000
013270******************************************************************01327000
013280 CICS-TSQ-READ SECTION.                                           01328000
000000 COPY SLP744.                                                     01329000
013300******************************************************************01330000
013310 CICS-ABORT-EXIT SECTION.                                         01331000
000000 COPY SLP798.                                                     01332000
013330******************************************************************01333000
