000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLACT00.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLACT00 - ACCOUNT INCENTIVE PROFILE MODULE                 *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000110 01  WS-COPYRIGHT                PIC X(57)       VALUE            00011000
000120     'COPYRIGHT(C) 2017 INFOR. ALL RIGHTS RESERVED.            '. 00012000
000130 01  RPS-RLSELIT.                                                 00013000
000000 COPY RPWRLSE.                                                    00014000
000150 01  MIC-RLSELIT.                                                 00015000
000000 COPY MIWRLSE.                                                    00016000
000170 01  MIWMSTA-AREAS.                                               00017000
000000 COPY MIWMSTA.                                                    00018000
000190 01  SRW105-AREAS.                                                00019000
000000 COPY SRW105.                                                     00020000
000210*01  BICRSRB.                                                     00021000
000000 COPY BICRSRB.                                                    00022000
000230*01  BICRPSB.                                                     00023000
000000 COPY BICRPSB.                                                    00024000
000250*01  BICRVERB.                                                    00025000
000000 COPY BICRVERB.                                                   00026000
000270*01  BICRSTAT.                                                    00027000
000000 COPY BICRSTAT.                                                   00028000
000290*01  BICRDBS.                                                     00029000
000000 COPY BICRDBS.                                                    00030000
000310*01  BICRLOG.                                                     00031000
000000 COPY BICRLOG.                                                    00032000
000330 01  SRW710-AREAS.                                                00033000
000000 COPY SRW710.                                                     00034000
000350 01  WS-WORKAREAS.                                                00035000
000360     03  COM-ABORT               PIC S9(04)      COMP.            00036000
000370     03  WS-SUB1                 PIC S9(04)      COMP             00037000
000380                                                 VALUE ZEROS.     00038000
000390     03  WS-SUB2                 PIC S9(04)      COMP             00039000
000400                                                 VALUE ZEROS.     00040000
000410*----------------------------------------------------------------*00041000
000420 01  MIWPRI-AREAS.                                                00042000
000000 COPY MIWPRI.                                                     00043000
000440 01  MIMST-RECORD.                                                00044000
000000 COPY MISMST.                                                     00045000
000460*----------------------------------------------------------------*00046000
000470 01  RPWPRI-AREAS.                                                00047000
000000 COPY RPWPRI.                                                     00048000
000490 01  RPWACT-AREA.                                                 00049000
000000 COPY RPWACTA.                                                    00050000
000510 01  RPACT-RECORD.                                                00051000
000000 COPY RPSACT.                                                     00052000
000530*----------------------------------------------------------------*00053000
000540 01  WS-LKLGTH                   PIC S9(04)      COMP             00054000
000550                                                 VALUE +4088.     00055000
000560 01  WS-LKAREA                   PIC X(4088).                     00056000
000570 01  WS-TRACECODES.                                               00057000
000580     03  WS-TR0001               PIC S9(04)      COMP             00058000
000590                                                 VALUE +0001.     00059000
000600     03  WS-TR0002               PIC S9(04)      COMP             00060000
000610                                                 VALUE +0002.     00061000
000620     03  WS-TR0003               PIC S9(04)      COMP             00062000
000630                                                 VALUE +0003.     00063000
000640 01  WS-ABORTCODES.                                               00064000
000650     03  WS-AB2000               PIC S9(04)      COMP             00065000
000660                                                 VALUE +2000.     00066000
000670     03  WS-AB2033               PIC S9(04)      COMP             00067000
000680                                                 VALUE +2033.     00068000
000690     03  WS-AB6300               PIC S9(04)      COMP             00069000
000700                                                 VALUE +6300.     00070000
000710******************************************************************00071000
000720 LINKAGE SECTION.                                                 00072000
000730 01  DFHCOMMAREA.                                                 00073000
000000 COPY MISCNT00      REPLACING                                     00074000
000750             ==:MICNT:== BY ==RPACT00==.                          00075000
000000 COPY RPSACT00.                                                   00076000
000770******************************************************************00077000
000780 PROCEDURE DIVISION.                                              00078000
000790******************************************************************00079000
000800 ENTRY-ROUTINE SECTION.                                           00080000
000810 ER-START.                                                        00081000
000820     MOVE 'RPLACT00' TO SR-APIPROGLIT.                            00082000
000830     PERFORM CICS-HANDLE-CONDITION.                               00083000
000840     IF EIBCALEN IS EQUAL TO +0                                   00084000
000850         MOVE WS-AB2000 TO RPACT00-ABORT                          00085000
000860         MOVE WS-TR0001 TO RPACT00-ABTRACE                        00086000
000870         GO TO CICS-RETURN.                                       00087000
000880     MOVE 'RPLACT00' TO RPACT00-ABPROGID.                         00088000
000890     MOVE ZERO TO RPACT00-MSGNBR.                                 00089000
000900     MOVE SPACE TO WS-FUNCTION.                                   00090000
000910     MOVE RPACT00-FILEOPTS TO WS-FILEOPTS.                        00091000
000920     MOVE RPACT00-OPERID TO WS-UPD-USER.                          00092000
000000 COPY SLP094.                                                     00093000
000940     GO TO VERIFY-KEY.                                            00094000
000950 ER-EXIT.                                                         00095000
000960     EXIT.                                                        00096000
000970******************************************************************00097000
000980 CICS-HANDLE-CONDITION SECTION.                                   00098000
000000 COPY SLP702.                                                     00099000
001000     MOVE WS-AB2033 TO RPACT00-ABORT.                             00100000
001010     MOVE WS-TR0002 TO RPACT00-ABTRACE.                           00101000
001020     GO TO CICS-RETURN.                                           00102000
001030 CHC-EXIT.                                                        00103000
001040     EXIT.                                                        00104000
001050******************************************************************00105000
001060 VERIFY-KEY SECTION.                                              00106000
001070 VK-START.                                                        00107000
001080     MOVE ZERO TO RPACT00-ABORT.                                  00108000
001090     MOVE ZERO TO COM-ABORT.                                      00109000
001100 VK-ACT.                                                          00110000
001110     MOVE RPACT00-KEY-RECORD TO RPACT-GRP-KEY.                    00111000
001120     PERFORM RPS-ACT-GET-REQUEST.                                 00112000
001130     MOVE WS-FUNCTION TO RPACT00-FUNCTION.                        00113000
001140     IF WS-FUNCTION IS EQUAL TO 'N'                               00114000
001150         MOVE 500004 TO RPACT00-MSGNBR                            00115000
001160         GO TO VK-RETURN.                                         00116000
001170     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00117000
001180         MOVE WS-AB6300 TO RPACT00-ABORT                          00118000
001190         MOVE WS-TR0003 TO RPACT00-ABTRACE                        00119000
001200         GO TO VK-RETURN.                                         00120000
001210     MOVE RPACT-RECORD TO RPACT00-RECORD.                         00121000
001220     MOVE SPACES TO RPACT00-CUST-TYPE.                            00122000
001230     MOVE SPACES TO RPACT00-CUST-NAME.                            00123000
001240     GO TO CICS-RETURN.                                           00124000
001250 VK-RETURN.                                                       00125000
001260     MOVE 'E' TO RPACT00-RETURN.                                  00126000
001270     GO TO CICS-RETURN.                                           00127000
001280 VK-EXIT.                                                         00128000
001290     EXIT.                                                        00129000
001300******************************************************************00130000
001310 CICS-LINK-PROGRAM SECTION.                                       00131000
000000 COPY SLP707.                                                     00132000
001330******************************************************************00133000
000000 COPY RPPACTA.                                                    00134000
001350******************************************************************00135000
001360 MIC-MST-API SECTION.                                             00136000
000000 COPY MIPMSTA.                                                    00137000
001380******************************************************************00138000
001390 CICS-ABORT-EXIT SECTION.                                         00139000
001400 CAE-START.                                                       00140000
001410     GO TO CICS-RETURN.                                           00141000
001420 CAE-EXIT.                                                        00142000
001430     EXIT.                                                        00143000
001440******************************************************************00144000
001450 CICS-RETURN SECTION.                                             00145000
001460     IF COM-ABORT IS NOT EQUAL TO ZERO                            00146000
001470         MOVE COM-ABORT TO RPACT00-ABORT.                         00147000
001480     IF RPACT00-ABORT IS NOT EQUAL TO ZERO                        00148000
001490         MOVE SRB-BMDB TO RPACT00-SRBMDB                          00149000
001500         MOVE EIBFN TO RPACT00-ABEIBFN                            00150000
001510         MOVE EIBRESP TO RPACT00-ABEIBRESP                        00151000
001520         MOVE EIBRESP2 TO RPACT00-ABEIBRESP2                      00152000
001530         MOVE EIBRCODE TO RPACT00-ABEIBRCODE.                     00153000
001540     MOVE WS-FUNCTION TO RPACT00-FUNCTION.                        00154000
001550     IF RPACT00-ABTYPE IS NOT EQUAL TO 'Y'                        00155000
001560         PERFORM GLOBAL-CLOSE.                                    00156000
000000 COPY SLP709.                                                     00157000
001580******************************************************************00158000
001590 GLOBAL-CLOSE SECTION.                                            00159000
001600 GC-START.                                                        00160000
001610     IF RPACT00-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  00161000
001620         PERFORM RPS-ACT-GLOBAL-CLOSE-REQUEST.                    00162000
001630 GC-EXIT.                                                         00163000
001640     EXIT.                                                        00164000
001650******************************************************************00165000
