000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLSEC00.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLSEC00 - RELATIONSHIP PROFILE MODULE                      *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW105-AREAS.                                                00016000
000000 COPY SRW105.                                                     00017000
000180*01  BICRSRB.                                                     00018000
000000 COPY BICRSRB.                                                    00019000
000200*01  BICRPSB.                                                     00020000
000000 COPY BICRPSB.                                                    00021000
000220*01  BICRVERB.                                                    00022000
000000 COPY BICRVERB.                                                   00023000
000240*01  BICRSTAT.                                                    00024000
000000 COPY BICRSTAT.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRLOG.                                                     00028000
000000 COPY BICRLOG.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  WS-WORKAREAS.                                                00032000
000330     03  WS-MAX-PANEL-ENTRIES    PIC S9(04)      COMP             00033000
000340                                                 VALUE +0002.     00034000
000350     03  COM-ABORT               PIC S9(04)      COMP.            00035000
000360     03  WS-SUB1                 PIC S9(04)      COMP             00036000
000370                                                 VALUE +0000.     00037000
000380     03  WS-SUB2                 PIC S9(04)      COMP             00038000
000390                                                 VALUE +0000.     00039000
000400     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00040000
000410     03  FILLER          REDEFINES WS-CURDATE.                    00041000
000420         05  WS-CURMM            PIC 9(02).                       00042000
000430         05  WS-CURDD            PIC 9(02).                       00043000
000440         05  WS-CURYYYY          PIC 9(04).                       00044000
000450     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00045000
000460     03  FILLER          REDEFINES WS-PDATE.                      00046000
000470         05  WS-PDATE-YYYY       PIC 9(04).                       00047000
000480         05  WS-PDATE-MM         PIC 9(02).                       00048000
000490         05  WS-PDATE-DD         PIC 9(02).                       00049000
000500     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00050000
000510     03  FILLER          REDEFINES WS-PDATE2.                     00051000
000520         05  WS-PDATE2-YYYY      PIC 9(04).                       00052000
000530         05  WS-PDATE2-MM        PIC 9(02).                       00053000
000540         05  WS-PDATE2-DD        PIC 9(02).                       00054000
000550     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00055000
000560                                                 VALUE ZERO.      00056000
000570     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00057000
000580                                                 VALUE ZERO.      00058000
000590*----------------------------------------------------------------*00059000
000600 01  MIWPRI-AREAS.                                                00060000
000000 COPY MIWPRI.                                                     00061000
000620 01  MIWMSTA-AREAS.                                               00062000
000000 COPY MIWMSTA.                                                    00063000
000640 01  MIMST-RECORD.                                                00064000
000000 COPY MISMST.                                                     00065000
000660 01  MI7100-RECORD.                                               00066000
000000 COPY MIS7100.                                                    00067000
000680 01  MI7101-RECORD.                                               00068000
000000 COPY MIS7101.                                                    00069000
000700*----------------------------------------------------------------*00070000
000710 01  RPWPRI-AREAS.                                                00071000
000000 COPY RPWPRI.                                                     00072000
000730 01  RPWEVT-AREA.                                                 00073000
000000 COPY RPWEVTA.                                                    00074000
000750 01  RPEVT-RECORD.                                                00075000
000000 COPY RPSEVT.                                                     00076000
000770 01  RPWMST-AREA.                                                 00077000
000000 COPY RPWMSTA.                                                    00078000
000790 01  RPMST-RECORD.                                                00079000
000000 COPY RPSMST.                                                     00080000
000810 01  RPWREL-AREA.                                                 00081000
000000 COPY RPWRELA.                                                    00082000
000830 01  RPREL-RECORD.                                                00083000
000000 COPY RPSREL.                                                     00084000
000850 01  RPWSEC-AREA.                                                 00085000
000000 COPY RPWSECA.                                                    00086000
000870 01  RPSEC-RECORD.                                                00087000
000000 COPY RPSSEC.                                                     00088000
000890 01  RPRF21-MESSAGE.                                              00089000
000000 COPY MISCNT00      REPLACING                                     00090000
000910             ==:MICNT:== BY ==RPRF21==.                           00091000
000000 COPY RPSRF21.                                                    00092000
000930 01  WS-TRACECODES.                                               00093000
000940     03  WS-TR0001               PIC S9(04)      COMP             00094000
000950                                                 VALUE +0001.     00095000
000960     03  WS-TR0002               PIC S9(04)      COMP             00096000
000970                                                 VALUE +0002.     00097000
000980     03  WS-TR0003               PIC S9(04)      COMP             00098000
000990                                                 VALUE +0003.     00099000
001000     03  WS-TR0004               PIC S9(04)      COMP             00100000
001010                                                 VALUE +0004.     00101000
001020     03  WS-TR0005               PIC S9(04)      COMP             00102000
001030                                                 VALUE +0005.     00103000
001040     03  WS-TR0006               PIC S9(04)      COMP             00104000
001050                                                 VALUE +0006.     00105000
001060     03  WS-TR0007               PIC S9(04)      COMP             00106000
001070                                                 VALUE +0007.     00107000
001080 01  WS-ABORTCODES.                                               00108000
001090     03  WS-AB2000               PIC S9(04)      COMP             00109000
001100                                                 VALUE +2000.     00110000
001110     03  WS-AB2033               PIC S9(04)      COMP             00111000
001120                                                 VALUE +2033.     00112000
001130     03  WS-AB3051               PIC S9(04)      COMP             00113000
001140                                                 VALUE +3051.     00114000
001150     03  WS-AB6320               PIC S9(04)      COMP             00115000
001160                                                 VALUE +6320.     00116000
001170     03  WS-AB6330               PIC S9(04)      COMP             00117000
001180                                                 VALUE +6330.     00118000
001190     03  WS-AB6335               PIC S9(04)      COMP             00119000
001200                                                 VALUE +6335.     00120000
001210     03  WS-AB6360               PIC S9(04)      COMP             00121000
001220                                                 VALUE +6360.     00122000
001230******************************************************************00123000
001240 LINKAGE SECTION.                                                 00124000
001250 01  DFHCOMMAREA.                                                 00125000
000000 COPY MISCNT00      REPLACING                                     00126000
001270             ==:MICNT:== BY ==RPSEC00==.                          00127000
000000 COPY RPSSEC00.                                                   00128000
001290******************************************************************00129000
001300 PROCEDURE DIVISION.                                              00130000
001310******************************************************************00131000
001320 ENTRY-ROUTINE SECTION.                                           00132000
001330 ER-START.                                                        00133000
001340     MOVE 'RPLSEC00' TO SR-APIPROGLIT.                            00134000
001350     MOVE 'RPLSEC00' TO RPSEC00-ABPROGID.                         00135000
001360     PERFORM CICS-HANDLE-CONDITION.                               00136000
001370     IF EIBCALEN IS EQUAL TO +0                                   00137000
001380         MOVE WS-AB2000 TO RPSEC00-ABORT                          00138000
001390         MOVE WS-TR0001 TO RPSEC00-ABTRACE                        00139000
001400         GO TO CICS-RETURN.                                       00140000
001410     MOVE ZERO TO RPSEC00-MSGNBR.                                 00141000
001420     MOVE SPACE TO WS-FUNCTION.                                   00142000
001430     MOVE RPSEC00-FILEOPTS TO WS-FILEOPTS.                        00143000
001440     MOVE RPSEC00-OPERID TO WS-UPD-USER.                          00144000
000000 COPY SLP094.                                                     00145000
001460     GO TO VERIFY-KEY.                                            00146000
001470 ER-EXIT.                                                         00147000
001480     EXIT.                                                        00148000
001490******************************************************************00149000
001500 CICS-HANDLE-CONDITION SECTION.                                   00150000
000000 COPY SLP702.                                                     00151000
001520     MOVE WS-AB2033 TO RPSEC00-ABORT.                             00152000
001530     MOVE WS-TR0002 TO RPSEC00-ABTRACE.                           00153000
001540     GO TO CICS-RETURN.                                           00154000
001550 CHC-EXIT.                                                        00155000
001560     EXIT.                                                        00156000
001570******************************************************************00157000
001580 VERIFY-KEY SECTION.                                              00158000
001590 VK-START.                                                        00159000
001600     MOVE ZERO TO COM-ABORT.                                      00160000
001610     MOVE ZERO TO RPSEC00-ABORT.                                  00161000
001620     MOVE ZERO TO RPSEC00-OCCUR.                                  00162000
001630     MOVE RPSEC00-DATE TO WS-CURDATE.                             00163000
001640     MOVE WS-CURMM TO WS-PDATE-MM.                                00164000
001650     MOVE WS-CURDD TO WS-PDATE-DD.                                00165000
001660     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00166000
001670     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00167000
001680     MOVE +0001 TO WS-SUB1.                                       00168000
001690 VK-SEC.                                                          00169000
001700     INITIALIZE RPSEC-RECORD.                                     00170000
001710     MOVE RPSEC00-KEY-RECORD TO RPSEC-GRP-KEY.                    00171000
001720     PERFORM RPS-SEC-GET-GE-REQUEST.                              00172000
001730     IF WS-FUNCTION IS EQUAL TO 'E'                               00173000
001740         MOVE 500004 TO RPSEC00-MSGNBR                            00174000
001750         GO TO VK-RETURN.                                         00175000
001760     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00176000
001770         MOVE WS-AB6335 TO RPSEC00-ABORT                          00177000
001780         MOVE WS-TR0003 TO RPSEC00-ABTRACE                        00178000
001790         GO TO VK-RETURN.                                         00179000
001800     IF RPSEC-ACCT1-GRP IS NOT EQUAL TO RPSEC00-KEY-ACCT1-GRP     00180000
001810         MOVE 500004 TO RPSEC00-MSGNBR                            00181000
001820         GO TO VK-RETURN.                                         00182000
001830 VK-REL.                                                          00183000
001840     INITIALIZE RPREL-RECORD.                                     00184000
001850     IF RPSEC-INST2 IS EQUAL TO ZEROS                             00185000
001860         MOVE RPSEC-INST TO RPREL-INST                            00186000
001870         MOVE RPSEC-PRODCODE TO RPREL-PRODCODE                    00187000
001880         MOVE RPSEC-ACCOUNT TO RPREL-ACCOUNT                      00188000
001890         MOVE RPSEC-MODEL2 TO RPREL-MODEL                         00189000
001900         MOVE ZEROS TO RPREL-INST2                                00190000
001910         MOVE SPACES TO RPREL-PRODCODE2                           00191000
001920         MOVE SPACES TO RPREL-ACCOUNT2                            00192000
001930     ELSE                                                         00193000
001940         MOVE RPSEC-ACCT2-GRP TO RPREL-ACCT1-GRP                  00194000
001950         MOVE RPSEC-ACCT1-GRP TO RPREL-ACCT2-GRP.                 00195000
001960     PERFORM RPS-REL-GET-REQUEST.                                 00196000
001970     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00197000
001980         MOVE WS-AB6330 TO RPSEC00-ABORT                          00198000
001990         MOVE WS-TR0004 TO RPSEC00-ABTRACE                        00199000
002000         GO TO VK-RETURN.                                         00200000
002010     MOVE RPREL-SC-INC-OPTION TO RPSEC00-SC-OPTION.               00201000
002020     MOVE RPREL-RATE-INC-OPTION TO RPSEC00-RATE-OPTION.           00202000
002030 VK-MST.                                                          00203000
002040     INITIALIZE RPMST-RECORD.                                     00204000
002050     MOVE RPSEC-INST2 TO RPMST-INST.                              00205000
002060     MOVE RPSEC-PRODCODE2 TO RPMST-PRODCODE.                      00206000
002070     MOVE RPSEC-ACCOUNT2 TO RPMST-ACCOUNT.                        00207000
002080     MOVE RPSEC-MODEL2 TO RPMST-MODEL.                            00208000
002090     IF RPSEC-INST2 IS NOT GREATER THAN ZEROS                     00209000
002100         MOVE RPSEC-INST TO RPMST-INST                            00210000
002110         MOVE RPSEC-PRODCODE TO RPMST-PRODCODE                    00211000
002120         MOVE RPSEC-ACCOUNT TO RPMST-ACCOUNT.                     00212000
002130     PERFORM RPS-MST-GET-REQUEST.                                 00213000
002140     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00214000
002150         MOVE WS-AB6320 TO RPSEC00-ABORT                          00215000
002160         MOVE WS-TR0005 TO RPSEC00-ABTRACE                        00216000
002170         GO TO VK-RETURN.                                         00217000
002180     MOVE RPMST-REL-STAT TO RPSEC00-REL-STATUS.                   00218000
002190 VK-7100.                                                         00219000
002200     PERFORM READ-MICM-7100.                                      00220000
002210     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00221000
002220         MOVE 500005 TO RPSEC00-MSGNBR                            00222000
002230         GO TO VK-RETURN.                                         00223000
002240 VK-7101.                                                         00224000
002250     MOVE SPACES TO MI7101-RECORD.                                00225000
002260     MOVE RPMST-INST TO MIM-7101KINST.                            00226000
002270     MOVE +7101 TO MIM-7101KREC.                                  00227000
002280     MOVE RPREL-MODEL TO MIM-7101KMODEL.                          00228000
002290     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        00229000
002300     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00230000
002310     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00231000
002320     MOVE MI7101-RECORD TO MIMST-RECORD.                          00232000
002330     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00233000
002340     MOVE MIMST-RECORD TO MI7101-RECORD.                          00234000
002350     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00235000
002360         MOVE 500006 TO RPSEC00-MSGNBR                            00236000
002370         GO TO VK-RETURN.                                         00237000
002380     IF MIM-7101KINST IS NOT EQUAL TO RPMST-INST                  00238000
002390         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00239000
002400         OR MIM-7101KMODEL IS NOT EQUAL TO RPREL-MODEL            00240000
002410         MOVE 500006 TO RPSEC00-MSGNBR                            00241000
002420         GO TO VK-RETURN.                                         00242000
002430     MOVE MIM-7101DESC TO RPSEC00-MODEL-DESC.                     00243000
002440 VK-EVT.                                                          00244000
002450     IF MIM-7100EVENTHISTORYOPT IS NOT EQUAL TO 'Y'               00245000
002460         GO TO VK-NAME.                                           00246000
002470     PERFORM GET-LAST-EVENT-DATE.                                 00247000
002480     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00248000
002490         GO TO VK-RETURN.                                         00249000
002500 VK-NAME.                                                         00250000
002510     MOVE SPACES TO RPRF21-FUNCTION.                              00251000
002520     PERFORM REQUEST-CUSTOMER.                                    00252000
002530     IF WS-FUNCTION IS EQUAL TO SPACES                            00253000
002540         GO TO VK-SECNEXT.                                        00254000
002550     IF RPSEC00-MSGNBR IS EQUAL TO ZEROS                          00255000
002560         MOVE 500016 TO RPSEC00-MSGNBR.                           00256000
002570     GO TO VK-RETURN.                                             00257000
002580 VK-LOOP.                                                         00258000
002590     ADD +0001 TO WS-SUB1.                                        00259000
002600 VK-READ-NEXT.                                                    00260000
002610     PERFORM RPS-SEC-GET-NEXT-REQUEST.                            00261000
002620     IF WS-FUNCTION IS EQUAL TO 'E'                               00262000
002630         GO TO VK-END.                                            00263000
002640     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00264000
002650         MOVE WS-AB6335 TO RPSEC00-ABORT                          00265000
002660         MOVE WS-TR0006 TO RPSEC00-ABTRACE                        00266000
002670         GO TO VK-RETURN.                                         00267000
002680     IF RPSEC-ACCT1-GRP IS NOT EQUAL TO RPSEC00-KEY-ACCT1-GRP     00268000
002690         GO TO VK-END.                                            00269000
002700 VK-SECNEXT.                                                      00270000
002710     IF WS-SUB1 IS GREATER THAN WS-MAX-PANEL-ENTRIES              00271000
002720         GO TO VK-END.                                            00272000
002730     MOVE RPSEC-RECORD TO RPSEC00-RECORD (WS-SUB1).               00273000
002740     ADD +1 TO RPSEC00-OCCUR.                                     00274000
002750     GO TO VK-LOOP.                                               00275000
002760 VK-RETURN.                                                       00276000
002770     MOVE 'E' TO RPSEC00-RETURN.                                  00277000
002780 VK-END.                                                          00278000
002790     PERFORM SET-RPSEC00-RETURN.                                  00279000
002800     GO TO CICS-RETURN.                                           00280000
002810 VK-EXIT.                                                         00281000
002820     EXIT.                                                        00282000
002830******************************************************************00283000
002840 GET-LAST-EVENT-DATE SECTION.                                     00284000
002850 GLED-START.                                                      00285000
002860     MOVE ZEROS TO RPSEC00-LAST-EVENT-DATE.                       00286000
002870     MOVE LOW-VALUES TO RPEVT-GRP-KEY.                            00287000
002880     MOVE RPSEC-ACCT1-GRP TO RPEVT-ACCT1-GRP.                     00288000
002890     PERFORM RPS-EVT-GET-GE-REQUEST.                              00289000
002900     GO TO GLED-PROCESS.                                          00290000
002910 GLED-READ-NEXT.                                                  00291000
002920     PERFORM RPS-EVT-GET-NEXT-REQUEST.                            00292000
002930 GLED-PROCESS.                                                    00293000
002940     IF WS-FUNCTION IS EQUAL TO 'E'                               00294000
002950         MOVE SPACES TO WS-FUNCTION                               00295000
002960         GO TO GLED-EXIT.                                         00296000
002970     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00297000
002980         MOVE WS-AB6360 TO RPSEC00-ABORT                          00298000
002990         MOVE WS-TR0007 TO RPSEC00-ABTRACE                        00299000
003000         GO TO GLED-EXIT.                                         00300000
003010     IF RPSEC-ACCT1-GRP IS NOT EQUAL TO RPEVT-ACCT1-GRP           00301000
003020         GO TO GLED-EXIT.                                         00302000
003030     IF RPSEC-ACCT2-GRP IS NOT EQUAL TO RPEVT-ACCT2-GRP           00303000
003040         GO TO GLED-READ-NEXT.                                    00304000
003050     MOVE RPEVT-DATE TO RPSEC00-LAST-EVENT-DATE.                  00305000
003060     GO TO GLED-READ-NEXT.                                        00306000
003070 GLED-EXIT.                                                       00307000
003080     EXIT.                                                        00308000
003090******************************************************************00309000
003100 REQUEST-CUSTOMER SECTION.                                        00310000
003110 RC-START.                                                        00311000
003120     MOVE 'A' TO RPRF21-FUNC.                                     00312000
003130     MOVE RPREL-INST TO RPRF21-BASE-ACCT-INST.                    00313000
003140     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00314000
003150         AND MIM-7100ENTERPRISEINST IS GREATER THAN ZEROS         00315000
003160         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00316000
003170     MOVE RPREL-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.            00317000
003180     MOVE RPREL-ACCOUNT TO RPRF21-BASE-ACCT.                      00318000
003190     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             00319000
003200     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         00320000
003210     EXEC CICS LINK                                               00321000
003220         PROGRAM('RPO0RF21')                                      00322000
003230         COMMAREA(RPRF21-MESSAGE)                                 00323000
003240         LENGTH(LENGTH OF RPRF21-MESSAGE)                         00324000
003250         RESP(WS-CICS-RESPONSE)                                   00325000
003260         END-EXEC.                                                00326000
003270     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         00327000
003280     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00328000
003290         MOVE 'L' TO WS-FUNCTION                                  00329000
003300         MOVE 500036 TO RPSEC00-MSGNBR                            00330000
003310         GO TO RC-EXIT.                                           00331000
003320     IF WS-FUNCTION IS EQUAL TO 'B'                               00332000
003330         MOVE SPACE TO WS-FUNCTION                                00333000
003340         MOVE 500045 TO RPSEC00-MSGNBR                            00334000
003350         GO TO RC-END.                                            00335000
003360     IF WS-FUNCTION IS EQUAL TO 'C'                               00336000
003370         MOVE 500037 TO RPSEC00-MSGNBR                            00337000
003380         GO TO RC-EXIT.                                           00338000
003390     IF WS-FUNCTION IS EQUAL TO 'I'                               00339000
003400         MOVE 500038 TO RPSEC00-MSGNBR.                           00340000
003410 RC-END.                                                          00341000
003420     MOVE RPRF21-BASE-CUST-TYPE TO RPSEC00-CUST-TYPE.             00342000
003430     MOVE RPRF21-NAME TO RPSEC00-CUST-NAME.                       00343000
003440 RC-EXIT.                                                         00344000
003450     EXIT.                                                        00345000
003460******************************************************************00346000
003470 SET-RPSEC00-RETURN SECTION.                                      00347000
003480 SCR-START.                                                       00348000
003490     IF RPSEC00-OCCUR IS EQUAL TO ZERO                            00349000
003500         MOVE '1' TO RPSEC00-SELECT-RTN                           00350000
003510         GO TO SCR-EXIT.                                          00351000
003520     IF RPSEC00-OCCUR IS LESS THAN WS-MAX-PANEL-ENTRIES           00352000
003530         MOVE '2' TO RPSEC00-SELECT-RTN                           00353000
003540         GO TO SCR-EXIT.                                          00354000
003550     IF RPSEC00-OCCUR IS GREATER THAN WS-MAX-PANEL-ENTRIES        00355000
003560         OR RPSEC00-OCCUR IS EQUAL TO WS-MAX-PANEL-ENTRIES        00356000
003570         MOVE '3' TO RPSEC00-SELECT-RTN.                          00357000
003580 SCR-EXIT.                                                        00358000
003590     EXIT.                                                        00359000
003600******************************************************************00360000
003610 READ-MICM-7100 SECTION.                                          00361000
003620 RM7100-START.                                                    00362000
003630     MOVE SPACES TO WS-FUNCTION.                                  00363000
003640     MOVE SPACES TO MI7100-RECORD.                                00364000
003650     MOVE RPMST-INST TO MIM-7100KINST.                            00365000
003660 RM7100-LOOP.                                                     00366000
003670     MOVE +7100 TO MIM-7100KREC.                                  00367000
003680     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00368000
003690     MOVE MI7100-RECORD TO MIMST-RECORD.                          00369000
003700     PERFORM MIC-MST-GET-REQUEST.                                 00370000
003710     MOVE MIMST-RECORD TO MI7100-RECORD.                          00371000
003720     IF WS-FUNCTION IS EQUAL TO 'N'                               00372000
003730         AND MIM-7100KINST IS GREATER THAN ZEROS                  00373000
003740         GO TO RM7100-ZERO.                                       00374000
003750     GO TO RM7100-EXIT.                                           00375000
003760 RM7100-ZERO.                                                     00376000
003770     MOVE SPACES TO MI7100-RECORD.                                00377000
003780     MOVE ZEROS TO MIM-7100KINST.                                 00378000
003790     GO TO RM7100-LOOP.                                           00379000
003800 RM7100-EXIT.                                                     00380000
003810     EXIT.                                                        00381000
003820******************************************************************00382000
003830 MIC-MST-API SECTION.                                             00383000
000000 COPY MIPMSTA.                                                    00384000
003850******************************************************************00385000
000000 COPY RPPEVTA.                                                    00386000
003870******************************************************************00387000
000000 COPY RPPMSTA.                                                    00388000
003890******************************************************************00389000
000000 COPY RPPRELA.                                                    00390000
003910******************************************************************00391000
000000 COPY RPPSECA.                                                    00392000
003930******************************************************************00393000
003940 CICS-ABORT-EXIT SECTION.                                         00394000
003950 CAE-START.                                                       00395000
003960     GO TO CICS-RETURN.                                           00396000
003970 CAE-EXIT.                                                        00397000
003980     EXIT.                                                        00398000
003990******************************************************************00399000
004000 CICS-RETURN SECTION.                                             00400000
004010     IF COM-ABORT IS NOT EQUAL TO ZERO                            00401000
004020         MOVE COM-ABORT TO RPSEC00-ABORT.                         00402000
004030     IF RPSEC00-ABORT IS NOT EQUAL TO ZERO                        00403000
004040         MOVE SRB-BMDB TO RPSEC00-SRBMDB                          00404000
004050         MOVE EIBFN TO RPSEC00-ABEIBFN                            00405000
004060         MOVE EIBRESP TO RPSEC00-ABEIBRESP                        00406000
004070         MOVE EIBRESP2 TO RPSEC00-ABEIBRESP2                      00407000
004080         MOVE EIBRCODE TO RPSEC00-ABEIBRCODE.                     00408000
004090     MOVE WS-FUNCTION TO RPSEC00-FUNCTION.                        00409000
004100     IF RPSEC00-ABTYPE IS NOT EQUAL TO 'Y'                        00410000
004110         PERFORM GLOBAL-CLOSE.                                    00411000
000000 COPY SLP709.                                                     00412000
004130******************************************************************00413000
004140 GLOBAL-CLOSE SECTION.                                            00414000
004150 GC-START.                                                        00415000
004160     IF RPSEC00-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  00416000
004170         PERFORM RPS-SEC-GLOBAL-CLOSE-REQUEST.                    00417000
004180 GC-EXIT.                                                         00418000
004190     EXIT.                                                        00419000
004200******************************************************************00420000
