000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX33.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX33 - REAL TIME RELATIONSHIP ENROLLMENT MODULE         *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW079-AREAS.                                                00016000
000000 COPY SRW079.                                                     00017000
000180 01  SRW105-AREAS.                                                00018000
000000 COPY SRW105.                                                     00019000
000200*01  BICRSRB.                                                     00020000
000000 COPY BICRSRB.                                                    00021000
000220*01  BICRPSB.                                                     00022000
000000 COPY BICRPSB.                                                    00023000
000240*01  BICRVERB.                                                    00024000
000000 COPY BICRVERB.                                                   00025000
000260*01  BICRSTAT.                                                    00026000
000000 COPY BICRSTAT.                                                   00027000
000280*01  BICRDBS.                                                     00028000
000000 COPY BICRDBS.                                                    00029000
000300*01  BICRLOG.                                                     00030000
000000 COPY BICRLOG.                                                    00031000
000320*----------------------------------------------------------------*00032000
000330 01  SRW096-AREAS.                                                00033000
000000 COPY SLW096.                                                     00034000
000350 01  SRW710-AREAS.                                                00035000
000000 COPY SRW710.                                                     00036000
000370*----------------------------------------------------------------*00037000
000380 01  MIWPRI-AREAS.                                                00038000
000000 COPY MIWPRI.                                                     00039000
000400 01  MIWMSTA-AREAS.                                               00040000
000000 COPY MIWMSTA.                                                    00041000
000420 01  MIMST-RECORD.                                                00042000
000000 COPY MISMST.                                                     00043000
000440 01  WS-RPMIM2023AREAS.                                           00044000
000000 COPY RPW2023.                                                    00045000
000460 01  MI2023-RECORD.                                               00046000
000000 COPY MIS2023A.                                                   00047000
000480 01  MI7100-RECORD.                                               00048000
000000 COPY MIS7100.                                                    00049000
000500*01  MI7101-RECORD.                                               00050000
000510*++IMBED  MIS7101   COBOL     *  - PD=RP  RL=50  RP=N  SP=N       00051000
000520*01  MI7102-RECORD.                                               00052000
000530*++IMBED  MIS7102   COBOL     *  - PD=RP  RL=50  RP=N  SP=N       00053000
000540*----------------------------------------------------------------*00054000
000550 01  RPWPRI-AREAS.                                                00055000
000000 COPY RPWPRI.                                                     00056000
000570 01  RPWACT-AREA.                                                 00057000
000000 COPY RPWACTA.                                                    00058000
000590 01  RPACT-RECORD.                                                00059000
000000 COPY RPSACT.                                                     00060000
000610 01  RPWBNK-AREAS.                                                00061000
000000 COPY RPWBNKA.                                                    00062000
000630 01  RPBNK-RECORD.                                                00063000
000000 COPY RPSBNK.                                                     00064000
000650 01  RPWCRW-AREA.                                                 00065000
000000 COPY RPWCRWA.                                                    00066000
000670 01  RPCRW-RECORD.                                                00067000
000000 COPY RPSCRW.                                                     00068000
000690 01  RPWIDX-AREA.                                                 00069000
000000 COPY RPWIDXA.                                                    00070000
000710 01  RPIDX-RECORD.                                                00071000
000000 COPY RPSIDX.                                                     00072000
000730 01  RPWMST-AREA.                                                 00073000
000000 COPY RPWMSTA.                                                    00074000
000750 01  RPMST-RECORD.                                                00075000
000000 COPY RPSMST.                                                     00076000
000770 01  RPWREL-AREA.                                                 00077000
000000 COPY RPWRELA.                                                    00078000
000790 01  RPREL-RECORD.                                                00079000
000000 COPY RPSREL.                                                     00080000
000810 01  RPWSEC-AREA.                                                 00081000
000000 COPY RPWSECA.                                                    00082000
000830 01  RPSEC-RECORD.                                                00083000
000000 COPY RPSSEC.                                                     00084000
000850 01  RPWTRMA-AREA.                                                00085000
000000 COPY RPWTRMA.                                                    00086000
000870 01  RPTRM-RECORD.                                                00087000
000000 COPY RPSTRM.                                                     00088000
000890 01  RPWEVTA-AREA.                                                00089000
000000 COPY RPWEVTA.                                                    00090000
000910 01  RPEVT-RECORD.                                                00091000
000000 COPY RPSEVT.                                                     00092000
000930 01  RPWENRA-AREA.                                                00093000
000000 COPY RPWENRA.                                                    00094000
000950 01  RPENR-RECORD.                                                00095000
000000 COPY RPSENR.                                                     00096000
000970*----------------------------------------------------------------*00097000
000980 01  WS-WORKAREAS.                                                00098000
000990     03  COM-ABORT               PIC S9(04)      COMP.            00099000
001000     03  WS-MAINPROGID           PIC X(08)       VALUE 'RPLXXX30'.00100000
001010     03  WS-ENROLLPROGID         PIC X(08)       VALUE 'RPLXXX33'.00101000
001020     03  WS-VALIDENROLL          PIC X(01)       VALUE 'N'.       00102000
001030     03  WS-EXPIRED-STATUS       PIC X(01)       VALUE SPACE.     00103000
001040     03  WS-NUMBERENROLL         PIC S9(05)      COMP-3           00104000
001050                                                 VALUE +0000.     00105000
001060     03  WS-SUB1                 PIC S9(04)      COMP             00106000
001070                                                 VALUE +0000.     00107000
001080     03  WS-SUB2                 PIC S9(04)      COMP             00108000
001090                                                 VALUE +0000.     00109000
001100     03  WS-RP-PRODCODE          PIC X(06)       VALUE 'RP'.      00110000
001110     03  WS-SAVE-MSGNBR          PIC 9(06)       VALUE ZEROS.     00111000
001120     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00112000
001130     03  FILLER          REDEFINES WS-CURDATE.                    00113000
001140         05  WS-CURMM            PIC 9(02).                       00114000
001150         05  WS-CURDD            PIC 9(02).                       00115000
001160         05  WS-CURYYYY          PIC 9(04).                       00116000
001170     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00117000
001180     03  FILLER          REDEFINES WS-PDATE.                      00118000
001190         05  WS-PDATE-YYYY       PIC 9(04).                       00119000
001200         05  WS-PDATE-MM         PIC 9(02).                       00120000
001210         05  WS-PDATE-DD         PIC 9(02).                       00121000
001220     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00122000
001230                                                 VALUE ZERO.      00123000
001240     03  WS-PRIMARY-INST         PIC 9(04).                       00124000
001250     03  WS-PRIMARY-IDNUM        PIC X(18).                       00125000
001260     03  WS-REL-ACCT1-GRP        PIC X(38).                       00126000
001270     03  WS-REL-ACCT2-GRP        PIC X(28).                       00127000
001280     03  WS-REL-BRK      REDEFINES WS-REL-ACCT2-GRP.              00128000
001290         05  WS-REL-ACCT2-AINST  PIC 9(04).                       00129000
001300         05  WS-REL-ACCT2-APRODCODE                               00130000
001310                                 PIC X(06).                       00131000
001320         05  WS-REL-ACCT2-AACCOUNT                                00132000
001330                                 PIC X(18).                       00133000
001340     03  WS-RECCOUNT             PIC S9(03)      COMP-3           00134000
001350                                                 VALUE +0.        00135000
001360     03  WS-ENROLLMAX            PIC S9(03)      COMP-3           00136000
001370                                                 VALUE +100.      00137000
001380     03  WS-ENROLL-STORED.                                        00138000
001390         05  WS-ENROLL-REC                       OCCURS 100 TIMES.00139000
001400             07  WS-ENROLLAREA   PIC X(600).                      00140000
001410     03  WS-ENROLL               PIC X(600).                      00141000
001420     03  WS-ENROLLDATA   REDEFINES WS-ENROLL.                     00142000
001430         05  WS-EN-INST          PIC 9(04).                       00143000
001440         05  WS-EN-IDNBR         PIC X(18).                       00144000
001450         05  WS-EN-RELEXISTS     PIC X(01).                       00145000
001460         05  WS-EN-RECID         PIC X(03).                       00146000
001470         05  WS-EN-RECSEQ        PIC 9(04).                       00147000
001480*----------------------------------------------------------------*00148000
001490         05  WS-EN-UPD-DATE      PIC S9(09)      COMP-3.          00149000
001500         05  WS-EN-UPD-TIME      PIC S9(09)      COMP-3.          00150000
001510         05  WS-EN-UPD-USER      PIC X(08).                       00151000
001520         05  WS-EN-UPD-ORG       PIC X(06).                       00152000
001530         05  WS-EN-GRP-DATA.                                      00153000
001540             07  WS-EN-REST      PIC X(500).                      00154000
001550         05  WS-EN-FILLER        PIC X(46).                       00155000
001560*----------------------------------------------------------------*00156000
001570*----------------------------------------------------------------*00157000
001580 01  WS-ABORT-CODES.                                              00158000
001590     03  WS-AB2000               PIC S9(04)      COMP             00159000
001600                                                 VALUE +2000.     00160000
001610     03  WS-AB2033               PIC S9(04)      COMP             00161000
001620                                                 VALUE +2033.     00162000
001630     03  WS-AB3051               PIC S9(04)      COMP             00163000
001640                                                 VALUE +3051.     00164000
001650     03  WS-AB6300               PIC S9(04)      COMP             00165000
001660                                                 VALUE +6300.     00166000
001670     03  WS-AB6305               PIC S9(04)      COMP             00167000
001680                                                 VALUE +6305.     00168000
001690     03  WS-AB6310               PIC S9(04)      COMP             00169000
001700                                                 VALUE +6310.     00170000
001710     03  WS-AB6320               PIC S9(04)      COMP             00171000
001720                                                 VALUE +6320.     00172000
001730     03  WS-AB6330               PIC S9(04)      COMP             00173000
001740                                                 VALUE +6330.     00174000
001750     03  WS-AB6335               PIC S9(04)      COMP             00175000
001760                                                 VALUE +6335.     00176000
001770     03  WS-AB6350               PIC S9(04)      COMP             00177000
001780                                                 VALUE +6350.     00178000
001790     03  WS-AB6355               PIC S9(04)      COMP             00179000
001800                                                 VALUE +6355.     00180000
001810     03  WS-AB6360               PIC S9(04)      COMP             00181000
001820                                                 VALUE +6360.     00182000
001830     03  WS-AB6365               PIC S9(04)      COMP             00183000
001840                                                 VALUE +6365.     00184000
001850*----------------------------------------------------------------*00185000
001860 01  WS-TRACE-CODES.                                              00186000
001870     03  WS-TR0001               PIC S9(04)      COMP             00187000
001880                                                 VALUE +0001.     00188000
001890     03  WS-TR0002               PIC S9(04)      COMP             00189000
001900                                                 VALUE +0002.     00190000
001910     03  WS-TR0003               PIC S9(04)      COMP             00191000
001920                                                 VALUE +0003.     00192000
001930     03  WS-TR0004               PIC S9(04)      COMP             00193000
001940                                                 VALUE +0004.     00194000
001950     03  WS-TR0005               PIC S9(04)      COMP             00195000
001960                                                 VALUE +0005.     00196000
001970     03  WS-TR0006               PIC S9(04)      COMP             00197000
001980                                                 VALUE +0006.     00198000
001990     03  WS-TR0007               PIC S9(04)      COMP             00199000
002000                                                 VALUE +0007.     00200000
002010     03  WS-TR0008               PIC S9(04)      COMP             00201000
002020                                                 VALUE +0008.     00202000
002030     03  WS-TR0009               PIC S9(04)      COMP             00203000
002040                                                 VALUE +0009.     00204000
002050     03  WS-TR0010               PIC S9(04)      COMP             00205000
002060                                                 VALUE +0010.     00206000
002070     03  WS-TR0011               PIC S9(04)      COMP             00207000
002080                                                 VALUE +0011.     00208000
002090     03  WS-TR0012               PIC S9(04)      COMP             00209000
002100                                                 VALUE +0012.     00210000
002110     03  WS-TR0013               PIC S9(04)      COMP             00211000
002120                                                 VALUE +0013.     00212000
002130     03  WS-TR0014               PIC S9(04)      COMP             00213000
002140                                                 VALUE +0014.     00214000
002150     03  WS-TR0015               PIC S9(04)      COMP             00215000
002160                                                 VALUE +0015.     00216000
002170     03  WS-TR0016               PIC S9(04)      COMP             00217000
002180                                                 VALUE +0016.     00218000
002190     03  WS-TR0017               PIC S9(04)      COMP             00219000
002200                                                 VALUE +0017.     00220000
002210     03  WS-TR0018               PIC S9(04)      COMP             00221000
002220                                                 VALUE +0018.     00222000
002230     03  WS-TR0019               PIC S9(04)      COMP             00223000
002240                                                 VALUE +0019.     00224000
002250     03  WS-TR0020               PIC S9(04)      COMP             00225000
002260                                                 VALUE +0020.     00226000
002270     03  WS-TR0021               PIC S9(04)      COMP             00227000
002280                                                 VALUE +0021.     00228000
P0123      03  WS-TR0022               PIC S9(04)      COMP             00228300
P0123                                                  VALUE +0022.     00228600
002290*----------------------------------------------------------------*00229000
002300******************************************************************00230000
002310 LINKAGE SECTION.                                                 00231000
002320 01  DFHCOMMAREA.                                                 00232000
000000 COPY MISCNT00      REPLACING                                     00233000
002340             ==:MICNT:== BY ==RPXXX30==.                          00234000
000000 COPY RPSXXX30.                                                   00235000
002360*01  SLW096-2023RECORDS.                                          00236000
000000 COPY SLW096L.                                                    00237000
002380******************************************************************00238000
002390 PROCEDURE DIVISION.                                              00239000
002400******************************************************************00240000
002410 ENTRY-ROUTINE SECTION.                                           00241000
002420 ER-START.                                                        00242000
002430     MOVE WS-ENROLLPROGID TO SR-APIPROGLIT.                       00243000
002440     MOVE WS-ENROLLPROGID TO RPXXX30-ABPROGID.                    00244000
002450     MOVE WS-ENROLLPROGID TO RPXXX30-RESP-PROGRAM.                00245000
002460     PERFORM CICS-HANDLE-CONDITION.                               00246000
002470     IF EIBCALEN IS EQUAL TO +0                                   00247000
002480         MOVE WS-AB2000 TO RPXXX30-ABORT                          00248000
002490         MOVE WS-AB2000 TO RPXXX30-RESP-ABORT                     00249000
002500         MOVE WS-TR0001 TO RPXXX30-ABTRACE                        00250000
002510         MOVE WS-TR0001 TO RPXXX30-RESP-TRACE                     00251000
002520         GO TO CICS-RETURN.                                       00252000
002530     MOVE ZERO TO RPXXX30-RESP-MSG-NBR.                           00253000
002540     MOVE SPACE TO WS-FUNCTION.                                   00254000
002550     MOVE ZEROS TO WS-SAVE-MSGNBR.                                00255000
002560     MOVE RPXXX30-FILEOPTS TO WS-FILEOPTS.                        00256000
002570     MOVE RPXXX30-OPERID TO WS-UPD-USER.                          00257000
000000 COPY SLP094.                                                     00258000
002590     GO TO VERIFY-KEY.                                            00259000
002600 ER-EXIT.                                                         00260000
002610     EXIT.                                                        00261000
002620******************************************************************00262000
002630 CICS-HANDLE-CONDITION SECTION.                                   00263000
000000 COPY SLP702.                                                     00264000
002650     MOVE WS-AB2033 TO RPXXX30-ABORT.                             00265000
002660     MOVE WS-AB2033 TO RPXXX30-RESP-ABORT.                        00266000
002670     MOVE WS-TR0002 TO RPXXX30-ABTRACE.                           00267000
002680     MOVE WS-TR0002 TO RPXXX30-RESP-TRACE.                        00268000
002690     GO TO CICS-RETURN.                                           00269000
002700 CHC-EXIT.                                                        00270000
002710     EXIT.                                                        00271000
002720******************************************************************00272000
002730 VERIFY-KEY SECTION.                                              00273000
002740 VK-START.                                                        00274000
002750     PERFORM INITIALIZE-MSG.                                      00275000
002760     MOVE ZERO TO RPXXX30-ABORT.                                  00276000
002770     MOVE ZERO TO RPXXX30-RESP-ABORT.                             00277000
002780     MOVE ZERO TO COM-ABORT.                                      00278000
002790     MOVE RPXXX30-DATE TO WS-CURDATE.                             00279000
002800     MOVE WS-CURMM TO WS-PDATE-MM.                                00280000
002810     MOVE WS-CURDD TO WS-PDATE-DD.                                00281000
002820     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00282000
002830     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00283000
002980     MOVE RPXXX30-PRIMARY-INST TO RPBNK-INST.                     00298000
002990     PERFORM RPS-BNK-GET-REQUEST.                                 00299000
003000     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00300000
003010         MOVE WS-TR0003 TO RPXXX30-ABTRACE                        00301000
003020         MOVE WS-TR0003 TO RPXXX30-RESP-TRACE                     00302000
003030         MOVE WS-AB6305 TO RPXXX30-ABORT                          00303000
003040         MOVE WS-AB6305 TO RPXXX30-RESP-ABORT                     00304000
003050         GO TO VK-RETURN.                                         00305000
003060     PERFORM READ-MICM-7100.                                      00306000
003070 VK-2023.                                                         00307000
003080     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM2023INST.               00308000
003090     PERFORM LOAD-RPS-2023.                                       00309000
003100     MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-RPMIM2023PRODCD.        00310000
003110 VK-ENR.                                                          00311000
003120     PERFORM READ-NEW-ENROLL.                                     00312000
003130     IF WS-VALIDENROLL IS EQUAL TO 'Y'                            00313000
003140         MOVE 500627 TO RPXXX30-MSGNBR                            00314000
003150         MOVE 500627 TO RPXXX30-RESP-MSG-NBR                      00315000
003160         GO TO VK-RETURN.                                         00316000
003170     MOVE 'E' TO RPXXX30-RETURN.                                  00317000
003180 VK-RETURN.                                                       00318000
003190     GO TO CICS-RETURN.                                           00319000
003200 VK-EXIT.                                                         00320000
003210     EXIT.                                                        00321000
003220******************************************************************00322000
003230 READ-NEW-ENROLL SECTION.                                         00323000
003240 RNE-START.                                                       00324000
003250     MOVE SPACE TO WS-FUNCTION.                                   00325000
003260     MOVE RPXXX30-PRIMARY-INST TO RPENR-INST.                     00326000
003270     MOVE RPXXX30-PRIMARY-IDNUM TO RPENR-IDNUMBER.                00327000
003280     MOVE '0' TO RPENR-RELEXISTS.                                 00328000
003290     MOVE SPACES TO RPENR-RECID.                                  00329000
003300     MOVE ZEROS TO RPENR-RECSEQ.                                  00330000
003310     PERFORM RPS-ENR-GET-GE-REQUEST.                              00331000
003320     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00332000
003330         MOVE WS-AB6365 TO RPXXX30-ABORT                          00333000
003340         MOVE WS-AB6365 TO RPXXX30-RESP-ABORT                     00334000
003350         MOVE WS-TR0004 TO RPXXX30-ABTRACE                        00335000
003360         MOVE WS-TR0004 TO RPXXX30-RESP-TRACE                     00336000
003370         MOVE 'N' TO WS-VALIDENROLL                               00337000
003380         GO TO RNE-EXIT.                                          00338000
003390     MOVE +0 TO WS-NUMBERENROLL.                                  00339000
003400     MOVE RPXXX30-PRIMARY-INST TO WS-PRIMARY-INST.                00340000
003410     MOVE RPXXX30-PRIMARY-IDNUM TO WS-PRIMARY-IDNUM.              00341000
003420     GO TO RNE-CONT.                                              00342000
003430 RNE-GET-NEXT.                                                    00343000
003440     MOVE SPACES TO WS-FUNCTION.                                  00344000
003450     PERFORM RPS-ENR-GET-NEXT-REQUEST.                            00345000
003460     IF WS-FUNCTION IS EQUAL TO 'E'                               00346000
003470         GO TO RNE-WRAPUP.                                        00347000
003480     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00348000
003490         MOVE WS-AB6365 TO RPXXX30-ABORT                          00349000
003500         MOVE WS-AB6365 TO RPXXX30-RESP-ABORT                     00350000
003510         MOVE WS-TR0005 TO RPXXX30-ABTRACE                        00351000
003520         MOVE WS-TR0005 TO RPXXX30-RESP-TRACE                     00352000
003530         MOVE 'N' TO WS-VALIDENROLL                               00353000
003540         GO TO CICS-ABORT-EXIT.                                   00354000
003550 RNE-CONT.                                                        00355000
003560     IF RPXXX30-PRIMARY-INST IS NOT EQUAL TO RPENR-INST           00356000
003570         OR RPXXX30-PRIMARY-IDNUM IS NOT EQUAL TO RPENR-IDNUMBER  00357000
003580         GO TO RNE-WRAPUP.                                        00358000
003590     ADD +1 TO WS-NUMBERENROLL.                                   00359000
003600     IF WS-NUMBERENROLL IS GREATER THAN WS-ENROLLMAX              00360000
003610         MOVE 500623 TO RPXXX30-RESP-MSG-NBR                      00361000
003620         MOVE 500623 TO RPXXX30-MSGNBR                            00362000
003630         MOVE 'E' TO RPXXX30-RETURN                               00363000
003640         GO TO RNE-EXIT.                                          00364000
003650     MOVE RPENR-RECORD TO WS-ENROLL-REC (WS-NUMBERENROLL).        00365000
003660     GO TO RNE-GET-NEXT.                                          00366000
003670 RNE-WRAPUP.                                                      00367000
003680     IF WS-NUMBERENROLL IS EQUAL TO ZERO                          00368000
003690         MOVE 500624 TO RPXXX30-RESP-MSG-NBR                      00369000
003700         MOVE 500624 TO RPXXX30-MSGNBR                            00370000
003710         MOVE 'E' TO RPXXX30-RETURN                               00371000
003720         GO TO RNE-EXIT.                                          00372000
003730     PERFORM ENROLL-WRAPUP.                                       00373000
003740     IF WS-VALIDENROLL IS NOT EQUAL TO 'Y'                        00374000
003750         MOVE 500626 TO RPXXX30-RESP-MSG-NBR                      00375000
003760         MOVE 500626 TO RPXXX30-MSGNBR                            00376000
003770         MOVE 'E' TO RPXXX30-RETURN                               00377000
003780         GO TO RNE-EXIT.                                          00378000
003790     PERFORM REMOVE-NEW-ENROLL.                                   00379000
003800 RNE-EXIT.                                                        00380000
003810     EXIT.                                                        00381000
003820***************************************************************   00382000
003830 HANDLE-ENROLL-RECORD SECTION.                                    00383000
003840***************************************************************   00384000
003850** THIS ROUTINE WILL STORE ENROLL RECORDS COMING IN          **   00385000
003860***************************************************************   00386000
003870     IF WS-NUMBERENROLL IS GREATER THAN WS-ENROLLMAX              00387000
003880         MOVE WS-ENROLLMAX TO WS-NUMBERENROLL.                    00388000
003890     MOVE RPENR-RECORD TO WS-ENROLL-REC (WS-NUMBERENROLL).        00389000
003900 HER-EXIT.                                                        00390000
003910     EXIT.                                                        00391000
003920***************************************************************   00392000
003930 ENROLL-WRAPUP SECTION.                                           00393000
003940***************************************************************   00394000
003950** THIS ROUTINE WILL REMOVE THE ENROLL RECORDS FROM TABLE    **   00395000
003960** AND WRITE THE NEW RELATIONSHIP RECORD TO THE DATABASE     **   00396000
003970***************************************************************   00397000
003980 EWU-START.                                                       00398000
003990     MOVE SPACE TO WS-VALIDENROLL.                                00399000
004000     MOVE WS-NUMBERENROLL TO WS-RECCOUNT.                         00400000
004010     MOVE +0 TO WS-SUB1.                                          00401000
004020 EWU-LOOP.                                                        00402000
004030     ADD +1 TO WS-SUB1.                                           00403000
004040     IF WS-SUB1 IS GREATER THAN WS-RECCOUNT                       00404000
004050         MOVE 'Y' TO WS-VALIDENROLL                               00405000
004060         GO TO EWU-EXIT.                                          00406000
004070     MOVE WS-ENROLL-REC (WS-SUB1) TO WS-ENROLL.                   00407000
004080 EWU-MST.                                                         00408000
004090     IF WS-EN-RECID IS NOT EQUAL TO 'MST'                         00409000
004100         GO TO EWU-ACT.                                           00410000
004110     IF WS-EN-RELEXISTS IS NOT EQUAL TO '0'                       00411000
004120         PERFORM REMOVE-EXPIRED-RELATIONSHIP.                     00412000
004130     INITIALIZE RPMST-RECORD.                                     00413000
004140     MOVE WS-EN-REST TO RPMST-RECORD.                             00414000
004150     PERFORM RPS-MST-PUT-REQUEST.                                 00415000
004160     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00416000
004170         MOVE WS-AB6320 TO RPXXX30-ABORT                          00417000
004180         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     00418000
004190         MOVE WS-TR0006 TO RPXXX30-ABTRACE                        00419000
004200         MOVE WS-TR0006 TO RPXXX30-RESP-TRACE                     00420000
004210         GO TO EWU-FAIL.                                          00421000
004400     GO TO EWU-LOOP.                                              00440000
004410 EWU-ACT.                                                         00441000
004420     IF WS-EN-RECID IS NOT EQUAL TO 'ACT'                         00442000
004430         GO TO EWU-REL.                                           00443000
004440     INITIALIZE RPACT-RECORD.                                     00444000
004450     MOVE WS-EN-REST TO RPACT-RECORD.                             00445000
004460     PERFORM RPS-ACT-GET-REQUEST.                                 00446000
004470     IF WS-FUNCTION IS EQUAL TO 'N'                               00447000
004480         GO TO EWU-ACT-WRITE.                                     00448000
004490     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00449000
004500         MOVE WS-AB6300 TO RPXXX30-ABORT                          00450000
004510         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     00451000
004520         MOVE WS-TR0008 TO RPXXX30-ABTRACE                        00452000
004530         MOVE WS-TR0008 TO RPXXX30-RESP-TRACE                     00453000
004540         GO TO EWU-FAIL.                                          00454000
004550     PERFORM RPS-ACT-GET-LOCK-REQUEST.                            00455000
004560     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00456000
004570         MOVE WS-AB6300 TO RPXXX30-ABORT                          00457000
004580         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     00458000
004590         MOVE WS-TR0009 TO RPXXX30-ABTRACE                        00459000
004600         MOVE WS-TR0009 TO RPXXX30-RESP-TRACE                     00460000
004610         GO TO EWU-FAIL.                                          00461000
P0085      MOVE WS-EN-REST TO RPACT-RECORD.                             00461500
004620     PERFORM RPS-ACT-REPUT-REQUEST.                               00462000
004630     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00463000
004640         MOVE WS-AB6300 TO RPXXX30-ABORT                          00464000
004650         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     00465000
004660         MOVE WS-TR0010 TO RPXXX30-ABTRACE                        00466000
004670         MOVE WS-TR0010 TO RPXXX30-RESP-TRACE                     00467000
004680         GO TO EWU-FAIL.                                          00468000
004690     GO TO EWU-LOOP.                                              00469000
004700 EWU-ACT-WRITE.                                                   00470000
004710     MOVE WS-EN-REST TO RPACT-RECORD.                             00471000
004720     PERFORM RPS-ACT-PUT-REQUEST.                                 00472000
004730     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00473000
004740         MOVE WS-AB6300 TO RPXXX30-ABORT                          00474000
004750         MOVE WS-AB6300 TO RPXXX30-RESP-ABORT                     00475000
004760         MOVE WS-TR0011 TO RPXXX30-ABTRACE                        00476000
004770         MOVE WS-TR0011 TO RPXXX30-RESP-TRACE                     00477000
004780         GO TO EWU-FAIL.                                          00478000
004790     GO TO EWU-LOOP.                                              00479000
004800 EWU-REL.                                                         00480000
004810     IF WS-EN-RECID IS NOT EQUAL TO 'REL'                         00481000
004820         GO TO EWU-TRM.                                           00482000
004830     INITIALIZE RPREL-RECORD.                                     00483000
004840     MOVE WS-EN-REST TO RPREL-RECORD.                             00484000
004850     MOVE RPREL-ACCT1-GRP TO WS-REL-ACCT1-GRP.                    00485000
004860     MOVE RPREL-ACCT2-GRP TO WS-REL-ACCT2-GRP.                    00486000
004870     PERFORM RPS-REL-PUT-REQUEST.                                 00487000
004880     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00488000
004890         MOVE WS-AB6330 TO RPXXX30-ABORT                          00489000
004900         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     00490000
004910         MOVE WS-TR0012 TO RPXXX30-ABTRACE                        00491000
004920         MOVE WS-TR0012 TO RPXXX30-RESP-TRACE                     00492000
004930         GO TO EWU-FAIL.                                          00493000
004940     INITIALIZE RPSEC-RECORD.                                     00494000
004950     IF RPREL-INST2 IS EQUAL TO ZEROS                             00495000
004960         MOVE RPREL-INST TO RPSEC-INST                            00496000
004970         MOVE RPREL-PRODCODE TO RPSEC-PRODCODE                    00497000
004980         MOVE RPREL-ACCOUNT TO RPSEC-ACCOUNT                      00498000
004990         MOVE ZEROS TO RPSEC-INST2                                00499000
005000         MOVE SPACES TO RPSEC-PRODCODE2                           00500000
005010         MOVE SPACES TO RPSEC-ACCOUNT2                            00501000
005020         MOVE RPREL-MODEL TO RPSEC-MODEL2                         00502000
005030     ELSE                                                         00503000
005040         MOVE WS-REL-ACCT1-GRP TO RPSEC-ACCT2-GRP                 00504000
005050         MOVE WS-REL-ACCT2-GRP TO RPSEC-ACCT1-GRP.                00505000
005060     MOVE RPREL-INST TO RPSEC-ALT-INST.                           00506000
005070     MOVE RPREL-ACCOUNT TO RPSEC-ALT-ACCOUNT.                     00507000
005080     MOVE RPREL-PRODCODE TO RPSEC-ALT-PRODCODE.                   00508000
005090     PERFORM RPS-SEC-PUT-REQUEST.                                 00509000
005100     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00510000
005110         MOVE WS-AB6335 TO RPXXX30-ABORT                          00511000
005120         MOVE WS-AB6335 TO RPXXX30-RESP-ABORT                     00512000
005130         MOVE WS-TR0013 TO RPXXX30-ABTRACE                        00513000
005140         MOVE WS-TR0013 TO RPXXX30-RESP-TRACE                     00514000
005150         GO TO EWU-FAIL.                                          00515000
005160 EWU-EVT.                                                         00516000
005170     IF MIM-7100EVENTHISTORYOPT IS NOT EQUAL TO 'Y'               00517000
005180         GO TO EWU-LOOP.                                          00518000
P0053      IF RPREL-INST2 IS EQUAL TO ZEROS                             00519000
P0053          MOVE 01 TO RPS-EVT-EVENT-CODE                            00519190
P0053      ELSE                                                         00519380
P0053          MOVE 07 TO RPS-EVT-EVENT-CODE.                           00519570
005200     MOVE RPMST-IDNUMBER TO RPS-EVT-IDNUMBER.                     00520000
005210     MOVE WS-REL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                  00521000
005220     MOVE WS-REL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                  00522000
005230     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        00523000
005240     PERFORM ADD-EVENT-HISTORY.                                   00524000
005250     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00525000
005260         MOVE WS-AB6360 TO RPXXX30-ABORT                          00526000
005270         MOVE WS-AB6360 TO RPXXX30-RESP-ABORT                     00527000
005280         MOVE WS-TR0014 TO RPXXX30-ABTRACE                        00528000
005290         MOVE WS-TR0014 TO RPXXX30-RESP-TRACE                     00529000
005300         GO TO CICS-RETURN.                                       00530000
005310 EWU-TRM.                                                         00531000
005320     IF WS-EN-RECID IS NOT EQUAL TO 'TRM'                         00532000
005330         GO TO EWU-LOOP.                                          00533000
005340     INITIALIZE RPTRM-RECORD.                                     00534000
005350     MOVE WS-EN-REST TO RPTRM-RECORD.                             00535000
005360     PERFORM RPS-TRM-PUT-REQUEST.                                 00536000
005370     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00537000
005380         MOVE WS-AB6355 TO RPXXX30-ABORT                          00538000
005390         MOVE WS-AB6355 TO RPXXX30-RESP-ABORT                     00539000
005400         MOVE WS-TR0015 TO RPXXX30-ABTRACE                        00540000
005410         MOVE WS-TR0015 TO RPXXX30-RESP-TRACE                     00541000
005420         GO TO EWU-FAIL.                                          00542000
005430     GO TO EWU-LOOP.                                              00543000
005440 EWU-FAIL.                                                        00544000
005450     MOVE 'N' TO WS-VALIDENROLL.                                  00545000
005460 EWU-EXIT.                                                        00546000
005470     EXIT.                                                        00547000
005480***************************************************************   00548000
005490 REMOVE-NEW-ENROLL SECTION.                                       00549000
005500 REE-START.                                                       00550000
005510***************************************************************   00551000
005520** THIS ROUTINE WILL REMOVE THE ENROLL RECORDS FROM THE      **   00552000
005530** ENROLL FILE AFTER THE RELATIONSHIP HAS BEEN WRITTEN       **   00553000
005540***************************************************************   00554000
005550     MOVE SPACE TO WS-FUNCTION.                                   00555000
005560     MOVE WS-PRIMARY-INST TO RPENR-INST.                          00556000
005570     MOVE WS-PRIMARY-IDNUM TO RPENR-IDNUMBER.                     00557000
005580     MOVE SPACES TO RPENR-RECID.                                  00558000
005590     MOVE ZERO TO RPENR-RELEXISTS.                                00559000
005600     MOVE ZEROS TO RPENR-RECSEQ.                                  00560000
005610     PERFORM RPS-ENR-GET-GE-LOCK-REQUEST.                         00561000
005620     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00562000
005630         GO TO REE-EXIT.                                          00563000
005640     GO TO REE-DELETE.                                            00564000
005650 REE-GET-NEXT.                                                    00565000
005660     MOVE SPACES TO WS-FUNCTION.                                  00566000
005670     PERFORM RPS-ENR-GET-NEXT-LOCK-REQUEST.                       00567000
005680     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00568000
005690         GO TO REE-EXIT.                                          00569000
005700 REE-DELETE.                                                      00570000
005710     IF WS-PRIMARY-INST IS NOT EQUAL TO RPENR-INST                00571000
005720         OR WS-PRIMARY-IDNUM IS NOT EQUAL TO RPENR-IDNUMBER       00572000
005730         GO TO REE-EXIT.                                          00573000
005740     PERFORM RPS-ENR-DELETE-REQUEST.                              00574000
005750     IF WS-FUNCTION IS EQUAL TO SPACES                            00575000
005760         GO TO REE-GET-NEXT.                                      00576000
005770 REE-EXIT.                                                        00577000
005780     EXIT.                                                        00578000
005790******************************************************************00579000
005800 INITIALIZE-MSG SECTION.                                          00580000
005810 IM-START.                                                        00581000
005820     MOVE ZEROS TO RPXXX30-RESP-MSG-NBR.                          00582000
005830     MOVE +0000 TO RPXXX30-ABORT.                                 00583000
005840     MOVE +0000 TO RPXXX30-RESP-ABORT.                            00584000
005850     MOVE +0000 TO RPXXX30-ERRCNT.                                00585000
005860     MOVE +0000 TO RPXXX30-INQ-OCCUR.                             00586000
005870 IM-EXIT.                                                         00587000
005880     EXIT.                                                        00588000
005890******************************************************************00589000
005900 READ-MICM-7100 SECTION.                                          00590000
005910 RM7100-START.                                                    00591000
005920     MOVE SPACES TO WS-FUNCTION.                                  00592000
005930     MOVE SPACES TO MI7100-RECORD.                                00593000
005940     MOVE RPXXX30-PRIMARY-INST TO MIM-7100KINST.                  00594000
005950 RM7100-LOOP.                                                     00595000
005960     MOVE +7100 TO MIM-7100KREC.                                  00596000
005970     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00597000
005980     MOVE MI7100-RECORD TO MIMST-RECORD.                          00598000
005990     PERFORM MIC-MST-GET-REQUEST.                                 00599000
006000     MOVE MIMST-RECORD TO MI7100-RECORD.                          00600000
006010     IF WS-FUNCTION IS EQUAL TO 'N'                               00601000
006020         AND MIM-7100KINST IS GREATER THAN ZEROS                  00602000
006030         GO TO RM7100-ZERO.                                       00603000
006040     GO TO RM7100-EXIT.                                           00604000
006050 RM7100-ZERO.                                                     00605000
006060     MOVE SPACES TO MI7100-RECORD.                                00606000
006070     MOVE ZEROS TO MIM-7100KINST.                                 00607000
006080     GO TO RM7100-LOOP.                                           00608000
006090 RM7100-EXIT.                                                     00609000
006100     EXIT.                                                        00610000
006110******************************************************************00611000
006120 REMOVE-EXPIRED-RELATIONSHIP SECTION.                             00612000
006130 RER-START.                                                       00613000
006140     MOVE RPXXX30-PRIMARY-INST TO RPMST-INST.                     00614000
006150     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPMST-PRODCODE.            00615000
006160     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPMST-ACCOUNT.              00616000
006170     MOVE RPXXX30-PRIMARY-MODEL TO RPMST-MODEL.                   00617000
P0123      PERFORM RPS-MST-GET-LOCK-REQUEST.                            00617100
P0123      IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00617200
P0123          MOVE WS-AB6350 TO RPXXX30-ABORT                          00617300
P0123          MOVE WS-AB6350 TO RPXXX30-RESP-ABORT                     00617400
P0123          MOVE WS-TR0022 TO RPXXX30-ABTRACE                        00617500
P0123          MOVE WS-TR0022 TO RPXXX30-RESP-TRACE                     00617600
P0123          GO TO CICS-RETURN.                                       00617700
006180 RER-REL.                                                         00618000
006190     MOVE LOW-VALUES TO RPREL-GRP-KEY.                            00619000
006200     MOVE RPMST-GRP-KEY TO RPREL-ACCT1-GRP.                       00620000
006210     MOVE ZEROS TO RPREL-INST2.                                   00621000
006220     MOVE SPACES TO RPREL-PRODCODE2.                              00622000
006230     MOVE SPACES TO RPREL-ACCOUNT2.                               00623000
006240     PERFORM RPS-REL-GET-LOCK-REQUEST.                            00624000
006250     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00625000
006260         GO TO RER-CRW.                                           00626000
006270     GO TO RER-REL-CONT.                                          00627000
006280 RER-REL-NEXT.                                                    00628000
006290     PERFORM RPS-REL-GET-NEXT-LOCK-REQUEST.                       00629000
006300     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00630000
006310         GO TO RER-CRW.                                           00631000
006320 RER-REL-CONT.                                                    00632000
006330     IF RPMST-GRP-KEY IS NOT EQUAL TO RPREL-ACCT1-GRP             00633000
006340         PERFORM RPS-REL-UNLOCK-REQUEST                           00634000
006350         GO TO RER-CRW.                                           00635000
006360     IF WS-EN-RELEXISTS IS EQUAL TO '2'                           00636000
006370         AND MIM-7100EVENTHISTORYOPT IS EQUAL TO 'Y'              00637000
006380         PERFORM WRITE-EVT-DELETE.                                00638000
006390     IF RPREL-INST2 IS EQUAL TO ZEROS                             00639000
006400         MOVE RPREL-INST TO RPSEC-INST                            00640000
006410         MOVE RPREL-PRODCODE TO RPSEC-PRODCODE                    00641000
006420         MOVE RPREL-ACCOUNT TO RPSEC-ACCOUNT                      00642000
006430         MOVE ZEROS TO RPSEC-INST2                                00643000
006440         MOVE SPACES TO RPSEC-PRODCODE2                           00644000
006450         MOVE SPACES TO RPSEC-ACCOUNT2                            00645000
006460         MOVE RPREL-MODEL TO RPSEC-MODEL2                         00646000
006470     ELSE                                                         00647000
006480         MOVE RPREL-ACCT2-GRP TO RPSEC-ACCT1-GRP                  00648000
006490         MOVE RPREL-ACCT1-GRP TO RPSEC-ACCT2-GRP.                 00649000
006500     PERFORM RPS-SEC-GET-LOCK-REQUEST.                            00650000
006510     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00651000
006520         GO TO RER-REL-DELETE.                                    00652000
006530     PERFORM RPS-SEC-DELETE-REQUEST.                              00653000
006540     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00654000
006550         MOVE WS-AB6335 TO RPXXX30-ABORT                          00655000
006560         MOVE WS-AB6335 TO RPXXX30-RESP-ABORT                     00656000
006570         MOVE WS-TR0016 TO RPXXX30-ABTRACE                        00657000
006580         MOVE WS-TR0016 TO RPXXX30-RESP-TRACE                     00658000
006590         GO TO CICS-RETURN.                                       00659000
006600 RER-REL-DELETE.                                                  00660000
006610     PERFORM RPS-REL-DELETE-REQUEST.                              00661000
006620     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00662000
006630         MOVE WS-AB6330 TO RPXXX30-ABORT                          00663000
006640         MOVE WS-AB6330 TO RPXXX30-RESP-ABORT                     00664000
006650         MOVE WS-TR0017 TO RPXXX30-ABTRACE                        00665000
006660         MOVE WS-TR0017 TO RPXXX30-RESP-TRACE                     00666000
006670         GO TO CICS-RETURN.                                       00667000
006680     GO TO RER-REL-NEXT.                                          00668000
006690 RER-CRW.                                                         00669000
006700     MOVE LOW-VALUES TO RPCRW-GRP-KEY.                            00670000
006710     MOVE RPMST-GRP-KEY TO RPCRW-ACCT1-GRP.                       00671000
006720     PERFORM RPS-CRW-GET-LOCK-REQUEST.                            00672000
006730     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00673000
006740         GO TO RER-TRM.                                           00674000
006750     IF RPMST-GRP-KEY IS NOT EQUAL TO RPCRW-ACCT1-GRP             00675000
006760         PERFORM RPS-CRW-UNLOCK-REQUEST                           00676000
006770         GO TO RER-TRM.                                           00677000
006780     PERFORM RPS-CRW-DELETE-REQUEST.                              00678000
006790     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00679000
006800         MOVE WS-AB6350 TO RPXXX30-ABORT                          00680000
006810         MOVE WS-AB6350 TO RPXXX30-RESP-ABORT                     00681000
006820         MOVE WS-TR0018 TO RPXXX30-ABTRACE                        00682000
006830         MOVE WS-TR0018 TO RPXXX30-RESP-TRACE                     00683000
006840         GO TO CICS-RETURN.                                       00684000
006850 RER-TRM.                                                         00685000
006860     MOVE RPMST-GRP-KEY TO RPTRM-GRP-KEY.                         00686000
006870     PERFORM RPS-TRM-GET-LOCK-REQUEST.                            00687000
006880     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00688000
006890         GO TO RER-MST.                                           00689000
006900     PERFORM RPS-TRM-DELETE-REQUEST.                              00690000
006910     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00691000
006920         MOVE WS-AB6355 TO RPXXX30-ABORT                          00692000
006930         MOVE WS-AB6355 TO RPXXX30-RESP-ABORT                     00693000
006940         MOVE WS-TR0019 TO RPXXX30-ABTRACE                        00694000
006950         MOVE WS-TR0019 TO RPXXX30-RESP-TRACE                     00695000
006960         GO TO CICS-RETURN.                                       00696000
006970 RER-MST.                                                         00697000
007010     PERFORM RPS-MST-DELETE-REQUEST.                              00701000
007020     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00702000
007030         MOVE WS-AB6320 TO RPXXX30-ABORT                          00703000
007040         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     00704000
007050         MOVE WS-TR0020 TO RPXXX30-ABTRACE                        00705000
007060         MOVE WS-TR0020 TO RPXXX30-RESP-TRACE                     00706000
007070         GO TO CICS-RETURN.                                       00707000
007080 RER-EXIT.                                                        00708000
007090     EXIT.                                                        00709000
007100******************************************************************00710000
007110 WRITE-EVT-DELETE SECTION.                                        00711000
007120 WED-START.                                                       00712000
007130     MOVE 02 TO RPS-EVT-EVENT-CODE.                               00713000
007140     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   00714000
007150     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   00715000
P0123      MOVE RPMST-IDNUMBER TO RPS-EVT-IDNUMBER.                     00716000
007170     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        00717000
007180     PERFORM ADD-EVENT-HISTORY.                                   00718000
007190     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00719000
007200         MOVE WS-AB6360 TO RPXXX30-ABORT                          00720000
007210         MOVE WS-AB6360 TO RPXXX30-RESP-ABORT                     00721000
007220         MOVE WS-TR0021 TO RPXXX30-ABTRACE                        00722000
007230         MOVE WS-TR0021 TO RPXXX30-RESP-TRACE                     00723000
007240         GO TO CICS-RETURN.                                       00724000
007250 WED-EXIT.                                                        00725000
007260     EXIT.                                                        00726000
007270******************************************************************00727000
007280 LOAD-RPS-2023 SECTION.                                           00728000
000000 COPY RPP2023A.                                                   00729000
007300******************************************************************00730000
007310 ADD-EVENT-HISTORY SECTION.                                       00731000
000000 COPY RPPEVTD.                                                    00732000
007330******************************************************************00733000
000000 COPY RPPACTA.                                                    00734000
007350******************************************************************00735000
000000 COPY RPPBNKA.                                                    00736000
007370******************************************************************00737000
000000 COPY RPPCRWA.                                                    00738000
007390***************************************************************   00739000
000000 COPY RPPMSTA.                                                    00740000
007410******************************************************************00741000
000000 COPY RPPIDXA.                                                    00742000
007430******************************************************************00743000
000000 COPY RPPRELA.                                                    00744000
007450******************************************************************00745000
000000 COPY RPPSECA.                                                    00746000
007470******************************************************************00747000
000000 COPY RPPTRMA.                                                    00748000
007490******************************************************************00749000
000000 COPY RPPENRA.                                                    00750000
007510******************************************************************00751000
000000 COPY RPPEVTA.                                                    00752000
007530******************************************************************00753000
007540 MIC-MST-API SECTION.                                             00754000
000000 COPY MIPMSTA.                                                    00755000
007560******************************************************************00756000
007600 SLP096-GET-2023-RECORD SECTION.                                  00760000
000000 COPY SLP096.                                                     00761000
007620******************************************************************00762000
007630 CICS-ABORT-EXIT SECTION.                                         00763000
007640 CAE-START.                                                       00764000
007650     GO TO CICS-RETURN.                                           00765000
007660 CAE-EXIT.                                                        00766000
007670     EXIT.                                                        00767000
007680******************************************************************00768000
007690 CICS-RETURN SECTION.                                             00769000
007700     IF COM-ABORT IS NOT EQUAL TO ZERO                            00770000
007710         MOVE COM-ABORT TO RPXXX30-ABORT.                         00771000
007720     IF RPXXX30-ABORT IS NOT EQUAL TO ZERO                        00772000
007730         MOVE WS-ENROLLPROGID TO RPXXX30-RESP-PROGRAM             00773000
007740         MOVE WS-FUNCTION TO RPXXX30-FUNCTION                     00774000
007750         MOVE SRB-BMDB TO RPXXX30-SRBMDB                          00775000
007760         MOVE EIBFN TO RPXXX30-ABEIBFN                            00776000
007770         MOVE EIBRESP TO RPXXX30-ABEIBRESP                        00777000
007780         MOVE EIBRESP2 TO RPXXX30-ABEIBRESP2                      00778000
007790         MOVE EIBRCODE TO RPXXX30-ABEIBRCODE.                     00779000
007800     IF RPXXX30-RESP-MSG-NBR IS NOT EQUAL TO ZERO                 00780000
007810         AND RPXXX30-RESP-PROGRAM IS NOT EQUAL TO SPACES          00781000
007820         MOVE WS-ENROLLPROGID TO RPXXX30-RESP-PROGRAM.            00782000
000000 COPY SLP709.                                                     00785000
007930******************************************************************00793000
