000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX01.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX01 - RELATIONSHIP INQUIRY MODULE                      *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW105-AREAS.                                                00016000
000000 COPY SRW105.                                                     00017000
000180*01  BICRSRB.                                                     00018000
000000 COPY BICRSRB.                                                    00019000
000200*01  BICRPSB.                                                     00020000
000000 COPY BICRPSB.                                                    00021000
000220*01  BICRVERB.                                                    00022000
000000 COPY BICRVERB.                                                   00023000
000240*01  BICRSTAT.                                                    00024000
000000 COPY BICRSTAT.                                                   00025000
000260*01  BICRDBS.                                                     00026000
000000 COPY BICRDBS.                                                    00027000
000280*01  BICRLOG.                                                     00028000
000000 COPY BICRLOG.                                                    00029000
000300 01  SRW710-AREAS.                                                00030000
000000 COPY SRW710.                                                     00031000
000320 01  WS-WORKAREAS.                                                00032000
000330     03  WS-MAX-PANEL-ENTRIES    PIC S9(04)      COMP             00033000
000340                                                 VALUE +0006.     00034000
000350     03  COM-ABORT               PIC S9(04)      COMP.            00035000
000360     03  WS-SUB1                 PIC S9(04)      COMP             00036000
000370                                                 VALUE +0000.     00037000
000380     03  WS-SUB2                 PIC S9(04)      COMP             00038000
000390                                                 VALUE +0000.     00039000
000400     03  WS-MAX-CATEGORY         PIC S9(04)      COMP             00040000
000410                                                 VALUE +0020.     00041000
000420     03  WS-RP-PRODCODE          PIC X(06)       VALUE 'RP'.      00042000
000430     03  WS-CAT-INST             PIC 9(04)       VALUE ZERO.      00043000
000440     03  WS-CAT-NBR              PIC X(06)       VALUE SPACES.    00044000
000450     03  WS-SAVE-ACCT-TYPE       PIC 9(03)       VALUE ZERO.      00045000
000460     03  WS-SAVE-PRODCODE        PIC X(06)       VALUE SPACES.    00046000
000470     03  WS-CLOSE-FLAG           PIC X(01)       VALUE SPACES.    00047000
000480     03  WS-7102-DEF-FLAG        PIC X(01)       VALUE 'N'.       00048000
000490     03  WS-7102-DEF-RECORD      PIC X(125)      VALUE SPACES.    00049000
000500     03  WS-SAVE-MSGNBR          PIC 9(06)       VALUE ZEROS.     00050000
000510     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00051000
000520     03  FILLER          REDEFINES WS-CURDATE.                    00052000
000530         05  WS-CURMM            PIC 9(02).                       00053000
000540         05  WS-CURDD            PIC 9(02).                       00054000
000550         05  WS-CURYYYY          PIC 9(04).                       00055000
000560     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00056000
000570     03  FILLER          REDEFINES WS-PDATE.                      00057000
000580         05  WS-PDATE-YYYY       PIC 9(04).                       00058000
000590         05  WS-PDATE-MM         PIC 9(02).                       00059000
000600         05  WS-PDATE-DD         PIC 9(02).                       00060000
000610     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00061000
000620     03  FILLER          REDEFINES WS-PDATE2.                     00062000
000630         05  WS-PDATE2-YYYY      PIC 9(04).                       00063000
000640         05  WS-PDATE2-MM        PIC 9(02).                       00064000
000650         05  WS-PDATE2-DD        PIC 9(02).                       00065000
000660     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00066000
000670                                                 VALUE ZERO.      00067000
000680     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00068000
000690                                                 VALUE ZERO.      00069000
000700     03  WS-7106-TABLE.                                           00070000
000710         05  WS-7106-ENTRIES                     OCCURS 20 TIMES. 00071000
000720             07  WS-7106-INST    PIC 9(04).                       00072000
000730             07  WS-7106-CAT     PIC X(06).                       00073000
000740             07  WS-7106-BALREQ  PIC S9(09)V99   COMP-3.          00074000
000750     03  WS-ERRORMODEL           PIC X(01)       VALUE 'N'.       00075000
000760     03  WS-SAVEMASTERGROUP.                                      00076000
000770         05  WS-SAVEMSTINST      PIC 9(04).                       00077000
000780         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00078000
000790         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00079000
000800         05  WS-SAVEMSTMODEL     PIC X(10).                       00080000
000810*----------------------------------------------------------------*00081000
000820 01  MIWPRI-AREAS.                                                00082000
000000 COPY MIWPRI.                                                     00083000
000840 01  MIWMSTA-AREAS.                                               00084000
000000 COPY MIWMSTA.                                                    00085000
000860 01  MIMST-RECORD.                                                00086000
000000 COPY MISMST.                                                     00087000
000880 01  MI2023-RECORD.                                               00088000
000000 COPY MIS2023A.                                                   00089000
000900 01  MI7100-RECORD.                                               00090000
000000 COPY MIS7100.                                                    00091000
000920 01  MI7101-RECORD.                                               00092000
000000 COPY MIS7101.                                                    00093000
000940 01  MI7102-RECORD.                                               00094000
000000 COPY MIS7102.                                                    00095000
000960 01  MI7106-RECORD.                                               00096000
000000 COPY MIS7106.                                                    00097000
000980*----------------------------------------------------------------*00098000
000990 01  RPWPRI-AREAS.                                                00099000
000000 COPY RPWPRI.                                                     00100000
001010 01  RPWCRW-AREA.                                                 00101000
000000 COPY RPWCRWA.                                                    00102000
001030 01  RPCRW-RECORD.                                                00103000
000000 COPY RPSCRW.                                                     00104000
001050 01  RPWIDX-AREA.                                                 00105000
000000 COPY RPWIDXA.                                                    00106000
001070 01  RPIDX-RECORD.                                                00107000
000000 COPY RPSIDX.                                                     00108000
001090 01  RPWMST-AREA.                                                 00109000
000000 COPY RPWMSTA.                                                    00110000
001110 01  RPMST-RECORD.                                                00111000
000000 COPY RPSMST.                                                     00112000
001130 01  RPWREL-AREA.                                                 00113000
000000 COPY RPWRELA.                                                    00114000
001150 01  RPREL-RECORD.                                                00115000
000000 COPY RPSREL.                                                     00116000
001170 01  RPRF21-MESSAGE.                                              00117000
000000 COPY MISCNT00      REPLACING                                     00118000
001190             ==:MICNT:== BY ==RPRF21==.                           00119000
000000 COPY RPSRF21.                                                    00120000
001210*----------------------------------------------------------------*00121000
001220 01  WS-TRACECODES.                                               00122000
001230     03  WS-TR0001               PIC S9(04)      COMP             00123000
001240                                                 VALUE +0001.     00124000
001250     03  WS-TR0002               PIC S9(04)      COMP             00125000
001260                                                 VALUE +0002.     00126000
001270     03  WS-TR0003               PIC S9(04)      COMP             00127000
001280                                                 VALUE +0003.     00128000
001290     03  WS-TR0004               PIC S9(04)      COMP             00129000
001300                                                 VALUE +0004.     00130000
001310     03  WS-TR0005               PIC S9(04)      COMP             00131000
001320                                                 VALUE +0005.     00132000
001330     03  WS-TR0006               PIC S9(04)      COMP             00133000
001340                                                 VALUE +0006.     00134000
001350     03  WS-TR0007               PIC S9(04)      COMP             00135000
001360                                                 VALUE +0007.     00136000
001370     03  WS-TR0008               PIC S9(04)      COMP             00137000
001380                                                 VALUE +0008.     00138000
001390     03  WS-TR0009               PIC S9(04)      COMP             00139000
001400                                                 VALUE +0009.     00140000
001410     03  WS-TR0010               PIC S9(04)      COMP             00141000
001420                                                 VALUE +0010.     00142000
001430 01  WS-ABORTCODES.                                               00143000
001440     03  WS-AB2000               PIC S9(04)      COMP             00144000
001450                                                 VALUE +2000.     00145000
001460     03  WS-AB2033               PIC S9(04)      COMP             00146000
001470                                                 VALUE +2033.     00147000
001480     03  WS-AB3051               PIC S9(04)      COMP             00148000
001490                                                 VALUE +3051.     00149000
001500     03  WS-AB6310               PIC S9(04)      COMP             00150000
001510                                                 VALUE +6310.     00151000
001520     03  WS-AB6320               PIC S9(04)      COMP             00152000
001530                                                 VALUE +6320.     00153000
001540     03  WS-AB6330               PIC S9(04)      COMP             00154000
001550                                                 VALUE +6330.     00155000
001560     03  WS-AB6350               PIC S9(04)      COMP             00156000
001570                                                 VALUE +6350.     00157000
001580******************************************************************00158000
001590 01  SLW096-AREAS.                                                00159000
000000 COPY SLW096.                                                     00160000
001610******************************************************************00161000
001620 LINKAGE SECTION.                                                 00162000
001630 01  DFHCOMMAREA.                                                 00163000
000000 COPY MISCNT00      REPLACING                                     00164000
001650             ==:MICNT:== BY ==RPXXX01==.                          00165000
000000 COPY RPSXXX01.                                                   00166000
001670*01  SLW096-2023RECORDS.                                          00167000
000000 COPY SLW096L.                                                    00168000
001690******************************************************************00169000
001700 PROCEDURE DIVISION.                                              00170000
001710******************************************************************00171000
001720 ENTRY-ROUTINE SECTION.                                           00172000
001730 ER-START.                                                        00173000
001740     MOVE 'RPLXXX01' TO SR-APIPROGLIT.                            00174000
001750     MOVE 'RPLXXX01' TO RPXXX01-ABPROGID.                         00175000
001760     PERFORM CICS-HANDLE-CONDITION.                               00176000
001770     IF EIBCALEN IS EQUAL TO +0                                   00177000
001780         MOVE WS-AB2000 TO RPXXX01-ABORT                          00178000
001790         MOVE WS-TR0001 TO RPXXX01-ABTRACE                        00179000
001800         GO TO CICS-RETURN.                                       00180000
001810     MOVE ZERO TO RPXXX01-MSGNBR.                                 00181000
001820     MOVE SPACE TO WS-FUNCTION.                                   00182000
001830     MOVE ZEROS TO WS-SAVE-MSGNBR.                                00183000
001840     MOVE RPXXX01-FILEOPTS TO WS-FILEOPTS.                        00184000
001850     MOVE RPXXX01-OPERID TO WS-UPD-USER.                          00185000
000000 COPY SLP094.                                                     00186000
001870     GO TO VERIFY-KEY.                                            00187000
001880 ER-EXIT.                                                         00188000
001890     EXIT.                                                        00189000
001900******************************************************************00190000
001910 CICS-HANDLE-CONDITION SECTION.                                   00191000
000000 COPY SLP702.                                                     00192000
001930     MOVE WS-AB2033 TO RPXXX01-ABORT.                             00193000
001940     MOVE WS-TR0002 TO RPXXX01-ABTRACE.                           00194000
001950     GO TO CICS-RETURN.                                           00195000
001960 CHC-EXIT.                                                        00196000
001970     EXIT.                                                        00197000
001980******************************************************************00198000
001990 VERIFY-KEY SECTION.                                              00199000
002000 VK-START.                                                        00200000
002010     MOVE ZERO TO RPXXX01-ABORT.                                  00201000
002020     MOVE ZERO TO COM-ABORT.                                      00202000
002030     MOVE SPACES TO WS-7106-TABLE.                                00203000
002040     MOVE RPXXX01-DATE TO WS-CURDATE.                             00204000
002050     MOVE WS-CURMM TO WS-PDATE-MM.                                00205000
002060     MOVE WS-CURDD TO WS-PDATE-DD.                                00206000
002070     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00207000
002080     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00208000
002090 VK-IDX.                                                          00209000
002100     INITIALIZE RPIDX-RECORD.                                     00210000
002110     IF RPXXX01-KEY-IDNUMBER IS NOT GREATER THAN ZEROS            00211000
002120         OR RPXXX01-KEY-IDNUMBER IS NOT NUMERIC                   00212000
002130         GO TO VK-MST.                                            00213000
002140     PERFORM LOCATE-IDNUMBER-BY-APPL.                             00214000
002150     IF WS-FUNCTION IS EQUAL TO 'N'                               00215000
002160         MOVE 500004 TO RPXXX01-MSGNBR                            00216000
002170         GO TO VK-RETURN.                                         00217000
002180     MOVE ZEROS TO RPXXX01-KEY-IDNUMBER.                          00218000
002190 VK-MST.                                                          00219000
002200     IF RPXXX01-KEY-MODEL IS EQUAL TO SPACES OR                   00220000
002210         RPXXX01-KEY-MODEL IS EQUAL TO LOW-VALUES                 00221000
002220         PERFORM FIND-DEFAULT-MODEL.                              00222000
002230     IF WS-ERRORMODEL IS EQUAL TO 'Y'                             00223000
002240         GO TO VK-RETURN.                                         00224000
002250     MOVE RPXXX01-KEY-INST TO RPMST-INST.                         00225000
002260     MOVE RPXXX01-KEY-PRODCODE TO RPMST-PRODCODE.                 00226000
002270     MOVE RPXXX01-KEY-ACCOUNT TO RPMST-ACCOUNT.                   00227000
002280     MOVE RPXXX01-KEY-MODEL TO RPMST-MODEL.                       00228000
002290     PERFORM RPS-MST-GET-REQUEST.                                 00229000
002300     IF WS-FUNCTION IS EQUAL TO 'N'                               00230000
002310         AND RPIDX-IDNUMBER IS GREATER THAN SPACES                00231000
002320         MOVE 500022 TO RPXXX01-MSGNBR                            00232000
002330         GO TO VK-RETURN.                                         00233000
002340     IF WS-FUNCTION IS EQUAL TO 'N'                               00234000
002350         MOVE 500004 TO RPXXX01-MSGNBR                            00235000
002360         GO TO VK-RETURN.                                         00236000
002370     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00237000
002380         MOVE WS-AB6320 TO RPXXX01-ABORT                          00238000
002390         MOVE WS-TR0003 TO RPXXX01-ABTRACE                        00239000
002400         GO TO VK-RETURN.                                         00240000
002410     MOVE RPMST-IDNUMBER TO RPXXX01-IDNUMBER.                     00241000
002420     MOVE RPMST-REL-STAT TO RPXXX01-REL-STAT.                     00242000
002430     MOVE RPMST-QUAL-STAT TO RPXXX01-QUAL-STAT.                   00243000
002440     MOVE RPMST-LMNTDT TO RPXXX01-LMNTDT.                         00244000
002450     MOVE RPMST-DATE-OPENED TO RPXXX01-DATE-OPENED.               00245000
002460     MOVE RPMST-EXPIRATION-DATE TO RPXXX01-EXPIRE-DATE.           00246000
002470     MOVE RPMST-VF-EXP-DATE TO RPXXX01-EXTENSION-DATE.            00247000
002480     MOVE RPMST-COMBBAL1 TO RPXXX01-COMB-BAL1.                    00248000
002490     MOVE RPMST-COMBBAL2 TO RPXXX01-COMB-BAL2.                    00249000
002500     MOVE RPMST-COMBBAL3 TO RPXXX01-COMB-BAL3.                    00250000
002510     MOVE RPMST-COMBBAL4 TO RPXXX01-COMB-BAL4.                    00251000
002520     MOVE RPMST-OUT-FLAG TO RPXXX01-OUT-FLAG.                     00252000
002530 VK-7100.                                                         00253000
002540     PERFORM READ-MICM-7100.                                      00254000
002550     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00255000
002560         MOVE 500005 TO RPXXX01-MSGNBR                            00256000
002570         GO TO VK-RETURN.                                         00257000
002580 VK-CRW.                                                          00258000
002590     MOVE ZEROS TO RPXXX01-CRW-INST.                              00259000
002600     MOVE SPACES TO RPXXX01-CRW-PRODCODE.                         00260000
002610     MOVE SPACES TO RPXXX01-CRW-ACCOUNT.                          00261000
002620     MOVE LOW-VALUES TO RPCRW-GRP-KEY.                            00262000
002630     MOVE RPXXX01-KEY-INST TO RPCRW-INST.                         00263000
002640     MOVE RPXXX01-KEY-PRODCODE TO RPCRW-PRODCODE.                 00264000
002650     MOVE RPXXX01-KEY-ACCOUNT TO RPCRW-ACCOUNT.                   00265000
002660     MOVE RPXXX01-KEY-MODEL TO RPCRW-MODEL.                       00266000
002670     PERFORM RPS-CRW-GET-GE-REQUEST.                              00267000
002680     IF WS-FUNCTION IS EQUAL TO 'E'                               00268000
002690         GO TO VK-7101.                                           00269000
002700     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00270000
002710         MOVE WS-AB6350 TO RPXXX01-ABORT                          00271000
002720         MOVE WS-TR0008 TO RPXXX01-ABTRACE                        00272000
002730         GO TO VK-RETURN.                                         00273000
002740     IF RPXXX01-KEY-INST IS NOT EQUAL TO RPCRW-INST               00274000
002750         OR RPXXX01-KEY-PRODCODE IS NOT EQUAL TO RPCRW-PRODCODE   00275000
002760         OR RPXXX01-KEY-ACCOUNT IS NOT EQUAL TO RPCRW-ACCOUNT     00276000
002770         OR RPXXX01-KEY-MODEL IS NOT EQUAL TO RPCRW-MODEL         00277000
002780         GO TO VK-7101.                                           00278000
002790     MOVE RPCRW-INST2 TO RPXXX01-CRW-INST.                        00279000
002800     MOVE RPCRW-PRODCODE2 TO RPXXX01-CRW-PRODCODE.                00280000
002810     MOVE RPCRW-ACCOUNT2 TO RPXXX01-CRW-ACCOUNT.                  00281000
002820 VK-7101.                                                         00282000
002830     MOVE SPACES TO MI7101-RECORD.                                00283000
002840     MOVE RPXXX01-KEY-INST TO MIM-7101KINST.                      00284000
002850     MOVE +7101 TO MIM-7101KREC.                                  00285000
002860     MOVE RPMST-MODEL TO MIM-7101KMODEL.                          00286000
002870     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        00287000
002880     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00288000
002890     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00289000
002900     MOVE MI7101-RECORD TO MIMST-RECORD.                          00290000
002910     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00291000
002920     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00292000
002930         MOVE 500006 TO RPXXX01-MSGNBR                            00293000
002940         GO TO VK-RETURN.                                         00294000
002950     MOVE MIMST-RECORD TO MI7101-RECORD.                          00295000
002960     IF MIM-7101KINST IS NOT EQUAL TO RPMST-INST                  00296000
002970         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00297000
002980         OR MIM-7101KMODEL IS NOT EQUAL TO RPMST-MODEL            00298000
002990         MOVE 500006 TO RPXXX01-MSGNBR                            00299000
003000         GO TO VK-RETURN.                                         00300000
003010     MOVE MIM-7101KMODEL TO RPXXX01-KEY-MODEL.                    00301000
003020     MOVE MIM-7101DESC TO RPXXX01-MODEL-DESC.                     00302000
003030     IF MIM-7101PRIMBALOPT IS EQUAL TO 'Y'                        00303000
003040         AND MIM-7101PRIMBALOPT-I IS EQUAL TO 'Y'                 00304000
003050         MOVE 'Y' TO RPXXX01-PRIM-OPTION.                         00305000
003060     IF MIM-7101COMBCATCD1 IS EQUAL TO SPACES                     00306000
003070         MOVE ZEROS TO RPXXX01-COMB-REQ1                          00307000
003080         GO TO VK-COMB-REQ2.                                      00308000
003090     MOVE RPXXX01-KEY-INST TO WS-CAT-INST.                        00309000
003100     MOVE MIM-7101COMBCATCD1 TO WS-CAT-NBR.                       00310000
003110     PERFORM READ-MICM-7106.                                      00311000
003120     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00312000
003130         MOVE 500051 TO RPXXX01-MSGNBR                            00313000
003140         GO TO VK-RETURN.                                         00314000
003150     MOVE WS-7106-BALREQ (WS-SUB2) TO RPXXX01-COMB-REQ1.          00315000
003160 VK-COMB-REQ2.                                                    00316000
003170     IF MIM-7101COMBCATCD2 IS EQUAL TO SPACES                     00317000
003180         MOVE ZEROS TO RPXXX01-COMB-REQ2                          00318000
003190         GO TO VK-COMB-REQ3.                                      00319000
003200     MOVE RPXXX01-KEY-INST TO WS-CAT-INST.                        00320000
003210     MOVE MIM-7101COMBCATCD2 TO WS-CAT-NBR.                       00321000
003220     PERFORM READ-MICM-7106.                                      00322000
003230     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00323000
003240         MOVE 500051 TO RPXXX01-MSGNBR                            00324000
003250         GO TO VK-RETURN.                                         00325000
003260     MOVE WS-7106-BALREQ (WS-SUB2) TO RPXXX01-COMB-REQ2.          00326000
003270 VK-COMB-REQ3.                                                    00327000
003280     IF MIM-7101COMBCATCD3 IS EQUAL TO SPACES                     00328000
003290         MOVE ZEROS TO RPXXX01-COMB-REQ3                          00329000
003300         GO TO VK-COMB-REQ4.                                      00330000
003310     MOVE RPXXX01-KEY-INST TO WS-CAT-INST.                        00331000
003320     MOVE MIM-7101COMBCATCD3 TO WS-CAT-NBR.                       00332000
003330     PERFORM READ-MICM-7106.                                      00333000
003340     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00334000
003350         MOVE 500051 TO RPXXX01-MSGNBR                            00335000
003360         GO TO VK-RETURN.                                         00336000
003370     MOVE WS-7106-BALREQ (WS-SUB2) TO RPXXX01-COMB-REQ3.          00337000
003380 VK-COMB-REQ4.                                                    00338000
003390     IF MIM-7101COMBCATCD4 IS EQUAL TO SPACES                     00339000
003400         MOVE ZEROS TO RPXXX01-COMB-REQ4                          00340000
003410         GO TO VK-REL.                                            00341000
003420     MOVE RPXXX01-KEY-INST TO WS-CAT-INST.                        00342000
003430     MOVE MIM-7101COMBCATCD4 TO WS-CAT-NBR.                       00343000
003440     PERFORM READ-MICM-7106.                                      00344000
003450     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00345000
003460         MOVE 500051 TO RPXXX01-MSGNBR                            00346000
003470         GO TO VK-RETURN.                                         00347000
003480     MOVE WS-7106-BALREQ (WS-SUB2) TO RPXXX01-COMB-REQ4.          00348000
003490 VK-REL.                                                          00349000
003500     MOVE LOW-VALUES TO RPREL-GRP-KEY.                            00350000
003510     MOVE RPXXX01-KEY-RECORD TO RPREL-GRP-KEY.                    00351000
003520     MOVE ZEROS TO RPREL-INST2.                                   00352000
003530     MOVE SPACES TO RPREL-PRODCODE2                               00353000
003540     MOVE SPACES TO RPREL-ACCOUNT2.                               00354000
003550     PERFORM RPS-REL-GET-GE-REQUEST.                              00355000
003560     IF WS-FUNCTION IS EQUAL TO 'E'                               00356000
003570         MOVE 500013 TO RPXXX01-MSGNBR                            00357000
003580         GO TO VK-RETURN.                                         00358000
003590     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00359000
003600         MOVE WS-AB6330 TO RPXXX01-ABORT                          00360000
003610         MOVE WS-TR0004 TO RPXXX01-ABTRACE                        00361000
003620         GO TO VK-RETURN.                                         00362000
003630     IF RPXXX01-KEY-INST IS NOT EQUAL TO RPREL-INST               00363000
003640         OR RPXXX01-KEY-PRODCODE IS NOT EQUAL TO RPREL-PRODCODE   00364000
003650         OR RPXXX01-KEY-ACCOUNT IS NOT EQUAL TO RPREL-ACCOUNT     00365000
003660         OR RPXXX01-KEY-MODEL IS NOT EQUAL TO RPREL-MODEL         00366000
003670         OR RPREL-INST2 IS GREATER THAN ZEROS                     00367000
003680         MOVE 000057 TO RPXXX01-MSGNBR                            00368000
003690         GO TO VK-RETURN.                                         00369000
003700     MOVE RPREL-PRIMEBAL TO RPXXX01-PRIM-BAL.                     00370000
003710 VK-7102.                                                         00371000
003720     PERFORM READ-MICM-7102.                                      00372000
003730     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00373000
003740         MOVE SPACES TO MIM-7102PRIMCATCD                         00374000
003750         MOVE 500007 TO WS-SAVE-MSGNBR.                           00375000
003760     IF MIM-7102PRIMCATCD IS EQUAL TO SPACES                      00376000
003770         MOVE ZEROS TO RPXXX01-PRIM-REQ                           00377000
003780         GO TO VK-NAME.                                           00378000
003790     MOVE RPXXX01-KEY-INST TO WS-CAT-INST.                        00379000
003800     MOVE MIM-7102PRIMCATCD TO WS-CAT-NBR.                        00380000
003810     PERFORM READ-MICM-7106.                                      00381000
003820     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00382000
003830         MOVE 500011 TO RPXXX01-MSGNBR                            00383000
003840         GO TO VK-RETURN.                                         00384000
003850     MOVE WS-7106-BALREQ (WS-SUB2) TO RPXXX01-PRIM-REQ.           00385000
003860 VK-NAME.                                                         00386000
003870     MOVE SPACES TO RPRF21-FUNCTION.                              00387000
003880     PERFORM REQUEST-CUSTOMER.                                    00388000
003890     IF WS-FUNCTION IS EQUAL TO 'B'                               00389000
003900         MOVE 'Y' TO WS-CLOSE-FLAG                                00390000
003910         MOVE SPACES TO WS-FUNCTION.                              00391000
003920     IF WS-FUNCTION IS EQUAL TO SPACES                            00392000
003930         MOVE RPRF21-BASE-CUST-TYPE TO RPXXX01-CUST-TYPE          00393000
003940         MOVE RPRF21-NAME TO RPXXX01-CUST-NAME                    00394000
003950         GO TO VK-EXIT.                                           00395000
003960     IF RPXXX01-MSGNBR IS EQUAL TO ZEROS                          00396000
003970         MOVE 500016 TO RPXXX01-MSGNBR.                           00397000
P0077      MOVE 'CUSTOMER NOT FOUND' TO RPXXX01-CUST-NAME               00398000
P0077      GO TO VK-EXIT.                                               00398290
003990 VK-RETURN.                                                       00399000
004000     MOVE 'E' TO RPXXX01-RETURN.                                  00400000
004010     PERFORM SET-RPXXX01-RETURN.                                  00401000
004020     GO TO CICS-RETURN.                                           00402000
004030 VK-EXIT.                                                         00403000
004040     EXIT.                                                        00404000
004050******************************************************************00405000
004060 ROUTING-ROUTINE SECTION.                                         00406000
004070 RR-START.                                                        00407000
004080     PERFORM INITIALIZE-MSG.                                      00408000
004090     PERFORM LOAD-REL-RECORDS.                                    00409000
004100     IF RPXXX01-MSGNBR IS GREATER THAN ZEROS                      00410000
004110         MOVE '1' TO RPXXX01-SELECT-RTN                           00411000
004120         MOVE 'E' TO RPXXX01-RETURN                               00412000
004130         GO TO RR-RETURN.                                         00413000
004140     IF RPXXX01-OCCUR IS EQUAL TO ZERO                            00414000
004150         MOVE '2' TO RPXXX01-SELECT-RTN                           00415000
004160         MOVE 500013 TO RPXXX01-MSGNBR                            00416000
004170         GO TO RR-RETURN.                                         00417000
004180     IF WS-CLOSE-FLAG IS EQUAL TO 'Y'                             00418000
004190         MOVE 500045 TO RPXXX01-MSGNBR                            00419000
004200         GO TO RR-CONT.                                           00420000
004210     IF WS-SAVE-MSGNBR IS NOT EQUAL TO ZEROS                      00421000
004220         MOVE WS-SAVE-MSGNBR TO RPXXX01-MSGNBR.                   00422000
004230 RR-CONT.                                                         00423000
004240     PERFORM SET-RPXXX01-RETURN.                                  00424000
004250 RR-RETURN.                                                       00425000
004260     GO TO CICS-RETURN.                                           00426000
004270 RR-EXIT.                                                         00427000
004280     EXIT.                                                        00428000
004290******************************************************************00429000
004300 INITIALIZE-MSG SECTION.                                          00430000
004310 IM-START.                                                        00431000
004320     MOVE ZEROS TO RPXXX01-MSGNBR.                                00432000
004330     MOVE +0000 TO RPXXX01-ABORT.                                 00433000
004340     MOVE +0000 TO RPXXX01-ERRCNT.                                00434000
004350     MOVE +0000 TO RPXXX01-OCCUR.                                 00435000
004360     MOVE SPACE TO RPXXX01-SELECT-RTN.                            00436000
004370 IM-LOOP-SET-UP.                                                  00437000
004380     MOVE +0 TO WS-SUB1.                                          00438000
004390 IM-LOOP.                                                         00439000
004400     ADD +1 TO WS-SUB1.                                           00440000
004410     IF WS-SUB1 IS GREATER THAN WS-MAX-PANEL-ENTRIES              00441000
004420         GO TO IM-EXIT.                                           00442000
004430     MOVE SPACE TO RPXXX01-RET-KEY (WS-SUB1).                     00443000
004440     MOVE SPACE TO RPXXX01-RET-CATCD-01 (WS-SUB1).                00444000
004450     MOVE ZEROS TO RPXXX01-RET-BAL-01 (WS-SUB1).                  00445000
004460     MOVE ZEROS TO RPXXX01-RET-REQ-01 (WS-SUB1).                  00446000
004470     MOVE SPACE TO RPXXX01-RET-CATCD-02 (WS-SUB1).                00447000
004480     MOVE ZEROS TO RPXXX01-RET-BAL-02 (WS-SUB1).                  00448000
004490     MOVE ZEROS TO RPXXX01-RET-REQ-02 (WS-SUB1).                  00449000
004500     GO TO IM-LOOP.                                               00450000
004510 IM-EXIT.                                                         00451000
004520     EXIT.                                                        00452000
004530******************************************************************00453000
004540 LOAD-REL-RECORDS SECTION.                                        00454000
004550 LRR-START.                                                       00455000
004560     MOVE +1 TO WS-SUB1.                                          00456000
004570     MOVE RPXXX01-KEY-RECORD TO RPREL-GRP-KEY.                    00457000
004580     PERFORM RPS-REL-GET-GE-REQUEST.                              00458000
004590     IF WS-FUNCTION IS EQUAL TO 'E'                               00459000
004600         GO TO LRR-EXIT.                                          00460000
004610     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00461000
004620         MOVE WS-AB6330 TO RPXXX01-ABORT                          00462000
004630         MOVE WS-TR0005 TO RPXXX01-ABTRACE                        00463000
004640         GO TO CICS-ABORT-EXIT.                                   00464000
004650     GO TO LRR-CONT.                                              00465000
004660 LRR-GET-NEXT.                                                    00466000
004670     MOVE SPACES TO WS-FUNCTION.                                  00467000
004680     PERFORM RPS-REL-GET-NEXT-REQUEST.                            00468000
004690     IF WS-FUNCTION IS EQUAL TO 'E'                               00469000
004700         GO TO LRR-EXIT.                                          00470000
004710     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00471000
004720         MOVE WS-AB6330 TO RPXXX01-ABORT                          00472000
004730         MOVE WS-TR0006 TO RPXXX01-ABTRACE                        00473000
004740         GO TO CICS-ABORT-EXIT.                                   00474000
004750 LRR-CONT.                                                        00475000
004760     IF WS-SUB1 IS GREATER THAN WS-MAX-PANEL-ENTRIES              00476000
004770         GO TO LRR-EXIT.                                          00477000
004780     IF RPXXX01-KEY-INST IS NOT EQUAL TO RPREL-INST               00478000
004790         OR RPXXX01-KEY-PRODCODE IS NOT EQUAL TO RPREL-PRODCODE   00479000
004800         OR RPXXX01-KEY-ACCOUNT IS NOT EQUAL TO RPREL-ACCOUNT     00480000
004810         OR RPXXX01-KEY-MODEL IS NOT EQUAL TO RPREL-MODEL         00481000
004820         GO TO LRR-EXIT.                                          00482000
004830     IF RPREL-INST2 IS NOT GREATER THAN ZEROS                     00483000
004840         AND RPXXX01-PRIM-OPTION IS NOT EQUAL TO 'Y'              00484000
004850         GO TO LRR-GET-NEXT.                                      00485000
004860     IF RPREL-ACCT-STATUS IS EQUAL TO 'R'                         00486000
004870         GO TO LRR-GET-NEXT.                                      00487000
004880     MOVE RPREL-ACCT2-GRP TO RPXXX01-RET-KEY (WS-SUB1).           00488000
004890     PERFORM READ-MICM-7102.                                      00489000
004900     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00490000
004910         MOVE SPACES TO MIM-7102BALCATCD1                         00491000
004920         MOVE SPACES TO MIM-7102BALCATCD2                         00492000
004930         MOVE 500007 TO WS-SAVE-MSGNBR.                           00493000
004940     IF RPXXX01-RET-INST (WS-SUB1) IS NOT GREATER THAN ZEROS      00494000
004950         MOVE RPXXX01-RET-KEY (WS-SUB1) TO RPREL-ACCT2-GRP.       00495000
004960 LRR-BAL-1.                                                       00496000
004970     MOVE RPREL-ACCTBAL-1 TO RPXXX01-RET-BAL-01 (WS-SUB1).        00497000
004980     IF MIM-7102BALCATCD1 IS EQUAL TO SPACES                      00498000
004990         OR MIM-7102BALCATCD1-I IS NOT EQUAL TO 'Y'               00499000
005000         GO TO LRR-BAL-2.                                         00500000
005010     MOVE RPXXX01-KEY-INST TO WS-CAT-INST.                        00501000
005020     MOVE MIM-7102BALCATCD1 TO WS-CAT-NBR.                        00502000
005030     MOVE MIM-7102BALCATCD1 TO RPXXX01-RET-CATCD-01 (WS-SUB1).    00503000
005040     PERFORM READ-MICM-7106.                                      00504000
005050     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00505000
005060         MOVE 500049 TO RPXXX01-MSGNBR                            00506000
005070         GO TO LRR-EXIT.                                          00507000
005080     MOVE WS-7106-BALREQ (WS-SUB2)                                00508000
005090         TO RPXXX01-RET-REQ-01 (WS-SUB1).                         00509000
005100 LRR-BAL-2.                                                       00510000
005110     MOVE RPREL-ACCTBAL-2 TO RPXXX01-RET-BAL-02 (WS-SUB1).        00511000
005120     IF MIM-7102BALCATCD2 IS EQUAL TO SPACES                      00512000
005130         OR MIM-7102BALCATCD2-I IS NOT EQUAL TO 'Y'               00513000
005140         GO TO LRR-LOOP.                                          00514000
005150     MOVE RPXXX01-KEY-INST TO WS-CAT-INST.                        00515000
005160     MOVE MIM-7102BALCATCD2 TO WS-CAT-NBR.                        00516000
005170     MOVE MIM-7102BALCATCD2 TO RPXXX01-RET-CATCD-02 (WS-SUB1).    00517000
005180     PERFORM READ-MICM-7106.                                      00518000
005190     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00519000
005200         MOVE 500050 TO RPXXX01-MSGNBR                            00520000
005210         GO TO LRR-EXIT.                                          00521000
005220     MOVE WS-7106-BALREQ (WS-SUB2)                                00522000
005230         TO RPXXX01-RET-REQ-02 (WS-SUB1).                         00523000
005240 LRR-LOOP.                                                        00524000
005250     ADD +1 TO WS-SUB1.                                           00525000
005260     ADD +1 TO RPXXX01-OCCUR.                                     00526000
005270     GO TO LRR-GET-NEXT.                                          00527000
005280 LRR-EXIT.                                                        00528000
005290     EXIT.                                                        00529000
005300******************************************************************00530000
005310 READ-MICM-7100 SECTION.                                          00531000
005320 RM7100-START.                                                    00532000
005330     MOVE SPACES TO WS-FUNCTION.                                  00533000
005340     MOVE SPACES TO MI7100-RECORD.                                00534000
005350     MOVE RPXXX01-KEY-INST TO MIM-7100KINST.                      00535000
005360 RM7100-LOOP.                                                     00536000
005370     MOVE +7100 TO MIM-7100KREC.                                  00537000
005380     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00538000
005390     MOVE MI7100-RECORD TO MIMST-RECORD.                          00539000
005400     PERFORM MIC-MST-GET-REQUEST.                                 00540000
005410     MOVE MIMST-RECORD TO MI7100-RECORD.                          00541000
005420     IF WS-FUNCTION IS EQUAL TO 'N'                               00542000
005430         AND MIM-7100KINST IS GREATER THAN ZEROS                  00543000
005440         GO TO RM7100-ZERO.                                       00544000
005450     GO TO RM7100-EXIT.                                           00545000
005460 RM7100-ZERO.                                                     00546000
005470     MOVE SPACES TO MI7100-RECORD.                                00547000
005480     MOVE ZEROS TO MIM-7100KINST.                                 00548000
005490     GO TO RM7100-LOOP.                                           00549000
005500 RM7100-EXIT.                                                     00550000
005510     EXIT.                                                        00551000
005520******************************************************************00552000
005530 READ-MICM-7102 SECTION.                                          00553000
005540 RM7102-START.                                                    00554000
005550     MOVE SPACE TO WS-FUNCTION.                                   00555000
005560     IF RPREL-INST2 IS NOT GREATER THAN ZEROS                     00556000
005570         MOVE RPREL-INST TO RPREL-INST2                           00557000
005580         MOVE RPREL-PRODCODE TO RPREL-PRODCODE2.                  00558000
005590     IF RPREL-PRODCODE2 IS EQUAL TO WS-SAVE-PRODCODE              00559000
005600         AND RPREL-ACCT-TYPE IS EQUAL TO WS-SAVE-ACCT-TYPE        00560000
005610         MOVE WS-SAVEFUNC TO WS-FUNCTION                          00561000
005620         GO TO RM7102-EXIT.                                       00562000
005630     MOVE RPREL-PRODCODE2 TO WS-SAVE-PRODCODE.                    00563000
005640     MOVE RPREL-ACCT-TYPE TO WS-SAVE-ACCT-TYPE.                   00564000
005650 RM7102-LOOP.                                                     00565000
005660     MOVE SPACE TO WS-FUNCTION.                                   00566000
005670     MOVE SPACES TO MI7102-RECORD.                                00567000
005680     MOVE RPXXX01-KEY-INST TO MIM-7102KINST.                      00568000
005690     MOVE +7102 TO MIM-7102KREC.                                  00569000
005700     MOVE RPREL-MODEL TO MIM-7102KMODEL.                          00570000
005710     MOVE RPREL-PRODCODE2 TO MIM-7102KPRODCODE.                   00571000
005720     MOVE RPREL-ACCT-TYPE TO MIM-7102KACCTTYPE.                   00572000
005730     MOVE MIC-RPS-7102-PRI TO MIC-MST-REC-PRI.                    00573000
005740     MOVE MI7102-RECORD TO MIMST-RECORD.                          00574000
005750     PERFORM MIC-MST-GET-REQUEST.                                 00575000
005760     MOVE MIMST-RECORD TO MI7102-RECORD.                          00576000
005770     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00577000
005780         AND RPREL-PRODCODE2 IS EQUAL TO SPACES                   00578000
005790         AND RPREL-ACCT-TYPE IS EQUAL TO ZEROS                    00579000
005800         GO TO RM7102-END.                                        00580000
005810     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00581000
005820         AND RPREL-ACCT-TYPE IS EQUAL TO ZEROS                    00582000
005830         AND WS-7102-DEF-FLAG IS EQUAL TO 'Y'                     00583000
005840         MOVE SPACES TO WS-FUNCTION                               00584000
005850         MOVE WS-7102-DEF-RECORD TO MI7102-RECORD                 00585000
005860         GO TO RM7102-END.                                        00586000
005870     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00587000
005880         AND RPREL-ACCT-TYPE IS NOT EQUAL TO ZEROS                00588000
005890         MOVE ZEROS TO RPREL-ACCT-TYPE                            00589000
005900         GO TO RM7102-LOOP.                                       00590000
005910     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00591000
005920         AND RPREL-PRODCODE2 IS NOT EQUAL TO SPACES               00592000
005930         MOVE SPACES TO RPREL-PRODCODE2                           00593000
005940         GO TO RM7102-LOOP.                                       00594000
005950     IF WS-FUNCTION IS EQUAL TO SPACES                            00595000
005960         AND RPREL-PRODCODE2 IS EQUAL TO SPACES                   00596000
005970         AND RPREL-ACCT-TYPE IS EQUAL TO ZEROS                    00597000
005980         MOVE 'Y' TO WS-7102-DEF-FLAG                             00598000
005990         MOVE MI7102-RECORD TO WS-7102-DEF-RECORD.                00599000
006000 RM7102-END.                                                      00600000
006010     MOVE WS-SAVE-PRODCODE TO RPREL-PRODCODE2.                    00601000
006020     MOVE WS-SAVE-ACCT-TYPE TO RPREL-ACCT-TYPE.                   00602000
006030 RM7102-SAVE-FUNC.                                                00603000
006040     MOVE WS-FUNCTION TO WS-SAVEFUNC.                             00604000
006050 RM7102-EXIT.                                                     00605000
006060     EXIT.                                                        00606000
006070******************************************************************00607000
006080 READ-MICM-7106 SECTION.                                          00608000
006090 RM7106-START.                                                    00609000
006100     MOVE SPACE TO WS-FUNCTION.                                   00610000
006110     MOVE ZERO TO WS-SUB2.                                        00611000
006120     IF WS-CAT-INST IS NOT NUMERIC                                00612000
006130         OR WS-CAT-INST IS EQUAL TO ZEROS                         00613000
006140         MOVE RPXXX01-KEY-INST TO WS-CAT-INST.                    00614000
006150 RM7106-LOOP.                                                     00615000
006160     IF WS-SUB2 IS GREATER THAN WS-MAX-CATEGORY                   00616000
006170         MOVE 'N' TO WS-FUNCTION                                  00617000
006180         GO TO RM7106-EXIT.                                       00618000
006190     IF WS-7106-CAT (WS-SUB2) IS EQUAL TO SPACES                  00619000
006200         GO TO RM7106-READ.                                       00620000
006210     IF WS-CAT-INST IS EQUAL TO WS-7106-INST (WS-SUB2)            00621000
006220         AND WS-CAT-NBR IS EQUAL TO WS-7106-CAT (WS-SUB2)         00622000
006230         GO TO RM7106-EXIT.                                       00623000
006240     ADD +0001 TO WS-SUB2.                                        00624000
006250     GO TO RM7106-LOOP.                                           00625000
006260 RM7106-READ.                                                     00626000
006270     MOVE SPACES TO MI7106-RECORD.                                00627000
006280     MOVE WS-CAT-INST TO MIM-7106KINST.                           00628000
006290     MOVE +7106 TO MIM-7106KREC.                                  00629000
006300     MOVE WS-CAT-NBR TO MIM-7106KRPREC.                           00630000
006310     MOVE MIC-RPS-7106-PRI TO MIC-MST-REC-PRI.                    00631000
006320     MOVE MI7106-RECORD TO MIMST-RECORD.                          00632000
006330     PERFORM MIC-MST-GET-REQUEST.                                 00633000
006340     MOVE MIMST-RECORD TO MI7106-RECORD.                          00634000
006350     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00635000
006360         GO TO RM7106-EXIT.                                       00636000
006370     MOVE MIM-7106KINST TO WS-7106-INST (WS-SUB2).                00637000
006380     MOVE MIM-7106KRPREC TO WS-7106-CAT (WS-SUB2).                00638000
006390     MOVE MIM-7106BALREQ-I TO WS-7106-BALREQ (WS-SUB2).           00639000
006400 RM7106-EXIT.                                                     00640000
006410     EXIT.                                                        00641000
006420******************************************************************00642000
006430 SET-RPXXX01-RETURN SECTION.                                      00643000
006440 SCR-START.                                                       00644000
006450     IF RPXXX01-OCCUR IS EQUAL TO ZERO                            00645000
006460         MOVE '1' TO RPXXX01-SELECT-RTN                           00646000
006470         GO TO SCR-EXIT.                                          00647000
006480     IF RPXXX01-OCCUR IS LESS THAN WS-MAX-PANEL-ENTRIES           00648000
006490         MOVE '2' TO RPXXX01-SELECT-RTN                           00649000
006500         GO TO SCR-EXIT.                                          00650000
006510     IF RPXXX01-OCCUR IS GREATER THAN WS-MAX-PANEL-ENTRIES        00651000
006520         OR RPXXX01-OCCUR IS EQUAL TO WS-MAX-PANEL-ENTRIES        00652000
006530         MOVE '3' TO RPXXX01-SELECT-RTN.                          00653000
006540 SCR-EXIT.                                                        00654000
006550     EXIT.                                                        00655000
006560******************************************************************00656000
006570 LOCATE-IDNUMBER-BY-APPL SECTION.                                 00657000
006580 LIBA-START.                                                      00658000
006590     MOVE ZERO TO WS-SUB1.                                        00659000
006600     MOVE RPXXX01-KEY-INST TO MIM-2023KINST.                      00660000
006610     MOVE 'RP' TO MIM-2023KPRODCODE.                              00661000
006620     MOVE RPXXX01-INST-OPT-1 TO SLW096-BANKS.                     00662000
006630     PERFORM SLP096-GET-2023-RECORD.                              00663000
006640     IF SLW096-FUNCTION IS EQUAL TO SPACES                        00664000
006650         MOVE MIM-2023KPRODCODE TO WS-RP-PRODCODE                 00665000
006660         GO TO LIBA-READ-IDX.                                     00666000
006670 LIBA-FIND-ACT-LOOP.                                              00667000
006680     ADD +1 TO WS-SUB1.                                           00668000
006690     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00669000
006700         MOVE 'N' TO WS-FUNCTION                                  00670000
006710         GO TO LIBA-EXIT.                                         00671000
006720     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00672000
006730         IS NOT EQUAL TO RPXXX01-APPL                             00673000
006740         GO TO LIBA-FIND-ACT-LOOP.                                00674000
006750     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO WS-RP-PRODCODE.       00675000
006760 LIBA-READ-IDX.                                                   00676000
006770     MOVE RPXXX01-KEY-INST TO RPIDX-INST.                         00677000
006780     MOVE WS-RP-PRODCODE TO RPIDX-PRODCODE.                       00678000
006790     MOVE RPXXX01-KEY-IDNUMBER TO RPIDX-IDNUMBER.                 00679000
006800     PERFORM RPS-IDX-GET-REQUEST.                                 00680000
006810     IF WS-FUNCTION IS EQUAL TO 'N'                               00681000
006820         GO TO LIBA-EXIT.                                         00682000
006830     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00683000
006840         MOVE WS-AB6310 TO RPXXX01-ABORT                          00684000
006850         MOVE WS-TR0007 TO RPXXX01-ABTRACE                        00685000
006860         GO TO CICS-ABORT-EXIT.                                   00686000
006870     MOVE RPIDX-ACCT2-KEY TO RPXXX01-KEY-RECORD.                  00687000
006880 LIBA-EXIT.                                                       00688000
006890     EXIT.                                                        00689000
006900******************************************************************00690000
000000 COPY RPPCRWA.                                                    00691000
006920******************************************************************00692000
000000 COPY RPPIDXA.                                                    00693000
006940******************************************************************00694000
000000 COPY RPPMSTA.                                                    00695000
006960******************************************************************00696000
000000 COPY RPPRELA.                                                    00697000
006980******************************************************************00698000
006990 MIC-MST-API SECTION.                                             00699000
000000 COPY MIPMSTA.                                                    00700000
007010******************************************************************00701000
007020 SLP096-GET-2023-RECORD SECTION.                                  00702000
000000 COPY SLP096.                                                     00703000
007040******************************************************************00704000
007050 REQUEST-CUSTOMER SECTION.                                        00705000
007060 RC-START.                                                        00706000
007070     MOVE 'A' TO RPRF21-FUNC.                                     00707000
007080     MOVE RPMST-INST TO RPRF21-BASE-ACCT-INST.                    00708000
007090     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00709000
007100         AND MIM-7100ENTERPRISEINST IS GREATER THAN ZEROS         00710000
007110         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00711000
007120     MOVE RPMST-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.            00712000
007130     MOVE RPMST-ACCOUNT TO RPRF21-BASE-ACCT.                      00713000
007140     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          00714000
007150     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             00715000
007160     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         00716000
007170     EXEC CICS LINK                                               00717000
007180         PROGRAM('RPO0RF21')                                      00718000
007190         COMMAREA(RPRF21-MESSAGE)                                 00719000
007200         LENGTH(LENGTH OF RPRF21-MESSAGE)                         00720000
007210         RESP(WS-CICS-RESPONSE)                                   00721000
007220         END-EXEC.                                                00722000
007230     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         00723000
007240     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00724000
007250         MOVE 'L' TO WS-FUNCTION                                  00725000
007260         MOVE 500036 TO RPXXX01-MSGNBR                            00726000
007270         GO TO RC-EXIT.                                           00727000
007280     IF WS-FUNCTION IS EQUAL TO 'B'                               00728000
007290         GO TO RC-EXIT.                                           00729000
007300     IF WS-FUNCTION IS EQUAL TO 'C'                               00730000
007310         MOVE 500037 TO RPXXX01-MSGNBR                            00731000
007320         GO TO RC-EXIT.                                           00732000
007330     IF WS-FUNCTION IS EQUAL TO 'I'                               00733000
007340         MOVE 500038 TO RPXXX01-MSGNBR.                           00734000
007350 RC-EXIT.                                                         00735000
007360     EXIT.                                                        00736000
007370******************************************************************00737000
007380 FIND-DEFAULT-MODEL SECTION.                                      00738000
007390 FDM-START.                                                       00739000
007400     MOVE 'N' TO WS-ERRORMODEL.                                   00740000
007410     MOVE RPXXX01-KEY-INST TO RPMST-INST.                         00741000
007420     MOVE RPXXX01-KEY-PRODCODE TO RPMST-PRODCODE.                 00742000
007430     MOVE RPXXX01-KEY-ACCOUNT TO RPMST-ACCOUNT.                   00743000
007440     IF RPXXX01-KEY-MODEL IS EQUAL TO LOW-VALUE                   00744000
007450         MOVE SPACES TO RPXXX01-KEY-MODEL.                        00745000
007460     MOVE RPXXX01-KEY-MODEL TO RPMST-MODEL.                       00746000
007470     PERFORM RPS-MST-GET-GE-REQUEST.                              00747000
007480     IF WS-FUNCTION IS EQUAL TO 'N'                               00748000
007490         OR WS-FUNCTION IS EQUAL TO 'E'                           00749000
007500         GO TO FDM-RECORD-NOT-FOUND.                              00750000
007510     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00751000
007520         MOVE WS-AB6320 TO RPXXX01-ABORT                          00752000
007530         MOVE WS-TR0009 TO RPXXX01-ABTRACE                        00753000
007540         MOVE 'Y' TO WS-ERRORMODEL                                00754000
007550         GO TO FDM-EXIT.                                          00755000
007560     IF RPMST-INST IS EQUAL TO RPXXX01-KEY-INST                   00756000
007570         AND RPMST-PRODCODE IS EQUAL TO RPXXX01-KEY-PRODCODE      00757000
007580         AND RPMST-ACCOUNT IS EQUAL TO RPXXX01-KEY-ACCOUNT        00758000
007590         GO TO FDM-GET-NEXT-MST.                                  00759000
007600     GO TO FDM-RECORD-NOT-FOUND.                                  00760000
007610 FDM-GET-NEXT-MST.                                                00761000
007620     MOVE RPMST-MODEL TO RPXXX01-KEY-MODEL.                       00762000
007630     MOVE RPXXX01-KEY-INST TO WS-SAVEMSTINST.                     00763000
007640     MOVE RPXXX01-KEY-PRODCODE TO WS-SAVEMSTPRODCODE.             00764000
007650     MOVE RPXXX01-KEY-ACCOUNT TO WS-SAVEMSTACCOUNT.               00765000
007660     MOVE RPXXX01-KEY-MODEL TO WS-SAVEMSTMODEL.                   00766000
007670     PERFORM RPS-MST-GET-NEXT-REQUEST.                            00767000
007680     IF WS-FUNCTION IS EQUAL TO 'E'                               00768000
007690         GO TO FDM-GOOD-RECORD.                                   00769000
007700     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00770000
007710         MOVE WS-AB6320 TO RPXXX01-ABORT                          00771000
007720         MOVE WS-TR0010 TO RPXXX01-ABTRACE                        00772000
007730         MOVE 'Y' TO WS-ERRORMODEL                                00773000
007740         GO TO FDM-EXIT.                                          00774000
007750     IF RPMST-INST IS EQUAL TO RPXXX01-KEY-INST                   00775000
007760         AND RPMST-PRODCODE IS EQUAL TO RPXXX01-KEY-PRODCODE      00776000
007770         AND RPMST-ACCOUNT IS EQUAL TO RPXXX01-KEY-ACCOUNT        00777000
007780         GO TO FDM-MULTIPLE-PRIM.                                 00778000
007790 FDM-GOOD-RECORD.                                                 00779000
007800     MOVE WS-SAVEMSTINST TO RPXXX01-KEY-INST.                     00780000
007810     MOVE WS-SAVEMSTPRODCODE TO RPXXX01-KEY-PRODCODE.             00781000
007820     MOVE WS-SAVEMSTACCOUNT TO RPXXX01-KEY-ACCOUNT.               00782000
007830     MOVE WS-SAVEMSTMODEL TO RPXXX01-KEY-MODEL.                   00783000
007840     GO TO FDM-EXIT.                                              00784000
007850 FDM-RECORD-NOT-FOUND.                                            00785000
007860     MOVE 'Y' TO WS-ERRORMODEL.                                   00786000
007870     MOVE 500004 TO RPXXX01-MSGNBR.                               00787000
007880     GO TO FDM-EXIT.                                              00788000
007890 FDM-MULTIPLE-PRIM.                                               00789000
007900     MOVE 'Y' TO WS-ERRORMODEL.                                   00790000
007910     MOVE 500090 TO RPXXX01-MSGNBR.                               00791000
007920 FDM-EXIT.                                                        00792000
007930     EXIT.                                                        00793000
007940******************************************************************00794000
007950 CICS-ABORT-EXIT SECTION.                                         00795000
007960 CAE-START.                                                       00796000
007970     GO TO CICS-RETURN.                                           00797000
007980 CAE-EXIT.                                                        00798000
007990     EXIT.                                                        00799000
008000******************************************************************00800000
008010 CICS-RETURN SECTION.                                             00801000
008020     IF COM-ABORT IS NOT EQUAL TO ZERO                            00802000
008030         MOVE COM-ABORT TO RPXXX01-ABORT.                         00803000
008040     IF RPXXX01-ABORT IS NOT EQUAL TO ZERO                        00804000
008050         MOVE WS-FUNCTION TO RPXXX01-FUNCTION                     00805000
008060         MOVE SRB-BMDB TO RPXXX01-SRBMDB                          00806000
008070         MOVE EIBFN TO RPXXX01-ABEIBFN                            00807000
008080         MOVE EIBRESP TO RPXXX01-ABEIBRESP                        00808000
008090         MOVE EIBRESP2 TO RPXXX01-ABEIBRESP2                      00809000
008100         MOVE EIBRCODE TO RPXXX01-ABEIBRCODE.                     00810000
008110     IF RPXXX01-ABTYPE IS NOT EQUAL TO 'Y'                        00811000
008120         PERFORM GLOBAL-CLOSE.                                    00812000
000000 COPY SLP709.                                                     00813000
008140******************************************************************00814000
008150 GLOBAL-CLOSE SECTION.                                            00815000
008160 GC-START.                                                        00816000
008170     IF RPXXX01-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  00817000
008180         PERFORM RPS-MST-GLOBAL-CLOSE-REQUEST.                    00818000
008190 GC-EXIT.                                                         00819000
008200     EXIT.                                                        00820000
008210******************************************************************00821000
