000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX02.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX02 - RELATIONSHIP NEW MODULE                          *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW000-AREAS.                                                00016000
000000 COPY SRW000.                                                     00017000
P0075  01  SRW009-AREAS.                                                00017300
000000 COPY SRW009.                                                     00017600
000180 01  SRW025-AREAS.                                                00018000
000000 COPY SRW025.                                                     00019000
000200 01  SRW079-AREAS.                                                00020000
000000 COPY SRW079.                                                     00021000
000220 01  SRW105-AREAS.                                                00022000
000000 COPY SRW105.                                                     00023000
000240*01  BICRSRB.                                                     00024000
000000 COPY BICRSRB.                                                    00025000
000260*01  BICRPSB.                                                     00026000
000000 COPY BICRPSB.                                                    00027000
000280*01  BICRVERB.                                                    00028000
000000 COPY BICRVERB.                                                   00029000
000300*01  BICRSTAT.                                                    00030000
000000 COPY BICRSTAT.                                                   00031000
000320*01  BICRDBS.                                                     00032000
000000 COPY BICRDBS.                                                    00033000
000340*01  BICRLOG.                                                     00034000
000000 COPY BICRLOG.                                                    00035000
000360 01  SRW710-AREAS.                                                00036000
000000 COPY SRW710.                                                     00037000
000380 01  WS-WORKAREAS.                                                00038000
000390     03  COM-ABORT               PIC S9(04)      COMP.            00039000
000400     03  WS-SUB1                 PIC S9(04)      COMP             00040000
000410                                                 VALUE +0000.     00041000
000420     03  WS-SUB2                 PIC S9(04)      COMP             00042000
000430                                                 VALUE +0000.     00043000
000440     03  WS-KEEP-FLAG            PIC X(01)       VALUE SPACES.    00044000
000450     03  WS-INTERFACE            PIC X(01)       VALUE SPACES.    00045000
000460     03  WS-DATE-TEST            PIC X(01)       VALUE 'N'.       00046000
000470     03  WS-UPDATESW             PIC X(01)       VALUE SPACES.    00047000
000480     03  WS-ACT-FLAG             PIC X(01)       VALUE SPACES.    00048000
000490     03  WS-BALCATCD1-FAIL       PIC X(01)       VALUE SPACES.    00049000
000500     03  WS-PRIMOPT-FAIL         PIC X(01)       VALUE SPACES.    00050000
P0075      03  WS-EXPDT-ERROR          PIC X(01)       VALUE SPACES.    00050500
000510     03  WS-NUM-15               PIC S9(15)      VALUE ZEROS.     00051000
000520     03  WS-WORK-TRUE            PIC X(15).                       00052000
000530     03  WS-WORK-TRUEX   REDEFINES WS-WORK-TRUE.                  00053000
000540         05  WS-TRUE-SW          PIC X(01)       OCCURS 15 TIMES. 00054000
000550     03  WS-WORK-CATCD           PIC X(06)       VALUE SPACES.    00055000
000560     03  WS-WORK-BALCD           PIC 9(02)       VALUE ZEROS.     00056000
000570     03  WS-WORK-BALANCE         PIC S9(13)V99   COMP-3           00057000
000580                                                 VALUE ZEROS.     00058000
000590     03  WS-SUB99                PIC S9(04)      COMP             00059000
000600                                                 VALUE +0000.     00060000
000610     03  WS-SAVE-PRODCODE        PIC X(06)       VALUE SPACES.    00061000
000620     03  WS-SAVE-ACCT-TYPE       PIC 9(03)       VALUE ZEROS.     00062000
000630     03  WS-2023RPOPTION         PIC X(01)       VALUE SPACES.    00063000
000640     03  WS-IDNBR-GRP            PIC 9(18)       VALUE ZERO.      00064000
P0037      03  WS-IDNBR        REDEFINES WS-IDNBR-GRP.                  00065000
000660         05  WS-IDNBR-DATE       PIC 9(08).                       00066000
000670         05  WS-IDNBR-TIME       PIC 9(06).                       00067000
P0037          05  WS-IDNBR-DECSEC     PIC 9(02).                       00068000
P0037          05  WS-IDNBR-SEQ        PIC 9(02).                       00068290
000690     03  WS-CYEAR-FIRST          PIC X(08).                       00069000
000700     03  FILLER          REDEFINES WS-CYEAR-FIRST.                00070000
000710         05  WS-CYYYY            PIC 9(04).                       00071000
000720         05  WS-CMM              PIC 9(02).                       00072000
000730         05  WS-CDD              PIC 9(02).                       00073000
000740     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00074000
000750     03  FILLER          REDEFINES WS-CURDATE.                    00075000
000760         05  WS-CURMM            PIC 9(02).                       00076000
000770         05  WS-CURDD            PIC 9(02).                       00077000
000780         05  WS-CURYYYY          PIC 9(04).                       00078000
000790     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00079000
000800     03  FILLER          REDEFINES WS-PDATE.                      00080000
000810         05  WS-PDATE-YYYY       PIC 9(04).                       00081000
000820         05  WS-PDATE-MM         PIC 9(02).                       00082000
000830         05  WS-PDATE-DD         PIC 9(02).                       00083000
000840     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00084000
000850     03  FILLER          REDEFINES WS-PDATE2.                     00085000
000860         05  WS-PDATE2-YYYY      PIC 9(04).                       00086000
000870         05  WS-PDATE2-MM        PIC 9(02).                       00087000
000880         05  WS-PDATE2-DD        PIC 9(02).                       00088000
P0075      03  WS-CURDTYYYYMMDD        PIC 9(08)       VALUE ZEROS.     00088100
P0075      03  FILLER          REDEFINES WS-CURDTYYYYMMDD.              00088200
P0075          05  WS-CURDTYYYY        PIC 9(04).                       00088300
P0075          05  WS-CURDTMMDD        PIC 9(04).                       00088400
P0075          05  FILLER      REDEFINES WS-CURDTMMDD.                  00088500
P0075              07  WS-CURDTMM      PIC 9(02).                       00088600
P0075              07  WS-CURDTDD      PIC 9(02).                       00088700
000890     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00089000
000900                                                 VALUE ZERO.      00090000
P0075      03  WS-EXPDATE              PIC 9(08)       VALUE ZERO.      00090100
P0075      03  FILLER          REDEFINES WS-EXPDATE.                    00090200
P0075          05  WS-EXPDATE-YYYY     PIC 9(04).                       00090300
P0075          05  WS-EXPDATE-MM       PIC 9(02).                       00090400
P0075          05  WS-EXPDATE-DD       PIC 9(02).                       00090500
000910     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00091000
000920                                                 VALUE ZERO.      00092000
000930     03  WS-CSF-SUB              PIC S9(04)      COMP             00093000
000940                                                 VALUE +0000.     00094000
000950     03  WS-CSF-SUBMAX           PIC S9(04)      COMP             00095000
000960                                                 VALUE +0015.     00096000
000970     03  WS-CSF-GRP-DATA.                                         00097000
000980         05  WS-CSF-FIELD-DATA                   OCCURS 15 TIMES. 00098000
000990             07  WS-CSF-FLDNBR   PIC 9(03).                       00099000
001000             07  WS-CSF-FLDNAME  PIC X(15).                       00100000
001010             07  WS-CSF-ENTRYTYPE                                 00101000
001020                                 PIC X(01).                       00102000
001030             07  WS-CSF-DECIMAL  PIC 9(01)       COMP-3.          00103000
001040             07  WS-CSF-EDEFAULT PIC X(05).                       00104000
001050             07  WS-CSF-EFORMATCD                                 00105000
001060                                 PIC 9(01).                       00106000
001070             07  WS-CSF-ECD      PIC 9(03)       COMP-3.          00107000
001080             07  WS-CSF-ELGTH    PIC 9(02)       COMP.            00108000
001090             07  WS-CSF-DATEFCD  PIC X(01).                       00109000
001100             07  WS-CSF-ENDEFAULT                                 00110000
001110                                 PIC X(01).                       00111000
001120             07  WS-CSF-EFLDID   PIC X(01).                       00112000
001130             07  WS-CSF-RDISPLACE                                 00113000
001140                                 PIC 9(04)       COMP.            00114000
001150             07  WS-CSF-RLGTH    PIC 9(02)       COMP.            00115000
001160             07  WS-CSF-FIELD.                                    00116000
001170                 09  WS-CSF-FIELD-N                               00117000
001180                                 PIC 9(15).                       00118000
001190*----------------------------------------------------------------*00119000
000000 COPY RPW005.                                                     00119300
P0037 *----------------------------------------------------------------*00119600
001200 01  WS-MVEAREAS.                                                 00120000
001210     03  WS-MVC-AREA.                                             00121000
001220         05  WS-DISP1            PIC S9(04)      SYNC             00122000
001230                                                 COMP             00123000
001240                                                 VALUE ZERO.      00124000
001250         05  WS-DISP2            PIC S9(04)      COMP             00125000
001260                                                 VALUE ZERO.      00126000
001270         05  WS-LENGTH           PIC S9(04)      COMP             00127000
001280                                                 VALUE ZERO.      00128000
001290     03  FILLER.                                                  00129000
001300         05  WS-JLGTH            PIC S9(04)      COMP.            00130000
001310         05  WS-TYP              PIC 9(01)       VALUE ZERO.      00131000
001320         05  WS-WORK             PIC X(130).                      00132000
001330         05  FILLER      REDEFINES WS-WORK.                       00133000
001340             07  WS-CHAR         PIC X(01)       OCCURS 130.      00134000
001350         05  FILLER      REDEFINES WS-WORK.                       00135000
001360             07  WS-WORKS        PIC S9(18).                      00136000
001370         05  FILLER      REDEFINES WS-WORK.                       00137000
001380             07  WS-WORKNS       PIC 9(18).                       00138000
001390         05  WS-SRWORK           PIC X(130)      VALUE SPACES.    00139000
001400         05  FILLER      REDEFINES WS-SRWORK.                     00140000
001410             07  WS-SRWC         PIC X(01)       OCCURS 130.      00141000
001420         05  FILLER      REDEFINES WS-SRWORK.                     00142000
001430             07  WS-SRWORKNS     PIC 9(01)       OCCURS 130.      00143000
001440         05  FILLER      REDEFINES WS-SRWORK.                     00144000
001450             07  WS-SRWORKS      PIC S9(01)      OCCURS 130.      00145000
001460         05  WS-SRWORKCH REDEFINES WS-SRWORK.                     00146000
001470             07  FILLER          PIC X(07).                       00147000
001480             07  WS-SRWK8T13     PIC X(06).                       00148000
001490             07  FILLER          PIC X(67).                       00149000
001500         05  WS-CHARE    REDEFINES WS-SRWORK.                     00150000
001510             07  WS-SRCHAR       PIC X(01)       OCCURS 130.      00151000
001520         05  WS-SRCHARS  REDEFINES WS-SRWORK                      00152000
001530                                 PIC S9(01)      OCCURS 130.      00153000
001540         05  WS-SROST    REDEFINES WS-SRWORK.                     00154000
001550             07  WS-SROSTTC      PIC X(04).                       00155000
001560             07  FILLER          PIC X(76).                       00156000
001570         05  WS-UEWORK           PIC X(130).                      00157000
001580         05  WS-UE18NS   REDEFINES WS-UEWORK                      00158000
001590                                 PIC S9(18).                      00159000
001600         05  WS-SRWORK2          PIC X(130)      VALUE SPACES.    00160000
001610         05  FILLER      REDEFINES WS-SRWORK2.                    00161000
001620             07  WS-SRW2X        PIC X(01).                       00162000
001630         05  FILLER      REDEFINES WS-SRWORK2.                    00163000
001640             07  WS-SRW2C        PIC X(01)       OCCURS 130.      00164000
001650         05  FILLER      REDEFINES WS-SRWORK2.                    00165000
001660             07  WS-SRWORK2NS    PIC 9(01)       OCCURS 130.      00166000
001670         05  FILLER      REDEFINES WS-SRWORK2.                    00167000
001680             07  WS-SRW2NS       PIC 9(18).                       00168000
001690         05  FILLER      REDEFINES WS-SRWORK2.                    00169000
001700             07  WS-SRWORK2S     PIC S9(01)      OCCURS 130.      00170000
001710         05  FILLER      REDEFINES WS-SRWORK2.                    00171000
001720             07  WS-SRW2NS2      PIC 9(02).                       00172000
001730         05  FILLER      REDEFINES WS-SRWORK2.                    00173000
001740             07  WS-SRW2S        PIC S9(18).                      00174000
001750         05  FILLER      REDEFINES WS-SRWORK2.                    00175000
001760             07  WS-SRW2S0       PIC S9(18).                      00176000
001770         05  FILLER      REDEFINES WS-SRWORK2.                    00177000
001780             07  WS-SRW2S1       PIC S9(17)V9(01).                00178000
001790         05  FILLER      REDEFINES WS-SRWORK2.                    00179000
001800             07  WS-SRW2S2       PIC S9(16)V9(02).                00180000
001810         05  FILLER      REDEFINES WS-SRWORK2.                    00181000
001820             07  WS-SRW2S3       PIC S9(15)V9(03).                00182000
001830         05  FILLER      REDEFINES WS-SRWORK2.                    00183000
001840             07  WS-SRW2S4       PIC S9(14)V9(04).                00184000
001850         05  FILLER      REDEFINES WS-SRWORK2.                    00185000
001860             07  WS-SRW2S5       PIC S9(13)V9(05).                00186000
001870         05  FILLER      REDEFINES WS-SRWORK2.                    00187000
001880             07  WS-SRW2S6       PIC S9(12)V9(06).                00188000
001890         05  FILLER      REDEFINES WS-SRWORK2.                    00189000
001900             07  WS-SRW2S7       PIC S9(11)V9(07).                00190000
001910         05  FILLER      REDEFINES WS-SRWORK2.                    00191000
001920             07  WS-SRW2S8       PIC S9(10)V9(08).                00192000
001930         05  FILLER      REDEFINES WS-SRWORK2.                    00193000
001940             07  WS-SRW2S9       PIC S9(09)V9(09).                00194000
001950         05  FILLER      REDEFINES WS-SRWORK2.                    00195000
001960             07  FILLER          PIC X(64).                       00196000
001970         05  WS-SRW2X2   REDEFINES WS-SRWORK2.                    00197000
001980             07  FILLER          PIC X(02).                       00198000
001990         05  WS-SRW2J    REDEFINES WS-SRWORK2                     00199000
002000                                 PIC S9(08).                      00200000
002010         05  WS-SRW2DATE REDEFINES WS-SRWORK2                     00201000
002020                                 PIC 9(08).                       00202000
002030         05  WS-SR6X             PIC X(06).                       00203000
002040         05  WS-SR6      REDEFINES WS-SR6X                        00204000
002050                                 PIC 9(06).                       00205000
002060         05  WS-SR6S     REDEFINES WS-SR6X                        00206000
002070                                 PIC S9(06).                      00207000
002080         05  WS-SR8X             PIC X(08).                       00208000
002090         05  WS-SR8      REDEFINES WS-SR8X                        00209000
002100                                 PIC 9(08).                       00210000
002110         05  WS-SR8S     REDEFINES WS-SR8X                        00211000
002120                                 PIC S9(08).                      00212000
002130         05  WS-SRFIELD.                                          00213000
002140             07  WS-SRFIELD10                                     00214000
002150                                 PIC X(10).                       00215000
002160             07  FILLER          PIC X(10).                       00216000
002170         05  WS-SRFIELD2.                                         00217000
002180             07  WS-SRFIELD210                                    00218000
002190                                 PIC X(10).                       00219000
002200             07  FILLER          PIC X(10).                       00220000
002210     03  WS-CRDDISP              PIC S9(08)      COMP.            00221000
002220     03  WS-XX.                                                   00222000
002230         05 WS-1X                PIC X(01)       VALUE LOW-VALUES.00223000
002240         05 WS-2X                PIC X(01).                       00224000
002250     03  WS-XXR          REDEFINES WS-XX.                         00225000
002260         05  WS-NN               PIC S9(04)      COMP.            00226000
002270     03  WS-10X.                                                  00227000
002280         05  WS-10P              PIC S9(18)      COMP-3.          00228000
002290         05  WS-10PN     REDEFINES WS-10P                         00229000
002300                                 PIC 9(18)       COMP-3.          00230000
002310     03  WS-10B          REDEFINES WS-10X.                        00231000
002320         05  FILLER              PIC X(02).                       00232000
002330         05  WS-8B               PIC S9(18)      COMP.            00233000
002340         05  WS-8BN      REDEFINES WS-8B                          00234000
002350                                 PIC 9(18)       COMP.            00235000
002360     03  WS-10B4.                                                 00236000
002370         05  FILLER              PIC X(06)       VALUE LOW-VALUE. 00237000
002380         05  WS-4B               PIC S9(08)      COMP.            00238000
002390     03  WS-10B2.                                                 00239000
002400         05  FILLER              PIC X(08)       VALUE LOW-VALUE. 00240000
002410         05  WS-2B               PIC S9(04)      COMP.            00241000
002420     03  WS-18NX.                                                 00242000
002430         05  WS-18N              PIC 9(18).                       00243000
002440     03  WS-18NSX        REDEFINES WS-18NX.                       00244000
002450         05  WS-18NS             PIC S9(18).                      00245000
002460*----------------------------------------------------------------*00246000
002470 01  MIWPRI-AREAS.                                                00247000
000000 COPY MIWPRI.                                                     00248000
002490 01  MIWMSTA-AREAS.                                               00249000
000000 COPY MIWMSTA.                                                    00250000
002510 01  MIMST-RECORD.                                                00251000
000000 COPY MISMST.                                                     00252000
002530 01  MICSF-RECORD.                                                00253000
000000 COPY MISCSF.                                                     00254000
002550 01  MI0237-RECORD.                                               00255000
000000 COPY MIS0237A.                                                   00256000
002570 01  MI2001-RECORD.                                               00257000
000000 COPY MIS2001A.                                                   00258000
002590 01  MI2023-RECORD.                                               00259000
000000 COPY MIS2023A.                                                   00260000
002610 01  MI7100-RECORD.                                               00261000
000000 COPY MIS7100.                                                    00262000
002630 01  MI7101-RECORD.                                               00263000
000000 COPY MIS7101.                                                    00264000
002650 01  MI7102-RECORD.                                               00265000
000000 COPY MIS7102.                                                    00266000
002670 01  MI7104-RECORD.                                               00267000
000000 COPY MIS7104.                                                    00268000
002690 01  MI7105-RECORD.                                               00269000
000000 COPY MIS7105.                                                    00270000
002710 01  MI7106-RECORD.                                               00271000
000000 COPY MIS7106.                                                    00272000
002730 01  MI7107-RECORD.                                               00273000
000000 COPY MIS7107.                                                    00274000
002750*----------------------------------------------------------------*00275000
002760 01  WS-RPMIM2001AREAS.                                           00276000
000000 COPY RPW2001.                                                    00277000
P0037  01  WS-RPMIM2023AREAS.                                           00277300
000000 COPY RPW2023.                                                    00277600
002780 01  WS-RPMIM7107AREAS.                                           00278000
000000 COPY RPW7107.                                                    00279000
002800*----------------------------------------------------------------*00280000
002810 01  RPWPRI-AREAS.                                                00281000
000000 COPY RPWPRI.                                                     00282000
002830 01  RPWACT-AREA.                                                 00283000
000000 COPY RPWACTA.                                                    00284000
002850 01  RPACT-RECORD.                                                00285000
000000 COPY RPSACT.                                                     00286000
P0075  01  RPWBNK-AREAS.                                                00286200
000000 COPY RPWBNKA.                                                    00286400
P0075  01  RPBNK-RECORD.                                                00286600
000000 COPY RPSBNK.                                                     00286800
002870 01  RPWIDX-AREA.                                                 00287000
000000 COPY RPWIDXA.                                                    00288000
002890 01  RPIDX-RECORD.                                                00289000
000000 COPY RPSIDX.                                                     00290000
002910 01  RPWMST-AREA.                                                 00291000
000000 COPY RPWMSTA.                                                    00292000
002930 01  RPMST-RECORD.                                                00293000
000000 COPY RPSMST.                                                     00294000
002950 01  RPWQUA-AREA.                                                 00295000
000000 COPY RPWQUAA.                                                    00296000
002970 01  RPQUA-RECORD.                                                00297000
000000 COPY RPSQUA.                                                     00298000
002990*----------------------------------------------------------------*00299000
003000 01  RPRF21-MESSAGE.                                              00300000
000000 COPY MISCNT00      REPLACING                                     00301000
003020             ==:MICNT:== BY ==RPRF21==.                           00302000
000000 COPY RPSRF21.                                                    00303000
003040*----------------------------------------------------------------*00304000
003050 01  RPINF00-MESSAGE.                                             00305000
000000 COPY MISCNT00      REPLACING                                     00306000
003070             ==:MICNT:== BY ==RPINF00==.                          00307000
000000 COPY RPSINF00.                                                   00308000
003090*----------------------------------------------------------------*00309000
003100 01  RPUSER-MESSAGE.                                              00310000
000000 COPY MISCNT00      REPLACING                                     00311000
003120     ==:MICNT:== BY ==RPUSER==.                                   00312000
000000 COPY RPWUSER.                                                    00313000
003140***************************************************************** 00314000
003150 01  WS-TRACECODES.                                               00315000
003160     03  WS-TR0001               PIC S9(04)      COMP             00316000
003170                                                 VALUE +0001.     00317000
003180     03  WS-TR0002               PIC S9(04)      COMP             00318000
003190                                                 VALUE +0002.     00319000
003200     03  WS-TR0003               PIC S9(04)      COMP             00320000
003210                                                 VALUE +0003.     00321000
003220     03  WS-TR0004               PIC S9(04)      COMP             00322000
003230                                                 VALUE +0004.     00323000
003240     03  WS-TR0005               PIC S9(04)      COMP             00324000
003250                                                 VALUE +0005.     00325000
003260     03  WS-TR0006               PIC S9(04)      COMP             00326000
003270                                                 VALUE +0006.     00327000
003280     03  WS-TR0007               PIC S9(04)      COMP             00328000
003290                                                 VALUE +0007.     00329000
003300     03  WS-TR0008               PIC S9(04)      COMP             00330000
003310                                                 VALUE +0008.     00331000
003320     03  WS-TR0009               PIC S9(04)      COMP             00332000
003330                                                 VALUE +0009.     00333000
003340     03  WS-TR0010               PIC S9(04)      COMP             00334000
003350                                                 VALUE +0010.     00335000
P0037      03  WS-TR0011               PIC S9(04)      COMP             00335300
P0037                                                  VALUE +0011.     00335600
P0075      03  WS-TR0012               PIC S9(04)      COMP             00335700
P0075                                                  VALUE +0012.     00335800
003360 01  WS-ABORTCODES.                                               00336000
003370     03  WS-AB2000               PIC S9(04)      COMP             00337000
003380                                                 VALUE +2000.     00338000
003390     03  WS-AB2033               PIC S9(04)      COMP             00339000
003400                                                 VALUE +2033.     00340000
003410     03  WS-AB3051               PIC S9(04)      COMP             00341000
003420                                                 VALUE +3051.     00342000
003430     03  WS-AB6300               PIC S9(04)      COMP             00343000
003440                                                 VALUE +6300.     00344000
P0075      03  WS-AB6305               PIC S9(04)      COMP             00344300
P0075                                                  VALUE +6305.     00344600
003450     03  WS-AB6310               PIC S9(04)      COMP             00345000
003460                                                 VALUE +6310.     00346000
003470     03  WS-AB6320               PIC S9(04)      COMP             00347000
003480                                                 VALUE +6320.     00348000
003490     03  WS-AB6325               PIC S9(04)      COMP             00349000
003500                                                 VALUE +6325.     00350000
003510******************************************************************00351000
003520 01  SLW096-AREAS.                                                00352000
000000 COPY SLW096.                                                     00353000
003540******************************************************************00354000
003550 LINKAGE SECTION.                                                 00355000
003560 01  DFHCOMMAREA.                                                 00356000
000000 COPY MISCNT00      REPLACING                                     00357000
003580             ==:MICNT:== BY ==RPXXX02==.                          00358000
000000 COPY RPSXXX02.                                                   00359000
003600*01  SLW096-2023RECORDS.                                          00360000
000000 COPY SLW096L.                                                    00361000
003620******************************************************************00362000
003630 PROCEDURE DIVISION.                                              00363000
003640******************************************************************00364000
003650 ENTRY-ROUTINE SECTION.                                           00365000
003660 ER-START.                                                        00366000
003670     MOVE 'RPLXXX02' TO SR-APIPROGLIT.                            00367000
003680     MOVE 'RPLXXX02' TO RPXXX02-ABPROGID.                         00368000
003690     PERFORM CICS-HANDLE-CONDITION.                               00369000
003700     IF EIBCALEN IS EQUAL TO +0                                   00370000
003710         MOVE WS-AB2000 TO RPXXX02-ABORT                          00371000
003720         MOVE WS-TR0001 TO RPXXX02-ABTRACE                        00372000
003730         GO TO CICS-RETURN.                                       00373000
003740     MOVE ZERO TO RPXXX02-MSGNBR.                                 00374000
003750     MOVE SPACE TO WS-FUNCTION.                                   00375000
003760     MOVE RPXXX02-FILEOPTS TO WS-FILEOPTS.                        00376000
003770     MOVE RPXXX02-OPERID TO WS-UPD-USER.                          00377000
003780     MOVE RPXXX02-EXTERNALID TO LOG-PANELID.                      00378000
003790     MOVE RPXXX02-TERMID TO LOG-TERMID.                           00379000
003800     MOVE RPXXX02-WORKID TO LOG-WORKID.                           00380000
003810     MOVE RPXXX02-TRANSTART TO LOG-TRANSTART.                     00381000
003820     MOVE RPXXX02-APPLSEQ TO LOG-APPLSEQ.                         00382000
000000 COPY SLP094.                                                     00383000
003840     GO TO VERIFY-KEY.                                            00384000
003850 ER-EXIT.                                                         00385000
003860     EXIT.                                                        00386000
003870******************************************************************00387000
003880 CICS-HANDLE-CONDITION SECTION.                                   00388000
000000 COPY SLP702.                                                     00389000
003900     MOVE WS-AB2033 TO RPXXX02-ABORT.                             00390000
003910     MOVE WS-TR0002 TO RPXXX02-ABTRACE.                           00391000
003920     GO TO CICS-RETURN.                                           00392000
003930 CHC-EXIT.                                                        00393000
003940     EXIT.                                                        00394000
003950******************************************************************00395000
003960 VERIFY-KEY SECTION.                                              00396000
003970 VK-START.                                                        00397000
003980     MOVE ZERO TO COM-ABORT.                                      00398000
003990     MOVE ZERO TO RPXXX02-ABORT.                                  00399000
004000     MOVE ZERO TO RPXXX02-MSGNBR.                                 00400000
004010     MOVE SPACES TO RPXXX02-FUNCTION.                             00401000
004020     MOVE RPXXX02-DATE TO WS-CURDATE.                             00402000
004030     MOVE WS-CURMM TO WS-PDATE-MM.                                00403000
004040     MOVE WS-CURDD TO WS-PDATE-DD.                                00404000
004050     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00405000
004060     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00406000
P0075      MOVE RPXXX02-KEY-INST TO RPBNK-INST.                         00406100
P0075      PERFORM RPS-BNK-GET-REQUEST.                                 00406200
P0075      IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00406300
P0075          MOVE WS-TR0012 TO RPXXX02-ABTRACE                        00406400
P0075          MOVE WS-AB6305 TO RPXXX02-ABORT                          00406500
P0075          GO TO VK-RETURN.                                         00406600
P0075      MOVE RPBNK-CURDT TO WS-CURDTYYYYMMDD.                        00406700
004070 VK-SECURITY.                                                     00407000
004080     IF RPXXX02-APIFUNC IS NOT EQUAL TO 'VKL'                     00408000
004090         GO TO VK-2023-LOAD.                                      00409000
004100     MOVE RPXXX02-UPDATE TO SR-OPDUPDATE.                         00410000
004110     MOVE RPXXX02-KEY-INST TO SR-OPDINST.                         00411000
004120     MOVE RPXXX02-OPERID TO SR-OPDOPERID.                         00412000
004130     MOVE RPXXX02-MODELID TO SR-OPDMODELID.                       00413000
004140     MOVE RPXXX02-EXTERNALID TO SR-OPDTRANCODE.                   00414000
004150     MOVE RPXXX02-APPL TO SR-OPDAPPL.                             00415000
004160     MOVE RPXXX02-SECALT TO SR-OPDSECALT.                         00416000
004170     MOVE RPXXX02-FUNC TO SR-OPDFUNC.                             00417000
004180     PERFORM OPERATOR-DIALOG-SECURITY.                            00418000
004190     MOVE SR-OPDUPDATE TO RPXXX02-UPDATE.                         00419000
004200     IF SR-OPDMSGNBR IS NOT EQUAL TO ZEROS                        00420000
004210         MOVE SR-OPDMSGNBR TO RPXXX02-MSGNBR                      00421000
004220         GO TO VK-RETURN.                                         00422000
004230 VK-2023-LOAD.                                                    00423000
004240     MOVE RPXXX02-KEY-INST TO MIM-2023KINST.                      00424000
004250     MOVE 'RP' TO MIM-2023KPRODCODE.                              00425000
004260     MOVE RPXXX02-INST-OPT-1 TO SLW096-BANKS.                     00426000
004270     PERFORM SLP096-GET-2023-RECORD.                              00427000
004280     IF SLW096-FUNCTION IS EQUAL TO 'N'                           00428000
004290         MOVE SPACES TO RPXXX02-RP-PRODCODE                       00429000
004300         GO TO VK-MST.                                            00430000
004310     MOVE MIM-2023KPRODCODE TO RPXXX02-RP-PRODCODE.               00431000
P0037      MOVE MIM-2023KPRODCODE TO WS-RPMIM2023-RPS.                  00431500
004320     IF RPXXX02-KEY-MODEL IS EQUAL TO SPACES                      00432000
004330         OR RPXXX02-KEY-MODEL IS EQUAL TO LOW-VALUES              00433000
004340         MOVE 500034 TO RPXXX02-MSGNBR                            00434000
004350         GO TO VK-RETURN.                                         00435000
004360 VK-MST.                                                          00436000
004370     MOVE RPXXX02-KEY-RECORD TO RPMST-GRP-KEY.                    00437000
004380     PERFORM RPS-MST-GET-REQUEST.                                 00438000
004390     IF WS-FUNCTION IS EQUAL TO 'N'                               00439000
004400         GO TO VK-2023.                                           00440000
004410     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00441000
004420         MOVE WS-AB6320 TO RPXXX02-ABORT                          00442000
004430         MOVE WS-TR0003 TO RPXXX02-ABTRACE                        00443000
004440         GO TO VK-RETURN.                                         00444000
004450     MOVE 500014 TO RPXXX02-MSGNBR.                               00445000
004460     GO TO VK-RETURN.                                             00446000
004470 VK-2023.                                                         00447000
004480     PERFORM READ-MICM-2023.                                      00448000
004490     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00449000
004500         MOVE 500001 TO RPXXX02-MSGNBR                            00450000
004510         GO TO VK-RETURN.                                         00451000
004520     IF MIM-2023RPOPTION IS EQUAL TO ' '                          00452000
004530         OR MIM-2023RPOPTION IS EQUAL TO 'N'                      00453000
004540         MOVE 500015 TO RPXXX02-MSGNBR                            00454000
004550         GO TO VK-RETURN.                                         00455000
004560 VK-7100.                                                         00456000
004570     PERFORM READ-MICM-7100.                                      00457000
004580     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00458000
004590         MOVE 500005 TO RPXXX02-MSGNBR                            00459000
004600         GO TO VK-RETURN.                                         00460000
004610 VK-7101.                                                         00461000
004620     PERFORM READ-MICM-7101.                                      00462000
004630     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00463000
004640         MOVE 500006 TO RPXXX02-MSGNBR                            00464000
004650         GO TO VK-RETURN.                                         00465000
004660     IF RPXXX02-APIFUNC IS NOT EQUAL TO 'VKL'                     00466000
004670         GO TO VK-EXIT.                                           00467000
004680     IF MIM-7101ACTCD IS EQUAL TO 'I'                             00468000
004690         MOVE 500017 TO RPXXX02-MSGNBR                            00469000
004700         GO TO VK-RETURN.                                         00470000
P0075      PERFORM VALIDATE-EXPIRATION-DATE.                            00471000
P0075      IF WS-EXPDT-ERROR IS EQUAL TO 'Y'                            00471790
P0075          MOVE 500091 TO RPXXX02-MSGNBR                            00472580
P0075          GO TO VK-RETURN.                                         00473370
004750     IF MIM-7101CLOSEDT IS LESS THAN WS-CURDT-YYYYMMDD            00475000
004760         AND MIM-7101CLOSEDT IS GREATER THAN ZEROS                00476000
004770         MOVE 500019 TO RPXXX02-MSGNBR                            00477000
004780         GO TO VK-RETURN.                                         00478000
004790     MOVE MIM-7101KMODEL TO RPXXX02-KEY-MODEL.                    00479000
004800     MOVE MIM-7101DESC TO RPXXX02-MODEL-DESC.                     00480000
004810     MOVE MIM-7101ENROLLATTEMPTS TO RPXXX02-ENROLL-ATTEMPTS.      00481000
004820 VK-NAME.                                                         00482000
004830     MOVE 'A' TO RPRF21-FUNC.                                     00483000
004840     MOVE RPXXX02-KEY-INST TO RPRF21-BASE-ACCT-INST.              00484000
004850     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00485000
004860         AND MIM-7100ENTERPRISEINST IS GREATER THAN ZEROS         00486000
004870         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00487000
004880     MOVE RPXXX02-KEY-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.      00488000
004890     MOVE RPXXX02-KEY-ACCOUNT TO RPRF21-BASE-ACCT.                00489000
004900     PERFORM REQUEST-CUSTOMER.                                    00490000
004910     IF WS-FUNCTION IS EQUAL TO SPACES                            00491000
004920         GO TO VK-RP-CHECK.                                       00492000
004930     IF RPXXX02-MSGNBR IS EQUAL TO ZEROS                          00493000
004940         MOVE 500016 TO RPXXX02-MSGNBR.                           00494000
004950     GO TO VK-RETURN.                                             00495000
004960 VK-RP-CHECK.                                                     00496000
004970     MOVE RPRF21-BASE-CUSTOMER TO RPXXX02-CUST-KEY.               00497000
004980     MOVE RPRF21-NAME TO RPXXX02-CUST-NAME.                       00498000
004990     IF MIM-7100CUSTLIMITOPT IS NOT EQUAL TO 'Y'                  00499000
005000         GO TO VK-ACT.                                            00500000
005010     MOVE ZERO TO WS-SUB1.                                        00501000
005020     IF RPXXX02-RP-PRODCODE IS GREATER THAN SPACES                00502000
005030         GO TO VK-RP-CONT.                                        00503000
005040 VK-RP-LOOP.                                                      00504000
005050     ADD +1 TO WS-SUB1.                                           00505000
005060     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00506000
005070         MOVE 500033 TO RPXXX02-MSGNBR                            00507000
005080         GO TO VK-RETURN.                                         00508000
005090     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00509000
005100         IS NOT EQUAL TO RPXXX02-APPL                             00510000
005110         GO TO VK-RP-LOOP.                                        00511000
005120     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO RPXXX02-RP-PRODCODE.  00512000
005130 VK-RP-CONT.                                                      00513000
005140     MOVE 'D' TO RPRF21-FUNC.                                     00514000
005150     MOVE RPXXX02-KEY-INST TO RPRF21-BASE-ACCT-INST.              00515000
005160     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00516000
005170         AND MIM-7100ENTERPRISEINST IS GREATER THAN ZEROS         00517000
005180         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00518000
005190     MOVE RPXXX02-RP-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.       00519000
005200     MOVE SPACES TO RPRF21-BASE-ACCT.                             00520000
005210     PERFORM REQUEST-CUSTOMER.                                    00521000
005220     IF WS-FUNCTION IS EQUAL TO SPACES                            00522000
005230         MOVE RPXXX02-KEY-INST TO RPRF21-BASE-ACCT-INST           00523000
005240         MOVE RPXXX02-KEY-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE   00524000
005250         MOVE RPXXX02-KEY-ACCOUNT TO RPRF21-BASE-ACCT             00525000
005260         GO TO VK-ACT.                                            00526000
005270     IF RPXXX02-MSGNBR IS EQUAL TO ZEROS                          00527000
005280         MOVE 500020 TO RPXXX02-MSGNBR.                           00528000
005290     GO TO VK-RETURN.                                             00529000
005300 VK-ACT.                                                          00530000
005310     MOVE SPACE TO WS-ACT-FLAG.                                   00531000
005320     INITIALIZE RPACT-RECORD.                                     00532000
005330     MOVE RPXXX02-KEY-INST TO RPACT-INST.                         00533000
005340     MOVE RPXXX02-KEY-PRODCODE TO RPACT-PRODCODE.                 00534000
005350     MOVE RPXXX02-KEY-ACCOUNT TO RPACT-ACCOUNT.                   00535000
005360     PERFORM RPS-ACT-GET-REQUEST.                                 00536000
005370     IF WS-FUNCTION IS EQUAL TO 'N'                               00537000
005380         GO TO VK-QUA-ACCT.                                       00538000
005390     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00539000
005400         MOVE WS-AB6300 TO RPXXX02-ABORT                          00540000
005410         MOVE WS-TR0004 TO RPXXX02-ABTRACE                        00541000
005420         GO TO CICS-ABORT-EXIT.                                   00542000
005430     MOVE 'Y' TO WS-ACT-FLAG.                                     00543000
005440     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      00544000
005450         MOVE 500021 TO RPXXX02-MSGNBR                            00545000
005460         GO TO VK-RETURN.                                         00546000
005470 VK-QUA-ACCT.                                                     00547000
005480     INITIALIZE RPQUA-RECORD.                                     00548000
005490     MOVE RPXXX02-KEY-RECORD TO RPQUA-GRP-KEY.                    00549000
005500     MOVE RPXXX02-KEY-MODEL TO RPQUA-MODEL.                       00550000
005510     PERFORM RPS-QUA-GET-REQUEST.                                 00551000
005520     IF WS-FUNCTION IS EQUAL TO 'N'                               00552000
005530         GO TO VK-QUA-CONT.                                       00553000
005540     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00554000
005550         MOVE WS-AB6325 TO RPXXX02-ABORT                          00555000
005560         MOVE WS-TR0005 TO RPXXX02-ABTRACE                        00556000
005570         GO TO CICS-ABORT-EXIT.                                   00557000
005580     MOVE 500022 TO RPXXX02-MSGNBR.                               00558000
005590     GO TO VK-RETURN.                                             00559000
005600 VK-QUA-CONT.                                                     00560000
005610     IF MIM-7100ACCTLIMITOPT IS NOT EQUAL TO 'Y'                  00561000
005620         GO TO VK-QUA-CUST.                                       00562000
005630     INITIALIZE RPQUA-RECORD.                                     00563000
005640     MOVE RPXXX02-KEY-RECORD TO RPQUA-GRP-KEY.                    00564000
005650     MOVE LOW-VALUES TO RPQUA-MODEL.                              00565000
005660     PERFORM RPS-QUA-GET-GE-REQUEST.                              00566000
005670     IF WS-FUNCTION IS EQUAL TO 'E'                               00567000
005680         GO TO VK-QUA-CUST.                                       00568000
005690     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00569000
005700         MOVE WS-AB6325 TO RPXXX02-ABORT                          00570000
005710         MOVE WS-TR0006 TO RPXXX02-ABTRACE                        00571000
005720         GO TO CICS-ABORT-EXIT.                                   00572000
005730     IF RPXXX02-KEY-INST IS NOT EQUAL TO RPQUA-INST               00573000
005740         OR RPXXX02-KEY-PRODCODE IS NOT EQUAL TO RPQUA-PRODCODE   00574000
005750         OR RPXXX02-KEY-ACCOUNT IS NOT EQUAL TO RPQUA-ACCOUNT     00575000
005760         GO TO VK-QUA-CUST.                                       00576000
005770     MOVE 500022 TO RPXXX02-MSGNBR.                               00577000
005780     GO TO VK-RETURN.                                             00578000
005790 VK-QUA-CUST.                                                     00579000
005800     IF MIM-7100CUSTLIMITOPT IS NOT EQUAL TO 'Y'                  00580000
005810         GO TO VK-INTERFACE.                                      00581000
005820     INITIALIZE RPQUA-RECORD.                                     00582000
005830     MOVE RPXXX02-KEY-INST TO RPQUA-INST.                         00583000
005840     PERFORM RPS-QUA-GET-GE-REQUEST.                              00584000
005850     GO TO VK-QUA-CHECK.                                          00585000
005860 VK-QUA-NEXT.                                                     00586000
005870     PERFORM RPS-QUA-GET-NEXT-REQUEST.                            00587000
005880 VK-QUA-CHECK.                                                    00588000
005890     IF WS-FUNCTION IS EQUAL TO 'E'                               00589000
005900         GO TO VK-INTERFACE.                                      00590000
005910     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00591000
005920         MOVE WS-AB6325 TO RPXXX02-ABORT                          00592000
005930         MOVE WS-TR0007 TO RPXXX02-ABTRACE                        00593000
005940         GO TO VK-RETURN.                                         00594000
005950     IF RPQUA-INST IS NOT EQUAL TO RPXXX02-KEY-INST               00595000
005960         GO TO VK-INTERFACE.                                      00596000
005970     IF RPQUA-RCIF-KEY IS NOT EQUAL TO RPRF21-BASE-CUSTOMER       00597000
005980         GO TO VK-QUA-NEXT.                                       00598000
005990     MOVE 500023 TO RPXXX02-MSGNBR.                               00599000
006000     GO TO VK-RETURN.                                             00600000
006010 VK-INTERFACE.                                                    00601000
006020     MOVE 'N' TO WS-INTERFACE.                                    00602000
006030     MOVE SPACES TO RPINF00-MESSAGE.                              00603000
006040     IF MIM-2023RPOPTION IS NOT EQUAL TO 'Y'                      00604000
006050         MOVE ZEROS TO RPXXX02-BRANCH                             00605000
006060         MOVE ZEROS TO RPXXX02-ACCT-TYPE                          00606000
006070         GO TO VK-PRIMARY-OPTION.                                 00607000
006080     PERFORM READ-MICM-0237.                                      00608000
006090     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00609000
006100         OR MIM-237OLINTFC IS NOT GREATER THAN SPACES             00610000
006110         MOVE 500024 TO RPXXX02-MSGNBR                            00611000
006120         GO TO VK-RETURN.                                         00612000
006130     PERFORM LINK-INTERFACE.                                      00613000
006140     IF WS-FUNCTION IS EQUAL TO 'D'                               00614000
006150         AND RPXXX02-MSGNBR IS EQUAL TO ZEROS                     00615000
006160         MOVE 500087 TO RPXXX02-MSGNBR.                           00616000
006170     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00617000
006180         AND RPXXX02-MSGNBR IS EQUAL TO ZEROS                     00618000
006190         MOVE 500025 TO RPXXX02-MSGNBR.                           00619000
006200     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00620000
006210         GO TO VK-RETURN.                                         00621000
006220     MOVE RPINF00-BRANCH TO RPXXX02-BRANCH.                       00622000
006230     MOVE RPINF00-ACCT-TYPE TO RPXXX02-ACCT-TYPE.                 00623000
006240 VK-PRIMARY-OPTION.                                               00624000
006250     PERFORM VALIDATE-PRIMARY-OPTION.                             00625000
006260     IF WS-PRIMOPT-FAIL IS EQUAL TO 'Y'                           00626000
006270         MOVE 500089 TO RPXXX02-MSGNBR                            00627000
006280         GO TO VK-RETURN.                                         00628000
006290 VK-7102.                                                         00629000
006300     PERFORM READ-MICM-7102.                                      00630000
006310     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00631000
006320         MOVE 500007 TO RPXXX02-MSGNBR                            00632000
006330         GO TO VK-RETURN.                                         00633000
006340     IF RPINF00-TERM IS NOT NUMERIC                               00634000
006350         MOVE ZEROS TO RPINF00-TERM.                              00635000
006360 VK-MIN-TERM.                                                     00636000
006370     IF (MIM-7102MINTERM-Q IS NOT EQUAL TO 'B'                    00637000
006380         AND MIM-7102MINTERM-Q IS NOT EQUAL TO 'E')               00638000
006390         OR MIM-7102MINTERM IS NOT GREATER THAN ZERO              00639000
006400         GO TO VK-MAX-TERM.                                       00640000
006410     IF RPINF00-TERM IS LESS THAN MIM-7102MINTERM                 00641000
006420         MOVE 500047 TO RPXXX02-MSGNBR                            00642000
006430         GO TO VK-RETURN.                                         00643000
006440 VK-MAX-TERM.                                                     00644000
006450     IF (MIM-7102MAXTERM-Q IS NOT EQUAL TO 'B'                    00645000
006460         AND MIM-7102MAXTERM-Q IS NOT EQUAL TO 'E')               00646000
006470         OR MIM-7102MAXTERM IS NOT GREATER THAN ZERO              00647000
006480         GO TO VK-USER-OPTION-1.                                  00648000
006490     IF RPINF00-TERM IS GREATER THAN MIM-7102MAXTERM              00649000
006500         MOVE 500048 TO RPXXX02-MSGNBR                            00650000
006510         GO TO VK-RETURN.                                         00651000
006520 VK-USER-OPTION-1.                                                00652000
006530     IF MIM-7102USERTYPE1 IS EQUAL TO 'S'                         00653000
006540         GO TO VK-USER-OPTION-2.                                  00654000
006550     IF (MIM-7102USEROPT1-Q IS NOT EQUAL TO 'B'                   00655000
006560         AND MIM-7102USEROPT1-Q IS NOT EQUAL TO 'E')              00656000
006570         GO TO VK-USER-OPTION-2.                                  00657000
006580     IF (MIM-7102USEROPTREL1 IS EQUAL TO 'EQ'                     00658000
006590         AND RPINF00-USEROPT1 IS NOT EQUAL TO MIM-7102USEROPT1)   00659000
006600         OR (MIM-7102USEROPTREL1 IS EQUAL TO 'NE'                 00660000
006610         AND RPINF00-USEROPT1 IS EQUAL TO MIM-7102USEROPT1)       00661000
006620         MOVE 500083 TO RPXXX02-MSGNBR                            00662000
006630         GO TO VK-RETURN.                                         00663000
006640 VK-USER-OPTION-2.                                                00664000
006650     IF MIM-7102USERTYPE2 IS EQUAL TO 'S'                         00665000
006660         GO TO VK-USER-OPTION-3.                                  00666000
006670     IF (MIM-7102USEROPT2-Q IS NOT EQUAL TO 'B'                   00667000
006680         AND MIM-7102USEROPT2-Q IS NOT EQUAL TO 'E')              00668000
006690         GO TO VK-USER-OPTION-3.                                  00669000
006700     IF (MIM-7102USEROPTREL2 IS EQUAL TO 'EQ'                     00670000
006710         AND RPINF00-USEROPT2 IS NOT EQUAL TO MIM-7102USEROPT2)   00671000
006720         OR (MIM-7102USEROPTREL2 IS EQUAL TO 'NE'                 00672000
006730         AND RPINF00-USEROPT2 IS EQUAL TO MIM-7102USEROPT2)       00673000
006740         MOVE 500084 TO RPXXX02-MSGNBR                            00674000
006750         GO TO VK-RETURN.                                         00675000
006760 VK-USER-OPTION-3.                                                00676000
006770     IF MIM-7102USERTYPE3 IS EQUAL TO 'S'                         00677000
006780         GO TO VK-USER-OPTION-4.                                  00678000
006790     IF (MIM-7102USEROPT3-Q IS NOT EQUAL TO 'B'                   00679000
006800         AND MIM-7102USEROPT3-Q IS NOT EQUAL TO 'E')              00680000
006810         GO TO VK-USER-OPTION-4.                                  00681000
006820     IF (MIM-7102USEROPTREL3 IS EQUAL TO 'EQ'                     00682000
006830         AND RPINF00-USEROPT3 IS NOT EQUAL TO MIM-7102USEROPT3)   00683000
006840         OR (MIM-7102USEROPTREL3 IS EQUAL TO 'NE'                 00684000
006850         AND RPINF00-USEROPT3 IS EQUAL TO MIM-7102USEROPT3)       00685000
006860         MOVE 500085 TO RPXXX02-MSGNBR                            00686000
006870         GO TO VK-RETURN.                                         00687000
006880 VK-USER-OPTION-4.                                                00688000
006890     IF MIM-7102USERTYPE4 IS EQUAL TO 'S'                         00689000
006900         GO TO VK-BALANCES.                                       00690000
006910     IF (MIM-7102USEROPT4-Q IS NOT EQUAL TO 'B'                   00691000
006920         AND MIM-7102USEROPT4-Q IS NOT EQUAL TO 'E')              00692000
006930         GO TO VK-BALANCES.                                       00693000
006940     IF (MIM-7102USEROPTREL4 IS EQUAL TO 'EQ'                     00694000
006950         AND RPINF00-USEROPT4 IS NOT EQUAL TO MIM-7102USEROPT4)   00695000
006960         OR (MIM-7102USEROPTREL4 IS EQUAL TO 'NE'                 00696000
006970         AND RPINF00-USEROPT4 IS EQUAL TO MIM-7102USEROPT4)       00697000
006980         MOVE 500086 TO RPXXX02-MSGNBR                            00698000
006990         GO TO VK-RETURN.                                         00699000
007000 VK-BALANCES.                                                     00700000
007010     IF MIM-2023RPOPTION IS NOT EQUAL TO 'Y'                      00701000
007020         GO TO VK-INCENTIVE.                                      00702000
007030     IF MIM-7102PRIMCATCD-Q IS NOT EQUAL TO 'E'                   00703000
007040         GO TO VK-BALCATCD.                                       00704000
007050     IF MIM-7102PRIMCATCD IS EQUAL TO SPACES                      00705000
007060         MOVE 502015 TO RPXXX02-MSGNBR                            00706000
007070         GO TO VK-RETURN.                                         00707000
007080     MOVE MIM-7102PRIMCATCD TO WS-WORK-CATCD.                     00708000
007090     PERFORM READ-MICM-7106.                                      00709000
007100     IF WS-FUNCTION IS EQUAL TO 'N'                               00710000
007110         MOVE 502015 TO RPXXX02-MSGNBR                            00711000
007120         GO TO VK-RETURN.                                         00712000
007130     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         00713000
007140     PERFORM GET-BALANCE.                                         00714000
007150     IF WS-WORK-BALANCE IS LESS THAN MIM-7106BALREQ-E             00715000
007160         MOVE 502016 TO RPXXX02-MSGNBR                            00716000
007170         GO TO VK-RETURN.                                         00717000
007180 VK-BALCATCD.                                                     00718000
007190     MOVE 'N' TO WS-BALCATCD1-FAIL.                               00719000
007200     IF MIM-7101PRIMBALOPT-Q IS NOT EQUAL TO 'E'                  00720000
007210         GO TO VK-INCENTIVE.                                      00721000
007220     IF MIM-7101PRIMBALOPT IS EQUAL TO 'N'                        00722000
007230         GO TO VK-INCENTIVE.                                      00723000
007240     IF MIM-7101ACCTRELCD-Q IS NOT EQUAL TO 'E'                   00724000
007250         GO TO VK-INCENTIVE.                                      00725000
007260     IF MIM-7101ACCTRELCDQ IS NOT EQUAL TO 'A'                    00726000
007270         GO TO VK-INCENTIVE.                                      00727000
007280     IF MIM-7102BALCATCD1-Q IS NOT EQUAL TO 'E'                   00728000
007290         GO TO VK-BALCATCD2.                                      00729000
007300     IF MIM-7102BALCATCD1 IS EQUAL TO SPACES                      00730000
007310         MOVE 502017 TO RPXXX02-MSGNBR                            00731000
007320         GO TO VK-RETURN.                                         00732000
007330     MOVE MIM-7102BALCATCD1 TO WS-WORK-CATCD.                     00733000
007340     PERFORM READ-MICM-7106.                                      00734000
007350     IF WS-FUNCTION IS EQUAL TO 'N'                               00735000
007360         MOVE 502017 TO RPXXX02-MSGNBR                            00736000
007370         GO TO VK-RETURN.                                         00737000
007380     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         00738000
007390     PERFORM GET-BALANCE.                                         00739000
007400     IF WS-WORK-BALANCE IS NOT LESS THAN MIM-7106BALREQ-E         00740000
007410         GO TO VK-INCENTIVE.                                      00741000
007420     MOVE 'Y' TO WS-BALCATCD1-FAIL.                               00742000
007430 VK-BALCATCD2.                                                    00743000
007440     IF MIM-7102BALCATCD2-Q IS NOT EQUAL TO 'E'                   00744000
007450         AND WS-BALCATCD1-FAIL IS EQUAL TO 'Y'                    00745000
007460         MOVE 502019 TO RPXXX02-MSGNBR                            00746000
007470         GO TO VK-RETURN.                                         00747000
007480     IF MIM-7102BALCATCD2-Q IS NOT EQUAL TO 'E'                   00748000
007490         GO TO VK-INCENTIVE.                                      00749000
007500     IF MIM-7102BALCATCD2 IS EQUAL TO SPACES                      00750000
007510         MOVE 502018 TO RPXXX02-MSGNBR                            00751000
007520         GO TO VK-RETURN.                                         00752000
007530     MOVE MIM-7102BALCATCD2 TO WS-WORK-CATCD.                     00753000
007540     PERFORM READ-MICM-7106.                                      00754000
007550     IF WS-FUNCTION IS EQUAL TO 'N'                               00755000
007560         MOVE 502018 TO RPXXX02-MSGNBR                            00756000
007570         GO TO VK-RETURN.                                         00757000
007580     MOVE MIM-7106BALCD TO WS-WORK-BALCD.                         00758000
007590     PERFORM GET-BALANCE.                                         00759000
007600     IF WS-WORK-BALANCE IS LESS THAN MIM-7106BALREQ-E             00760000
007610         MOVE 502019 TO RPXXX02-MSGNBR                            00761000
007620         GO TO VK-RETURN.                                         00762000
007630 VK-INCENTIVE.                                                    00763000
007640     IF WS-ACT-FLAG IS NOT EQUAL TO 'Y'                           00764000
007650         GO TO VK-7104.                                           00765000
007660     IF MIM-7102PRIMRATEINCOPT IS EQUAL TO 'Y'                    00766000
007670         AND RPACT-RATE-INC-OPTION IS EQUAL TO 'Y'                00767000
007680         MOVE 500027 TO RPXXX02-MSGNBR                            00768000
007690         GO TO VK-RETURN.                                         00769000
007700     IF MIM-7100DUPINCOPT IS EQUAL TO 'Y'                         00770000
007710         GO TO VK-7104.                                           00771000
007720     IF MIM-7102PRIMSCINCOPT IS EQUAL TO 'Y'                      00772000
007730         AND RPACT-SC-INC-OPTION IS EQUAL TO 'Y'                  00773000
007740         MOVE 500027 TO RPXXX02-MSGNBR                            00774000
007750         GO TO VK-RETURN.                                         00775000
007760 VK-7104.                                                         00776000
P0102      IF MIM-7101PRIMRELCD-Q IS EQUAL TO 'B'                       00776200
P0102          OR MIM-7101PRIMRELCD-Q IS EQUAL TO 'E'                   00776400
P0102          GO TO VK-7105.                                           00776600
007770     IF MIM-7101CUSTRELCD IS EQUAL TO SPACES                      00777000
007780         OR (MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'B'              00778000
007790         AND MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'E')             00779000
007800         GO TO VK-7105.                                           00780000
007810     PERFORM READ-MICM-7104.                                      00781000
007820     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00782000
007830         MOVE 500009 TO RPXXX02-MSGNBR                            00783000
007840         GO TO VK-RETURN.                                         00784000
007850     IF WS-KEEP-FLAG IS NOT EQUAL TO 'Y'                          00785000
007860         MOVE 500028 TO RPXXX02-MSGNBR                            00786000
007870         GO TO VK-RETURN.                                         00787000
007880 VK-7105.                                                         00788000
007890     IF MIM-7101DEMO IS EQUAL TO SPACES                           00789000
007900         OR (MIM-7101DEMO-Q IS NOT EQUAL TO 'B'                   00790000
007910         AND MIM-7101DEMO-Q IS NOT EQUAL TO 'E')                  00791000
007920         GO TO VK-7107.                                           00792000
007930     PERFORM READ-MICM-7105.                                      00793000
007940     IF WS-FUNCTION IS EQUAL TO 'N'                               00794000
007950         MOVE 500010 TO RPXXX02-MSGNBR                            00795000
007960         GO TO VK-RETURN.                                         00796000
007970     IF WS-FUNCTION IS EQUAL TO 'M'                               00797000
007980         MOVE 500032 TO RPXXX02-MSGNBR                            00798000
007990         GO TO VK-RETURN.                                         00799000
008000     IF WS-FUNCTION IS EQUAL TO 'X'                               00800000
008010         MOVE 000071 TO RPXXX02-MSGNBR                            00801000
008020         GO TO VK-RETURN.                                         00802000
008030     IF WS-KEEP-FLAG IS NOT EQUAL TO 'Y'                          00803000
008040         MOVE 500029 TO RPXXX02-MSGNBR                            00804000
008050         GO TO VK-RETURN.                                         00805000
008060 VK-7107.                                                         00806000
008070     IF MIM-7102BRCHREGIONCD IS EQUAL TO SPACES                   00807000
008080         OR (MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'B'           00808000
008090         AND MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'E')          00809000
008100         GO TO VK-USER-EXIT.                                      00810000
008110     MOVE RPXXX02-KEY-INST TO WS-RPMIM7107INST.                   00811000
008120     MOVE RPXXX02-KEY-INST TO WS-RPMIM7107INST2.                  00812000
008130     MOVE RPXXX02-BRANCH TO WS-RPMIM7107BRCHREGION.               00813000
008140     MOVE MIM-7102BRCHREGIONCD TO WS-RPMIM7107RPREC.              00814000
008150     PERFORM VALIDATE-BRANCH.                                     00815000
008160     IF WS-RPMIM7107ERROR IS EQUAL TO '2'                         00816000
008170         MOVE 500012 TO RPXXX02-MSGNBR                            00817000
008180         GO TO VK-RETURN.                                         00818000
008190     IF WS-RPMIM7107ERROR IS EQUAL TO SPACES                      00819000
008200         GO TO VK-USER-EXIT.                                      00820000
008210     MOVE 500030 TO RPXXX02-MSGNBR.                               00821000
008220     GO TO VK-RETURN.                                             00822000
008230 VK-USER-EXIT.                                                    00823000
008240     IF MIM-7102USERRTN IS NOT EQUAL TO 'Y'                       00824000
008250         OR (MIM-7102USERRTN-Q IS NOT EQUAL TO 'B'                00825000
008260         AND MIM-7102USERRTN-Q IS NOT EQUAL TO 'E')               00826000
008270         GO TO VK-IDNUMBER.                                       00827000
008280     PERFORM USER-EXIT.                                           00828000
008290     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00829000
008300         OR RPUSER-PASSED IS NOT EQUAL TO 'Y'                     00830000
008310         MOVE 500031 TO RPXXX02-MSGNBR                            00831000
008320         GO TO VK-RETURN.                                         00832000
008330 VK-IDNUMBER.                                                     00833000
008340     PERFORM CREATE-IDNUMBER.                                     00834000
008350     GO TO VK-EXIT.                                               00835000
008360 VK-RETURN.                                                       00836000
008370     MOVE 'E' TO RPXXX02-RETURN.                                  00837000
008380     GO TO CICS-RETURN.                                           00838000
008390 VK-EXIT.                                                         00839000
008400     EXIT.                                                        00840000
008410******************************************************************00841000
008420 ROUTING-ROUTINE SECTION.                                         00842000
008430 RR-START.                                                        00843000
008440     IF RPXXX02-APIFUNC IS EQUAL TO 'VKL'                         00844000
008450         GO TO RR-END.                                            00845000
008460     PERFORM WRITE-QUA-RECORD.                                    00846000
008470 RR-END.                                                          00847000
008480     GO TO CICS-RETURN.                                           00848000
008490 RR-EXIT.                                                         00849000
008500     EXIT.                                                        00850000
008510******************************************************************00851000
008520 READ-MICM-0237 SECTION.                                          00852000
008530 RM0237-START.                                                    00853000
008540     MOVE SPACES TO WS-FUNCTION.                                  00854000
008550     MOVE SPACES TO MI0237-RECORD.                                00855000
008560     MOVE RPXXX02-KEY-INST TO MIM-0237KINST.                      00856000
008570     MOVE +0237 TO MIM-0237KREC.                                  00857000
008580     MOVE RPXXX02-APPL TO MIM-0237KPROCMGR.                       00858000
008590     MOVE MIM-2023INTAPPL211 TO MIM-0237KINTAPPL.                 00859000
008600     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    00860000
008610     MOVE MI0237-RECORD TO MIMST-RECORD.                          00861000
008620     PERFORM MIC-MST-GET-REQUEST.                                 00862000
008630     MOVE MIMST-RECORD TO MI0237-RECORD.                          00863000
008640 RM0237-EXIT.                                                     00864000
008650     EXIT.                                                        00865000
008660******************************************************************00866000
008670 READ-MICM-2023 SECTION.                                          00867000
008680 RM2023-START.                                                    00868000
008690     MOVE SPACES TO WS-FUNCTION.                                  00869000
008700     MOVE SPACES TO MI2023-RECORD.                                00870000
008710     MOVE RPXXX02-KEY-INST TO MIM-2023KINST.                      00871000
008720     IF RPXXX02-INST-OPT-1 IS NOT EQUAL TO 'Y'                    00872000
008730         MOVE ZEROS TO MIM-2023KINST.                             00873000
008740     MOVE RPXXX02-KEY-PRODCODE TO MIM-2023KPRODCODE.              00874000
008750     MOVE +2023 TO MIM-2023KREC.                                  00875000
008760     MOVE MIC-MST-2023-PRI TO MIC-MST-REC-PRI.                    00876000
008770 RM2023-INST-ZERO.                                                00877000
008780     MOVE MI2023-RECORD TO MIMST-RECORD.                          00878000
008790     MOVE SPACES TO WS-FUNCTION.                                  00879000
008800     PERFORM MIC-MST-GET-REQUEST.                                 00880000
008810     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00881000
008820         AND MIM-2023KINST IS NOT EQUAL TO ZEROS                  00882000
008830         MOVE ZEROS TO MIM-2023KINST                              00883000
008840         GO TO RM2023-INST-ZERO.                                  00884000
008850     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00885000
008860         GO TO RM2023-END.                                        00886000
008870     MOVE MIMST-RECORD TO MI2023-RECORD.                          00887000
008880 RM2023-END.                                                      00888000
008890     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00889000
008900         MOVE 'N' TO MIM-2023RPOPTION.                            00890000
008910 RM2023-EXIT.                                                     00891000
008920     EXIT.                                                        00892000
008930******************************************************************00893000
008940 READ-MICM-7100 SECTION.                                          00894000
008950 RM7100-START.                                                    00895000
008960     MOVE SPACES TO WS-FUNCTION.                                  00896000
008970     MOVE SPACES TO MI7100-RECORD.                                00897000
008980     MOVE RPXXX02-KEY-INST TO MIM-7100KINST.                      00898000
008990 RM7100-LOOP.                                                     00899000
009000     MOVE +7100 TO MIM-7100KREC.                                  00900000
009010     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00901000
009020     MOVE MI7100-RECORD TO MIMST-RECORD.                          00902000
009030     PERFORM MIC-MST-GET-REQUEST.                                 00903000
009040     MOVE MIMST-RECORD TO MI7100-RECORD.                          00904000
009050     IF WS-FUNCTION IS EQUAL TO 'N'                               00905000
009060         AND MIM-7100KINST IS GREATER THAN ZEROS                  00906000
009070         GO TO RM7100-ZERO.                                       00907000
009080     GO TO RM7100-EXIT.                                           00908000
009090 RM7100-ZERO.                                                     00909000
009100     MOVE SPACES TO MI7100-RECORD.                                00910000
009110     MOVE ZEROS TO MIM-7100KINST.                                 00911000
009120     GO TO RM7100-LOOP.                                           00912000
009130 RM7100-EXIT.                                                     00913000
009140     EXIT.                                                        00914000
009150******************************************************************00915000
009160 READ-MICM-7101 SECTION.                                          00916000
009170 RM7101-START.                                                    00917000
009180     MOVE SPACES TO WS-FUNCTION.                                  00918000
009190     MOVE SPACES TO MI7101-RECORD.                                00919000
009200     MOVE RPXXX02-KEY-INST TO MIM-7101KINST.                      00920000
009210     MOVE +7101 TO MIM-7101KREC.                                  00921000
009220     MOVE RPXXX02-KEY-MODEL TO MIM-7101KMODEL.                    00922000
009230     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        00923000
009240     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00924000
009250     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00925000
009260     MOVE MI7101-RECORD TO MIMST-RECORD.                          00926000
009270     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00927000
009280     MOVE MIMST-RECORD TO MI7101-RECORD.                          00928000
009290     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00929000
009300         GO TO RM7101-EXIT.                                       00930000
009310     IF MIM-7101KINST IS NOT EQUAL TO RPXXX02-KEY-INST            00931000
009320         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00932000
009330         OR MIM-7101KMODEL IS NOT EQUAL TO RPXXX02-KEY-MODEL      00933000
009340         MOVE 'N' TO WS-FUNCTION                                  00934000
009350         GO TO RM7101-EXIT.                                       00935000
009360 RM7101-EXIT.                                                     00936000
009370     EXIT.                                                        00937000
009380******************************************************************00938000
009390 READ-MICM-7102 SECTION.                                          00939000
009400 RM7102-START.                                                    00940000
009410     MOVE RPRF21-BASE-ACCT-PRODCODE TO WS-SAVE-PRODCODE.          00941000
009420     MOVE RPXXX02-ACCT-TYPE TO WS-SAVE-ACCT-TYPE.                 00942000
009430 RM7102-LOOP.                                                     00943000
009440     MOVE SPACES TO WS-FUNCTION.                                  00944000
009450     MOVE SPACES TO MI7102-RECORD.                                00945000
009460     MOVE RPXXX02-KEY-INST TO MIM-7102KINST.                      00946000
009470     MOVE +7102 TO MIM-7102KREC.                                  00947000
009480     MOVE RPXXX02-KEY-MODEL TO MIM-7102KMODEL.                    00948000
009490     MOVE RPRF21-BASE-ACCT-PRODCODE TO MIM-7102KPRODCODE.         00949000
009500     MOVE RPXXX02-ACCT-TYPE TO MIM-7102KACCTTYPE.                 00950000
009510     MOVE MIC-RPS-7102-PRI TO MIC-MST-REC-PRI.                    00951000
009520     MOVE MI7102-RECORD TO MIMST-RECORD.                          00952000
009530     PERFORM MIC-MST-GET-REQUEST.                                 00953000
009540     MOVE MIMST-RECORD TO MI7102-RECORD.                          00954000
009550     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00955000
009560         AND RPRF21-BASE-ACCT-PRODCODE IS EQUAL TO SPACES         00956000
009570         AND RPXXX02-ACCT-TYPE IS EQUAL TO ZEROS                  00957000
009580         GO TO RM7102-END.                                        00958000
009590     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00959000
009600         AND RPXXX02-ACCT-TYPE IS NOT EQUAL TO ZEROS              00960000
009610         MOVE ZEROS TO RPXXX02-ACCT-TYPE                          00961000
009620         GO TO RM7102-LOOP.                                       00962000
009630     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00963000
009640         AND RPRF21-BASE-ACCT-PRODCODE IS NOT EQUAL TO SPACES     00964000
009650         MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE                 00965000
009660         GO TO RM7102-LOOP.                                       00966000
009670 RM7102-END.                                                      00967000
009680     MOVE WS-SAVE-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.          00968000
009690     MOVE WS-SAVE-ACCT-TYPE TO RPXXX02-ACCT-TYPE.                 00969000
009700 RM7102-EXIT.                                                     00970000
009710     EXIT.                                                        00971000
009720******************************************************************00972000
009730 READ-MICM-7104 SECTION.                                          00973000
009740 RM7104-START.                                                    00974000
009750     MOVE 'N' TO WS-KEEP-FLAG.                                    00975000
009760     MOVE SPACES TO WS-FUNCTION.                                  00976000
009770     MOVE SPACES TO MI7104-RECORD.                                00977000
009780     MOVE RPXXX02-KEY-INST TO MIM-7104KINST.                      00978000
009790     MOVE +7104 TO MIM-7104KREC.                                  00979000
009800     MOVE MIM-7101CUSTRELCD TO MIM-7104KRPREC.                    00980000
009810     MOVE MIC-RPS-7104-PRI TO MIC-MST-REC-PRI.                    00981000
009820     MOVE MI7104-RECORD TO MIMST-RECORD.                          00982000
009830     PERFORM MIC-MST-GET-REQUEST.                                 00983000
009840     MOVE MIMST-RECORD TO MI7104-RECORD.                          00984000
009850     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00985000
009860         GO TO RM7104-EXIT.                                       00986000
009870 RM7104-END.                                                      00987000
009880     PERFORM CHECK-REL-CODE.                                      00988000
009890 RM7104-EXIT.                                                     00989000
009900     EXIT.                                                        00990000
009910******************************************************************00991000
009920 READ-MICM-7105 SECTION.                                          00992000
009930 RM7105-START.                                                    00993000
009940     MOVE 'N' TO WS-KEEP-FLAG.                                    00994000
009950     MOVE SPACES TO WS-FUNCTION.                                  00995000
009960     MOVE SPACES TO MI7105-RECORD.                                00996000
009970     MOVE MIC-RPS-7105-PRI TO MIC-MST-REC-PRI.                    00997000
009980     MOVE RPXXX02-KEY-INST TO MIM-7105KINST.                      00998000
009990     MOVE 7105 TO MIM-7105KREC.                                   00999000
010000     MOVE MIM-7101DEMO TO MIM-7105KDEMO.                          01000000
010010     MOVE MI7105-RECORD TO MIMST-RECORD.                          01001000
010020     PERFORM MIC-MST-GET-REQUEST.                                 01002000
010030     MOVE MIMST-RECORD TO MI7105-RECORD.                          01003000
010040     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01004000
010050         MOVE 'N' TO WS-FUNCTION                                  01005000
010060         GO TO RM7105-EXIT.                                       01006000
010070     PERFORM MICM-CSF-READ.                                       01007000
010080     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01008000
010090         MOVE 'M' TO WS-FUNCTION                                  01009000
010100         GO TO RM7105-EXIT.                                       01010000
010110     PERFORM PULL-DATA.                                           01011000
010120     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01012000
010130         GO TO RM7105-EXIT.                                       01013000
010140     MOVE SPACES TO WS-WORK-TRUE.                                 01014000
010150     MOVE +0001 TO WS-SUB99.                                      01015000
010160     PERFORM COMPARE-DATA.                                        01016000
010170     SUBTRACT +0001 FROM WS-SUB99.                                01017000
010180     IF WS-TRUE-SW (WS-SUB99) IS EQUAL TO '4'                     01018000
010190         GO TO RM7105-EXIT.                                       01019000
010200 RM7105-CONT.                                                     01020000
010210     IF WS-SUB99 IS LESS THAN +0001                               01021000
010220         GO TO RM7105-EXIT.                                       01022000
010230     IF WS-TRUE-SW (WS-SUB99) IS EQUAL TO '1'                     01023000
010240         MOVE 'Y' TO WS-KEEP-FLAG                                 01024000
010250         GO TO RM7105-EXIT.                                       01025000
010260     SUBTRACT +0001 FROM WS-SUB99.                                01026000
010270     GO TO RM7105-CONT.                                           01027000
010280 RM7105-EXIT.                                                     01028000
010290     EXIT.                                                        01029000
010300******************************************************************01030000
010310 READ-MICM-7106 SECTION.                                          01031000
010320 RM7106-START.                                                    01032000
010330     MOVE SPACES TO WS-FUNCTION.                                  01033000
010340     MOVE SPACES TO MI7106-RECORD.                                01034000
010350     MOVE RPXXX02-KEY-INST TO MIM-7106KINST.                      01035000
010360     MOVE +7106 TO MIM-7106KREC.                                  01036000
010370     MOVE WS-WORK-CATCD TO MIM-7106KRPREC.                        01037000
010380     MOVE MIC-RPS-7106-PRI TO MIC-MST-REC-PRI.                    01038000
010390     MOVE MI7106-RECORD TO MIMST-RECORD.                          01039000
010400     PERFORM MIC-MST-GET-REQUEST.                                 01040000
010410     MOVE MIMST-RECORD TO MI7106-RECORD.                          01041000
010420     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01042000
010430         GO TO RM7106-EXIT.                                       01043000
010440 RM7106-EXIT.                                                     01044000
010450     EXIT.                                                        01045000
P0075 ******************************************************************01045010
P0075  VALIDATE-EXPIRATION-DATE SECTION.                                01045020
P0075  VED-START.                                                       01045030
P0075      MOVE 'N' TO WS-EXPDT-ERROR.                                  01045040
P0075      IF RPXXX02-EXPIRATION-DATE IS GREATER THAN ZEROS             01045050
P0075          AND RPXXX02-EXPIRATION-DATE                              01045060
P0075                  IS NOT GREATER THAN WS-CURDTYYYYMMDD             01045070
P0075          GO TO VED-ERROR.                                         01045080
P0075  VED-EXPDT.                                                       01045090
P0075      IF MIM-7101EXPDT IS EQUAL TO ZEROS                           01045100
P0075          GO TO VED-CALC-EXPDATE.                                  01045110
P0075      IF RPXXX02-EXPIRATION-DATE IS GREATER THAN ZEROS             01045120
P0075          AND RPXXX02-EXPIRATION-DATE                              01045130
P0075                  IS GREATER THAN MIM-7101EXPDT                    01045140
P0075          GO TO VED-ERROR.                                         01045150
P0075      IF RPXXX02-EXPIRATION-DATE IS GREATER THAN ZEROS             01045160
P0075          GO TO VED-EXIT.                                          01045170
P0075      IF MIM-7101EXPDT IS NOT GREATER THAN WS-CURDTYYYYMMDD        01045180
P0075          GO TO VED-ERROR.                                         01045190
P0075      GO TO VED-EXIT.                                              01045200
P0075  VED-CALC-EXPDATE.                                                01045210
P0075      IF MIM-7101EXPFREQ IS EQUAL TO 'N'                           01045220
P0075          GO TO VED-EXIT.                                          01045230
P0075      MOVE MIM-7101EXPFREQ TO SR-PERIOD.                           01045240
P0075      MOVE MIM-7101EXPTERM TO SR-FREQ.                             01045250
P0075      IF MIM-7101EXPFREQ IS EQUAL TO 'M'                           01045260
P0075          AND MIM-7101ENDOFMONTH IS EQUAL TO 'Y'                   01045270
P0075          MOVE 31 TO SR-DAY                                        01045280
P0075      ELSE                                                         01045290
P0075          MOVE ZEROS TO SR-DAY.                                    01045300
P0075      MOVE WS-CURDTYYYY TO SR-FCYR.                                01045310
P0075      MOVE WS-CURDTMM TO SR-FCMON.                                 01045320
P0075      MOVE WS-CURDTDD TO SR-FCDAY.                                 01045330
P0075      PERFORM JULIAN-365.                                          01045340
P0075      MOVE SR-TOJUL TO SR-FROMJUL.                                 01045350
P0075      PERFORM NEXT-DATE-365.                                       01045360
P0075      MOVE SR-TOJUL TO SR-FROMJUL.                                 01045370
P0075      PERFORM CALENDAR-365.                                        01045380
P0075      MOVE SR-TCMON TO WS-EXPDATE-MM.                              01045390
P0075      MOVE SR-TCDAY TO WS-EXPDATE-DD.                              01045400
P0075      MOVE SR-TCYR TO WS-EXPDATE-YYYY.                             01045410
P0075      IF RPXXX02-EXPIRATION-DATE IS GREATER THAN ZEROS             01045420
P0075          AND RPXXX02-EXPIRATION-DATE IS GREATER THAN WS-EXPDATE   01045430
P0075          GO TO VED-ERROR.                                         01045440
P0075      IF RPXXX02-EXPIRATION-DATE IS GREATER THAN ZEROS             01045450
P0075          GO TO VED-EXIT.                                          01045460
P0075      IF WS-EXPDATE IS NOT GREATER THAN WS-CURDTYYYYMMDD           01045470
P0075          GO TO VED-ERROR.                                         01045480
P0075      GO TO VED-EXIT.                                              01045490
P0075  VED-ERROR.                                                       01045500
P0075      MOVE 'Y' TO WS-EXPDT-ERROR.                                  01045510
P0075  VED-EXIT.                                                        01045520
P0075      EXIT.                                                        01045530
010460******************************************************************01046000
010470 VALIDATE-PRIMARY-OPTION SECTION.                                 01047000
010480 VPO-START.                                                       01048000
010490     MOVE 'N' TO WS-PRIMOPT-FAIL.                                 01049000
010500     MOVE SPACES TO WS-FUNCTION.                                  01050000
010510     MOVE SPACES TO MI7102-RECORD.                                01051000
010520     MOVE LOW-VALUES TO MIM-7102GRP-KEY.                          01052000
010530     MOVE RPXXX02-KEY-INST TO MIM-7102KINST.                      01053000
010540     MOVE +7102 TO MIM-7102KREC.                                  01054000
010550     MOVE RPXXX02-KEY-MODEL TO MIM-7102KMODEL.                    01055000
010560     MOVE MIC-RPS-7102-PRI TO MIC-MST-REC-PRI.                    01056000
010570     MOVE MI7102-RECORD TO MIMST-RECORD.                          01057000
010580     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           01058000
010590     GO TO VPO-TEST.                                              01059000
010600 VPO-FIND-NEXT.                                                   01060000
010610     PERFORM MIC-MST-GET-NEXT-REQUEST.                            01061000
010620 VPO-TEST.                                                        01062000
010630     MOVE MIMST-RECORD TO MI7102-RECORD.                          01063000
010640     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01064000
010650         GO TO VPO-EXIT.                                          01065000
010660     IF MIM-7102KMODEL IS GREATER THAN RPXXX02-KEY-MODEL          01066000
010670         OR MIM-7102KINST IS NOT EQUAL TO RPXXX02-KEY-INST        01067000
010680         GO TO VPO-EXIT.                                          01068000
010690     IF MIM-7102PRIMARY IS NOT EQUAL TO 'Y'                       01069000
010700         GO TO VPO-FIND-NEXT.                                     01070000
010710     IF MIM-7102KPRODCODE IS EQUAL TO SPACES                      01071000
010720         AND MIM-7102KACCTTYPE IS EQUAL TO ZEROS                  01072000
010730         GO TO VPO-EXIT.                                          01073000
010740     MOVE RPRF21-BASE-ACCT-PRODCODE TO WS-SAVE-PRODCODE.          01074000
010750     MOVE RPXXX02-ACCT-TYPE TO WS-SAVE-ACCT-TYPE.                 01075000
010760     IF MIM-7102KPRODCODE IS EQUAL TO RPRF21-BASE-ACCT-PRODCODE   01076000
010770         AND (MIM-7102KACCTTYPE IS EQUAL TO ZEROS                 01077000
010780         OR MIM-7102KACCTTYPE IS EQUAL TO RPXXX02-ACCT-TYPE)      01078000
010790         GO TO VPO-EXIT.                                          01079000
010800     MOVE 'Y' TO WS-PRIMOPT-FAIL.                                 01080000
010810 VPO-EXIT.                                                        01081000
010820     EXIT.                                                        01082000
010830******************************************************************01083000
010840 GET-BALANCE SECTION.                                             01084000
010850 GB-START.                                                        01085000
010860     MOVE ZEROS TO WS-WORK-BALANCE.                               01086000
010870     IF WS-WORK-BALCD IS EQUAL TO ZEROS                           01087000
010880         OR WS-WORK-BALCD IS GREATER THAN 20                      01088000
010890         GO TO GB-EXIT.                                           01089000
010900     MOVE RPINF00-BAL (WS-WORK-BALCD) TO WS-WORK-BALANCE.         01090000
010910 GB-EXIT.                                                         01091000
010920     EXIT.                                                        01092000
010930******************************************************************01093000
010940 MICM-CSF-READ SECTION.                                           01094000
010950 MCSFR-START.                                                     01095000
010960     MOVE SPACES TO MICSF-RECORD.                                 01096000
010970     MOVE SPACES TO WS-CSF-GRP-DATA.                              01097000
010980     MOVE +0001 TO WS-CSF-SUB.                                    01098000
010990     IF MIM-7105KEYWORD (WS-CSF-SUB) IS EQUAL TO SPACES           01099000
011000         GO TO MCSFR-EXIT.                                        01100000
011010     IF RPRF21-BASE-CUST-TYPE IS NOT EQUAL TO 'R'                 01101000
011020         AND RPRF21-BASE-CUST-TYPE IS NOT EQUAL TO 'C'            01102000
011030         GO TO MCSFR-EXIT.                                        01103000
011040     MOVE MIC-MST-CSF-PRI TO MIC-MST-REC-PRI.                     01104000
011050     MOVE ZEROS TO MICSF-INST.                                    01105000
011060     IF RPRF21-BASE-CUST-TYPE IS EQUAL TO 'R'                     01106000
011070         MOVE 'GNO' TO MICSF-RECID                                01107000
011080     ELSE                                                         01108000
011090         MOVE 'GNI' TO MICSF-RECID.                               01109000
011100     MOVE SPACE TO MICSF-AMT-APPLID.                              01110000
011110 MCSFR-LOOP.                                                      01111000
011120     MOVE MIM-7105KEYWORD (WS-CSF-SUB) TO MICSF-FIELDNAME.        01112000
011130     MOVE MICSF-RECORD TO MIMST-RECORD.                           01113000
011140     PERFORM MIC-MST-GET-REQUEST.                                 01114000
011150     MOVE MIMST-RECORD TO MICSF-RECORD.                           01115000
011160     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01116000
011170         GO TO MCSFR-EXIT.                                        01117000
011180 MCSFR-CONT.                                                      01118000
011190     MOVE MICSF-FLDNBR TO WS-CSF-FLDNBR (WS-CSF-SUB).             01119000
011200     MOVE MICSF-FLDNAME TO WS-CSF-FLDNAME (WS-CSF-SUB).           01120000
011210     MOVE MICSF-ENTRYTYPE TO WS-CSF-ENTRYTYPE (WS-CSF-SUB).       01121000
011220     MOVE MICSF-DECIMAL TO WS-CSF-DECIMAL (WS-CSF-SUB).           01122000
011230     MOVE MICSF-EDEFAULT TO WS-CSF-EDEFAULT (WS-CSF-SUB).         01123000
011240     MOVE MICSF-EFORMATCD TO WS-CSF-EFORMATCD (WS-CSF-SUB).       01124000
011250     MOVE MICSF-ECD TO WS-CSF-ECD (WS-CSF-SUB).                   01125000
011260     MOVE MICSF-ELGTH TO WS-CSF-ELGTH (WS-CSF-SUB).               01126000
011270     MOVE MICSF-DATEFCD TO WS-CSF-DATEFCD (WS-CSF-SUB).           01127000
011280     MOVE MICSF-ENDEFAULT TO WS-CSF-ENDEFAULT (WS-CSF-SUB).       01128000
011290     MOVE MICSF-EFLDID TO WS-CSF-EFLDID (WS-CSF-SUB).             01129000
011300     MOVE MICSF-RDISPLACE TO WS-CSF-RDISPLACE (WS-CSF-SUB).       01130000
011310     MOVE MICSF-RLGTH TO WS-CSF-RLGTH (WS-CSF-SUB).               01131000
011320     IF MICSF-EFORMATCD IS EQUAL TO 1                             01132000
011330         GO TO MCSFR-END.                                         01133000
011340     MOVE MIM-7105VALUE (WS-CSF-SUB) TO SR-JUSTIFYIN.             01134000
011350     MOVE +0015 TO SR-JLGTH.                                      01135000
011360     PERFORM RIGHT-JUSTIFY.                                       01136000
011370     IF SR-JUSTIFYOUT IS EQUAL TO SPACE                           01137000
011380         OR SR-JUSTIFYOUT IS EQUAL TO ZEROS                       01138000
011390         GO TO MCSFR-EXIT                                         01139000
011400     ELSE                                                         01140000
011410         MOVE SR-JUSTIFYOUT TO MIM-7105VALUE (WS-CSF-SUB).        01141000
011420     MOVE MIM-7105VALUE (WS-CSF-SUB) TO WS-NUM-15.                01142000
011430     IF WS-NUM-15 IS LESS THAN 100                                01143000
011440         AND (MICSF-DATEFCD IS EQUAL TO 'C'                       01144000
011450         OR MICSF-ECD IS EQUAL TO 14)                             01145000
011460         GO TO MCSFR-DATE.                                        01146000
011470     GO TO MCSFR-END.                                             01147000
011480 MCSFR-DATE.                                                      01148000
011490     MOVE WS-PDATE TO WS-PDATE2.                                  01149000
011500     SUBTRACT WS-NUM-15 FROM WS-PDATE2-YYYY.                      01150000
011510     MOVE WS-PDATE2 TO WS-NUM-15.                                 01151000
011520     MOVE WS-NUM-15 TO MIM-7105VALUE (WS-CSF-SUB).                01152000
011530     IF MIM-7105REL (WS-CSF-SUB)(1:1) IS EQUAL TO 'G'             01153000
011540         MOVE 'L' TO MIM-7105REL (WS-CSF-SUB)(1:1)                01154000
011550         GO TO MCSFR-END.                                         01155000
011560     IF MIM-7105REL (WS-CSF-SUB)(1:1) IS EQUAL TO 'L'             01156000
011570         MOVE 'G' TO MIM-7105REL (WS-CSF-SUB)(1:1).               01157000
011580 MCSFR-END.                                                       01158000
011590     ADD +0001 TO WS-CSF-SUB.                                     01159000
011600     IF MIM-7105KEYWORD (WS-CSF-SUB) IS EQUAL TO SPACES           01160000
011610         OR WS-CSF-SUB IS GREATER THAN WS-CSF-SUBMAX              01161000
011620         SUBTRACT +0001 FROM WS-CSF-SUB                           01162000
011630         MOVE WS-CSF-SUB TO WS-CSF-SUBMAX                         01163000
011640         GO TO MCSFR-EXIT.                                        01164000
011650     IF MIM-7105KEYWORD (WS-CSF-SUB) IS EQUAL TO MICSF-FIELDNAME  01165000
011660         GO TO MCSFR-CONT.                                        01166000
011670     GO TO MCSFR-LOOP.                                            01167000
011680 MCSFR-EXIT.                                                      01168000
011690     EXIT.                                                        01169000
011700******************************************************************01170000
011710 PULL-DATA SECTION.                                               01171000
011720 PDATA-START.                                                     01172000
011730     MOVE +0000 TO WS-CSF-SUB.                                    01173000
011740 PDATA-LOOP.                                                      01174000
011750     ADD +0001 TO WS-CSF-SUB.                                     01175000
011760     IF WS-CSF-SUB IS GREATER THAN WS-CSF-SUBMAX                  01176000
011770         GO TO PDATA-EXIT.                                        01177000
011780     MOVE SPACES TO WS-SRWORK2.                                   01178000
011790     MOVE WS-CSF-RDISPLACE (WS-CSF-SUB) TO WS-DISP1.              01179000
011800     MOVE WS-CSF-RLGTH (WS-CSF-SUB) TO WS-LENGTH.                 01180000
011810     MOVE 1 TO WS-DISP2.                                          01181000
011820     IF WS-CSF-DATEFCD (WS-CSF-SUB) IS EQUAL TO 'J'               01182000
011830         OR WS-CSF-DATEFCD (WS-CSF-SUB) IS EQUAL TO 'C'           01183000
011840         MOVE 'Y' TO WS-DATE-TEST                                 01184000
011850     ELSE                                                         01185000
011860         MOVE 'N' TO WS-DATE-TEST.                                01186000
011870     MOVE +15 TO SR-JLGTH.                                        01187000
011880     IF WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 1               01188000
011890         PERFORM MOVE-DATABASE-TO-SRWORK2                         01189000
011900         MOVE WS-SRWORK2 TO WS-CSF-FIELD (WS-CSF-SUB)             01190000
011910         GO TO PDATA-LOOP.                                        01191000
011920     IF WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 2               01192000
011930         OR WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 6           01193000
011940         PERFORM MOVE-DATABASE-TO-SRWORK2                         01194000
011950         MOVE WS-SRWORK2 TO WS-CSF-FIELD (WS-CSF-SUB)             01195000
011960         MOVE WS-CSF-FIELD (WS-CSF-SUB) TO SR-JUSTIFYIN           01196000
011970         PERFORM RIGHT-JUSTIFY                                    01197000
011980         IF SR-JUSTIFYOUT IS NOT NUMERIC                          01198000
011990             MOVE 'X' TO WS-FUNCTION                              01199000
012000             GO TO PDATA-EXIT                                     01200000
012010         ELSE                                                     01201000
012020             MOVE SR-JUSTIFYOUT TO WS-CSF-FIELD (WS-CSF-SUB)      01202000
012030             GO TO PDATA-LOOP.                                    01203000
012040     PERFORM BINARY-PACKED-TO-NUMERIC.                            01204000
012050     MOVE WS-SRWORK2 TO WS-CSF-FIELD (WS-CSF-SUB).                01205000
012060     MOVE WS-CSF-FIELD-N (WS-CSF-SUB) TO WS-NUM-15.               01206000
012070     IF WS-NUM-15 IS NOT NUMERIC                                  01207000
012080         MOVE 'X' TO WS-FUNCTION                                  01208000
012090         GO TO PDATA-EXIT.                                        01209000
012100     MOVE WS-NUM-15 TO WS-CSF-FIELD-N (WS-CSF-SUB).               01210000
012110     GO TO PDATA-LOOP.                                            01211000
012120 PDATA-EXIT.                                                      01212000
012130     EXIT.                                                        01213000
012140******************************************************************01214000
012150 COMPARE-DATA SECTION.                                            01215000
012160 CDATA-START.                                                     01216000
012170     MOVE +0000 TO WS-CSF-SUB.                                    01217000
012180 CDATA-LOOP.                                                      01218000
012190     ADD +0001 TO WS-CSF-SUB.                                     01219000
012200     IF WS-CSF-SUB IS GREATER THAN WS-CSF-SUBMAX                  01220000
012210         GO TO CDATA-EXIT.                                        01221000
012220     IF WS-CSF-FIELD (WS-CSF-SUB) IS EQUAL TO ZEROS               01222000
012230         AND (WS-CSF-DATEFCD (WS-CSF-SUB) IS EQUAL TO 'C'         01223000
012240         OR WS-CSF-ECD (WS-CSF-SUB) IS EQUAL TO 14)               01224000
012250         MOVE '2' TO WS-TRUE-SW (WS-SUB99)                        01225000
012260         GO TO CDATA-078.                                         01226000
012270     IF WS-TRUE-SW (WS-SUB99) IS EQUAL TO '2'                     01227000
012280         GO TO CDATA-078.                                         01228000
012290     IF MIM-7105REL (WS-CSF-SUB) IS EQUAL TO 'EQ'                 01229000
012300         GO TO CDATA-075E.                                        01230000
012310     IF MIM-7105REL (WS-CSF-SUB) IS EQUAL TO 'NE'                 01231000
012320         GO TO CDATA-075NE.                                       01232000
012330     IF MIM-7105REL (WS-CSF-SUB) IS EQUAL TO 'LT'                 01233000
012340         GO TO CDATA-075L.                                        01234000
012350     IF MIM-7105REL (WS-CSF-SUB) IS EQUAL TO 'GT'                 01235000
012360         GO TO CDATA-075G.                                        01236000
012370     IF MIM-7105REL (WS-CSF-SUB) IS EQUAL TO 'LE'                 01237000
012380         GO TO CDATA-075LE.                                       01238000
012390     IF MIM-7105REL (WS-CSF-SUB) IS EQUAL TO 'GE'                 01239000
012400         GO TO CDATA-075GE.                                       01240000
012410 CDATA-075E.                                                      01241000
012420     IF MIM-7105VALUE (WS-CSF-SUB)                                01242000
012430         IS EQUAL TO WS-CSF-FIELD (WS-CSF-SUB)                    01243000
012440         MOVE '1' TO WS-TRUE-SW (WS-SUB99)                        01244000
012450     ELSE                                                         01245000
012460         MOVE '2' TO WS-TRUE-SW (WS-SUB99).                       01246000
012470     GO TO CDATA-078.                                             01247000
012480 CDATA-075NE.                                                     01248000
012490     IF MIM-7105VALUE (WS-CSF-SUB)                                01249000
012500         IS NOT EQUAL TO WS-CSF-FIELD (WS-CSF-SUB)                01250000
012510         MOVE '1' TO WS-TRUE-SW (WS-SUB99)                        01251000
012520     ELSE                                                         01252000
012530         MOVE '2' TO WS-TRUE-SW (WS-SUB99).                       01253000
012540     GO TO CDATA-078.                                             01254000
012550 CDATA-075L.                                                      01255000
012560     IF MIM-7105VALUE (WS-CSF-SUB)                                01256000
012570         IS GREATER THAN WS-CSF-FIELD (WS-CSF-SUB)                01257000
012580         MOVE '1' TO WS-TRUE-SW (WS-SUB99)                        01258000
012590     ELSE                                                         01259000
012600         MOVE '2' TO WS-TRUE-SW (WS-SUB99).                       01260000
012610     GO TO CDATA-078.                                             01261000
012620 CDATA-075G.                                                      01262000
012630     IF MIM-7105VALUE (WS-CSF-SUB)                                01263000
012640         IS LESS THAN WS-CSF-FIELD (WS-CSF-SUB)                   01264000
012650         MOVE '1' TO WS-TRUE-SW (WS-SUB99)                        01265000
012660     ELSE                                                         01266000
012670         MOVE '2' TO WS-TRUE-SW (WS-SUB99).                       01267000
012680     GO TO CDATA-078.                                             01268000
012690 CDATA-075GE.                                                     01269000
012700     IF MIM-7105VALUE (WS-CSF-SUB)                                01270000
012710         IS NOT GREATER THAN WS-CSF-FIELD (WS-CSF-SUB)            01271000
012720         MOVE '1' TO WS-TRUE-SW (WS-SUB99)                        01272000
012730     ELSE                                                         01273000
012740         MOVE '2' TO WS-TRUE-SW (WS-SUB99).                       01274000
012750     GO TO CDATA-078.                                             01275000
012760 CDATA-075LE.                                                     01276000
012770     IF MIM-7105VALUE (WS-CSF-SUB)                                01277000
012780         IS NOT LESS THAN WS-CSF-FIELD (WS-CSF-SUB)               01278000
012790         MOVE '1' TO WS-TRUE-SW (WS-SUB99)                        01279000
012800     ELSE                                                         01280000
012810         MOVE '2' TO WS-TRUE-SW (WS-SUB99).                       01281000
012820     GO TO CDATA-078.                                             01282000
012830 CDATA-078.                                                       01283000
012840     IF MIM-7105CONJUNCTION (WS-CSF-SUB) IS EQUAL TO 'PRI'        01284000
012850         AND WS-TRUE-SW (WS-SUB99) IS EQUAL TO '2'                01285000
012860         MOVE '4' TO WS-TRUE-SW (WS-SUB99).                       01286000
012870     IF MIM-7105CONJUNCTION (WS-CSF-SUB) IS EQUAL TO ' OR'        01287000
012880         OR MIM-7105CONJUNCTION (WS-CSF-SUB) IS EQUAL TO 'OR '    01288000
012890         ADD 1 TO WS-SUB99.                                       01289000
012900     IF MIM-7105CONJUNCTION (WS-CSF-SUB) IS EQUAL TO 'END'        01290000
012910         OR WS-TRUE-SW (WS-SUB99) IS EQUAL TO '4'                 01291000
012920         ADD 1 TO WS-SUB99                                        01292000
012930         GO TO CDATA-EXIT.                                        01293000
012940     GO TO CDATA-LOOP.                                            01294000
012950 CDATA-EXIT.                                                      01295000
012960     EXIT.                                                        01296000
012970******************************************************************01297000
012980 BINARY-PACKED-TO-NUMERIC SECTION.                                01298000
012990******************************************************************01299000
013000*    USE WHEN BINARY OR PACKED DATA IS TO BE MOVED FROM THE      *01300000
013010*    DATA BASE TO WS-SRWORK2                                     *01301000
013020*    1. MOVE INPUT START POSITION TO WS-DISP1.                   *01302000
013030*    2. MOVE OUTPUT START POSITION TO WS-DISP2.                  *01303000
013040*    2. MOVE DATA-BASE FIELD LENGTH TO WS-LENGTH.                *01304000
013050*    3. MOVE CARD FIELD LENGTH TO SR-JLGTH.                      *01305000
013060*    4. PERFORM THIS ROUTINE.                                    *01306000
013070*    5. MOVE WS-SRWORK2 TO FIELD REQUIRING DATA.                 *01307000
013080******************************************************************01308000
013090 BPTN-START.                                                      01309000
013100     MOVE SR-JLGTH TO WS-JLGTH.                                   01310000
013110     MOVE LOW-VALUES TO WS-SRWORK2.                               01311000
013120     COMPUTE WS-DISP2 = 11 - WS-LENGTH.                           01312000
013130     PERFORM MOVE-DATABASE-TO-SRWORK2.                            01313000
013140     MOVE WS-SRWORK2 TO WS-10X.                                   01314000
013150     IF (WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 4              01315000
013160         OR WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 8)          01316000
013170         AND WS-CSF-RLGTH (WS-CSF-SUB) IS LESS THAN 3             01317000
013180         MOVE WS-10X TO WS-10B2                                   01318000
013190         MOVE WS-2B TO WS-8B                                      01319000
013200         GO TO BPTN-TEST-EFFDATE.                                 01320000
013210     IF (WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 4              01321000
013220         OR WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 8)          01322000
013230         AND WS-CSF-RLGTH (WS-CSF-SUB) IS LESS THAN 5             01323000
013240         MOVE WS-10X TO WS-10B4                                   01324000
013250         MOVE WS-4B TO WS-8B.                                     01325000
013260 BPTN-TEST-EFFDATE.                                               01326000
013270     IF (WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 4              01327000
013280         OR WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 8)          01328000
013290         AND WS-CSF-ENTRYTYPE (WS-CSF-SUB) IS EQUAL TO 'E'        01329000
013300         MULTIPLY -1 BY WS-8B.                                    01330000
013310     IF (WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 3              01331000
013320         OR WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 7)          01332000
013330         AND WS-CSF-ENTRYTYPE (WS-CSF-SUB) IS EQUAL TO 'E'        01333000
013340         MULTIPLY -1 BY WS-10P.                                   01334000
013350     IF WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 4               01335000
013360         MOVE WS-8B TO WS-18NS                                    01336000
013370         GO TO BPTN-MOVE.                                         01337000
013380     IF WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 8               01338000
013390         MOVE WS-8B TO WS-18N                                     01339000
013400         GO TO BPTN-MOVE.                                         01340000
013410     IF WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 3               01341000
013420         AND (WS-10P IS NUMERIC                                   01342000
013430         OR WS-10PN IS NUMERIC)                                   01343000
013440         MOVE WS-10P TO WS-18NS                                   01344000
013450         GO TO BPTN-MOVE.                                         01345000
013460     IF WS-CSF-EFORMATCD (WS-CSF-SUB) IS EQUAL TO 7               01346000
013470         AND (WS-10P IS NUMERIC                                   01347000
013480         OR WS-10PN IS NUMERIC)                                   01348000
013490         MOVE WS-10P TO WS-18N                                    01349000
013500         GO TO BPTN-MOVE.                                         01350000
013510     MOVE ALL '?' TO WS-SRWORK2.                                  01351000
013520     MOVE 1 TO WS-CSF-EFORMATCD (WS-CSF-SUB).                     01352000
013530     GO TO BPTN-EXIT.                                             01353000
013540 BPTN-MOVE.                                                       01354000
013550     MOVE WS-18NX TO SR-JUSTIFYIN.                                01355000
013560     MOVE 18 TO SR-JLGTH.                                         01356000
013570     PERFORM LEFT-JUSTIFY.                                        01357000
013580     IF SR-JUSTIFYOUT IS EQUAL TO SPACES                          01358000
013590         MOVE WS-18NX TO SR-JUSTIFYOUT.                           01359000
013600     MOVE WS-JLGTH TO SR-JLGTH.                                   01360000
013610     PERFORM FIELD-ADJUST.                                        01361000
013620     IF WS-DATE-TEST IS EQUAL TO 'Y'                              01362000
013630         MOVE 'N' TO WS-DATE-TEST                                 01363000
013640         GO TO BPTN-EXIT.                                         01364000
013650     IF WS-CSF-DATEFCD (WS-CSF-SUB) IS NOT EQUAL TO 'J'           01365000
013660         AND WS-CSF-DATEFCD (WS-CSF-SUB) IS NOT EQUAL TO 'C'      01366000
013670         GO TO BPTN-EXIT.                                         01367000
013680     IF WS-CSF-DATEFCD (WS-CSF-SUB) IS EQUAL TO 'J'               01368000
013690         MOVE WS-SRWORK2 TO SR-FROMJULR                           01369000
013700         PERFORM CALENDAR-365.                                    01370000
013710     IF WS-CSF-DATEFCD (WS-CSF-SUB) IS EQUAL TO 'C'               01371000
013720         MOVE WS-SRWORK2 TO WS-CYEAR-FIRST                        01372000
013730         MOVE WS-CMM TO SR-FCMON                                  01373000
013740         MOVE WS-CDD TO SR-FCDAY                                  01374000
013750         MOVE WS-CYYYY TO SR-FCYR                                 01375000
013760         MOVE SR-FROMCALR TO SR-TOCAL.                            01376000
013770     IF WS-CSF-DATEFCD (WS-CSF-SUB) IS EQUAL TO 'C'               01377000
013780         AND SR-TCYR IS EQUAL TO ZERO                             01378000
013790         MOVE SR-TOCAL TO WS-SRWORK2                              01379000
013800         GO TO BPTN-EXIT.                                         01380000
013810     IF SR-TOCAL IS EQUAL TO ZERO                                 01381000
013820         OR SR-TCYR IS GREATER THAN 299                           01382000
013830         MOVE SR-TOCAL TO WS-SRWORK2                              01383000
013840         GO TO BPTN-EXIT.                                         01384000
013850     IF SR-TCYR IS LESS THAN 50                                   01385000
013860         ADD 200 TO SR-TCYR                                       01386000
013870         GO TO BPTN-BASE-YEAR.                                    01387000
013880     IF SR-TCYR IS LESS THAN 100                                  01388000
013890         ADD 100 TO SR-TCYR.                                      01389000
013900 BPTN-BASE-YEAR.                                                  01390000
013910     ADD 1800 TO SR-TCYR.                                         01391000
013920     MOVE SR-TOCAL TO WS-SRWORK2.                                 01392000
013930 BPTN-EXIT.                                                       01393000
013940     EXIT.                                                        01394000
013950******************************************************************01395000
013960 FIELD-ADJUST SECTION.                                            01396000
013970******************************************************************01397000
013980*    USE WHEN A NUMERIC FIELD IS LONGER THAN NEEDED AND YOU WANT *01398000
013990*    THE NUMERIC FIELD RIGHT JUSTIFIED FOR A SPECIFIED LENGTH.   *01399000
014000* 1. MOVE ORIGINAL DATA TO SR-JUSTIFYOUT.                        *01400000
014010* 2. MOVE SPECIFIED LENGTH TO SR-JLGTH.                          *01401000
014020* 3. PERFORM THIS ROUTINE.                                       *01402000
014030* 4. MOVE WS-SRWORK2 TO THE FIELD YOU REQUIRE THE ADJUSTED DATA. *01403000
014040******************************************************************01404000
014050 FA-START.                                                        01405000
014060     MOVE SR-JLGTH TO WS-LENGTH.                                  01406000
014070     MOVE SR-JUSTIFYOUT TO SR-JUSTIFYIN.                          01407000
014080     PERFORM RIGHT-JUSTIFY.                                       01408000
014090     MOVE SR-JUSTIFYOUT TO WS-SRWORK.                             01409000
014100     MOVE SPACES TO WS-SRWORK2.                                   01410000
014110     MOVE 1 TO WS-DISP1.                                          01411000
014120     MOVE 1 TO WS-DISP2.                                          01412000
014130     PERFORM MOVE-SRWORK-TO-SRWORK2.                              01413000
014140 FA-EXIT.                                                         01414000
014150     EXIT.                                                        01415000
014160******************************************************************01416000
014170 MOVE-DATABASE-TO-SRWORK2 SECTION.                                01417000
014180 MDTS-START.                                                      01418000
014190     MOVE RPRF21-RETURNED-OBJECT (WS-DISP1:WS-LENGTH)             01419000
014200         TO WS-SRWORK2 (WS-DISP2:WS-LENGTH).                      01420000
014210     IF WS-CSF-EFORMATCD (WS-CSF-SUB) IS NOT EQUAL TO 6           01421000
014220         AND WS-CSF-EFORMATCD (WS-CSF-SUB) IS NOT EQUAL TO 2      01422000
014230         GO TO MDTS-EXIT.                                         01423000
014240     IF WS-DATE-TEST IS EQUAL TO 'Y'                              01424000
014250         MOVE 'N' TO WS-DATE-TEST                                 01425000
014260         GO TO MDTS-EXIT.                                         01426000
014270     IF WS-CSF-ENTRYTYPE (WS-CSF-SUB) IS EQUAL TO 'J'             01427000
014280         AND WS-SRW2J IS NUMERIC                                  01428000
014290         ADD 99999999 TO WS-SRW2J.                                01429000
014300     IF WS-CSF-DATEFCD (WS-CSF-SUB) IS NOT EQUAL TO 'J'           01430000
014310         AND WS-CSF-DATEFCD (WS-CSF-SUB) IS NOT EQUAL TO 'C'      01431000
014320         GO TO MDTS-EXIT.                                         01432000
014330     IF WS-CSF-DATEFCD (WS-CSF-SUB) IS EQUAL TO 'J'               01433000
014340         MOVE WS-SRWORK2 TO SR-FROMJULR                           01434000
014350         PERFORM CALENDAR-365.                                    01435000
014360     IF WS-CSF-DATEFCD (WS-CSF-SUB) IS EQUAL TO 'C'               01436000
014370         MOVE WS-SRWORK2 TO WS-CYEAR-FIRST                        01437000
014380         MOVE WS-CMM TO SR-FCMON                                  01438000
014390         MOVE WS-CDD TO SR-FCDAY                                  01439000
014400         MOVE WS-CYYYY TO SR-FCYR                                 01440000
014410         MOVE SR-FROMCALR TO SR-TOCAL.                            01441000
014420     IF SR-TOCAL IS EQUAL TO ZERO                                 01442000
014430         OR SR-TCYR IS GREATER THAN 299                           01443000
014440         MOVE SR-TOCAL TO WS-SRWORK2                              01444000
014450         GO TO MDTS-EXIT.                                         01445000
014460     IF SR-TCYR IS LESS THAN 50                                   01446000
014470         ADD 200 TO SR-TCYR                                       01447000
014480         GO TO MDTS-BASE-YEAR.                                    01448000
014490     IF SR-TCYR IS LESS THAN 100                                  01449000
014500         ADD 100 TO SR-TCYR.                                      01450000
014510 MDTS-BASE-YEAR.                                                  01451000
014520     ADD 1800 TO SR-TCYR.                                         01452000
014530     MOVE SR-TOCAL TO WS-SRWORK2.                                 01453000
014540 MDTS-EXIT.                                                       01454000
014550     EXIT.                                                        01455000
014560******************************************************************01456000
014570 MOVE-SRWORK-TO-SRWORK2 SECTION.                                  01457000
014580 MSTS-START.                                                      01458000
014590     MOVE WS-SRWORK (WS-DISP1:WS-LENGTH)                          01459000
014600         TO WS-SRWORK2 (WS-DISP2:WS-LENGTH).                      01460000
014610 MSTS-EXIT.                                                       01461000
014620     EXIT.                                                        01462000
014630******************************************************************01463000
014640 CHECK-REL-CODE SECTION.                                          01464000
014650 CRELCD-START.                                                    01465000
014660     MOVE +0001 TO WS-SUB2.                                       01466000
014670     IF MIM-7104OPT IS EQUAL TO 'E'                               01467000
014680         GO TO CRELCD-EXCLUDE.                                    01468000
014690 CRELCD-INCLUDE.                                                  01469000
014700     IF WS-SUB2 IS GREATER THAN 0050                              01470000
014710         GO TO CRELCD-EXIT.                                       01471000
014720     IF MIM-7104RLSP (WS-SUB2) IS EQUAL TO ZEROS                  01472000
014730         OR MIM-7104RLSP (WS-SUB2) IS EQUAL TO SPACES             01473000
014740         GO TO CRELCD-EXIT.                                       01474000
014750     IF RPRF21-REL IS EQUAL TO MIM-7104RLSP (WS-SUB2)             01475000
014760         MOVE 'Y' TO WS-KEEP-FLAG                                 01476000
014770         GO TO CRELCD-EXIT.                                       01477000
014780     ADD +0001 TO WS-SUB2.                                        01478000
014790     GO TO CRELCD-INCLUDE.                                        01479000
014800 CRELCD-EXCLUDE.                                                  01480000
014810     IF WS-SUB2 IS GREATER THAN 0050                              01481000
014820         MOVE 'Y' TO WS-KEEP-FLAG                                 01482000
014830         GO TO CRELCD-EXIT.                                       01483000
014840     IF MIM-7104RLSP (WS-SUB2) IS EQUAL TO ZEROS                  01484000
014850         OR MIM-7104RLSP (WS-SUB2) IS EQUAL TO SPACES             01485000
014860         MOVE 'Y' TO WS-KEEP-FLAG                                 01486000
014870         GO TO CRELCD-EXIT.                                       01487000
014880     IF RPRF21-REL IS EQUAL TO MIM-7104RLSP (WS-SUB2)             01488000
014890         GO TO CRELCD-EXIT.                                       01489000
014900     ADD +0001 TO WS-SUB2.                                        01490000
014910     GO TO CRELCD-EXCLUDE.                                        01491000
014920 CRELCD-EXIT.                                                     01492000
014930     EXIT.                                                        01493000
014940******************************************************************01494000
014950 LINK-INTERFACE SECTION.                                          01495000
014960 LINT-START.                                                      01496000
014970     MOVE MIM-237OLINTFC TO WS-PROGRAM.                           01497000
014980     MOVE RPXXX02-KEY-INST TO RPINF00-INST.                       01498000
014990     MOVE RPXXX02-KEY-ACCOUNT TO RPINF00-ACCOUNT.                 01499000
015000     MOVE RPXXX02-KEY-PRODCODE TO RPINF00-PRODCODE.               01500000
015010     MOVE MIM-2023INTAPPL211 TO RPINF00-APPLR.                    01501000
015020     MOVE MIM-7101CLOSEDACCTOPT TO RPINF00-CLOSEDACCTOPT.         01502000
015030     MOVE RPXXX02-CONTROLS TO RPINF00-CONTROLS.                   01503000
015040     MOVE ZEROS TO RPINF00-ABORT.                                 01504000
015050     MOVE 'N' TO RPINF00-GLOBAL-CLOSE.                            01505000
015060     EXEC CICS LINK                                               01506000
015070         PROGRAM(WS-PROGRAM)                                      01507000
015080         COMMAREA(RPINF00-MESSAGE)                                01508000
015090         LENGTH(LENGTH OF RPINF00-MESSAGE)                        01509000
015100         RESP(WS-CICS-RESPONSE)                                   01510000
015110         END-EXEC.                                                01511000
015120     MOVE RPINF00-FUNCTION TO WS-FUNCTION.                        01512000
015130     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     01513000
015140         MOVE 'L' TO WS-FUNCTION                                  01514000
015150         MOVE 500039 TO RPXXX02-MSGNBR                            01515000
015160         GO TO LINT-EXIT.                                         01516000
015170     IF WS-FUNCTION IS EQUAL TO 'L'                               01517000
015180         MOVE 500040 TO RPXXX02-MSGNBR                            01518000
015190         GO TO LINT-EXIT.                                         01519000
015200     IF WS-FUNCTION IS EQUAL TO 'C'                               01520000
015210         MOVE 500041 TO RPXXX02-MSGNBR                            01521000
015220         GO TO LINT-EXIT.                                         01522000
015230     IF RPINF00-ABORT IS NOT EQUAL TO ZEROS                       01523000
015240         MOVE RPINF00-ABORT TO RPXXX02-ABORT                      01524000
015250         MOVE RPINF00-ABTRACE TO RPXXX02-ABTRACE                  01525000
015260         GO TO LINT-EXIT.                                         01526000
015270     MOVE 'Y' TO WS-INTERFACE.                                    01527000
015280 LINT-EXIT.                                                       01528000
015290     EXIT.                                                        01529000
015300******************************************************************01530000
015310 USER-EXIT SECTION.                                               01531000
015320 UEXIT-START.                                                     01532000
015330     MOVE SPACES TO RPUSER-MESSAGE.                               01533000
015340     IF WS-INTERFACE IS NOT EQUAL TO 'Y'                          01534000
015350         GO TO UEXIT-CONT.                                        01535000
015360     MOVE RPINF00-KEY-AREAS TO RPUSER-KEY-AREAS.                  01536000
015370     MOVE RPINF00-USER-INFO TO RPUSER-USER-INFO.                  01537000
015380     MOVE RPINF00-MISC-INFO TO RPUSER-MISC-INFO.                  01538000
015390     MOVE RPINF00-BAL-INFO TO RPUSER-BAL-INFO.                    01539000
015400     GO TO UEXIT-CALL.                                            01540000
015410 UEXIT-CONT.                                                      01541000
015420     MOVE RPXXX02-KEY-INST TO RPUSER-INST.                        01542000
015430     MOVE RPRF21-BASE-ACCT-PRODCODE TO RPUSER-PRODCODE.           01543000
015440     MOVE RPRF21-BASE-ACCT TO RPUSER-ACCOUNT.                     01544000
015450     MOVE MIM-2023INTAPPL211 TO RPUSER-APPLR.                     01545000
015460     INITIALIZE RPUSER-GRP-DATA.                                  01546000
015470 UEXIT-CALL.                                                      01547000
000000     CALL 'RPBUSER' USING                                         01548000
015490         RPUSER-MESSAGE                                           01549000
015500         WS-FUNCTION.                                             01550000
015510 UEXIT-EXIT.                                                      01551000
015520     EXIT.                                                        01552000
015530******************************************************************01553000
015540 CREATE-IDNUMBER SECTION.                                         01554000
015550 CID-START.                                                       01555000
015560     EXEC CICS ASKTIME                                            01556000
015570         END-EXEC.                                                01557000
015580     MOVE WS-CURDT-YYYYMMDD TO WS-IDNBR-DATE.                     01558000
015590     MOVE EIBTIME TO WS-IDNBR-TIME.                               01559000
015600     MOVE ZEROES TO WS-IDNBR-SEQ.                                 01560000
015610     MOVE RPXXX02-KEY-INST TO RPQUA-INST.                         01561000
P0037      MOVE RPXXX02-KEY-INST TO WS-RPIDX-INST.                      01561100
P0037      PERFORM CALCULATE-MIL-SECOND.                                01561200
P0037      IF WS-RPIDX-ERROR IS EQUAL TO 'Y'                            01561300
P0037          MOVE WS-AB6310 TO RPXXX02-ABORT                          01561400
P0037          MOVE WS-TR0011 TO RPXXX02-ABTRACE                        01561500
P0037          GO TO CICS-RETURN.                                       01561600
015620     MOVE WS-IDNBR-GRP TO RPXXX02-IDNUMBER.                       01562000
015630 CID-EXIT.                                                        01563000
015640     EXIT.                                                        01564000
015650******************************************************************01565000
015660 WRITE-QUA-RECORD SECTION.                                        01566000
015670 WQUA-START.                                                      01567000
015680     MOVE ZERO TO WS-SUB1.                                        01568000
015690     MOVE RPXXX02-KEY-INST TO MIM-2023KINST.                      01569000
015700     MOVE 'RP' TO MIM-2023KPRODCODE.                              01570000
015710     MOVE RPXXX02-INST-OPT-1 TO SLW096-BANKS.                     01571000
015720     PERFORM SLP096-GET-2023-RECORD.                              01572000
015730     IF SLW096-FUNCTION IS EQUAL TO SPACES                        01573000
015740         MOVE MIM-2023KPRODCODE TO RPXXX02-RP-PRODCODE            01574000
015750         GO TO FRPR-IDX.                                          01575000
015760 FRPR-PRODCD-LOOP.                                                01576000
015770     ADD +1 TO WS-SUB1.                                           01577000
015780     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 01578000
015790         MOVE WS-AB3051 TO RPXXX02-ABORT                          01579000
015800         MOVE WS-TR0008 TO RPXXX02-ABTRACE                        01580000
015810         GO TO CICS-RETURN.                                       01581000
015820     IF SLW096-2023INTAPPL211 (WS-SUB1)                           01582000
015830         IS NOT EQUAL TO RPXXX02-APPL                             01583000
015840         GO TO FRPR-PRODCD-LOOP.                                  01584000
015850     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO RPXXX02-RP-PRODCODE.  01585000
015860 FRPR-IDX.                                                        01586000
015870     INITIALIZE RPIDX-RECORD.                                     01587000
015880     MOVE RPXXX02-KEY-INST TO RPIDX-INST.                         01588000
015890     MOVE RPXXX02-RP-PRODCODE TO RPIDX-PRODCODE.                  01589000
015900     MOVE RPXXX02-IDNUMBER TO RPIDX-IDNUMBER.                     01590000
015910     MOVE RPXXX02-IDNUMBER TO WS-IDNBR-GRP.                       01591000
015920     MOVE RPXXX02-KEY-RECORD TO RPIDX-ACCT2-KEY.                  01592000
015930 FRPR-IDX-ADD.                                                    01593000
015940     PERFORM RPS-IDX-PUT-REQUEST.                                 01594000
015950     IF WS-FUNCTION IS EQUAL TO '='                               01595000
015960         ADD +0001 TO WS-IDNBR-SEQ                                01596000
015970         MOVE WS-IDNBR-GRP TO RPIDX-IDNUMBER                      01597000
015980         MOVE 'Y' TO RPXXX02-IDNBR-CHANGE                         01598000
015990         GO TO FRPR-IDX-ADD.                                      01599000
016000     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01600000
016010         MOVE WS-AB6310 TO RPXXX02-ABORT                          01601000
016020         MOVE WS-TR0009 TO RPXXX02-ABTRACE                        01602000
016030         GO TO CICS-RETURN.                                       01603000
016040     MOVE 'Y' TO WS-UPDATESW.                                     01604000
016050     MOVE RPIDX-IDNUMBER TO RPXXX02-IDNUMBER.                     01605000
016060 FRPR-QUA.                                                        01606000
016070     INITIALIZE RPQUA-RECORD.                                     01607000
016080     MOVE RPXXX02-KEY-RECORD TO RPQUA-GRP-KEY.                    01608000
016090     MOVE RPXXX02-CUST-KEY TO RPQUA-RCIF-KEY.                     01609000
016100     MOVE RPXXX02-CUST-NAME TO RPQUA-CUST-NAME.                   01610000
016110     MOVE WS-CURDT-YYYYMMDD TO RPQUA-DATE-OPENED.                 01611000
016120     MOVE RPXXX02-KEY-MODEL TO RPQUA-MODEL.                       01612000
016130     MOVE RPXXX02-IDNUMBER TO RPQUA-IDNUMBER.                     01613000
016140     MOVE RPXXX02-BRANCH TO RPQUA-BRANCH.                         01614000
016150     MOVE RPXXX02-ACCT-TYPE TO RPQUA-ACCT-TYPE.                   01615000
016160     MOVE RPXXX02-ENROLL-ATTEMPTS TO RPQUA-ENROLLATTEMPTS.        01616000
P0075      MOVE RPXXX02-EXPIRATION-DATE TO RPQUA-EXPIRATION-DATE.       01616500
016170     PERFORM RPS-QUA-PUT-REQUEST.                                 01617000
016180     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01618000
016190         MOVE WS-AB6325 TO RPXXX02-ABORT                          01619000
016200         MOVE WS-TR0010 TO RPXXX02-ABTRACE                        01620000
016210         GO TO CICS-RETURN.                                       01621000
016220     MOVE 'Y' TO WS-UPDATESW.                                     01622000
016230 WQUA-EXIT.                                                       01623000
016240     EXIT.                                                        01624000
016250******************************************************************01625000
P0037  CALCULATE-MIL-SECOND SECTION.                                    01625200
000000 COPY RPP005.                                                     01625400
P0037 ******************************************************************01625600
016260 REQUEST-CUSTOMER SECTION.                                        01626000
016270 RC-START.                                                        01627000
016280     MOVE SPACES TO RPRF21-FUNCTION.                              01628000
016290     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             01629000
016300     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         01630000
016310     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          01631000
016320     EXEC CICS LINK                                               01632000
016330         PROGRAM('RPO0RF21')                                      01633000
016340         COMMAREA(RPRF21-MESSAGE)                                 01634000
016350         LENGTH(LENGTH OF RPRF21-MESSAGE)                         01635000
016360         RESP(WS-CICS-RESPONSE)                                   01636000
016370         END-EXEC.                                                01637000
016380     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         01638000
016390     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     01639000
016400         MOVE 'L' TO WS-FUNCTION                                  01640000
016410         MOVE 500036 TO RPXXX02-MSGNBR                            01641000
016420         GO TO RC-EXIT.                                           01642000
016430     IF WS-FUNCTION IS EQUAL TO 'B'                               01643000
016440         MOVE 500045 TO RPXXX02-MSGNBR                            01644000
016450         GO TO RC-EXIT.                                           01645000
016460     IF WS-FUNCTION IS EQUAL TO 'C'                               01646000
016470         MOVE 500037 TO RPXXX02-MSGNBR                            01647000
016480         GO TO RC-EXIT.                                           01648000
016490     IF WS-FUNCTION IS EQUAL TO 'I'                               01649000
016500         MOVE 500038 TO RPXXX02-MSGNBR.                           01650000
016510 RC-EXIT.                                                         01651000
016520     EXIT.                                                        01652000
016530******************************************************************01653000
016540 VALIDATE-BRANCH SECTION.                                         01654000
000000 COPY RPP7107A.                                                   01655000
016560******************************************************************01656000
000000 COPY RPPACTA.                                                    01657000
P0075 ******************************************************************01657300
000000 COPY RPPBNKA.                                                    01657600
016580******************************************************************01658000
000000 COPY RPPIDXA.                                                    01659000
016600******************************************************************01660000
000000 COPY RPPMSTA.                                                    01661000
016620******************************************************************01662000
000000 COPY RPPQUAA.                                                    01663000
016640******************************************************************01664000
016650 MIC-MST-API SECTION.                                             01665000
000000 COPY MIPMSTA.                                                    01666000
P0075 ******************************************************************01666200
P0075  JULIAN-365 SECTION.                                              01666400
000000 COPY SRP001.                                                     01666600
016670******************************************************************01667000
016680 CALENDAR-365 SECTION.                                            01668000
000000 COPY SRP003.                                                     01669000
P0075 ******************************************************************01669200
P0075  NEXT-DATE-365 SECTION.                                           01669400
000000 COPY SRP009.                                                     01669600
016700******************************************************************01670000
016710 LEFT-JUSTIFY SECTION.                                            01671000
000000 COPY SRP025.                                                     01672000
016730******************************************************************01673000
016740 RIGHT-JUSTIFY SECTION.                                           01674000
000000 COPY SRP026.                                                     01675000
016760******************************************************************01676000
016770 SLP096-GET-2023-RECORD SECTION.                                  01677000
000000 COPY SLP096.                                                     01678000
016790******************************************************************01679000
016800 OPERATOR-DIALOG-SECURITY SECTION.                                01680000
000000 COPY SRP079.                                                     01681000
016820******************************************************************01682000
016830 CICS-ABORT-EXIT SECTION.                                         01683000
016840 CAE-START.                                                       01684000
016850     GO TO CICS-RETURN.                                           01685000
016860 CAE-EXIT.                                                        01686000
016870     EXIT.                                                        01687000
016880******************************************************************01688000
016890 CICS-RETURN SECTION.                                             01689000
016900     IF COM-ABORT IS NOT EQUAL TO ZERO                            01690000
016910         MOVE COM-ABORT TO RPXXX02-ABORT.                         01691000
016920     IF RPXXX02-ABORT IS NOT EQUAL TO ZERO                        01692000
016930         AND WS-UPDATESW IS EQUAL TO 'Y'                          01693000
016940         MOVE 'Y' TO RPXXX02-ABTYPE.                              01694000
016950     IF RPXXX02-ABORT IS NOT EQUAL TO ZERO                        01695000
016960         MOVE WS-FUNCTION TO RPXXX02-FUNCTION                     01696000
016970         MOVE SRB-BMDB TO RPXXX02-SRBMDB                          01697000
016980         MOVE EIBFN TO RPXXX02-ABEIBFN                            01698000
016990         MOVE EIBRESP TO RPXXX02-ABEIBRESP                        01699000
017000         MOVE EIBRESP2 TO RPXXX02-ABEIBRESP2                      01700000
017010         MOVE EIBRCODE TO RPXXX02-ABEIBRCODE.                     01701000
017020     IF RPXXX02-ABTYPE IS NOT EQUAL TO 'Y'                        01702000
017030         PERFORM GLOBAL-CLOSE.                                    01703000
000000 COPY SLP709.                                                     01704000
017050******************************************************************01705000
017060 GLOBAL-CLOSE SECTION.                                            01706000
017070 GC-START.                                                        01707000
017080     IF RPXXX02-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  01708000
017090         PERFORM RPS-MST-GLOBAL-CLOSE-REQUEST.                    01709000
017100 GC-EXIT.                                                         01710000
017110     EXIT.                                                        01711000
017120******************************************************************01712000
