000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX08.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX08 - VALIDATION FAILURE DATE UPDATE MODULE            *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW000-AREAS.                                                00016000
000000 COPY SRW000.                                                     00017000
000180 01  SRW009-AREAS.                                                00018000
000000 COPY SRW009.                                                     00019000
000200 01  SRW022-AREAS.                                                00020000
000000 COPY SRW022.                                                     00021000
000220 01  SRW079-AREAS.                                                00022000
000000 COPY SRW079.                                                     00023000
000240 01  SRW105-AREAS.                                                00024000
000000 COPY SRW105.                                                     00025000
000260*01  BICRSRB.                                                     00026000
000000 COPY BICRSRB.                                                    00027000
000280*01  BICRPSB.                                                     00028000
000000 COPY BICRPSB.                                                    00029000
000300*01  BICRVERB.                                                    00030000
000000 COPY BICRVERB.                                                   00031000
000320*01  BICRSTAT.                                                    00032000
000000 COPY BICRSTAT.                                                   00033000
000340*01  BICRDBS.                                                     00034000
000000 COPY BICRDBS.                                                    00035000
000360*01  BICRLOG.                                                     00036000
000000 COPY BICRLOG.                                                    00037000
000380 01  SRW710-AREAS.                                                00038000
000000 COPY SRW710.                                                     00039000
000400 01  WS-WORKAREAS.                                                00040000
000410     03  COM-ABORT               PIC S9(04)      COMP.            00041000
000420     03  WS-SUB1                 PIC S9(04)      COMP             00042000
000430                                                 VALUE +0000.     00043000
000440     03  WS-SUB2                 PIC S9(04)      COMP             00044000
000450                                                 VALUE +0000.     00045000
000460     03  WS-UPDATESW             PIC X(01)       VALUE SPACES.    00046000
000470     03  WS-EDITSW               PIC X(01)       VALUE SPACES.    00047000
000480     03  WS-INTERFACE            PIC X(01)       VALUE SPACES.    00048000
000490     03  WS-UPDATE-RP            PIC X(01)       VALUE SPACES.    00049000
000500     03  WS-ACT-FLAG             PIC X(01)       VALUE SPACES.    00050000
000510     03  WS-SEC-FLAG             PIC X(01)       VALUE SPACES.    00051000
000520     03  WS-KEEP-FLAG            PIC X(01)       VALUE SPACES.    00052000
000530     03  WS-CLOSE-FLAG           PIC X(01)       VALUE SPACES.    00053000
000540     03  WS-ACCT-TYPE            PIC 9(03)       VALUE ZEROES.    00054000
000550     03  WS-BRANCH               PIC 9(05)       VALUE ZEROES.    00055000
000560     03  WS-ERROR-INDICATOR      PIC X(01)       VALUE SPACES.    00056000
000570     03  WS-MAX-EXTENSIONS       PIC 9(02)       VALUE ZEROS.     00057000
000580     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00058000
000590                                                 VALUE ZERO.      00059000
000600     03  WS-7102-FLAG            PIC X(01)       VALUE SPACES.    00060000
000610     03  WS-7102-DEF-FLAG        PIC X(01)       VALUE 'N'.       00061000
000620     03  WS-7102-DEF-RECORD      PIC X(125)      VALUE SPACES.    00062000
000630     03  WS-RETDAYS              PIC 9(04)       VALUE ZERO.      00063000
000640     03  WS-VF-EXP-DATE          PIC 9(08)       VALUE ZERO.      00064000
000650     03  WS-INT-DATE1            PIC 9(08)       VALUE ZEROS.     00065000
000660     03  WS-INT-DATE2            PIC 9(08)       VALUE ZEROS.     00066000
000670     03  WS-DAYS-BETWEEN         PIC S9(04).                      00067000
000680     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00068000
000690     03  FILLER          REDEFINES WS-CURDATE.                    00069000
000700         05  WS-CURMM            PIC 9(02).                       00070000
000710         05  WS-CURDD            PIC 9(02).                       00071000
000720         05  WS-CURYYYY          PIC 9(04).                       00072000
000730     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00073000
000740     03  FILLER          REDEFINES WS-PDATE.                      00074000
000750         05  WS-PDATE-YYYY       PIC 9(04).                       00075000
000760         05  WS-PDATE-MM         PIC 9(02).                       00076000
000770         05  WS-PDATE-DD         PIC 9(02).                       00077000
000780     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00078000
000790     03  FILLER          REDEFINES WS-PDATE2.                     00079000
000800         05  WS-PDATE2-YYYY      PIC 9(04).                       00080000
000810         05  WS-PDATE2-MM        PIC 9(02).                       00081000
000820         05  WS-PDATE2-DD        PIC 9(02).                       00082000
000830     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00083000
000840                                                 VALUE ZERO.      00084000
000850     03  WS-ERRORMODEL           PIC X(01)       VALUE 'N'.       00085000
000860     03  WS-SAVEMASTERGROUP.                                      00086000
000870         05  WS-SAVEMSTINST      PIC 9(04).                       00087000
000880         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00088000
000890         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00089000
000900         05  WS-SAVEMSTMODEL     PIC X(10).                       00090000
000910*----------------------------------------------------------------*00091000
000920 01  MIWPRI-AREAS.                                                00092000
000000 COPY MIWPRI.                                                     00093000
000940 01  MIWMSTA-AREAS.                                               00094000
000000 COPY MIWMSTA.                                                    00095000
000960 01  MIMST-RECORD.                                                00096000
000000 COPY MISMST.                                                     00097000
000980 01  MI0237-RECORD.                                               00098000
000000 COPY MIS0237A.                                                   00099000
001000 01  MI2023-RECORD.                                               00100000
000000 COPY MIS2023A.                                                   00101000
001020 01  MI7100-RECORD.                                               00102000
000000 COPY MIS7100.                                                    00103000
001040 01  MI7101-RECORD.                                               00104000
000000 COPY MIS7101.                                                    00105000
001060 01  MI7102-RECORD.                                               00106000
000000 COPY MIS7102.                                                    00107000
001080*----------------------------------------------------------------*00108000
001090 01  RPWPRI-AREAS.                                                00109000
000000 COPY RPWPRI.                                                     00110000
001110 01  RPWIDX-AREA.                                                 00111000
000000 COPY RPWIDXA.                                                    00112000
001130 01  RPIDX-RECORD.                                                00113000
000000 COPY RPSIDX.                                                     00114000
001150 01  RPWMST-AREA.                                                 00115000
000000 COPY RPWMSTA.                                                    00116000
001170 01  RPMST-RECORD.                                                00117000
000000 COPY RPSMST.                                                     00118000
001190*----------------------------------------------------------------*00119000
001200 01  RPRF21-MESSAGE.                                              00120000
000000 COPY MISCNT00      REPLACING                                     00121000
001220             ==:MICNT:== BY ==RPRF21==.                           00122000
000000 COPY RPSRF21.                                                    00123000
001240*----------------------------------------------------------------*00124000
001250 01  RPUSER-MESSAGE.                                              00125000
000000 COPY MISCNT00      REPLACING                                     00126000
001270     ==:MICNT:== BY ==RPUSER==.                                   00127000
000000 COPY RPWUSER.                                                    00128000
001290***************************************************************** 00129000
001300 01  WS-TRACECODES.                                               00130000
001310     03  WS-TR0001               PIC S9(04)      COMP             00131000
001320                                                 VALUE +0001.     00132000
001330     03  WS-TR0002               PIC S9(04)      COMP             00133000
001340                                                 VALUE +0002.     00134000
001350     03  WS-TR0003               PIC S9(04)      COMP             00135000
001360                                                 VALUE +0003.     00136000
001370     03  WS-TR0004               PIC S9(04)      COMP             00137000
001380                                                 VALUE +0004.     00138000
001390     03  WS-TR0005               PIC S9(04)      COMP             00139000
001400                                                 VALUE +0005.     00140000
001410     03  WS-TR0006               PIC S9(04)      COMP             00141000
001420                                                 VALUE +0006.     00142000
001430     03  WS-TR0007               PIC S9(04)      COMP             00143000
001440                                                 VALUE +0007.     00144000
001450     03  WS-TR0008               PIC S9(04)      COMP             00145000
001460                                                 VALUE +0008.     00146000
001470 01  WS-ABORTCODES.                                               00147000
001480     03  WS-AB2000               PIC S9(04)      COMP             00148000
001490                                                 VALUE +2000.     00149000
001500     03  WS-AB2033               PIC S9(04)      COMP             00150000
001510                                                 VALUE +2033.     00151000
001520     03  WS-AB6310               PIC S9(04)      COMP             00152000
001530                                                 VALUE +6310.     00153000
001540     03  WS-AB6320               PIC S9(04)      COMP             00154000
001550                                                 VALUE +6320.     00155000
001560******************************************************************00156000
001570 01  SLW096-AREAS.                                                00157000
000000 COPY SLW096.                                                     00158000
001590******************************************************************00159000
001600 LINKAGE SECTION.                                                 00160000
001610 01  DFHCOMMAREA.                                                 00161000
000000 COPY MISCNT00      REPLACING                                     00162000
001630             ==:MICNT:== BY ==RPXXX08==.                          00163000
000000 COPY RPSXXX08.                                                   00164000
001650*01  SLW096-2023RECORDS.                                          00165000
000000 COPY SLW096L.                                                    00166000
001670******************************************************************00167000
001680 PROCEDURE DIVISION.                                              00168000
001690******************************************************************00169000
001700 ENTRY-ROUTINE SECTION.                                           00170000
001710 ER-START.                                                        00171000
001720     IF LENGTH OF DFHCOMMAREA IS NOT EQUAL TO EIBCALEN            00172000
001730         GO TO CICS-RETURN.                                       00173000
001740     MOVE 'RPLXXX08' TO SR-APIPROGLIT.                            00174000
001750     MOVE 'RPLXXX08' TO RPXXX08-ABPROGID.                         00175000
001760     PERFORM CICS-HANDLE-CONDITION.                               00176000
001770     IF EIBCALEN IS EQUAL TO +0                                   00177000
001780         MOVE WS-AB2000 TO RPXXX08-ABORT                          00178000
001790         MOVE WS-TR0001 TO RPXXX08-ABTRACE                        00179000
001800         GO TO CICS-RETURN.                                       00180000
001810     MOVE ZERO TO RPXXX08-MSGNBR.                                 00181000
001820     MOVE SPACE TO WS-FUNCTION.                                   00182000
001830     MOVE RPXXX08-FILEOPTS TO WS-FILEOPTS.                        00183000
001840     MOVE RPXXX08-OPERID TO WS-UPD-USER.                          00184000
001850     MOVE RPXXX08-EXTERNALID TO LOG-PANELID.                      00185000
001860     MOVE RPXXX08-TERMID TO LOG-TERMID.                           00186000
001870     MOVE RPXXX08-WORKID TO LOG-WORKID.                           00187000
001880     MOVE RPXXX08-TRANSTART TO LOG-TRANSTART.                     00188000
001890     MOVE RPXXX08-APPLSEQ TO LOG-APPLSEQ.                         00189000
001900     INITIALIZE RPRF21-MESSAGE.                                   00190000
000000 COPY SLP094.                                                     00191000
001920     GO TO VERIFY-KEY.                                            00192000
001930 ER-EXIT.                                                         00193000
001940     EXIT.                                                        00194000
001950******************************************************************00195000
001960 CICS-HANDLE-CONDITION SECTION.                                   00196000
000000 COPY SLP702.                                                     00197000
001980     MOVE WS-AB2033 TO RPXXX08-ABORT.                             00198000
001990     MOVE WS-TR0002 TO RPXXX08-ABTRACE.                           00199000
002000     GO TO CICS-RETURN.                                           00200000
002010 CHC-EXIT.                                                        00201000
002020     EXIT.                                                        00202000
002030******************************************************************00203000
002040 VERIFY-KEY SECTION.                                              00204000
002050 VK-START.                                                        00205000
002060     MOVE ZERO TO COM-ABORT.                                      00206000
002070     MOVE ZERO TO RPXXX08-ABORT.                                  00207000
002080     MOVE ZERO TO RPXXX08-MSGNBR.                                 00208000
002090     MOVE ZERO TO WS-MSGNBR.                                      00209000
002100     MOVE SPACES TO RPXXX08-FUNCTION.                             00210000
002110     MOVE RPXXX08-DATE TO WS-CURDATE.                             00211000
002120     MOVE WS-CURMM TO WS-PDATE-MM.                                00212000
002130     MOVE WS-CURDD TO WS-PDATE-DD.                                00213000
002140     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00214000
002150     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00215000
002160 VK-SECURITY.                                                     00216000
002170     IF RPXXX08-APIFUNC IS NOT EQUAL TO 'VKL'                     00217000
002180         GO TO VK-MST.                                            00218000
002190     MOVE RPXXX08-UPDATE TO SR-OPDUPDATE.                         00219000
002200     MOVE RPXXX08-SK1-INST TO SR-OPDINST.                         00220000
002210     IF RPXXX08-SK1-INST-DCHG IS NOT EQUAL TO 'Y'                 00221000
002220         MOVE RPXXX08-SK2-INST TO SR-OPDINST.                     00222000
002230     MOVE RPXXX08-OPERID TO SR-OPDOPERID.                         00223000
002240     MOVE RPXXX08-MODELID TO SR-OPDMODELID.                       00224000
002250     MOVE RPXXX08-EXTERNALID TO SR-OPDTRANCODE.                   00225000
002260     MOVE RPXXX08-APPL TO SR-OPDAPPL.                             00226000
002270     MOVE RPXXX08-SECALT TO SR-OPDSECALT.                         00227000
002280     MOVE RPXXX08-FUNC TO SR-OPDFUNC.                             00228000
002290     PERFORM OPERATOR-DIALOG-SECURITY.                            00229000
002300     MOVE SR-OPDUPDATE TO RPXXX08-UPDATE.                         00230000
002310     IF SR-OPDMSGNBR IS NOT EQUAL TO ZEROS                        00231000
002320         MOVE SR-OPDMSGNBR TO RPXXX08-MSGNBR                      00232000
002330         GO TO VK-RETURN.                                         00233000
002340 VK-IDX.                                                          00234000
002350     INITIALIZE RPIDX-RECORD.                                     00235000
002360     IF RPXXX08-SK1-INST-DCHG IS NOT EQUAL TO 'Y'                 00236000
002370         AND RPXXX08-SK1-IDNUMBER-DCHG IS NOT EQUAL TO 'Y'        00237000
002380         GO TO VK-MST.                                            00238000
002390     IF RPXXX08-SK1-INST-DCHG IS NOT EQUAL TO 'Y'                 00239000
002400         MOVE 'Y' TO WS-ERROR                                     00240000
002410         MOVE 'E' TO RPXXX08-SK1-INST-DCHG.                       00241000
002420     IF RPXXX08-SK1-INST IS EQUAL TO LOW-VALUES                   00242000
002430         OR RPXXX08-SK1-INST IS NOT NUMERIC                       00243000
002440         MOVE 'Y' TO WS-ERROR                                     00244000
002450         MOVE 'E' TO RPXXX08-SK1-INST-DCHG.                       00245000
002460     IF RPXXX08-SK1-IDNUMBER-DCHG IS NOT EQUAL TO 'Y'             00246000
002470         MOVE 'Y' TO WS-ERROR                                     00247000
002480         MOVE 'E' TO RPXXX08-SK1-IDNUMBER-DCHG.                   00248000
002490     IF RPXXX08-SK1-IDNUMBER IS NOT GREATER THAN ZEROS            00249000
002500         OR RPXXX08-SK1-IDNUMBER IS NOT NUMERIC                   00250000
002510         MOVE 'Y' TO WS-ERROR                                     00251000
002520         MOVE 'E' TO RPXXX08-SK1-IDNUMBER-DCHG.                   00252000
002530     IF WS-ERROR IS EQUAL TO 'Y'                                  00253000
002540         GO TO VK-RETURN.                                         00254000
002550     PERFORM LOCATE-IDNUMBER-BY-APPL.                             00255000
002560     IF WS-FUNCTION IS EQUAL TO 'N'                               00256000
002570         MOVE 'E' TO RPXXX08-SK1-INST-DCHG                        00257000
002580         MOVE 'E' TO RPXXX08-SK1-IDNUMBER-DCHG                    00258000
002590         MOVE 500004 TO RPXXX08-MSGNBR                            00259000
002600         GO TO VK-RETURN.                                         00260000
002610     GO TO VK-READ-MST.                                           00261000
002620 VK-MST.                                                          00262000
002630     IF RPXXX08-SK2-INST-DCHG IS NOT EQUAL TO 'Y'                 00263000
002640         AND RPXXX08-SK2-PRODCODE-DCHG IS NOT EQUAL TO 'Y'        00264000
002650         AND RPXXX08-SK2-ACCOUNT-DCHG IS NOT EQUAL TO 'Y'         00265000
002660         AND RPXXX08-SK2-MODEL-DCHG IS NOT EQUAL TO 'Y'           00266000
002670         MOVE 'E' TO RPXXX08-SK2-INST-DCHG                        00267000
002680         MOVE 'E' TO RPXXX08-SK2-PRODCODE-DCHG                    00268000
002690         MOVE 'E' TO RPXXX08-SK2-ACCOUNT-DCHG                     00269000
002700         MOVE 'E' TO RPXXX08-SK2-MODEL-DCHG                       00270000
002710         GO TO VK-MST.                                            00271000
002720     IF RPXXX08-SK2-INST-DCHG IS NOT EQUAL TO 'Y'                 00272000
002730         MOVE 'Y' TO WS-ERROR                                     00273000
002740         MOVE 'E' TO RPXXX08-SK2-INST-DCHG.                       00274000
002750     IF RPXXX08-SK2-INST IS EQUAL TO LOW-VALUES                   00275000
002760         OR RPXXX08-SK2-INST IS NOT NUMERIC                       00276000
002770         MOVE 'Y' TO WS-ERROR                                     00277000
002780         MOVE 'E' TO RPXXX08-SK2-INST-DCHG.                       00278000
002790     IF RPXXX08-SK2-PRODCODE-DCHG IS NOT EQUAL TO 'Y'             00279000
002800         MOVE 'Y' TO WS-ERROR                                     00280000
002810         MOVE 'E' TO RPXXX08-SK2-PRODCODE-DCHG.                   00281000
002820     IF RPXXX08-SK2-PRODCODE IS NOT GREATER THAN SPACES           00282000
002830         MOVE 'Y' TO WS-ERROR                                     00283000
002840         MOVE 'E' TO RPXXX08-SK2-PRODCODE-DCHG.                   00284000
002850     IF RPXXX08-SK2-ACCOUNT-DCHG IS NOT EQUAL TO 'Y'              00285000
002860         MOVE 'Y' TO WS-ERROR                                     00286000
002870         MOVE 'E' TO RPXXX08-SK2-ACCOUNT-DCHG.                    00287000
002880     IF RPXXX08-SK2-ACCOUNT IS NOT GREATER THAN SPACES            00288000
002890         MOVE 'Y' TO WS-ERROR                                     00289000
002900         MOVE 'E' TO RPXXX08-SK2-ACCOUNT-DCHG.                    00290000
002910     IF (RPXXX08-SK2-MODEL IS GREATER THAN SPACES                 00291000
002920         AND RPXXX08-SK2-MODEL-DCHG IS NOT EQUAL TO 'Y')          00292000
002930         OR (RPXXX08-SK2-MODEL IS NOT GREATER THAN SPACES         00293000
002940         AND RPXXX08-SK2-MODEL-DCHG IS EQUAL TO 'Y')              00294000
002950         MOVE 'Y' TO WS-ERROR                                     00295000
002960         MOVE 'E' TO RPXXX08-SK2-MODEL-DCHG.                      00296000
002970     IF RPXXX08-SK2-MODEL IS EQUAL TO LOW-VALUES                  00297000
002980         MOVE SPACES TO RPXXX08-SK2-MODEL.                        00298000
002990     IF WS-ERROR IS EQUAL TO 'Y'                                  00299000
003000         GO TO VK-RETURN.                                         00300000
003010 VK-READ-MST.                                                     00301000
003020     IF RPXXX08-SK2-MODEL IS EQUAL TO SPACES OR                   00302000
003030         RPXXX08-SK2-MODEL IS EQUAL TO LOW-VALUES                 00303000
003040         PERFORM FIND-DEFAULT-MODEL.                              00304000
003050     IF WS-ERRORMODEL IS EQUAL TO 'Y'                             00305000
003060         GO TO VK-RETURN.                                         00306000
003070     MOVE RPXXX08-SELECT-KEY2 TO RPMST-GRP-KEY.                   00307000
003080     PERFORM RPS-MST-GET-REQUEST.                                 00308000
003090     IF WS-FUNCTION IS EQUAL TO 'N'                               00309000
003100         AND RPXXX08-SK1-INST-DCHG IS EQUAL TO 'Y'                00310000
003110         MOVE 'E' TO RPXXX08-SK1-INST-DCHG                        00311000
003120         MOVE 'E' TO RPXXX08-SK1-IDNUMBER-DCHG                    00312000
003130         MOVE 'E' TO RPXXX08-SK2-ACCOUNT-DCHG                     00313000
003140         MOVE 'E' TO RPXXX08-SK2-MODEL-DCHG                       00314000
003150         MOVE 500004 TO RPXXX08-MSGNBR                            00315000
003160         GO TO VK-RETURN.                                         00316000
003170     IF WS-FUNCTION IS EQUAL TO 'N'                               00317000
003180         MOVE 'E' TO RPXXX08-SK2-INST-DCHG                        00318000
003190         MOVE 'E' TO RPXXX08-SK2-PRODCODE-DCHG                    00319000
003200         MOVE 'E' TO RPXXX08-SK2-ACCOUNT-DCHG                     00320000
003210         MOVE 'E' TO RPXXX08-SK2-MODEL-DCHG                       00321000
003220         MOVE 500004 TO RPXXX08-MSGNBR                            00322000
003230         GO TO VK-RETURN.                                         00323000
003240     IF RPMST-REL-STAT IS EQUAL TO 'E'                            00324000
003250         MOVE 500068 TO RPXXX08-MSGNBR                            00325000
003260         GO TO VK-RETURN.                                         00326000
003270     IF RPMST-QUAL-STAT IS NOT EQUAL TO 'R'                       00327000
003280         MOVE 500067 TO RPXXX08-MSGNBR                            00328000
003290         GO TO VK-RETURN.                                         00329000
003300     IF RPMST-VF-EXP-DATE IS EQUAL TO ZEROS                       00330000
003310         MOVE 500071 TO RPXXX08-MSGNBR                            00331000
003320         GO TO VK-RETURN.                                         00332000
003330     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00333000
003340         MOVE WS-AB6320 TO RPXXX08-ABORT                          00334000
003350         MOVE WS-TR0003 TO RPXXX08-ABTRACE                        00335000
003360         GO TO VK-RETURN.                                         00336000
003370     MOVE RPMST-IDNUMBER TO RPXXX08-IDNUMBER.                     00337000
003380     MOVE RPMST-REL-STAT TO RPXXX08-REL-STAT.                     00338000
003390     MOVE RPMST-OUT-FLAG TO RPXXX08-OUT-FLAG.                     00339000
003400     MOVE RPMST-VF-EXP-DATE TO RPXXX08-VF-EXP-DATE.               00340000
003410     MOVE RPMST-EXTENSIONS TO RPXXX08-EXTENSIONS.                 00341000
003420     MOVE RPMST-RETENTION-DAYS TO RPXXX08-EXTENSION-DAYS.         00342000
003430 VK-7100.                                                         00343000
003440     PERFORM READ-MICM-7100.                                      00344000
003450     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00345000
003460         MOVE 500005 TO RPXXX08-MSGNBR                            00346000
003470         GO TO VK-RETURN.                                         00347000
003480     MOVE MIM-7100MAXRETDAYS TO RPXXX08-MAXRETDAYS.               00348000
003490     MOVE MIM-7100MAXEXTENSIONS TO WS-MAX-EXTENSIONS.             00349000
003500 VK-7101.                                                         00350000
003510     MOVE SPACES TO MI7101-RECORD.                                00351000
003520     MOVE RPMST-INST TO MIM-7101KINST.                            00352000
003530     MOVE +7101 TO MIM-7101KREC.                                  00353000
003540     MOVE RPMST-MODEL TO MIM-7101KMODEL.                          00354000
003550     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        00355000
003560     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00356000
003570     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00357000
003580     MOVE MI7101-RECORD TO MIMST-RECORD.                          00358000
003590     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00359000
003600     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00360000
003610         MOVE 500006 TO RPXXX08-MSGNBR                            00361000
003620         GO TO VK-RETURN.                                         00362000
003630     MOVE MIMST-RECORD TO MI7101-RECORD.                          00363000
003640     IF MIM-7101KINST IS NOT EQUAL TO RPMST-INST                  00364000
003650         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00365000
003660         OR MIM-7101KMODEL IS NOT EQUAL TO RPMST-MODEL            00366000
003670         MOVE 500006 TO RPXXX08-MSGNBR                            00367000
003680         GO TO VK-RETURN.                                         00368000
003690     MOVE MIM-7101DESC TO RPXXX08-MODEL-DESC.                     00369000
003700     IF WS-MAX-EXTENSIONS IS LESS THAN MIM-7101EXTENSIONS         00370000
003710         MOVE WS-MAX-EXTENSIONS TO RPXXX08-MAX-EXTENSIONS         00371000
003720     ELSE                                                         00372000
003730         MOVE MIM-7101EXTENSIONS TO RPXXX08-MAX-EXTENSIONS.       00373000
003740     IF MIM-7101DAYSPEREXT IS GREATER THAN MIM-7100MAXRETDAYS     00374000
003750         MOVE MIM-7100MAXRETDAYS TO MIM-7101DAYSPEREXT.           00375000
003760     MOVE MIM-7101DAYSPEREXT TO RPXXX08-DAYSPEREXT.               00376000
003770 VK-CALC.                                                         00377000
003780     IF MIM-7101EXTENSIONS IS GREATER THAN MIM-7100MAXEXTENSIONS  00378000
003790         MOVE MIM-7100MAXEXTENSIONS TO MIM-7101EXTENSIONS.        00379000
003800     IF RPMST-EXTENSIONS IS NOT LESS THAN MIM-7101EXTENSIONS      00380000
003810         MOVE 'D' TO RPXXX08-EXTENSION-DCHG                       00381000
003820         MOVE 500069 TO RPXXX08-MSGNBR                            00382000
003830         GO TO VK-NAME.                                           00383000
003840     IF RPMST-RETENTION-DAYS                                      00384000
003850         IS NOT LESS THAN MIM-7100MAXRETDAYS                      00385000
003860         MOVE 'D' TO RPXXX08-EXTENSION-DCHG                       00386000
003870         MOVE 500069 TO RPXXX08-MSGNBR.                           00387000
003880     IF RPMST-VF-EXP-DATE IS NOT LESS THAN RPMST-EXPIRATION-DATE  00388000
003890         AND RPMST-EXPIRATION-DATE IS NOT EQUAL TO ZEROS          00389000
003900         MOVE 'D' TO RPXXX08-EXTENSION-DCHG                       00390000
003910         MOVE 500072 TO RPXXX08-MSGNBR.                           00391000
003920 VK-NAME.                                                         00392000
003930     IF RPXXX08-APIFUNC IS NOT EQUAL TO 'VKL'                     00393000
003940         GO TO VK-EXIT.                                           00394000
003950     MOVE 'A' TO RPRF21-FUNC.                                     00395000
003960     MOVE RPMST-INST TO RPRF21-BASE-ACCT-INST.                    00396000
003970     MOVE RPMST-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.            00397000
003980     MOVE RPMST-ACCOUNT TO RPRF21-BASE-ACCT.                      00398000
003990     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          00399000
004000     PERFORM REQUEST-CUSTOMER.                                    00400000
004010     IF RPXXX08-MSGNBR IS EQUAL TO ZEROS                          00401000
004020         MOVE WS-MSGNBR TO RPXXX08-MSGNBR.                        00402000
004030     IF WS-FUNCTION IS EQUAL TO SPACES                            00403000
004040         MOVE RPRF21-BASE-CUST-TYPE TO RPXXX08-CUST-TYPE          00404000
004050         MOVE RPRF21-NAME TO RPXXX08-CUST-NAME                    00405000
004060     ELSE                                                         00406000
004070         MOVE SPACES TO RPXXX08-CUST-TYPE                         00407000
004080         MOVE 'NAME NOT FOUND' TO RPXXX08-CUST-NAME               00408000
004090         MOVE SPACES TO WS-FUNCTION.                              00409000
004100     GO TO VK-EXIT.                                               00410000
004110 VK-RETURN.                                                       00411000
004120     MOVE 'E' TO RPXXX08-RETURN.                                  00412000
004130     GO TO CICS-RETURN.                                           00413000
004140 VK-EXIT.                                                         00414000
004150     EXIT.                                                        00415000
004160******************************************************************00416000
004170 ROUTING-ROUTINE SECTION.                                         00417000
004180 RR-START.                                                        00418000
004190     IF RPXXX08-APIFUNC IS EQUAL TO 'VKL'                         00419000
004200         GO TO RR-RETURN.                                         00420000
004210     MOVE 'N' TO WS-EDITSW.                                       00421000
004220     PERFORM EDIT-MESSAGE.                                        00422000
004230     IF RPXXX08-APIFUNC IS EQUAL TO 'EDT'                         00423000
004240         OR WS-EDITSW IS EQUAL TO 'N'                             00424000
004250         OR RPXXX08-RETURN IS EQUAL TO 'E'                        00425000
004260         OR RPXXX08-EXTENSION-DCHG IS EQUAL TO 'D'                00426000
004270         GO TO RR-RETURN.                                         00427000
004280     PERFORM UPDATE-MASTER.                                       00428000
004290 RR-RETURN.                                                       00429000
004300     GO TO CICS-RETURN.                                           00430000
004310 RR-EXIT.                                                         00431000
004320     EXIT.                                                        00432000
004330******************************************************************00433000
004340 EDIT-MESSAGE SECTION.                                            00434000
004350 EM-START.                                                        00435000
004360     IF RPXXX08-EXTENSION-DCHG IS NOT EQUAL TO 'Y'                00436000
004370         GO TO EM-EXIT.                                           00437000
004380 EM-CONT.                                                         00438000
004390     IF RPXXX08-EXTENSION IS EQUAL TO 'N'                         00439000
004400         OR RPXXX08-EXTENSION IS EQUAL TO SPACES                  00440000
004410         OR RPXXX08-EXTENSION IS EQUAL TO LOW-VALUES              00441000
004420         GO TO EM-EXIT.                                           00442000
004430     IF RPXXX08-EXTENSION IS NOT EQUAL 'Y'                        00443000
004440         MOVE 'E' TO RPXXX08-RETURN                               00444000
004450         MOVE 'E' TO RPXXX08-MSG-IND                              00445000
004460         MOVE 'E' TO RPXXX08-EXTENSION-DCHG                       00446000
004470         MOVE 500070 TO RPXXX08-MSGNBR                            00447000
004480         GO TO EM-EXIT.                                           00448000
004490     MOVE 'Y' TO WS-EDITSW.                                       00449000
004500     MOVE RPMST-VF-EXP-DATE TO SR-CODASYL.                        00450000
004510     MOVE 'D' TO SR-CFREQ.                                        00451000
004520     COMPUTE WS-RETDAYS = MIM-7101DAYSPEREXT +                    00452000
004530                          RPMST-RETENTION-DAYS.                   00453000
004540     MOVE MIM-7101DAYSPEREXT TO SR-CTERM.                         00454000
004550     IF WS-RETDAYS IS GREATER THAN MIM-7100MAXRETDAYS             00455000
004560         MOVE MIM-7100MAXRETDAYS TO WS-RETDAYS                    00456000
004570         SUBTRACT RPMST-RETENTION-DAYS FROM MIM-7100MAXRETDAYS    00457000
004580             GIVING SR-CTERM.                                     00458000
004590     PERFORM NEXT-CODASYL-365.                                    00459000
004600     MOVE SR-CODASYL TO WS-VF-EXP-DATE.                           00460000
004610     IF RPMST-EXPIRATION-DATE IS EQUAL TO ZEROS                   00461000
004620         GO TO EM-EXIT.                                           00462000
004630     IF WS-VF-EXP-DATE                                            00463000
004640         IS NOT GREATER THAN RPMST-EXPIRATION-DATE                00464000
004650         GO TO EM-EXIT.                                           00465000
004660     MOVE RPMST-VF-EXP-DATE TO WS-INT-DATE1.                      00466000
004670     MOVE RPMST-EXPIRATION-DATE TO WS-INT-DATE2.                  00467000
004680     COMPUTE WS-DAYS-BETWEEN =                                    00468000
004690         FUNCTION INTEGER-OF-DATE(WS-INT-DATE2) -                 00469000
004700         FUNCTION INTEGER-OF-DATE(WS-INT-DATE1).                  00470000
004710     COMPUTE WS-RETDAYS = WS-DAYS-BETWEEN +                       00471000
004720                          RPMST-RETENTION-DAYS.                   00472000
004730     MOVE RPMST-EXPIRATION-DATE TO WS-VF-EXP-DATE.                00473000
004740 EM-EXIT.                                                         00474000
004750     EXIT.                                                        00475000
004760******************************************************************00476000
004770 READ-MICM-7100 SECTION.                                          00477000
004780 RM7100-START.                                                    00478000
004790     MOVE SPACES TO WS-FUNCTION.                                  00479000
004800     MOVE SPACES TO MI7100-RECORD.                                00480000
004810     MOVE RPMST-INST TO MIM-7100KINST.                            00481000
004820 RM7100-LOOP.                                                     00482000
004830     MOVE +7100 TO MIM-7100KREC.                                  00483000
004840     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00484000
004850     MOVE MI7100-RECORD TO MIMST-RECORD.                          00485000
004860     PERFORM MIC-MST-GET-REQUEST.                                 00486000
004870     MOVE MIMST-RECORD TO MI7100-RECORD.                          00487000
004880     IF WS-FUNCTION IS EQUAL TO 'N'                               00488000
004890         AND MIM-7100KINST IS GREATER THAN ZEROS                  00489000
004900         GO TO RM7100-ZERO.                                       00490000
004910     GO TO RM7100-EXIT.                                           00491000
004920 RM7100-ZERO.                                                     00492000
004930     MOVE SPACES TO MI7100-RECORD.                                00493000
004940     MOVE ZEROS TO MIM-7100KINST.                                 00494000
004950     GO TO RM7100-LOOP.                                           00495000
004960 RM7100-EXIT.                                                     00496000
004970     EXIT.                                                        00497000
004980******************************************************************00498000
004990 UPDATE-MASTER SECTION.                                           00499000
005000 UMST-START.                                                      00500000
005010     PERFORM RPS-MST-GET-LOCK-REQUEST.                            00501000
005020     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00502000
005030         MOVE WS-AB6320 TO RPXXX08-ABORT                          00503000
005040         MOVE WS-TR0004 TO RPXXX08-ABTRACE                        00504000
005050         GO TO CICS-RETURN.                                       00505000
005060     ADD +1 TO RPMST-EXTENSIONS.                                  00506000
005070     MOVE WS-RETDAYS TO RPMST-RETENTION-DAYS.                     00507000
005080     MOVE WS-VF-EXP-DATE TO RPMST-VF-EXP-DATE.                    00508000
005090     MOVE WS-CURDT-YYYYMMDD TO RPMST-LMNTDT.                      00509000
005100     PERFORM RPS-MST-REPUT-REQUEST.                               00510000
005110     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00511000
005120         MOVE WS-AB6320 TO RPXXX08-ABORT                          00512000
005130         MOVE WS-TR0005 TO RPXXX08-ABTRACE                        00513000
005140         GO TO CICS-RETURN.                                       00514000
005150     MOVE 'Y' TO WS-UPDATESW.                                     00515000
005160 UMST-EXIT.                                                       00516000
005170     EXIT.                                                        00517000
005180******************************************************************00518000
005190 LOCATE-IDNUMBER-BY-APPL SECTION.                                 00519000
005200 LIBA-START.                                                      00520000
005210     MOVE RPXXX08-SK1-INST TO MIM-2023KINST.                      00521000
005220     MOVE 'RP' TO MIM-2023KPRODCODE.                              00522000
005230     MOVE RPXXX08-INST-OPT-1 TO SLW096-BANKS.                     00523000
005240     PERFORM SLP096-GET-2023-RECORD.                              00524000
005250     IF SLW096-FUNCTION IS EQUAL TO SPACES                        00525000
005260         GO TO LIBA-READ-IDX.                                     00526000
005270     MOVE ZERO TO WS-SUB1.                                        00527000
005280 LIBA-FIND-ACT-LOOP.                                              00528000
005290     ADD +1 TO WS-SUB1.                                           00529000
005300     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00530000
005310         MOVE 'N' TO WS-FUNCTION                                  00531000
005320         GO TO LIBA-EXIT.                                         00532000
005330     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00533000
005340         IS NOT EQUAL TO RPXXX08-APPL                             00534000
005350         GO TO LIBA-FIND-ACT-LOOP.                                00535000
005360     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO MIM-2023KPRODCODE.    00536000
005370 LIBA-READ-IDX.                                                   00537000
005380     MOVE RPXXX08-SK1-INST TO RPIDX-INST.                         00538000
005390     MOVE MIM-2023KPRODCODE TO RPIDX-PRODCODE.                    00539000
005400     MOVE RPXXX08-SK1-IDNUMBER TO RPIDX-IDNUMBER.                 00540000
005410     PERFORM RPS-IDX-GET-REQUEST.                                 00541000
005420     IF WS-FUNCTION IS EQUAL TO 'N'                               00542000
005430         GO TO LIBA-FIND-ACT-LOOP.                                00543000
005440     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00544000
005450         MOVE WS-AB6310 TO RPXXX08-ABORT                          00545000
005460         MOVE WS-TR0006 TO RPXXX08-ABTRACE                        00546000
005470         GO TO CICS-ABORT-EXIT.                                   00547000
005480     MOVE RPIDX-ACCT2-KEY TO RPXXX08-SELECT-KEY2.                 00548000
005490 LIBA-EXIT.                                                       00549000
005500     EXIT.                                                        00550000
005510******************************************************************00551000
005520 REQUEST-CUSTOMER SECTION.                                        00552000
005530 RC-START.                                                        00553000
005540     MOVE SPACES TO RPRF21-FUNCTION.                              00554000
005550     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             00555000
005560     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         00556000
005570     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          00557000
005580     EXEC CICS LINK                                               00558000
005590         PROGRAM('RPO0RF21')                                      00559000
005600         COMMAREA(RPRF21-MESSAGE)                                 00560000
005610         LENGTH(LENGTH OF RPRF21-MESSAGE)                         00561000
005620         RESP(WS-CICS-RESPONSE)                                   00562000
005630         END-EXEC.                                                00563000
005640     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         00564000
005650     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00565000
005660         MOVE 'L' TO WS-FUNCTION                                  00566000
005670         MOVE 500036 TO WS-MSGNBR                                 00567000
005680         GO TO RC-EXIT.                                           00568000
005690     IF WS-FUNCTION IS EQUAL TO 'B'                               00569000
005700         MOVE 500045 TO WS-MSGNBR                                 00570000
005710         GO TO RC-EXIT.                                           00571000
005720     IF WS-FUNCTION IS EQUAL TO 'C'                               00572000
005730         MOVE 500037 TO WS-MSGNBR                                 00573000
005740         GO TO RC-EXIT.                                           00574000
005750     IF WS-FUNCTION IS EQUAL TO 'I'                               00575000
005760         MOVE 500038 TO WS-MSGNBR.                                00576000
005770 RC-EXIT.                                                         00577000
005780     EXIT.                                                        00578000
005790******************************************************************00579000
005800 FIND-DEFAULT-MODEL SECTION.                                      00580000
005810 FDM-START.                                                       00581000
005820     MOVE 'N' TO WS-ERRORMODEL.                                   00582000
005830     MOVE RPXXX08-SK2-INST TO RPMST-INST.                         00583000
005840     MOVE RPXXX08-SK2-PRODCODE TO RPMST-PRODCODE.                 00584000
005850     MOVE RPXXX08-SK2-ACCOUNT TO RPMST-ACCOUNT.                   00585000
005860     IF RPXXX08-SK2-MODEL IS EQUAL TO LOW-VALUE                   00586000
005870         MOVE SPACES TO RPXXX08-SK2-MODEL.                        00587000
005880     MOVE RPXXX08-SK2-MODEL TO RPMST-MODEL.                       00588000
005890     PERFORM RPS-MST-GET-GE-REQUEST.                              00589000
005900     IF WS-FUNCTION IS EQUAL TO 'N'                               00590000
005910         OR WS-FUNCTION IS EQUAL TO 'E'                           00591000
005920         GO TO FDM-RECORD-NOT-FOUND.                              00592000
005930     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00593000
005940         MOVE WS-AB6320 TO RPXXX08-ABORT                          00594000
005950         MOVE WS-TR0007 TO RPXXX08-ABTRACE                        00595000
005960         MOVE 'Y' TO WS-ERRORMODEL                                00596000
005970         GO TO FDM-EXIT.                                          00597000
005980     IF RPMST-INST IS EQUAL TO RPXXX08-SK2-INST                   00598000
005990         AND RPMST-PRODCODE IS EQUAL TO RPXXX08-SK2-PRODCODE      00599000
006000         AND RPMST-ACCOUNT IS EQUAL TO RPXXX08-SK2-ACCOUNT        00600000
006010         GO TO FDM-GET-NEXT-MST.                                  00601000
006020     GO TO FDM-RECORD-NOT-FOUND.                                  00602000
006030 FDM-GET-NEXT-MST.                                                00603000
006040     MOVE RPMST-MODEL TO RPXXX08-SK2-MODEL.                       00604000
006050     MOVE RPXXX08-SK2-INST TO WS-SAVEMSTINST.                     00605000
006060     MOVE RPXXX08-SK2-PRODCODE TO WS-SAVEMSTPRODCODE.             00606000
006070     MOVE RPXXX08-SK2-ACCOUNT TO WS-SAVEMSTACCOUNT.               00607000
006080     MOVE RPXXX08-SK2-MODEL TO WS-SAVEMSTMODEL.                   00608000
006090     PERFORM RPS-MST-GET-NEXT-REQUEST.                            00609000
006100     IF WS-FUNCTION IS EQUAL TO 'E'                               00610000
006110         GO TO FDM-GOOD-RECORD.                                   00611000
006120     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00612000
006130         MOVE WS-AB6320 TO RPXXX08-ABORT                          00613000
006140         MOVE WS-TR0008 TO RPXXX08-ABTRACE                        00614000
006150         MOVE 'Y' TO WS-ERRORMODEL                                00615000
006160         GO TO FDM-EXIT.                                          00616000
006170     IF RPMST-INST IS EQUAL TO RPXXX08-SK2-INST                   00617000
006180         AND RPMST-PRODCODE IS EQUAL TO RPXXX08-SK2-PRODCODE      00618000
006190         AND RPMST-ACCOUNT IS EQUAL TO RPXXX08-SK2-ACCOUNT        00619000
006200         GO TO FDM-MULTIPLE-PRIM.                                 00620000
006210 FDM-GOOD-RECORD.                                                 00621000
006220     MOVE WS-SAVEMSTINST TO RPXXX08-SK2-INST.                     00622000
006230     MOVE WS-SAVEMSTPRODCODE TO RPXXX08-SK2-PRODCODE.             00623000
006240     MOVE WS-SAVEMSTACCOUNT TO RPXXX08-SK2-ACCOUNT.               00624000
006250     MOVE WS-SAVEMSTMODEL TO RPXXX08-SK2-MODEL.                   00625000
006260     GO TO FDM-EXIT.                                              00626000
006270 FDM-RECORD-NOT-FOUND.                                            00627000
006280     MOVE 'Y' TO WS-ERRORMODEL.                                   00628000
006290     MOVE 500004 TO RPXXX08-MSGNBR.                               00629000
006300     GO TO FDM-EXIT.                                              00630000
006310 FDM-MULTIPLE-PRIM.                                               00631000
006320     MOVE 'Y' TO WS-ERRORMODEL.                                   00632000
006330     MOVE 500090 TO RPXXX08-MSGNBR.                               00633000
006340 FDM-EXIT.                                                        00634000
006350     EXIT.                                                        00635000
006360******************************************************************00636000
000000 COPY RPPIDXA.                                                    00637000
006380******************************************************************00638000
000000 COPY RPPMSTA.                                                    00639000
006400******************************************************************00640000
006410 MIC-MST-API SECTION.                                             00641000
000000 COPY MIPMSTA.                                                    00642000
006430******************************************************************00643000
006440 SLP096-GET-2023-RECORD SECTION.                                  00644000
000000 COPY SLP096.                                                     00645000
006460******************************************************************00646000
006470 JULIAN-365 SECTION.                                              00647000
000000 COPY SRP001.                                                     00648000
006490******************************************************************00649000
006500 CALENDAR-365 SECTION.                                            00650000
000000 COPY SRP003.                                                     00651000
006520******************************************************************00652000
006530 OPERATOR-DIALOG-SECURITY SECTION.                                00653000
000000 COPY SRP079.                                                     00654000
006550******************************************************************00655000
006560 NEXT-CODASYL-365 SECTION.                                        00656000
000000 COPY SRP088.                                                     00657000
006580******************************************************************00658000
006590 CICS-ABORT-EXIT SECTION.                                         00659000
006600 CAE-START.                                                       00660000
006610     GO TO CICS-RETURN.                                           00661000
006620 CAE-EXIT.                                                        00662000
006630     EXIT.                                                        00663000
006640******************************************************************00664000
006650 CICS-RETURN SECTION.                                             00665000
006660     IF COM-ABORT IS NOT EQUAL TO ZERO                            00666000
006670         MOVE COM-ABORT TO RPXXX08-ABORT.                         00667000
006680     IF RPXXX08-ABORT IS NOT EQUAL TO ZERO                        00668000
006690         AND WS-UPDATESW IS EQUAL TO 'Y'                          00669000
006700         MOVE 'Y' TO RPXXX08-ABTYPE.                              00670000
006710     IF RPXXX08-ABORT IS NOT EQUAL TO ZERO                        00671000
006720         MOVE WS-FUNCTION TO RPXXX08-FUNCTION                     00672000
006730         MOVE SRB-BMDB TO RPXXX08-SRBMDB                          00673000
006740         MOVE EIBFN TO RPXXX08-ABEIBFN                            00674000
006750         MOVE EIBRESP TO RPXXX08-ABEIBRESP                        00675000
006760         MOVE EIBRESP2 TO RPXXX08-ABEIBRESP2                      00676000
006770         MOVE EIBRCODE TO RPXXX08-ABEIBRCODE.                     00677000
006780     IF RPXXX08-ABTYPE IS NOT EQUAL TO 'Y'                        00678000
006790         PERFORM GLOBAL-CLOSE.                                    00679000
000000 COPY SLP709.                                                     00680000
006810******************************************************************00681000
006820 GLOBAL-CLOSE SECTION.                                            00682000
006830 GC-START.                                                        00683000
006840     IF RPXXX08-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  00684000
006850         PERFORM RPS-MST-GLOBAL-CLOSE-REQUEST.                    00685000
006860 GC-EXIT.                                                         00686000
006870     EXIT.                                                        00687000
006880******************************************************************00688000
