000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX13.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX13 - EXPIRATION DATE MODULE                           *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW000-AREAS.                                                00016000
000000 COPY SRW000.                                                     00017000
000180 01  SRW009-AREAS.                                                00018000
000000 COPY SRW009.                                                     00019000
000200 01  SRW022-AREAS.                                                00020000
000000 COPY SRW022.                                                     00021000
000220 01  SRW079-AREAS.                                                00022000
000000 COPY SRW079.                                                     00023000
000240 01  SRW105-AREAS.                                                00024000
000000 COPY SRW105.                                                     00025000
000260*01  BICRSRB.                                                     00026000
000000 COPY BICRSRB.                                                    00027000
000280*01  BICRPSB.                                                     00028000
000000 COPY BICRPSB.                                                    00029000
000300*01  BICRVERB.                                                    00030000
000000 COPY BICRVERB.                                                   00031000
000320*01  BICRSTAT.                                                    00032000
000000 COPY BICRSTAT.                                                   00033000
000340*01  BICRDBS.                                                     00034000
000000 COPY BICRDBS.                                                    00035000
000360*01  BICRLOG.                                                     00036000
000000 COPY BICRLOG.                                                    00037000
000380 01  SRW710-AREAS.                                                00038000
000000 COPY SRW710.                                                     00039000
000400 01  WS-WORKAREAS.                                                00040000
000410     03  COM-ABORT               PIC S9(04)      COMP.            00041000
000420     03  WS-SUB1                 PIC S9(04)      COMP             00042000
000430                                                 VALUE +0000.     00043000
000440     03  WS-SUB2                 PIC S9(04)      COMP             00044000
000450                                                 VALUE +0000.     00045000
000460     03  WS-UPDATESW             PIC X(01)       VALUE SPACES.    00046000
000470     03  WS-INTERFACE            PIC X(01)       VALUE SPACES.    00047000
000480     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00048000
000490                                                 VALUE ZERO.      00049000
000500     03  WS-SAVE-ACCT-TYPE       PIC 9(03)       VALUE ZERO.      00050000
000510     03  WS-SAVE-PRODCODE        PIC X(06)       VALUE SPACES.    00051000
000520     03  WS-7102-FLAG            PIC X(01)       VALUE SPACES.    00052000
000530     03  WS-7107-FLAG            PIC X(01)       VALUE SPACES.    00053000
000540     03  WS-ACT-FLAG             PIC X(01)       VALUE SPACES.    00054000
000550     03  WS-QUA-FLAG             PIC X(01)       VALUE SPACES.    00055000
000560     03  WS-BALCATCD1-FAIL       PIC X(01)       VALUE SPACES.    00056000
000570     03  WS-WORK-CATCD           PIC X(06)       VALUE SPACES.    00057000
000580     03  WS-WORK-BALCD           PIC 9(02)       VALUE ZEROS.     00058000
000590     03  WS-WORK-BALANCE         PIC S9(13)V99   COMP-3           00059000
000600                                                 VALUE ZEROS.     00060000
000610     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00061000
000620     03  FILLER          REDEFINES WS-PDATE.                      00062000
000630         05  WS-PDATE-YYYY       PIC 9(04).                       00063000
000640         05  WS-PDATE-MM         PIC 9(02).                       00064000
000650         05  WS-PDATE-DD         PIC 9(02).                       00065000
000660     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00066000
000670     03  FILLER          REDEFINES WS-CURDATE.                    00067000
000680         05  WS-CURMM            PIC 9(02).                       00068000
000690         05  WS-CURDD            PIC 9(02).                       00069000
000700         05  WS-CURYYYY          PIC 9(04).                       00070000
000710     03  WS-CURDTYYYYMMDD        PIC 9(08)       VALUE ZEROS.     00071000
000720     03  FILLER          REDEFINES WS-CURDTYYYYMMDD.              00072000
000730         05  WS-CURDTYYYY        PIC 9(04).                       00073000
000740         05  WS-CURDTMMDD        PIC 9(04).                       00074000
000750         05  FILLER      REDEFINES WS-CURDTMMDD.                  00075000
000760             07  WS-CURDTMM      PIC 9(02).                       00076000
000770             07  WS-CURDTDD      PIC 9(02).                       00077000
000780     03  WS-DATEMMDDYYYY         PIC 9(08)       VALUE ZEROS.     00078000
000790     03  FILLER          REDEFINES WS-DATEMMDDYYYY.               00079000
000800         05  WS-DATEMM           PIC 9(02).                       00080000
000810         05  WS-DATEDD           PIC 9(02).                       00081000
000820         05  WS-DATEYYYY         PIC 9(04).                       00082000
000830     03  WS-DATEFORMAT           PIC X(10)       VALUE SPACE.     00083000
000840     03  WS-CURDT-YYYYMMDD       PIC 9(08)       VALUE ZERO.      00084000
000850     03  WS-NEW-EXPIREDATE       PIC S9(09)      VALUE ZERO.      00085000
000860     03  WS-NEW-EXPIRE9          PIC 9(08).                       00086000
000870     03  WS-FILLER       REDEFINES WS-NEW-EXPIRE9.                00087000
000880         05  WS-WYEAR9           PIC 9999.                        00088000
000890         05  WS-WMONTH9          PIC 99.                          00089000
000900         05  WS-WDAY9            PIC 99.                          00090000
000910     03  WS-MODELEXPIRE          PIC 9(08)       VALUE ZERO.      00091000
000920     03  WS-EXPIRATION-DATE      PIC S9(09)      COMP-3.          00092000
000930     03  WS-WORKDATE             PIC X(10).                       00093000
000940     03  WS-WORKDATEX    REDEFINES WS-WORKDATE.                   00094000
000950         05  WS-WMONTH           PIC X(02).                       00095000
000960         05  WS-FILLER           PIC X(01).                       00096000
000970         05  WS-WDAY             PIC X(02).                       00097000
000980         05  WS-FILLER           PIC X(01).                       00098000
000990         05  WS-WYEAR            PIC X(04).                       00099000
001000     03  WS-SAVEMASTERGROUP.                                      00100000
001010         05  WS-SAVEMSTINST      PIC 9(04).                       00101000
001020         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00102000
001030         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00103000
001040         05  WS-SAVEMSTMODEL     PIC X(10).                       00104000
001050                                                                  00105000
001060*----------------------------------------------------------------*00106000
001070 01  MIWPRI-AREAS.                                                00107000
000000 COPY MIWPRI.                                                     00108000
001090 01  MIWMSTA-AREAS.                                               00109000
000000 COPY MIWMSTA.                                                    00110000
001110 01  MIMST-RECORD.                                                00111000
000000 COPY MISMST.                                                     00112000
001130 01  MI0237-RECORD.                                               00113000
000000 COPY MIS0237A.                                                   00114000
001150 01  MI2023-RECORD.                                               00115000
000000 COPY MIS2023A.                                                   00116000
001170 01  MI2024-RECORD.                                               00117000
000000 COPY MIS2024A.                                                   00118000
001190 01  MI7100-RECORD.                                               00119000
000000 COPY MIS7100.                                                    00120000
001210 01  MI7101-RECORD.                                               00121000
000000 COPY MIS7101.                                                    00122000
001230 01  MI7102-RECORD.                                               00123000
000000 COPY MIS7102.                                                    00124000
001250 01  MI7106-RECORD.                                               00125000
000000 COPY MIS7106.                                                    00126000
001270 01  MI7107-RECORD.                                               00127000
000000 COPY MIS7107.                                                    00128000
001290*----------------------------------------------------------------*00129000
001300 01  RPWPRI-AREAS.                                                00130000
000000 COPY RPWPRI.                                                     00131000
001320 01  RPWMST-AREA.                                                 00132000
000000 COPY RPWMSTA.                                                    00133000
001340 01  RPMST-RECORD.                                                00134000
000000 COPY RPSMST.                                                     00135000
001360 01  RPWIDX-AREA.                                                 00136000
000000 COPY RPWIDXA.                                                    00137000
001380 01  RPIDX-RECORD.                                                00138000
000000 COPY RPSIDX.                                                     00139000
001400*----------------------------------------------------------------*00140000
001410 01  RPRF21-MESSAGE.                                              00141000
000000 COPY MISCNT00      REPLACING                                     00142000
001430             ==:MICNT:== BY ==RPRF21==.                           00143000
000000 COPY RPSRF21.                                                    00144000
001450*----------------------------------------------------------------*00145000
001460 01  RPINF00-MESSAGE.                                             00146000
000000 COPY MISCNT00      REPLACING                                     00147000
001480             ==:MICNT:== BY ==RPINF00==.                          00148000
000000 COPY RPSINF00.                                                   00149000
001500*----------------------------------------------------------------*00150000
001510 01  RPUSER-MESSAGE.                                              00151000
000000 COPY MISCNT00      REPLACING                                     00152000
001530     ==:MICNT:== BY ==RPUSER==.                                   00153000
000000 COPY RPWUSER.                                                    00154000
001550***************************************************************** 00155000
001560 01  WS-TRACECODES.                                               00156000
001570     03  WS-TR0001               PIC S9(04)      COMP             00157000
001580                                                 VALUE +0001.     00158000
001590     03  WS-TR0002               PIC S9(04)      COMP             00159000
001600                                                 VALUE +0002.     00160000
001610     03  WS-TR0003               PIC S9(04)      COMP             00161000
001620                                                 VALUE +0003.     00162000
001630     03  WS-TR0004               PIC S9(04)      COMP             00163000
001640                                                 VALUE +0004.     00164000
001650     03  WS-TR0005               PIC S9(04)      COMP             00165000
001660                                                 VALUE +0005.     00166000
001670     03  WS-TR0006               PIC S9(04)      COMP             00167000
001680                                                 VALUE +0006.     00168000
001690     03  WS-TR0007               PIC S9(04)      COMP             00169000
001700                                                 VALUE +0007.     00170000
001710     03  WS-TR0008               PIC S9(04)      COMP             00171000
001720                                                 VALUE +0008.     00172000
001730 01  WS-ABORTCODES.                                               00173000
001740     03  WS-AB2000               PIC S9(04)      COMP             00174000
001750                                                 VALUE +2000.     00175000
001760     03  WS-AB2033               PIC S9(04)      COMP             00176000
001770                                                 VALUE +2033.     00177000
001780     03  WS-AB6310               PIC S9(04)      COMP             00178000
001790                                                 VALUE +6310.     00179000
001800     03  WS-AB6320               PIC S9(04)      COMP             00180000
001810                                                 VALUE +6320.     00181000
001820******************************************************************00182000
001830 01  SLW096-AREAS.                                                00183000
000000 COPY SLW096.                                                     00184000
001850 01  SLS140-RECORD.                                               00185000
000000 COPY SLS140.                                                     00186000
001870******************************************************************00187000
001880 LINKAGE SECTION.                                                 00188000
001890 01  DFHCOMMAREA.                                                 00189000
000000 COPY MISCNT00      REPLACING                                     00190000
001910             ==:MICNT:== BY ==RPXXX13==.                          00191000
000000 COPY RPSXXX13.                                                   00192000
001930*01  SLW096-2023RECORDS.                                          00193000
000000 COPY SLW096L.                                                    00194000
001950******************************************************************00195000
001960 PROCEDURE DIVISION.                                              00196000
001970******************************************************************00197000
001980 ENTRY-ROUTINE SECTION.                                           00198000
001990 ER-START.                                                        00199000
002000     MOVE 'RPLXXX13' TO SR-APIPROGLIT.                            00200000
002010     MOVE 'RPLXXX13' TO RPXXX13-ABPROGID.                         00201000
002020     PERFORM CICS-HANDLE-CONDITION.                               00202000
002030     IF EIBCALEN IS EQUAL TO +0                                   00203000
002040         MOVE WS-AB2000 TO RPXXX13-ABORT                          00204000
002050         MOVE WS-TR0001 TO RPXXX13-ABTRACE                        00205000
002060         GO TO CICS-RETURN.                                       00206000
002070     MOVE ZERO TO RPXXX13-MSGNBR.                                 00207000
002080     MOVE SPACE TO WS-FUNCTION.                                   00208000
002090     MOVE RPXXX13-FILEOPTS TO WS-FILEOPTS.                        00209000
002100     MOVE RPXXX13-OPERID TO WS-UPD-USER.                          00210000
002110     MOVE RPXXX13-EXTERNALID TO LOG-PANELID.                      00211000
002120     MOVE RPXXX13-TERMID TO LOG-TERMID.                           00212000
002130     MOVE RPXXX13-WORKID TO LOG-WORKID.                           00213000
002140     MOVE RPXXX13-TRANSTART TO LOG-TRANSTART.                     00214000
002150     MOVE RPXXX13-APPLSEQ TO LOG-APPLSEQ.                         00215000
002160     INITIALIZE RPRF21-MESSAGE.                                   00216000
000000 COPY SLP094.                                                     00217000
002180     GO TO VERIFY-KEY.                                            00218000
002190 ER-EXIT.                                                         00219000
002200     EXIT.                                                        00220000
002210******************************************************************00221000
002220 CICS-HANDLE-CONDITION SECTION.                                   00222000
000000 COPY SLP702.                                                     00223000
002240     MOVE WS-AB2033 TO RPXXX13-ABORT.                             00224000
002250     MOVE WS-TR0002 TO RPXXX13-ABTRACE.                           00225000
002260     GO TO CICS-RETURN.                                           00226000
002270 CHC-EXIT.                                                        00227000
002280     EXIT.                                                        00228000
002290******************************************************************00229000
002300 VERIFY-KEY SECTION.                                              00230000
002310 VK-START.                                                        00231000
002320     MOVE ZERO TO COM-ABORT.                                      00232000
002330     MOVE ZERO TO RPXXX13-ABORT.                                  00233000
002340     MOVE ZERO TO RPXXX13-MSGNBR.                                 00234000
002350     MOVE ZERO TO WS-MSGNBR.                                      00235000
002360     MOVE SPACES TO RPXXX13-FUNCTION.                             00236000
002370     MOVE RPXXX13-DATE TO WS-CURDATE.                             00237000
002380     MOVE WS-CURMM TO WS-CURDTMM.                                 00238000
002390     MOVE WS-CURDD TO WS-CURDTDD.                                 00239000
002400     MOVE WS-CURYYYY TO WS-CURDTYYYY.                             00240000
002410     MOVE WS-CURDTYYYYMMDD TO WS-CURDT-YYYYMMDD.                  00241000
002420     MOVE 'N' TO WS-QUA-FLAG.                                     00242000
002430 VK-SECURITY.                                                     00243000
002440     IF RPXXX13-APIFUNC IS NOT EQUAL TO 'VKL'                     00244000
002450         GO TO VK-MST.                                            00245000
002460     MOVE RPXXX13-UPDATE TO SR-OPDUPDATE.                         00246000
002470     MOVE RPXXX13-KEY-INST TO SR-OPDINST.                         00247000
002480     MOVE RPXXX13-OPERID TO SR-OPDOPERID.                         00248000
002490     MOVE RPXXX13-MODELID TO SR-OPDMODELID.                       00249000
002500     MOVE RPXXX13-EXTERNALID TO SR-OPDTRANCODE.                   00250000
002510     MOVE RPXXX13-APPL TO SR-OPDAPPL.                             00251000
002520     MOVE RPXXX13-SECALT TO SR-OPDSECALT.                         00252000
002530     MOVE RPXXX13-FUNC TO SR-OPDFUNC.                             00253000
002540     PERFORM OPERATOR-DIALOG-SECURITY.                            00254000
002550     MOVE SR-OPDUPDATE TO RPXXX13-UPDATE.                         00255000
002560     IF SR-OPDMSGNBR IS NOT EQUAL TO ZEROS                        00256000
002570         MOVE SR-OPDMSGNBR TO RPXXX13-MSGNBR                      00257000
002580         GO TO VK-RETURN.                                         00258000
002590 VK-IDX.                                                          00259000
002600     INITIALIZE RPIDX-RECORD.                                     00260000
002610     IF RPXXX13-KEY-IDNUMBER-DCHG IS NOT EQUAL TO 'Y'             00261000
002620         GO TO VK-MST.                                            00262000
002630     IF RPXXX13-KEY-IDNUMBER IS NOT GREATER THAN ZEROS            00263000
002640         OR RPXXX13-KEY-IDNUMBER IS NOT NUMERIC                   00264000
002650         GO TO VK-MST.                                            00265000
002660     PERFORM LOCATE-IDNUMBER-BY-APPL.                             00266000
002670     IF WS-FUNCTION IS EQUAL TO 'N'                               00267000
002680         MOVE 500004 TO RPXXX13-MSGNBR                            00268000
002690         GO TO VK-RETURN.                                         00269000
002700     MOVE ZEROS TO RPXXX13-KEY-IDNUMBER.                          00270000
002710 VK-MST.                                                          00271000
002720     IF RPXXX13-KEY-MODEL IS EQUAL TO SPACES OR                   00272000
002730         RPXXX13-KEY-MODEL IS EQUAL TO LOW-VALUES                 00273000
002740         PERFORM FIND-DEFAULT-MODEL.                              00274000
002750     IF WS-ERROR IS EQUAL TO 'Y'                                  00275000
002760         GO TO VK-RETURN.                                         00276000
002770     MOVE RPXXX13-KEY-INST TO RPMST-INST.                         00277000
002780     MOVE RPXXX13-KEY-PRODCODE TO RPMST-PRODCODE.                 00278000
002790     MOVE RPXXX13-KEY-ACCOUNT TO RPMST-ACCOUNT.                   00279000
002800     MOVE RPXXX13-KEY-MODEL TO RPMST-MODEL.                       00280000
002810     PERFORM RPS-MST-GET-REQUEST.                                 00281000
002820     IF WS-FUNCTION IS EQUAL TO 'N'                               00282000
002830         MOVE 500004 TO RPXXX13-MSGNBR                            00283000
002840         GO TO VK-RETURN.                                         00284000
002850     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00285000
002860         MOVE WS-AB6320 TO RPXXX13-ABORT                          00286000
002870         MOVE WS-TR0003 TO RPXXX13-ABTRACE                        00287000
002880         GO TO VK-RETURN.                                         00288000
002890     IF RPMST-REL-STAT IS EQUAL TO 'E'                            00289000
002900         MOVE 500068 TO RPXXX13-MSGNBR                            00290000
002910         GO TO VK-RETURN.                                         00291000
002920     MOVE RPMST-MODEL TO RPXXX13-MODEL.                           00292000
002930     MOVE RPMST-PRODCODE TO RPXXX13-PRODCODE.                     00293000
002940     MOVE RPMST-INST TO RPXXX13-INST.                             00294000
002950     MOVE RPMST-ACCOUNT TO RPXXX13-ACCOUNT.                       00295000
002960     MOVE RPMST-IDNUMBER TO RPXXX13-IDNUMBER.                     00296000
002970     MOVE RPMST-EXPIRATION-DATE TO WS-NEW-EXPIREDATE.             00297000
002980     MOVE WS-NEW-EXPIREDATE TO WS-NEW-EXPIRE9.                    00298000
002990     MOVE WS-WYEAR9 TO WS-WYEAR.                                  00299000
003000     MOVE WS-WMONTH9 TO WS-WMONTH.                                00300000
003010     MOVE WS-WDAY9 TO WS-WDAY.                                    00301000
003020     GO TO VK-7100.                                               00302000
003030 VK-7100.                                                         00303000
003040     PERFORM READ-MICM-7100.                                      00304000
003050     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00305000
003060         MOVE 500005 TO RPXXX13-MSGNBR                            00306000
003070         GO TO VK-RETURN.                                         00307000
003080 VK-7101.                                                         00308000
003090     MOVE SPACES TO MI7101-RECORD.                                00309000
003100     MOVE RPXXX13-KEY-INST TO MIM-7101KINST.                      00310000
003110     MOVE +7101 TO MIM-7101KREC.                                  00311000
003120     MOVE RPXXX13-KEY-MODEL TO MIM-7101KMODEL.                    00312000
003130     COMPUTE WS-7101KEFFDT = WS-CURDTYYYYMMDD - 99999999.         00313000
003140     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00314000
003150     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00315000
003160     MOVE MI7101-RECORD TO MIMST-RECORD.                          00316000
003170     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00317000
003180     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00318000
003190         MOVE 500006 TO RPXXX13-MSGNBR                            00319000
003200         GO TO VK-RETURN.                                         00320000
003210     MOVE MIMST-RECORD TO MI7101-RECORD.                          00321000
003220     IF MIM-7101KINST IS NOT EQUAL TO RPXXX13-KEY-INST            00322000
003230         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00323000
003240         OR MIM-7101KMODEL IS NOT EQUAL TO RPXXX13-KEY-MODEL      00324000
003250         MOVE 500006 TO RPXXX13-MSGNBR                            00325000
003260         GO TO VK-RETURN.                                         00326000
003270     MOVE MIM-7101DESC TO RPXXX13-MODEL-DESC.                     00327000
003280     MOVE ZEROS TO WS-MODELEXPIRE.                                00328000
003290     MOVE ZEROS TO WS-EXPIRATION-DATE.                            00329000
003300     IF MIM-7101EXPDT IS GREATER THAN ZEROS                       00330000
003310         MOVE MIM-7101EXPDT TO WS-MODELEXPIRE                     00331000
003320         MOVE MIM-7101EXPDT TO WS-EXPIRATION-DATE                 00332000
003330         GO TO VK-MAXDT.                                          00333000
003340     IF MIM-7101CLOSEDT IS EQUAL TO ZEROS                         00334000
003350         OR MIM-7101EXPFREQ IS EQUAL TO 'N'                       00335000
003360         GO TO VK-MAXDT.                                          00336000
003370 VK-CALC-EXPDATE.                                                 00337000
003380     MOVE MIM-7101EXPFREQ TO SR-PERIOD.                           00338000
003390     MOVE MIM-7101EXPTERM TO SR-FREQ.                             00339000
003400     IF MIM-7101EXPFREQ IS EQUAL TO 'M'                           00340000
003410         AND MIM-7101ENDOFMONTH IS EQUAL TO 'Y'                   00341000
003420         MOVE 31 TO SR-DAY                                        00342000
003430     ELSE                                                         00343000
003440         MOVE ZEROS TO SR-DAY.                                    00344000
003450     MOVE MIM-7101CLOSEDT TO WS-CURDTYYYYMMDD.                    00345000
003460     MOVE WS-CURDTYYYY TO SR-FCYR.                                00346000
003470     MOVE WS-CURDTMM TO SR-FCMON.                                 00347000
003480     MOVE WS-CURDTDD TO SR-FCDAY.                                 00348000
003490     PERFORM JULIAN-365.                                          00349000
003500     MOVE SR-TOJUL TO SR-FROMJUL.                                 00350000
003510     PERFORM NEXT-DATE-365.                                       00351000
003520     MOVE SR-TOJUL TO SR-FROMJUL.                                 00352000
003530     PERFORM CALENDAR-365.                                        00353000
003540     MOVE SR-TCMON TO WS-PDATE-MM.                                00354000
003550     MOVE SR-TCDAY TO WS-PDATE-DD.                                00355000
003560     MOVE SR-TCYR TO WS-PDATE-YYYY.                               00356000
003570     MOVE WS-PDATE TO WS-EXPIRATION-DATE.                         00357000
003580     MOVE WS-PDATE TO WS-MODELEXPIRE.                             00358000
003590 VK-MAXDT.                                                        00359000
003600     MOVE WS-EXPIRATION-DATE TO RPXXX13-MAXDT.                    00360000
003610* **                                                              00361000
003620 VK-NAME.                                                         00362000
003630     MOVE 'A' TO RPRF21-FUNC.                                     00363000
003640     MOVE RPXXX13-KEY-INST TO RPRF21-BASE-ACCT-INST.              00364000
003650     MOVE RPXXX13-KEY-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.      00365000
003660     MOVE RPXXX13-KEY-ACCOUNT TO RPRF21-BASE-ACCT.                00366000
003670     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00367000
003680         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00368000
003690         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00369000
003700     PERFORM REQUEST-CUSTOMER.                                    00370000
003710     MOVE WS-MSGNBR TO RPXXX13-MSGNBR.                            00371000
003720     IF WS-FUNCTION IS EQUAL TO 'B'                               00372000
003730         MOVE SPACES TO WS-FUNCTION.                              00373000
003740     IF WS-FUNCTION IS EQUAL TO SPACES                            00374000
003750         MOVE RPRF21-BASE-RCIF-KEY TO RPXXX13-RCIF-KEY            00375000
003760         MOVE RPRF21-NAME TO RPXXX13-CUST-NAME                    00376000
003770         GO TO VK-END.                                            00377000
003780     IF RPXXX13-MSGNBR IS EQUAL TO ZEROS                          00378000
003790         MOVE 500016 TO RPXXX13-MSGNBR.                           00379000
003800     GO TO VK-RETURN.                                             00380000
003810 VK-END.                                                          00381000
003820     IF RPXXX13-APIFUNC IS EQUAL TO 'VKD'                         00382000
003830         MOVE WS-WYEAR9 TO RPXXX13-EXPREYYDT                      00383000
003840         MOVE WS-WMONTH9 TO RPXXX13-EXPREMMDT                     00384000
003850         MOVE WS-WDAY9 TO RPXXX13-EXPREDDDT                       00385000
003860         GO TO CICS-RETURN.                                       00386000
003870     IF RPXXX13-APIFUNC IS EQUAL TO 'VKL'                         00387000
003880         MOVE WS-WYEAR9 TO RPXXX13-EXPREYYDT                      00388000
003890         MOVE WS-WMONTH9 TO RPXXX13-EXPREMMDT                     00389000
003900         MOVE WS-WDAY9 TO RPXXX13-EXPREDDDT                       00390000
003910         GO TO CICS-RETURN.                                       00391000
003920     GO TO VK-EXIT.                                               00392000
003930 VK-RETURN.                                                       00393000
003940     MOVE 'E' TO RPXXX13-RETURN.                                  00394000
003950     GO TO CICS-RETURN.                                           00395000
003960 VK-EXIT.                                                         00396000
003970     EXIT.                                                        00397000
003980******************************************************************00398000
003990 EDIT-DATA SECTION.                                               00399000
004000 ED-START.                                                        00400000
004010     MOVE ZEROS TO RPXXX13-MSGNBR.                                00401000
004020     MOVE +0000 TO RPXXX13-ABORT.                                 00402000
004030     MOVE +0000 TO RPXXX13-ERRCNT.                                00403000
004040 ED-CUSTOMER.                                                     00404000
004050     MOVE RPXXX13-EXPREMMDT TO WS-WMONTH.                         00405000
004060     MOVE RPXXX13-EXPREDDDT TO WS-WDAY.                           00406000
004070     MOVE RPXXX13-EXPREYYDT TO WS-WYEAR.                          00407000
004080     PERFORM VERIFY-DATE.                                         00408000
004090     IF WS-DATEFORMAT IS NOT EQUAL TO 'Y'                         00409000
004100         ADD +1 TO RPXXX13-ERRCNT                                 00410000
004110         MOVE 'Y' TO WS-ERROR                                     00411000
004120         MOVE 500091 TO RPXXX13-MSGNBR                            00412000
004130         GO TO ED-END.                                            00413000
004140     MOVE 'Y' TO WS-UPDTSW.                                       00414000
004150 ED-END.                                                          00415000
004160     IF RPXXX13-UPDATE IS NOT EQUAL TO 'Y'                        00416000
004170         GO TO CICS-RETURN.                                       00417000
004180     IF RPXXX13-APIFUNC IS EQUAL TO 'EDT'                         00418000
004190         OR WS-ERROR IS EQUAL TO 'Y'                              00419000
004200         MOVE 'EDT' TO RPXXX13-APIFUNC                            00420000
004210         GO TO CICS-RETURN.                                       00421000
004220     IF WS-UPDTSW IS NOT EQUAL TO 'Y'                             00422000
004230         GO TO CICS-RETURN.                                       00423000
004240 ED-EXIT.                                                         00424000
004250     EXIT.                                                        00425000
004260******************************************************************00426000
004270 UPDATE-RECORD SECTION.                                           00427000
004280 UR-START.                                                        00428000
004290     MOVE 'Y' TO WS-UPDATESW.                                     00429000
004300 UR-MASTER.                                                       00430000
004310     INITIALIZE RPMST-RECORD.                                     00431000
004320     MOVE RPXXX13-GRP-KEY TO RPMST-GRP-KEY.                       00432000
004330     PERFORM RPS-MST-GET-LOCK-REQUEST.                            00433000
004340     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00434000
004350         MOVE WS-AB6320 TO RPXXX13-ABORT                          00435000
004360         MOVE WS-TR0004 TO RPXXX13-ABTRACE                        00436000
004370         GO TO CICS-RETURN.                                       00437000
004380     MOVE WS-CURDT-YYYYMMDD TO RPMST-LMNTDT.                      00438000
004390     MOVE WS-NEW-EXPIRE9 TO WS-NEW-EXPIREDATE.                    00439000
004400     MOVE WS-NEW-EXPIREDATE TO RPMST-EXPIRATION-DATE.             00440000
004410     PERFORM RPS-MST-REPUT-REQUEST.                               00441000
004420     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00442000
004430         MOVE WS-AB6320 TO RPXXX13-ABORT                          00443000
004440         MOVE WS-TR0005 TO RPXXX13-ABTRACE                        00444000
004450         GO TO CICS-RETURN.                                       00445000
004460     GO TO CICS-RETURN.                                           00446000
004470 UR-EXIT.                                                         00447000
004480     EXIT.                                                        00448000
004490******************************************************************00449000
004500 LOCATE-IDNUMBER-BY-APPL SECTION.                                 00450000
004510 LIBA-START.                                                      00451000
004520     MOVE RPXXX13-KEY-INST TO MIM-2023KINST.                      00452000
004530     MOVE 'RP' TO MIM-2023KPRODCODE.                              00453000
004540     MOVE RPXXX13-INST-OPT-1 TO SLW096-BANKS.                     00454000
004550     PERFORM SLP096-GET-2023-RECORD.                              00455000
004560     IF SLW096-FUNCTION IS EQUAL TO SPACES                        00456000
004570         GO TO LIBA-READ-IDX.                                     00457000
004580     MOVE ZERO TO WS-SUB1.                                        00458000
004590 LIBA-FIND-ACT-LOOP.                                              00459000
004600     ADD +1 TO WS-SUB1.                                           00460000
004610     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00461000
004620         MOVE 'N' TO WS-FUNCTION                                  00462000
004630         GO TO LIBA-EXIT.                                         00463000
004640     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00464000
004650         IS NOT EQUAL TO RPXXX13-APPL                             00465000
004660         GO TO LIBA-FIND-ACT-LOOP.                                00466000
004670     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO MIM-2023KPRODCODE.    00467000
004680 LIBA-READ-IDX.                                                   00468000
004690     MOVE RPXXX13-KEY-INST TO RPIDX-INST.                         00469000
004700     MOVE MIM-2023KPRODCODE TO RPIDX-PRODCODE.                    00470000
004710     MOVE RPXXX13-KEY-IDNUMBER TO RPIDX-IDNUMBER.                 00471000
004720     PERFORM RPS-IDX-GET-REQUEST.                                 00472000
004730     IF WS-FUNCTION IS EQUAL TO 'N'                               00473000
004740         GO TO LIBA-FIND-ACT-LOOP.                                00474000
004750     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00475000
004760         MOVE WS-AB6310 TO RPXXX13-ABORT                          00476000
004770         MOVE WS-TR0006 TO RPXXX13-ABTRACE                        00477000
004780         GO TO CICS-ABORT-EXIT.                                   00478000
004790     MOVE RPIDX-ACCT2-KEY TO RPXXX13-KEY-ACCT-GRP.                00479000
004800 LIBA-EXIT.                                                       00480000
004810     EXIT.                                                        00481000
004820******************************************************************00482000
004830 VERIFY-DATE SECTION.                                             00483000
004840 VD-START.                                                        00484000
004850     MOVE 'Y' TO WS-DATEFORMAT.                                   00485000
004860     IF WS-WMONTH IS NOT NUMERIC                                  00486000
004870         MOVE 'E' TO RPXXX13-EXPREMMDT-DCHG                       00487000
004880         MOVE 'N' TO WS-DATEFORMAT                                00488000
004890         GO TO VD-EXIT.                                           00489000
004900     IF WS-WDAY IS NOT NUMERIC                                    00490000
004910         MOVE 'E' TO RPXXX13-EXPREDDDT-DCHG                       00491000
004920         MOVE 'N' TO WS-DATEFORMAT                                00492000
004930         GO TO VD-EXIT.                                           00493000
004940     IF WS-WYEAR IS NOT NUMERIC                                   00494000
004950         MOVE 'E' TO RPXXX13-EXPREYYDT-DCHG                       00495000
004960         MOVE 'N' TO WS-DATEFORMAT                                00496000
004970         GO TO VD-EXIT.                                           00497000
004980     MOVE WS-WMONTH TO WS-WMONTH9.                                00498000
004990     MOVE WS-WDAY TO WS-WDAY9.                                    00499000
005000     MOVE WS-WYEAR TO WS-WYEAR9.                                  00500000
005010     IF WS-WMONTH9 IS LESS THAN 01                                00501000
005020         OR WS-WMONTH9 IS GREATER THAN 12                         00502000
005030         MOVE 'E' TO RPXXX13-EXPREMMDT-DCHG                       00503000
005040         MOVE 'N' TO WS-DATEFORMAT                                00504000
005050         GO TO VD-EXIT.                                           00505000
005060     IF WS-WDAY9 IS LESS THAN 01                                  00506000
005070         OR WS-WDAY9 IS GREATER THAN 31                           00507000
005080         MOVE 'E' TO RPXXX13-EXPREDDDT-DCHG                       00508000
005090         MOVE 'N' TO WS-DATEFORMAT                                00509000
005100         GO TO VD-EXIT.                                           00510000
005110     IF WS-WDAY9 IS GREATER THAN 29                               00511000
005120         AND WS-WMONTH9 IS EQUAL TO 02                            00512000
005130         MOVE 'E' TO RPXXX13-EXPREDDDT-DCHG                       00513000
005140         MOVE 'N' TO WS-DATEFORMAT                                00514000
005150         GO TO VD-EXIT.                                           00515000
005160     IF WS-WDAY9 IS GREATER THAN 30                               00516000
005170         AND                                                      00517000
005180         (WS-WMONTH9 IS EQUAL TO 04 OR                            00518000
005190         WS-WMONTH9 IS EQUAL TO 06 OR                             00519000
005200         WS-WMONTH9 IS EQUAL TO 09 OR                             00520000
005210         WS-WMONTH9 IS EQUAL TO 11)                               00521000
005220         MOVE 'E' TO RPXXX13-EXPREDDDT-DCHG                       00522000
005230         MOVE 'N' TO WS-DATEFORMAT                                00523000
005240         GO TO VD-EXIT.                                           00524000
005250     IF WS-WDAY9 IS EQUAL TO 29                                   00525000
005260         AND WS-WMONTH9 IS EQUAL TO 02                            00526000
005270         AND                                                      00527000
005280         (WS-WYEAR9 IS NOT EQUAL TO 2016                          00528000
005290         AND                                                      00529000
005300         WS-WYEAR9 IS NOT EQUAL TO 2020                           00530000
005310         AND                                                      00531000
005320         WS-WYEAR9 IS NOT EQUAL TO 2024                           00532000
005330         AND                                                      00533000
005340         WS-WYEAR9 IS NOT EQUAL TO 2028)                          00534000
005350         MOVE 'E' TO RPXXX13-EXPREDDDT-DCHG                       00535000
005360         MOVE 'E' TO RPXXX13-EXPREMMDT-DCHG                       00536000
005370         MOVE 'N' TO WS-DATEFORMAT                                00537000
005380         GO TO VD-EXIT.                                           00538000
005390     IF WS-MODELEXPIRE IS EQUAL TO ZEROS                          00539000
005400         GO TO VD-CHECK-CURRENT-DATE.                             00540000
005410* **                                                              00541000
005420     IF WS-NEW-EXPIRE9 IS GREATER THAN WS-MODELEXPIRE             00542000
005430         MOVE 'E' TO RPXXX13-EXPREMMDT-DCHG                       00543000
005440         MOVE 'E' TO RPXXX13-EXPREDDDT-DCHG                       00544000
005450         MOVE 'E' TO RPXXX13-EXPREYYDT-DCHG                       00545000
005460         MOVE 'N' TO WS-DATEFORMAT                                00546000
005470         GO TO VD-EXIT.                                           00547000
005480 VD-CHECK-CURRENT-DATE.                                           00548000
005490     IF WS-NEW-EXPIRE9 IS LESS THAN WS-NEW-EXPIRE9                00549000
005500         MOVE 'E' TO RPXXX13-EXPREMMDT-DCHG                       00550000
005510         MOVE 'E' TO RPXXX13-EXPREDDDT-DCHG                       00551000
005520         MOVE 'E' TO RPXXX13-EXPREYYDT-DCHG                       00552000
005530         MOVE 'N' TO WS-DATEFORMAT.                               00553000
005540 VD-EXIT.                                                         00554000
005550     EXIT.                                                        00555000
005560******************************************************************00556000
005570 REQUEST-CUSTOMER SECTION.                                        00557000
005580 RC-START.                                                        00558000
005590     MOVE SPACES TO RPRF21-FUNCTION.                              00559000
005600     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             00560000
005610     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         00561000
005620     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          00562000
005630     EXEC CICS LINK                                               00563000
005640         PROGRAM('RPO0RF21')                                      00564000
005650         COMMAREA(RPRF21-MESSAGE)                                 00565000
005660         LENGTH(LENGTH OF RPRF21-MESSAGE)                         00566000
005670         RESP(WS-CICS-RESPONSE)                                   00567000
005680         END-EXEC.                                                00568000
005690     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         00569000
005700     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00570000
005710         MOVE 'L' TO WS-FUNCTION                                  00571000
005720         MOVE 500036 TO WS-MSGNBR                                 00572000
005730         GO TO RC-EXIT.                                           00573000
005740     IF WS-FUNCTION IS EQUAL TO 'B'                               00574000
005750         MOVE 500045 TO WS-MSGNBR                                 00575000
005760         GO TO RC-EXIT.                                           00576000
005770     IF WS-FUNCTION IS EQUAL TO 'C'                               00577000
005780         MOVE 500037 TO WS-MSGNBR                                 00578000
005790         GO TO RC-EXIT.                                           00579000
005800     IF WS-FUNCTION IS EQUAL TO 'I'                               00580000
005810         MOVE 500038 TO WS-MSGNBR.                                00581000
005820 RC-EXIT.                                                         00582000
005830     EXIT.                                                        00583000
005840******************************************************************00584000
005850 FIND-DEFAULT-MODEL SECTION.                                      00585000
005860 FDM-START.                                                       00586000
005870     MOVE 'N' TO WS-ERROR.                                        00587000
005880     MOVE RPXXX13-KEY-INST TO RPMST-INST.                         00588000
005890     MOVE RPXXX13-KEY-PRODCODE TO RPMST-PRODCODE.                 00589000
005900     MOVE RPXXX13-KEY-ACCOUNT TO RPMST-ACCOUNT.                   00590000
005910     MOVE RPXXX13-KEY-MODEL TO RPMST-MODEL.                       00591000
005920     PERFORM RPS-MST-GET-GE-REQUEST.                              00592000
005930     IF WS-FUNCTION IS EQUAL TO 'N'                               00593000
P0192          OR WS-FUNCTION IS EQUAL TO 'E'                           00593500
005940         GO TO FDM-500BAD.                                        00594000
005950     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00595000
005960         MOVE WS-AB6320 TO RPXXX13-ABORT                          00596000
005970         MOVE WS-TR0007 TO RPXXX13-ABTRACE                        00597000
005980         GO TO VK-RETURN.                                         00598000
005990* USE THIS IS THERE IS ONLY ONE                                   00599000
006000     IF RPMST-INST IS EQUAL TO RPXXX13-KEY-INST                   00600000
006010         AND RPMST-PRODCODE IS EQUAL TO RPXXX13-KEY-PRODCODE      00601000
006020         AND RPMST-ACCOUNT IS EQUAL TO RPXXX13-KEY-ACCOUNT        00602000
006030         GO TO FDM-200.                                           00603000
006040* IF THE FOUND RECORD DOES NOT MATCH SEND MESSAGE                 00604000
006050     GO TO FDM-500BAD.                                            00605000
006060 FDM-200.                                                         00606000
006070     MOVE RPMST-MODEL TO RPXXX13-KEY-MODEL.                       00607000
006080     MOVE RPXXX13-KEY-INST TO WS-SAVEMSTINST.                     00608000
006090     MOVE RPXXX13-KEY-PRODCODE TO WS-SAVEMSTPRODCODE.             00609000
006100     MOVE RPXXX13-KEY-ACCOUNT TO WS-SAVEMSTACCOUNT.               00610000
006110     MOVE RPXXX13-KEY-MODEL TO WS-SAVEMSTMODEL.                   00611000
006120     PERFORM RPS-MST-GET-NEXT-REQUEST.                            00612000
006130     IF WS-FUNCTION IS EQUAL TO 'E'                               00613000
006140         GO TO FDM-500GOOD.                                       00614000
006150     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00615000
006160         MOVE WS-AB6320 TO RPXXX13-ABORT                          00616000
006170         MOVE WS-TR0008 TO RPXXX13-ABTRACE                        00617000
006180         GO TO VK-RETURN.                                         00618000
006190     IF RPMST-INST IS EQUAL TO RPXXX13-KEY-INST                   00619000
006200         AND RPMST-PRODCODE IS EQUAL TO RPXXX13-KEY-PRODCODE      00620000
006210         AND RPMST-ACCOUNT IS EQUAL TO RPXXX13-KEY-ACCOUNT        00621000
006220         GO TO FDM-500MULTIPLE.                                   00622000
006230 FDM-500GOOD.                                                     00623000
006240     MOVE WS-SAVEMSTINST TO                                       00624000
006250         RPXXX13-KEY-INST.                                        00625000
006260     MOVE WS-SAVEMSTPRODCODE TO                                   00626000
006270         RPXXX13-KEY-PRODCODE.                                    00627000
006280     MOVE WS-SAVEMSTACCOUNT TO                                    00628000
006290         RPXXX13-KEY-ACCOUNT.                                     00629000
006300     MOVE WS-SAVEMSTMODEL TO                                      00630000
006310         RPXXX13-KEY-MODEL.                                       00631000
006320     GO TO FDM-EXIT.                                              00632000
006330 FDM-500BAD.                                                      00633000
006340     MOVE 'Y' TO WS-ERROR.                                        00634000
006350     MOVE 500004 TO RPXXX13-MSGNBR.                               00635000
006360     GO TO FDM-EXIT.                                              00636000
006370 FDM-500MULTIPLE.                                                 00637000
006380     MOVE 'Y' TO WS-ERROR.                                        00638000
006390     MOVE 500090 TO RPXXX13-MSGNBR.                               00639000
006400     GO TO FDM-EXIT.                                              00640000
006410 FDM-EXIT.                                                        00641000
006420     EXIT.                                                        00642000
006430******************************************************************00643000
006440 READ-MICM-2023 SECTION.                                          00644000
006450 RM2023-START.                                                    00645000
006460     MOVE SPACES TO WS-FUNCTION.                                  00646000
006470     MOVE SPACES TO MI2023-RECORD.                                00647000
006480     IF RPXXX13-INST-OPT-1 IS NOT EQUAL TO 'Y'                    00648000
006490         MOVE ZEROS TO MIM-2023KINST.                             00649000
006500     MOVE RPXXX13-KEY-INST TO MIM-2023KINST.                      00650000
006510     MOVE RPXXX13-INST-OPT-1 TO SLW096-BANKS.                     00651000
006520     MOVE RPRF21-BASE-ACCT-PRODCODE TO MIM-2023KPRODCODE.         00652000
006530     MOVE +2023 TO MIM-2023KREC.                                  00653000
006540     MOVE MIC-MST-2023-PRI TO MIC-MST-REC-PRI.                    00654000
006550 RM2023-INST-ZERO.                                                00655000
006560     MOVE MI2023-RECORD TO MIMST-RECORD.                          00656000
006570     MOVE SPACES TO WS-FUNCTION.                                  00657000
006580     PERFORM MIC-MST-GET-REQUEST.                                 00658000
006590     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00659000
006600         AND MIM-2023KINST IS NOT EQUAL TO ZEROS                  00660000
006610         MOVE ZEROS TO MIM-2023KINST                              00661000
006620         GO TO RM2023-INST-ZERO.                                  00662000
006630     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00663000
006640         GO TO RM2023-END.                                        00664000
006650     MOVE MIMST-RECORD TO MI2023-RECORD.                          00665000
006660 RM2023-END.                                                      00666000
006670     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00667000
006680         MOVE 'N' TO MIM-2023RPOPTION.                            00668000
006690 RM2023-EXIT.                                                     00669000
006700     EXIT.                                                        00670000
006710******************************************************************00671000
006720 READ-MICM-7100 SECTION.                                          00672000
006730 RM7100-START.                                                    00673000
006740     MOVE SPACES TO WS-FUNCTION.                                  00674000
006750     MOVE SPACES TO MI7100-RECORD.                                00675000
006760     MOVE RPXXX13-KEY-INST TO MIM-7100KINST.                      00676000
006770 RM7100-LOOP.                                                     00677000
006780     MOVE +7100 TO MIM-7100KREC.                                  00678000
006790     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00679000
006800     MOVE MI7100-RECORD TO MIMST-RECORD.                          00680000
006810     PERFORM MIC-MST-GET-REQUEST.                                 00681000
006820     MOVE MIMST-RECORD TO MI7100-RECORD.                          00682000
006830     IF WS-FUNCTION IS EQUAL TO 'N'                               00683000
006840         AND MIM-7100KINST IS GREATER THAN ZEROS                  00684000
006850         GO TO RM7100-ZERO.                                       00685000
006860     GO TO RM7100-EXIT.                                           00686000
006870 RM7100-ZERO.                                                     00687000
006880     MOVE SPACES TO MI7100-RECORD.                                00688000
006890     MOVE ZEROS TO MIM-7100KINST.                                 00689000
006900     GO TO RM7100-LOOP.                                           00690000
006910 RM7100-EXIT.                                                     00691000
006920     EXIT.                                                        00692000
006930******************************************************************00693000
000000 COPY RPPIDXA.                                                    00694000
006950******************************************************************00695000
000000 COPY RPPMSTA.                                                    00696000
006970******************************************************************00697000
006980 MIC-MST-API SECTION.                                             00698000
000000 COPY MIPMSTA.                                                    00699000
007000******************************************************************00700000
007010 SLP096-GET-2023-RECORD SECTION.                                  00701000
000000 COPY SLP096.                                                     00702000
007030******************************************************************00703000
007040 JULIAN-365 SECTION.                                              00704000
000000 COPY SRP001.                                                     00705000
007060******************************************************************00706000
007070 CALENDAR-365 SECTION.                                            00707000
000000 COPY SRP003.                                                     00708000
007090******************************************************************00709000
007100 NEXT-DATE-365 SECTION.                                           00710000
000000 COPY SRP009.                                                     00711000
007120******************************************************************00712000
007130 OPERATOR-DIALOG-SECURITY SECTION.                                00713000
000000 COPY SRP079.                                                     00714000
007150******************************************************************00715000
007160 CICS-ABORT-EXIT SECTION.                                         00716000
007170 CAE-START.                                                       00717000
007180     GO TO CICS-RETURN.                                           00718000
007190 CAE-EXIT.                                                        00719000
007200     EXIT.                                                        00720000
007210******************************************************************00721000
007220 CICS-RETURN SECTION.                                             00722000
007230     IF COM-ABORT IS NOT EQUAL TO ZERO                            00723000
007240         MOVE COM-ABORT TO RPXXX13-ABORT.                         00724000
007250     IF RPXXX13-ABORT IS NOT EQUAL TO ZERO                        00725000
007260         AND WS-UPDATESW IS EQUAL TO 'Y'                          00726000
007270         MOVE 'Y' TO RPXXX13-ABTYPE.                              00727000
007280     IF RPXXX13-ABORT IS NOT EQUAL TO ZERO                        00728000
007290         MOVE WS-FUNCTION TO RPXXX13-FUNCTION                     00729000
007300         MOVE SRB-BMDB TO RPXXX13-SRBMDB                          00730000
007310         MOVE EIBFN TO RPXXX13-ABEIBFN                            00731000
007320         MOVE EIBRESP TO RPXXX13-ABEIBRESP                        00732000
007330         MOVE EIBRESP2 TO RPXXX13-ABEIBRESP2                      00733000
007340         MOVE EIBRCODE TO RPXXX13-ABEIBRCODE.                     00734000
007350     IF RPXXX13-ABTYPE IS NOT EQUAL TO 'Y'                        00735000
007360         PERFORM GLOBAL-CLOSE.                                    00736000
000000 COPY SLP709.                                                     00737000
007380******************************************************************00738000
007390 GLOBAL-CLOSE SECTION.                                            00739000
007400 GC-START.                                                        00740000
007410     IF RPXXX13-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  00741000
007420         PERFORM RPS-MST-GLOBAL-CLOSE-REQUEST.                    00742000
007430 GC-EXIT.                                                         00743000
007440     EXIT.                                                        00744000
007450******************************************************************00745000
