000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX06.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX06 - ADD-ON RELATIONSHIPS NEW REVIEW MODULE           *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW079-AREAS.                                                00016000
000000 COPY SRW079.                                                     00017000
000180 01  SRW105-AREAS.                                                00018000
000000 COPY SRW105.                                                     00019000
000200*01  BICRSRB.                                                     00020000
000000 COPY BICRSRB.                                                    00021000
000220*01  BICRPSB.                                                     00022000
000000 COPY BICRPSB.                                                    00023000
000240*01  BICRVERB.                                                    00024000
000000 COPY BICRVERB.                                                   00025000
000260*01  BICRSTAT.                                                    00026000
000000 COPY BICRSTAT.                                                   00027000
000280*01  BICRDBS.                                                     00028000
000000 COPY BICRDBS.                                                    00029000
000300*01  BICRLOG.                                                     00030000
000000 COPY BICRLOG.                                                    00031000
000320 01  SRW710-AREAS.                                                00032000
000000 COPY SRW710.                                                     00033000
000340 01  WS-WORKAREAS.                                                00034000
000350     03  WS-MAX-PANEL-ENTRIES    PIC S9(04)      COMP             00035000
000360                                                 VALUE +0011.     00036000
000370     03  COM-ABORT               PIC S9(04)      COMP.            00037000
000380     03  WS-SUB1                 PIC S9(04)      COMP             00038000
000390                                                 VALUE +0000.     00039000
000400     03  WS-SUB2                 PIC S9(04)      COMP             00040000
000410                                                 VALUE +0000.     00041000
000420     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00042000
000430                                                 VALUE ZERO.      00043000
000440     03  WS-UPDATESW             PIC X(01)       VALUE SPACES.    00044000
000450     03  WS-UPDATE-REL           PIC X(01)       VALUE SPACES.    00045000
000460     03  WS-RP-PRODCODE          PIC X(06)       VALUE SPACES.    00046000
000470     03  WS-ERROR-INDICATOR      PIC X(01)       VALUE SPACES.    00047000
000480     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00048000
000490     03  FILLER          REDEFINES WS-CURDATE.                    00049000
000500         05  WS-CURMM            PIC 9(02).                       00050000
000510         05  WS-CURDD            PIC 9(02).                       00051000
000520         05  WS-CURYYYY          PIC 9(04).                       00052000
000530     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00053000
000540     03  FILLER          REDEFINES WS-PDATE.                      00054000
000550         05  WS-PDATE-YYYY       PIC 9(04).                       00055000
000560         05  WS-PDATE-MM         PIC 9(02).                       00056000
000570         05  WS-PDATE-DD         PIC 9(02).                       00057000
000580     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00058000
000590     03  FILLER          REDEFINES WS-PDATE2.                     00059000
000600         05  WS-PDATE2-YYYY      PIC 9(04).                       00060000
000610         05  WS-PDATE2-MM        PIC 9(02).                       00061000
000620         05  WS-PDATE2-DD        PIC 9(02).                       00062000
000630     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00063000
000640                                                 VALUE ZERO.      00064000
000650     03  WS-SAVEMASTERGROUP.                                      00065000
000660         05  WS-SAVEMSTINST      PIC 9(04).                       00066000
000670         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00067000
000680         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00068000
000690         05  WS-SAVEMSTMODEL     PIC X(10).                       00069000
000700*----------------------------------------------------------------*00070000
000710 01  MIWPRI-AREAS.                                                00071000
000000 COPY MIWPRI.                                                     00072000
000730 01  MIWMSTA-AREAS.                                               00073000
000000 COPY MIWMSTA.                                                    00074000
000750 01  MIMST-RECORD.                                                00075000
000000 COPY MISMST.                                                     00076000
000770 01  MI2023-RECORD.                                               00077000
000000 COPY MIS2023A.                                                   00078000
P0052  01  MI7100-RECORD.                                               00078300
000000 COPY MIS7100.                                                    00078600
000790 01  MI7101-RECORD.                                               00079000
000000 COPY MIS7101.                                                    00080000
000810*----------------------------------------------------------------*00081000
000820 01  RPWPRI-AREAS.                                                00082000
000000 COPY RPWPRI.                                                     00083000
000840 01  RPWIDX-AREA.                                                 00084000
000000 COPY RPWIDXA.                                                    00085000
000860 01  RPIDX-RECORD.                                                00086000
000000 COPY RPSIDX.                                                     00087000
000880 01  RPWQUA-AREA.                                                 00088000
000000 COPY RPWQUAA.                                                    00089000
000900 01  RPQUA-RECORD.                                                00090000
000000 COPY RPSQUA.                                                     00091000
000920 01  RPWREL-AREA.                                                 00092000
000000 COPY RPWRELA.                                                    00093000
000940 01  RPREL-RECORD.                                                00094000
000000 COPY RPSREL.                                                     00095000
000960*----------------------------------------------------------------*00096000
000970 01  RPRF21-MESSAGE.                                              00097000
000000 COPY MISCNT00      REPLACING                                     00098000
000990             ==:MICNT:== BY ==RPRF21==.                           00099000
000000 COPY RPSRF21.                                                    00100000
001010*----------------------------------------------------------------*00101000
001020 01  WS-TRACECODES.                                               00102000
001030     03  WS-TR0001               PIC S9(04)      COMP             00103000
001040                                                 VALUE +0001.     00104000
001050     03  WS-TR0002               PIC S9(04)      COMP             00105000
001060                                                 VALUE +0002.     00106000
001070     03  WS-TR0003               PIC S9(04)      COMP             00107000
001080                                                 VALUE +0003.     00108000
001090     03  WS-TR0004               PIC S9(04)      COMP             00109000
001100                                                 VALUE +0004.     00110000
001110     03  WS-TR0005               PIC S9(04)      COMP             00111000
001120                                                 VALUE +0005.     00112000
001130     03  WS-TR0006               PIC S9(04)      COMP             00113000
001140                                                 VALUE +0006.     00114000
001150     03  WS-TR0007               PIC S9(04)      COMP             00115000
001160                                                 VALUE +0007.     00116000
001170     03  WS-TR0008               PIC S9(04)      COMP             00117000
001180                                                 VALUE +0008.     00118000
001190     03  WS-TR0009               PIC S9(04)      COMP             00119000
001200                                                 VALUE +0009.     00120000
001210     03  WS-TR0010               PIC S9(04)      COMP             00121000
001220                                                 VALUE +0010.     00122000
001230     03  WS-TR0011               PIC S9(04)      COMP             00123000
001240                                                 VALUE +0011.     00124000
001250     03  WS-TR0012               PIC S9(04)      COMP             00125000
001260                                                 VALUE +0012.     00126000
001270     03  WS-TR0013               PIC S9(04)      COMP             00127000
001280                                                 VALUE +0013.     00128000
001290 01  WS-ABORTCODES.                                               00129000
001300     03  WS-AB2000               PIC S9(04)      COMP             00130000
001310                                                 VALUE +2000.     00131000
001320     03  WS-AB2033               PIC S9(04)      COMP             00132000
001330                                                 VALUE +2033.     00133000
001340     03  WS-AB3051               PIC S9(04)      COMP             00134000
001350                                                 VALUE +3051.     00135000
001360     03  WS-AB6310               PIC S9(04)      COMP             00136000
001370                                                 VALUE +6310.     00137000
001380     03  WS-AB6325               PIC S9(04)      COMP             00138000
001390                                                 VALUE +6325.     00139000
001400     03  WS-AB6330               PIC S9(04)      COMP             00140000
001410                                                 VALUE +6330.     00141000
001420******************************************************************00142000
001430 01  SLW096-AREAS.                                                00143000
000000 COPY SLW096.                                                     00144000
001450******************************************************************00145000
001460 LINKAGE SECTION.                                                 00146000
001470 01  DFHCOMMAREA.                                                 00147000
000000 COPY MISCNT00      REPLACING                                     00148000
001490             ==:MICNT:== BY ==RPXXX06==.                          00149000
000000 COPY RPSXXX06.                                                   00150000
001510*01  SLW096-2023RECORDS.                                          00151000
000000 COPY SLW096L.                                                    00152000
001530******************************************************************00153000
001540 PROCEDURE DIVISION.                                              00154000
001550******************************************************************00155000
001560 ENTRY-ROUTINE SECTION.                                           00156000
001570 ER-START.                                                        00157000
001580     MOVE 'RPLXXX06' TO SR-APIPROGLIT.                            00158000
001590     MOVE 'RPLXXX06' TO RPXXX06-ABPROGID.                         00159000
001600     PERFORM CICS-HANDLE-CONDITION.                               00160000
001610     IF EIBCALEN IS EQUAL TO +0                                   00161000
001620         MOVE WS-AB2000 TO RPXXX06-ABORT                          00162000
001630         MOVE WS-TR0001 TO RPXXX06-ABTRACE                        00163000
001640         GO TO CICS-RETURN.                                       00164000
001650     MOVE ZERO TO RPXXX06-MSGNBR.                                 00165000
001660     MOVE SPACE TO WS-FUNCTION.                                   00166000
001670     MOVE RPXXX06-FILEOPTS TO WS-FILEOPTS.                        00167000
001680     MOVE RPXXX06-OPERID TO WS-UPD-USER.                          00168000
001690     MOVE RPXXX06-EXTERNALID TO LOG-PANELID.                      00169000
001700     MOVE RPXXX06-TERMID TO LOG-TERMID.                           00170000
001710     MOVE RPXXX06-WORKID TO LOG-WORKID.                           00171000
001720     MOVE RPXXX06-TRANSTART TO LOG-TRANSTART.                     00172000
001730     MOVE RPXXX06-APPLSEQ TO LOG-APPLSEQ.                         00173000
000000 COPY SLP094.                                                     00174000
001750     GO TO VERIFY-KEY.                                            00175000
001760 ER-EXIT.                                                         00176000
001770     EXIT.                                                        00177000
001780******************************************************************00178000
001790 CICS-HANDLE-CONDITION SECTION.                                   00179000
000000 COPY SLP702.                                                     00180000
001810     MOVE WS-AB2033 TO RPXXX06-ABORT.                             00181000
001820     MOVE WS-TR0002 TO RPXXX06-ABTRACE.                           00182000
001830     GO TO CICS-RETURN.                                           00183000
001840 CHC-EXIT.                                                        00184000
001850     EXIT.                                                        00185000
001860******************************************************************00186000
001870 VERIFY-KEY SECTION.                                              00187000
001880 VK-START.                                                        00188000
001890     MOVE ZERO TO COM-ABORT.                                      00189000
001900     MOVE ZERO TO RPXXX06-ABORT.                                  00190000
001910     MOVE ZERO TO RPXXX06-MSGNBR.                                 00191000
001920     MOVE SPACES TO RPXXX06-FUNCTION.                             00192000
001930     MOVE RPXXX06-DATE TO WS-CURDATE.                             00193000
001940     MOVE WS-CURMM TO WS-PDATE-MM.                                00194000
001950     MOVE WS-CURDD TO WS-PDATE-DD.                                00195000
001960     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00196000
001970     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00197000
001980 VK-SECURITY.                                                     00198000
001990     IF RPXXX06-APIFUNC IS NOT EQUAL TO 'VKL'                     00199000
002000         GO TO VK-EXIT.                                           00200000
002010     MOVE RPXXX06-UPDATE TO SR-OPDUPDATE.                         00201000
002020     MOVE RPXXX06-KEY-INST TO SR-OPDINST.                         00202000
002030     MOVE RPXXX06-OPERID TO SR-OPDOPERID.                         00203000
002040     MOVE RPXXX06-MODELID TO SR-OPDMODELID.                       00204000
002050     MOVE RPXXX06-EXTERNALID TO SR-OPDTRANCODE.                   00205000
002060     MOVE RPXXX06-APPL TO SR-OPDAPPL.                             00206000
002070     MOVE RPXXX06-SECALT TO SR-OPDSECALT.                         00207000
002080     MOVE RPXXX06-FUNC TO SR-OPDFUNC.                             00208000
002090     PERFORM OPERATOR-DIALOG-SECURITY.                            00209000
002100     MOVE SR-OPDUPDATE TO RPXXX06-UPDATE.                         00210000
002110     IF SR-OPDMSGNBR IS NOT EQUAL TO ZEROS                        00211000
002120         MOVE SR-OPDMSGNBR TO RPXXX06-MSGNBR                      00212000
002130         GO TO VK-RETURN.                                         00213000
002140     MOVE ZERO TO RPXXX06-OCCUR.                                  00214000
002150 VK-IDX.                                                          00215000
002160     INITIALIZE RPIDX-RECORD.                                     00216000
002170     IF RPXXX06-KEY-IDNUMBER IS NOT GREATER THAN ZEROS            00217000
002180         OR RPXXX06-KEY-IDNUMBER IS NOT NUMERIC                   00218000
002190         GO TO VK-QUA.                                            00219000
002200     PERFORM LOCATE-IDNUMBER-BY-APPL.                             00220000
002210     IF WS-FUNCTION IS EQUAL TO 'N'                               00221000
002220         MOVE 500004 TO RPXXX06-MSGNBR                            00222000
002230         GO TO VK-RETURN.                                         00223000
002240     MOVE ZEROS TO RPXXX06-KEY-IDNUMBER.                          00224000
002250 VK-QUA.                                                          00225000
002260     IF RPXXX06-KEY-MODEL IS EQUAL TO SPACES OR                   00226000
002270         RPXXX06-KEY-MODEL IS EQUAL TO LOW-VALUES                 00227000
002280         PERFORM FIND-DEFAULT-MODEL.                              00228000
002290     IF WS-ERROR IS EQUAL TO 'Y'                                  00229000
002300         GO TO VK-RETURN.                                         00230000
002310     MOVE RPXXX06-KEY-INST TO RPQUA-INST.                         00231000
002320     MOVE RPXXX06-KEY-PRODCODE TO RPQUA-PRODCODE.                 00232000
002330     MOVE RPXXX06-KEY-ACCOUNT TO RPQUA-ACCOUNT.                   00233000
002340     MOVE RPXXX06-KEY-MODEL TO RPQUA-MODEL.                       00234000
002350     PERFORM RPS-QUA-GET-REQUEST.                                 00235000
002360     IF WS-FUNCTION IS EQUAL TO 'N'                               00236000
002370         MOVE 500004 TO RPXXX06-MSGNBR                            00237000
002380         GO TO VK-RETURN.                                         00238000
002390     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00239000
002400         MOVE WS-AB6325 TO RPXXX06-ABORT                          00240000
002410         MOVE WS-TR0003 TO RPXXX06-ABTRACE                        00241000
002420         GO TO VK-RETURN.                                         00242000
002430     IF RPQUA-ADDON-ACCTS IS EQUAL TO ZEROS                       00243000
002440         MOVE 500056 TO RPXXX06-MSGNBR                            00244000
002450         GO TO VK-RETURN.                                         00245000
002460     MOVE RPQUA-MODEL TO RPXXX06-KEY-MODEL.                       00246000
002470     MOVE RPQUA-IDNUMBER TO RPXXX06-IDNUMBER.                     00247000
002480     MOVE 'A' TO RPXXX06-REL-STAT.                                00248000
P0052  VK-7100.                                                         00248100
P0052      PERFORM READ-MICM-7100.                                      00248200
P0052      IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00248300
P0052          MOVE 500005 TO RPXXX06-MSGNBR                            00248400
P0052          GO TO VK-RETURN.                                         00248500
002490 VK-7101.                                                         00249000
002500     MOVE SPACES TO MI7101-RECORD.                                00250000
002510     MOVE RPXXX06-KEY-INST TO MIM-7101KINST.                      00251000
002520     MOVE +7101 TO MIM-7101KREC.                                  00252000
002530     MOVE RPXXX06-KEY-MODEL TO MIM-7101KMODEL.                    00253000
002540     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        00254000
002550     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        00255000
002560     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00256000
002570     MOVE MI7101-RECORD TO MIMST-RECORD.                          00257000
002580     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00258000
002590     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00259000
002600         MOVE 500006 TO RPXXX06-MSGNBR                            00260000
002610         GO TO VK-RETURN.                                         00261000
002620     MOVE MIMST-RECORD TO MI7101-RECORD.                          00262000
002630     IF MIM-7101KINST IS NOT EQUAL TO RPXXX06-KEY-INST            00263000
002640         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   00264000
002650         OR MIM-7101KMODEL IS NOT EQUAL TO RPXXX06-KEY-MODEL      00265000
002660         MOVE 500006 TO RPXXX06-MSGNBR                            00266000
002670         GO TO VK-RETURN.                                         00267000
002680     MOVE MIM-7101DESC TO RPXXX06-MODEL-DESC.                     00268000
002690 VK-NAME.                                                         00269000
002700     MOVE 'A' TO RPRF21-FUNC.                                     00270000
002710     MOVE RPXXX06-KEY-INST TO RPRF21-BASE-ACCT-INST.              00271000
002720     MOVE RPXXX06-KEY-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.      00272000
002730     MOVE RPXXX06-KEY-ACCOUNT TO RPRF21-BASE-ACCT.                00273000
P0052      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00273200
P0052          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00273400
P0052          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00273600
002740     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          00274000
002750     PERFORM REQUEST-CUSTOMER.                                    00275000
002760     MOVE WS-MSGNBR TO RPXXX06-MSGNBR.                            00276000
002770     IF WS-FUNCTION IS EQUAL TO 'B'                               00277000
002780         MOVE SPACES TO WS-FUNCTION.                              00278000
002790     IF WS-FUNCTION IS EQUAL TO SPACES                            00279000
002800         MOVE RPRF21-BASE-RCIF-KEY TO RPXXX06-RCIF-KEY            00280000
002810         MOVE RPRF21-NAME TO RPXXX06-CUST-NAME                    00281000
002820         GO TO VK-REL.                                            00282000
002830     IF RPXXX06-MSGNBR IS EQUAL TO ZEROS                          00283000
002840         MOVE 500016 TO RPXXX06-MSGNBR.                           00284000
002850     GO TO VK-RETURN.                                             00285000
002860 VK-REL.                                                          00286000
002870     MOVE ZEROS TO WS-SUB1.                                       00287000
002880     MOVE ZEROS TO RPXXX06-OCCUR.                                 00288000
002890     INITIALIZE RPREL-RECORD.                                     00289000
002900     MOVE LOW-VALUES TO RPREL-GRP-KEY.                            00290000
002910     MOVE RPQUA-GRP-KEY TO RPREL-ACCT1-GRP.                       00291000
002920     PERFORM RPS-REL-GET-GE-REQUEST.                              00292000
002930     GO TO VK-REL-TEST.                                           00293000
002940 VK-REL-NEXT.                                                     00294000
002950     PERFORM RPS-REL-GET-NEXT-REQUEST.                            00295000
002960 VK-REL-TEST.                                                     00296000
002970     ADD +0001 TO WS-SUB1.                                        00297000
002980     IF WS-FUNCTION IS EQUAL TO 'N'                               00298000
002990         OR WS-FUNCTION IS EQUAL TO 'E'                           00299000
003000         GO TO VK-END.                                            00300000
003010     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00301000
003020         MOVE WS-AB6330 TO RPXXX06-ABORT                          00302000
003030         MOVE WS-TR0004 TO RPXXX06-ABTRACE                        00303000
003040         GO TO VK-RETURN.                                         00304000
003050     IF RPREL-ACCT1-GRP IS NOT EQUAL TO RPXXX06-KEY-GRP1          00305000
003060         GO TO VK-END.                                            00306000
003070     IF WS-SUB1 IS GREATER THAN WS-MAX-PANEL-ENTRIES              00307000
003080         GO TO VK-END.                                            00308000
003090     MOVE RPREL-GRP-KEY TO RPXXX06-RECORD (WS-SUB1).              00309000
003100     ADD +1 TO RPXXX06-OCCUR.                                     00310000
003110     GO TO VK-REL-NEXT.                                           00311000
003120 VK-RETURN.                                                       00312000
003130     IF RPXXX06-MSGNBR IS EQUAL TO ZEROS                          00313000
003140         MOVE 500004 TO RPXXX06-MSGNBR.                           00314000
003150     MOVE 'E' TO RPXXX06-RETURN.                                  00315000
003160 VK-END.                                                          00316000
003170     PERFORM SET-RPXXX06-RETURN.                                  00317000
003180     GO TO CICS-RETURN.                                           00318000
003190 VK-EXIT.                                                         00319000
003200     EXIT.                                                        00320000
003210******************************************************************00321000
003220 EDIT-MESSAGE SECTION.                                            00322000
003230 EM-START.                                                        00323000
003240     MOVE ZEROS TO WS-SUB1.                                       00324000
003250     PERFORM CHECK-FOR-ERRORS.                                    00325000
003260     IF WS-ERROR-INDICATOR IS EQUAL TO 'Y'                        00326000
003270         OR RPXXX06-APIFUNC IS NOT EQUAL TO 'UPD'                 00327000
003280         OR WS-UPDATE-REL IS NOT EQUAL TO 'Y'                     00328000
003290         GO TO EM-EDIT-COMPLETE.                                  00329000
003300     MOVE ZEROS TO WS-SUB1.                                       00330000
003310 EM-LOOP.                                                         00331000
003320     ADD +0001 TO WS-SUB1.                                        00332000
003330     IF WS-SUB1 IS GREATER THAN +0010                             00333000
003340         GO TO EM-EDIT-COMPLETE.                                  00334000
003350     IF RPXXX06-DEL (WS-SUB1) IS NOT GREATER THAN SPACES          00335000
003360         GO TO EM-LOOP.                                           00336000
003370     PERFORM DELETE-REL-RECORD.                                   00337000
003380     GO TO EM-LOOP.                                               00338000
003390 EM-EDIT-COMPLETE.                                                00339000
003400     IF WS-ERROR-INDICATOR IS EQUAL TO 'Y'                        00340000
003410         AND RPXXX06-MSGNBR IS EQUAL TO ZEROS                     00341000
003420         MOVE 500035 TO RPXXX06-MSGNBR.                           00342000
003430     IF WS-ERROR-INDICATOR IS EQUAL TO 'Y'                        00343000
003440         OR RPXXX06-APIFUNC IS EQUAL TO 'EDT'                     00344000
003450         MOVE 'EDT' TO RPXXX06-APIFUNC                            00345000
003460         PERFORM SET-RPXXX06-RETURN                               00346000
003470         GO TO CICS-RETURN.                                       00347000
003480 EM-LOAD-COMPLETE.                                                00348000
003490     PERFORM SCAN-ADDONS.                                         00349000
003500     PERFORM SET-RPXXX06-RETURN.                                  00350000
003510     GO TO CICS-RETURN.                                           00351000
003520 EM-EXIT.                                                         00352000
003530     EXIT.                                                        00353000
003540******************************************************************00354000
003550 CHECK-FOR-ERRORS SECTION.                                        00355000
003560 CFE-START.                                                       00356000
003570     MOVE +0011 TO WS-SUB1.                                       00357000
003580 CFE-EDIT-LIST-LOOP.                                              00358000
003590     SUBTRACT +1 FROM WS-SUB1.                                    00359000
003600     IF WS-SUB1 IS LESS THAN +1                                   00360000
003610         GO TO CFE-EXIT.                                          00361000
003620     IF RPXXX06-DEL-DCHG (WS-SUB1) IS EQUAL TO SPACES             00362000
003630         GO TO CFE-EDIT-LIST-LOOP.                                00363000
003640     IF RPXXX06-DEL (WS-SUB1) IS EQUAL TO SPACES                  00364000
003650         GO TO CFE-EDIT-LIST-LOOP.                                00365000
003660     IF RPXXX06-DEL (WS-SUB1) IS EQUAL TO 'D'                     00366000
003670         MOVE 'Y' TO WS-UPDATE-REL                                00367000
003680         GO TO CFE-EDIT-LIST-LOOP.                                00368000
003690     MOVE 'E' TO RPXXX06-DEL-DCHG (WS-SUB1).                      00369000
003700     MOVE 'Y' TO WS-ERROR-INDICATOR.                              00370000
003710     GO TO CFE-EDIT-LIST-LOOP.                                    00371000
003720 CFE-EXIT.                                                        00372000
003730     EXIT.                                                        00373000
003740******************************************************************00374000
003750 SCAN-ADDONS SECTION.                                             00375000
003760 SA-START.                                                        00376000
003770     MOVE SPACES TO RPXXX06-DATA-GRP.                             00377000
003780     MOVE SPACES TO RPXXX06-DEL-GRP.                              00378000
003790     MOVE +1 TO WS-SUB1.                                          00379000
003800     MOVE ZERO TO RPXXX06-OCCUR.                                  00380000
003810     MOVE RPXXX06-KEY-RECORD TO RPREL-GRP-KEY.                    00381000
003820     PERFORM RPS-REL-GET-GE-REQUEST.                              00382000
003830     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00383000
003840         AND WS-FUNCTION IS NOT EQUAL TO 'E'                      00384000
003850         MOVE WS-AB6330 TO RPXXX06-ABORT                          00385000
003860         MOVE WS-TR0005 TO RPXXX06-ABTRACE                        00386000
003870         GO TO CICS-RETURN.                                       00387000
003880     GO TO SA-CONTINUE.                                           00388000
003890 SA-GET-NEXT.                                                     00389000
003900     IF WS-SUB1 IS GREATER THAN WS-MAX-PANEL-ENTRIES              00390000
003910         GO TO SA-EXIT.                                           00391000
003920     PERFORM RPS-REL-GET-NEXT-REQUEST.                            00392000
003930     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00393000
003940         AND WS-FUNCTION IS NOT EQUAL TO 'E'                      00394000
003950         MOVE WS-AB6330 TO RPXXX06-ABORT                          00395000
003960         MOVE WS-TR0006 TO RPXXX06-ABTRACE                        00396000
003970         GO TO CICS-RETURN.                                       00397000
003980 SA-CONTINUE.                                                     00398000
003990     IF WS-FUNCTION IS EQUAL TO 'E'                               00399000
004000         GO TO SA-EXIT.                                           00400000
004010     IF RPREL-ACCT1-GRP IS NOT EQUAL TO RPXXX06-KEY-GRP1          00401000
004020         GO TO SA-EXIT.                                           00402000
004030     MOVE RPREL-GRP-KEY TO RPXXX06-RECORD (WS-SUB1).              00403000
004040     ADD +1 TO WS-SUB1.                                           00404000
004050     ADD +1 TO RPXXX06-OCCUR.                                     00405000
004060     GO TO SA-GET-NEXT.                                           00406000
004070 SA-EXIT.                                                         00407000
004080     EXIT.                                                        00408000
004090******************************************************************00409000
004100 SET-RPXXX06-RETURN SECTION.                                      00410000
004110 SCR-START.                                                       00411000
004120     IF RPXXX06-OCCUR IS EQUAL TO ZERO                            00412000
004130         MOVE '1' TO RPXXX06-SELECT-RTN                           00413000
004140         GO TO SCR-EXIT.                                          00414000
004150     IF RPXXX06-OCCUR IS LESS THAN WS-MAX-PANEL-ENTRIES           00415000
004160         MOVE '2' TO RPXXX06-SELECT-RTN                           00416000
004170         GO TO SCR-EXIT.                                          00417000
004180     IF RPXXX06-OCCUR IS GREATER THAN WS-MAX-PANEL-ENTRIES        00418000
004190         OR RPXXX06-OCCUR IS EQUAL TO WS-MAX-PANEL-ENTRIES        00419000
004200         MOVE '3' TO RPXXX06-SELECT-RTN.                          00420000
004210 SCR-EXIT.                                                        00421000
004220     EXIT.                                                        00422000
004230******************************************************************00423000
004240 LOCATE-IDNUMBER-BY-APPL SECTION.                                 00424000
004250 LIBA-START.                                                      00425000
004260     MOVE RPXXX06-KEY-INST TO MIM-2023KINST.                      00426000
004270     MOVE 'RP' TO MIM-2023KPRODCODE.                              00427000
004280     MOVE RPXXX06-INST-OPT-1 TO SLW096-BANKS.                     00428000
004290     PERFORM SLP096-GET-2023-RECORD.                              00429000
004300     IF SLW096-FUNCTION IS EQUAL TO SPACES                        00430000
004310         MOVE MIM-2023KPRODCODE TO WS-RP-PRODCODE                 00431000
004320         GO TO LIBA-READ-IDX.                                     00432000
004330     MOVE ZERO TO WS-SUB1.                                        00433000
004340 LIBA-FIND-ACT-LOOP.                                              00434000
004350     ADD +1 TO WS-SUB1.                                           00435000
004360     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00436000
004370         MOVE 'N' TO WS-FUNCTION                                  00437000
004380         GO TO LIBA-EXIT.                                         00438000
004390     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00439000
004400         IS NOT EQUAL TO RPXXX06-APPL                             00440000
004410         GO TO LIBA-FIND-ACT-LOOP.                                00441000
004420     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO WS-RP-PRODCODE.       00442000
004430 LIBA-READ-IDX.                                                   00443000
004440     MOVE RPXXX06-KEY-INST TO RPIDX-INST.                         00444000
004450     MOVE WS-RP-PRODCODE TO RPIDX-PRODCODE.                       00445000
004460     MOVE RPXXX06-KEY-IDNUMBER TO RPIDX-IDNUMBER.                 00446000
004470     PERFORM RPS-IDX-GET-REQUEST.                                 00447000
004480     IF WS-FUNCTION IS EQUAL TO 'N'                               00448000
004490         GO TO LIBA-EXIT.                                         00449000
004500     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00450000
004510         MOVE WS-AB6310 TO RPXXX06-ABORT                          00451000
004520         MOVE WS-TR0007 TO RPXXX06-ABTRACE                        00452000
004530         GO TO CICS-ABORT-EXIT.                                   00453000
004540     MOVE RPIDX-ACCT2-KEY TO RPXXX06-KEY-RECORD.                  00454000
004550 LIBA-EXIT.                                                       00455000
004560     EXIT.                                                        00456000
004570******************************************************************00457000
004580 DELETE-REL-RECORD SECTION.                                       00458000
004590 DREL-START.                                                      00459000
004600     INITIALIZE RPREL-RECORD.                                     00460000
004610     MOVE RPXXX06-GRP-KEY (WS-SUB1) TO RPREL-GRP-KEY.             00461000
004620     PERFORM RPS-REL-GET-LOCK-REQUEST.                            00462000
004630     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00463000
004640         MOVE WS-AB6330 TO RPXXX06-ABORT                          00464000
004650         MOVE WS-TR0008 TO RPXXX06-ABTRACE                        00465000
004660         GO TO CICS-RETURN.                                       00466000
004670     PERFORM RPS-REL-DELETE-REQUEST.                              00467000
004680     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00468000
004690         MOVE WS-AB6330 TO RPXXX06-ABORT                          00469000
004700         MOVE WS-TR0009 TO RPXXX06-ABTRACE                        00470000
004710         GO TO CICS-RETURN.                                       00471000
004720     MOVE RPXXX06-KEY-INST TO RPQUA-INST.                         00472000
004730     MOVE RPXXX06-KEY-PRODCODE TO RPQUA-PRODCODE.                 00473000
004740     MOVE RPXXX06-KEY-ACCOUNT TO RPQUA-ACCOUNT.                   00474000
004750     MOVE RPXXX06-KEY-MODEL TO RPQUA-MODEL.                       00475000
004760     PERFORM RPS-QUA-GET-LOCK-REQUEST.                            00476000
004770     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00477000
004780         MOVE WS-AB6325 TO RPXXX06-ABORT                          00478000
004790         MOVE WS-TR0010 TO RPXXX06-ABTRACE                        00479000
004800         GO TO CICS-RETURN.                                       00480000
004810     IF RPQUA-ADDON-ACCTS IS GREATER THAN ZEROS                   00481000
004820         SUBTRACT +1 FROM RPQUA-ADDON-ACCTS.                      00482000
004830     PERFORM RPS-QUA-REPUT-REQUEST.                               00483000
004840     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00484000
004850         MOVE WS-AB6325 TO RPXXX06-ABORT                          00485000
004860         MOVE WS-TR0011 TO RPXXX06-ABTRACE                        00486000
004870         GO TO CICS-RETURN.                                       00487000
004880 DQUA-EXIT.                                                       00488000
004890     EXIT.                                                        00489000
004900******************************************************************00490000
004910 REQUEST-CUSTOMER SECTION.                                        00491000
004920 RC-START.                                                        00492000
004930     MOVE SPACES TO RPRF21-FUNCTION.                              00493000
004940     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             00494000
004950     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         00495000
004960     EXEC CICS LINK                                               00496000
004970         PROGRAM('RPO0RF21')                                      00497000
004980         COMMAREA(RPRF21-MESSAGE)                                 00498000
004990         LENGTH(LENGTH OF RPRF21-MESSAGE)                         00499000
005000         RESP(WS-CICS-RESPONSE)                                   00500000
005010         END-EXEC.                                                00501000
005020     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         00502000
005030     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     00503000
005040         MOVE 'L' TO WS-FUNCTION                                  00504000
005050         MOVE 500036 TO WS-MSGNBR                                 00505000
005060         GO TO RC-EXIT.                                           00506000
005070     IF WS-FUNCTION IS EQUAL TO 'B'                               00507000
005080         MOVE 500045 TO WS-MSGNBR                                 00508000
005090         GO TO RC-EXIT.                                           00509000
005100     IF WS-FUNCTION IS EQUAL TO 'C'                               00510000
005110         MOVE 500037 TO WS-MSGNBR                                 00511000
005120         GO TO RC-EXIT.                                           00512000
005130     IF WS-FUNCTION IS EQUAL TO 'I'                               00513000
005140         MOVE 500038 TO WS-MSGNBR.                                00514000
005150 RC-EXIT.                                                         00515000
005160     EXIT.                                                        00516000
005170******************************************************************00517000
005180 FIND-DEFAULT-MODEL SECTION.                                      00518000
005190 FDM-START.                                                       00519000
005200     MOVE 'N' TO WS-ERROR.                                        00520000
005210     MOVE RPXXX06-KEY-INST TO RPQUA-INST.                         00521000
005220     MOVE RPXXX06-KEY-PRODCODE TO RPQUA-PRODCODE.                 00522000
005230     MOVE RPXXX06-KEY-ACCOUNT TO RPQUA-ACCOUNT.                   00523000
005240     IF RPXXX06-KEY-MODEL IS EQUAL TO LOW-VALUE                   00524000
005250         MOVE SPACES TO RPXXX06-KEY-MODEL.                        00525000
005260     MOVE RPXXX06-KEY-MODEL TO RPQUA-MODEL.                       00526000
005270     PERFORM RPS-QUA-GET-GE-REQUEST.                              00527000
005280     IF WS-FUNCTION IS EQUAL TO 'N'                               00528000
005290         OR WS-FUNCTION IS EQUAL TO 'E'                           00529000
005300         GO TO FDM-RECORD-NOT-FOUND.                              00530000
005310     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00531000
005320         MOVE WS-AB6325 TO RPXXX06-ABORT                          00532000
005330         MOVE WS-TR0012 TO RPXXX06-ABTRACE                        00533000
005340         MOVE 'Y' TO WS-ERROR                                     00534000
005350         GO TO FDM-EXIT.                                          00535000
005360     IF RPQUA-INST IS EQUAL TO RPXXX06-KEY-INST                   00536000
005370         AND RPQUA-PRODCODE IS EQUAL TO RPXXX06-KEY-PRODCODE      00537000
005380         AND RPQUA-ACCOUNT IS EQUAL TO RPXXX06-KEY-ACCOUNT        00538000
005390         GO TO FDM-GET-NEXT-QUA.                                  00539000
005400     GO TO FDM-RECORD-NOT-FOUND.                                  00540000
005410 FDM-GET-NEXT-QUA.                                                00541000
005420     MOVE RPQUA-MODEL TO RPXXX06-KEY-MODEL.                       00542000
005430     MOVE RPXXX06-KEY-INST TO WS-SAVEMSTINST.                     00543000
005440     MOVE RPXXX06-KEY-PRODCODE TO WS-SAVEMSTPRODCODE.             00544000
005450     MOVE RPXXX06-KEY-ACCOUNT TO WS-SAVEMSTACCOUNT.               00545000
005460     MOVE RPXXX06-KEY-MODEL TO WS-SAVEMSTMODEL.                   00546000
005470     PERFORM RPS-QUA-GET-NEXT-REQUEST.                            00547000
005480     IF WS-FUNCTION IS EQUAL TO 'E'                               00548000
005490         GO TO FDM-GOOD-RECORD.                                   00549000
005500     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00550000
005510         MOVE WS-AB6325 TO RPXXX06-ABORT                          00551000
005520         MOVE WS-TR0013 TO RPXXX06-ABTRACE                        00552000
005530         MOVE 'Y' TO WS-ERROR                                     00553000
005540         GO TO FDM-EXIT.                                          00554000
005550     IF RPQUA-INST IS EQUAL TO RPXXX06-KEY-INST                   00555000
005560         AND RPQUA-PRODCODE IS EQUAL TO RPXXX06-KEY-PRODCODE      00556000
005570         AND RPQUA-ACCOUNT IS EQUAL TO RPXXX06-KEY-ACCOUNT        00557000
005580         GO TO FDM-MULTIPLE-PRIM.                                 00558000
005590 FDM-GOOD-RECORD.                                                 00559000
005600     MOVE WS-SAVEMSTINST TO RPXXX06-KEY-INST.                     00560000
005610     MOVE WS-SAVEMSTPRODCODE TO RPXXX06-KEY-PRODCODE.             00561000
005620     MOVE WS-SAVEMSTACCOUNT TO RPXXX06-KEY-ACCOUNT.               00562000
005630     MOVE WS-SAVEMSTMODEL TO RPXXX06-KEY-MODEL.                   00563000
005640     GO TO FDM-EXIT.                                              00564000
005650 FDM-RECORD-NOT-FOUND.                                            00565000
005660     MOVE 'Y' TO WS-ERROR.                                        00566000
005670     MOVE 500004 TO RPXXX06-MSGNBR.                               00567000
005680     GO TO FDM-EXIT.                                              00568000
005690 FDM-MULTIPLE-PRIM.                                               00569000
005700     MOVE 'Y' TO WS-ERROR.                                        00570000
005710     MOVE 500090 TO RPXXX06-MSGNBR.                               00571000
005720 FDM-EXIT.                                                        00572000
005730     EXIT.                                                        00573000
P0052 ******************************************************************00573040
P0052  READ-MICM-7100 SECTION.                                          00573080
P0052  RM7100-START.                                                    00573120
P0052      MOVE SPACES TO WS-FUNCTION.                                  00573160
P0052      MOVE SPACES TO MI7100-RECORD.                                00573200
P0052      MOVE RPXXX06-KEY-INST TO MIM-7100KINST.                      00573240
P0052  RM7100-LOOP.                                                     00573280
P0052      MOVE +7100 TO MIM-7100KREC.                                  00573320
P0052      MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    00573360
P0052      MOVE MI7100-RECORD TO MIMST-RECORD.                          00573400
P0052      PERFORM MIC-MST-GET-REQUEST.                                 00573440
P0052      MOVE MIMST-RECORD TO MI7100-RECORD.                          00573480
P0052      IF WS-FUNCTION IS EQUAL TO 'N'                               00573520
P0052          AND MIM-7100KINST IS GREATER THAN ZEROS                  00573560
P0052          GO TO RM7100-ZERO.                                       00573600
P0052      GO TO RM7100-EXIT.                                           00573640
P0052  RM7100-ZERO.                                                     00573680
P0052      MOVE SPACES TO MI7100-RECORD.                                00573720
P0052      MOVE ZEROS TO MIM-7100KINST.                                 00573760
P0052      GO TO RM7100-LOOP.                                           00573800
P0052  RM7100-EXIT.                                                     00573840
P0052      EXIT.                                                        00573880
005740******************************************************************00574000
000000 COPY RPPIDXA.                                                    00575000
005760******************************************************************00576000
000000 COPY RPPQUAA.                                                    00577000
005780******************************************************************00578000
000000 COPY RPPRELA.                                                    00579000
005800******************************************************************00580000
005810 MIC-MST-API SECTION.                                             00581000
000000 COPY MIPMSTA.                                                    00582000
005830******************************************************************00583000
005840 SLP096-GET-2023-RECORD SECTION.                                  00584000
000000 COPY SLP096.                                                     00585000
005860******************************************************************00586000
005870 OPERATOR-DIALOG-SECURITY SECTION.                                00587000
000000 COPY SRP079.                                                     00588000
005890******************************************************************00589000
005900 CICS-ABORT-EXIT SECTION.                                         00590000
005910 CAE-START.                                                       00591000
005920     GO TO CICS-RETURN.                                           00592000
005930 CAE-EXIT.                                                        00593000
005940     EXIT.                                                        00594000
005950******************************************************************00595000
005960 CICS-RETURN SECTION.                                             00596000
005970     IF COM-ABORT IS NOT EQUAL TO ZERO                            00597000
005980         MOVE COM-ABORT TO RPXXX06-ABORT.                         00598000
005990     IF RPXXX06-ABORT IS NOT EQUAL TO ZERO                        00599000
006000         AND WS-UPDATESW IS EQUAL TO 'Y'                          00600000
006010         MOVE 'Y' TO RPXXX06-ABTYPE.                              00601000
006020     IF RPXXX06-ABORT IS NOT EQUAL TO ZERO                        00602000
006030         MOVE WS-FUNCTION TO RPXXX06-FUNCTION                     00603000
006040         MOVE SRB-BMDB TO RPXXX06-SRBMDB                          00604000
006050         MOVE EIBFN TO RPXXX06-ABEIBFN                            00605000
006060         MOVE EIBRESP TO RPXXX06-ABEIBRESP                        00606000
006070         MOVE EIBRESP2 TO RPXXX06-ABEIBRESP2                      00607000
006080         MOVE EIBRCODE TO RPXXX06-ABEIBRCODE.                     00608000
006090     IF RPXXX06-ABTYPE IS NOT EQUAL TO 'Y'                        00609000
006100         PERFORM GLOBAL-CLOSE.                                    00610000
000000 COPY SLP709.                                                     00611000
006120******************************************************************00612000
006130 GLOBAL-CLOSE SECTION.                                            00613000
006140 GC-START.                                                        00614000
006150     IF RPXXX06-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  00615000
006160         PERFORM RPS-QUA-GLOBAL-CLOSE-REQUEST.                    00616000
006170 GC-EXIT.                                                         00617000
006180     EXIT.                                                        00618000
006190******************************************************************00619000
