000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX04.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX04 - OUTSIDE RELATIONSHIP MODULE                      *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160 01  SRW000-AREAS.                                                00016000
000000 COPY SRW000.                                                     00017000
000180 01  SRW009-AREAS.                                                00018000
000000 COPY SRW009.                                                     00019000
000200 01  SRW079-AREAS.                                                00020000
000000 COPY SRW079.                                                     00021000
000220 01  SRW105-AREAS.                                                00022000
000000 COPY SRW105.                                                     00023000
000240*01  BICRSRB.                                                     00024000
000000 COPY BICRSRB.                                                    00025000
000260*01  BICRPSB.                                                     00026000
000000 COPY BICRPSB.                                                    00027000
000280*01  BICRVERB.                                                    00028000
000000 COPY BICRVERB.                                                   00029000
000300*01  BICRSTAT.                                                    00030000
000000 COPY BICRSTAT.                                                   00031000
000320*01  BICRDBS.                                                     00032000
000000 COPY BICRDBS.                                                    00033000
000340*01  BICRLOG.                                                     00034000
000000 COPY BICRLOG.                                                    00035000
000360 01  SRW710-AREAS.                                                00036000
000000 COPY SRW710.                                                     00037000
000380 01  WS-WORKAREAS.                                                00038000
000390     03  WS-MAX-PANEL-ENTRIES    PIC S9(04)      COMP             00039000
000400                                                 VALUE +0010.     00040000
000410     03  COM-ABORT               PIC S9(04)      COMP.            00041000
000420     03  WS-SUB1                 PIC S9(04)      COMP             00042000
000430                                                 VALUE +0000.     00043000
000440     03  WS-SUB2                 PIC S9(04)      COMP             00044000
000450                                                 VALUE +0000.     00045000
000460     03  WS-UPDATE-RP            PIC X(01)       VALUE SPACES.    00046000
000470     03  WS-INTERFACE            PIC X(01)       VALUE SPACES.    00047000
000480     03  WS-UPDATESW             PIC X(01)       VALUE SPACES.    00048000
000490     03  WS-ERROR-INDICATOR      PIC X(01)       VALUE SPACES.    00049000
000500     03  WS-DUP-FLAG             PIC X(01)       VALUE SPACES.    00050000
000510     03  WS-ACT-FLAG             PIC X(01)       VALUE SPACES.    00051000
000520     03  WS-PRODCODE             PIC X(06)       VALUE SPACES.    00052000
000530     03  WS-SAVE-PRODCODE        PIC X(06)       VALUE SPACES.    00053000
000540     03  WS-BRANCH               PIC 9(05)       VALUE ZEROS.     00054000
000550     03  WS-ACCT-TYPE            PIC 9(03)       VALUE ZEROS.     00055000
000560     03  WS-SAVE-ACCT-TYPE       PIC 9(03)       VALUE ZEROS.     00056000
000570     03  WS-2023RPOPTION         PIC X(01)       VALUE SPACES.    00057000
000580     03  WS-7102-FLAG            PIC X(01)       VALUE SPACES.    00058000
000590     03  WS-7102-DEF-FLAG        PIC X(01)       VALUE 'N'.       00059000
000600     03  WS-7102-DEF-RECORD      PIC X(125)      VALUE SPACES.    00060000
000610     03  WS-INF-KEY.                                              00061000
000620         05  WS-INF-GRP-KEY.                                      00062000
000630             07  WS-INF-INST     PIC 9(04).                       00063000
000640             07  WS-INF-ACCOUNT  PIC 9(18).                       00064000
000650         05  WS-INF-APPL-INFO.                                    00065000
000660             07  WS-INF-PRODCODE PIC X(06).                       00066000
000670             07  WS-INF-APPLR    PIC 9(02).                       00067000
000680     03  WS-IDNBR-GRP            PIC 9(18)       VALUE ZERO.      00068000
000690     03  FILLER          REDEFINES WS-IDNBR-GRP.                  00069000
000700         05  WS-IDNBR-DATE       PIC 9(08).                       00070000
000710         05  WS-IDNBR-TIME       PIC 9(06).                       00071000
000720         05  WS-IDNBR-SEQ        PIC 9(04).                       00072000
000730     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00073000
000740     03  FILLER          REDEFINES WS-CURDATE.                    00074000
000750         05  WS-CURMM            PIC 9(02).                       00075000
000760         05  WS-CURDD            PIC 9(02).                       00076000
000770         05  WS-CURYYYY          PIC 9(04).                       00077000
000780     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00078000
000790     03  FILLER          REDEFINES WS-PDATE.                      00079000
000800         05  WS-PDATE-YYYY       PIC 9(04).                       00080000
000810         05  WS-PDATE-MM         PIC 9(02).                       00081000
000820         05  WS-PDATE-DD         PIC 9(02).                       00082000
000830     03  WS-PDATE2               PIC 9(08)       VALUE ZERO.      00083000
000840     03  FILLER          REDEFINES WS-PDATE2.                     00084000
000850         05  WS-PDATE2-YYYY      PIC 9(04).                       00085000
000860         05  WS-PDATE2-MM        PIC 9(02).                       00086000
000870         05  WS-PDATE2-DD        PIC 9(02).                       00087000
000880     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00088000
000890                                                 VALUE ZERO.      00089000
000900     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00090000
000910                                                 VALUE ZERO.      00091000
000920     03  WS-LAST-GOOD-INST       PIC 9(04)       VALUE ZEROES.    00092000
000930     03  WS-LAST-INST-TRIED      PIC 9(04)       VALUE ZEROES.    00093000
000940     03  WS-SAVEMASTERGROUP.                                      00094000
000950         05  WS-SAVEMSTINST      PIC 9(04).                       00095000
000960         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00096000
000970         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00097000
000980         05  WS-SAVEMSTMODEL     PIC X(10).                       00098000
000990     03  WS-IDNUMBER             PIC X(18)       VALUE ZEROES.    00099000
001000*----------------------------------------------------------------*00100000
001010 01  MIWPRI-AREAS.                                                00101000
000000 COPY MIWPRI.                                                     00102000
001030 01  MIWMSTA-AREAS.                                               00103000
000000 COPY MIWMSTA.                                                    00104000
001050 01  MIMST-RECORD.                                                00105000
000000 COPY MISMST.                                                     00106000
001070 01  MI0237-RECORD.                                               00107000
000000 COPY MIS0237A.                                                   00108000
001090 01  MI2023-RECORD.                                               00109000
000000 COPY MIS2023A.                                                   00110000
001110 01  MI2024-RECORD.                                               00111000
000000 COPY MIS2024A.                                                   00112000
001130 01  MI7100-RECORD.                                               00113000
000000 COPY MIS7100.                                                    00114000
001150 01  MI7101-RECORD.                                               00115000
000000 COPY MIS7101.                                                    00116000
001170 01  MI7102-RECORD.                                               00117000
000000 COPY MIS7102.                                                    00118000
001190*----------------------------------------------------------------*00119000
001200 01  RPWPRI-AREAS.                                                00120000
000000 COPY RPWPRI.                                                     00121000
001220 01  RPWACT-AREA.                                                 00122000
000000 COPY RPWACTA.                                                    00123000
001240 01  RPACT-RECORD.                                                00124000
000000 COPY RPSACT.                                                     00125000
001260 01  RPWEVT-AREA.                                                 00126000
000000 COPY RPWEVTA.                                                    00127000
001280 01  RPEVT-RECORD.                                                00128000
000000 COPY RPSEVT.                                                     00129000
001300 01  RPWIDX-AREA.                                                 00130000
000000 COPY RPWIDXA.                                                    00131000
001320 01  RPIDX-RECORD.                                                00132000
000000 COPY RPSIDX.                                                     00133000
001340 01  RPWMST-AREA.                                                 00134000
000000 COPY RPWMSTA.                                                    00135000
001360 01  RPMST-RECORD.                                                00136000
000000 COPY RPSMST.                                                     00137000
001380 01  RPWQUA-AREA.                                                 00138000
000000 COPY RPWQUAA.                                                    00139000
001400 01  RPQUA-RECORD.                                                00140000
000000 COPY RPSQUA.                                                     00141000
001420 01  RPWREL-AREA.                                                 00142000
000000 COPY RPWRELA.                                                    00143000
001440 01  RPREL-RECORD.                                                00144000
000000 COPY RPSREL.                                                     00145000
001460 01  RPWSEC-AREA.                                                 00146000
000000 COPY RPWSECA.                                                    00147000
001480 01  RPSEC-RECORD.                                                00148000
000000 COPY RPSSEC.                                                     00149000
001500*----------------------------------------------------------------*00150000
001510 01  RPRF21-MESSAGE.                                              00151000
000000 COPY MISCNT00      REPLACING                                     00152000
001530             ==:MICNT:== BY ==RPRF21==.                           00153000
000000 COPY RPSRF21.                                                    00154000
001550*----------------------------------------------------------------*00155000
001560 01  RPINF00-MESSAGE.                                             00156000
000000 COPY MISCNT00      REPLACING                                     00157000
001580             ==:MICNT:== BY ==RPINF00==.                          00158000
000000 COPY RPSINF00.                                                   00159000
001600*----------------------------------------------------------------*00160000
001610 01  RPUSER-MESSAGE.                                              00161000
000000 COPY MISCNT00      REPLACING                                     00162000
001630     ==:MICNT:== BY ==RPUSER==.                                   00163000
000000 COPY RPWUSER.                                                    00164000
001650******************************************************************00165000
001660 01  WS-TRACECODES.                                               00166000
001670     03  WS-TR0001               PIC S9(04)      COMP             00167000
001680                                                 VALUE +0001.     00168000
001690     03  WS-TR0002               PIC S9(04)      COMP             00169000
001700                                                 VALUE +0002.     00170000
001710     03  WS-TR0003               PIC S9(04)      COMP             00171000
001720                                                 VALUE +0003.     00172000
001730     03  WS-TR0004               PIC S9(04)      COMP             00173000
001740                                                 VALUE +0004.     00174000
001750     03  WS-TR0005               PIC S9(04)      COMP             00175000
001760                                                 VALUE +0005.     00176000
001770     03  WS-TR0006               PIC S9(04)      COMP             00177000
001780                                                 VALUE +0006.     00178000
001790     03  WS-TR0007               PIC S9(04)      COMP             00179000
001800                                                 VALUE +0007.     00180000
001810     03  WS-TR0008               PIC S9(04)      COMP             00181000
001820                                                 VALUE +0008.     00182000
001830     03  WS-TR0009               PIC S9(04)      COMP             00183000
001840                                                 VALUE +0009.     00184000
001850     03  WS-TR0010               PIC S9(04)      COMP             00185000
001860                                                 VALUE +0010.     00186000
001870     03  WS-TR0011               PIC S9(04)      COMP             00187000
001880                                                 VALUE +0011.     00188000
001890     03  WS-TR0012               PIC S9(04)      COMP             00189000
001900                                                 VALUE +0012.     00190000
001910     03  WS-TR0013               PIC S9(04)      COMP             00191000
001920                                                 VALUE +0013.     00192000
001930     03  WS-TR0014               PIC S9(04)      COMP             00193000
001940                                                 VALUE +0014.     00194000
001950     03  WS-TR0015               PIC S9(04)      COMP             00195000
001960                                                 VALUE +0015.     00196000
001970     03  WS-TR0016               PIC S9(04)      COMP             00197000
001980                                                 VALUE +0016.     00198000
001990     03  WS-TR0017               PIC S9(04)      COMP             00199000
002000                                                 VALUE +0017.     00200000
002010     03  WS-TR0018               PIC S9(04)      COMP             00201000
002020                                                 VALUE +0018.     00202000
002030     03  WS-TR0019               PIC S9(04)      COMP             00203000
002040                                                 VALUE +0019.     00204000
002050     03  WS-TR0020               PIC S9(04)      COMP             00205000
002060                                                 VALUE +0020.     00206000
002070     03  WS-TR0021               PIC S9(04)      COMP             00207000
002080                                                 VALUE +0021.     00208000
002090     03  WS-TR0022               PIC S9(04)      COMP             00209000
002100                                                 VALUE +0022.     00210000
002110     03  WS-TR0023               PIC S9(04)      COMP             00211000
002120                                                 VALUE +0023.     00212000
002130     03  WS-TR0024               PIC S9(04)      COMP             00213000
002140                                                 VALUE +0024.     00214000
002150     03  WS-TR0025               PIC S9(04)      COMP             00215000
002160                                                 VALUE +0025.     00216000
002170     03  WS-TR0026               PIC S9(04)      COMP             00217000
002180                                                 VALUE +0026.     00218000
002190     03  WS-TR0027               PIC S9(04)      COMP             00219000
002200                                                 VALUE +0027.     00220000
002210     03  WS-TR0028               PIC S9(04)      COMP             00221000
002220                                                 VALUE +0028.     00222000
002230     03  WS-TR0029               PIC S9(04)      COMP             00223000
002240                                                 VALUE +0029.     00224000
002250     03  WS-TR0030               PIC S9(04)      COMP             00225000
002260                                                 VALUE +0030.     00226000
002270     03  WS-TR0031               PIC S9(04)      COMP             00227000
002280                                                 VALUE +0031.     00228000
002290 01  WS-ABORTCODES.                                               00229000
002300     03  WS-AB0009               PIC S9(04)      COMP             00230000
002310                                                 VALUE +0009.     00231000
002320     03  WS-AB2000               PIC S9(04)      COMP             00232000
002330                                                 VALUE +2000.     00233000
002340     03  WS-AB2033               PIC S9(04)      COMP             00234000
002350                                                 VALUE +2033.     00235000
002360     03  WS-AB3051               PIC S9(04)      COMP             00236000
002370                                                 VALUE +3051.     00237000
002380     03  WS-AB6300               PIC S9(04)      COMP             00238000
002390                                                 VALUE +6300.     00239000
002400     03  WS-AB6310               PIC S9(04)      COMP             00240000
002410                                                 VALUE +6310.     00241000
002420     03  WS-AB6320               PIC S9(04)      COMP             00242000
002430                                                 VALUE +6320.     00243000
002440     03  WS-AB6325               PIC S9(04)      COMP             00244000
002450                                                 VALUE +6325.     00245000
002460     03  WS-AB6330               PIC S9(04)      COMP             00246000
002470                                                 VALUE +6330.     00247000
002480     03  WS-AB6335               PIC S9(04)      COMP             00248000
002490                                                 VALUE +6335.     00249000
002500     03  WS-AB6360               PIC S9(04)      COMP             00250000
002510                                                 VALUE +6360.     00251000
002520******************************************************************00252000
002530 01  SLW096-AREAS.                                                00253000
000000 COPY SLW096.                                                     00254000
002550 01  SLS140-RECORD.                                               00255000
000000 COPY SLS140.                                                     00256000
002570******************************************************************00257000
002580 LINKAGE SECTION.                                                 00258000
002590 01  DFHCOMMAREA.                                                 00259000
000000 COPY MISCNT00      REPLACING                                     00260000
002610             ==:MICNT:== BY ==RPXXX04==.                          00261000
000000 COPY RPSXXX04.                                                   00262000
002630*01  SLW096-2023RECORDS.                                          00263000
000000 COPY SLW096L.                                                    00264000
002650******************************************************************00265000
002660 PROCEDURE DIVISION.                                              00266000
002670******************************************************************00267000
002680 ENTRY-ROUTINE SECTION.                                           00268000
002690 ER-START.                                                        00269000
002700     MOVE 'RPLXXX04' TO SR-APIPROGLIT.                            00270000
002710     MOVE 'RPLXXX04' TO RPXXX04-ABPROGID.                         00271000
002720     PERFORM CICS-HANDLE-CONDITION.                               00272000
002730     IF EIBCALEN IS EQUAL TO +0                                   00273000
002740         MOVE WS-AB2000 TO RPXXX04-ABORT                          00274000
002750         MOVE WS-TR0001 TO RPXXX04-ABTRACE                        00275000
002760         GO TO CICS-RETURN.                                       00276000
002770     MOVE ZERO TO RPXXX04-MSGNBR.                                 00277000
002780     MOVE SPACE TO WS-FUNCTION.                                   00278000
002790     MOVE RPXXX04-FILEOPTS TO WS-FILEOPTS.                        00279000
002800     MOVE RPXXX04-OPERID TO WS-UPD-USER.                          00280000
002810     MOVE RPXXX04-EXTERNALID TO LOG-PANELID.                      00281000
002820     MOVE RPXXX04-TERMID TO LOG-TERMID.                           00282000
002830     MOVE RPXXX04-WORKID TO LOG-WORKID.                           00283000
002840     MOVE RPXXX04-TRANSTART TO LOG-TRANSTART.                     00284000
002850     MOVE RPXXX04-APPLSEQ TO LOG-APPLSEQ.                         00285000
000000 COPY SLP094.                                                     00286000
002870     GO TO VERIFY-KEY.                                            00287000
002880 ER-EXIT.                                                         00288000
002890     EXIT.                                                        00289000
002900******************************************************************00290000
002910 CICS-HANDLE-CONDITION SECTION.                                   00291000
000000 COPY SLP702.                                                     00292000
002930     MOVE WS-AB2033 TO RPXXX04-ABORT.                             00293000
002940     MOVE WS-TR0002 TO RPXXX04-ABTRACE.                           00294000
002950     GO TO CICS-RETURN.                                           00295000
002960 CHC-EXIT.                                                        00296000
002970     EXIT.                                                        00297000
002980******************************************************************00298000
002990 VERIFY-KEY SECTION.                                              00299000
003000 VK-START.                                                        00300000
003010     MOVE ZERO TO COM-ABORT.                                      00301000
003020     MOVE ZERO TO RPXXX04-ABORT.                                  00302000
003030     MOVE ZERO TO RPXXX04-MSGNBR.                                 00303000
003040     MOVE ZERO TO WS-MSGNBR.                                      00304000
003050     MOVE SPACES TO RPXXX04-FUNCTION.                             00305000
003060     MOVE RPXXX04-DATE TO WS-CURDATE.                             00306000
003070     MOVE WS-CURMM TO WS-PDATE-MM.                                00307000
003080     MOVE WS-CURDD TO WS-PDATE-DD.                                00308000
003090     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00309000
003100     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00310000
003110 VK-SECURITY.                                                     00311000
003120     IF RPXXX04-APIFUNC IS NOT EQUAL TO 'VKL'                     00312000
003130         GO TO VK-2023-LOAD.                                      00313000
003140     MOVE RPXXX04-UPDATE TO SR-OPDUPDATE.                         00314000
003150     MOVE RPXXX04-KEY-INST TO SR-OPDINST.                         00315000
003160     MOVE RPXXX04-OPERID TO SR-OPDOPERID.                         00316000
003170     MOVE RPXXX04-MODELID TO SR-OPDMODELID.                       00317000
003180     MOVE RPXXX04-EXTERNALID TO SR-OPDTRANCODE.                   00318000
003190     MOVE RPXXX04-APPL TO SR-OPDAPPL.                             00319000
003200     MOVE RPXXX04-SECALT TO SR-OPDSECALT.                         00320000
003210     MOVE 'N' TO SR-OPDFUNC.                                      00321000
003220     PERFORM OPERATOR-DIALOG-SECURITY.                            00322000
003230     MOVE SR-OPDUPDATE TO RPXXX04-UPDATE.                         00323000
003240     IF SR-OPDMSGNBR IS NOT EQUAL TO ZEROS                        00324000
003250         MOVE SR-OPDMSGNBR TO RPXXX04-MSGNBR                      00325000
003260         GO TO VK-RETURN.                                         00326000
003270 VK-RECTYPE.                                                      00327000
003280 VK-2023-LOAD.                                                    00328000
003290     MOVE ZERO TO WS-SUB1.                                        00329000
003300     MOVE RPXXX04-KEY-INST TO MIM-2023KINST.                      00330000
003310     MOVE 'RP' TO MIM-2023KPRODCODE.                              00331000
003320     MOVE RPXXX04-INST-OPT-1 TO SLW096-BANKS.                     00332000
003330     PERFORM SLP096-GET-2023-RECORD.                              00333000
003340     IF SLW096-FUNCTION IS EQUAL TO SPACES                        00334000
003350         MOVE MIM-2023KPRODCODE TO RPXXX04-RP-PRODCODE            00335000
003360         GO TO VK-IDX.                                            00336000
003370 VK-PRODCD-LOOP.                                                  00337000
003380     ADD +1 TO WS-SUB1.                                           00338000
003390     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00339000
003400         MOVE 500033 TO RPXXX04-MSGNBR                            00340000
003410         GO TO VK-RETURN.                                         00341000
003420     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00342000
003430         IS NOT EQUAL TO RPXXX04-APPL                             00343000
003440         GO TO VK-PRODCD-LOOP.                                    00344000
003450     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO RPXXX04-RP-PRODCODE.  00345000
003460 VK-IDX.                                                          00346000
003470     INITIALIZE RPIDX-RECORD.                                     00347000
003480     IF RPXXX04-APIFUNC IS NOT EQUAL TO 'VKL'                     00348000
003490         GO TO VK-7100.                                           00349000
003500     IF RPXXX04-KEY-IDNUMBER IS NOT GREATER THAN ZEROS            00350000
003510         OR RPXXX04-KEY-IDNUMBER IS NOT NUMERIC                   00351000
003520         GO TO VK-MST.                                            00352000
003530     MOVE RPXXX04-KEY-INST TO RPIDX-INST.                         00353000
003540     MOVE RPXXX04-RP-PRODCODE TO RPIDX-PRODCODE.                  00354000
003550     MOVE RPXXX04-KEY-IDNUMBER TO RPIDX-IDNUMBER.                 00355000
003560     PERFORM RPS-IDX-GET-REQUEST.                                 00356000
003570     IF WS-FUNCTION IS EQUAL TO 'N'                               00357000
003580         MOVE 500004 TO RPXXX04-MSGNBR                            00358000
003590         GO TO VK-RETURN.                                         00359000
003600     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00360000
003610         MOVE WS-AB6310 TO RPXXX04-ABORT                          00361000
003620         MOVE WS-TR0003 TO RPXXX04-ABTRACE                        00362000
003630         GO TO VK-RETURN.                                         00363000
003640     MOVE RPIDX-ACCT2-KEY TO RPXXX04-KEY-RECORD.                  00364000
003650     MOVE ZEROS TO RPXXX04-KEY-IDNUMBER.                          00365000
003660 VK-MST.                                                          00366000
003670     IF RPXXX04-KEY-MODEL IS EQUAL TO SPACES OR                   00367000
003680         RPXXX04-KEY-MODEL IS EQUAL TO LOW-VALUES                 00368000
003690         PERFORM FIND-DEFAULT-MODEL.                              00369000
003700     IF WS-ERROR IS EQUAL TO 'Y'                                  00370000
003710         GO TO VK-RETURN.                                         00371000
003720     INITIALIZE RPMST-RECORD.                                     00372000
003730     MOVE RPXXX04-KEY-RECORD TO RPMST-GRP-KEY.                    00373000
003740     PERFORM RPS-MST-GET-REQUEST.                                 00374000
003750     IF WS-FUNCTION IS EQUAL TO 'N'                               00375000
003760         AND RPIDX-IDNUMBER IS GREATER THAN SPACES                00376000
003770         MOVE 500022 TO RPXXX04-MSGNBR                            00377000
003780         GO TO VK-RETURN.                                         00378000
003790     IF WS-FUNCTION IS EQUAL TO 'N'                               00379000
003800         MOVE 'N' TO RPXXX04-FUNC                                 00380000
003810         GO TO VK-2023.                                           00381000
003820     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00382000
003830         MOVE WS-AB6320 TO RPXXX04-ABORT                          00383000
003840         MOVE WS-TR0004 TO RPXXX04-ABTRACE                        00384000
003850         GO TO VK-RETURN.                                         00385000
003860     MOVE 'M' TO RPXXX04-FUNC.                                    00386000
003870     MOVE RPMST-IDNUMBER TO RPXXX04-IDNUMBER.                     00387000
003880     MOVE RPMST-MODEL TO RPXXX04-KEY-MODEL.                       00388000
003890     MOVE ZEROS TO RPXXX04-KEY-ACCT-TYPE.                         00389000
003900     MOVE ZEROS TO RPXXX04-KEY-BRANCH.                            00390000
003910     GO TO VK-7100.                                               00391000
003920 VK-2023.                                                         00392000
003930     MOVE RPXXX04-KEY-PRODCODE TO WS-PRODCODE.                    00393000
003940     PERFORM READ-MICM-2023.                                      00394000
003950     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00395000
003960         MOVE 500001 TO RPXXX04-MSGNBR                            00396000
003970         GO TO VK-RETURN.                                         00397000
003980     IF MIM-2023RPOPTION IS EQUAL TO ' '                          00398000
003990         OR MIM-2023RPOPTION IS EQUAL TO 'N'                      00399000
004000         MOVE 500015 TO RPXXX04-MSGNBR                            00400000
004010         GO TO VK-RETURN.                                         00401000
004020     MOVE MIM-2023INTAPPL211 TO RPXXX04-KEY-APPL.                 00402000
004030 VK-7100.                                                         00403000
004040     PERFORM READ-MICM-7100.                                      00404000
004050     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00405000
004060         MOVE 500005 TO RPXXX04-MSGNBR                            00406000
004070         GO TO VK-RETURN.                                         00407000
004080 VK-7101.                                                         00408000
004090     PERFORM READ-MICM-7101.                                      00409000
004100     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00410000
004110         MOVE 500006 TO RPXXX04-MSGNBR                            00411000
004120         GO TO VK-RETURN.                                         00412000
004130     IF RPXXX04-APIFUNC IS NOT EQUAL TO 'VKL'                     00413000
004140         GO TO VK-EXIT.                                           00414000
004150     IF MIM-7101ACTCD IS EQUAL TO 'I'                             00415000
004160         MOVE 500017 TO RPXXX04-MSGNBR                            00416000
004170         GO TO VK-RETURN.                                         00417000
004180     IF MIM-7101EXPDT IS NOT GREATER THAN WS-CURDT-YYYYMMDD       00418000
004190         AND MIM-7101EXPDT IS GREATER THAN ZEROS                  00419000
004200         MOVE 500018 TO RPXXX04-MSGNBR                            00420000
004210         GO TO VK-RETURN.                                         00421000
004220     IF MIM-7101CLOSEDT IS LESS THAN WS-CURDT-YYYYMMDD            00422000
004230         AND MIM-7101CLOSEDT IS GREATER THAN ZEROS                00423000
004240         MOVE 500019 TO RPXXX04-MSGNBR                            00424000
004250         GO TO VK-RETURN.                                         00425000
004260     MOVE MIM-7101KMODEL TO RPXXX04-KEY-MODEL.                    00426000
004270     MOVE MIM-7101DESC TO RPXXX04-MODEL-DESC.                     00427000
004280 VK-NAME.                                                         00428000
004290     MOVE 'A' TO RPRF21-FUNC.                                     00429000
004300     MOVE RPXXX04-KEY-INST TO RPRF21-BASE-ACCT-INST.              00430000
004310     MOVE RPXXX04-KEY-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.      00431000
004320     MOVE RPXXX04-KEY-ACCOUNT TO RPRF21-BASE-ACCT.                00432000
004330     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00433000
004340         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00434000
004350         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00435000
004360     PERFORM REQUEST-CUSTOMER.                                    00436000
004370     IF WS-FUNCTION IS EQUAL TO SPACES                            00437000
004380         GO TO VK-RP-CHECK.                                       00438000
004390     MOVE WS-MSGNBR TO RPXXX04-MSGNBR.                            00439000
004400     IF RPXXX04-MSGNBR IS EQUAL TO ZEROS                          00440000
004410         MOVE 500016 TO RPXXX04-MSGNBR.                           00441000
004420     GO TO VK-RETURN.                                             00442000
004430 VK-RP-CHECK.                                                     00443000
004440     MOVE RPRF21-BASE-CUST-TYPE TO RPXXX04-CUST-TYPE.             00444000
004450     MOVE RPRF21-NAME TO RPXXX04-CUST-NAME.                       00445000
004460     IF RPXXX04-FUNC IS EQUAL TO 'M'                              00446000
004470         GO TO VK-EXIT.                                           00447000
004480     IF MIM-7100CUSTLIMITOPT IS NOT EQUAL TO 'Y'                  00448000
004490         GO TO VK-ACT.                                            00449000
004500     MOVE ZERO TO WS-SUB1.                                        00450000
004510     IF RPXXX04-RP-PRODCODE IS GREATER THAN SPACES                00451000
004520         GO TO VK-RP-CONT.                                        00452000
004530 VK-RP-LOOP.                                                      00453000
004540     ADD +1 TO WS-SUB1.                                           00454000
004550     IF WS-SUB1 IS GREATER THAN SLW096-2023-COUNT                 00455000
004560         MOVE 500033 TO RPXXX04-MSGNBR                            00456000
004570         GO TO VK-RETURN.                                         00457000
004580     IF SLW096-2023INTAPPL211 (WS-SUB1)                           00458000
004590         IS NOT EQUAL TO RPXXX04-APPL                             00459000
004600         GO TO VK-RP-LOOP.                                        00460000
004610     MOVE SLW096-2023KPRODCODE (WS-SUB1) TO RPXXX04-RP-PRODCODE.  00461000
004620 VK-RP-CONT.                                                      00462000
004630     MOVE 'D' TO RPRF21-FUNC.                                     00463000
004640     MOVE RPXXX04-KEY-INST TO RPRF21-BASE-ACCT-INST.              00464000
004650     MOVE RPXXX04-RP-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.       00465000
004660     MOVE SPACES TO RPRF21-BASE-ACCT.                             00466000
004670     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00467000
004680         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00468000
004690         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00469000
004700     PERFORM REQUEST-CUSTOMER.                                    00470000
004710     IF WS-FUNCTION IS EQUAL TO SPACES                            00471000
004720         MOVE RPXXX04-KEY-INST TO RPRF21-BASE-ACCT-INST           00472000
004730         MOVE RPXXX04-KEY-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE   00473000
004740         MOVE RPXXX04-KEY-ACCOUNT TO RPRF21-BASE-ACCT             00474000
004750         GO TO VK-ACT.                                            00475000
004760     MOVE WS-MSGNBR TO RPXXX04-MSGNBR.                            00476000
004770     IF RPXXX04-MSGNBR IS EQUAL TO ZEROS                          00477000
004780         MOVE 500020 TO RPXXX04-MSGNBR.                           00478000
004790     GO TO VK-RETURN.                                             00479000
004800 VK-ACT.                                                          00480000
004810     INITIALIZE RPACT-RECORD.                                     00481000
004820     MOVE SPACE TO WS-ACT-FLAG.                                   00482000
004830     MOVE RPXXX04-KEY-RECORD TO RPACT-GRP-KEY.                    00483000
004840     PERFORM RPS-ACT-GET-GE-REQUEST.                              00484000
004850     GO TO VK-ACT-CONT.                                           00485000
004860 VK-ACT-NEXT.                                                     00486000
004870     PERFORM RPS-ACT-GET-NEXT-REQUEST.                            00487000
004880 VK-ACT-CONT.                                                     00488000
004890     IF WS-FUNCTION IS EQUAL TO 'E'                               00489000
004900         GO TO VK-QUA-ACCT.                                       00490000
004910     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00491000
004920         MOVE WS-AB6300 TO RPXXX04-ABORT                          00492000
004930         MOVE WS-TR0005 TO RPXXX04-ABTRACE                        00493000
004940         GO TO CICS-ABORT-EXIT.                                   00494000
004950     IF RPXXX04-KEY-INST IS NOT EQUAL TO RPACT-INST               00495000
004960         OR RPXXX04-KEY-PRODCODE IS NOT EQUAL TO RPACT-PRODCODE   00496000
004970         OR RPXXX04-KEY-ACCOUNT IS NOT EQUAL TO RPACT-ACCOUNT     00497000
004980         GO TO VK-QUA-ACCT.                                       00498000
004990     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      00499000
005000         MOVE 500021 TO RPXXX04-MSGNBR                            00500000
005010         GO TO VK-RETURN.                                         00501000
005020     GO TO VK-ACT-NEXT.                                           00502000
005030 VK-QUA-ACCT.                                                     00503000
005040     INITIALIZE RPQUA-RECORD.                                     00504000
005050     MOVE RPXXX04-KEY-RECORD TO RPQUA-GRP-KEY.                    00505000
005060     MOVE LOW-VALUES TO RPQUA-MODEL.                              00506000
005070     PERFORM RPS-QUA-GET-GE-REQUEST.                              00507000
005080     GO TO VK-QUA-ACCT-CONT.                                      00508000
005090 VK-QUA-ACCT-NEXT.                                                00509000
005100     PERFORM RPS-QUA-GET-NEXT-REQUEST.                            00510000
005110 VK-QUA-ACCT-CONT.                                                00511000
005120     IF WS-FUNCTION IS EQUAL TO 'E'                               00512000
005130         GO TO VK-QUA-CUST.                                       00513000
005140     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00514000
005150         MOVE WS-AB6325 TO RPXXX04-ABORT                          00515000
005160         MOVE WS-TR0006 TO RPXXX04-ABTRACE                        00516000
005170         GO TO CICS-ABORT-EXIT.                                   00517000
005180     IF RPXXX04-KEY-INST IS NOT EQUAL TO RPQUA-INST               00518000
005190         OR RPXXX04-KEY-PRODCODE IS NOT EQUAL TO RPQUA-PRODCODE   00519000
005200         OR RPXXX04-KEY-ACCOUNT IS NOT EQUAL TO RPQUA-ACCOUNT     00520000
005210         GO TO VK-QUA-CUST.                                       00521000
005220     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      00522000
005230         OR RPXXX04-KEY-MODEL IS EQUAL TO RPQUA-MODEL             00523000
005240         MOVE 500022 TO RPXXX04-MSGNBR                            00524000
005250         GO TO VK-RETURN.                                         00525000
005260     GO TO VK-QUA-ACCT-NEXT.                                      00526000
005270 VK-QUA-CUST.                                                     00527000
005280     IF MIM-7100CUSTLIMITOPT IS NOT EQUAL TO 'Y'                  00528000
005290         GO TO VK-INTERFACE.                                      00529000
005300     INITIALIZE RPQUA-RECORD.                                     00530000
005310     MOVE RPXXX04-KEY-INST TO RPQUA-INST.                         00531000
005320     PERFORM RPS-QUA-GET-GE-REQUEST.                              00532000
005330     GO TO VK-QUA-CHECK.                                          00533000
005340 VK-QUA-NEXT.                                                     00534000
005350     PERFORM RPS-QUA-GET-NEXT-REQUEST.                            00535000
005360 VK-QUA-CHECK.                                                    00536000
005370     IF WS-FUNCTION IS EQUAL TO 'E'                               00537000
005380         GO TO VK-INTERFACE.                                      00538000
005390     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00539000
005400         MOVE WS-AB6325 TO RPXXX04-ABORT                          00540000
005410         MOVE WS-TR0007 TO RPXXX04-ABTRACE                        00541000
005420         GO TO VK-RETURN.                                         00542000
005430     IF RPQUA-INST IS NOT EQUAL TO RPXXX04-KEY-INST               00543000
005440         GO TO VK-INTERFACE.                                      00544000
005450     IF RPQUA-RCIF-KEY IS NOT EQUAL TO RPRF21-BASE-CUSTOMER       00545000
005460         GO TO VK-QUA-NEXT.                                       00546000
005470     MOVE 500023 TO RPXXX04-MSGNBR.                               00547000
005480     GO TO VK-RETURN.                                             00548000
005490 VK-INTERFACE.                                                    00549000
005500     MOVE 'N' TO WS-INTERFACE.                                    00550000
005510     MOVE SPACES TO RPINF00-MESSAGE.                              00551000
005520     IF MIM-2023RPOPTION IS NOT EQUAL TO 'Y'                      00552000
005530         MOVE ZEROS TO RPXXX04-KEY-BRANCH                         00553000
005540         MOVE ZEROS TO RPXXX04-KEY-ACCT-TYPE                      00554000
005550         GO TO VK-7102.                                           00555000
005560     PERFORM READ-MICM-0237.                                      00556000
005570     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00557000
005580         OR MIM-237OLINTFC IS NOT GREATER THAN SPACES             00558000
005590         MOVE 500024 TO RPXXX04-MSGNBR                            00559000
005600         GO TO VK-RETURN.                                         00560000
005610     MOVE RPXXX04-KEY-INST TO WS-INF-INST.                        00561000
005620     MOVE RPXXX04-KEY-ACCOUNT TO WS-INF-ACCOUNT.                  00562000
005630     MOVE RPXXX04-KEY-PRODCODE TO WS-INF-PRODCODE.                00563000
005640     MOVE MIM-2023INTAPPL211 TO WS-INF-APPLR.                     00564000
005650     PERFORM LINK-INTERFACE.                                      00565000
005660     MOVE WS-MSGNBR TO RPXXX04-MSGNBR.                            00566000
005670     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00567000
005680         AND RPXXX04-MSGNBR IS EQUAL TO ZEROS                     00568000
005690         MOVE 500025 TO RPXXX04-MSGNBR.                           00569000
005700     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00570000
005710         GO TO VK-RETURN.                                         00571000
005720     MOVE RPINF00-BRANCH TO RPXXX04-KEY-BRANCH.                   00572000
005730     MOVE RPINF00-ACCT-TYPE TO RPXXX04-KEY-ACCT-TYPE.             00573000
005740 VK-7102.                                                         00574000
005750     MOVE RPXXX04-KEY-BRANCH TO WS-BRANCH.                        00575000
005760     MOVE RPXXX04-KEY-ACCT-TYPE TO WS-ACCT-TYPE.                  00576000
005770     PERFORM READ-MICM-7102.                                      00577000
005780     IF WS-7102-FLAG IS EQUAL TO 'N'                              00578000
005790         MOVE 500007 TO RPXXX04-MSGNBR                            00579000
005800         GO TO VK-RETURN.                                         00580000
005810     MOVE MIM-7102PRIMSCINCOPT TO RPXXX04-KEY-INCOPT.             00581000
005820     MOVE MIM-7102PRIMRATEINCOPT TO RPXXX04-KEY-RTOPT.            00582000
005830     IF WS-ACT-FLAG IS NOT EQUAL TO 'Y'                           00583000
005840         OR MIM-7100DUPINCOPT IS EQUAL TO 'Y'                     00584000
005850         GO TO VK-USER-EXIT.                                      00585000
005860 VK-INCENTIVE.                                                    00586000
005870     IF (MIM-7102PRIMSCINCOPT IS EQUAL TO 'Y'                     00587000
005880         AND RPACT-SC-INC-OPTION IS EQUAL TO 'Y')                 00588000
005890         OR (MIM-7102PRIMRATEINCOPT IS EQUAL TO 'Y'               00589000
005900         AND RPACT-RATE-INC-OPTION IS EQUAL TO 'Y')               00590000
005910         MOVE 500027 TO RPXXX04-MSGNBR                            00591000
005920         GO TO VK-RETURN.                                         00592000
005930 VK-USER-EXIT.                                                    00593000
005940     IF MIM-7102USERRTN IS NOT EQUAL TO 'Y'                       00594000
005950         OR (MIM-7102USERRTN-Q IS NOT EQUAL TO 'B'                00595000
005960         AND MIM-7102USERRTN-Q IS NOT EQUAL TO 'E')               00596000
005970         GO TO VK-IDNUMBER.                                       00597000
005980     PERFORM USER-EXIT.                                           00598000
005990     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00599000
006000         OR RPUSER-PASSED IS NOT EQUAL TO 'Y'                     00600000
006010         MOVE 500031 TO RPXXX04-MSGNBR                            00601000
006020         GO TO VK-RETURN.                                         00602000
006030 VK-IDNUMBER.                                                     00603000
006040     PERFORM CREATE-IDNUMBER.                                     00604000
006050     GO TO VK-EXIT.                                               00605000
006060 VK-RETURN.                                                       00606000
006070     MOVE 'E' TO RPXXX04-RETURN.                                  00607000
006080     GO TO CICS-RETURN.                                           00608000
006090 VK-EXIT.                                                         00609000
006100     EXIT.                                                        00610000
006110******************************************************************00611000
006120 ROUTING-ROUTINE SECTION.                                         00612000
006130 RR-START.                                                        00613000
006140     IF RPXXX04-APIFUNC IS EQUAL TO 'VKL'                         00614000
006150         GO TO RR-CONT.                                           00615000
006160     PERFORM EDIT-MESSAGE.                                        00616000
006170     GO TO RR-END.                                                00617000
006180 RR-CONT.                                                         00618000
006190     PERFORM INITIALIZE-MSG.                                      00619000
006200 RR-END.                                                          00620000
006210     GO TO CICS-RETURN.                                           00621000
006220 RR-EXIT.                                                         00622000
006230     EXIT.                                                        00623000
006240******************************************************************00624000
006250 INITIALIZE-MSG SECTION.                                          00625000
006260 IM-START.                                                        00626000
006270     MOVE ZEROS TO RPXXX04-MSGNBR.                                00627000
006280     MOVE +0000 TO RPXXX04-ABORT.                                 00628000
006290     MOVE +0000 TO RPXXX04-ERRCNT.                                00629000
006300 IM-LOOP-SET-UP.                                                  00630000
006310     MOVE +0 TO WS-SUB1.                                          00631000
006320 IM-LOOP.                                                         00632000
006330     ADD +1 TO WS-SUB1.                                           00633000
006340     IF WS-SUB1 IS GREATER THAN WS-MAX-PANEL-ENTRIES              00634000
006350         GO TO IM-EXIT.                                           00635000
006360     MOVE SPACE TO RPXXX04-INST2 (WS-SUB1).                       00636000
006370     MOVE SPACE TO RPXXX04-PRODCODE (WS-SUB1).                    00637000
006380     MOVE SPACE TO RPXXX04-ACCOUNT (WS-SUB1).                     00638000
006390     GO TO IM-LOOP.                                               00639000
006400 IM-EXIT.                                                         00640000
006410     EXIT.                                                        00641000
006420******************************************************************00642000
006430 EDIT-MESSAGE SECTION.                                            00643000
006440 EM-START.                                                        00644000
006450     MOVE ZEROS TO WS-SUB1.                                       00645000
006460     PERFORM CHECK-FOR-ERRORS.                                    00646000
006470     IF WS-ERROR-INDICATOR IS EQUAL TO 'Y'                        00647000
006480         OR RPXXX04-APIFUNC IS NOT EQUAL TO 'UPD'                 00648000
006490         GO TO EM-EDIT-COMPLETE.                                  00649000
006500     IF WS-UPDATE-RP IS NOT EQUAL TO 'Y'                          00650000
006510         AND RPXXX04-FUNC IS NOT EQUAL TO 'N'                     00651000
006520         GO TO EM-EXIT.                                           00652000
006530     IF RPXXX04-FUNC IS NOT EQUAL TO 'N'                          00653000
006540         MOVE RPXXX04-IDNUMBER TO WS-IDNUMBER                     00654000
006550         GO TO EM-CONT.                                           00655000
006560     MOVE RPXXX04-KEY-RECORD TO RPMST-GRP-KEY.                    00656000
006570     PERFORM RPS-MST-GET-REQUEST.                                 00657000
006580     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00658000
006590         MOVE WS-AB6320 TO RPXXX04-ABORT                          00659000
006600         MOVE WS-TR0024 TO RPXXX04-ABTRACE                        00660000
006610         GO TO CICS-RETURN.                                       00661000
006620     MOVE RPMST-IDNUMBER TO WS-IDNUMBER.                          00662000
006630 EM-CONT.                                                         00663000
006640     MOVE ZEROS TO WS-SUB1.                                       00664000
006650 EM-LOOP.                                                         00665000
006660     ADD +0001 TO WS-SUB1.                                        00666000
006670     IF WS-SUB1 IS GREATER THAN WS-MAX-PANEL-ENTRIES              00667000
006680         PERFORM FINISH-RP-RECORDS                                00668000
006690         GO TO EM-EDIT-COMPLETE.                                  00669000
006700     IF RPXXX04-PRODCODE (WS-SUB1) IS EQUAL TO SPACE              00670000
006710         AND RPXXX04-ACCOUNT (WS-SUB1) IS EQUAL TO SPACE          00671000
006720         AND RPXXX04-INST2 (WS-SUB1) IS EQUAL TO SPACE            00672000
006730         GO TO EM-LOOP.                                           00673000
006740     PERFORM CREATE-RP-RECORDS.                                   00674000
006750     GO TO EM-LOOP.                                               00675000
006760 EM-EDIT-COMPLETE.                                                00676000
006770     IF WS-ERROR-INDICATOR IS EQUAL TO 'Y'                        00677000
006780         AND RPXXX04-MSGNBR IS EQUAL TO ZEROS                     00678000
006790         MOVE 500035 TO RPXXX04-MSGNBR.                           00679000
006800     IF WS-ERROR-INDICATOR IS EQUAL TO 'Y'                        00680000
006810         OR RPXXX04-APIFUNC IS EQUAL TO 'EDT'                     00681000
006820         MOVE 'EDT' TO RPXXX04-APIFUNC.                           00682000
006830 EM-EXIT.                                                         00683000
006840     EXIT.                                                        00684000
006850******************************************************************00685000
006860 CHECK-FOR-ERRORS SECTION.                                        00686000
006870 CFE-START.                                                       00687000
006880     MOVE +11 TO WS-SUB1.                                         00688000
006890     MOVE RPXXX04-KEY-INST TO WS-LAST-GOOD-INST.                  00689000
006900     MOVE ZEROES TO WS-LAST-INST-TRIED.                           00690000
006910 CFE-EDIT-LIST-LOOP.                                              00691000
006920     SUBTRACT +1 FROM WS-SUB1.                                    00692000
006930     IF WS-SUB1 IS LESS THAN +1                                   00693000
006940         GO TO CFE-EXIT.                                          00694000
006950     IF RPXXX04-PRODCODE-DCHG (WS-SUB1) IS EQUAL TO SPACES        00695000
006960         AND RPXXX04-ACCOUNT-DCHG (WS-SUB1) IS EQUAL TO SPACES    00696000
006970         AND RPXXX04-INST2-DCHG (WS-SUB1) IS EQUAL TO SPACES      00697000
006980         GO TO CFE-EDIT-LIST-LOOP.                                00698000
006990     IF RPXXX04-PRODCODE (WS-SUB1) IS EQUAL TO SPACES             00699000
007000         AND RPXXX04-ACCOUNT (WS-SUB1) IS EQUAL TO SPACES         00700000
007010         AND RPXXX04-INST2 (WS-SUB1) IS EQUAL TO SPACES           00701000
007020         GO TO CFE-EDIT-LIST-LOOP.                                00702000
007030     IF (RPXXX04-PRODCODE (WS-SUB1) IS GREATER THAN SPACES        00703000
007040         AND RPXXX04-ACCOUNT (WS-SUB1) IS EQUAL TO SPACES)        00704000
007050         OR (RPXXX04-PRODCODE (WS-SUB1) IS EQUAL TO SPACES        00705000
007060         AND RPXXX04-ACCOUNT (WS-SUB1) IS GREATER THAN SPACES)    00706000
007070         MOVE 500003 TO WS-MSGNBR                                 00707000
007080         GO TO CFE-ERROR.                                         00708000
007090     IF RPXXX04-INST2 (WS-SUB1) IS GREATER THAN SPACES            00709000
007100         AND (RPXXX04-PRODCODE (WS-SUB1) IS EQUAL TO SPACES       00710000
007110         OR RPXXX04-ACCOUNT (WS-SUB1) IS EQUAL TO SPACES)         00711000
007120         MOVE 500003 TO WS-MSGNBR                                 00712000
007130         GO TO CFE-ERROR.                                         00713000
007140     IF RPXXX04-INST2 (WS-SUB1) IS EQUAL TO SPACES                00714000
007150         AND (RPXXX04-PRODCODE (WS-SUB1) IS GREATER THAN SPACES   00715000
007160         OR RPXXX04-ACCOUNT (WS-SUB1) IS GREATER THAN SPACES)     00716000
007170         MOVE 500003 TO WS-MSGNBR                                 00717000
007180         GO TO CFE-ERROR.                                         00718000
007190     IF RPXXX04-PRODCODE (WS-SUB1)                                00719000
007200         IS EQUAL TO RPXXX04-KEY-PRODCODE                         00720000
007210         AND RPXXX04-ACCOUNT (WS-SUB1)                            00721000
007220         IS EQUAL TO RPXXX04-KEY-ACCOUNT                          00722000
007230         AND RPXXX04-INST2 (WS-SUB1)                              00723000
007240         IS EQUAL TO RPXXX04-KEY-INST                             00724000
007250         MOVE 500044 TO WS-MSGNBR                                 00725000
007260         GO TO CFE-ERROR.                                         00726000
007270     MOVE SPACES TO WS-DUP-FLAG.                                  00727000
007280     MOVE WS-SUB1 TO WS-SUB2.                                     00728000
007290 CFE-CK-FOR-DUPS-LOOP.                                            00729000
007300     SUBTRACT +1 FROM WS-SUB2.                                    00730000
007310     IF WS-SUB2 IS EQUAL TO ZERO                                  00731000
007320         GO TO CFE-REL.                                           00732000
007330     IF RPXXX04-PRODCODE (WS-SUB1)                                00733000
007340         IS EQUAL TO RPXXX04-PRODCODE (WS-SUB2)                   00734000
007350         AND RPXXX04-ACCOUNT (WS-SUB1)                            00735000
007360         IS EQUAL TO RPXXX04-ACCOUNT (WS-SUB2)                    00736000
007370         AND RPXXX04-INST2 (WS-SUB1)                              00737000
007380         IS EQUAL TO RPXXX04-INST2 (WS-SUB2)                      00738000
007390         MOVE 500044 TO WS-MSGNBR                                 00739000
007400         MOVE 'E' TO RPXXX04-INST2-DCHG (WS-SUB2)                 00740000
007410         MOVE 'E' TO RPXXX04-PRODCODE-DCHG (WS-SUB2)              00741000
007420         MOVE 'E' TO RPXXX04-ACCOUNT-DCHG (WS-SUB2)               00742000
007430         MOVE 'Y' TO WS-DUP-FLAG                                  00743000
007440         MOVE 'Y' TO WS-ERROR-INDICATOR.                          00744000
007450     GO TO CFE-CK-FOR-DUPS-LOOP.                                  00745000
007460 CFE-REL.                                                         00746000
007470     IF RPXXX04-FUNC IS EQUAL TO 'N'                              00747000
007480         GO TO CFE-2023.                                          00748000
007490     INITIALIZE RPREL-RECORD.                                     00749000
007500     MOVE RPXXX04-KEY-RECORD TO RPREL-ACCT1-GRP.                  00750000
007510     MOVE RPXXX04-INST2 (WS-SUB1) TO RPREL-INST2.                 00751000
007520     MOVE RPXXX04-PRODCODE (WS-SUB1) TO RPREL-PRODCODE2.          00752000
007530     MOVE RPXXX04-ACCOUNT (WS-SUB1) TO RPREL-ACCOUNT2.            00753000
007540     PERFORM RPS-REL-GET-REQUEST.                                 00754000
007550     IF WS-FUNCTION IS EQUAL TO 'N'                               00755000
007560         GO TO CFE-2023.                                          00756000
007570     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00757000
007580         MOVE WS-AB6330 TO RPXXX04-ABORT                          00758000
007590         MOVE WS-TR0008 TO RPXXX04-ABTRACE                        00759000
007600         GO TO CICS-ABORT-EXIT.                                   00760000
007610     MOVE 500044 TO WS-MSGNBR.                                    00761000
007620     GO TO CFE-ERROR.                                             00762000
007630 CFE-2023.                                                        00763000
007640     IF WS-DUP-FLAG IS EQUAL TO 'Y'                               00764000
007650         GO TO CFE-ERROR.                                         00765000
007660     MOVE RPXXX04-PRODCODE (WS-SUB1) TO WS-PRODCODE.              00766000
007670     PERFORM READ-MICM-2023.                                      00767000
007680     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00768000
007690         MOVE 500001 TO WS-MSGNBR                                 00769000
007700         GO TO CFE-ERROR.                                         00770000
007710     IF MIM-2023RPOPTION IS EQUAL TO ' '                          00771000
007720         OR MIM-2023RPOPTION IS EQUAL TO 'N'                      00772000
007730         MOVE 500015 TO WS-MSGNBR                                 00773000
007740         GO TO CFE-ERROR.                                         00774000
007750 CFE-2024.                                                        00775000
007760     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'N'                     00776000
007770         AND RPXXX04-KEY-INST                                     00777000
007780              IS NOT EQUAL TO RPXXX04-INST2 (WS-SUB1)             00778000
007790         MOVE 500088 TO WS-MSGNBR                                 00779000
007800         GO TO CFE-ERROR.                                         00780000
007810     IF RPXXX04-INST2 (WS-SUB1) IS EQUAL TO RPXXX04-KEY-INST      00781000
007820         MOVE RPXXX04-KEY-INST TO WS-LAST-GOOD-INST               00782000
007830         MOVE ZEROES TO WS-LAST-INST-TRIED                        00783000
007840         GO TO CFE-NAME.                                          00784000
007850     IF RPXXX04-INST2 (WS-SUB1) IS EQUAL TO WS-LAST-GOOD-INST     00785000
007860         GO TO CFE-NAME.                                          00786000
007870     IF RPXXX04-INST2 (WS-SUB1) IS EQUAL TO WS-LAST-INST-TRIED    00787000
007880         MOVE 500088 TO WS-MSGNBR                                 00788000
007890         GO TO CFE-ERROR.                                         00789000
007900     MOVE RPXXX04-INST2 (WS-SUB1) TO WS-LAST-INST-TRIED.          00790000
007910     MOVE ZEROES TO MIM-2024KINST.                                00791000
007920     MOVE 2024 TO MIM-2024KREC.                                   00792000
007930     MOVE RPXXX04-KEY-INST TO MIM-2024KGROUP-INST.                00793000
007940     MOVE RPXXX04-INST2 (WS-SUB1) TO MIM-2024KACCESS-INST.        00794000
007950     MOVE MIC-MST-2024-PRI TO MIC-MST-REC-PRI.                    00795000
007960     MOVE 50 TO MIM-2024KMANGER.                                  00796000
007970     MOVE MI2024-RECORD TO MIMST-RECORD.                          00797000
007980     PERFORM MIC-MST-GET-REQUEST.                                 00798000
007990     IF WS-FUNCTION IS EQUAL TO 'N'                               00799000
008000         MOVE 500088 TO WS-MSGNBR                                 00800000
008010         GO TO CFE-ERROR.                                         00801000
008020     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00802000
008030         MOVE WS-TR0026 TO RPXXX04-ABTRACE                        00803000
008040         MOVE WS-AB3051 TO RPXXX04-ABORT                          00804000
008050         GO TO CICS-ABORT-EXIT.                                   00805000
008060     MOVE MIMST-RECORD TO MI2024-RECORD.                          00806000
008070     MOVE SPACES TO SLS140-MSGNBRG.                               00807000
008080     MOVE SPACES TO SLS140-ABMSG.                                 00808000
008090     MOVE 'X' TO SLS140-SECURITY-FUNC.                            00809000
008100     MOVE RPXXX04-KEY-INST TO SLS140-INST.                        00810000
008110     MOVE RPXXX04-INST2 (WS-SUB1) TO SLS140-INST2.                00811000
008120     MOVE RPXXX04-OPERID TO SLS140-OPERID.                        00812000
008130     MOVE RPXXX04-PROFILE TO SLS140-PROFILE.                      00813000
008140     MOVE RPXXX04-EXTERNALID TO SLS140-EXTERNALID.                00814000
008150     EXEC CICS LINK                                               00815000
008160         PROGRAM('SSL140')                                        00816000
008170         COMMAREA(SLS140-RECORD)                                  00817000
008180         LENGTH(LENGTH OF SLS140-RECORD)                          00818000
008190         NOHANDLE                                                 00819000
008200         END-EXEC.                                                00820000
008210     IF EIBRESP IS NOT EQUAL TO DFHRESP(NORMAL)                   00821000
008220         MOVE 'PROGRAM ID = ' TO RPXXX04-ABMSG                    00822000
008230         MOVE 'SSL140  ' TO RPXXX04-ABMSG (14:8)                  00823000
008240         MOVE WS-TR0027 TO RPXXX04-ABTRACE                        00824000
008250         MOVE WS-AB0009 TO RPXXX04-ABORT                          00825000
008260         GO TO CICS-ABORT-EXIT.                                   00826000
008270     IF SLS140-SECURITY-FUNC IS EQUAL TO 'A'                      00827000
008280         MOVE SLS140-MSGNBRG TO RPXXX04-MSGNBRG                   00828000
008290         MOVE SLS140-ABORT TO RPXXX04-ABORT                       00829000
008300         MOVE SLS140-ABTRACE TO RPXXX04-ABTRACE                   00830000
008310         MOVE SLS140-ABFUNCTION TO RPXXX04-FUNCTION               00831000
008320         MOVE SLS140-ABPROGID TO RPXXX04-ABPROGID                 00832000
008330         MOVE SLS140-ABMSG TO RPXXX04-ABMSG                       00833000
008340         MOVE SLS140-ABEIBRESP TO EIBRESP                         00834000
008350         MOVE SLS140-ABEIBRESP2 TO EIBRESP2                       00835000
008360         MOVE SLS140-ABEIBFN TO EIBFN                             00836000
008370         MOVE SLS140-ABEIBRCODE TO EIBRCODE                       00837000
008380         MOVE SLS140-SRBMDB TO RPXXX04-SRBMDB                     00838000
008390         GO TO CICS-ABORT-EXIT.                                   00839000
008400     IF SLS140-SECURITY-FUNC IS NOT EQUAL TO 'G'                  00840000
008410         MOVE 500088 TO WS-MSGNBR                                 00841000
008420         GO TO CFE-ERROR.                                         00842000
008430     MOVE RPXXX04-INST2 (WS-SUB1) TO WS-LAST-GOOD-INST.           00843000
008440 CFE-NAME.                                                        00844000
008450     MOVE 'E' TO RPRF21-FUNC.                                     00845000
008460     MOVE RPXXX04-INST2 (WS-SUB1) TO RPRF21-BASE-ACCT-INST.       00846000
008470     MOVE RPXXX04-PRODCODE (WS-SUB1) TO RPRF21-BASE-ACCT-PRODCODE.00847000
008480     MOVE RPXXX04-ACCOUNT (WS-SUB1) TO RPRF21-BASE-ACCT.          00848000
008490     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00849000
008500         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00850000
008510         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00851000
008520     PERFORM REQUEST-CUSTOMER.                                    00852000
008530     IF WS-FUNCTION IS EQUAL TO SPACES                            00853000
008540         MOVE RPXXX04-INST2 (WS-SUB1) TO RPRF21-BASE-ACCT-INST    00854000
008550         GO TO CFE-ACT.                                           00855000
008560     IF WS-MSGNBR IS EQUAL TO ZEROS                               00856000
008570         MOVE 500016 TO WS-MSGNBR.                                00857000
008580     GO TO CFE-ERROR.                                             00858000
008590 CFE-ACT.                                                         00859000
008600     MOVE SPACE TO WS-ACT-FLAG.                                   00860000
008610     INITIALIZE RPACT-RECORD.                                     00861000
008620     MOVE RPXXX04-INST2 (WS-SUB1) TO RPACT-INST.                  00862000
008630     MOVE RPXXX04-PRODCODE (WS-SUB1) TO RPACT-PRODCODE.           00863000
008640     MOVE RPXXX04-ACCOUNT (WS-SUB1) TO RPACT-ACCOUNT.             00864000
008650     PERFORM RPS-ACT-GET-GE-REQUEST.                              00865000
008660     GO TO CFE-ACT-CONT.                                          00866000
008670 CFE-ACT-NEXT.                                                    00867000
008680     PERFORM RPS-ACT-GET-NEXT-REQUEST.                            00868000
008690 CFE-ACT-CONT.                                                    00869000
008700     IF WS-FUNCTION IS EQUAL TO 'E'                               00870000
008710         GO TO CFE-QUA-ACCT.                                      00871000
008720     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00872000
008730         MOVE WS-AB6300 TO RPXXX04-ABORT                          00873000
008740         MOVE WS-TR0009 TO RPXXX04-ABTRACE                        00874000
008750         GO TO CICS-ABORT-EXIT.                                   00875000
008760     IF RPXXX04-INST2 (WS-SUB1) IS NOT EQUAL TO RPACT-INST        00876000
008770         OR RPXXX04-PRODCODE (WS-SUB1)                            00877000
008780             IS NOT EQUAL TO RPACT-PRODCODE                       00878000
008790         OR RPXXX04-ACCOUNT (WS-SUB1)                             00879000
008800             IS NOT EQUAL TO RPACT-ACCOUNT                        00880000
008810         GO TO CFE-QUA-ACCT.                                      00881000
008820     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      00882000
008830         MOVE 500021 TO RPXXX04-MSGNBR                            00883000
008840         GO TO CFE-ERROR.                                         00884000
008850     GO TO CFE-ACT-NEXT.                                          00885000
008860 CFE-QUA-ACCT.                                                    00886000
008870     INITIALIZE RPQUA-RECORD.                                     00887000
008880     MOVE RPXXX04-INST2 (WS-SUB1) TO RPQUA-INST.                  00888000
008890     MOVE RPXXX04-PRODCODE (WS-SUB1) TO RPQUA-PRODCODE.           00889000
008900     MOVE RPXXX04-ACCOUNT (WS-SUB1) TO RPQUA-ACCOUNT.             00890000
008910     MOVE LOW-VALUES TO RPQUA-MODEL.                              00891000
008920     PERFORM RPS-QUA-GET-GE-REQUEST.                              00892000
008930     GO TO CFE-QUA-ACCT-CONT.                                     00893000
008940 CFE-QUA-ACCT-NEXT.                                               00894000
008950     PERFORM RPS-QUA-GET-NEXT-REQUEST.                            00895000
008960 CFE-QUA-ACCT-CONT.                                               00896000
008970     IF WS-FUNCTION IS EQUAL TO 'E'                               00897000
008980         GO TO CFE-INTERFACE.                                     00898000
008990     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         00899000
009000         MOVE WS-AB6325 TO RPXXX04-ABORT                          00900000
009010         MOVE WS-TR0010 TO RPXXX04-ABTRACE                        00901000
009020         GO TO CICS-ABORT-EXIT.                                   00902000
009030     IF RPXXX04-INST2 (WS-SUB1) IS NOT EQUAL TO RPQUA-INST        00903000
009040         OR RPXXX04-PRODCODE (WS-SUB1)                            00904000
009050             IS NOT EQUAL TO RPQUA-PRODCODE                       00905000
009060         OR RPXXX04-ACCOUNT (WS-SUB1)                             00906000
009070             IS NOT EQUAL TO RPQUA-ACCOUNT                        00907000
009080         GO TO CFE-INTERFACE.                                     00908000
009090     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      00909000
009100         OR RPXXX04-KEY-MODEL IS EQUAL TO RPQUA-MODEL             00910000
009110         MOVE 500022 TO RPXXX04-MSGNBR                            00911000
009120         GO TO CFE-ERROR.                                         00912000
009130     GO TO CFE-QUA-ACCT-NEXT.                                     00913000
009140 CFE-INTERFACE.                                                   00914000
009150     MOVE 'N' TO WS-INTERFACE.                                    00915000
009160     MOVE SPACES TO RPINF00-MESSAGE.                              00916000
009170     IF MIM-2023RPOPTION IS NOT EQUAL TO 'Y'                      00917000
009180         MOVE ZEROS TO RPXXX04-BRANCH (WS-SUB1)                   00918000
009190         MOVE ZEROS TO RPXXX04-ACCT-TYPE (WS-SUB1)                00919000
009200         GO TO CFE-7102.                                          00920000
009210     PERFORM READ-MICM-0237.                                      00921000
009220     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00922000
009230         OR MIM-237OLINTFC IS NOT GREATER THAN SPACES             00923000
009240         MOVE 500024 TO WS-MSGNBR                                 00924000
009250         GO TO CFE-ERROR.                                         00925000
009260     MOVE RPXXX04-INST2 (WS-SUB1) TO WS-INF-INST.                 00926000
009270     MOVE RPXXX04-ACCOUNT (WS-SUB1) TO WS-INF-ACCOUNT.            00927000
009280     MOVE RPXXX04-PRODCODE (WS-SUB1) TO WS-INF-PRODCODE.          00928000
009290     MOVE MIM-2023INTAPPL211 TO WS-INF-APPLR.                     00929000
009300     MOVE MIM-7101CLOSEDACCTOPT TO RPINF00-CLOSEDACCTOPT.         00930000
009310     PERFORM LINK-INTERFACE.                                      00931000
009320     IF WS-FUNCTION IS EQUAL TO 'D'                               00932000
009330         MOVE 500087 TO WS-MSGNBR                                 00933000
009340         GO TO CFE-ERROR.                                         00934000
009350     IF WS-FUNCTION IS EQUAL TO 'N'                               00935000
009360         MOVE 500025 TO WS-MSGNBR                                 00936000
009370         GO TO CFE-ERROR.                                         00937000
009380     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00938000
009390         MOVE 'E' TO RPXXX04-RETURN                               00939000
009400         MOVE WS-MSGNBR TO RPXXX04-MSGNBR                         00940000
009410         GO TO CFE-EXIT.                                          00941000
009420     MOVE RPINF00-BRANCH TO RPXXX04-BRANCH (WS-SUB1).             00942000
009430     MOVE RPINF00-ACCT-TYPE TO RPXXX04-ACCT-TYPE (WS-SUB1).       00943000
009440 CFE-7102.                                                        00944000
009450     MOVE RPXXX04-BRANCH (WS-SUB1) TO WS-BRANCH.                  00945000
009460     MOVE RPXXX04-ACCT-TYPE (WS-SUB1) TO WS-ACCT-TYPE.            00946000
009470     PERFORM READ-MICM-7102.                                      00947000
009480     IF WS-7102-FLAG IS EQUAL TO 'N'                              00948000
009490         MOVE 500007 TO WS-MSGNBR                                 00949000
009500         GO TO CFE-ERROR.                                         00950000
009510     IF WS-ACT-FLAG IS NOT EQUAL TO 'Y'                           00951000
009520         OR MIM-7100DUPINCOPT IS EQUAL TO 'Y'                     00952000
009530         GO TO CFE-USER-EXIT.                                     00953000
009540 CFE-INCENTIVE.                                                   00954000
009550     IF (MIM-7102SECSCINCOPT IS EQUAL TO 'Y'                      00955000
009560         AND RPACT-SC-INC-OPTION IS EQUAL TO 'Y')                 00956000
009570         OR (MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                00957000
009580         AND RPACT-RATE-INC-OPTION IS EQUAL TO 'Y')               00958000
009590         MOVE 500027 TO WS-MSGNBR                                 00959000
009600         GO TO CFE-ERROR.                                         00960000
009610 CFE-USER-EXIT.                                                   00961000
009620     IF MIM-7102USERRTN IS NOT EQUAL TO 'Y'                       00962000
009630         OR (MIM-7102USERRTN-Q IS NOT EQUAL TO 'B'                00963000
009640         AND MIM-7102USERRTN-Q IS NOT EQUAL TO 'E')               00964000
009650         GO TO CFE-GOOD.                                          00965000
009660     PERFORM USER-EXIT.                                           00966000
009670     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00967000
009680         OR RPUSER-PASSED IS NOT EQUAL TO 'Y'                     00968000
009690         MOVE 500031 TO WS-MSGNBR                                 00969000
009700         GO TO CFE-ERROR.                                         00970000
009710 CFE-GOOD.                                                        00971000
009720     MOVE MIM-7102SECSCINCOPT TO RPXXX04-SECSCINCOPT (WS-SUB1).   00972000
009730     MOVE MIM-7102SECRATEINCOPT                                   00973000
009740         TO RPXXX04-SECRATEINCOPT (WS-SUB1).                      00974000
009750     MOVE MIM-2023INTAPPL211 TO RPXXX04-2023-APPL (WS-SUB1).      00975000
009760     MOVE 'Y' TO WS-UPDATE-RP.                                    00976000
009770     GO TO CFE-EDIT-LIST-LOOP.                                    00977000
009780 CFE-ERROR.                                                       00978000
009790     IF RPXXX04-MSGNBR IS EQUAL TO ZEROS                          00979000
009800         MOVE WS-MSGNBR TO RPXXX04-MSGNBR.                        00980000
009810     MOVE 'E' TO RPXXX04-INST2-DCHG (WS-SUB1).                    00981000
009820     MOVE 'E' TO RPXXX04-PRODCODE-DCHG (WS-SUB1).                 00982000
009830     MOVE 'E' TO RPXXX04-ACCOUNT-DCHG (WS-SUB1).                  00983000
009840     MOVE 'Y' TO WS-ERROR-INDICATOR.                              00984000
009850     GO TO CFE-EDIT-LIST-LOOP.                                    00985000
009860 CFE-EXIT.                                                        00986000
009870     EXIT.                                                        00987000
009880******************************************************************00988000
009890 READ-MICM-0237 SECTION.                                          00989000
009900 RM0237-START.                                                    00990000
009910     MOVE SPACES TO WS-FUNCTION.                                  00991000
009920     IF MIM-2023INTAPPL211 IS EQUAL TO MIM-0237KINTAPPL           00992000
009930         GO TO RM0237-EXIT.                                       00993000
009940     MOVE SPACES TO MI0237-RECORD.                                00994000
009950     MOVE RPXXX04-KEY-INST TO MIM-0237KINST.                      00995000
009960     MOVE +0237 TO MIM-0237KREC.                                  00996000
009970     MOVE RPXXX04-APPL TO MIM-0237KPROCMGR.                       00997000
009980     MOVE MIM-2023INTAPPL211 TO MIM-0237KINTAPPL.                 00998000
009990     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    00999000
010000     MOVE MI0237-RECORD TO MIMST-RECORD.                          01000000
010010     PERFORM MIC-MST-GET-REQUEST.                                 01001000
010020     MOVE MIMST-RECORD TO MI0237-RECORD.                          01002000
010030 RM0237-EXIT.                                                     01003000
010040     EXIT.                                                        01004000
010050******************************************************************01005000
010060 READ-MICM-2023 SECTION.                                          01006000
010070 RM2023-START.                                                    01007000
010080     MOVE SPACES TO WS-FUNCTION.                                  01008000
010090     IF WS-PRODCODE IS EQUAL TO MIM-2023KPRODCODE                 01009000
010100         GO TO RM2023-END.                                        01010000
010110     MOVE SPACES TO MI2023-RECORD.                                01011000
010120     MOVE RPXXX04-KEY-INST TO MIM-2023KINST.                      01012000
010130     IF RPXXX04-INST-OPT-1 IS NOT EQUAL TO 'Y'                    01013000
010140         MOVE ZEROS TO MIM-2023KINST.                             01014000
010150     MOVE WS-PRODCODE TO MIM-2023KPRODCODE.                       01015000
010160     MOVE +2023 TO MIM-2023KREC.                                  01016000
010170     MOVE MIC-MST-2023-PRI TO MIC-MST-REC-PRI.                    01017000
010180 RM2023-INST-ZERO.                                                01018000
010190     MOVE MI2023-RECORD TO MIMST-RECORD.                          01019000
010200     MOVE SPACES TO WS-FUNCTION.                                  01020000
010210     PERFORM MIC-MST-GET-REQUEST.                                 01021000
010220     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01022000
010230         AND MIM-2023KINST IS NOT EQUAL TO ZEROS                  01023000
010240         MOVE ZEROS TO MIM-2023KINST                              01024000
010250         GO TO RM2023-INST-ZERO.                                  01025000
010260     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01026000
010270         GO TO RM2023-END.                                        01027000
010280     MOVE MIMST-RECORD TO MI2023-RECORD.                          01028000
010290 RM2023-END.                                                      01029000
010300     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01030000
010310         MOVE 'N' TO MIM-2023RPOPTION.                            01031000
010320 RM2023-EXIT.                                                     01032000
010330     EXIT.                                                        01033000
010340******************************************************************01034000
010350 READ-MICM-7100 SECTION.                                          01035000
010360 RM7100-START.                                                    01036000
010370     MOVE SPACES TO WS-FUNCTION.                                  01037000
010380     MOVE SPACES TO MI7100-RECORD.                                01038000
010390     MOVE RPXXX04-KEY-INST TO MIM-7100KINST.                      01039000
010400 RM7100-LOOP.                                                     01040000
010410     MOVE +7100 TO MIM-7100KREC.                                  01041000
010420     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    01042000
010430     MOVE MI7100-RECORD TO MIMST-RECORD.                          01043000
010440     PERFORM MIC-MST-GET-REQUEST.                                 01044000
010450     MOVE MIMST-RECORD TO MI7100-RECORD.                          01045000
010460     IF WS-FUNCTION IS EQUAL TO 'N'                               01046000
010470         AND MIM-7100KINST IS GREATER THAN ZEROS                  01047000
010480         GO TO RM7100-ZERO.                                       01048000
010490     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01049000
010500         MOVE WS-AB3051 TO RPXXX04-ABORT                          01050000
010510         MOVE WS-TR0011 TO RPXXX04-ABTRACE                        01051000
010520         GO TO CICS-ABORT-EXIT.                                   01052000
010530     GO TO RM7100-EXIT.                                           01053000
010540 RM7100-ZERO.                                                     01054000
010550     MOVE SPACES TO MI7100-RECORD.                                01055000
010560     MOVE ZEROS TO MIM-7100KINST.                                 01056000
010570     GO TO RM7100-LOOP.                                           01057000
010580 RM7100-EXIT.                                                     01058000
010590     EXIT.                                                        01059000
010600******************************************************************01060000
010610 READ-MICM-7101 SECTION.                                          01061000
010620 RM7101-START.                                                    01062000
010630     MOVE SPACES TO WS-FUNCTION.                                  01063000
010640     MOVE SPACES TO MI7101-RECORD.                                01064000
010650     MOVE RPXXX04-KEY-INST TO MIM-7101KINST.                      01065000
010660     MOVE +7101 TO MIM-7101KREC.                                  01066000
010670     MOVE RPXXX04-KEY-MODEL TO MIM-7101KMODEL.                    01067000
010680     COMPUTE WS-7101KEFFDT = WS-CURDT-YYYYMMDD - 99999999.        01068000
010690     MOVE WS-7101KEFFDT TO MIM-7101KEFFDT.                        01069000
010700     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    01070000
010710     MOVE MI7101-RECORD TO MIMST-RECORD.                          01071000
010720     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           01072000
010730     MOVE MIMST-RECORD TO MI7101-RECORD.                          01073000
010740     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01074000
010750         GO TO RM7101-EXIT.                                       01075000
010760     IF MIM-7101KINST IS NOT EQUAL TO RPXXX04-KEY-INST            01076000
010770         OR MIM-7101KREC IS NOT EQUAL TO '7101'                   01077000
010780         OR MIM-7101KMODEL IS NOT EQUAL TO RPXXX04-KEY-MODEL      01078000
010790         MOVE 'N' TO WS-FUNCTION                                  01079000
010800         GO TO RM7101-EXIT.                                       01080000
010810 RM7101-EXIT.                                                     01081000
010820     EXIT.                                                        01082000
010830******************************************************************01083000
010840 READ-MICM-7102 SECTION.                                          01084000
010850 RM7102-START.                                                    01085000
010860     MOVE SPACES TO WS-FUNCTION.                                  01086000
010870     IF RPRF21-BASE-ACCT-PRODCODE IS EQUAL TO WS-SAVE-PRODCODE    01087000
010880         AND WS-ACCT-TYPE IS EQUAL TO WS-SAVE-ACCT-TYPE           01088000
010890         GO TO RM7102-EXIT.                                       01089000
010900     MOVE RPRF21-BASE-ACCT-PRODCODE TO WS-SAVE-PRODCODE.          01090000
010910     MOVE WS-ACCT-TYPE TO WS-SAVE-ACCT-TYPE.                      01091000
010920     MOVE SPACES TO WS-7102-FLAG.                                 01092000
010930 RM7102-LOOP.                                                     01093000
010940     MOVE SPACES TO MI7102-RECORD.                                01094000
010950     MOVE RPXXX04-KEY-INST TO MIM-7102KINST.                      01095000
010960     MOVE +7102 TO MIM-7102KREC.                                  01096000
010970     MOVE RPXXX04-KEY-MODEL TO MIM-7102KMODEL.                    01097000
010980     MOVE RPRF21-BASE-ACCT-PRODCODE TO MIM-7102KPRODCODE.         01098000
010990     MOVE WS-ACCT-TYPE TO MIM-7102KACCTTYPE.                      01099000
011000     MOVE MIC-RPS-7102-PRI TO MIC-MST-REC-PRI.                    01100000
011010     MOVE MI7102-RECORD TO MIMST-RECORD.                          01101000
011020     PERFORM MIC-MST-GET-REQUEST.                                 01102000
011030     MOVE MIMST-RECORD TO MI7102-RECORD.                          01103000
011040     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01104000
011050         AND RPRF21-BASE-ACCT-PRODCODE IS EQUAL TO SPACES         01105000
011060         AND WS-ACCT-TYPE IS EQUAL TO ZEROS                       01106000
011070         MOVE 'N' TO WS-7102-FLAG                                 01107000
011080         GO TO RM7102-END.                                        01108000
011090     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01109000
011100         AND WS-ACCT-TYPE IS EQUAL TO ZEROS                       01110000
011110         AND WS-7102-DEF-FLAG IS EQUAL TO 'Y'                     01111000
011120         MOVE SPACES TO WS-FUNCTION                               01112000
011130         MOVE WS-7102-DEF-RECORD TO MI7102-RECORD                 01113000
011140         GO TO RM7102-END.                                        01114000
011150     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01115000
011160         AND WS-ACCT-TYPE IS NOT EQUAL TO ZEROS                   01116000
011170         MOVE ZEROS TO WS-ACCT-TYPE                               01117000
011180         GO TO RM7102-LOOP.                                       01118000
011190     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01119000
011200         AND RPRF21-BASE-ACCT-PRODCODE IS NOT EQUAL TO SPACES     01120000
011210         MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE                 01121000
011220         GO TO RM7102-LOOP.                                       01122000
011230     IF WS-FUNCTION IS EQUAL TO SPACES                            01123000
011240         AND RPRF21-BASE-ACCT-PRODCODE IS EQUAL TO SPACES         01124000
011250         AND WS-ACCT-TYPE IS EQUAL TO ZEROS                       01125000
011260         MOVE 'Y' TO WS-7102-DEF-FLAG                             01126000
011270         MOVE MI7102-RECORD TO WS-7102-DEF-RECORD.                01127000
011280 RM7102-END.                                                      01128000
011290     MOVE WS-SAVE-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.          01129000
011300     MOVE WS-SAVE-ACCT-TYPE TO WS-ACCT-TYPE.                      01130000
011310 RM7102-EXIT.                                                     01131000
011320     EXIT.                                                        01132000
011330******************************************************************01133000
011340 LINK-INTERFACE SECTION.                                          01134000
011350 LINT-START.                                                      01135000
011360     MOVE MIM-237OLINTFC TO WS-PROGRAM.                           01136000
011370     MOVE WS-INF-KEY TO RPINF00-KEY-AREAS.                        01137000
011380     MOVE MIM-7101CLOSEDACCTOPT TO RPINF00-CLOSEDACCTOPT.         01138000
011390     MOVE RPXXX04-CONTROLS TO RPINF00-CONTROLS.                   01139000
011400     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     01140000
011410         AND RPXXX04-KEY-INST IS NOT EQUAL TO RPINF00-INST        01141000
011420         AND WS-LAST-GOOD-INST IS EQUAL TO RPINF00-INST           01142000
011430         MOVE SLS140-FILEOPTS2 TO RPINF00-FILEOPTS.               01143000
011440     MOVE 'N' TO RPINF00-GLOBAL-CLOSE.                            01144000
011450     EXEC CICS LINK                                               01145000
011460         PROGRAM(WS-PROGRAM)                                      01146000
011470         COMMAREA(RPINF00-MESSAGE)                                01147000
011480         LENGTH(LENGTH OF RPINF00-MESSAGE)                        01148000
011490         RESP(WS-CICS-RESPONSE)                                   01149000
011500         END-EXEC.                                                01150000
011510     MOVE RPINF00-FUNCTION TO WS-FUNCTION.                        01151000
011520     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     01152000
011530         MOVE 'L' TO WS-FUNCTION                                  01153000
011540         MOVE 500039 TO WS-MSGNBR                                 01154000
011550         GO TO LINT-EXIT.                                         01155000
011560     IF WS-FUNCTION IS EQUAL TO 'L'                               01156000
011570         MOVE 500040 TO WS-MSGNBR                                 01157000
011580         GO TO LINT-EXIT.                                         01158000
011590     IF WS-FUNCTION IS EQUAL TO 'C'                               01159000
011600         MOVE 500041 TO WS-MSGNBR                                 01160000
011610         GO TO LINT-EXIT.                                         01161000
011620     MOVE 'Y' TO WS-INTERFACE.                                    01162000
011630 LINT-EXIT.                                                       01163000
011640     EXIT.                                                        01164000
011650******************************************************************01165000
011660 USER-EXIT SECTION.                                               01166000
011670 UEXIT-START.                                                     01167000
011680     MOVE SPACES TO RPUSER-MESSAGE.                               01168000
011690     IF WS-INTERFACE IS NOT EQUAL TO 'Y'                          01169000
011700         GO TO UEXIT-CONT.                                        01170000
011710     MOVE RPINF00-KEY-AREAS TO RPUSER-KEY-AREAS.                  01171000
011720     MOVE RPINF00-USER-INFO TO RPUSER-USER-INFO.                  01172000
011730     MOVE RPINF00-MISC-INFO TO RPUSER-MISC-INFO.                  01173000
011740     MOVE RPINF00-BAL-INFO TO RPUSER-BAL-INFO.                    01174000
011750     GO TO UEXIT-CALL.                                            01175000
011760 UEXIT-CONT.                                                      01176000
011770     MOVE RPRF21-BASE-ACCT-INST TO RPUSER-INST.                   01177000
011780     MOVE RPRF21-BASE-ACCT-PRODCODE TO RPUSER-PRODCODE.           01178000
011790     MOVE RPRF21-BASE-ACCT TO RPUSER-ACCOUNT.                     01179000
011800     MOVE MIM-2023INTAPPL211 TO RPUSER-APPLR.                     01180000
011810     INITIALIZE RPUSER-GRP-DATA.                                  01181000
011820 UEXIT-CALL.                                                      01182000
000000     CALL 'RPBUSER' USING                                         01183000
011840         RPUSER-MESSAGE                                           01184000
011850         WS-FUNCTION.                                             01185000
011860 UEXIT-EXIT.                                                      01186000
011870     EXIT.                                                        01187000
011880******************************************************************01188000
011890 CREATE-IDNUMBER SECTION.                                         01189000
011900 CID-START.                                                       01190000
011910     EXEC CICS ASKTIME                                            01191000
011920         END-EXEC.                                                01192000
011930     MOVE WS-CURDT-YYYYMMDD TO WS-IDNBR-DATE.                     01193000
011940     MOVE EIBTIME TO WS-IDNBR-TIME.                               01194000
011950     MOVE ZEROES TO WS-IDNBR-SEQ.                                 01195000
011960     MOVE RPXXX04-KEY-INST TO RPQUA-INST.                         01196000
011970     MOVE WS-IDNBR-GRP TO RPXXX04-IDNUMBER.                       01197000
011980 CID-EXIT.                                                        01198000
011990     EXIT.                                                        01199000
012000******************************************************************01200000
012010 CREATE-RP-RECORDS SECTION.                                       01201000
012020 CRPR-START.                                                      01202000
012030     INITIALIZE RPREL-RECORD.                                     01203000
012040     MOVE RPXXX04-KEY-RECORD TO RPREL-ACCT1-GRP.                  01204000
012050     MOVE RPXXX04-INST2 (WS-SUB1) TO RPREL-INST2.                 01205000
012060     MOVE RPXXX04-PRODCODE (WS-SUB1) TO RPREL-PRODCODE2.          01206000
012070     MOVE RPXXX04-ACCOUNT (WS-SUB1) TO RPREL-ACCOUNT2.            01207000
012080     MOVE 'A' TO RPREL-ACCT-STATUS.                               01208000
012090     MOVE RPXXX04-KEY-MODEL TO RPREL-MODEL.                       01209000
012100     MOVE RPXXX04-BRANCH (WS-SUB1) TO RPREL-BRANCH.               01210000
012110     MOVE RPXXX04-ACCT-TYPE (WS-SUB1) TO RPREL-ACCT-TYPE.         01211000
012120     MOVE RPXXX04-SECSCINCOPT (WS-SUB1) TO RPREL-SC-INC-OPTION.   01212000
012130     MOVE RPXXX04-SECRATEINCOPT (WS-SUB1)                         01213000
012140         TO RPREL-RATE-INC-OPTION.                                01214000
012150     MOVE RPXXX04-2023-APPL (WS-SUB1) TO RPREL-APPL.              01215000
012160     PERFORM RPS-REL-PUT-REQUEST.                                 01216000
012170     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01217000
012180         MOVE WS-AB6330 TO RPXXX04-ABORT                          01218000
012190         MOVE WS-TR0012 TO RPXXX04-ABTRACE                        01219000
012200         GO TO CICS-RETURN.                                       01220000
012210     MOVE 'Y' TO WS-UPDATESW.                                     01221000
012220 CRPR-SEC.                                                        01222000
012230     INITIALIZE RPSEC-RECORD.                                     01223000
012240     MOVE RPREL-INST2 TO RPSEC-INST.                              01224000
012250     MOVE RPREL-PRODCODE2 TO RPSEC-PRODCODE.                      01225000
012260     MOVE RPREL-ACCOUNT2 TO RPSEC-ACCOUNT.                        01226000
012270     MOVE RPREL-MODEL TO RPSEC-MODEL2.                            01227000
012280     MOVE RPREL-INST TO RPSEC-INST2.                              01228000
012290     MOVE RPREL-PRODCODE TO RPSEC-PRODCODE2.                      01229000
012300     MOVE RPREL-ACCOUNT TO RPSEC-ACCOUNT2.                        01230000
012310     MOVE RPSEC-INST TO RPSEC-ALT-INST.                           01231000
012320     MOVE RPSEC-PRODCODE TO RPSEC-ALT-PRODCODE.                   01232000
012330     MOVE RPSEC-ACCOUNT TO RPSEC-ALT-ACCOUNT.                     01233000
012340     PERFORM RPS-SEC-PUT-REQUEST.                                 01234000
012350     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01235000
012360         MOVE WS-AB6335 TO RPXXX04-ABORT                          01236000
012370         MOVE WS-TR0013 TO RPXXX04-ABTRACE                        01237000
012380         GO TO CICS-RETURN.                                       01238000
012390     MOVE 'Y' TO WS-UPDATESW.                                     01239000
012400 CRPR-ACT.                                                        01240000
012410     INITIALIZE RPACT-RECORD.                                     01241000
012420     MOVE RPSEC-ACCT1-GRP TO RPACT-GRP-KEY.                       01242000
012430     PERFORM RPS-ACT-GET-LOCK-REQUEST.                            01243000
012440     IF WS-FUNCTION IS EQUAL TO 'N'                               01244000
012450         GO TO CRPR-ACT-NEW.                                      01245000
012460     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01246000
012470         MOVE WS-AB6300 TO RPXXX04-ABORT                          01247000
012480         MOVE WS-TR0014 TO RPXXX04-ABTRACE                        01248000
012490         GO TO CICS-RETURN.                                       01249000
012500     IF RPXXX04-SECSCINCOPT (WS-SUB1) IS EQUAL TO 'Y'             01250000
012510         AND RPACT-SC-INC-OPTION IS NOT EQUAL TO 'Y'              01251000
012520         MOVE RPXXX04-SECSCINCOPT (WS-SUB1)                       01252000
012530             TO RPACT-SC-INC-OPTION.                              01253000
012540     IF RPXXX04-SECRATEINCOPT (WS-SUB1) IS EQUAL TO 'Y'           01254000
012550         AND RPACT-RATE-INC-OPTION IS NOT EQUAL TO 'Y'            01255000
012560         MOVE RPXXX04-SECRATEINCOPT (WS-SUB1)                     01256000
012570             TO RPACT-RATE-INC-OPTION.                            01257000
012580     PERFORM RPS-ACT-REPUT-REQUEST.                               01258000
012590     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01259000
012600         MOVE WS-AB6300 TO RPXXX04-ABORT                          01260000
012610         MOVE WS-TR0015 TO RPXXX04-ABTRACE                        01261000
012620         GO TO CICS-RETURN.                                       01262000
012630     MOVE 'Y' TO WS-UPDATESW.                                     01263000
012640     GO TO CRPR-EVT.                                              01264000
012650 CRPR-ACT-NEW.                                                    01265000
012660     INITIALIZE RPACT-RECORD.                                     01266000
012670     MOVE RPSEC-ACCT1-GRP TO RPACT-GRP-KEY.                       01267000
012680     MOVE 'N' TO RPACT-SC-INC-QUAL.                               01268000
012690     MOVE RPXXX04-SECSCINCOPT (WS-SUB1) TO RPACT-SC-INC-OPTION.   01269000
012700     MOVE 'N' TO RPACT-RATE-INC-QUAL.                             01270000
012710     MOVE RPXXX04-SECRATEINCOPT (WS-SUB1)                         01271000
012720         TO RPACT-RATE-INC-OPTION.                                01272000
012730     MOVE RPXXX04-2023-APPL (WS-SUB1) TO RPACT-APPL.              01273000
012740     MOVE 'N' TO RPACT-PROCOPT.                                   01274000
012750     PERFORM RPS-ACT-PUT-REQUEST.                                 01275000
012760     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01276000
012770         MOVE WS-AB6300 TO RPXXX04-ABORT                          01277000
012780         MOVE WS-TR0016 TO RPXXX04-ABTRACE                        01278000
012790         GO TO CICS-RETURN.                                       01279000
012800     MOVE 'Y' TO WS-UPDATESW.                                     01280000
012810 CRPR-EVT.                                                        01281000
012820     IF MIM-7100EVENTHISTORYOPT IS NOT EQUAL TO 'Y'               01282000
012830         GO TO CRPR-EXIT.                                         01283000
012840     MOVE 07 TO RPS-EVT-EVENT-CODE.                               01284000
012850     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   01285000
012860     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   01286000
012870     MOVE WS-IDNUMBER TO RPS-EVT-IDNUMBER.                        01287000
012880     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        01288000
012890     PERFORM ADD-EVENT-HISTORY.                                   01289000
012900     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01290000
012910         MOVE WS-AB6360 TO RPXXX04-ABORT                          01291000
012920         MOVE WS-TR0028 TO RPXXX04-ABTRACE                        01292000
012930         GO TO CICS-RETURN.                                       01293000
012940 CRPR-EXIT.                                                       01294000
012950     EXIT.                                                        01295000
012960******************************************************************01296000
012970 FINISH-RP-RECORDS SECTION.                                       01297000
012980 FRPR-START.                                                      01298000
012990     IF RPXXX04-FUNC IS NOT EQUAL TO 'N'                          01299000
013000         GO TO FRPR-MAINT-MST.                                    01300000
013010     INITIALIZE RPREL-RECORD.                                     01301000
013020     MOVE RPXXX04-KEY-RECORD TO RPREL-ACCT1-GRP.                  01302000
013030     MOVE SPACES TO RPREL-ACCT2-GRP.                              01303000
013040     MOVE ZEROS TO RPREL-INST2.                                   01304000
013050     MOVE 'A' TO RPREL-ACCT-STATUS.                               01305000
013060     MOVE RPXXX04-KEY-MODEL TO RPREL-MODEL.                       01306000
013070     MOVE RPXXX04-KEY-BRANCH TO RPREL-BRANCH.                     01307000
013080     MOVE RPXXX04-KEY-ACCT-TYPE TO RPREL-ACCT-TYPE.               01308000
013090     MOVE RPXXX04-KEY-INCOPT TO RPREL-SC-INC-OPTION.              01309000
013100     MOVE RPXXX04-KEY-RTOPT TO RPREL-RATE-INC-OPTION.             01310000
013110     MOVE RPXXX04-KEY-APPL TO RPREL-APPL.                         01311000
013120     PERFORM RPS-REL-PUT-REQUEST.                                 01312000
013130     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01313000
013140         MOVE WS-AB6330 TO RPXXX04-ABORT                          01314000
013150         MOVE WS-TR0017 TO RPXXX04-ABTRACE                        01315000
013160         GO TO CICS-RETURN.                                       01316000
013170     MOVE 'Y' TO WS-UPDATESW.                                     01317000
013180 FRPR-SEC.                                                        01318000
013190     INITIALIZE RPSEC-RECORD.                                     01319000
013200     MOVE RPXXX04-KEY-RECORD TO RPSEC-ACCT1-GRP.                  01320000
013210     MOVE SPACES TO RPSEC-ACCT2-GRP.                              01321000
013220     MOVE ZEROS TO RPSEC-INST2.                                   01322000
013230     MOVE RPXXX04-KEY-MODEL TO RPSEC-MODEL2.                      01323000
013240     MOVE RPSEC-INST TO RPSEC-ALT-INST.                           01324000
013250     MOVE RPSEC-PRODCODE TO RPSEC-ALT-PRODCODE.                   01325000
013260     MOVE RPSEC-ACCOUNT TO RPSEC-ALT-ACCOUNT.                     01326000
013270     PERFORM RPS-SEC-PUT-REQUEST.                                 01327000
013280     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01328000
013290         MOVE WS-AB6335 TO RPXXX04-ABORT                          01329000
013300         MOVE WS-TR0018 TO RPXXX04-ABTRACE                        01330000
013310         GO TO CICS-RETURN.                                       01331000
013320     MOVE 'Y' TO WS-UPDATESW.                                     01332000
013330 FRPR-PRIM-ACT.                                                   01333000
013340     INITIALIZE RPACT-RECORD.                                     01334000
013350     MOVE RPXXX04-KEY-RECORD TO RPACT-GRP-KEY.                    01335000
013360     PERFORM RPS-ACT-GET-LOCK-REQUEST.                            01336000
013370     IF WS-FUNCTION IS EQUAL TO 'N'                               01337000
013380         GO TO FRPR-PRIM-ACT-NEW.                                 01338000
013390     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01339000
013400         MOVE WS-AB6300 TO RPXXX04-ABORT                          01340000
013410         MOVE WS-TR0019 TO RPXXX04-ABTRACE                        01341000
013420         GO TO CICS-RETURN.                                       01342000
013430     IF RPXXX04-KEY-INCOPT IS EQUAL TO 'Y'                        01343000
013440         AND RPACT-SC-INC-OPTION IS NOT EQUAL TO 'Y'              01344000
013450         MOVE RPXXX04-KEY-INCOPT TO RPACT-SC-INC-OPTION.          01345000
013460     IF RPXXX04-KEY-RTOPT IS EQUAL TO 'Y'                         01346000
013470         AND RPACT-RATE-INC-OPTION IS NOT EQUAL TO 'Y'            01347000
013480         MOVE RPXXX04-KEY-RTOPT TO RPACT-RATE-INC-OPTION.         01348000
013490     PERFORM RPS-ACT-REPUT-REQUEST.                               01349000
013500     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01350000
013510         MOVE WS-AB6300 TO RPXXX04-ABORT                          01351000
013520         MOVE WS-TR0020 TO RPXXX04-ABTRACE                        01352000
013530         GO TO CICS-RETURN.                                       01353000
013540     MOVE 'Y' TO WS-UPDATESW.                                     01354000
013550     GO TO FRPR-IDX.                                              01355000
013560 FRPR-PRIM-ACT-NEW.                                               01356000
013570     INITIALIZE RPACT-RECORD.                                     01357000
013580     MOVE RPXXX04-KEY-RECORD TO RPACT-GRP-KEY.                    01358000
013590     MOVE 'N' TO RPACT-SC-INC-QUAL.                               01359000
013600     MOVE RPXXX04-KEY-INCOPT TO RPACT-SC-INC-OPTION.              01360000
013610     MOVE 'N' TO RPACT-RATE-INC-QUAL.                             01361000
013620     MOVE RPXXX04-KEY-RTOPT TO RPACT-RATE-INC-OPTION.             01362000
013630     MOVE RPXXX04-KEY-APPL TO RPACT-APPL.                         01363000
013640     MOVE 'N' TO RPACT-PROCOPT.                                   01364000
013650     PERFORM RPS-ACT-PUT-REQUEST.                                 01365000
013660     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01366000
013670         MOVE WS-AB6300 TO RPXXX04-ABORT                          01367000
013680         MOVE WS-TR0021 TO RPXXX04-ABTRACE                        01368000
013690         GO TO CICS-RETURN.                                       01369000
013700     MOVE 'Y' TO WS-UPDATESW.                                     01370000
013710 FRPR-IDX.                                                        01371000
013720     INITIALIZE RPIDX-RECORD.                                     01372000
013730     MOVE RPXXX04-KEY-INST TO RPIDX-INST.                         01373000
013740     MOVE RPXXX04-RP-PRODCODE TO RPIDX-PRODCODE.                  01374000
013750     MOVE RPXXX04-IDNUMBER TO RPIDX-IDNUMBER.                     01375000
013760     MOVE RPXXX04-KEY-RECORD TO RPIDX-ACCT2-KEY.                  01376000
013770 FRPR-IDX-ADD.                                                    01377000
013780     PERFORM RPS-IDX-PUT-REQUEST.                                 01378000
013790     IF WS-FUNCTION IS EQUAL TO '='                               01379000
013800         ADD +0001 TO WS-IDNBR-SEQ                                01380000
013810         MOVE WS-IDNBR-GRP TO RPIDX-IDNUMBER                      01381000
013820         MOVE 'Y' TO RPXXX04-IDNBR-CHANGE                         01382000
013830         GO TO FRPR-IDX-ADD.                                      01383000
013840     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01384000
013850         MOVE WS-AB6310 TO RPXXX04-ABORT                          01385000
013860         MOVE WS-TR0022 TO RPXXX04-ABTRACE                        01386000
013870         GO TO CICS-RETURN.                                       01387000
013880     MOVE 'Y' TO WS-UPDATESW.                                     01388000
013890     MOVE RPIDX-IDNUMBER TO RPXXX04-IDNUMBER.                     01389000
013900 FRPR-MST.                                                        01390000
013910     INITIALIZE RPMST-RECORD.                                     01391000
013920     MOVE RPXXX04-KEY-RECORD TO RPMST-GRP-KEY.                    01392000
013930     MOVE 'A' TO RPMST-REL-STAT.                                  01393000
013940     MOVE 'N' TO RPMST-QUAL-STAT.                                 01394000
013950     MOVE RPXXX04-KEY-MODEL TO RPMST-MODEL.                       01395000
013960     MOVE WS-CURDT-YYYYMMDD TO RPMST-LMNTDT.                      01396000
013970     MOVE ZEROS TO RPMST-SCNXTDT.                                 01397000
013980     MOVE WS-CURDT-YYYYMMDD TO RPMST-DATE-OPENED.                 01398000
013990     MOVE ZEROS TO RPMST-EXPIRATION-DATE.                         01399000
014000     IF MIM-7101EXPDT IS NOT EQUAL TO ZEROS                       01400000
014010         MOVE MIM-7101EXPDT TO RPMST-EXPIRATION-DATE              01401000
014020         GO TO FRPR-MST-CONT.                                     01402000
014030     IF MIM-7101EXPFREQ IS EQUAL TO 'N'                           01403000
014040         GO TO FRPR-MST-CONT.                                     01404000
014050     MOVE RPXXX04-DATE TO SR-FROMCAL.                             01405000
014060     PERFORM JULIAN-365.                                          01406000
014070     MOVE SR-TOJUL TO SR-FROMJUL.                                 01407000
014080     MOVE MIM-7101EXPFREQ TO SR-PERIOD.                           01408000
014090     MOVE MIM-7101EXPTERM TO SR-FREQ.                             01409000
014100     IF MIM-7101EXPFREQ IS EQUAL TO 'M'                           01410000
014110         AND MIM-7101ENDOFMONTH IS EQUAL TO 'Y'                   01411000
014120         MOVE 31 TO SR-DAY                                        01412000
014130     ELSE                                                         01413000
014140         MOVE ZEROS TO SR-DAY.                                    01414000
014150     PERFORM NEXT-DATE-365.                                       01415000
014160     MOVE SR-TOJUL TO SR-FROMJUL.                                 01416000
014170     PERFORM CALENDAR-365.                                        01417000
014180     MOVE SR-TCMON TO WS-PDATE-MM.                                01418000
014190     MOVE SR-TCDAY TO WS-PDATE-DD.                                01419000
014200     MOVE SR-TCYR TO WS-PDATE-YYYY.                               01420000
014210     MOVE WS-PDATE TO RPMST-EXPIRATION-DATE.                      01421000
014220 FRPR-MST-CONT.                                                   01422000
014230     MOVE 'N' TO RPMST-SCTODAYFLAG.                               01423000
014240     MOVE RPIDX-IDNUMBER TO RPMST-IDNUMBER.                       01424000
014250     MOVE 'Y' TO RPMST-OUT-FLAG.                                  01425000
014260     PERFORM RPS-MST-PUT-REQUEST.                                 01426000
014270     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01427000
014280         MOVE WS-AB6320 TO RPXXX04-ABORT                          01428000
014290         MOVE WS-TR0023 TO RPXXX04-ABTRACE                        01429000
014300         GO TO CICS-RETURN.                                       01430000
014310     MOVE 'Y' TO WS-UPDATESW.                                     01431000
014320 FRPR-EVT.                                                        01432000
014330     IF MIM-7100EVENTHISTORYOPT IS NOT EQUAL TO 'Y'               01433000
014340         GO TO FRPR-EXIT.                                         01434000
014350     MOVE 07 TO RPS-EVT-EVENT-CODE.                               01435000
014360     MOVE RPREL-ACCT1-GRP TO RPS-EVT-ACCT1-GRP.                   01436000
014370     MOVE RPREL-ACCT2-GRP TO RPS-EVT-ACCT2-GRP.                   01437000
014380     MOVE WS-IDNUMBER TO RPS-EVT-IDNUMBER.                        01438000
014390     MOVE SR-APIPROGLIT TO RPS-EVT-MODULE.                        01439000
014400     PERFORM ADD-EVENT-HISTORY.                                   01440000
014410     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        01441000
014420         MOVE WS-AB6360 TO RPXXX04-ABORT                          01442000
014430         MOVE WS-TR0029 TO RPXXX04-ABTRACE                        01443000
014440         GO TO CICS-RETURN.                                       01444000
014450     GO TO FRPR-EXIT.                                             01445000
014460 FRPR-MAINT-MST.                                                  01446000
014470     INITIALIZE RPMST-RECORD.                                     01447000
014480     MOVE RPXXX04-KEY-RECORD TO RPMST-GRP-KEY.                    01448000
014490     PERFORM RPS-MST-GET-LOCK-REQUEST.                            01449000
014500     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01450000
014510         MOVE WS-AB6320 TO RPXXX04-ABORT                          01451000
014520         MOVE WS-TR0024 TO RPXXX04-ABTRACE                        01452000
014530         GO TO CICS-RETURN.                                       01453000
014540     MOVE WS-CURDT-YYYYMMDD TO RPMST-LMNTDT.                      01454000
014550     MOVE 'Y' TO RPMST-OUT-FLAG.                                  01455000
014560     PERFORM RPS-MST-REPUT-REQUEST.                               01456000
014570     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01457000
014580         MOVE WS-AB6320 TO RPXXX04-ABORT                          01458000
014590         MOVE WS-TR0025 TO RPXXX04-ABTRACE                        01459000
014600         GO TO CICS-RETURN.                                       01460000
014610     MOVE 'Y' TO WS-UPDATESW.                                     01461000
014620 FRPR-EXIT.                                                       01462000
014630     EXIT.                                                        01463000
014640******************************************************************01464000
014650 REQUEST-CUSTOMER SECTION.                                        01465000
014660 RC-START.                                                        01466000
014670     MOVE SPACES TO RPRF21-FUNCTION.                              01467000
014680     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             01468000
014690     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         01469000
014700     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          01470000
014710     EXEC CICS LINK                                               01471000
014720         PROGRAM('RPO0RF21')                                      01472000
014730         COMMAREA(RPRF21-MESSAGE)                                 01473000
014740         LENGTH(LENGTH OF RPRF21-MESSAGE)                         01474000
014750         RESP(WS-CICS-RESPONSE)                                   01475000
014760         END-EXEC.                                                01476000
014770     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         01477000
014780     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     01478000
014790         MOVE 'L' TO WS-FUNCTION                                  01479000
014800         MOVE 500036 TO WS-MSGNBR                                 01480000
014810         GO TO RC-EXIT.                                           01481000
014820     IF WS-FUNCTION IS EQUAL TO 'B'                               01482000
014830         MOVE 500045 TO WS-MSGNBR                                 01483000
014840         GO TO RC-EXIT.                                           01484000
014850     IF WS-FUNCTION IS EQUAL TO 'C'                               01485000
014860         MOVE 500037 TO WS-MSGNBR                                 01486000
014870         GO TO RC-EXIT.                                           01487000
014880     IF WS-FUNCTION IS EQUAL TO 'I'                               01488000
014890         MOVE 500038 TO WS-MSGNBR.                                01489000
014900 RC-EXIT.                                                         01490000
014910     EXIT.                                                        01491000
014920******************************************************************01492000
014930 FIND-DEFAULT-MODEL SECTION.                                      01493000
014940 FDM-START.                                                       01494000
014950     MOVE 'N' TO WS-ERROR.                                        01495000
014960     MOVE RPXXX04-KEY-INST TO RPMST-INST.                         01496000
014970     MOVE RPXXX04-KEY-PRODCODE TO RPMST-PRODCODE.                 01497000
014980     MOVE RPXXX04-KEY-ACCOUNT TO RPMST-ACCOUNT.                   01498000
014990     IF RPXXX04-KEY-MODEL IS EQUAL TO LOW-VALUE                   01499000
015000         MOVE SPACES TO RPXXX04-KEY-MODEL.                        01500000
015010     MOVE RPXXX04-KEY-MODEL TO RPMST-MODEL.                       01501000
015020     PERFORM RPS-MST-GET-GE-REQUEST.                              01502000
015030     IF WS-FUNCTION IS EQUAL TO 'N'                               01503000
015040         OR WS-FUNCTION IS EQUAL TO 'E'                           01504000
015050         GO TO FDM-RECORD-NOT-FOUND.                              01505000
015060     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01506000
015070         MOVE WS-AB6320 TO RPXXX04-ABORT                          01507000
015080         MOVE WS-TR0030 TO RPXXX04-ABTRACE                        01508000
015090         MOVE 'Y' TO WS-ERROR                                     01509000
015100         GO TO FDM-EXIT.                                          01510000
015110     IF RPMST-INST IS EQUAL TO RPXXX04-KEY-INST                   01511000
015120         AND RPMST-PRODCODE IS EQUAL TO RPXXX04-KEY-PRODCODE      01512000
015130         AND RPMST-ACCOUNT IS EQUAL TO RPXXX04-KEY-ACCOUNT        01513000
015140         GO TO FDM-GET-NEXT-MST.                                  01514000
015150     GO TO FDM-RECORD-NOT-FOUND.                                  01515000
015160 FDM-GET-NEXT-MST.                                                01516000
015170     MOVE RPMST-MODEL TO RPXXX04-KEY-MODEL.                       01517000
015180     MOVE RPXXX04-KEY-INST TO WS-SAVEMSTINST.                     01518000
015190     MOVE RPXXX04-KEY-PRODCODE TO WS-SAVEMSTPRODCODE.             01519000
015200     MOVE RPXXX04-KEY-ACCOUNT TO WS-SAVEMSTACCOUNT.               01520000
015210     MOVE RPXXX04-KEY-MODEL TO WS-SAVEMSTMODEL.                   01521000
015220     PERFORM RPS-MST-GET-NEXT-REQUEST.                            01522000
015230     IF WS-FUNCTION IS EQUAL TO 'E'                               01523000
015240         GO TO FDM-GOOD-RECORD.                                   01524000
015250     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01525000
015260         MOVE WS-AB6320 TO RPXXX04-ABORT                          01526000
015270         MOVE WS-TR0031 TO RPXXX04-ABTRACE                        01527000
015280         MOVE 'Y' TO WS-ERROR                                     01528000
015290         GO TO FDM-EXIT.                                          01529000
015300     IF RPMST-INST IS EQUAL TO RPXXX04-KEY-INST                   01530000
015310         AND RPMST-PRODCODE IS EQUAL TO RPXXX04-KEY-PRODCODE      01531000
015320         AND RPMST-ACCOUNT IS EQUAL TO RPXXX04-KEY-ACCOUNT        01532000
015330         GO TO FDM-MULTIPLE-PRIM.                                 01533000
015340 FDM-GOOD-RECORD.                                                 01534000
015350     MOVE WS-SAVEMSTINST TO RPXXX04-KEY-INST.                     01535000
015360     MOVE WS-SAVEMSTPRODCODE TO RPXXX04-KEY-PRODCODE.             01536000
015370     MOVE WS-SAVEMSTACCOUNT TO RPXXX04-KEY-ACCOUNT.               01537000
015380     MOVE WS-SAVEMSTMODEL TO RPXXX04-KEY-MODEL.                   01538000
015390     GO TO FDM-EXIT.                                              01539000
015400 FDM-RECORD-NOT-FOUND.                                            01540000
015410     MOVE 'Y' TO WS-ERROR.                                        01541000
015420     MOVE 500004 TO RPXXX04-MSGNBR.                               01542000
015430     GO TO FDM-EXIT.                                              01543000
015440 FDM-MULTIPLE-PRIM.                                               01544000
015450     MOVE 'Y' TO WS-ERROR.                                        01545000
015460     MOVE 500090 TO RPXXX04-MSGNBR.                               01546000
015470 FDM-EXIT.                                                        01547000
015480     EXIT.                                                        01548000
015490******************************************************************01549000
015500 ADD-EVENT-HISTORY SECTION.                                       01550000
000000 COPY RPPEVTD.                                                    01551000
015520******************************************************************01552000
000000 COPY RPPACTA.                                                    01553000
015540******************************************************************01554000
000000 COPY RPPEVTA.                                                    01555000
015560******************************************************************01556000
000000 COPY RPPIDXA.                                                    01557000
015580******************************************************************01558000
000000 COPY RPPMSTA.                                                    01559000
015600******************************************************************01560000
000000 COPY RPPQUAA.                                                    01561000
015620******************************************************************01562000
000000 COPY RPPRELA.                                                    01563000
015640******************************************************************01564000
000000 COPY RPPSECA.                                                    01565000
015660******************************************************************01566000
015670 MIC-MST-API SECTION.                                             01567000
000000 COPY MIPMSTA.                                                    01568000
015690******************************************************************01569000
015700 NEXT-DATE-365 SECTION.                                           01570000
000000 COPY SRP009.                                                     01571000
015720******************************************************************01572000
015730 CALENDAR-365 SECTION.                                            01573000
000000 COPY SRP003.                                                     01574000
015750******************************************************************01575000
015760 JULIAN-365 SECTION.                                              01576000
000000 COPY SRP001.                                                     01577000
015780******************************************************************01578000
015790 SLP096-GET-2023-RECORD SECTION.                                  01579000
000000 COPY SLP096.                                                     01580000
015810******************************************************************01581000
015820 OPERATOR-DIALOG-SECURITY SECTION.                                01582000
000000 COPY SRP079.                                                     01583000
015840******************************************************************01584000
015850 CICS-ABORT-EXIT SECTION.                                         01585000
015860 CAE-START.                                                       01586000
015870     GO TO CICS-RETURN.                                           01587000
015880 CAE-EXIT.                                                        01588000
015890     EXIT.                                                        01589000
015900******************************************************************01590000
015910 CICS-RETURN SECTION.                                             01591000
015920     IF COM-ABORT IS NOT EQUAL TO ZERO                            01592000
015930         MOVE COM-ABORT TO RPXXX04-ABORT.                         01593000
015940     IF RPXXX04-ABORT IS NOT EQUAL TO ZERO                        01594000
015950         AND WS-UPDATESW IS EQUAL TO 'Y'                          01595000
015960         MOVE 'Y' TO RPXXX04-ABTYPE.                              01596000
015970     IF RPXXX04-ABORT IS NOT EQUAL TO ZERO                        01597000
015980         MOVE WS-FUNCTION TO RPXXX04-FUNCTION                     01598000
015990         MOVE SRB-BMDB TO RPXXX04-SRBMDB                          01599000
016000         MOVE EIBFN TO RPXXX04-ABEIBFN                            01600000
016010         MOVE EIBRESP TO RPXXX04-ABEIBRESP                        01601000
016020         MOVE EIBRESP2 TO RPXXX04-ABEIBRESP2                      01602000
016030         MOVE EIBRCODE TO RPXXX04-ABEIBRCODE.                     01603000
016040     IF RPXXX04-ABTYPE IS NOT EQUAL TO 'Y'                        01604000
016050         PERFORM GLOBAL-CLOSE.                                    01605000
000000 COPY SLP709.                                                     01606000
016070******************************************************************01607000
016080 GLOBAL-CLOSE SECTION.                                            01608000
016090 GC-START.                                                        01609000
016100     IF RPXXX04-GLOBAL-CLOSE IS NOT EQUAL TO 'N'                  01610000
016110         PERFORM RPS-MST-GLOBAL-CLOSE-REQUEST.                    01611000
016120 GC-EXIT.                                                         01612000
016130     EXIT.                                                        01613000
016140******************************************************************01614000
