000010 IDENTIFICATION DIVISION.                                         00001000
000020 PROGRAM-ID.             RPLXXX31.                                00002000
000000***************************************************************   00003000
000000*                                                             *   00003001
000000*                           NOTICE                            *   00003002
000000*                                                             *   00003003
000000*   THIS SOFTWARE IS THE PROPERTY OF AND CONTAINS             *   00003004
000000*   CONFIDENTIAL INFORMATION OF INFOR AND/OR ITS AFFILIATES   *   00003005
000000*   OR SUBSIDIARIES AND SHALL NOT BE DISCLOSED WITHOUT PRIOR  *   00003006
000000*   WRITTEN PERMISSION. LICENSED CUSTOMERS MAY COPY AND       *   00003007
000000*   ADAPT THIS SOFTWARE FOR THEIR OWN USE IN ACCORDANCE WITH  *   00003008
000000*   THE TERMS OF THEIR SOFTWARE LICENSE AGREEMENT.            *   00003009
000000*   ALL OTHER RIGHTS RESERVED.                                *   00003010
000000*                                                             *   00003011
000000*   (C) COPYRIGHT 2017 INFOR.  ALL RIGHTS RESERVED.           *   00003012
000000*   THE WORD AND DESIGN MARKS SET FORTH HEREIN ARE            *   00003013
000000*   TRADEMARKS AND/OR REGISTERED TRADEMARKS OF INFOR          *   00003014
000000*   AND/OR ITS AFFILIATES AND SUBSIDIARIES. ALL RIGHTS        *   00003015
000000*   RESERVED.  ALL OTHER TRADEMARKS LISTED HEREIN ARE         *   00003016
000000*   THE PROPERTY OF THEIR RESPECTIVE OWNERS.                  *   00003017
000000*                                                             *   00003018
000000***************************************************************   00003019
000000*     Infopoint Relationship Pricing                          *   00003020
000000*     RP 5.0.01                                               *   00003021
000000***************************************************************   00003022
000040******************************************************************00004000
000050*    RPLXXX31 - REAL TIME QUALIFY MODULE                         *00005000
000060******************************************************************00006000
000070 ENVIRONMENT DIVISION.                                            00007000
000080 DATA DIVISION.                                                   00008000
000090******************************************************************00009000
000100 WORKING-STORAGE SECTION.                                         00010000
000000 01  WS-COPYRIGHT                PIC X(057)      VALUE            00011000
000000     'COPYRIGHT 2017 INFOR. ALL RIGHTS RESERVED. WWW.INFOR.COM '. 00011001
000120 01  RPS-RLSELIT.                                                 00012000
000000 COPY RPWRLSE.                                                    00013000
000140 01  MIC-RLSELIT.                                                 00014000
000000 COPY MIWRLSE.                                                    00015000
000160*01  BICRSRB.                                                     00016000
000000 COPY BICRSRB.                                                    00017000
000180*01  BICRPSB.                                                     00018000
000000 COPY BICRPSB.                                                    00019000
000200*01  BICRVERB.                                                    00020000
000000 COPY BICRVERB.                                                   00021000
000220*01  BICRSTAT.                                                    00022000
000000 COPY BICRSTAT.                                                   00023000
000240*01  BICRDBS.                                                     00024000
000000 COPY BICRDBS.                                                    00025000
000260*01  BICRLOG.                                                     00026000
000000 COPY BICRLOG.                                                    00027000
000280*----------------------------------------------------------------*00028000
000290 01  SLS140-RECORD.                                               00029000
000000 COPY SLS140.                                                     00030000
000310 01  SLW096-AREAS.                                                00031000
000000 COPY SLW096.                                                     00032000
000330 01  SRW000-AREAS.                                                00033000
000000 COPY SRW000.                                                     00034000
000350 01  SRW009-AREAS.                                                00035000
000000 COPY SRW009.                                                     00036000
000370 01  SRW060-AREAS.                                                00037000
000000 COPY SRW060.                                                     00038000
000390 01  SRW105-AREAS.                                                00039000
000000 COPY SRW105.                                                     00040000
000410 01  SRW710-AREAS.                                                00041000
000000 COPY SRW710.                                                     00042000
000430*----------------------------------------------------------------*00043000
000440 01  RPWPRI-AREAS.                                                00044000
000000 COPY RPWPRI.                                                     00045000
000460 01  RPWBNK-AREAS.                                                00046000
000000 COPY RPWBNKA.                                                    00047000
000480 01  RPBNK-RECORD.                                                00048000
000000 COPY RPSBNK.                                                     00049000
000500 01  RPACTA-AREA.                                                 00050000
000000 COPY RPWACTA.                                                    00051000
000520 01  RPACT-RECORD.                                                00052000
000000 COPY RPSACT.                                                     00053000
000540 01  RPWMST-AREA.                                                 00054000
000000 COPY RPWMSTA.                                                    00055000
000560 01  RPMST-RECORD.                                                00056000
000000 COPY RPSMST.                                                     00057000
000580 01  RPWSEC-AREA.                                                 00058000
000000 COPY RPWSECA.                                                    00059000
000600 01  RPSEC-RECORD.                                                00060000
000000 COPY RPSSEC.                                                     00061000
000620*----------------------------------------------------------------*00062000
000630 01  MIWPRI-AREAS.                                                00063000
000000 COPY MIWPRI.                                                     00064000
000650 01  MIWMSTA-AREAS.                                               00065000
000000 COPY MIWMSTA.                                                    00066000
000670 01  FILLER                      PIC X(08)       VALUE '*MISMST*'.00067000
000680 01  MIMST-RECORD.                                                00068000
000000 COPY MISMST.                                                     00069000
000700 01  FILLER                      PIC X(08)       VALUE '*MISCSF*'.00070000
000710 01  MICSF-RECORD.                                                00071000
000000 COPY MISCSF.                                                     00072000
000730 01  FILLER                      PIC X(08)       VALUE '*MI0237*'.00073000
000740 01  MI0237-RECORD.                                               00074000
000000 COPY MIS0237A.                                                   00075000
000760 01  FILLER                      PIC X(08)       VALUE '*MI1001*'.00076000
000770 01  MI1001-RECORD.                                               00077000
000000 COPY MIS1001A.                                                   00078000
000790 01  FILLER                      PIC X(08)       VALUE '*MI2001*'.00079000
000800 01  MI2001-RECORD.                                               00080000
000000 COPY MIS2001A.                                                   00081000
000820 01  FILLER                      PIC X(08)       VALUE '*MI2023*'.00082000
000830 01  MI2023-RECORD.                                               00083000
000000 COPY MIS2023A.                                                   00084000
000850 01  FILLER                      PIC X(08)       VALUE '*MI2024*'.00085000
000860 01  MI2024-RECORD.                                               00086000
000000 COPY MIS2024A.                                                   00087000
000880 01  FILLER                      PIC X(08)       VALUE '*MI7100*'.00088000
000890 01  MI7100-RECORD.                                               00089000
000000 COPY MIS7100.                                                    00090000
000910 01  FILLER                      PIC X(08)       VALUE '*MI7101*'.00091000
000920 01  MI7101-RECORD.                                               00092000
000000 COPY MIS7101.                                                    00093000
000940 01  FILLER                      PIC X(08)       VALUE '*MI7102*'.00094000
000950 01  MI7102-RECORD.                                               00095000
000000 COPY MIS7102.                                                    00096000
000970 01  FILLER                      PIC X(08)       VALUE '*MI7104*'.00097000
000980 01  MI7104-RECORD.                                               00098000
000000 COPY MIS7104.                                                    00099000
001000 01  FILLER                      PIC X(08)       VALUE '*MI7105*'.00100000
001010 01  MI7105-RECORD.                                               00101000
000000 COPY MIS7105.                                                    00102000
001030 01  FILLER                      PIC X(08)       VALUE '*MI7106*'.00103000
001040 01  MI7106-RECORD.                                               00104000
000000 COPY MIS7106.                                                    00105000
001060 01  FILLER                      PIC X(08)       VALUE '*MI7107*'.00106000
001070 01  MI7107-RECORD.                                               00107000
000000 COPY MIS7107.                                                    00108000
001090 01  FILLER                      PIC X(08)       VALUE '*MI7107*'.00109000
001100 01  MI7110-RECORD.                                               00110000
000000 COPY MIS7110.                                                    00111000
001120*----------------------------------------------------------------*00112000
001130 01  WS-RPMIM2001AREAS.                                           00113000
000000 COPY RPW2001.                                                    00114000
001150 01  WS-RPMIM2023AREAS.                                           00115000
000000 COPY RPW2023.                                                    00116000
001170 01  WS-RPMIM7101AREAS.                                           00117000
000000 COPY RPW7101.                                                    00118000
001190 01  WS-RPMIM7102AREAS.                                           00119000
000000 COPY RPW7102.                                                    00120000
001210 01  WS-RPMIM7104AREAS.                                           00121000
000000 COPY RPW7104.                                                    00122000
001230 01  WS-RPMIM7105AREAS.                                           00123000
000000 COPY RPW7105.                                                    00124000
001250 01  WS-RPMIM7106AREAS.                                           00125000
000000 COPY RPW7106.                                                    00126000
001270 01  WS-RPMIM7107AREAS.                                           00127000
000000 COPY RPW7107.                                                    00128000
001290 01  WS-RPMIM7110AREAS.                                           00129000
000000 COPY RPW7110.                                                    00130000
001310*----------------------------------------------------------------*00131000
P0109  01  WS-PRIMRELCD-WORKAREA.                                       00131300
000000 COPY RPW006.                                                     00131600
001320 01  RPW015-AREAS.                                                00132000
000000 COPY RPW015.                                                     00133000
001340 01  RPW138-AREAS.                                                00134000
000000 COPY RPW138.                                                     00135000
001360*----------------------------------------------------------------*00136000
001370 01  WS-WORKAREAS.                                                00137000
001380     03  WS-MAX-PANEL-ENTRIES    PIC S9(04)      COMP             00138000
001390                                                 VALUE +0005.     00139000
001400     03  WS-VALID-MODEL-COUNT    PIC S9(04)      COMP             00140000
001410                                                 VALUE +0000.     00141000
001420     03  COM-ABORT               PIC S9(04)      COMP.            00142000
001430     03  WS-MAINPROGID           PIC X(08)       VALUE 'RPLXXX30'.00143000
001440     03  WS-QUALIFYPROGID        PIC X(08)       VALUE 'RPLXXX31'.00144000
001450     03  WS-MAX-MSG-MODELS       PIC S9(04)      COMP             00145000
001460                                                 VALUE +0005.     00146000
001470     03  WS-MAX-TSQ-MODELS       PIC S9(04)      COMP             00147000
001480                                                 VALUE +0005.     00148000
001490     03  WS-MAX-CATEGORY         PIC S9(04)      COMP             00149000
001500                                                 VALUE +0020.     00150000
001510     03  WS-RP-PRODCODE          PIC X(06)       VALUE 'RP'.      00151000
001520     03  WS-CAT-INST             PIC 9(04)       VALUE ZERO.      00152000
001530     03  WS-CAT-NBR              PIC X(06)       VALUE SPACES.    00153000
001540     03  WS-SAVE-ACCT-TYPE       PIC 9(03)       VALUE ZERO.      00154000
001550     03  WS-SAVE-PRODCODE        PIC X(06)       VALUE SPACES.    00155000
001560     03  WS-WORK-PRODCD          PIC X(06)       VALUE SPACES.    00156000
001570     03  WS-MODEL                PIC X(10)       VALUE SPACES.    00157000
001580     03  WS-LASTSCORE            PIC 9(03)       VALUE ZEROS.     00158000
P0044      03  WS-PRIMOPT-FAIL         PIC X(01)       VALUE SPACES.    00158500
001590     03  WS-RCIF-ACCTS-READ      PIC X(01).                       00159000
001600     03  WS-PRIM-FATAL-ERROR     PIC X(01).                       00160000
001610     03  WS-PRIM-CUST-EXISTS     PIC X(01).                       00161000
001620     03  WS-NUMOFACCOUNTS        PIC S9(05)      COMP-3           00162000
001630                                                 VALUE ZEROS.     00163000
001640     03  WS-NUMOFPRODUCTS        PIC S9(05)      COMP-3           00164000
001650                                                 VALUE ZEROS.     00165000
001660     03  WS-LAST-PRODCD          PIC X(06)       VALUE SPACES.    00166000
001670     03  WS-PRIMARY-APPL         PIC 9(02).                       00167000
001680     03  WS-WORK-APPL            PIC 9(02).                       00168000
001690     03  WS-LIMIT-MODELTYPE      PIC X(10)       VALUE SPACES.    00169000
001700     03  WS-MODEL-REQS           PIC X(01)       VALUE 'N'.       00170000
001710     03  WS-MIN-MAX-PROD-REQS    PIC X(01)       VALUE 'N'.       00171000
001720     03  WS-MIN-MAX-ACCT-REQS    PIC X(01)       VALUE 'N'.       00172000
001730     03  WS-PROD-GROUPS-REQS     PIC X(01)       VALUE 'N'.       00173000
001740     03  WS-PRODCODE-SEARCH      PIC X(06)       VALUE SPACES.    00174000
001750     03  WS-FOUND-PRODCODE       PIC X(01)       VALUE SPACE.     00175000
001760     03  WS-WORK-TYPE            PIC 9(03)       VALUE ZEROS.     00176000
001770     03  WS-RF21-RETURN          PIC X(01)       VALUE SPACE.     00177000
001780     03  WSRF21-BASE-RCIF-KEY.                                    00178000
001790         05  WSRF21-BASE-CUST-INST                                00179000
001800                                 PIC 9(04).                       00180000
001810         05  WSRF21-BASE-CUST-TYPE                                00181000
001820                                 PIC X(01).                       00182000
001830         05  WSRF21-BASE-CUST.                                    00183000
001840             07  WSRF21-BASE-ALPHA                                00184000
001850                                 PIC X(14).                       00185000
001860             07  WSRF21-BASE-ACCUM                                00186000
001870                                 PIC 9(03).                       00187000
001880             07  WSRF21-BASE-TIEBRKR                              00188000
001890                                 PIC 9(04).                       00189000
001900     03  WS-7102-DEF-FLAG        PIC X(01)       VALUE 'N'.       00190000
001910     03  WS-7102-DEF-RECORD      PIC X(125)      VALUE SPACES.    00191000
001920     03  WS-SAVE-MSGNBR          PIC 9(06)       VALUE ZEROS.     00192000
001930     03  WS-CURDTYYYYMMDD        PIC 9(08)       VALUE ZEROS.     00193000
001940     03  FILLER          REDEFINES WS-CURDTYYYYMMDD.              00194000
001950         05  WS-CURDTYYYY        PIC 9(04).                       00195000
001960         05  WS-CURDTMMDD        PIC 9(04).                       00196000
001970         05  FILLER      REDEFINES WS-CURDTMMDD.                  00197000
001980             07  WS-CURDTMM      PIC 9(02).                       00198000
001990             07  WS-CURDTDD      PIC 9(02).                       00199000
002000     03  WS-DATEMMDDYYYY         PIC 9(08)       VALUE ZEROS.     00200000
002010     03  WS-PDATE                PIC 9(08)       VALUE ZERO.      00201000
002020     03  FILLER          REDEFINES WS-PDATE.                      00202000
002030         05  WS-PDATE-YYYY       PIC 9(04).                       00203000
002040         05  WS-PDATE-MM         PIC 9(02).                       00204000
002050         05  WS-PDATE-DD         PIC 9(02).                       00205000
002060     03  WS-CURDT-YYYYMMDD       PIC S9(09)      COMP-3           00206000
002070                                                 VALUE ZERO.      00207000
002080     03  WS-CURDATE              PIC 9(08)       VALUE ZERO.      00208000
002090     03  FILLER          REDEFINES WS-CURDATE.                    00209000
002100         05  WS-CURMM            PIC 9(02).                       00210000
002110         05  WS-CURDD            PIC 9(02).                       00211000
002120         05  WS-CURYYYY          PIC 9(04).                       00212000
002130     03  WS-7101KEFFDT           PIC S9(09)      COMP-3           00213000
002140                                                 VALUE ZERO.      00214000
002150     03  WS-7106-TABLE.                                           00215000
002160         05  WS-7106-ENTRIES                     OCCURS 20 TIMES. 00216000
002170             07  WS-7106-INST    PIC 9(04).                       00217000
002180             07  WS-7106-CAT     PIC X(06).                       00218000
002190             07  WS-7106-BALREQ  PIC S9(09)V99   COMP-3.          00219000
002200     03  WS-ERRORMODEL           PIC X(01)       VALUE 'N'.       00220000
002210     03  WS-ERRORPRODCODE        PIC X(01)       VALUE 'N'.       00221000
002220     03  WS-MODEL-ERROR          PIC X(01)       VALUE 'N'.       00222000
002230     03  WS-SAVEMASTERGROUP.                                      00223000
002240         05  WS-SAVEMSTINST      PIC 9(04).                       00224000
002250         05  WS-SAVEMSTPRODCODE  PIC X(06).                       00225000
002260         05  WS-SAVEMSTACCOUNT   PIC X(18).                       00226000
002270         05  WS-SAVEMSTMODEL     PIC X(10).                       00227000
002280     03  WS-SAVESECGRPAIX1.                                       00228000
002290         05  WS-SAVSECAINST      PIC 9(04).                       00229000
002300         05  WS-SAVSECAACCOUNT   PIC X(18).                       00230000
002310         05  WS-SAVSECAPRODCODE  PIC X(06).                       00231000
P0109      03  WS-EXPIRED-MODEL        PIC X(10)       VALUE SPACES.    00231500
002320     03  WS-EXPIRED-STATUS       PIC X(01)       VALUE 'N'.       00232000
P0109      03  WS-EXPIRED-FLAG         PIC X(01)       VALUE 'N'.       00232500
002330     03  WS-ACCTRELCD-O          PIC S9(03)      COMP-3           00233000
002340                                                 VALUE ZEROS.     00234000
002350     03  WS-PRIMARY-ENROLL       PIC X(01)       VALUE 'N'.       00235000
002360     03  WS-EXPIRATION-DATE      PIC S9(09)      COMP-3.          00236000
002370     03  WS-HOLD-EXPIRATION-DATE PIC S9(09)      COMP-3.          00237000
002380     03  WS-MINACCTS             PIC S9(03)      COMP-3           00238000
002390                                                 VALUE ZEROS.     00239000
002400     03  WS-MINACCTS-PG          PIC S9(03)      COMP-3           00240000
002410                                                 VALUE ZEROS.     00241000
002420     03  WS-MAXSECACCTS          PIC S9(03)      COMP-3           00242000
002430                                                 VALUE ZEROS.     00243000
002440     03  WS-MINPRODS             PIC S9(03)      COMP-3           00244000
002450                                                 VALUE ZEROS.     00245000
002460     03  WS-MAXPRODS             PIC S9(03)      COMP-3           00246000
002470                                                 VALUE ZEROS.     00247000
002480     03  WS-MINACCTS-2           PIC S9(03)      COMP-3           00248000
002490                                                 VALUE ZEROS.     00249000
002500     03  WS-MAXACCTS-2           PIC S9(03)      COMP-3           00250000
002510                                                 VALUE ZEROS.     00251000
002520     03  WS-MINPROD-GRP          PIC S9(03)      COMP-3           00252000
002530                                                 VALUE ZEROS.     00253000
002540     03  WS-MAXPROD-GRP          PIC S9(03)      COMP-3           00254000
002550                                                 VALUE ZEROS.     00255000
P0134      03  WS-MAXACCTSUB           PIC S9(04)      COMP             00255200
P0134                                                  VALUE ZERO.      00255400
P0134      03  WS-MAXMODELSUB          PIC S9(04)      COMP             00255600
P0134                                                  VALUE ZERO.      00255800
002560*----------------------------------------------------------------*00256000
002570     03  WS-SUB1                 PIC S9(04)      COMP             00257000
002580                                                 VALUE +0000.     00258000
002590     03  WS-SUB2                 PIC S9(04)      COMP             00259000
002600                                                 VALUE +0000.     00260000
002610     03  WS-SUB3                 PIC S9(04)      COMP             00261000
002620                                                 VALUE +0000.     00262000
002630     03  WS-SUB4                 PIC S9(04)      COMP             00263000
002640                                                 VALUE +0000.     00264000
002650     03  WS-SUB5                 PIC S9(04)      COMP             00265000
002660                                                 VALUE +0000.     00266000
002670     03  WS-SUB6                 PIC S9(04)      COMP             00267000
002680                                                 VALUE +0000.     00268000
002690     03  WS-SUB7                 PIC S9(04)      COMP             00269000
002700                                                 VALUE +0000.     00270000
002710     03  WS-SUB8                 PIC S9(04)      COMP             00271000
002720                                                 VALUE +0000.     00272000
P0017      03  WS-SUB9                 PIC S9(04)      COMP             00272300
P0017                                                  VALUE +0000.     00272600
P0065      03  WS-SUB10                PIC S9(04)      COMP             00272700
P0065                                                  VALUE +0000.     00272800
002730     03  WS-SUBAUTO              PIC S9(04)      COMP             00273000
002740                                                 VALUE +0.        00274000
002750     03  WS-SUBINST              PIC S9(04)      COMP             00275000
002760                                                 VALUE +0.        00276000
002770     03  WS-SUBSEC               PIC S9(04)      COMP             00277000
002780                                                 VALUE +0.        00278000
P0109      03  WS-SUBSEC2              PIC S9(04)      COMP             00278300
P0109                                                  VALUE +0.        00278600
002790     03  WS-SUBPROD              PIC S9(04)      COMP             00279000
002800                                                 VALUE +0.        00280000
002810     03  WS-SUBPG                PIC S9(04)      COMP             00281000
002820                                                 VALUE +0.        00282000
002830     03  WS-SUBADD               PIC S9(04)      COMP             00283000
002840                                                 VALUE +0.        00284000
002850     03  WS-SUBPCODE             PIC S9(04)      COMP             00285000
002860                                                 VALUE +0.        00286000
002870*----------------------------------------------------------------*00287000
002880     03  WS-WORK-COMBBALCD       PIC 9(02)       VALUE ZEROS.     00288000
002890     03  WS-WORK-BALANCE         PIC S9(13)V99   COMP-3           00289000
002900                                                 VALUE ZEROS.     00290000
002910     03  WS-PRIMCATBAL           PIC S9(13)V99   COMP-3           00291000
002920                                                 VALUE ZEROS.     00292000
002930     03  WS-SECCATBAL            PIC S9(13)V99   COMP-3           00293000
002940                                                 VALUE ZEROS.     00294000
002950     03  WS-COMBINEBAL1          PIC S9(15)V99   COMP-3           00295000
002960                                                 VALUE ZEROS.     00296000
002970     03  WS-COMBINEBAL2          PIC S9(15)V99   COMP-3           00297000
002980                                                 VALUE ZEROS.     00298000
002990     03  WS-COMBINEBAL3          PIC S9(15)V99   COMP-3           00299000
003000                                                 VALUE ZEROS.     00300000
003010     03  WS-COMBINEBAL4          PIC S9(15)V99   COMP-3           00301000
003020                                                 VALUE ZEROS.     00302000
003030*----------------------------------------------------------------*00303000
003040     03  WS-PRIMARY-TABLE.                                        00304000
003050         05  WS-PRIM-INFO.                                        00305000
003060             07  WS-PRIM-FLAG    PIC X(01).                       00306000
003070             07  WS-PRIM-ACTREC  PIC X(01).                       00307000
003080             07  WS-PRIM-ACTREAD PIC X(01).                       00308000
003090             07  WS-PRIM-PRODCD  PIC X(06).                       00309000
003100             07  WS-PRIM-APPL    PIC 9(02).                       00310000
003110             07  WS-PRIM-BRANCH  PIC 9(05).                       00311000
003120             07  WS-PRIM-TYPE    PIC 9(03).                       00312000
003130             07  WS-PRIM-ACCT    PIC X(18).                       00313000
003140             07  WS-PRIM-SCNXT   PIC S9(09)      COMP-3.          00314000
003150             07  WS-PRIM-7102    PIC X(01).                       00315000
003160             07  WS-PRIM-MODEL   PIC X(10).                       00316000
003170             07  WS-PRIM-SCINCOPT                                 00317000
003180                                 PIC X(01).                       00318000
003190             07  WS-PRIM-RATEINCOPT                               00319000
003200                                 PIC X(01).                       00320000
003210             07  WS-PRIM-TIMEPROCOPT                              00321000
003220                                 PIC X(01).                       00322000
003230             07  WS-PRIM-PROD-GROUP                               00323000
003240                                 PIC 9(01).                       00324000
003250     03  WS-SECONDARY-MAX        PIC S9(04)      COMP             00325000
003260                                                 VALUE +1000.     00326000
003270     03  WS-SECONDARY-TABLE.                                      00327000
003280         05  WS-SEC-INFO                         OCCURS           00328000
003290                                                 1000 TIMES.      00329000
003310             07  WS-SEC-SKIP     PIC X(01).                       00331000
P0184              07  WS-SEC-ACTREAD  PIC X(01).                       00332000
P0184              07  WS-SEC-ACTREC   PIC X(01).                       00332590
003340             07  WS-SEC-PRODCD   PIC X(06).                       00334000
003350             07  WS-SEC-APPL     PIC 9(02).                       00335000
003360             07  WS-SEC-BRANCH   PIC 9(05).                       00336000
003370             07  WS-SEC-TYPE     PIC 9(03).                       00337000
003380             07  WS-SEC-INST     PIC 9(04).                       00338000
003390             07  WS-SEC-ACCT     PIC X(18).                       00339000
003400             07  WS-SEC-RELNBR   PIC 9(02).                       00340000
P0109              07  WS-SEC-PRIMCUSTRELNBR                            00341000
003420                                 PIC 9(02).                       00342000
003430             07  WS-SEC-RPOPT    PIC X(01).                       00343000
P0184              07  WS-SEC-ACT-SCINCOPT                              00343200
P0184                                  PIC X(01).                       00343400
P0184              07  WS-SEC-ACT-RATEINCOPT                            00343600
P0184                                  PIC X(01).                       00343800
003440     03  WS-SECONDARY-TABLE1.                                     00344000
003450         05  WS-SEC-INFO1                        OCCURS           00345000
003460                                                 1000 TIMES.      00346000
003550             07  WS-SEC-BAL1     PIC S9(15)V99   COMP-3.          00355000
003560             07  WS-SEC-BAL2     PIC S9(15)V99   COMP-3.          00356000
003570             07  WS-SEC-BAL3     PIC S9(15)V99   COMP-3.          00357000
003580             07  WS-SEC-BAL4     PIC S9(15)V99   COMP-3.          00358000
003590             07  WS-SEC-PROD-GROUP                                00359000
003600                                 PIC 9(01).                       00360000
003610             07  WS-SEC-7102     PIC X(01).                       00361000
P0017      03  WS-SECONDARY-TABLE2.                                     00361200
P0017          05  WS-SEC-INFO2                        OCCURS           00361400
P0017                                                  1000 TIMES.      00361600
P0017              07  WS-SEC-QUAL     PIC X(01).                       00361800
003620*----------------------------------------------------------------*00362000
P0044      03  WS-SAVE-MIM7104REC      PIC X(101).                      00362200
P0044      03  WS-SAVE-PRIM-RELCD      PIC 9(02).                       00362400
P0044 *----------------------------------------------------------------*00362600
003630     03  WS-APPLICATION-TABLE.                                    00363000
003640         05  WS-APPLTBL-INTRFACEX.                                00364000
003650             07  WS-INTRFACE     PIC X(08)       OCCURS 100 TIMES.00365000
003660     03  WS-CAC-MAX              PIC S9(04)      COMP             00366000
003670                                                 VALUE +33.       00367000
003680     03  WS-CAC-TABLE.                                            00368000
003690         05  WS-CAC-INFO                         OCCURS 33 TIMES. 00369000
003700             07  WS-CAC-INST     PIC 9(04).                       00370000
003710             07  WS-CAC-PRODCD   PIC X(06).                       00371000
003720             07  WS-CAC-ACCT     PIC X(18).                       00372000
003730             07  WS-CAC-RELNBR   PIC 9(02).                       00373000
003740         05 FILLER               PIC X(10)       VALUE SPACES.    00374000
003750     03  WS-PGSEARCH-MAX         PIC S9(04)      COMP             00375000
003760                                                 VALUE +99.       00376000
003770     03  WS-PGSEARCH-TABLE.                                       00377000
003780         05  WS-PGSEARCH                         OCCURS 99 TIMES. 00378000
003790             07  WS-PG-PRODCD    PIC X(06).                       00379000
003800             07  WS-PG-TYPE      PIC 9(03).                       00380000
003810             07  WS-PG-7102      PIC X(01).                       00381000
003820     03  WS-RPXXX30-CSTTBL-MAX   PIC S9(04)      COMP             00382000
003830                                                 VALUE +05.       00383000
003840     03  WS-RPXXX30-CUST-TABLE.                                   00384000
003850         05  WS-RPXXX30-CUSTOMERS                OCCURS 5 TIMES.  00385000
P0014              07  WS-RPXXX30-CUST-NO                               00385300
P0014                                  PIC 9(13).                       00385600
003860             07  WS-RPXXX30-CUST-NA                               00386000
003870                                 PIC X(40).                       00387000
003880             07  WS-RPXXX30-CUST-TYPE                             00388000
003890                                 PIC X(01).                       00389000
003900             07  WS-RPXXX30-TIE-BRKR                              00390000
003910                                 PIC 9(04).                       00391000
003920             07  WS-RPXXX30-REL-CODE                              00392000
003930                                 PIC X(02).                       00393000
003940             07  WS-RPXXX30-CUST-KEY.                             00394000
003950                 09  WS-RPXXX30-CUST-KEY-ALPHA                    00395000
003960                                 PIC X(14).                       00396000
003970                 09  WS-RPXXX30-ACCUM-VALUE                       00397000
003980                                 PIC 9(03).                       00398000
003990                 09  WS-RPXXX30-TIE-BREAKER                       00399000
004000                                 PIC 9(04).                       00400000
004010             07  WS-RPXXX30-FOUND-FLAG                            00401000
004020                                 PIC X(01).                       00402000
P0024 *----------------------------------------------------------------*00402200
P0024  01  RPW004-AREAS.                                                00402400
000000 COPY RPW004.                                                     00402600
004030*----------------------------------------------------------------*00403000
004080     03  WS-0237-MAX             PIC S9(04)      COMP             00408000
004090                                                 VALUE +1000.     00409000
004100     03  WS-0237-TABLE.                                           00410000
004110         05  WS-0237-INTRFACE                    OCCURS           00411000
004120                                                 1000 TIMES       00412000
004130                                 ASCENDING KEY IS WS-0237-KEY     00413000
004140                                 INDEXED BY INDX-0237.            00414000
004150             07  WS-0237-KEY.                                     00415000
004160                 09  WS-0237-INST                                 00416000
004170                                 PIC 9(04).                       00417000
004180                 09  WS-0237-APPL                                 00418000
004190                                 PIC 9(02).                       00419000
004200             07  WS-0237-INTF    PIC X(08).                       00420000
004210     03  WS-0237TEST-KEY.                                         00421000
004220         05  WS-0237TEST-INST    PIC 9(04).                       00422000
004230         05  WS-0237TEST-APPL    PIC 9(02).                       00423000
004240*----------------------------------------------------------------*00424000
004250     03  WS-PRODCODE-MAX         PIC S9(04)      COMP             00425000
004260                                                 VALUE +1000.     00426000
004270     03  WS-PRODCODE-TABLE.                                       00427000
004280         05  WS-PRODCODE-INFO                    OCCURS           00428000
004290                                                 1000 TIMES.      00429000
004300             07  WS-PRODCODE     PIC X(06).                       00430000
004310     03  WS-MODEL-SCORE-TABLE.                                    00431000
004320         05  WS-MS-MODELS                        OCCURS 999 TIMES.00432000
004330             07  WS-MS-SCORE     PIC 9(03).                       00433000
004340             07  WS-MS-MODEL     PIC X(10).                       00434000
004350             07  WS-MS-EXPIRATION-DATE                            00435000
004360                                 PIC S9(09)      COMP-3.          00436000
004370     03  WS-MS-MAX               PIC S9(04)      COMP             00437000
004380                                                 VALUE +0999.     00438000
004390*----------------------------------------------------------------*00439000
004400 01  WS-ABORT-CODES.                                              00440000
004410     03  WS-AB0009               PIC S9(04)      COMP             00441000
004420                                                 VALUE +0009.     00442000
004430     03  WS-AB2000               PIC S9(04)      COMP             00443000
004440                                                 VALUE +2000.     00444000
004450     03  WS-AB2033               PIC S9(04)      COMP             00445000
004460                                                 VALUE +2033.     00446000
004470     03  WS-AB3051               PIC S9(04)      COMP             00447000
004480                                                 VALUE +3051.     00448000
004490     03  WS-AB6305               PIC S9(04)      COMP             00449000
004500                                                 VALUE +6305.     00450000
004510     03  WS-AB6310               PIC S9(04)      COMP             00451000
004520                                                 VALUE +6310.     00452000
004530     03  WS-AB6320               PIC S9(04)      COMP             00453000
004540                                                 VALUE +6320.     00454000
004550     03  WS-AB6330               PIC S9(04)      COMP             00455000
004560                                                 VALUE +6330.     00456000
004570     03  WS-AB6335               PIC S9(04)      COMP             00457000
004580                                                 VALUE +6335.     00458000
004590*----------------------------------------------------------------*00459000
004600 01  WS-TRACE-CODES.                                              00460000
004610     03  WS-TR0001               PIC S9(04)      COMP             00461000
004620                                                 VALUE +0001.     00462000
004630     03  WS-TR0002               PIC S9(04)      COMP             00463000
004640                                                 VALUE +0002.     00464000
004650     03  WS-TR0003               PIC S9(04)      COMP             00465000
004660                                                 VALUE +0003.     00466000
004670     03  WS-TR0004               PIC S9(04)      COMP             00467000
004680                                                 VALUE +0004.     00468000
004690     03  WS-TR0005               PIC S9(04)      COMP             00469000
004700                                                 VALUE +0005.     00470000
004710     03  WS-TR0006               PIC S9(04)      COMP             00471000
004720                                                 VALUE +0006.     00472000
004730     03  WS-TR0007               PIC S9(04)      COMP             00473000
004740                                                 VALUE +0007.     00474000
004750*----------------------------------------------------------------*00475000
004760 01  WS-LINKAPPL.                                                 00476000
000000 COPY MISCNT00      REPLACING                                     00477000
004780     ==:MICNT:== BY ==RPINF00==.                                  00478000
000000 COPY RPSINF00.                                                   00479000
004800*----------------------------------------------------------------*00480000
004810 01  RPRF21-MESSAGE.                                              00481000
000000 COPY MISCNT00      REPLACING                                     00482000
004830             ==:MICNT:== BY ==RPRF21==.                           00483000
000000 COPY RPSRF21.                                                    00484000
004850*----------------------------------------------------------------*00485000
004860 01  WS-LINKUSER.                                                 00486000
000000 COPY MISCNT00      REPLACING                                     00487000
004880     ==:MICNT:== BY ==RPUSER==.                                   00488000
000000 COPY RPWUSER.                                                    00489000
004900******************************************************************00490000
004910 LINKAGE SECTION.                                                 00491000
004920 01  DFHCOMMAREA.                                                 00492000
000000 COPY MISCNT00      REPLACING                                     00493000
004940             ==:MICNT:== BY ==RPXXX30==.                          00494000
000000 COPY RPSXXX30.                                                   00495000
004960*01  SLW096-2023RECORDS.                                          00496000
000000 COPY SLW096L.                                                    00497000
004980******************************************************************00498000
004990 PROCEDURE DIVISION.                                              00499000
005000******************************************************************00500000
005010 ENTRY-ROUTINE SECTION.                                           00501000
005020 ER-START.                                                        00502000
005030     MOVE WS-QUALIFYPROGID TO SR-APIPROGLIT.                      00503000
005040     MOVE WS-QUALIFYPROGID TO RPXXX30-ABPROGID.                   00504000
005050     PERFORM CICS-HANDLE-CONDITION.                               00505000
005060     IF EIBCALEN IS EQUAL TO +0                                   00506000
005070         MOVE WS-AB2000 TO RPXXX30-ABORT                          00507000
005080         MOVE WS-AB2000 TO RPXXX30-RESP-ABORT                     00508000
005090         MOVE WS-TR0001 TO RPXXX30-ABTRACE                        00509000
005100         MOVE WS-TR0001 TO RPXXX30-RESP-TRACE                     00510000
005110         GO TO CICS-RETURN.                                       00511000
005120     MOVE ZERO TO RPXXX30-RESP-MSG-NBR.                           00512000
005130     MOVE SPACE TO WS-FUNCTION.                                   00513000
005140     MOVE ZEROS TO WS-SAVE-MSGNBR.                                00514000
005150     MOVE RPXXX30-FILEOPTS TO WS-FILEOPTS.                        00515000
005160     MOVE RPXXX30-OPERID TO WS-UPD-USER.                          00516000
000000 COPY SLP094.                                                     00517000
005180     GO TO VERIFY-KEY.                                            00518000
005190 ER-EXIT.                                                         00519000
005200     EXIT.                                                        00520000
005210******************************************************************00521000
005220 CICS-HANDLE-CONDITION SECTION.                                   00522000
000000 COPY SLP702.                                                     00523000
005240     MOVE WS-AB2033 TO RPXXX30-ABORT.                             00524000
005250     MOVE WS-AB2033 TO RPXXX30-RESP-ABORT.                        00525000
005260     MOVE WS-TR0002 TO RPXXX30-ABTRACE.                           00526000
005270     MOVE WS-TR0002 TO RPXXX30-RESP-TRACE.                        00527000
005280     GO TO CICS-RETURN.                                           00528000
005290 CHC-EXIT.                                                        00529000
005300     EXIT.                                                        00530000
005310******************************************************************00531000
005320 VERIFY-KEY SECTION.                                              00532000
005330 VK-START.                                                        00533000
005340     INITIALIZE WS-ACC-TABLE.                                     00534000
005350     MOVE ZERO TO COM-ABORT.                                      00535000
005360     MOVE 'N' TO RPXXX30-DELETE-REL.                              00536000
005370     MOVE ZERO TO RPXXX30-ABORT.                                  00537000
005380     MOVE ZERO TO RPXXX30-MSGNBR.                                 00538000
005390     MOVE SPACES TO RPXXX30-FUNCTION.                             00539000
005400     MOVE RPXXX30-DATE TO WS-CURDATE.                             00540000
005410     MOVE WS-CURMM TO WS-PDATE-MM.                                00541000
005420     MOVE WS-CURDD TO WS-PDATE-DD.                                00542000
005430     MOVE WS-CURYYYY TO WS-PDATE-YYYY.                            00543000
005440     MOVE WS-PDATE TO WS-CURDT-YYYYMMDD.                          00544000
005450     MOVE RPXXX30-PRIMARY-INST TO RPBNK-INST.                     00545000
005460     PERFORM RPS-BNK-GET-REQUEST.                                 00546000
005470     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00547000
005480         MOVE WS-TR0003 TO RPXXX30-ABTRACE                        00548000
005490         MOVE WS-TR0003 TO RPXXX30-RESP-TRACE                     00549000
005500         MOVE WS-AB6305 TO RPXXX30-ABORT                          00550000
005510         MOVE WS-AB6305 TO RPXXX30-RESP-ABORT                     00551000
005520         GO TO VK-RETURN.                                         00552000
P0024      MOVE RPBNK-CURDT TO WS-CURDTYYYYMMDD.                        00552500
005530 VK-KEY.                                                          00553000
005540     IF RPXXX30-PRIMARY-INST IS NOT NUMERIC                       00554000
005550         OR RPXXX30-PRIMARY-INST IS EQUAL TO ZEROS                00555000
005560         MOVE 000002 TO RPXXX30-MSGNBR                            00556000
005570         MOVE 000002 TO RPXXX30-RESP-MSG-NBR                      00557000
005580         GO TO VK-RETURN.                                         00558000
005590     IF RPXXX30-PRIMARY-PROD-CODE IS EQUAL TO SPACES              00559000
005600         OR RPXXX30-PRIMARY-PROD-CODE IS EQUAL TO LOW-VALUES      00560000
005610         MOVE 000002 TO RPXXX30-MSGNBR                            00561000
005620         MOVE 000002 TO RPXXX30-RESP-MSG-NBR                      00562000
005630         GO TO VK-RETURN.                                         00563000
005640     IF RPXXX30-PRIMARY-ACCT-NBR IS EQUAL TO SPACES               00564000
005650         OR RPXXX30-PRIMARY-ACCT-NBR IS EQUAL TO LOW-VALUES       00565000
005660         MOVE 000002 TO RPXXX30-MSGNBR                            00566000
005670         MOVE 000002 TO RPXXX30-RESP-MSG-NBR                      00567000
005680         GO TO VK-RETURN.                                         00568000
005690 VK-MODEL.                                                        00569000
005700     IF RPXXX30-PRIMARY-MODEL IS GREATER THAN SPACES              00570000
005710         MOVE 500611 TO RPXXX30-MSGNBR                            00571000
005720         MOVE 500611 TO RPXXX30-RESP-MSG-NBR                      00572000
005730         GO TO VK-RETURN.                                         00573000
005740     IF RPXXX30-MODEL-TYPE IS GREATER THAN SPACES                 00574000
005750         MOVE RPXXX30-MODEL-TYPE TO WS-LIMIT-MODELTYPE.           00575000
005760 VK-7100.                                                         00576000
005770     PERFORM READ-MICM-7100.                                      00577000
005780     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00578000
005790         MOVE 500005 TO RPXXX30-MSGNBR                            00579000
005800         MOVE 500005 TO RPXXX30-RESP-MSG-NBR                      00580000
005810         GO TO VK-RETURN.                                         00581000
005820 VK-LOAD-RPXXX30-CUST-TABLE.                                      00582000
005830     MOVE +0 TO WS-SUB5.                                          00583000
005840     MOVE +0 TO WS-SUB6.                                          00584000
005850     INITIALIZE WS-RPXXX30-CUST-TABLE.                            00585000
P0109      IF RPXXX30-REL-CODE (1) IS NOT EQUAL TO SPACES               00585300
P0109          MOVE RPXXX30-REL-CODE (1) TO WS-RPXXX30-REL-CODE (1).    00585600
005860 VK-LRCUST-TABLE-LOOP.                                            00586000
005870     ADD +1 TO WS-SUB6.                                           00587000
005880     IF WS-SUB6 IS GREATER THAN WS-RPXXX30-CSTTBL-MAX             00588000
005890         GO TO VK-CHECK-PRIMARY-CUSTOMER.                         00589000
005900     IF RPXXX30-CUST-NA (WS-SUB6) IS EQUAL TO SPACES              00590000
P0014          AND RPXXX30-CUST-NO (WS-SUB6) IS EQUAL TO ZEROS          00590500
P0184          AND RPXXX30-REL-CODE (WS-SUB6) IS EQUAL TO SPACES        00590700
005910         GO TO VK-LRCUST-TABLE-LOOP.                              00591000
005920     ADD +1 TO WS-SUB5.                                           00592000
005930     MOVE RPXXX30-CUSTOMER-DATA (WS-SUB6)                         00593000
005940         TO WS-RPXXX30-CUSTOMERS (WS-SUB5).                       00594000
005950     MOVE 'N' TO WS-RPXXX30-FOUND-FLAG (WS-SUB5).                 00595000
005960     GO TO VK-LRCUST-TABLE-LOOP.                                  00596000
005970 VK-CHECK-PRIMARY-CUSTOMER.                                       00597000
005980     MOVE 'N' TO WS-PRIM-CUST-EXISTS.                             00598000
005990     MOVE 'G' TO RPRF21-FUNC.                                     00599000
006000     MOVE 'N' TO MIM-7101CLOSEDACCTOPT.                           00600000
006010     MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST.          00601000
006020     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00602000
006030         AND MIM-7100ENTERPRISEINST IS GREATER THAN ZEROS         00603000
006040         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00604000
006050     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPRF21-BASE-ACCT-PRODCODE. 00605000
006060     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPRF21-BASE-ACCT.           00606000
006070     PERFORM REQUEST-CUSTOMER.                                    00607000
006080     IF RPXXX30-MSGNBR IS NOT EQUAL TO ZEROS                      00608000
006090         GO TO VK-RETURN.                                         00609000
006150     IF WS-FUNCTION IS EQUAL TO 'N'                               00615000
006160         GO TO VK-7101.                                           00616000
006170     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00617000
006180         MOVE 500622 TO RPXXX30-MSGNBR                            00618000
006190         MOVE 500622 TO RPXXX30-RESP-MSG-NBR                      00619000
006200         GO TO VK-RETURN.                                         00620000
006210     MOVE 'Y' TO WS-PRIM-CUST-EXISTS.                             00621000
006220 VK-7101.                                                         00622000
006230     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7101INST.               00623000
006240     COMPUTE WS-RPMIM7101EFFDT = WS-CURDT-YYYYMMDD - 99999999.    00624000
006250     PERFORM LOAD-RPS-7101.                                       00625000
006260     IF WS-RPMIM7101ERROR IS EQUAL TO 'Y'                         00626000
006290         MOVE 500006 TO RPXXX30-MSGNBR                            00629000
006300         MOVE 500006 TO RPXXX30-RESP-MSG-NBR                      00630000
006310         GO TO VK-RETURN.                                         00631000
006320     PERFORM BUILD-MODEL-TABLE.                                   00632000
006330 VK-7102.                                                         00633000
006340     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7102INST.               00634000
006350     PERFORM LOAD-RPS-7102.                                       00635000
006360     IF WS-RPMIM7102ERROR IS EQUAL TO 'Y'                         00636000
006390         MOVE 500007 TO RPXXX30-MSGNBR                            00639000
006400         MOVE 500007 TO RPXXX30-RESP-MSG-NBR                      00640000
006410         GO TO VK-RETURN.                                         00641000
006420 VK-7104.                                                         00642000
006430     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7104INST.               00643000
006440     PERFORM LOAD-RPS-7104.                                       00644000
006450     IF WS-RPMIM7104ERROR IS EQUAL TO 'Y'                         00645000
006480         MOVE 500009 TO RPXXX30-MSGNBR                            00648000
006490         MOVE 500009 TO RPXXX30-RESP-MSG-NBR                      00649000
006500         GO TO VK-RETURN.                                         00650000
006510 VK-7106.                                                         00651000
006520     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7106INST.               00652000
006530     PERFORM LOAD-RPS-7106.                                       00653000
006540     IF WS-RPMIM7106ERROR IS EQUAL TO 'Y'                         00654000
006570         MOVE 500011 TO RPXXX30-MSGNBR                            00657000
006580         MOVE 500011 TO RPXXX30-RESP-MSG-NBR                      00658000
006590         GO TO VK-RETURN.                                         00659000
006600 VK-REC7107.                                                      00660000
006610     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7107INST.               00661000
006620     PERFORM LOAD-RPS-7107.                                       00662000
006630     IF WS-RPMIM7107ERROR IS EQUAL TO 'Y'                         00663000
006660         MOVE 500012 TO RPXXX30-MSGNBR                            00666000
006670         MOVE 500012 TO RPXXX30-RESP-MSG-NBR                      00667000
006680         GO TO VK-RETURN.                                         00668000
006690 VK-REC7110.                                                      00669000
006700     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7110INST.               00670000
006710     PERFORM LOAD-RPS-7110.                                       00671000
006720     IF WS-RPMIM7110ERROR IS EQUAL TO 'Y'                         00672000
006750         MOVE 500081 TO RPXXX30-MSGNBR                            00675000
006760         MOVE 500081 TO RPXXX30-RESP-MSG-NBR                      00676000
006770         GO TO VK-RETURN.                                         00677000
006780 VK-REC2001.                                                      00678000
006790     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM2001INST.               00679000
006800     PERFORM LOAD-RPS-2001.                                       00680000
006810     IF WS-RPMIM2001ERROR IS EQUAL TO 'Y'                         00681000
006840         MOVE 500097 TO RPXXX30-MSGNBR                            00684000
006850         MOVE 500097 TO RPXXX30-RESP-MSG-NBR                      00685000
006860         GO TO VK-RETURN.                                         00686000
006870 VK-REC0237.                                                      00687000
006880     MOVE SPACES TO WS-APPLICATION-TABLE.                         00688000
006890     MOVE SPACES TO MI0237-RECORD.                                00689000
006900     MOVE RPBNK-INST TO MIM-0237KINST.                            00690000
006910     MOVE +0237 TO MIM-0237KREC.                                  00691000
006920     MOVE 50 TO MIM-0237KPROCMGR.                                 00692000
006930     MOVE ZEROS TO MIM-0237KINTAPPL.                              00693000
006940     MOVE MIC-MST-0237-PRI TO MIC-MST-REC-PRI.                    00694000
006950     MOVE MI0237-RECORD TO MIMST-RECORD.                          00695000
006960     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00696000
006970     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00697000
006980         MOVE 500024 TO RPXXX30-MSGNBR                            00698000
006990         MOVE 500024 TO RPXXX30-RESP-MSG-NBR                      00699000
007000         GO TO VK-RETURN.                                         00700000
007010     GO TO VK-REC0237CONT.                                        00701000
007020 VK-REC0237READ.                                                  00702000
007030     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00703000
007040     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00704000
007050         GO TO VK-2023.                                           00705000
007060 VK-REC0237CONT.                                                  00706000
007070     MOVE MIMST-RECORD TO MI0237-RECORD.                          00707000
007080     IF MIM-0237KINST IS NOT EQUAL TO RPBNK-INST                  00708000
007090         OR MIM-0237KPROCMGR IS NOT EQUAL TO 50                   00709000
007100         GO TO VK-2023.                                           00710000
007110     IF MIM-0237KINTAPPL IS EQUAL TO ZEROS                        00711000
007120         MOVE MIM-237OLINTFC TO WS-INTRFACE (100)                 00712000
007130     ELSE                                                         00713000
007140         MOVE MIM-237OLINTFC TO WS-INTRFACE (MIM-0237KINTAPPL).   00714000
007150     GO TO VK-REC0237READ.                                        00715000
007160 VK-2023.                                                         00716000
007170     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM2023INST.               00717000
007180     PERFORM LOAD-RPS-2023.                                       00718000
007190     MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-RPMIM2023PRODCD.        00719000
007200     PERFORM SEARCH-RPS-2023.                                     00720000
007210     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         00721000
007220         MOVE 500001 TO RPXXX30-MSGNBR                            00722000
007230         MOVE 500001 TO RPXXX30-RESP-MSG-NBR                      00723000
007240         GO TO VK-RETURN.                                         00724000
007250     IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO ' '              00725000
007260         OR WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'N'          00726000
007270         MOVE 500015 TO RPXXX30-MSGNBR                            00727000
007280         MOVE 500015 TO RPXXX30-RESP-MSG-NBR                      00728000
007290         GO TO VK-RETURN.                                         00729000
007300     MOVE MIM-2023INTAPPL211 TO WS-PRIMARY-APPL.                  00730000
007310 VK-2024.                                                         00731000
P0024      MOVE SPACES TO WS-2024INSTS.                                 00732000
P0024      MOVE SPACES TO WS-SEARCH-TABLE.                              00732290
007330     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'N'                     00733000
P0024          GO TO VK-EXIT.                                           00734000
P0024      MOVE +1 TO WS-SSUB.                                          00734390
P0024      MOVE 'Y' TO WS-2024-EXISTS (RPBNK-INST).                     00734780
P0024      MOVE 1 TO WS-STBL-SUB (RPBNK-INST).                          00735170
P0024      MOVE RPXXX30-FILEOPTS TO WS-SEARCH-OPT (1).                  00735560
P0024      MOVE ZEROS TO MIM-2024KINST.                                 00735950
P0024      MOVE 2024 TO MIM-2024KREC.                                   00736340
P0155      MOVE RPXXX30-PRIMARY-INST TO MIM-2024KGROUP-INST.            00736730
P0024      MOVE ZEROS TO MIM-2024KACCESS-INST.                          00737120
007380     MOVE MIC-MST-2024-PRI TO MIC-MST-REC-PRI.                    00738000
007390     MOVE 50 TO MIM-2024KMANGER.                                  00739000
007400     MOVE MI2024-RECORD TO MIMST-RECORD.                          00740000
P0155      PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00741000
P0155      GO TO VK-2024-CONT.                                          00742000
007430 VK-2024-READ.                                                    00743000
007440     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00744000
007450 VK-2024-CONT.                                                    00745000
007460     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00746000
P0024          GO TO VK-EXIT.                                           00747000
007480     MOVE MIMST-RECORD TO MI2024-RECORD.                          00748000
007490     IF MIM-2024KINST IS NOT EQUAL TO ZEROS                       00749000
P0024          GO TO VK-EXIT.                                           00750000
007510     IF MIM-2024KMANGER IS NOT EQUAL TO 50                        00751000
P0024          OR MIM-2024KGROUP-INST                                   00752000
P0024              IS NOT EQUAL TO RPXXX30-PRIMARY-INST                 00752490
P0024          GO TO VK-EXIT.                                           00752980
007540     IF MIM-2024KACCESS-INST IS EQUAL TO ZEROS                    00754000
P0024          OR MIM-2024KGROUP-INST                                   00754300
P0024              IS EQUAL TO MIM-2024KACCESS-INST                     00754600
007550         GO TO VK-2024-READ.                                      00755000
P0024      ADD +1 TO WS-SSUB.                                           00756000
P0024      MOVE 'Y' TO WS-2024-EXISTS (MIM-2024KACCESS-INST).           00756490
P0024      MOVE WS-SSUB TO WS-STBL-SUB (MIM-2024KACCESS-INST).          00756980
007580 VK-2024-CONTINUE.                                                00758000
P0024      MOVE RPXXX30-OPERID TO WS-ACCESS-OPERID.                     00759000
P0024      MOVE RPXXX30-PROFILE TO WS-ACCESS-PROFILE.                   00761990
P0024      MOVE RPXXX30-EXTERNALID TO WS-ACCESS-EXTERNALID.             00764980
P0155      MOVE RPXXX30-PRIMARY-INST TO WS-ACCESS-PRIM-INST.            00767970
P0024      MOVE MIM-2024KACCESS-INST TO WS-ACCESS-ALT-INST.             00770960
P0024      PERFORM CROSS-INSTITUTION.                                   00773950
P0024      IF WS-RPP004-ERROR IS EQUAL TO 'Y'                           00776940
P0024          MOVE 500088 TO RPXXX30-MSGNBR                            00779930
P0024          MOVE 500088 TO RPXXX30-RESP-MSG-NBR                      00782920
P0024          GO TO VK-RETURN.                                         00785910
P0024      MOVE WS-ACCESS-FILEOPTS TO WS-SEARCH-OPT (WS-SSUB).          00788900
P0024      GO TO VK-2024-READ.                                          00791890
007990 VK-RETURN.                                                       00799000
008000     MOVE 'E' TO RPXXX30-RETURN.                                  00800000
008010     GO TO CICS-RETURN.                                           00801000
008020 VK-EXIT.                                                         00802000
008030     EXIT.                                                        00803000
008040******************************************************************00804000
008050 FIND-VALID-MODELS SECTION.                                       00805000
008060 FVM-START.                                                       00806000
008070     INITIALIZE WS-SECONDARY-TABLE.                               00807000
P0017      INITIALIZE WS-SECONDARY-TABLE1.                              00807300
P0017      INITIALIZE WS-SECONDARY-TABLE2.                              00807600
P0065      INITIALIZE WS-PRIMARY-TABLE.                                 00807700
P0134      MOVE ZEROS TO WS-MAXMODELSUB.                                00807750
P0065      MOVE 'N' TO WS-RCIF-ACCTS-READ.                              00807800
008080     MOVE RPXXX30-LAST-MODELSUB TO WS-SUB1.                       00808000
008090     MOVE ZERO TO WS-VALID-MODEL-COUNT.                           00809000
008100 FVM-MODEL-LOOP.                                                  00810000
008110     ADD +1 TO WS-VALID-MODEL-COUNT.                              00811000
008120     IF WS-VALID-MODEL-COUNT IS GREATER THAN WS-MAX-PANEL-ENTRIES 00812000
008130         GO TO FVM-ENDIT.                                         00813000
008140     ADD +1 TO WS-SUB1.                                           00814000
008150     IF WS-SUB1 IS GREATER THAN WS-MS-MAX                         00815000
008160         GO TO FVM-ENDIT.                                         00816000
008170     IF WS-MS-MODEL (WS-SUB1) IS EQUAL TO SPACES                  00817000
008180         AND WS-VALID-MODEL-COUNT IS EQUAL TO ZERO                00818000
008190         MOVE 'Y' TO WS-MODEL-ERROR                               00819000
008200         MOVE 500006 TO RPXXX30-MSGNBR                            00820000
008210         MOVE 500006 TO RPXXX30-RESP-MSG-NBR                      00821000
008220         GO TO FVM-ENDIT.                                         00822000
008230     IF WS-MS-MODEL (WS-SUB1) IS EQUAL TO SPACES                  00823000
008240         AND WS-VALID-MODEL-COUNT IS GREATER THAN ZERO            00824000
008250         IF WS-VALID-MODEL-COUNT IS EQUAL TO 1                    00825000
008260             SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                00826000
008270         END-IF                                                   00827000
008280         GO TO FVM-ENDIT                                          00828000
008290     END-IF.                                                      00829000
008300     MOVE WS-MS-MODEL (WS-SUB1) TO WS-MODEL.                      00830000
008310     MOVE WS-MS-EXPIRATION-DATE (WS-SUB1)                         00831000
008320         TO WS-HOLD-EXPIRATION-DATE.                              00832000
008330 FVM-7101.                                                        00833000
008340     MOVE WS-MODEL TO WS-RPMIM7101MODEL.                          00834000
008350     PERFORM SEARCH-RPS-7101.                                     00835000
008360     IF WS-RPMIM7101FOUND IS EQUAL TO 'N'                         00836000
008370         MOVE 'Y' TO WS-MODEL-ERROR                               00837000
008380         MOVE '500006' TO RPXXX30-MSGNBR                          00838000
008390         MOVE '500006' TO RPXXX30-RESP-MSG-NBR                    00839000
008400         GO TO FVM-ENDIT.                                         00840000
008410     IF MIM-7101ACTCD IS EQUAL TO 'A'                             00841000
008420         NEXT SENTENCE                                            00842000
008430     ELSE                                                         00843000
008440         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00844000
008450         GO TO FVM-MODEL-LOOP.                                    00845000
008460     IF RPXXX30-MODEL-TYPE IS EQUAL TO SPACES                     00846000
008470         GO TO FVM-7101-CLOSEDDT.                                 00847000
008480     IF MIM-7101MODELTYPE IS NOT EQUAL TO RPXXX30-MODEL-TYPE      00848000
008490         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00849000
008500         GO TO FVM-MODEL-LOOP.                                    00850000
008510 FVM-7101-CLOSEDDT.                                               00851000
008520     IF MIM-7101CLOSEDT IS EQUAL TO ZEROS                         00852000
008530         GO TO FVM-7101-EXPDT.                                    00853000
P0004      IF WS-CURDT-YYYYMMDD IS GREATER THAN MIM-7101CLOSEDT         00854000
008550         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00855000
008560         GO TO FVM-MODEL-LOOP.                                    00856000
008570 FVM-7101-EXPDT.                                                  00857000
008580     MOVE ZEROS TO WS-EXPIRATION-DATE.                            00858000
008590     IF WS-HOLD-EXPIRATION-DATE IS NOT EQUAL TO ZEROS             00859000
008600         MOVE WS-HOLD-EXPIRATION-DATE TO WS-EXPIRATION-DATE       00860000
008610         GO TO FVM-PASSED-EXPDT.                                  00861000
008620     IF MIM-7101EXPDT IS EQUAL TO ZEROS                           00862000
008630         GO TO FVM-CAL-EXPDATE.                                   00863000
P0024      IF MIM-7101EXPDT IS GREATER THAN RPBNK-CURDT                 00864000
008650         MOVE MIM-7101EXPDT TO WS-EXPIRATION-DATE                 00865000
008660         MOVE MIM-7101EXPDT TO WS-MS-EXPIRATION-DATE (WS-SUB1)    00866000
008670         GO TO FVM-PASSED-EXPDT.                                  00867000
008680     SUBTRACT +1 FROM WS-VALID-MODEL-COUNT.                       00868000
008690     GO TO FVM-MODEL-LOOP.                                        00869000
008700 FVM-CAL-EXPDATE.                                                 00870000
008710     IF MIM-7101EXPFREQ IS EQUAL TO 'N'                           00871000
008720         GO TO FVM-PASSED-EXPDT.                                  00872000
008730     MOVE MIM-7101EXPFREQ TO SR-PERIOD.                           00873000
008740     MOVE MIM-7101EXPTERM TO SR-FREQ.                             00874000
008750     IF MIM-7101EXPFREQ IS EQUAL TO 'M'                           00875000
008760         AND MIM-7101ENDOFMONTH IS EQUAL TO 'Y'                   00876000
008770         MOVE 31 TO SR-DAY                                        00877000
008780     ELSE                                                         00878000
008790         MOVE ZEROS TO SR-DAY.                                    00879000
008800     MOVE WS-CURDTYYYY TO SR-FCYR.                                00880000
008810     MOVE WS-CURDTMM TO SR-FCMON.                                 00881000
008820     MOVE WS-CURDTDD TO SR-FCDAY.                                 00882000
008830     PERFORM JULIAN-365.                                          00883000
008840     MOVE SR-TOJUL TO SR-FROMJUL.                                 00884000
008850     PERFORM NEXT-DATE-365.                                       00885000
008860     MOVE SR-TOJUL TO SR-FROMJUL.                                 00886000
008870     PERFORM CALENDAR-365.                                        00887000
008880     MOVE SR-TCMON TO WS-PDATE-MM.                                00888000
008890     MOVE SR-TCDAY TO WS-PDATE-DD.                                00889000
008900     MOVE SR-TCYR TO WS-PDATE-YYYY.                               00890000
P0024      IF RPBNK-CURDT IS NOT GREATER THAN WS-PDATE                  00891000
008920         MOVE WS-PDATE TO WS-EXPIRATION-DATE                      00892000
008930         MOVE WS-PDATE TO WS-MS-EXPIRATION-DATE (WS-SUB1)         00893000
008940         GO TO FVM-PASSED-EXPDT.                                  00894000
008950     SUBTRACT +1 FROM WS-VALID-MODEL-COUNT.                       00895000
008960     GO TO FVM-MODEL-LOOP.                                        00896000
008970 FVM-PASSED-EXPDT.                                                00897000
008980     IF RPXXX30-NEW-EXPIRE-DATE IS EQUAL TO ZEROS                 00898000
008990         GO TO FVM-VALIDATE.                                      00899000
P0024      IF RPXXX30-NEW-EXPIRE-DATE IS NOT GREATER THAN RPBNK-CURDT   00900000
009010         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00901000
009020         GO TO FVM-MODEL-LOOP.                                    00902000
009030     IF RPXXX30-NEW-EXPIRE-DATE IS GREATER THAN ZEROS             00903000
009040         AND WS-EXPIRATION-DATE IS EQUAL TO ZEROS                 00904000
009050         MOVE RPXXX30-NEW-EXPIRE-DATE TO WS-EXPIRATION-DATE       00905000
009060         GO TO FVM-VALIDATE.                                      00906000
009070     IF RPXXX30-NEW-EXPIRE-DATE                                   00907000
009080         IS GREATER THAN WS-EXPIRATION-DATE                       00908000
009090         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00909000
009100         GO TO FVM-MODEL-LOOP.                                    00910000
009110     MOVE RPXXX30-NEW-EXPIRE-DATE TO WS-EXPIRATION-DATE.          00911000
P0134  FVM-7100-MAXMODELS.                                              00911100
P0134      IF MIM-7100MAXMODELS IS EQUAL TO ZEROS                       00911200
P0134          GO TO FVM-VALIDATE.                                      00911300
P0134      ADD +1 TO WS-MAXMODELSUB.                                    00911400
P0134      IF WS-MAXMODELSUB IS NOT GREATER THAN MIM-7100MAXMODELS      00911500
P0134          GO TO FVM-VALIDATE.                                      00911600
P0134      SUBTRACT +1 FROM WS-SUB1.                                    00911700
P0134      GO TO FVM-ENDIT.                                             00911800
009120 FVM-VALIDATE.                                                    00912000
009130     PERFORM INITIALIZE-WORK-AREA.                                00913000
009140     PERFORM VALIDATE-PRIMARY-ACCOUNT.                            00914000
009150     IF WS-PRIM-FATAL-ERROR IS EQUAL TO 'Y'                       00915000
009160         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00916000
009170         GO TO FVM-MODEL-LOOP.                                    00917000
009180     PERFORM VALIDATE-SECONDARY-ACCOUNTS.                         00918000
009190     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        00919000
009200         AND MIM-7101ACCTRELCD-Q IS EQUAL TO 'E'                  00920000
009210         AND WS-ACCTRELCD-O IS EQUAL TO ZERO                      00921000
009220         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00922000
009230         GO TO FVM-MODEL-LOOP.                                    00923000
009240 FVM-MODEL-REQ.                                                   00924000
009250     PERFORM VALIDATE-MODEL-REQUIREMENTS.                         00925000
009260     IF WS-MODEL-REQS IS EQUAL TO 'N'                             00926000
009270         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00927000
009280         GO TO FVM-MODEL-LOOP.                                    00928000
009290 FVM-MIN-MAX-PRODS-REQ.                                           00929000
009300     PERFORM VALIDATE-PRODUCTS-REQUIREMENTS.                      00930000
009310     IF WS-MIN-MAX-PROD-REQS IS EQUAL TO 'N'                      00931000
009320         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00932000
009330         GO TO FVM-MODEL-LOOP.                                    00933000
009340 FVM-MIN-MAX-ACCTS-REQ.                                           00934000
009350     PERFORM VALIDATE-ACCOUNTS-REQUIREMENTS.                      00935000
009360     IF WS-MIN-MAX-ACCT-REQS IS EQUAL TO 'N'                      00936000
009370         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00937000
009380         GO TO FVM-MODEL-LOOP.                                    00938000
009390 FVM-PRODUCT-GROUPS-REQ.                                          00939000
009400     PERFORM VALIDATE-PRODUCT-GROUPS.                             00940000
009410     IF WS-PROD-GROUPS-REQS IS EQUAL TO 'N'                       00941000
009420         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00942000
009430         GO TO FVM-MODEL-LOOP.                                    00943000
009440     IF WS-MODEL-REQS IS EQUAL TO 'N'                             00944000
009450         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00945000
009460         GO TO FVM-MODEL-LOOP.                                    00946000
009470     IF WS-MIN-MAX-PROD-REQS IS EQUAL TO 'N'                      00947000
009480         SUBTRACT +1 FROM WS-VALID-MODEL-COUNT                    00948000
009490         GO TO FVM-MODEL-LOOP.                                    00949000
009500 FVM-COMBINEBAL-REQ.                                              00950000
009510     IF MIM-7101COMBCATCD1-Q IS NOT EQUAL TO 'E'                  00951000
009520         AND MIM-7101COMBCATCD2-Q IS NOT EQUAL TO 'E'             00952000
009530         AND MIM-7101COMBCATCD3-Q IS NOT EQUAL TO 'E'             00953000
009540         AND MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'             00954000
009550         GO TO FVM-SET-MODEL-INFO.                                00955000
009560     MOVE ZEROS TO WS-SUBSEC.                                     00956000
009570 FVM-COMBINEBAL-NEXT.                                             00957000
009580     ADD +1 TO WS-SUBSEC.                                         00958000
009590     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                00959000
009600         GO TO FVM-COMBINEBAL1-TEST.                              00960000
009610     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                00961000
009620         GO TO FVM-COMBINEBAL1-TEST.                              00962000
009630     ADD WS-SEC-BAL1 (WS-SUBSEC) TO WS-COMBINEBAL1.               00963000
009640     ADD WS-SEC-BAL2 (WS-SUBSEC) TO WS-COMBINEBAL2.               00964000
009650     ADD WS-SEC-BAL3 (WS-SUBSEC) TO WS-COMBINEBAL3.               00965000
009660     ADD WS-SEC-BAL4 (WS-SUBSEC) TO WS-COMBINEBAL4.               00966000
009670     GO TO FVM-COMBINEBAL-NEXT.                                   00967000
009680 FVM-COMBINEBAL1-TEST.                                            00968000
009690     IF MIM-7101COMBCATCD1-Q IS NOT EQUAL TO 'E'                  00969000
009700         GO TO FVM-COMBINEBAL2-TEST.                              00970000
009710     MOVE MIM-7101COMBCATCD1 TO WS-RPMIM7106RPREC.                00971000
009720     PERFORM SEARCH-RPS-7106.                                     00972000
009730     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         00973000
009740         AND MIM-7101COMBBALOPT IS EQUAL TO 'A'                   00974000
009750         GO TO FVM-COMBINEBAL-FAIL.                               00975000
009760     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         00976000
009770         GO TO FVM-COMBINEBAL2-TEST.                              00977000
009780     IF WS-COMBINEBAL1 IS NOT LESS THAN MIM-7106BALREQ-E          00978000
009790         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   00979000
009800         GO TO FVM-SET-MODEL-INFO.                                00980000
009810     IF WS-COMBINEBAL1 IS NOT LESS THAN MIM-7106BALREQ-E          00981000
009820         GO TO FVM-COMBINEBAL2-TEST.                              00982000
009830     IF MIM-7101COMBBALOPT IS EQUAL TO 'O'                        00983000
009840         GO TO FVM-COMBINEBAL2-TEST.                              00984000
009850     GO TO FVM-COMBINEBAL-FAIL.                                   00985000
009860 FVM-COMBINEBAL2-TEST.                                            00986000
009870     IF MIM-7101COMBCATCD2-Q IS NOT EQUAL TO 'E'                  00987000
009880         GO TO FVM-COMBINEBAL3-TEST.                              00988000
009890     MOVE MIM-7101COMBCATCD2 TO WS-RPMIM7106RPREC.                00989000
009900     PERFORM SEARCH-RPS-7106.                                     00990000
009910     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         00991000
009920         AND MIM-7101COMBBALOPT IS EQUAL TO 'A'                   00992000
009930         GO TO FVM-COMBINEBAL-FAIL.                               00993000
009940     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         00994000
009950         GO TO FVM-COMBINEBAL3-TEST.                              00995000
009960     IF WS-COMBINEBAL2 IS NOT LESS THAN MIM-7106BALREQ-E          00996000
009970         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   00997000
009980         GO TO FVM-SET-MODEL-INFO.                                00998000
009990     IF WS-COMBINEBAL2 IS NOT LESS THAN MIM-7106BALREQ-E          00999000
010000         GO TO FVM-COMBINEBAL3-TEST.                              01000000
010010     IF MIM-7101COMBBALOPT IS EQUAL TO 'O'                        01001000
010020         GO TO FVM-COMBINEBAL3-TEST.                              01002000
010030     GO TO FVM-COMBINEBAL-FAIL.                                   01003000
010040 FVM-COMBINEBAL3-TEST.                                            01004000
010050     IF MIM-7101COMBCATCD3-Q IS NOT EQUAL TO 'E'                  01005000
010060         GO TO FVM-COMBINEBAL4-TEST.                              01006000
010070     MOVE MIM-7101COMBCATCD3 TO WS-RPMIM7106RPREC.                01007000
010080     PERFORM SEARCH-RPS-7106.                                     01008000
010090     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01009000
010100         AND MIM-7101COMBBALOPT IS EQUAL TO 'A'                   01010000
010110         GO TO FVM-COMBINEBAL-FAIL.                               01011000
010120     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01012000
010130         GO TO FVM-COMBINEBAL4-TEST.                              01013000
010140     IF WS-COMBINEBAL3 IS NOT LESS THAN MIM-7106BALREQ-E          01014000
010150         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   01015000
010160         GO TO FVM-SET-MODEL-INFO.                                01016000
010170     IF WS-COMBINEBAL3 IS NOT LESS THAN MIM-7106BALREQ-E          01017000
010180         GO TO FVM-COMBINEBAL4-TEST.                              01018000
010190     IF MIM-7101COMBBALOPT IS EQUAL TO 'O'                        01019000
010200         GO TO FVM-COMBINEBAL4-TEST.                              01020000
010210     GO TO FVM-COMBINEBAL-FAIL.                                   01021000
010220 FVM-COMBINEBAL4-TEST.                                            01022000
010230     IF MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'                  01023000
010240         AND MIM-7101COMBBALOPT IS EQUAL TO 'O'                   01024000
010250         GO TO FVM-COMBINEBAL-FAIL.                               01025000
010260     IF MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'                  01026000
010270         GO TO FVM-SET-MODEL-INFO.                                01027000
010280     MOVE MIM-7101COMBCATCD4 TO WS-RPMIM7106RPREC.                01028000
010290     PERFORM SEARCH-RPS-7106.                                     01029000
010300     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01030000
010310         GO TO FVM-COMBINEBAL-FAIL.                               01031000
010320     IF WS-COMBINEBAL4 IS NOT LESS THAN MIM-7106BALREQ-E          01032000
010330         GO TO FVM-SET-MODEL-INFO.                                01033000
010340 FVM-COMBINEBAL-FAIL.                                             01034000
010350     SUBTRACT +1 FROM WS-VALID-MODEL-COUNT.                       01035000
010360     GO TO FVM-MODEL-LOOP.                                        01036000
010370 FVM-SET-MODEL-INFO.                                              01037000
010380     MOVE WS-MODEL TO RPXXX30-QUAL-MODEL (WS-VALID-MODEL-COUNT).  01038000
010390     MOVE MIM-7101MODELTYPE                                       01039000
010400         TO RPXXX30-QUAL-MODEL-TYPE (WS-VALID-MODEL-COUNT).       01040000
010410     MOVE MIM-7101LONGDESC                                        01041000
010420         TO RPXXX30-MODEL-DESCRIPT (WS-VALID-MODEL-COUNT).        01042000
010430     GO TO FVM-MODEL-LOOP.                                        01043000
010440 FVM-ENDIT.                                                       01044000
010450     IF WS-MODEL-ERROR IS EQUAL TO 'Y'                            01045000
010460         GO TO CICS-RETURN.                                       01046000
010470     IF WS-VALID-MODEL-COUNT IS NOT GREATER THAN ZERO             01047000
010480         MOVE 'E' TO RPXXX30-RETURN                               01048000
010490         MOVE '500612' TO RPXXX30-RESP-MSG-NBR                    01049000
010500         MOVE '500612' TO RPXXX30-MSGNBR.                         01050000
010510     MOVE 'Q' TO RPXXX30-NEW-LAST-REQCODE.                        01051000
010520     MOVE WS-SUB1 TO RPXXX30-LAST-MODELSUB.                       01052000
010530     GO TO CICS-RETURN.                                           01053000
010540 FVM-EXIT.                                                        01054000
010550     EXIT.                                                        01055000
010560******************************************************************01056000
010570 BUILD-MODEL-TABLE SECTION.                                       01057000
010580 BMT-START.                                                       01058000
010590     INITIALIZE WS-MODEL-SCORE-TABLE.                             01059000
010600     MOVE ZEROS TO WS-LASTSCORE.                                  01060000
010610     MOVE ZEROS TO WS-SUBAUTO.                                    01061000
010620     SET INDX-7101 TO +1.                                         01062000
010630 BMT-FIND-7101S.                                                  01063000
010640     IF INDX-7101 IS GREATER THAN WS-RPMIM7101MAXSIZE             01064000
010650         GO TO BMT-EXIT.                                          01065000
010660     IF WS-7101-MODEL (INDX-7101) IS EQUAL TO HIGH-VALUES         01066000
010670         GO TO BMT-EXIT.                                          01067000
010680     MOVE WS-RPMIM7101 (INDX-7101) TO MIM-REC7101.                01068000
010690 BMT-SEARCH.                                                      01069000
010700     ADD +1 TO WS-SUBAUTO.                                        01070000
010710     IF WS-SUBAUTO IS GREATER THAN WS-MS-MAX                      01071000
010720         GO TO BMT-EXIT.                                          01072000
010730     IF MIM-7101SCORE IS EQUAL TO ZEROS                           01073000
010740         OR MIM-7101SCORE IS NOT GREATER THAN WS-LASTSCORE        01074000
010750         MOVE MIM-7101SCORE TO WS-LASTSCORE                       01075000
010760         MOVE WS-SUBAUTO TO WS-SUB2                               01076000
010770         GO TO BMT-MOVE-NEW.                                      01077000
010780 BMT-MOVE-TABLE.                                                  01078000
010790     MOVE WS-SUBAUTO TO WS-SUB2.                                  01079000
010800 BMT-MOVE-TAB.                                                    01080000
010810     SUBTRACT +1 FROM WS-SUB2.                                    01081000
010820     IF WS-SUB2 IS EQUAL TO ZEROS                                 01082000
010830         MOVE +1 TO WS-SUB2                                       01083000
010840         GO TO BMT-MOVE-NEW.                                      01084000
010850     IF MIM-7101SCORE IS GREATER THAN WS-MS-SCORE (WS-SUB2)       01085000
010860         MOVE WS-MS-SCORE (WS-SUB2) TO WS-MS-SCORE (WS-SUB2 + 1)  01086000
010870         MOVE WS-MS-MODEL (WS-SUB2) TO WS-MS-MODEL (WS-SUB2 + 1)  01087000
010880         GO TO BMT-MOVE-TAB.                                      01088000
010890     ADD +1 TO WS-SUB2.                                           01089000
010900 BMT-MOVE-NEW.                                                    01090000
010910     MOVE MIM-7101SCORE TO WS-MS-SCORE (WS-SUB2).                 01091000
010920     MOVE WS-7101-MODEL (INDX-7101) TO WS-MS-MODEL (WS-SUB2).     01092000
010930 BMT-CONTINUE.                                                    01093000
010940     SET INDX-7101 UP BY +1.                                      01094000
010950     GO TO BMT-FIND-7101S.                                        01095000
010960 BMT-EXIT.                                                        01096000
010970     EXIT.                                                        01097000
010980******************************************************************01098000
010990 READ-MICM-7100 SECTION.                                          01099000
011000 RM7100-START.                                                    01100000
011010     MOVE SPACES TO WS-FUNCTION.                                  01101000
011020     MOVE SPACES TO MI7100-RECORD.                                01102000
011030     MOVE RPXXX30-PRIMARY-INST TO MIM-7100KINST.                  01103000
011040 RM7100-LOOP.                                                     01104000
011050     MOVE +7100 TO MIM-7100KREC.                                  01105000
011060     MOVE MIC-RPS-7100-PRI TO MIC-MST-REC-PRI.                    01106000
011070     MOVE MI7100-RECORD TO MIMST-RECORD.                          01107000
011080     PERFORM MIC-MST-GET-REQUEST.                                 01108000
011090     MOVE MIMST-RECORD TO MI7100-RECORD.                          01109000
011100     IF WS-FUNCTION IS EQUAL TO 'N'                               01110000
011110         AND MIM-7100KINST IS GREATER THAN ZEROS                  01111000
011120         GO TO RM7100-ZERO.                                       01112000
011130     GO TO RM7100-EXIT.                                           01113000
011140 RM7100-ZERO.                                                     01114000
011150     MOVE SPACES TO MI7100-RECORD.                                01115000
011160     MOVE ZEROS TO MIM-7100KINST.                                 01116000
011170     GO TO RM7100-LOOP.                                           01117000
011180 RM7100-EXIT.                                                     01118000
011190     EXIT.                                                        01119000
011200******************************************************************01120000
011210 VALIDATE-MODEL-REQUIREMENTS SECTION.                             01121000
011220 VMR-START.                                                       01122000
011230     MOVE 'Y' TO WS-MODEL-REQS.                                   01123000
011240     SET INDX-7102 TO +1.                                         01124000
011250 VMR-FIND-7102S.                                                  01125000
011260     IF INDX-7102 IS GREATER THAN WS-RPMIM7102MAXSIZE             01126000
011270         GO TO VMR-EXIT.                                          01127000
011280     IF WS-7102-MODEL (INDX-7102) IS GREATER THAN WS-MODEL        01128000
011290         GO TO VMR-EXIT.                                          01129000
011300     IF WS-7102-MODEL (INDX-7102) IS EQUAL TO WS-MODEL            01130000
011310         GO TO VMR-TEST-7102S.                                    01131000
011320     SET INDX-7102 UP BY +1.                                      01132000
011330     GO TO VMR-FIND-7102S.                                        01133000
011340 VMR-TEST-7102S.                                                  01134000
011350     IF WS-7102-PRODCODE (INDX-7102) IS EQUAL TO SPACES           01135000
011360         AND WS-7102-TYPE (INDX-7102) IS EQUAL TO ZEROS           01136000
011370         GO TO VMR-CONTINUE.                                      01137000
011380     MOVE WS-7102-MODEL (INDX-7102) TO MIM-7102KMODEL.            01138000
011390     MOVE WS-7102-PRODCODE (INDX-7102) TO MIM-7102KPRODCODE.      01139000
011400     MOVE WS-7102-TYPE (INDX-7102) TO MIM-7102KACCTTYPE.          01140000
011410     MOVE WS-RPMIM7102 (INDX-7102) TO MIM-REC7102.                01141000
011420     IF MIM-7102MINACCTS-Q IS NOT EQUAL TO 'B'                    01142000
011430         AND MIM-7102MINACCTS-Q IS NOT EQUAL TO 'E'               01143000
011440         AND MIM-7102MAXSECACCTS-Q IS NOT EQUAL TO 'B'            01144000
011450         AND MIM-7102MAXSECACCTS-Q IS NOT EQUAL TO 'E'            01145000
011460         GO TO VMR-CONTINUE.                                      01146000
011470     IF MIM-7102MINACCTS-Q IS NOT EQUAL TO 'B'                    01147000
011480         AND MIM-7102MINACCTS-Q IS NOT EQUAL TO 'E'               01148000
011490         MOVE ZEROS TO WS-MINACCTS                                01149000
011500     ELSE                                                         01150000
011510         MOVE MIM-7102MINACCTS TO WS-MINACCTS.                    01151000
011520     IF MIM-7102MAXSECACCTS-Q IS NOT EQUAL TO 'B'                 01152000
011530         AND MIM-7102MAXSECACCTS-Q IS NOT EQUAL TO 'E'            01153000
011540         MOVE 999 TO WS-MAXSECACCTS                               01154000
011550     ELSE                                                         01155000
011560         MOVE MIM-7102MAXSECACCTS TO WS-MAXSECACCTS.              01156000
011570     IF MIM-7102KACCTTYPE IS EQUAL TO ZEROS                       01157000
011580         PERFORM VALIDATE-MINMAX-PRODCD                           01158000
011590     ELSE                                                         01159000
011600         PERFORM VALIDATE-MINMAX-TYPEPROD.                        01160000
011610 VMR-CONTINUE.                                                    01161000
011620     IF WS-MODEL-REQS IS EQUAL TO 'N'                             01162000
011630         GO TO VMR-EXIT.                                          01163000
011640     SET INDX-7102 UP BY +1.                                      01164000
011650     GO TO VMR-FIND-7102S.                                        01165000
011660 VMR-EXIT.                                                        01166000
011670     EXIT.                                                        01167000
011680******************************************************************01168000
011690 VALIDATE-MINMAX-PRODCD SECTION.                                  01169000
011700 VMP-START.                                                       01170000
011710     MOVE ZEROS TO WS-SUBSEC.                                     01171000
011720 VMP-NEXT.                                                        01172000
011730     ADD +1 TO WS-SUBSEC.                                         01173000
011740     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                01174000
011750         GO TO VMP-TEST.                                          01175000
011760     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                01176000
011770         GO TO VMP-TEST.                                          01177000
011780     IF WS-SEC-PRODCD (WS-SUBSEC) IS NOT EQUAL TO                 01178000
011790         MIM-7102KPRODCODE                                        01179000
011800         GO TO VMP-NEXT.                                          01180000
011810     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   01181000
P0044          OR WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X'               01181500
011820         GO TO VMP-NEXT.                                          01182000
011830** MOVE AN 'M' SEC-QUAL FOR ACCOUNT THAT SATISFY THE MINIMUM      01183000
011840** REQUIREMENT SO THOSE ACCOUNTS CAN BE COUNTED FIRST WHEN        01184000
011850** TESTING MINIMUM AND MAXIMUM 7101 ACOUNTS                       01185000
011860     IF WS-MAXSECACCTS IS EQUAL TO ZEROS                          01186000
011870         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01187000
011880         MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC)                    01188000
011890         MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC)                    01189000
011900         GO TO VMP-NEXT                                           01190000
011910     ELSE                                                         01191000
011920         SUBTRACT +1 FROM WS-MAXSECACCTS.                         01192000
011930     IF WS-MINACCTS IS GREATER THAN ZEROS                         01193000
011940         MOVE 'M' TO WS-SEC-QUAL (WS-SUBSEC)                      01194000
011950         SUBTRACT +1 FROM WS-MINACCTS.                            01195000
011960     GO TO VMP-NEXT.                                              01196000
011970 VMP-TEST.                                                        01197000
011980     IF WS-MINACCTS IS GREATER THAN ZEROS                         01198000
011990         AND WS-PRIM-PRODCD IS EQUAL TO MIM-7102KPRODCODE         01199000
012000         SUBTRACT +1 FROM WS-MINACCTS.                            01200000
012010     IF WS-MINACCTS IS GREATER THAN ZEROS                         01201000
012020         MOVE 'N' TO WS-MODEL-REQS.                               01202000
012030 VMP-EXIT.                                                        01203000
012040     EXIT.                                                        01204000
012050******************************************************************01205000
012060 VALIDATE-MINMAX-TYPEPROD SECTION.                                01206000
012070 VMT-START.                                                       01207000
012080     MOVE ZEROS TO WS-SUBSEC.                                     01208000
012090 VMT-NEXT.                                                        01209000
012100     ADD +1 TO WS-SUBSEC.                                         01210000
012110     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                01211000
012120         GO TO VMT-TEST.                                          01212000
012130     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                01213000
012140         GO TO VMT-TEST.                                          01214000
012150     IF WS-SEC-PRODCD (WS-SUBSEC) IS NOT EQUAL TO                 01215000
012160             MIM-7102KPRODCODE                                    01216000
012170         OR WS-SEC-TYPE (WS-SUBSEC) IS NOT EQUAL TO               01217000
012180             MIM-7102KACCTTYPE                                    01218000
012190         GO TO VMT-NEXT.                                          01219000
012200     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   01220000
P0044          OR WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X'               01220500
012210         GO TO VMT-NEXT.                                          01221000
012220** MOVE AN 'M' SEC-QUAL FOR ACCOUNT THAT SATISFY THE MINIMUM      01222000
012230** REQUIREMENT SO THOSE ACCOUNTS CAN BE COUNTED FIRST WHEN        01223000
012240** TESTING MINIMUM AND MAXIMUM 7101 ACOUNTS                       01224000
012250     IF WS-MAXSECACCTS IS EQUAL TO ZEROS                          01225000
012260         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01226000
012270         MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC)                    01227000
012280         MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC)                    01228000
012290         GO TO VMT-NEXT                                           01229000
012300     ELSE                                                         01230000
012310         SUBTRACT +1 FROM WS-MAXSECACCTS.                         01231000
012320     IF WS-MINACCTS IS GREATER THAN ZEROS                         01232000
012330         MOVE 'M' TO WS-SEC-QUAL (WS-SUBSEC)                      01233000
012340         SUBTRACT +1 FROM WS-MINACCTS.                            01234000
012350     GO TO VMT-NEXT.                                              01235000
012360 VMT-TEST.                                                        01236000
012370     IF WS-MINACCTS IS GREATER THAN ZEROS                         01237000
012380         AND WS-PRIM-PRODCD IS EQUAL TO MIM-7102KPRODCODE         01238000
012390         AND WS-PRIM-TYPE IS EQUAL TO MIM-7102KACCTTYPE           01239000
012400         SUBTRACT +1 FROM WS-MINACCTS.                            01240000
012410     IF WS-MINACCTS IS GREATER THAN ZEROS                         01241000
012420         MOVE 'N' TO WS-MODEL-REQS.                               01242000
012430 VMT-EXIT.                                                        01243000
012440     EXIT.                                                        01244000
012450******************************************************************01245000
012460 VALIDATE-PRODUCTS-REQUIREMENTS SECTION.                          01246000
012470 VPR-START.                                                       01247000
012480     MOVE 'Y' TO WS-MIN-MAX-PROD-REQS.                            01248000
012490     IF (MIM-7101MINPRODS-Q IS EQUAL TO 'N'                       01249000
012500         OR MIM-7101MINPRODS-Q IS EQUAL TO 'V')                   01250000
012510         AND (MIM-7101MAXPRODS-Q IS EQUAL TO 'N'                  01251000
012520         OR MIM-7101MAXPRODS-Q IS EQUAL TO 'V')                   01252000
012530         GO TO VPR-EXIT.                                          01253000
012540     MOVE SPACES TO WS-PRODCODE-TABLE.                            01254000
012550     IF MIM-7101MINPRODS-Q IS EQUAL TO 'N'                        01255000
012560         OR MIM-7101MINPRODS-Q IS EQUAL TO 'V'                    01256000
012570         MOVE ZEROS TO WS-MINPRODS                                01257000
012580     ELSE                                                         01258000
012590         MOVE MIM-7101MINPRODS TO WS-MINPRODS.                    01259000
012600     IF MIM-7101MAXPRODS-Q IS EQUAL TO 'N'                        01260000
012610         OR MIM-7101MAXPRODS-Q IS EQUAL TO 'V'                    01261000
012620         MOVE 999 TO WS-MAXPRODS                                  01262000
012630     ELSE                                                         01263000
012640         MOVE MIM-7101MAXPRODS TO WS-MAXPRODS.                    01264000
012650     MOVE WS-PRIM-PRODCD TO WS-PRODCODE-SEARCH.                   01265000
012660     PERFORM SEARCH-PRODUCT-CODES.                                01266000
012670     IF WS-MINPRODS IS GREATER THAN ZEROS                         01267000
012680         SUBTRACT +1 FROM WS-MINPRODS.                            01268000
012690     IF WS-MAXPRODS IS GREATER THAN ZEROS                         01269000
012700         SUBTRACT +1 FROM WS-MAXPRODS.                            01270000
012710     MOVE ZEROS TO WS-SUBSEC.                                     01271000
012720 VPR-NEXT.                                                        01272000
012730     ADD +1 TO WS-SUBSEC.                                         01273000
012740     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                01274000
012750         GO TO VPR-TEST.                                          01275000
012760     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                01276000
012770         GO TO VPR-TEST.                                          01277000
012780     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   01278000
P0044          OR WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X'               01278500
012790         GO TO VPR-NEXT.                                          01279000
012800     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO WS-PRODCODE-SEARCH.        01280000
012810     PERFORM SEARCH-PRODUCT-CODES.                                01281000
012820     IF WS-FOUND-PRODCODE IS EQUAL TO 'Y'                         01282000
012830         GO TO VPR-NEXT.                                          01283000
012840     IF WS-MAXPRODS IS EQUAL TO ZEROS                             01284000
012850         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01285000
012860         MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC)                    01286000
012870         MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC)                    01287000
012880         GO TO VPR-NEXT                                           01288000
012890     ELSE                                                         01289000
012900         SUBTRACT +1 FROM WS-MAXPRODS.                            01290000
012910     IF WS-MINPRODS IS GREATER THAN ZEROS                         01291000
012920         SUBTRACT +1 FROM WS-MINPRODS.                            01292000
012930     GO TO VPR-NEXT.                                              01293000
012940 VPR-TEST.                                                        01294000
012950     IF WS-MINPRODS IS GREATER THAN ZEROS                         01295000
012960         MOVE 'N' TO WS-MIN-MAX-PROD-REQS.                        01296000
012970 VPR-EXIT.                                                        01297000
012980     EXIT.                                                        01298000
012990******************************************************************01299000
013000 VALIDATE-ACCOUNTS-REQUIREMENTS SECTION.                          01300000
013010 VAR-START.                                                       01301000
013020     MOVE 'Y' TO WS-MIN-MAX-ACCT-REQS.                            01302000
013030     IF (MIM-7101MINACCTS-Q IS EQUAL TO 'N'                       01303000
013040         OR MIM-7101MINACCTS-Q IS EQUAL TO 'V')                   01304000
013050         AND (MIM-7101MAXACCTS-Q IS EQUAL TO 'N'                  01305000
013060         OR MIM-7101MAXACCTS-Q IS EQUAL TO 'V')                   01306000
013070         GO TO VAR-EXIT.                                          01307000
013080     IF MIM-7101MINACCTS-Q IS EQUAL TO 'N'                        01308000
013090         OR MIM-7101MINACCTS-Q IS EQUAL TO 'V'                    01309000
013100         MOVE ZEROS TO WS-MINACCTS-2                              01310000
013110     ELSE                                                         01311000
013120         MOVE MIM-7101MINACCTS TO WS-MINACCTS-2.                  01312000
013130     IF MIM-7101MAXACCTS-Q IS EQUAL TO 'N'                        01313000
013140         OR MIM-7101MAXACCTS-Q IS EQUAL TO 'V'                    01314000
013150         MOVE 999 TO WS-MAXACCTS-2                                01315000
013160     ELSE                                                         01316000
013170         MOVE MIM-7101MAXACCTS TO WS-MAXACCTS-2.                  01317000
013180***  SUBTRACT 1 FROM COUNTS TO ACCOUNT FOR PRIMARY ACCOUNT        01318000
013190     IF WS-MINACCTS-2 IS GREATER THAN ZEROS                       01319000
013200         SUBTRACT +1 FROM WS-MINACCTS-2.                          01320000
013210     IF WS-MAXACCTS-2 IS GREATER THAN ZEROS                       01321000
013220         SUBTRACT +1 FROM WS-MAXACCTS-2.                          01322000
013230     MOVE ZEROS TO WS-SUBSEC.                                     01323000
013240 VAR-FIRST.                                                       01324000
013250     ADD +1 TO WS-SUBSEC.                                         01325000
013260     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                01326000
013270         GO TO VAR-SECOND.                                        01327000
013280     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                01328000
013290         GO TO VAR-SECOND.                                        01329000
013300     IF WS-SEC-QUAL (WS-SUBSEC) IS NOT EQUAL TO 'M'               01330000
013310         GO TO VAR-FIRST.                                         01331000
013320     IF WS-MINACCTS-2 IS GREATER THAN ZEROS                       01332000
013330         SUBTRACT +1 FROM WS-MINACCTS-2.                          01333000
013340     IF WS-MAXACCTS-2 IS EQUAL TO ZEROS                           01334000
013350         MOVE 'N' TO WS-MIN-MAX-ACCT-REQS                         01335000
013360         GO TO VAR-EXIT                                           01336000
013370     ELSE                                                         01337000
013380         SUBTRACT +1 FROM WS-MAXACCTS-2.                          01338000
013390     GO TO VAR-FIRST.                                             01339000
013400 VAR-SECOND.                                                      01340000
013410     MOVE ZEROS TO WS-SUBSEC.                                     01341000
013420 VAR-NEXT.                                                        01342000
013430     ADD +1 TO WS-SUBSEC.                                         01343000
013440     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                01344000
013450         GO TO VAR-TEST.                                          01345000
013460     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                01346000
013470         GO TO VAR-TEST.                                          01347000
013480     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   01348000
P0044          OR WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X'               01348500
013490         GO TO VAR-NEXT.                                          01349000
013500     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'M'                   01350000
013510         MOVE 'Y' TO WS-SEC-QUAL (WS-SUBSEC)                      01351000
013520         GO TO VAR-NEXT.                                          01352000
013530     IF WS-MAXACCTS-2 IS EQUAL TO ZEROS                           01353000
013540         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      01354000
013550         MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC)                    01355000
013560         MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC)                    01356000
013570         GO TO VAR-NEXT                                           01357000
013580     ELSE                                                         01358000
013590         SUBTRACT +1 FROM WS-MAXACCTS-2.                          01359000
013600     IF WS-MINACCTS-2 IS GREATER THAN ZEROS                       01360000
013610         SUBTRACT +1 FROM WS-MINACCTS-2.                          01361000
013620     GO TO VAR-NEXT.                                              01362000
013630 VAR-TEST.                                                        01363000
013640     IF WS-MINACCTS-2 IS GREATER THAN ZEROS                       01364000
013650         MOVE 'N' TO WS-MIN-MAX-ACCT-REQS.                        01365000
013660 VAR-EXIT.                                                        01366000
013670     EXIT.                                                        01367000
013680******************************************************************01368000
013690 VALIDATE-PRODUCT-GROUPS SECTION.                                 01369000
013700 VPG-START.                                                       01370000
013710     MOVE 'Y' TO WS-PROD-GROUPS-REQS.                             01371000
013720     IF (MIM-7101PG1-Q IS EQUAL TO 'N'                            01372000
013730         OR MIM-7101PG1-Q IS EQUAL TO 'V')                        01373000
013740         AND (MIM-7101PG2-Q IS EQUAL TO 'N'                       01374000
013750         OR MIM-7101PG2-Q IS EQUAL TO 'V')                        01375000
013760         AND (MIM-7101PG3-Q IS EQUAL TO 'N'                       01376000
013770         OR MIM-7101PG3-Q IS EQUAL TO 'V')                        01377000
013780         AND (MIM-7101PG4-Q IS EQUAL TO 'N'                       01378000
013790         OR MIM-7101PG4-Q IS EQUAL TO 'V')                        01379000
013800         AND (MIM-7101PG5-Q IS EQUAL TO 'N'                       01380000
013810         OR MIM-7101PG5-Q IS EQUAL TO 'V')                        01381000
013820         GO TO VPG-EXIT.                                          01382000
013830     MOVE ZEROS TO WS-SUBPROD.                                    01383000
013840     MOVE +1 TO WS-MINACCTS-PG.                                   01384000
013850     MOVE ZEROS TO WS-SUBSEC.                                     01385000
013860 VPG-ADD-NON-PG-ACCTS.                                            01386000
013870     ADD +1 TO WS-SUBSEC.                                         01387000
013880     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                01388000
013890         GO TO VPG-NEXT-GROUP.                                    01389000
P0044      IF (WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                  01390000
P0044          OR WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X')              01390290
013910         OR WS-SEC-PROD-GROUP (WS-SUBSEC) IS NOT EQUAL TO ZEROS   01391000
013920         GO TO VPG-ADD-NON-PG-ACCTS.                              01392000
013930     ADD +1 TO WS-MINACCTS-PG.                                    01393000
013940     IF WS-SUBSEC IS NOT GREATER THAN WS-SECONDARY-MAX            01394000
013950         GO TO VPG-ADD-NON-PG-ACCTS.                              01395000
013960 VPG-NEXT-GROUP.                                                  01396000
013970     ADD +1 TO WS-SUBPROD.                                        01397000
013980     IF WS-SUBPROD IS GREATER THAN +5                             01398000
013990         GO TO VPG-MINACCT-MODEL-REQ.                             01399000
014000     IF MIM-7101PG-Q (WS-SUBPROD) IS EQUAL TO 'N'                 01400000
014010         OR MIM-7101PG-Q (WS-SUBPROD) IS EQUAL TO 'V'             01401000
014020         GO TO VPG-NEXT-GROUP.                                    01402000
014030     INITIALIZE WS-PGSEARCH-TABLE.                                01403000
014040     MOVE MIM-7101PGMIN (WS-SUBPROD) TO WS-MINPROD-GRP.           01404000
014050     MOVE MIM-7101PGMAX (WS-SUBPROD) TO WS-MAXPROD-GRP.           01405000
014060     IF WS-MAXPROD-GRP IS EQUAL TO ZEROS                          01406000
014070         MOVE +999 TO WS-MAXPROD-GRP.                             01407000
014080     IF WS-PRIM-PROD-GROUP IS EQUAL TO WS-SUBPROD                 01408000
014090         AND WS-PRIM-7102 IS EQUAL TO 'B'                         01409000
014100         MOVE WS-PRIM-PRODCD TO WS-PG-PRODCD (1)                  01410000
014110         MOVE WS-PRIM-TYPE TO WS-PG-TYPE (1)                      01411000
014120         MOVE WS-PRIM-7102 TO WS-PG-7102 (1).                     01412000
014130     IF WS-PRIM-PROD-GROUP IS EQUAL TO WS-SUBPROD                 01413000
014140         AND WS-PRIM-7102 IS EQUAL TO 'P'                         01414000
014150         MOVE WS-PRIM-PRODCD TO WS-PG-PRODCD (1)                  01415000
014160         MOVE ZEROS TO WS-PG-TYPE (1)                             01416000
014170         MOVE WS-PRIM-7102 TO WS-PG-7102 (1).                     01417000
014180     IF WS-PRIM-PROD-GROUP IS EQUAL TO WS-SUBPROD                 01418000
014190         AND WS-PRIM-7102 IS EQUAL TO 'M'                         01419000
014200         MOVE SPACES TO WS-PG-PRODCD (1)                          01420000
014210         MOVE ZEROS TO WS-PG-TYPE (1)                             01421000
014220         MOVE WS-PRIM-7102 TO WS-PG-7102 (1).                     01422000
014230     IF WS-PRIM-PROD-GROUP IS EQUAL TO WS-SUBPROD                 01423000
014240         IF WS-MINPROD-GRP IS GREATER THAN ZEROS                  01424000
014250             SUBTRACT +1 FROM WS-MINPROD-GRP                      01425000
014260         END-IF                                                   01426000
014270         IF WS-MAXPROD-GRP IS GREATER THAN ZEROS                  01427000
014280             SUBTRACT +1 FROM WS-MAXPROD-GRP                      01428000
014290         END-IF                                                   01429000
014300     END-IF.                                                      01430000
014310 VPG-SECOND.                                                      01431000
014320     MOVE ZEROS TO WS-SUBSEC.                                     01432000
014330 VPG-NEXT.                                                        01433000
014340     ADD +1 TO WS-SUBSEC.                                         01434000
014350     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                01435000
014360         GO TO VPG-TEST.                                          01436000
014370     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                01437000
014380         GO TO VPG-TEST.                                          01438000
014390     IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'                   01439000
P0044          OR WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X'               01439500
014400         GO TO VPG-NEXT.                                          01440000
014410     IF WS-SEC-PROD-GROUP (WS-SUBSEC) IS NOT EQUAL TO WS-SUBPROD  01441000
014420         GO TO VPG-NEXT.                                          01442000
014430     MOVE ZEROS TO WS-SUBPG.                                      01443000
014440 VPG-SEARCH-NEXT.                                                 01444000
014450     ADD +1 TO WS-SUBPG.                                          01445000
014460     IF WS-SUBPG IS GREATER THAN WS-PGSEARCH-MAX                  01446000
014470         PERFORM VALIDATE-MINACCT-PROD-REQ                        01447000
014480         IF WS-MODEL-REQS IS EQUAL TO 'N'                         01448000
014490             GO TO VPG-EXIT                                       01449000
014500         ELSE                                                     01450000
014510             GO TO VPG-ACCT-NOT-QUAL                              01451000
014520         END-IF                                                   01452000
014530     END-IF.                                                      01453000
014540     IF WS-SEC-7102 (WS-SUBSEC) IS NOT EQUAL TO 'B'               01454000
014550         AND WS-SEC-7102 (WS-SUBSEC) IS NOT EQUAL TO 'P'          01455000
014560         AND WS-SEC-7102 (WS-SUBSEC) IS NOT EQUAL TO 'M'          01456000
014570         PERFORM VALIDATE-MINACCT-PROD-REQ                        01457000
014580         IF WS-MODEL-REQS IS EQUAL TO 'N'                         01458000
014590             GO TO VPG-EXIT                                       01459000
014600         ELSE                                                     01460000
014610             GO TO VPG-ACCT-NOT-QUAL                              01461000
014620         END-IF                                                   01462000
014630     END-IF.                                                      01463000
014640     IF WS-PG-7102 (WS-SUBPG) IS EQUAL TO SPACE                   01464000
014650         GO TO VPG-CHECK-NEW-PROD.                                01465000
014660     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'B'                   01466000
014670         AND WS-SEC-PRODCD (WS-SUBSEC) IS EQUAL TO                01467000
014680             WS-PG-PRODCD (WS-SUBPG)                              01468000
014690         AND WS-SEC-TYPE (WS-SUBSEC) IS EQUAL TO                  01469000
014700             WS-PG-TYPE (WS-SUBPG)                                01470000
014710         AND WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO                  01471000
014720             WS-PG-7102 (WS-SUBPG)                                01472000
014730         ADD +1 TO WS-MINACCTS-PG                                 01473000
014740         GO TO VPG-NEXT.                                          01474000
014750     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'P'                   01475000
014760         AND WS-SEC-PRODCD (WS-SUBSEC) IS EQUAL TO                01476000
014770             WS-PG-PRODCD (WS-SUBPG)                              01477000
014780         AND WS-PG-TYPE (WS-SUBPG) IS EQUAL TO ZEROS              01478000
014790         AND WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO                  01479000
014800             WS-PG-7102 (WS-SUBPG)                                01480000
014810         ADD +1 TO WS-MINACCTS-PG                                 01481000
014820         GO TO VPG-NEXT.                                          01482000
014830     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'M'                   01483000
014840         AND WS-PG-PRODCD (WS-SUBPG) IS EQUAL TO SPACES           01484000
014850         AND WS-PG-TYPE (WS-SUBPG) IS EQUAL TO ZEROS              01485000
014860         AND WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO                  01486000
014870             WS-PG-7102 (WS-SUBPG)                                01487000
014880         ADD +1 TO WS-MINACCTS-PG                                 01488000
014890         GO TO VPG-NEXT.                                          01489000
014900     GO TO VPG-SEARCH-NEXT.                                       01490000
014910 VPG-CHECK-NEW-PROD.                                              01491000
014920     IF WS-MAXPROD-GRP IS GREATER THAN ZEROS                      01492000
014930         GO TO VPG-ADD-NEW-PROD.                                  01493000
014940     PERFORM VALIDATE-MINACCT-PROD-REQ.                           01494000
014950     IF WS-MODEL-REQS IS EQUAL TO 'N'                             01495000
014960         GO TO VPG-EXIT.                                          01496000
014970     GO TO VPG-ACCT-NOT-QUAL.                                     01497000
014980 VPG-ADD-NEW-PROD.                                                01498000
014990     ADD +1 TO WS-MINACCTS-PG.                                    01499000
015000     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'B'                   01500000
015010         MOVE WS-SEC-PRODCD (WS-SUBSEC)                           01501000
015020             TO WS-PG-PRODCD (WS-SUBPG)                           01502000
015030         MOVE WS-SEC-TYPE (WS-SUBSEC) TO WS-PG-TYPE (WS-SUBPG)    01503000
015040         MOVE WS-SEC-7102 (WS-SUBSEC) TO WS-PG-7102 (WS-SUBPG)    01504000
015050         SUBTRACT +1 FROM WS-MAXPROD-GRP                          01505000
015060         IF WS-MINPROD-GRP IS GREATER THAN ZEROS                  01506000
015070             SUBTRACT +1 FROM WS-MINPROD-GRP                      01507000
015080         END-IF                                                   01508000
015090         GO TO VPG-NEXT                                           01509000
015100     END-IF.                                                      01510000
015110     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'P'                   01511000
015120         MOVE WS-SEC-PRODCD (WS-SUBSEC)                           01512000
015130             TO WS-PG-PRODCD (WS-SUBPG)                           01513000
015140         MOVE ZEROS TO WS-PG-TYPE (WS-SUBPG)                      01514000
015150         MOVE WS-SEC-7102 (WS-SUBSEC) TO WS-PG-7102 (WS-SUBPG)    01515000
015160         SUBTRACT +1 FROM WS-MAXPROD-GRP                          01516000
015170         IF WS-MINPROD-GRP IS GREATER THAN ZEROS                  01517000
015180             SUBTRACT +1 FROM WS-MINPROD-GRP                      01518000
015190         END-IF                                                   01519000
015200         GO TO VPG-NEXT                                           01520000
015210     END-IF.                                                      01521000
015220* WS-SEC-7102 MUST BE AN 'M'                                      01522000
015230     MOVE SPACES TO WS-PG-PRODCD (WS-SUBPG).                      01523000
015240     MOVE ZEROS TO WS-PG-TYPE (WS-SUBPG).                         01524000
015250     MOVE WS-SEC-7102 (WS-SUBSEC) TO WS-PG-7102 (WS-SUBPG).       01525000
015260     SUBTRACT +1 FROM WS-MAXPROD-GRP.                             01526000
015270     IF WS-MINPROD-GRP IS GREATER THAN ZEROS                      01527000
015280         SUBTRACT +1 FROM WS-MINPROD-GRP.                         01528000
015290     GO TO VPG-NEXT.                                              01529000
015300 VPG-ACCT-NOT-QUAL.                                               01530000
015310     MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC).                         01531000
015320     MOVE ZEROS TO WS-SEC-BAL1 (WS-SUBSEC).                       01532000
015330     MOVE ZEROS TO WS-SEC-BAL2 (WS-SUBSEC).                       01533000
015340     GO TO VPG-NEXT.                                              01534000
015350 VPG-TEST.                                                        01535000
015360     IF WS-MINPROD-GRP IS GREATER THAN ZERO                       01536000
015370         MOVE 'N' TO WS-PROD-GROUPS-REQS                          01537000
015380         GO TO VPG-EXIT.                                          01538000
015390     GO TO VPG-NEXT-GROUP.                                        01539000
015400 VPG-MINACCT-MODEL-REQ.                                           01540000
015410     IF MIM-7101MINACCTS-Q IS EQUAL TO 'N'                        01541000
015420         OR MIM-7101MINACCTS-Q IS EQUAL TO 'V'                    01542000
015430         GO TO VPG-EXIT.                                          01543000
015440     IF WS-MINACCTS-PG IS LESS THAN MIM-7101MINACCTS              01544000
015450         MOVE 'N' TO WS-MIN-MAX-ACCT-REQS.                        01545000
015460 VPG-EXIT.                                                        01546000
015470     EXIT.                                                        01547000
015480******************************************************************01548000
015490 VALIDATE-MINACCT-PROD-REQ SECTION.                               01549000
015500 VMPR-START.                                                      01550000
015510     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'B'                   01551000
015520         MOVE WS-SEC-PRODCD (WS-SUBSEC) TO WS-WORK-PRODCD         01552000
015530         MOVE WS-SEC-TYPE (WS-SUBSEC) TO WS-WORK-TYPE.            01553000
015540     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'P'                   01554000
015550         MOVE WS-SEC-PRODCD (WS-SUBSEC) TO WS-WORK-PRODCD         01555000
015560         MOVE ZEROS TO WS-WORK-TYPE.                              01556000
015570     IF WS-SEC-7102 (WS-SUBSEC) IS EQUAL TO 'M'                   01557000
015580         MOVE SPACES TO WS-WORK-PRODCD                            01558000
015590         MOVE ZEROS TO WS-WORK-TYPE.                              01559000
015600     SET INDX-7102 TO +1.                                         01560000
015610 VMPR-FIND-7102S.                                                 01561000
015620     IF INDX-7102 IS GREATER THAN WS-RPMIM7102MAXSIZE             01562000
015630         GO TO VMPR-EXIT.                                         01563000
015640     IF WS-7102-MODEL (INDX-7102) IS GREATER THAN WS-PRIM-MODEL   01564000
015650         GO TO VMPR-EXIT.                                         01565000
015660     IF WS-7102-MODEL (INDX-7102) IS EQUAL TO WS-PRIM-MODEL       01566000
015670         AND WS-7102-PRODCODE (INDX-7102)                         01567000
015680             IS EQUAL TO WS-WORK-PRODCD                           01568000
015690         AND WS-7102-TYPE (INDX-7102)                             01569000
015700             IS EQUAL TO WS-WORK-TYPE                             01570000
015710         MOVE WS-RPMIM7102 (INDX-7102) TO MIM-REC7102             01571000
015720         GO TO VMPR-TEST-7102S.                                   01572000
015730     SET INDX-7102 UP BY +1.                                      01573000
015740     GO TO VMPR-FIND-7102S.                                       01574000
015750 VMPR-TEST-7102S.                                                 01575000
015760     IF MIM-7102MINACCTS-Q IS NOT EQUAL TO 'B'                    01576000
015770         AND MIM-7102MINACCTS-Q IS NOT EQUAL TO 'E'               01577000
015780         GO TO VMPR-EXIT.                                         01578000
015790     IF MIM-7102MINACCTS IS GREATER THAN ZEROS                    01579000
015800         MOVE 'N' TO WS-MODEL-REQS.                               01580000
015810 VMPR-EXIT.                                                       01581000
015820     EXIT.                                                        01582000
P0109 ******************************************************************01582040
P0109  CHECK-EXPIRED-MODEL SECTION.                                     01582080
P0109  CEM-START.                                                       01582120
P0109      MOVE 'Y' TO WS-EXPIRED-FLAG.                                 01582160
P0109      IF WS-EXPIRED-MODEL IS EQUAL TO SPACES                       01582200
P0109          GO TO CEM-EXIT.                                          01582240
P0109      MOVE RPXXX30-PRIMARY-INST TO RPMST-INST.                     01582280
P0109      MOVE RPXXX30-PRIMARY-PROD-CODE TO RPMST-PRODCODE.            01582320
P0109      MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPMST-ACCOUNT.              01582360
P0109      MOVE WS-EXPIRED-MODEL TO RPMST-MODEL.                        01582400
P0109      PERFORM RPS-MST-GET-REQUEST.                                 01582440
P0109      IF WS-FUNCTION IS EQUAL TO 'N'                               01582480
P0109          GO TO CEM-EXIT.                                          01582520
P0109      IF RPMST-REL-STAT IS EQUAL TO 'E'                            01582560
P0109          GO TO CEM-EXIT.                                          01582600
P0109      IF RPMST-EXPIRATION-DATE IS NOT GREATER THAN RPBNK-CURDT     01582640
P0109          AND RPMST-EXPIRATION-DATE IS NOT EQUAL TO ZEROS          01582680
P0109          GO TO CEM-EXIT.                                          01582720
P0109      MOVE 'N' TO WS-EXPIRED-FLAG.                                 01582760
P0109  CEM-EXIT.                                                        01582800
P0109      EXIT.                                                        01582840
015830******************************************************************01583000
015840 SEARCH-PRODUCT-CODES SECTION.                                    01584000
015850 SPC-START.                                                       01585000
015860     MOVE 'N' TO WS-FOUND-PRODCODE.                               01586000
015870     MOVE ZEROS TO WS-SUBPCODE.                                   01587000
015880 SPC-NEXT.                                                        01588000
015890     ADD +1 TO WS-SUBPCODE.                                       01589000
015900     IF WS-SUBPCODE IS GREATER THAN WS-PRODCODE-MAX               01590000
015910         GO TO SPC-EXIT.                                          01591000
015920     IF WS-PRODCODE (WS-SUBPCODE) IS EQUAL TO SPACES              01592000
015930         MOVE WS-PRODCODE-SEARCH TO WS-PRODCODE (WS-SUBPCODE)     01593000
015940         GO TO SPC-EXIT.                                          01594000
015950     IF WS-PRODCODE-SEARCH IS EQUAL TO WS-PRODCODE (WS-SUBPCODE)  01595000
015960         MOVE 'Y' TO WS-FOUND-PRODCODE                            01596000
015970         GO TO SPC-EXIT.                                          01597000
015980     GO TO SPC-NEXT.                                              01598000
015990 SPC-EXIT.                                                        01599000
016000     EXIT.                                                        01600000
016010******************************************************************01601000
016020 INITIALIZE-WORK-AREA SECTION.                                    01602000
016030 IWA-START.                                                       01603000
P0017      MOVE ZEROS TO WS-SUB9.                                       01603300
016050     INITIALIZE WS-SECONDARY-TABLE1.                              01605000
P0017  IWA-SECONDARY-TABLE2.                                            01606000
P0017      ADD +1 TO WS-SUB9.                                           01606080
P0017      IF WS-SUB9 IS GREATER THAN WS-SECONDARY-MAX                  01606160
P0017          GO TO IWA-EXIT.                                          01606240
P0017      IF WS-SEC-ACCT (WS-SUB9) IS EQUAL TO SPACES                  01606320
P0017          GO TO IWA-EXIT.                                          01606400
P0017      IF WS-SEC-SKIP (WS-SUB9) IS EQUAL TO 'Y'                     01606480
P0017          GO TO IWA-SECONDARY-TABLE2.                              01606560
P0017      MOVE SPACES TO WS-SEC-QUAL (WS-SUB9).                        01606640
P0017      GO TO IWA-SECONDARY-TABLE2.                                  01606720
016070 IWA-EXIT.                                                        01607000
016080     EXIT.                                                        01608000
016090******************************************************************01609000
016100 VALIDATE-PRIMARY-ACCOUNT SECTION.                                01610000
016110 VPA-START.                                                       01611000
016120     MOVE 'N' TO WS-PRIM-FATAL-ERROR.                             01612000
016130     MOVE RPXXX30-PRIMARY-INST TO RPMST-INST.                     01613000
016140     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPMST-PRODCODE.            01614000
016150     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPMST-ACCOUNT.              01615000
016160     MOVE WS-MODEL TO RPMST-MODEL.                                01616000
016170     PERFORM RPS-MST-GET-REQUEST.                                 01617000
016180     IF WS-FUNCTION IS EQUAL TO 'N'                               01618000
016190         GO TO VPA-RCIF.                                          01619000
016200     IF RPMST-REL-STAT IS EQUAL TO 'E'                            01620000
016210         MOVE 'E' TO WS-EXPIRED-STATUS.                           01621000
P0024      IF RPMST-EXPIRATION-DATE IS NOT GREATER THAN RPBNK-CURDT     01622000
016230         AND RPMST-EXPIRATION-DATE IS NOT EQUAL TO ZEROS          01623000
016240         MOVE 'P' TO WS-EXPIRED-STATUS                            01624000
016250         GO TO VPA-RCIF.                                          01625000
016260     MOVE 'Y' TO WS-PRIM-FATAL-ERROR.                             01626000
016270     GO TO VPA-EXIT.                                              01627000
016280 VPA-RCIF.                                                        01628000
P0065      MOVE WS-MODEL TO WS-PRIM-MODEL.                              01628500
016290     IF WS-RCIF-ACCTS-READ IS EQUAL TO 'Y'                        01629000
P0109          GO TO VPA-7104-PRIMRELCD.                                01630000
016310     MOVE 'Y' TO WS-RCIF-ACCTS-READ.                              01631000
016320     MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-PRIM-PRODCD.            01632000
016330     MOVE RPXXX30-NEW-BR TO WS-PRIM-BRANCH.                       01633000
016340     MOVE RPXXX30-NEW-ACCT-TYPE TO WS-PRIM-TYPE.                  01634000
016350     MOVE RPXXX30-PRIMARY-ACCT-NBR TO WS-PRIM-ACCT.               01635000
016370     IF WS-INTRFACE (47) IS EQUAL TO SPACES                       01637000
016380         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01638000
016390         MOVE 500024 TO RPXXX30-MSGNBR                            01639000
016400         MOVE 500024 TO RPXXX30-RESP-MSG-NBR                      01640000
016410         GO TO VPA-EXIT.                                          01641000
016420     PERFORM CALL-RCIF.                                           01642000
016430     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         01643000
016440         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01644000
016450         MOVE 500016 TO RPXXX30-MSGNBR                            01645000
016460         MOVE 500016 TO RPXXX30-RESP-MSG-NBR                      01646000
016470         GO TO VPA-EXIT.                                          01647000
P0109  VPA-7104-PRIMRELCD.                                              01647100
P0109      MOVE SPACES TO WS-PRIMRELCD-OPTION.                          01647200
P0109      MOVE WS-PRIM-MODEL TO WS-RPW006-MODEL.                       01647300
P0109      PERFORM VALIDATE-PRIM-RELCD.                                 01647400
P0109      IF WS-PRIMRELCD-ERROR IS EQUAL TO 'N'                        01647500
P0109          GO TO VPA-7104-CUSTRELCD.                                01647600
P0109      MOVE 'Y' TO WS-PRIM-FATAL-ERROR.                             01647700
P0109      GO TO VPA-EXIT.                                              01647800
016480 VPA-7104-CUSTRELCD.                                              01648000
016490     IF MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'B'                   01649000
016500         AND MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'E'              01650000
P0109          GO TO VPA-CALC-PRODACCT.                                 01651000
016520     MOVE MIM-7101CUSTRELCD TO WS-RPMIM7104RPREC.                 01652000
016530     PERFORM SEARCH-RPS-7104.                                     01653000
P0109      IF WS-CUSTRELCD-SKIP IS EQUAL TO 'Y'                         01653100
P0109          AND WS-RPMIM7104FOUND IS NOT EQUAL TO 'N'                01653200
P0109          MOVE MIM-REC7104 TO WS-SAVE-MIM7104REC                   01653300
P0109          GO TO VPA-CALC-PRODACCT.                                 01653400
P0109      IF WS-CUSTRELCD-SKIP IS EQUAL TO 'Y'                         01653500
P0109          AND WS-RPMIM7104FOUND IS EQUAL TO 'N'                    01653600
P0109          GO TO VPA-CALC-PRODACCT.                                 01653700
016540     IF WS-RPMIM7104FOUND IS NOT EQUAL TO 'N'                     01654000
P0044          MOVE MIM-REC7104 TO WS-SAVE-MIM7104REC                   01654500
016550         GO TO VPA-7104-FOUND.                                    01655000
016560     MOVE 'Y' TO WS-PRIM-FATAL-ERROR.                             01656000
016570     GO TO VPA-EXIT.                                              01657000
016580 VPA-7104-FOUND.                                                  01658000
016590     MOVE +1 TO WS-SUB4.                                          01659000
016600     IF MIM-7104OPT IS EQUAL TO 'I'                               01660000
016610         GO TO VPA-7104-CUSTRELCDI.                               01661000
016620 VPA-7104-CUSTRELCDE.                                             01662000
P0065      IF WS-SUB4 IS GREATER THAN 50                                01663000
P0109          GO TO VPA-CALC-PRODACCT.                                 01664000
P0184      IF MIM-7104RLSP (WS-SUB4) IS EQUAL TO ZEROS                  01664300
P0184          GO TO VPA-CALC-PRODACCT.                                 01664600
P0044      IF MIM-7104RLSP (WS-SUB4) IS NOT EQUAL TO WS-SAVE-PRIM-RELCD 01665000
016660         ADD +1 TO WS-SUB4                                        01666000
016670         GO TO VPA-7104-CUSTRELCDE.                               01667000
016680     MOVE 'Y' TO WS-PRIM-FATAL-ERROR.                             01668000
016690     GO TO VPA-EXIT.                                              01669000
016700 VPA-7104-CUSTRELCDI.                                             01670000
P0044      IF MIM-7104RLSP (WS-SUB4) IS EQUAL TO WS-SAVE-PRIM-RELCD     01671000
P0109          GO TO VPA-CALC-PRODACCT.                                 01672000
P0184      IF MIM-7104RLSP (WS-SUB4) IS EQUAL TO ZEROS                  01672200
P0184          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01672400
P0184          GO TO VPA-EXIT.                                          01672600
016730     ADD +1 TO WS-SUB4.                                           01673000
016740     IF WS-SUB4 IS NOT GREATER THAN 50                            01674000
016750         GO TO VPA-7104-CUSTRELCDI.                               01675000
016760     MOVE 'Y' TO WS-PRIM-FATAL-ERROR.                             01676000
016770     GO TO VPA-EXIT.                                              01677000
017250 VPA-CALC-PRODACCT.                                               01725000
017260     MOVE ZEROS TO WS-SUB4.                                       01726000
017270     MOVE ZEROS TO WS-NUMOFACCOUNTS.                              01727000
017280     MOVE ZEROS TO WS-NUMOFPRODUCTS.                              01728000
017290     MOVE SPACES TO WS-PRODCODE-TABLE.                            01729000
017300 VPA-CALC-PRODACCT-LOOP.                                          01730000
017310     ADD +1 TO WS-SUB4.                                           01731000
017320     IF WS-SUB4 IS GREATER THAN WS-SECONDARY-MAX                  01732000
017330         GO TO VPA-7101-ACCOUNTS.                                 01733000
017340     IF WS-SUB4 IS GREATER THAN WS-SECCUSTACCT-END                01734000
017350         GO TO VPA-7101-ACCOUNTS.                                 01735000
017360     IF WS-SEC-QUAL (WS-SUB4) IS EQUAL TO 'X'                     01736000
017370         GO TO VPA-CALC-PRODACCT-LOOP.                            01737000
017380     ADD +1 TO WS-NUMOFACCOUNTS.                                  01738000
017390     MOVE ZEROS TO WS-SUB3.                                       01739000
017400 VPA-PRODCODE-LOOP.                                               01740000
017410     ADD +1 TO WS-SUB3.                                           01741000
017420     IF WS-SUB3 IS GREATER THAN WS-PRODCODE-MAX                   01742000
017430         GO TO VPA-CALC-PRODACCT-LOOP.                            01743000
017440     IF WS-SEC-PRODCD (WS-SUB4) IS EQUAL TO WS-PRODCODE (WS-SUB3) 01744000
017450         GO TO VPA-CALC-PRODACCT-LOOP.                            01745000
017460     IF WS-PRODCODE (WS-SUB3) IS EQUAL TO SPACES                  01746000
017470         MOVE WS-SEC-PRODCD (WS-SUB4) TO WS-PRODCODE (WS-SUB3)    01747000
017480         ADD +1 TO WS-NUMOFPRODUCTS                               01748000
017490         GO TO VPA-CALC-PRODACCT-LOOP.                            01749000
017500     GO TO VPA-PRODCODE-LOOP.                                     01750000
017510 VPA-7101-ACCOUNTS.                                               01751000
017520     IF MIM-7101ACCTS-Q IS NOT EQUAL TO 'B'                       01752000
017530         AND MIM-7101ACCTS-Q IS NOT EQUAL TO 'E'                  01753000
017540         GO TO VPA-7101-PRODUCTS.                                 01754000
017550     IF WS-NUMOFACCOUNTS IS LESS THAN MIM-7101ACCTS               01755000
017560         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01756000
017570         GO TO VPA-EXIT.                                          01757000
017580 VPA-7101-PRODUCTS.                                               01758000
017590     IF MIM-7101PROD-Q IS NOT EQUAL TO 'B'                        01759000
017600         AND MIM-7101PROD-Q IS NOT EQUAL TO 'E'                   01760000
P0044          GO TO VPA-INTERFACE.                                     01761000
017620     IF WS-NUMOFPRODUCTS IS LESS THAN MIM-7101PROD                01762000
017630         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01763000
017640         GO TO VPA-EXIT.                                          01764000
P0044  VPA-INTERFACE.                                                   01764010
P0044      IF WS-PRIM-FLAG IS EQUAL TO 'Y'                              01764020
P0044          GO TO VPA-7102-BRANCH.                                   01764030
P0044      MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-RPMIM2023PRODCD.        01764040
P0044      PERFORM SEARCH-RPS-2023.                                     01764050
P0044      IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         01764060
P0044          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01764070
P0044          GO TO VPA-EXIT.                                          01764080
P0044      MOVE WS-2023-INTAPPL (INDX-2023) TO WS-PRIM-APPL.            01764090
P0044      IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'P'              01764100
P0134          MOVE ZEROS TO WS-PRIM-BRANCH                             01764110
P0134          MOVE ZEROS TO WS-PRIM-TYPE                               01764116
P0044          MOVE ZEROS TO WS-PRIM-SCNXT                              01764130
P0134          GO TO VPA-PRIMARY-OPTION.                                01764140
P0044      IF WS-PRIM-APPL IS EQUAL TO ZEROS                            01764150
P0044          MOVE WS-INTRFACE (100) TO SR-060CALLNAME                 01764160
P0044      ELSE                                                         01764170
P0044          MOVE WS-INTRFACE (WS-PRIM-APPL) TO SR-060CALLNAME.       01764180
P0044      IF SR-060CALLNAME IS EQUAL TO SPACES                         01764190
P0044          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01764200
P0044          MOVE 500016 TO RPXXX30-MSGNBR                            01764210
P0044          MOVE 500016 TO RPXXX30-RESP-MSG-NBR                      01764220
P0044          GO TO VPA-EXIT.                                          01764230
P0044      MOVE RPXXX30-CONTROLS TO RPINF00-CONTROLS.                   01764240
P0044      MOVE RPXXX30-PRIMARY-INST TO RPINF00-INST.                   01764250
P0044      MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPINF00-ACCOUNT.            01764260
P0044      MOVE RPXXX30-PRIMARY-PROD-CODE TO RPINF00-PRODCODE.          01764270
P0044      MOVE WS-PRIM-APPL TO RPINF00-APPLR.                          01764280
P0044      MOVE MIM-7101CLOSEDACCTOPT TO RPINF00-CLOSEDACCTOPT.         01764290
P0044      MOVE 'R' TO RPINF00-FUNC.                                    01764300
P0044      EXEC CICS LINK                                               01764310
P0044          PROGRAM(SR-060CALLNAME)                                  01764320
P0044          COMMAREA(WS-LINKAPPL)                                    01764330
P0044          LENGTH(LENGTH OF WS-LINKAPPL)                            01764340
P0044          NOHANDLE                                                 01764350
P0044          END-EXEC.                                                01764360
P0044      IF RPINF00-FUNCTION IS NOT EQUAL TO SPACE                    01764370
P0044          AND RPINF00-FUNCTION IS NOT EQUAL TO 'N'                 01764380
P0044          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01764390
P0044          GO TO VPA-EXIT.                                          01764400
P0044      IF RPINF00-FUNCTION IS EQUAL TO 'N'                          01764410
P0134          MOVE ZEROS TO WS-PRIM-SCNXT                              01764420
P0080          MOVE RPXXX30-NEW-BR TO RPINF00-BRANCH                    01764423
P0080          MOVE RPXXX30-NEW-ACCT-TYPE TO RPINF00-ACCT-TYPE          01764426
P0134          MOVE RPXXX30-NEW-TERM TO RPINF00-TERM                    01764428
P0044          MOVE RPXXX30-NEW-CURBAL TO RPINF00-CURBAL                01764430
P0044          MOVE RPXXX30-NEW-CURCUSTCOL TO RPINF00-CURCUSTCOL        01764440
P0044          MOVE RPXXX30-NEW-CURBANKCOL TO RPINF00-CURBANKCOL        01764450
P0044          MOVE RPXXX30-NEW-LOWBAL TO RPINF00-LOWBAL                01764460
P0044          MOVE RPXXX30-NEW-AVGBAL TO RPINF00-AVGBAL                01764470
P0044          MOVE RPXXX30-NEW-AVGCOLBAL TO RPINF00-AVGCOLBAL          01764480
P0044          MOVE RPXXX30-NEW-COMMAMT TO RPINF00-COMMAMT              01764490
P0134          MOVE RPXXX30-NEW-CREDIT-LIMIT TO RPINF00-CREDIT-LIMIT    01764500
P0134          MOVE SPACES TO RPINF00-USEROPT1                          01764501
P0134          MOVE SPACES TO RPINF00-USEROPT2                          01764502
P0134          MOVE SPACES TO RPINF00-USEROPT3                          01764503
P0134          MOVE SPACES TO RPINF00-USEROPT4                          01764504
P0134          MOVE ZEROS TO RPINF00-RSVBAL1                            01764505
P0134          MOVE ZEROS TO RPINF00-RSVBAL2                            01764506
P0134          MOVE ZEROS TO RPINF00-RSVBAL3                            01764507
P0134          MOVE ZEROS TO RPINF00-RSVBAL4                            01764508
P0134          MOVE ZEROS TO RPINF00-RSVBAL5                            01764509
P0134          MOVE ZEROS TO RPINF00-RSVBAL6                            01764510
P0134          MOVE ZEROS TO RPINF00-RSVBAL7                            01764511
P0134          MOVE ZEROS TO RPINF00-USRBAL1                            01764512
P0134          MOVE ZEROS TO RPINF00-USRBAL2                            01764513
P0134          MOVE ZEROS TO RPINF00-USRBAL3                            01764514
P0134          MOVE ZEROS TO RPINF00-USRBAL4                            01764515
P0134          MOVE ZEROS TO RPINF00-USRBAL5                            01764516
P0134          GO TO VPA-PRIMARY-OPTION.                                01764517
P0134      IF RPXXX30-NEW-BR IS GREATER THAN ZEROS                      01764518
P0134          MOVE RPXXX30-NEW-BR TO RPINF00-BRANCH.                   01764519
P0134      IF RPXXX30-NEW-ACCT-TYPE IS GREATER THAN ZEROS               01764520
P0134          MOVE RPXXX30-NEW-ACCT-TYPE TO RPINF00-ACCT-TYPE.         01764521
P0134      IF RPXXX30-NEW-TERM IS GREATER THAN ZEROS                    01764522
P0134          MOVE RPXXX30-NEW-TERM TO RPINF00-TERM.                   01764523
P0134      IF RPXXX30-NEW-CURBAL IS GREATER THAN ZEROS                  01764524
P0134          MOVE RPXXX30-NEW-CURBAL TO RPINF00-CURBAL.               01764525
P0134      IF RPXXX30-NEW-CURCUSTCOL IS GREATER THAN ZEROS              01764526
P0134          MOVE RPXXX30-NEW-CURCUSTCOL TO RPINF00-CURCUSTCOL.       01764527
P0134      IF RPXXX30-NEW-CURBANKCOL IS GREATER THAN ZEROS              01764528
P0134          MOVE RPXXX30-NEW-CURBANKCOL TO RPINF00-CURBANKCOL.       01764529
P0134      IF RPXXX30-NEW-LOWBAL IS GREATER THAN ZEROS                  01764530
P0134          MOVE RPXXX30-NEW-LOWBAL TO RPINF00-LOWBAL.               01764531
P0134      IF RPXXX30-NEW-AVGBAL IS GREATER THAN ZEROS                  01764532
P0134          MOVE RPXXX30-NEW-AVGBAL TO RPINF00-AVGBAL.               01764533
P0134      IF RPXXX30-NEW-AVGCOLBAL IS GREATER THAN ZEROS               01764534
P0134          MOVE RPXXX30-NEW-AVGCOLBAL TO RPINF00-AVGCOLBAL.         01764535
P0134      IF RPXXX30-NEW-COMMAMT IS GREATER THAN ZEROS                 01764536
P0134          MOVE RPXXX30-NEW-COMMAMT TO RPINF00-COMMAMT.             01764537
P0134      IF RPXXX30-NEW-CREDIT-LIMIT IS GREATER THAN ZEROS            01764538
P0134          MOVE RPXXX30-NEW-CREDIT-LIMIT TO RPINF00-CREDIT-LIMIT.   01764539
P0134      MOVE RPINF00-SCNXT TO WS-PRIM-SCNXT.                         01764540
P0134      MOVE RPINF00-BRANCH TO WS-PRIM-BRANCH.                       01764541
P0134      MOVE RPINF00-ACCT-TYPE TO WS-PRIM-TYPE.                      01764542
P0134  VPA-PRIMARY-OPTION.                                              01764543
P0044      PERFORM VALIDATE-PRIMARY-OPTION.                             01764550
P0044      IF WS-PRIMOPT-FAIL IS EQUAL TO 'Y'                           01764560
P0044          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01764570
P0044          GO TO VPA-EXIT.                                          01764580
017650 VPA-7102.                                                        01765000
017660     MOVE WS-MODEL TO WS-RPMIM7102MODEL.                          01766000
017670     MOVE WS-PRIM-PRODCD TO WS-RPMIM7102PRODCODE.                 01767000
017680     MOVE WS-PRIM-TYPE TO WS-RPMIM7102TYPE.                       01768000
017690     PERFORM SEARCH-RPS-7102.                                     01769000
017700     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01770000
017710         MOVE 'B' TO WS-PRIM-7102                                 01771000
017720         GO TO VPA-READ-ACT.                                      01772000
017730 VPA-7102-TYPEZERO.                                               01773000
017740     MOVE ZEROS TO WS-RPMIM7102TYPE.                              01774000
017750     PERFORM SEARCH-RPS-7102.                                     01775000
017760     IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         01776000
017770         MOVE 'P' TO WS-PRIM-7102                                 01777000
017780         GO TO VPA-READ-ACT.                                      01778000
017790 VPA-7102-MODELONLY.                                              01779000
017800     MOVE SPACES TO WS-RPMIM7102PRODCODE.                         01780000
017810     MOVE ZEROS TO WS-RPMIM7102TYPE.                              01781000
017820     PERFORM SEARCH-RPS-7102.                                     01782000
017830     IF WS-RPMIM7102FOUND IS EQUAL TO 'N'                         01783000
017840         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01784000
017850         GO TO VPA-EXIT.                                          01785000
017860     MOVE 'M' TO WS-PRIM-7102.                                    01786000
017870 VPA-READ-ACT.                                                    01787000
017880     IF WS-PRIM-ACTREC IS EQUAL TO 'N'                            01788000
017890         GO TO VPA-7102-ACCTINFO.                                 01789000
017900     IF WS-PRIM-ACTREAD IS EQUAL TO 'Y'                           01790000
017910         GO TO VPA-ACT-CHECK.                                     01791000
017920     MOVE 'Y' TO WS-PRIM-ACTREAD.                                 01792000
017930     MOVE RPXXX30-PRIMARY-INST TO RPACT-INST.                     01793000
017940     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPACT-PRODCODE.            01794000
017950     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPACT-ACCOUNT.              01795000
017960     PERFORM RPS-ACT-GET-REQUEST.                                 01796000
017970     IF WS-FUNCTION IS EQUAL TO 'N'                               01797000
017980         MOVE 'N' TO WS-PRIM-ACTREC                               01798000
017990         GO TO VPA-7102-ACCTINFO.                                 01799000
018000     MOVE 'Y' TO WS-PRIM-ACTREC.                                  01800000
018010     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      01801000
018020         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01802000
018030         GO TO VPA-EXIT.                                          01803000
018040 VPA-ACT-CHECK.                                                   01804000
018050     IF WS-EXPIRED-STATUS IS EQUAL TO 'P'                         01805000
018060         AND RPACT-RATE-MODEL IS EQUAL TO WS-MODEL                01806000
018070         GO TO VPA-SC-CHECK.                                      01807000
P0109      IF MIM-7102PRIMRATEINCOPT IS EQUAL TO 'N'                    01807100
P0109          OR RPACT-RATE-INC-OPTION IS EQUAL TO 'N'                 01807200
P0109          GO TO VPA-SC-CHECK.                                      01807300
P0109      MOVE RPACT-RATE-MODEL TO WS-EXPIRED-MODEL.                   01807400
P0109      PERFORM CHECK-EXPIRED-MODEL.                                 01807500
P0109      IF WS-EXPIRED-FLAG IS EQUAL TO 'Y'                           01807600
P0109          GO TO VPA-SC-CHECK.                                      01807700
018080     IF RPACT-RATE-INC-OPTION IS EQUAL TO 'Y'                     01808000
018090         AND MIM-7102PRIMRATEINCOPT IS EQUAL TO 'Y'               01809000
018100         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01810000
018110         GO TO VPA-EXIT.                                          01811000
018120 VPA-SC-CHECK.                                                    01812000
018130     IF MIM-7100DUPINCOPT IS EQUAL TO 'Y'                         01813000
018140         GO TO VPA-7102-ACCTINFO.                                 01814000
018150     IF WS-EXPIRED-STATUS IS EQUAL TO 'P'                         01815000
018160         AND RPACT-SC-MODEL IS EQUAL TO WS-MODEL                  01816000
018170         GO TO VPA-7102-ACCTINFO.                                 01817000
P0109      IF MIM-7102PRIMSCINCOPT IS EQUAL TO 'N'                      01817100
P0109          OR RPACT-SC-INC-OPTION IS EQUAL TO 'N'                   01817200
P0109          GO TO VPA-7102-ACCTINFO.                                 01817300
P0109      MOVE RPACT-SC-MODEL TO WS-EXPIRED-MODEL.                     01817400
P0109      PERFORM CHECK-EXPIRED-MODEL.                                 01817500
P0109      IF WS-EXPIRED-FLAG IS EQUAL TO 'Y'                           01817600
P0109          GO TO VPA-7102-ACCTINFO.                                 01817700
018180     IF RPACT-SC-INC-OPTION IS EQUAL TO 'Y'                       01818000
018190         AND MIM-7102PRIMSCINCOPT IS EQUAL TO 'Y'                 01819000
018200         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01820000
018210         GO TO VPA-EXIT.                                          01821000
018220 VPA-7102-ACCTINFO.                                               01822000
018230     MOVE MIM-7102PRIMSCINCOPT TO WS-PRIM-SCINCOPT.               01823000
018240     MOVE MIM-7102PRIMRATEINCOPT TO WS-PRIM-RATEINCOPT.           01824000
018250     MOVE MIM-7102TIMEPROCOPT TO WS-PRIM-TIMEPROCOPT.             01825000
018260     MOVE MIM-7102PRODUCTGROUP TO WS-PRIM-PROD-GROUP.             01826000
P0044      IF WS-2023-RPOPTION (INDX-2023) IS EQUAL TO 'P'              01827000
P0044          MOVE 'Y' TO WS-PRIM-FLAG                                 01836990
P0044          GO TO VPA-PRIMARY-ACCT-VALID.                            01846980
018810 VPA-7102-BRANCH.                                                 01881000
018820     IF MIM-7102BRCHREGIONCD IS EQUAL TO SPACES                   01882000
018830         OR (MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'B'           01883000
018840         AND MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'E')          01884000
P0134          GO TO VPA-7102-MINTERM.                                  01885000
018860     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7107INST.               01886000
018870     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7107INST2.              01887000
018880     MOVE WS-PRIM-BRANCH TO WS-RPMIM7107BRCHREGION.               01888000
018890     MOVE MIM-7102BRCHREGIONCD TO WS-RPMIM7107RPREC.              01889000
018900     PERFORM VALIDATE-BRANCH.                                     01890000
018910     IF WS-RPMIM7107ERROR IS NOT EQUAL TO SPACES                  01891000
018920         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01892000
018930         GO TO VPA-EXIT.                                          01893000
P0134  VPA-7102-MINTERM.                                                01893060
P0134      IF MIM-7102MINTERM-Q IS NOT EQUAL TO 'B'                     01893120
P0134          AND MIM-7102MINTERM-Q IS NOT EQUAL TO 'E'                01893180
P0134          GO TO VPA-7102-MAXTERM.                                  01893240
P0134      IF RPINF00-TERM IS LESS THAN MIM-7102MINTERM                 01893300
P0134          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01893360
P0134          GO TO VPA-EXIT.                                          01893420
P0134  VPA-7102-MAXTERM.                                                01893480
P0134      IF MIM-7102MAXTERM-Q IS NOT EQUAL TO 'B'                     01893540
P0134          AND MIM-7102MAXTERM-Q IS NOT EQUAL TO 'E'                01893600
P0134          GO TO VPA-7102-USEROPT1.                                 01893660
P0134      IF RPINF00-TERM IS GREATER THAN MIM-7102MAXTERM              01893720
P0134          MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01893780
P0134          GO TO VPA-EXIT.                                          01893840
018940 VPA-7102-USEROPT1.                                               01894000
018950     IF MIM-7102USERTYPE1 IS EQUAL TO 'S'                         01895000
018960         GO TO VPA-7102-USEROPT2.                                 01896000
018970     IF MIM-7102USEROPT1-Q IS NOT EQUAL TO 'B'                    01897000
018980         AND MIM-7102USEROPT1-Q IS NOT EQUAL TO 'E'               01898000
018990         GO TO VPA-7102-USEROPT2.                                 01899000
019000     IF (MIM-7102USEROPTREL1 IS EQUAL TO 'EQ'                     01900000
019010         AND RPINF00-USEROPT1 IS NOT EQUAL TO MIM-7102USEROPT1)   01901000
019020         OR (MIM-7102USEROPTREL1 IS EQUAL TO 'NE'                 01902000
019030         AND RPINF00-USEROPT1 IS EQUAL TO MIM-7102USEROPT1)       01903000
019040         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01904000
019050         GO TO VPA-EXIT.                                          01905000
019060 VPA-7102-USEROPT2.                                               01906000
019070     IF MIM-7102USERTYPE2 IS EQUAL TO 'S'                         01907000
019080         GO TO VPA-7102-USEROPT3.                                 01908000
019090     IF MIM-7102USEROPT2-Q IS NOT EQUAL TO 'B'                    01909000
019100         AND MIM-7102USEROPT2-Q IS NOT EQUAL TO 'E'               01910000
019110         GO TO VPA-7102-USEROPT3.                                 01911000
019120     IF (MIM-7102USEROPTREL2 IS EQUAL TO 'EQ'                     01912000
019130         AND RPINF00-USEROPT2 IS NOT EQUAL TO MIM-7102USEROPT2)   01913000
019140         OR (MIM-7102USEROPTREL2 IS EQUAL TO 'NE'                 01914000
019150         AND RPINF00-USEROPT2 IS EQUAL TO MIM-7102USEROPT2)       01915000
019160         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01916000
019170         GO TO VPA-EXIT.                                          01917000
019180 VPA-7102-USEROPT3.                                               01918000
019190     IF MIM-7102USERTYPE3 IS EQUAL TO 'S'                         01919000
019200         GO TO VPA-7102-USEROPT4.                                 01920000
019210     IF MIM-7102USEROPT3-Q IS NOT EQUAL TO 'B'                    01921000
019220         AND MIM-7102USEROPT3-Q IS NOT EQUAL TO 'E'               01922000
019230         GO TO VPA-7102-USEROPT4.                                 01923000
019240     IF (MIM-7102USEROPTREL3 IS EQUAL TO 'EQ'                     01924000
019250         AND RPINF00-USEROPT3 IS NOT EQUAL TO MIM-7102USEROPT3)   01925000
019260         OR (MIM-7102USEROPTREL3 IS EQUAL TO 'NE'                 01926000
019270         AND RPINF00-USEROPT3 IS EQUAL TO MIM-7102USEROPT3)       01927000
019280         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01928000
019290         GO TO VPA-EXIT.                                          01929000
019300 VPA-7102-USEROPT4.                                               01930000
019310     IF MIM-7102USERTYPE4 IS EQUAL TO 'S'                         01931000
019320         GO TO VPA-7102-BALANCE.                                  01932000
019330     IF MIM-7102USEROPT4-Q IS NOT EQUAL TO 'B'                    01933000
019340         AND MIM-7102USEROPT4-Q IS NOT EQUAL TO 'E'               01934000
019350         GO TO VPA-7102-BALANCE.                                  01935000
019360     IF (MIM-7102USEROPTREL4 IS EQUAL TO 'EQ'                     01936000
019370         AND RPINF00-USEROPT4 IS NOT EQUAL TO MIM-7102USEROPT4)   01937000
019380         OR (MIM-7102USEROPTREL4 IS EQUAL TO 'NE'                 01938000
019390         AND RPINF00-USEROPT4 IS EQUAL TO MIM-7102USEROPT4)       01939000
019400         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01940000
019410         GO TO VPA-EXIT.                                          01941000
019420 VPA-7102-BALANCE.                                                01942000
019430     IF MIM-7102PRIMCATCD-Q IS NOT EQUAL TO 'E'                   01943000
019440         GO TO VPA-7101-PRIMBALOPT.                               01944000
019450     IF MIM-7102PRIMCATCD IS EQUAL TO SPACES                      01945000
019460         GO TO VPA-7101-PRIMBALOPT.                               01946000
019470     MOVE MIM-7102PRIMCATCD TO WS-RPMIM7106RPREC.                 01947000
019480     PERFORM SEARCH-RPS-7106.                                     01948000
019490     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01949000
019500         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01950000
019510         GO TO VPA-EXIT.                                          01951000
019520     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01952000
019530     PERFORM GET-BALANCE.                                         01953000
019540     MOVE WS-WORK-BALANCE TO WS-PRIMCATBAL.                       01954000
019550     IF WS-PRIMCATBAL IS LESS THAN MIM-7106BALREQ-E               01955000
019560         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          01956000
019570         GO TO VPA-EXIT.                                          01957000
019580 VPA-7101-PRIMBALOPT.                                             01958000
019590     IF MIM-7101PRIMBALOPT-Q IS NOT EQUAL TO 'E'                  01959000
019600         GO TO VPA-7101-PRIMCOMBOPT.                              01960000
019610     IF MIM-7101PRIMBALOPT IS EQUAL TO 'N'                        01961000
019620         GO TO VPA-7101-PRIMCOMBOPT.                              01962000
019630 VPA-7102-BALCATCD1.                                              01963000
019640     IF MIM-7101ACCTRELCD-Q IS NOT EQUAL TO 'E'                   01964000
019650         GO TO VPA-7101-PRIMCOMBOPT.                              01965000
019660     IF MIM-7102BALCATCD1-Q IS NOT EQUAL TO 'E'                   01966000
019670         GO TO VPA-7102-BALCATCD2.                                01967000
019680     IF MIM-7102BALCATCD1 IS EQUAL TO SPACES                      01968000
019690         GO TO VPA-7102-BALCATCD2.                                01969000
019700     MOVE MIM-7102BALCATCD1 TO WS-RPMIM7106RPREC.                 01970000
019710     PERFORM SEARCH-RPS-7106.                                     01971000
019720     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01972000
019730         GO TO VPA-7102-BALCATCD2.                                01973000
019740     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     01974000
019750     PERFORM GET-BALANCE.                                         01975000
019760     MOVE WS-WORK-BALANCE TO WS-PRIMCATBAL.                       01976000
019770     IF WS-PRIMCATBAL IS LESS THAN MIM-7106BALREQ-E               01977000
019780         GO TO VPA-7102-BALCATCD2.                                01978000
019790     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        01979000
019800         ADD +1 TO WS-ACCTRELCD-O.                                01980000
019810     GO TO VPA-7101-PRIMCOMBOPT.                                  01981000
019820 VPA-7102-BALCATCD2.                                              01982000
019830     IF MIM-7102BALCATCD2-Q IS NOT EQUAL TO 'E'                   01983000
019840         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01984000
019850             GO TO VPA-7101-PRIMCOMBOPT                           01985000
019860         ELSE                                                     01986000
019870             MOVE 'Y' TO WS-PRIM-FATAL-ERROR                      01987000
019880             GO TO VPA-EXIT.                                      01988000
019890     IF MIM-7102BALCATCD2 IS EQUAL TO SPACES                      01989000
019900         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01990000
019910             GO TO VPA-7101-PRIMCOMBOPT                           01991000
019920         ELSE                                                     01992000
019930             MOVE 'Y' TO WS-PRIM-FATAL-ERROR                      01993000
019940             GO TO VPA-EXIT.                                      01994000
019950     MOVE MIM-7102BALCATCD2 TO WS-RPMIM7106RPREC.                 01995000
019960     PERFORM SEARCH-RPS-7106.                                     01996000
019970     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         01997000
019980         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    01998000
019990             GO TO VPA-7101-PRIMCOMBOPT                           01999000
020000         ELSE                                                     02000000
020010             MOVE 'Y' TO WS-PRIM-FATAL-ERROR                      02001000
020020             GO TO VPA-EXIT.                                      02002000
020030     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02003000
020040     PERFORM GET-BALANCE.                                         02004000
020050     MOVE WS-WORK-BALANCE TO WS-PRIMCATBAL.                       02005000
020060     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'A'                        02006000
020070         AND WS-PRIMCATBAL IS LESS THAN MIM-7106BALREQ-E          02007000
020080         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          02008000
020090         GO TO VPA-EXIT.                                          02009000
020100     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        02010000
020110         AND WS-PRIMCATBAL IS NOT LESS THAN MIM-7106BALREQ-E      02011000
020120         ADD +1 TO WS-ACCTRELCD-O.                                02012000
020130 VPA-7101-PRIMCOMBOPT.                                            02013000
020140     IF MIM-7101PRIMCOMBOPT1-Q IS NOT EQUAL TO 'E'                02014000
020150         GO TO VPA-7101-PRIMCOMBOPT2.                             02015000
020160     IF MIM-7101PRIMCOMBOPT1 IS NOT EQUAL TO 'Y'                  02016000
020170         GO TO VPA-7101-PRIMCOMBOPT2.                             02017000
020180     IF MIM-7101COMBCATCD1-Q IS NOT EQUAL TO 'E'                  02018000
020190         GO TO VPA-7101-PRIMCOMBOPT2.                             02019000
020200     IF MIM-7101COMBCATCD1 IS EQUAL TO SPACES                     02020000
020210         GO TO VPA-7101-PRIMCOMBOPT2.                             02021000
020220     IF MIM-7102COMBBALCD1-Q IS EQUAL TO 'E'                      02022000
020230         MOVE MIM-7102COMBBALCD1 TO WS-WORK-COMBBALCD             02023000
020240         GO TO VPA-7101-PRIMCOMBOPT1-CONT.                        02024000
020250     MOVE MIM-7101COMBCATCD1 TO WS-RPMIM7106RPREC.                02025000
020260     PERFORM SEARCH-RPS-7106.                                     02026000
020270     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02027000
020280         GO TO VPA-7101-PRIMCOMBOPT2.                             02028000
020290     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02029000
020300 VPA-7101-PRIMCOMBOPT1-CONT.                                      02030000
020310     PERFORM GET-BALANCE.                                         02031000
020320     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL1.                      02032000
020330 VPA-7101-PRIMCOMBOPT2.                                           02033000
020340     IF MIM-7101PRIMCOMBOPT2-Q IS NOT EQUAL TO 'E'                02034000
020350         GO TO VPA-7101-PRIMCOMBOPT3.                             02035000
020360     IF MIM-7101PRIMCOMBOPT2 IS NOT EQUAL TO 'Y'                  02036000
020370         GO TO VPA-7101-PRIMCOMBOPT3.                             02037000
020380     IF MIM-7101COMBCATCD2-Q IS NOT EQUAL TO 'E'                  02038000
020390         GO TO VPA-7101-PRIMCOMBOPT3.                             02039000
020400     IF MIM-7101COMBCATCD2 IS EQUAL TO SPACES                     02040000
020410         GO TO VPA-7101-PRIMCOMBOPT3.                             02041000
020420     IF MIM-7102COMBBALCD2-Q IS EQUAL TO 'E'                      02042000
020430         MOVE MIM-7102COMBBALCD2 TO WS-WORK-COMBBALCD             02043000
020440         GO TO VPA-7101-PRIMCOMBOPT2-CONT.                        02044000
020450     MOVE MIM-7101COMBCATCD2 TO WS-RPMIM7106RPREC.                02045000
020460     PERFORM SEARCH-RPS-7106.                                     02046000
020470     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02047000
020480         GO TO VPA-7101-PRIMCOMBOPT3.                             02048000
020490     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02049000
020500 VPA-7101-PRIMCOMBOPT2-CONT.                                      02050000
020510     PERFORM GET-BALANCE.                                         02051000
020520     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL2.                      02052000
020530 VPA-7101-PRIMCOMBOPT3.                                           02053000
020540     IF MIM-7101PRIMCOMBOPT3-Q IS NOT EQUAL TO 'E'                02054000
020550         GO TO VPA-7101-PRIMCOMBOPT4.                             02055000
020560     IF MIM-7101PRIMCOMBOPT3 IS NOT EQUAL TO 'Y'                  02056000
020570         GO TO VPA-7101-PRIMCOMBOPT4.                             02057000
020580     IF MIM-7101COMBCATCD3-Q IS NOT EQUAL TO 'E'                  02058000
020590         GO TO VPA-7101-PRIMCOMBOPT4.                             02059000
020600     IF MIM-7101COMBCATCD3 IS EQUAL TO SPACES                     02060000
020610         GO TO VPA-7101-PRIMCOMBOPT4.                             02061000
020620     IF MIM-7102COMBBALCD3-Q IS EQUAL TO 'E'                      02062000
020630         MOVE MIM-7102COMBBALCD3 TO WS-WORK-COMBBALCD             02063000
020640         GO TO VPA-7101-PRIMCOMBOPT3-CONT.                        02064000
020650     MOVE MIM-7101COMBCATCD3 TO WS-RPMIM7106RPREC.                02065000
020660     PERFORM SEARCH-RPS-7106.                                     02066000
020670     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02067000
020680         GO TO VPA-7101-PRIMCOMBOPT4.                             02068000
020690     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02069000
020700 VPA-7101-PRIMCOMBOPT3-CONT.                                      02070000
020710     PERFORM GET-BALANCE.                                         02071000
020720     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL3.                      02072000
020730 VPA-7101-PRIMCOMBOPT4.                                           02073000
020740     IF MIM-7101PRIMCOMBOPT4 IS NOT EQUAL TO 'Y'                  02074000
020750         GO TO VPA-PRIMARY-ACCT-VALID.                            02075000
020760     IF MIM-7101PRIMCOMBOPT4-Q IS NOT EQUAL TO 'E'                02076000
020770         GO TO VPA-PRIMARY-ACCT-VALID.                            02077000
020780     IF MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'                  02078000
020790         GO TO VPA-PRIMARY-ACCT-VALID.                            02079000
020800     IF MIM-7101COMBCATCD4 IS EQUAL TO SPACES                     02080000
020810         GO TO VPA-PRIMARY-ACCT-VALID.                            02081000
020820     IF MIM-7102COMBBALCD4-Q IS EQUAL TO 'E'                      02082000
020830         MOVE MIM-7102COMBBALCD4 TO WS-WORK-COMBBALCD             02083000
020840         GO TO VPA-7101-PRIMCOMBOPT4-CONT.                        02084000
020850     MOVE MIM-7101COMBCATCD4 TO WS-RPMIM7106RPREC.                02085000
020860     PERFORM SEARCH-RPS-7106.                                     02086000
020870     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02087000
020880         GO TO VPA-PRIMARY-ACCT-VALID.                            02088000
020890     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02089000
020900 VPA-7101-PRIMCOMBOPT4-CONT.                                      02090000
020910     PERFORM GET-BALANCE.                                         02091000
020920     MOVE WS-WORK-BALANCE TO WS-COMBINEBAL4.                      02092000
020930 VPA-PRIMARY-ACCT-VALID.                                          02093000
020940     MOVE 'Y' TO WS-PRIMARY-ENROLL.                               02094000
020950 VPA-EXIT.                                                        02095000
020960     EXIT.                                                        02096000
020970******************************************************************02097000
P0044  VALIDATE-PRIMARY-OPTION SECTION.                                 02097020
P0044  VPO-START.                                                       02097040
P0044      MOVE 'N' TO WS-PRIMOPT-FAIL.                                 02097060
P0044      MOVE SPACES TO WS-FUNCTION.                                  02097080
P0044      MOVE SPACES TO MI7102-RECORD.                                02097100
P0044      MOVE LOW-VALUES TO MIM-7102GRP-KEY.                          02097120
P0044      MOVE RPXXX30-PRIMARY-INST TO MIM-7102KINST.                  02097140
P0044      MOVE +7102 TO MIM-7102KREC.                                  02097160
P0044      MOVE WS-MODEL TO MIM-7102KMODEL.                             02097180
P0044      MOVE MIC-RPS-7102-PRI TO MIC-MST-REC-PRI.                    02097200
P0044      MOVE MI7102-RECORD TO MIMST-RECORD.                          02097220
P0044      PERFORM MIC-MST-GET-EQUAL-REQUEST.                           02097240
P0044      GO TO VPO-TEST.                                              02097260
P0044  VPO-FIND-NEXT.                                                   02097280
P0044      PERFORM MIC-MST-GET-NEXT-REQUEST.                            02097300
P0044  VPO-TEST.                                                        02097320
P0044      MOVE MIMST-RECORD TO MI7102-RECORD.                          02097340
P0044      IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02097360
P0044          GO TO VPO-EXIT.                                          02097380
P0044      IF MIM-7102KMODEL IS GREATER THAN WS-MODEL                   02097400
P0044          OR MIM-7102KINST IS NOT EQUAL TO RPXXX30-PRIMARY-INST    02097420
P0044          GO TO VPO-EXIT.                                          02097440
P0044      IF MIM-7102PRIMARY IS NOT EQUAL TO 'Y'                       02097460
P0044          GO TO VPO-FIND-NEXT.                                     02097480
P0044      IF MIM-7102KPRODCODE IS EQUAL TO SPACES                      02097500
P0044          AND MIM-7102KACCTTYPE IS EQUAL TO ZEROS                  02097520
P0044          GO TO VPO-EXIT.                                          02097540
P0044      MOVE WS-PRIM-PRODCD TO WS-SAVE-PRODCODE.                     02097560
P0044      MOVE WS-PRIM-TYPE TO WS-SAVE-ACCT-TYPE.                      02097580
P0044      IF MIM-7102KPRODCODE IS EQUAL TO WS-PRIM-PRODCD              02097600
P0044          AND (MIM-7102KACCTTYPE IS EQUAL TO ZEROS                 02097620
P0044          OR MIM-7102KACCTTYPE IS EQUAL TO WS-PRIM-TYPE)           02097640
P0044          GO TO VPO-EXIT.                                          02097660
P0044      MOVE 'Y' TO WS-PRIMOPT-FAIL.                                 02097680
P0044  VPO-EXIT.                                                        02097700
P0044      EXIT.                                                        02097720
P0044 ******************************************************************02097740
020980 VALIDATE-SECONDARY-ACCOUNTS SECTION.                             02098000
020990 VSA-START.                                                       02099000
021000     MOVE ZEROS TO WS-SUBSEC.                                     02100000
P0134      MOVE +1 TO WS-MAXACCTSUB.                                    02100500
021010 VSA-NEXT.                                                        02101000
021020     ADD +1 TO WS-SUBSEC.                                         02102000
021030     IF WS-SUBSEC IS GREATER THAN WS-SECONDARY-MAX                02103000
021040         GO TO VSA-EXIT.                                          02104000
021050     IF WS-SEC-ACCT (WS-SUBSEC) IS EQUAL TO SPACES                02105000
021060         GO TO VSA-EXIT.                                          02106000
P0184      IF WS-SEC-SKIP (WS-SUBSEC) IS EQUAL TO 'Y'                   02107000
P0184          MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02107290
P0184          GO TO VSA-NEXT.                                          02107580
P0184      IF WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'X'                   02107870
P0184          OR WS-SEC-QUAL (WS-SUBSEC) IS EQUAL TO 'N'               02108160
P0109          GO TO VSA-NEXT.                                          02109000
P0109      MOVE ZEROS TO WS-SUBSEC2.                                    02112050
P0109  VSA-DUPLICATE-ACCOUNT-LOOP.                                      02112100
P0109      ADD +1 TO WS-SUBSEC2.                                        02112150
P0109      IF WS-SUBSEC2 IS NOT LESS THAN WS-SUBSEC                     02112200
P0109          GO TO VSA-NEXT-CONT.                                     02112250
P0109      IF WS-SEC-INST (WS-SUBSEC)                                   02112300
P0109          IS EQUAL TO WS-SEC-INST (WS-SUBSEC2)                     02112350
P0109          AND WS-SEC-PRODCD (WS-SUBSEC)                            02112400
P0109          IS EQUAL TO WS-SEC-PRODCD (WS-SUBSEC2)                   02112450
P0109          AND WS-SEC-ACCT (WS-SUBSEC)                              02112500
P0109          IS EQUAL TO WS-SEC-ACCT (WS-SUBSEC2)                     02112550
P0109          AND (WS-SEC-QUAL (WS-SUBSEC2) IS EQUAL TO SPACES         02112600
P0109          OR WS-SEC-QUAL (WS-SUBSEC2) IS EQUAL TO 'Y')             02112650
P0109          MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02112700
P0109          GO TO VSA-NEXT.                                          02112750
P0109      GO TO VSA-DUPLICATE-ACCOUNT-LOOP.                            02112800
P0109  VSA-NEXT-CONT.                                                   02112850
021130     MOVE ZEROS TO WS-SECCATBAL.                                  02113000
021170 VSA-READ-ACT.                                                    02117000
P0184      IF WS-SEC-ACTREAD (WS-SUBSEC) IS EQUAL TO 'Y'                02118000
P0184          GO TO VSA-7101-CUSTRELCD.                                02118690
P0184      MOVE 'Y' TO WS-SEC-ACTREAD (WS-SUBSEC).                      02119380
021210     MOVE WS-SEC-INST (WS-SUBSEC) TO RPACT-INST.                  02121000
021220     MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPACT-PRODCODE.            02122000
021230     MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPACT-ACCOUNT.               02123000
021240     MOVE 'R  ' TO SR-APIFUNC.                                    02124000
021250     PERFORM RPS-ACT-GET-REQUEST.                                 02125000
P0184      IF WS-FUNCTION IS EQUAL TO 'N'                               02126000
021270         MOVE 'N' TO WS-SEC-ACTREC (WS-SUBSEC)                    02127000
021280         GO TO VSA-7101-CUSTRELCD.                                02128000
P0184      IF WS-FUNCTION IS NOT EQUAL TO SPACES                        02128200
P0184          MOVE 'Y' TO WS-SEC-SKIP (WS-SUBSEC)                      02128400
P0184          MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02128600
P0184          GO TO VSA-NEXT.                                          02128800
021290     MOVE 'Y' TO WS-SEC-ACTREC (WS-SUBSEC).                       02129000
P0184      MOVE RPACT-SC-INC-OPTION                                     02129200
P0184          TO WS-SEC-ACT-SCINCOPT (WS-SUBSEC).                      02129400
P0184      MOVE RPACT-RATE-INC-OPTION                                   02129600
P0184          TO WS-SEC-ACT-RATEINCOPT (WS-SUBSEC).                    02129800
021300     IF MIM-7100ACCTLIMITOPT IS EQUAL TO 'Y'                      02130000
021310         MOVE 'Y' TO WS-SEC-SKIP (WS-SUBSEC)                      02131000
021320         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02132000
021330         GO TO VSA-NEXT.                                          02133000
021340 VSA-7101-CUSTRELCD.                                              02134000
021350     IF MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'B'                   02135000
021360         AND MIM-7101CUSTRELCD-Q IS NOT EQUAL TO 'E'              02136000
P0134          GO TO VSA-ACCTINTERFACE.                                 02137000
021380     MOVE MIM-7101CUSTRELCD TO WS-RPMIM7104RPREC.                 02138000
021390     PERFORM SEARCH-RPS-7104.                                     02139000
021400     IF WS-RPMIM7104FOUND IS EQUAL TO 'N'                         02140000
P0155          MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02141590
021430         GO TO VSA-NEXT.                                          02143000
P0065      MOVE +1 TO WS-SUB10.                                         02144000
021450     IF MIM-7104OPT IS EQUAL TO 'I'                               02145000
021460         GO TO VSA-7101-CUSTRELCDI.                               02146000
021470 VSA-7101-CUSTRELCDE.                                             02147000
P0065      IF MIM-7104RLSP (WS-SUB10) IS EQUAL TO                       02148000
021490         WS-SEC-RELNBR (WS-SUBSEC)                                02149000
021510         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02151000
021520         GO TO VSA-NEXT.                                          02152000
P0184      IF MIM-7104RLSP (WS-SUB10) IS EQUAL TO ZEROS                 02153000
P0184          GO TO VSA-ACCTINTERFACE.                                 02153090
P0184      ADD +1 TO WS-SUB10.                                          02153180
P0065      IF WS-SUB10 IS GREATER THAN 50                               02153590
P0134          GO TO VSA-ACCTINTERFACE.                                 02155000
021560     GO TO VSA-7101-CUSTRELCDE.                                   02156000
021570 VSA-7101-CUSTRELCDI.                                             02157000
P0065      IF MIM-7104RLSP (WS-SUB10) IS EQUAL TO                       02158000
021590         WS-SEC-RELNBR (WS-SUBSEC)                                02159000
P0134          GO TO VSA-ACCTINTERFACE.                                 02160000
P0184      IF MIM-7104RLSP (WS-SUB10) IS EQUAL TO ZEROS                 02160200
P0184          MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02160400
P0184          GO TO VSA-NEXT.                                          02160600
P0065      ADD +1 TO WS-SUB10.                                          02161000
P0065      IF WS-SUB10 IS GREATER THAN 50                               02161590
021640         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02164000
021650         GO TO VSA-NEXT.                                          02165000
021660     GO TO VSA-7101-CUSTRELCDI.                                   02166000
P0134  VSA-ACCTINTERFACE.                                               02167000
P0134      IF WS-SEC-RPOPT (WS-SUBSEC) IS EQUAL TO 'P'                  02167790
P0134          MOVE ZEROS TO WS-SEC-BRANCH (WS-SUBSEC)                  02168580
P0134          MOVE ZEROS TO WS-SEC-TYPE (WS-SUBSEC)                    02169370
P0134          GO TO VSA-7102.                                          02170160
P0134      IF WS-SEC-APPL (WS-SUBSEC) IS EQUAL TO ZEROS                 02170950
P0134          MOVE WS-INTRFACE (100) TO SR-060CALLNAME                 02171740
P0134      ELSE                                                         02172530
P0134          MOVE WS-SEC-APPL (WS-SUBSEC) TO WS-WORK-APPL             02173320
P0134          MOVE WS-INTRFACE (WS-WORK-APPL) TO SR-060CALLNAME.       02174110
P0134      IF WS-SEC-INST (WS-SUBSEC) IS NOT EQUAL TO RPBNK-INST        02174900
P0134          AND WS-SEC-APPL (WS-SUBSEC) IS NOT EQUAL TO ZEROS        02175690
P0134          PERFORM FIND-CROSS-INST-INTERFACE.                       02176480
P0134      IF SR-060CALLNAME IS EQUAL TO SPACES                         02177270
P0134          MOVE 'Y' TO WS-SEC-SKIP (WS-SUBSEC)                      02178060
P0134          MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02178850
P0134          GO TO VSA-NEXT.                                          02179640
P0134      MOVE WS-SEC-INST (WS-SUBSEC) TO RPINF00-INST.                02180430
P0134      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02181220
P0134          AND WS-2024-EXISTS (RPINF00-INST) IS EQUAL TO 'Y'        02182010
P0134          MOVE WS-STBL-SUB (RPINF00-INST) TO WS-SSUB               02182800
P0134          MOVE WS-SEARCH-OPT (WS-SSUB) TO RPINF00-FILEOPTS.        02183590
P0134      MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPINF00-ACCOUNT.             02184380
P0134      MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPINF00-PRODCODE.          02185170
P0134      MOVE WS-SEC-APPL (WS-SUBSEC) TO RPINF00-APPLR.               02185960
P0134      MOVE MIM-7101CLOSEDACCTOPT TO RPINF00-CLOSEDACCTOPT.         02186750
P0134      MOVE 'R' TO RPINF00-FUNC.                                    02187540
P0134      EXEC CICS LINK                                               02188330
P0134          PROGRAM(SR-060CALLNAME)                                  02189120
P0134          COMMAREA(WS-LINKAPPL)                                    02189910
P0134          LENGTH(LENGTH OF WS-LINKAPPL)                            02190700
P0134          NOHANDLE                                                 02191490
P0134          END-EXEC.                                                02192280
P0134      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02193070
P0134          MOVE WS-FILEOPTS TO RPINF00-FILEOPTS.                    02193860
P0134      IF RPINF00-FUNCTION IS NOT EQUAL TO SPACE                    02194650
P0134          MOVE 'Y' TO WS-SEC-SKIP (WS-SUBSEC)                      02195440
P0134          MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02196230
P0134          GO TO VSA-NEXT.                                          02197020
P0134      MOVE RPINF00-BRANCH TO WS-SEC-BRANCH (WS-SUBSEC).            02197810
P0134      MOVE RPINF00-ACCT-TYPE TO WS-SEC-TYPE (WS-SUBSEC).           02198600
P0134  VSA-7102.                                                        02199390
P0134      MOVE WS-MODEL TO WS-RPMIM7102MODEL.                          02200180
P0134      MOVE WS-SEC-PRODCD (WS-SUBSEC) TO WS-RPMIM7102PRODCODE.      02200970
P0134      IF WS-SEC-RPOPT (WS-SUBSEC) IS EQUAL TO 'P'                  02201760
P0134          GO TO VSA-7102-TYPEZERO.                                 02202550
P0134      MOVE WS-SEC-TYPE (WS-SUBSEC) TO WS-RPMIM7102TYPE.            02203340
P0134      PERFORM SEARCH-RPS-7102.                                     02204130
P0134      IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         02204920
P0134          MOVE 'B' TO WS-SEC-7102 (WS-SUBSEC)                      02205710
P0134          GO TO VSA-7100-MAXACCOUNTS.                              02206500
P0134  VSA-7102-TYPEZERO.                                               02207290
P0134      MOVE ZEROS TO WS-RPMIM7102TYPE.                              02208080
P0134      PERFORM SEARCH-RPS-7102.                                     02208870
P0134      IF WS-RPMIM7102FOUND IS EQUAL TO 'Y'                         02209660
P0134          MOVE 'P' TO WS-SEC-7102 (WS-SUBSEC)                      02210450
P0134          GO TO VSA-7100-MAXACCOUNTS.                              02211240
P0134  VSA-7102-MODELONLY.                                              02212030
P0134      MOVE SPACES TO WS-RPMIM7102PRODCODE.                         02212820
P0134      MOVE ZEROS TO WS-RPMIM7102TYPE.                              02213610
P0134      PERFORM SEARCH-RPS-7102.                                     02214400
P0134      IF WS-RPMIM7102FOUND IS EQUAL TO 'N'                         02215190
P0134          MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02215980
P0134          GO TO VSA-NEXT.                                          02216770
P0134      MOVE 'M' TO WS-SEC-7102 (WS-SUBSEC).                         02217560
P0134  VSA-7100-MAXACCOUNTS.                                            02218350
P0134      IF MIM-7100MAXACCOUNTS IS EQUAL TO ZEROS                     02219140
P0134          GO TO VSA-ACCTINTERFACE.                                 02219930
P0134      ADD +1 TO WS-MAXACCTSUB.                                     02220720
P0134      IF WS-MAXACCTSUB IS GREATER THAN MIM-7100MAXACCOUNTS         02221510
P0134          GO TO VSA-EXIT.                                          02222300
022260 VSA-7102-TEST.                                                   02226000
022270     IF WS-SEC-ACTREC (WS-SUBSEC) IS NOT EQUAL TO 'Y'             02227000
022280         GO TO VSA-7102-USERROUTINE.                              02228000
P0184      IF WS-SEC-ACT-RATEINCOPT (WS-SUBSEC) IS EQUAL TO 'Y'         02229000
022300         AND MIM-7102SECRATEINCOPT IS EQUAL TO 'Y'                02230000
022310         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02231000
022320         GO TO VSA-NEXT.                                          02232000
022330     IF MIM-7100DUPINCOPT IS EQUAL TO 'Y'                         02233000
022340         GO TO VSA-7102-USERROUTINE.                              02234000
P0184      IF WS-SEC-ACT-SCINCOPT (WS-SUBSEC) IS EQUAL TO 'Y'           02235000
022360         AND MIM-7102SECSCINCOPT IS EQUAL TO 'Y'                  02236000
022370         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02237000
022380         GO TO VSA-NEXT.                                          02238000
022390 VSA-7102-USERROUTINE.                                            02239000
022430     MOVE MIM-7102PRODUCTGROUP TO WS-SEC-PROD-GROUP (WS-SUBSEC).  02243000
022440     IF (MIM-7102USERRTN-Q IS NOT EQUAL TO 'B'                    02244000
022450         AND MIM-7102USERRTN-Q IS NOT EQUAL TO 'E')               02245000
022460         OR MIM-7102USERRTN IS NOT EQUAL TO 'Y'                   02246000
022470         GO TO VSA-7102-BRANCH.                                   02247000
022480     IF WS-SEC-RPOPT (WS-SUBSEC) IS EQUAL TO 'P'                  02248000
022490         MOVE WS-SEC-INST (WS-SUBSEC) TO RPUSER-INST              02249000
022500         MOVE WS-SEC-ACCT (WS-SUBSEC) TO RPUSER-ACCOUNT           02250000
022510         MOVE WS-SEC-PRODCD (WS-SUBSEC) TO RPUSER-PRODCODE        02251000
022520         MOVE WS-SEC-APPL (WS-SUBSEC) TO RPUSER-APPLR             02252000
022530         INITIALIZE RPUSER-GRP-DATA                               02253000
022540     ELSE                                                         02254000
022550         MOVE RPINF00-INST TO RPUSER-INST                         02255000
022560         MOVE RPINF00-ACCOUNT TO RPUSER-ACCOUNT                   02256000
022570         MOVE RPINF00-PRODCODE TO RPUSER-PRODCODE                 02257000
022580         MOVE RPINF00-APPLR TO RPUSER-APPLR                       02258000
022590         MOVE RPINF00-USER-INFO TO RPUSER-USER-INFO               02259000
022600         MOVE RPINF00-MISC-INFO TO RPUSER-MISC-INFO               02260000
022610         MOVE RPINF00-BAL-INFO TO RPUSER-BAL-INFO                 02261000
022620     END-IF.                                                      02262000
022630     MOVE 'RPBUSER ' TO SR-060CALLNAME.                           02263000
022640     EXEC CICS LINK                                               02264000
022650         PROGRAM(SR-060CALLNAME)                                  02265000
022660         COMMAREA(WS-LINKUSER)                                    02266000
022670         LENGTH(LENGTH OF WS-LINKUSER)                            02267000
022680         NOHANDLE                                                 02268000
022690         END-EXEC.                                                02269000
022700     IF RPUSER-FUNCTION IS NOT EQUAL TO SPACES                    02270000
022710         OR RPUSER-PASSED IS EQUAL TO 'N'                         02271000
022720         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02272000
022730         GO TO VSA-NEXT.                                          02273000
022740 VSA-7102-BRANCH.                                                 02274000
022750     IF MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'B'                02275000
022760         AND MIM-7102BRCHREGIONCD-Q IS NOT EQUAL TO 'E'           02276000
022770         GO TO VSA-7102-MINTERM.                                  02277000
022780     MOVE RPXXX30-PRIMARY-INST TO WS-RPMIM7107INST.               02278000
022790     MOVE WS-SEC-INST (WS-SUBSEC) TO WS-RPMIM7107INST2.           02279000
022800     MOVE WS-SEC-BRANCH (WS-SUBSEC) TO WS-RPMIM7107BRCHREGION.    02280000
022810     MOVE MIM-7102BRCHREGIONCD TO WS-RPMIM7107RPREC.              02281000
022820     PERFORM VALIDATE-BRANCH.                                     02282000
022830     IF WS-RPMIM7107ERROR IS NOT EQUAL TO SPACES                  02283000
022840         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02284000
022850         GO TO VSA-NEXT.                                          02285000
022860 VSA-7102-MINTERM.                                                02286000
022870     IF WS-SEC-RPOPT (WS-SUBSEC) IS EQUAL TO 'P'                  02287000
022880         GO TO VSA-SECONDARY-ACCT-VALID.                          02288000
022890     IF MIM-7102MINTERM-Q IS NOT EQUAL TO 'B'                     02289000
022900         AND MIM-7102MINTERM-Q IS NOT EQUAL TO 'E'                02290000
022910         GO TO VSA-7102-MAXTERM.                                  02291000
022920     IF RPINF00-TERM IS LESS THAN MIM-7102MINTERM                 02292000
022930         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02293000
022940         GO TO VSA-NEXT.                                          02294000
022950 VSA-7102-MAXTERM.                                                02295000
022960     IF MIM-7102MAXTERM-Q IS NOT EQUAL TO 'B'                     02296000
022970         AND MIM-7102MAXTERM-Q IS NOT EQUAL TO 'E'                02297000
022980         GO TO VSA-7102-USEROPT1.                                 02298000
022990     IF RPINF00-TERM IS GREATER THAN MIM-7102MAXTERM              02299000
023000         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02300000
023010         GO TO VSA-NEXT.                                          02301000
023020 VSA-7102-USEROPT1.                                               02302000
023030     IF MIM-7102USERTYPE1 IS EQUAL TO 'P'                         02303000
023040         GO TO VSA-7102-USEROPT2.                                 02304000
023050     IF MIM-7102USEROPT1-Q IS NOT EQUAL TO 'B'                    02305000
023060         AND MIM-7102USEROPT1-Q IS NOT EQUAL TO 'E'               02306000
023070         GO TO VSA-7102-USEROPT2.                                 02307000
023080     IF (MIM-7102USEROPTREL1 IS EQUAL TO 'EQ'                     02308000
023090         AND RPINF00-USEROPT1 IS NOT EQUAL TO MIM-7102USEROPT1)   02309000
023100         OR (MIM-7102USEROPTREL1 IS EQUAL TO 'NE'                 02310000
023110         AND RPINF00-USEROPT1 IS EQUAL TO MIM-7102USEROPT1)       02311000
023120         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02312000
023130         GO TO VSA-NEXT.                                          02313000
023140 VSA-7102-USEROPT2.                                               02314000
023150     IF MIM-7102USERTYPE2 IS EQUAL TO 'P'                         02315000
023160         GO TO VSA-7102-USEROPT3.                                 02316000
023170     IF MIM-7102USEROPT2-Q IS NOT EQUAL TO 'B'                    02317000
023180         AND MIM-7102USEROPT2-Q IS NOT EQUAL TO 'E'               02318000
023190         GO TO VSA-7102-USEROPT3.                                 02319000
023200     IF (MIM-7102USEROPTREL2 IS EQUAL TO 'EQ'                     02320000
023210         AND RPINF00-USEROPT2 IS NOT EQUAL TO MIM-7102USEROPT2)   02321000
023220         OR (MIM-7102USEROPTREL2 IS EQUAL TO 'NE'                 02322000
023230         AND RPINF00-USEROPT2 IS EQUAL TO MIM-7102USEROPT2)       02323000
023240         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02324000
023250         GO TO VSA-NEXT.                                          02325000
023260 VSA-7102-USEROPT3.                                               02326000
023270     IF MIM-7102USERTYPE3 IS EQUAL TO 'P'                         02327000
023280         GO TO VSA-7102-USEROPT4.                                 02328000
023290     IF MIM-7102USEROPT3-Q IS NOT EQUAL TO 'B'                    02329000
023300         AND MIM-7102USEROPT3-Q IS NOT EQUAL TO 'E'               02330000
023310         GO TO VSA-7102-USEROPT4.                                 02331000
023320     IF (MIM-7102USEROPTREL3 IS EQUAL TO 'EQ'                     02332000
023330         AND RPINF00-USEROPT3 IS NOT EQUAL TO MIM-7102USEROPT3)   02333000
023340         OR (MIM-7102USEROPTREL3 IS EQUAL TO 'NE'                 02334000
023350         AND RPINF00-USEROPT3 IS EQUAL TO MIM-7102USEROPT3)       02335000
023360         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02336000
023370         GO TO VSA-NEXT.                                          02337000
023380 VSA-7102-USEROPT4.                                               02338000
023390     IF MIM-7102USERTYPE4 IS EQUAL TO 'P'                         02339000
023400         GO TO VSA-7102-BALCATCD1.                                02340000
023410     IF MIM-7102USEROPT4-Q IS NOT EQUAL TO 'B'                    02341000
023420         AND MIM-7102USEROPT4-Q IS NOT EQUAL TO 'E'               02342000
023430         GO TO VSA-7102-BALCATCD1.                                02343000
023440     IF (MIM-7102USEROPTREL4 IS EQUAL TO 'EQ'                     02344000
023450         AND RPINF00-USEROPT4 IS NOT EQUAL TO MIM-7102USEROPT4)   02345000
023460         OR (MIM-7102USEROPTREL4 IS EQUAL TO 'NE'                 02346000
023470         AND RPINF00-USEROPT4 IS EQUAL TO MIM-7102USEROPT4)       02347000
023480         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02348000
023490         GO TO VSA-NEXT.                                          02349000
023500 VSA-7102-BALCATCD1.                                              02350000
023510     IF MIM-7101ACCTRELCD-Q IS NOT EQUAL TO 'E'                   02351000
023520         GO TO VSA-7101-COMBCATCD.                                02352000
023530     IF MIM-7102BALCATCD1-Q IS NOT EQUAL TO 'E'                   02353000
023540         GO TO VSA-7102-BALCATCD2.                                02354000
023550     IF MIM-7102BALCATCD1 IS EQUAL TO SPACES                      02355000
023560         GO TO VSA-7102-BALCATCD2.                                02356000
023570     MOVE MIM-7102BALCATCD1 TO WS-RPMIM7106RPREC.                 02357000
023580     PERFORM SEARCH-RPS-7106.                                     02358000
023590     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02359000
023600         GO TO VSA-7102-BALCATCD2.                                02360000
023610     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02361000
023620     PERFORM GET-BALANCE.                                         02362000
023630     MOVE WS-WORK-BALANCE TO WS-SECCATBAL.                        02363000
023640     IF WS-SECCATBAL IS LESS THAN MIM-7106BALREQ-E                02364000
023650         GO TO VSA-7102-BALCATCD2.                                02365000
023660     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        02366000
023670         ADD +1 TO WS-ACCTRELCD-O.                                02367000
023680     GO TO VSA-7101-COMBCATCD.                                    02368000
023690 VSA-7102-BALCATCD2.                                              02369000
023700     IF MIM-7102BALCATCD2-Q IS NOT EQUAL TO 'E'                   02370000
023710         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    02371000
023720             GO TO VSA-7101-COMBCATCD                             02372000
023730         ELSE                                                     02373000
023740             MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                  02374000
023750             GO TO VSA-NEXT.                                      02375000
023760     IF MIM-7102BALCATCD2 IS EQUAL TO SPACES                      02376000
023770         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    02377000
023780             GO TO VSA-7101-COMBCATCD                             02378000
023790         ELSE                                                     02379000
023800             MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                  02380000
023810             GO TO VSA-NEXT.                                      02381000
023820     MOVE MIM-7102BALCATCD2 TO WS-RPMIM7106RPREC.                 02382000
023830     PERFORM SEARCH-RPS-7106.                                     02383000
023840     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02384000
023850         IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                    02385000
023860             GO TO VSA-7101-COMBCATCD                             02386000
023870         ELSE                                                     02387000
023880             MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                  02388000
023890             GO TO VSA-NEXT.                                      02389000
023900     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02390000
023910     PERFORM GET-BALANCE.                                         02391000
023920     MOVE WS-WORK-BALANCE TO WS-SECCATBAL.                        02392000
023930     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'A'                        02393000
023940         AND WS-SECCATBAL IS LESS THAN MIM-7106BALREQ-E           02394000
023950         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC)                      02395000
023960         GO TO VSA-EXIT.                                          02396000
023970     IF MIM-7101ACCTRELCDQ IS EQUAL TO 'O'                        02397000
023980         AND WS-SECCATBAL IS NOT LESS THAN MIM-7106BALREQ-E       02398000
023990         ADD +1 TO WS-ACCTRELCD-O.                                02399000
024000 VSA-7101-COMBCATCD.                                              02400000
024010     IF MIM-7101COMBCATCD1-Q IS NOT EQUAL TO 'E'                  02401000
024020         GO TO VSA-7101-COMBCATCD2.                               02402000
024030     IF MIM-7101COMBCATCD1 IS EQUAL TO SPACES                     02403000
024040         GO TO VSA-7101-COMBCATCD2.                               02404000
024050     IF MIM-7102COMBBALCD1-Q IS EQUAL TO 'E'                      02405000
024060         MOVE MIM-7102COMBBALCD1 TO WS-WORK-COMBBALCD             02406000
024070         GO TO VSA-7101-COMBCATCD1-CONT.                          02407000
024080     MOVE MIM-7101COMBCATCD1 TO WS-RPMIM7106RPREC.                02408000
024090     PERFORM SEARCH-RPS-7106.                                     02409000
024100     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02410000
024110         GO TO VSA-7101-COMBCATCD2.                               02411000
024120     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02412000
024130 VSA-7101-COMBCATCD1-CONT.                                        02413000
024140     PERFORM GET-BALANCE.                                         02414000
024150     MOVE WS-WORK-BALANCE TO WS-SEC-BAL1 (WS-SUBSEC).             02415000
024160 VSA-7101-COMBCATCD2.                                             02416000
024170     IF MIM-7101COMBCATCD2-Q IS NOT EQUAL TO 'E'                  02417000
024180         GO TO VSA-7101-COMBCATCD3.                               02418000
024190     IF MIM-7101COMBCATCD2 IS EQUAL TO SPACES                     02419000
024200         GO TO VSA-7101-COMBCATCD3.                               02420000
024210     IF MIM-7102COMBBALCD2-Q IS EQUAL TO 'E'                      02421000
024220         MOVE MIM-7102COMBBALCD2 TO WS-WORK-COMBBALCD             02422000
024230         GO TO VSA-7101-COMBCATCD2-CONT.                          02423000
024240     MOVE MIM-7101COMBCATCD2 TO WS-RPMIM7106RPREC.                02424000
024250     PERFORM SEARCH-RPS-7106.                                     02425000
024260     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02426000
024270         GO TO VSA-7101-COMBCATCD3.                               02427000
024280     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02428000
024290 VSA-7101-COMBCATCD2-CONT.                                        02429000
024300     PERFORM GET-BALANCE.                                         02430000
024310     MOVE WS-WORK-BALANCE TO WS-SEC-BAL2 (WS-SUBSEC).             02431000
024320 VSA-7101-COMBCATCD3.                                             02432000
024330     IF MIM-7101COMBCATCD3-Q IS NOT EQUAL TO 'E'                  02433000
024340         GO TO VSA-7101-COMBCATCD4.                               02434000
024350     IF MIM-7101COMBCATCD3 IS EQUAL TO SPACES                     02435000
024360         GO TO VSA-7101-COMBCATCD4.                               02436000
024370     IF MIM-7102COMBBALCD3-Q IS EQUAL TO 'E'                      02437000
024380         MOVE MIM-7102COMBBALCD3 TO WS-WORK-COMBBALCD             02438000
024390         GO TO VSA-7101-COMBCATCD3-CONT.                          02439000
024400     MOVE MIM-7101COMBCATCD3 TO WS-RPMIM7106RPREC.                02440000
024410     PERFORM SEARCH-RPS-7106.                                     02441000
024420     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02442000
024430         GO TO VSA-7101-COMBCATCD4.                               02443000
024440     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02444000
024450 VSA-7101-COMBCATCD3-CONT.                                        02445000
024460     PERFORM GET-BALANCE.                                         02446000
024470     MOVE WS-WORK-BALANCE TO WS-SEC-BAL3 (WS-SUBSEC).             02447000
024480 VSA-7101-COMBCATCD4.                                             02448000
024490     MOVE ZEROS TO WS-SECCATBAL.                                  02449000
024500     IF MIM-7101COMBCATCD4-Q IS NOT EQUAL TO 'E'                  02450000
024510         GO TO VSA-SECONDARY-ACCT-VALID.                          02451000
024520     IF MIM-7101COMBCATCD4 IS EQUAL TO SPACES                     02452000
024530         GO TO VSA-SECONDARY-ACCT-VALID.                          02453000
024540     IF MIM-7102COMBBALCD4-Q IS EQUAL TO 'E'                      02454000
024550         MOVE MIM-7102COMBBALCD4 TO WS-WORK-COMBBALCD             02455000
024560         GO TO VSA-7101-COMBCATCD4-CONT.                          02456000
024570     MOVE MIM-7101COMBCATCD4 TO WS-RPMIM7106RPREC.                02457000
024580     PERFORM SEARCH-RPS-7106.                                     02458000
024590     IF WS-RPMIM7106FOUND IS EQUAL TO 'N'                         02459000
024600         GO TO VSA-SECONDARY-ACCT-VALID.                          02460000
024610     MOVE MIM-7106BALCD TO WS-WORK-COMBBALCD.                     02461000
024620 VSA-7101-COMBCATCD4-CONT.                                        02462000
024630     PERFORM GET-BALANCE.                                         02463000
024640     MOVE WS-WORK-BALANCE TO WS-SEC-BAL4 (WS-SUBSEC).             02464000
024650 VSA-SECONDARY-ACCT-VALID.                                        02465000
024660     MOVE 'Y' TO WS-SEC-QUAL (WS-SUBSEC).                         02466000
024670     GO TO VSA-NEXT.                                              02467000
024680 VSA-EXIT.                                                        02468000
024690     EXIT.                                                        02469000
024700******************************************************************02470000
024710 CALL-RCIF SECTION.                                               02471000
024720 CR-START.                                                        02472000
P0109      MOVE ZEROS TO WS-PRIMCUSTACCT-END.                           02472500
024730     MOVE WS-INTRFACE (47) TO SR-060CALLNAME.                     02473000
024740     MOVE SPACES TO WS-FUNCTION.                                  02474000
024750     MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST.          02475000
024760     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02476000
024770         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        02477000
024780         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    02478000
024790     IF WS-PRIM-CUST-EXISTS IS NOT EQUAL TO 'Y'                   02479000
024800         MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-CUST-INST       02480000
024810         MOVE WS-RPXXX30-CUST-TYPE (1) TO RPRF21-BASE-CUST-TYPE   02481000
024820         MOVE WS-RPXXX30-CUST-KEY (1) TO RPRF21-BASE-CUST         02482000
024830         MOVE RPXXX30-REL-CODE (1) TO RPRF21-REL                  02483000
P0080          IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                 02483200
P0080              MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-CUST-INST 02483400
P0080          END-IF                                                   02483600
P0109          GO TO CR-ADD-PRIM-ACCOUNT.                               02484000
024850     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPRF21-BASE-ACCT-PRODCODE. 02485000
024860     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPRF21-BASE-ACCT.           02486000
024870     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          02487000
024880     MOVE SPACES TO RPRF21-BASE-CUSTOMER.                         02488000
024890     MOVE 'R' TO RPRF21-FUNC.                                     02489000
024900     EXEC CICS LINK                                               02490000
024910         PROGRAM('RPO0RF21')                                      02491000
024920         COMMAREA(RPRF21-MESSAGE)                                 02492000
024930         LENGTH(LENGTH OF RPRF21-MESSAGE)                         02493000
024940         RESP(WS-CICS-RESPONSE)                                   02494000
024950         END-EXEC.                                                02495000
024960     IF RPRF21-FUNCTION IS EQUAL TO 'N'                           02496000
024970         MOVE 'Y' TO WS-PRIM-FATAL-ERROR                          02497000
024980         MOVE SPACES TO RPRF21-NAME                               02498000
024990         GO TO CR-EXIT.                                           02499000
025000     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     02500000
025010         MOVE RPRF21-FUNCTION TO WS-FUNCTION                      02501000
025020         GO TO CR-EXIT.                                           02502000
P0109  CR-ADD-PRIM-ACCOUNT.                                             02502100
P0109      MOVE RPXXX30-PRIMARY-INST TO WS-SEC-INST (1).                02502200
P0109      MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-SEC-PRODCD (1).         02502300
P0109      MOVE RPXXX30-PRIMARY-ACCT-NBR TO WS-SEC-ACCT (1).            02502400
P0109      MOVE RPRF21-REL TO WS-SEC-RELNBR (1).                        02502500
P0109      MOVE RPRF21-REL TO WS-SEC-PRIMCUSTRELNBR (1).                02502600
P0109      MOVE 'N' TO WS-SEC-QUAL (1).                                 02502700
025030 CR-GET-CAC.                                                      02503000
025040     MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE.                    02504000
025050     MOVE ZEROS TO RPRF21-BASE-ACCT.                              02505000
P0109      MOVE +1 TO WS-SUB4.                                          02506000
025070     MOVE ZEROS TO WS-SUBADD.                                     02507000
025080 CR-GET-RCIF-INFO.                                                02508000
025090     MOVE SPACE TO WS-RF21-RETURN.                                02509000
025100     MOVE SPACES TO WS-LAST-PRODCD.                               02510000
025110     MOVE SPACES TO WS-RPMIM2023PRODCD.                           02511000
025120     MOVE SPACES TO WS-FUNCTION.                                  02512000
025130     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          02513000
025140     MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST.          02514000
025150     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02515000
025160         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        02516000
025170         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    02517000
025180     MOVE 'N' TO RPRF21-FUNC.                                     02518000
025190     EXEC CICS LINK                                               02519000
025200         PROGRAM(SR-060CALLNAME)                                  02520000
025210         COMMAREA(RPRF21-MESSAGE)                                 02521000
025220         LENGTH(LENGTH OF RPRF21-MESSAGE)                         02522000
025230         NOHANDLE                                                 02523000
025240         END-EXEC.                                                02524000
025250     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     02525000
025260         MOVE RPRF21-FUNCTION TO WS-FUNCTION                      02526000
025270         GO TO CR-SECONDARY-CUST-ACCOUNTS.                        02527000
025280     MOVE RPRF21-RETURN TO WS-RF21-RETURN.                        02528000
025290     MOVE RPRF21-RETURNED-OBJECT TO WS-CAC-TABLE.                 02529000
025300     MOVE ZEROS TO WS-SUB3.                                       02530000
025310 CR-CHECK-PRODCODE.                                               02531000
025320     ADD +1 TO WS-SUB3.                                           02532000
025330     IF WS-SUB3 IS GREATER THAN WS-CAC-MAX                        02533000
025340         GO TO CR-CHECK-MORE-SEC.                                 02534000
025350     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO SPACES                02535000
025360         GO TO CR-SECONDARY-CUST-ACCOUNTS.                        02536000
025370     IF WS-CAC-ACCT (WS-SUB3) IS EQUAL TO SPACES                  02537000
025380         GO TO CR-CHECK-PRODCODE.                                 02538000
025390     MOVE WS-CAC-INST (WS-SUB3) TO WS-SUBINST.                    02539000
P0024      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02540000
P0024          AND WS-2024-EXISTS (WS-SUBINST) IS NOT EQUAL TO 'Y'      02540290
025410         GO TO CR-CHECK-PRODCODE.                                 02541000
025420     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-LAST-PRODCD        02542000
025430         GO TO CR-VALID-SECACCT.                                  02543000
025440     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-RPMIM2023PRODCD    02544000
025450         GO TO CR-CHECK-PRODCODE.                                 02545000
025460     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-RPMIM2023PRODCD.          02546000
025470     PERFORM SEARCH-RPS-2023.                                     02547000
025480     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         02548000
025490         GO TO CR-CHECK-PRODCODE.                                 02549000
025500     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-LAST-PRODCD.              02550000
025510 CR-VALID-SECACCT.                                                02551000
025520     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO                       02552000
025530             RPXXX30-PRIMARY-PROD-CODE                            02553000
025540         AND WS-CAC-ACCT (WS-SUB3) IS EQUAL TO                    02554000
025550             RPXXX30-PRIMARY-ACCT-NBR                             02555000
025560         AND WS-CAC-INST (WS-SUB3) IS EQUAL TO                    02556000
025570             RPXXX30-PRIMARY-INST                                 02557000
P0044          MOVE WS-CAC-RELNBR (WS-SUB3) TO WS-SAVE-PRIM-RELCD       02557500
025580         GO TO CR-CHECK-PRODCODE.                                 02558000
025590     ADD +1 TO WS-SUB4.                                           02559000
025600     IF WS-SUB4 IS GREATER THAN WS-SECONDARY-MAX                  02560000
025610         GO TO CR-CHECK-PRODCODE.                                 02561000
025620     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SEC-PRODCD (WS-SUB4).     02562000
025630     MOVE WS-2023-INTAPPL (INDX-2023) TO WS-SEC-APPL (WS-SUB4).   02563000
025640     MOVE WS-2023-RPOPTION (INDX-2023) TO WS-SEC-RPOPT (WS-SUB4). 02564000
025650     MOVE ZEROS TO WS-SEC-BRANCH (WS-SUB4).                       02565000
025660     MOVE ZEROS TO WS-SEC-TYPE (WS-SUB4).                         02566000
025670     MOVE WS-CAC-INST (WS-SUB3) TO WS-SEC-INST (WS-SUB4).         02567000
025680     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SEC-ACCT (WS-SUB4).         02568000
025690     MOVE WS-CAC-RELNBR (WS-SUB3) TO WS-SEC-RELNBR (WS-SUB4).     02569000
P0109      MOVE ZEROS TO WS-SEC-PRIMCUSTRELNBR (WS-SUB4).               02570000
025710     GO TO CR-CHECK-PRODCODE.                                     02571000
025720 CR-CHECK-MORE-SEC.                                               02572000
025730     IF WS-RF21-RETURN IS NOT EQUAL TO 'M'                        02573000
025740         GO TO CR-SECONDARY-CUST-ACCOUNTS.                        02574000
P0109      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02575000
P0109          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        02575090
P0109          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST     02575180
P0109      ELSE                                                         02575270
P0109          MOVE WS-CAC-INST (WS-CAC-MAX) TO RPRF21-BASE-ACCT-INST.  02575360
025760     MOVE WS-CAC-PRODCD (WS-CAC-MAX) TO RPRF21-BASE-ACCT-PRODCODE.02576000
025770     MOVE WS-CAC-ACCT (WS-CAC-MAX) TO RPRF21-BASE-ACCT.           02577000
025780     IF RPXXX30-PRIMARY-MODEL IS EQUAL TO SPACES                  02578000
025790         MOVE 'N' TO RPRF21-CLOSEDACCTOPT                         02579000
025800     ELSE                                                         02580000
025810         MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.      02581000
025820     GO TO CR-GET-RCIF-INFO.                                      02582000
025830 CR-SECONDARY-CUST-ACCOUNTS.                                      02583000
P0109      MOVE WS-SUB4 TO WS-PRIMCUSTACCT-END.                         02583500
025840     PERFORM GET-MY-SECONDARY-ACCOUNTS.                           02584000
025850 CR-EXIT.                                                         02585000
025860     EXIT.                                                        02586000
025870******************************************************************02587000
025880 GET-MY-SECONDARY-ACCOUNTS SECTION.                               02588000
025890* ***********************************************************     02589000
025900*   THE PURPOSE OF THIS SECTION IS TO FIND THE ACCOUNTS           02590000
025910*   BELONGING TO SECONDARY CUSTOMERS OF THE PRIMARY ACCOUNT       02591000
025920*   AND ADD THESE ADDITIONAL ACCOUNTS TO THE TABLE                02592000
025930*   OF ACCOUNTS FROM THE PRIMARY CUSTOMER                         02593000
025940* ***********************************************************     02594000
025950 GM-START.                                                        02595000
P0109      MOVE ZERO TO WS-SECTABLE.                                    02596000
025980     MOVE SPACES TO WS-FUNCTION.                                  02598000
025990     MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST.          02599000
026000     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02600000
026010         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        02601000
026020         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    02602000
026030     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPRF21-BASE-ACCT-PRODCODE. 02603000
026040     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPRF21-BASE-ACCT.           02604000
026050     MOVE SPACES TO RPRF21-BASE-CUSTOMER.                         02605000
026060 GM-SEC-AGAIN.                                                    02606000
P0109      MOVE 'N' TO RPRF21-CLOSEDACCTOPT.                            02607000
026080     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02608000
026090         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        02609000
026100         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    02610000
026110     MOVE 'X' TO RPRF21-FUNC.                                     02611000
026120     EXEC CICS LINK                                               02612000
026130         PROGRAM(SR-060CALLNAME)                                  02613000
026140         COMMAREA(RPRF21-MESSAGE)                                 02614000
026150         LENGTH(LENGTH OF RPRF21-MESSAGE)                         02615000
026160         NOHANDLE                                                 02616000
026170         END-EXEC.                                                02617000
026180     MOVE 'N' TO WS-MORE-SECONDARYCUST.                           02618000
026190     IF RPRF21-RETURN IS EQUAL TO 'M'                             02619000
026200         MOVE 'Y' TO WS-MORE-SECONDARYCUST                        02620000
026210         MOVE SPACE TO RPRF21-RETURN.                             02621000
026220*                                                                 02622000
026230     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     02623000
026240         GO TO GM-CHECK-ADDL-CUSTOMERS.                           02624000
026250*  HERE I HAVE THE FIRST GROUP OF SECONDARY CUSTOMERS             02625000
026260     MOVE RPRF21-RETURNED-OBJECT TO WS-ACC-TABLE.                 02626000
026270 GM-CHECK-ADDL-CUSTOMERS.                                         02627000
026280     PERFORM CHECK-FOR-ADDITIONAL-CUSTOMERS.                      02628000
026290     IF WS-SUB7 IS GREATER THAN +1                                02629000
026300         MOVE 'Y' TO WS-MORE-SECONDARYCUST.                       02630000
026310     MOVE +1 TO WS-SECCUSTSUB.                                    02631000
026320 GM-LOAD-SECONDARY.                                               02632000
026330     IF WS-SECCUSTSUB IS GREATER THAN WS-ACC-MAX                  02633000
026340         AND WS-MORE-SECONDARYCUST IS EQUAL TO 'Y'                02634000
026350         MOVE WS-ACC-CUST (WS-ACC-MAX) TO RPRF21-BASE-CUST        02635000
026360         MOVE WS-ACC-CUST-TYPE (WS-ACC-MAX) TO                    02636000
026370         RPRF21-BASE-CUST-TYPE                                    02637000
026380         MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST       02638000
026390         MOVE RPXXX30-PRIMARY-PROD-CODE TO                        02639000
026400             RPRF21-BASE-ACCT-PRODCODE                            02640000
026410         MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPRF21-BASE-ACCT        02641000
026420         MOVE WS-ACC-INST (WS-ACC-MAX) TO WS-NEXTCINST            02642000
026430         MOVE WS-ACC-CUST-TYPE (WS-ACC-MAX) TO WS-NEXTCTYPE       02643000
026440         MOVE WS-ACC-CUST (WS-ACC-MAX) TO WS-NEXTCCUST            02644000
026450         MOVE WS-ACC-PRIM (WS-ACC-MAX) TO WS-NEXTPRIM             02645000
026460         MOVE WS-ACC-RELNBR (WS-ACC-MAX) TO WS-NEXTRELN           02646000
026470         MOVE 'M' TO RPRF21-RETURN                                02647000
026480         MOVE WS-NEXTACC TO RPRF21-RETURNED-OBJECT                02648000
026490         GO TO GM-SEC-AGAIN.                                      02649000
026500* **                                                              02650000
026510     IF WS-SECCUSTSUB IS GREATER THAN WS-ACC-MAX                  02651000
026520         AND WS-MORE-SECONDARYCUST IS EQUAL TO 'N'                02652000
026530         GO TO GM-MORE-ACCTS.                                     02653000
026540* ** DONE LOADING CUSTOMERS NOW GET ACCOUNTS                      02654000
026550     IF WS-ACC-CUST (WS-SECCUSTSUB) IS EQUAL TO SPACES            02655000
026560         AND                                                      02656000
026570         WS-ACC-INST (WS-SECCUSTSUB) IS EQUAL TO ZEROS            02657000
026580         GO TO GM-MORE-ACCTS.                                     02658000
026590* ** EXCLUDE PRIMARY CUSTOMER                                     02659000
026600     IF WS-ACC-PRIM (WS-SECCUSTSUB) IS EQUAL TO ZERO              02660000
026610         ADD +1 TO WS-SECCUSTSUB                                  02661000
026620         GO TO GM-LOAD-SECONDARY.                                 02662000
026630* ** DONE LOADING CUSTOMERS NOW GET ACCOUNTS                      02663000
026640* **                                                              02664000
026650 GM-LOAD-SEC-CUST.                                                02665000
026660     ADD +1 TO WS-SECTABLE.                                       02666000
026670* **                                                              02667000
026680* ** MAXIMUM 198 CUSTOMERS                                        02668000
026690* **                                                              02669000
026700     IF WS-SECTABLE IS GREATER THAN WS-SECCUSTMAX                 02670000
026710         MOVE WS-SECCUSTMAX TO WS-SECTABLE                        02671000
026720         GO TO GM-MORE-ACCTS.                                     02672000
026730     MOVE WS-ACC-INST (WS-SECCUSTSUB)                             02673000
026740         TO WS-SECUST-INST (WS-SECTABLE).                         02674000
026750     MOVE WS-ACC-CUST-TYPE (WS-SECCUSTSUB)                        02675000
026760         TO WS-SECUST-CUST-TYPE (WS-SECTABLE).                    02676000
026770     MOVE WS-ACC-CUST (WS-SECCUSTSUB)                             02677000
026780         TO WS-SECUST-CUST (WS-SECTABLE).                         02678000
026790     MOVE WS-ACC-PRIM (WS-SECCUSTSUB)                             02679000
026800         TO WS-SECUST-PRIM (WS-SECTABLE).                         02680000
026810     MOVE WS-ACC-RELNBR (WS-SECCUSTSUB)                           02681000
026820         TO WS-SECUST-RELNBR (WS-SECTABLE).                       02682000
026830     ADD 1 TO WS-SECCUSTSUB.                                      02683000
026840     GO TO GM-LOAD-SECONDARY.                                     02684000
026850* **                                                              02685000
026860 GM-MORE-ACCTS.                                                   02686000
026870     MOVE ZERO TO WS-SECCUSTSUB.                                  02687000
026880 GM-FIND-SEC-ACCTS.                                               02688000
026890     ADD 1 TO WS-SECCUSTSUB.                                      02689000
026900     IF WS-SECCUSTSUB IS GREATER THAN WS-SECTABLE                 02690000
026910         GO TO GM-END.                                            02691000
026920     IF WS-SECCUSTSUB IS GREATER THAN WS-SECMAX                   02692000
026930         GO TO GM-END.                                            02693000
026940     MOVE RPXXX30-PRIMARY-INST TO RPRF21-BASE-ACCT-INST.          02694000
P0184      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02694200
P0184          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        02694400
P0184          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    02694600
026950     MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE.                    02695000
026960     MOVE ZEROS TO RPRF21-BASE-ACCT.                              02696000
026970     MOVE WS-SECUST-INST (WS-SECCUSTSUB)                          02697000
026980         TO RPRF21-BASE-CUST-INST.                                02698000
P0184      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02698200
P0184          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        02698400
P0184          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-CUST-INST.    02698600
026990     MOVE WS-SECUST-CUST-TYPE (WS-SECCUSTSUB)                     02699000
027000         TO RPRF21-BASE-CUST-TYPE.                                02700000
027010     MOVE WS-SECUST-CUST (WS-SECCUSTSUB)                          02701000
027020         TO RPRF21-BASE-CUST.                                     02702000
P0109      ADD +1 TO WS-SUB4                                            02702100
P0109      MOVE RPXXX30-PRIMARY-INST TO WS-SEC-INST (WS-SUB4).          02702200
P0109      MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-SEC-PRODCD (WS-SUB4).   02702300
P0109      MOVE RPXXX30-PRIMARY-ACCT-NBR TO WS-SEC-ACCT (WS-SUB4).      02702400
P0109      MOVE WS-SECUST-RELNBR (WS-SECCUSTSUB)                        02702500
P0109          TO WS-SEC-RELNBR (WS-SUB4).                              02702600
P0109      MOVE WS-SECUST-RELNBR (WS-SECCUSTSUB)                        02702700
P0109          TO WS-SEC-PRIMCUSTRELNBR (WS-SUB4).                      02702800
P0109      MOVE 'N' TO WS-SEC-QUAL (WS-SUB4).                           02702900
027030 GM-MORE-SECONDARY-ACCTS.                                         02703000
027040     MOVE 'N' TO RPRF21-FUNC.                                     02704000
027050     EXEC CICS LINK                                               02705000
027060         PROGRAM(SR-060CALLNAME)                                  02706000
027070         COMMAREA(RPRF21-MESSAGE)                                 02707000
027080         LENGTH(LENGTH OF RPRF21-MESSAGE)                         02708000
027090         NOHANDLE                                                 02709000
027100         END-EXEC.                                                02710000
027110     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     02711000
027120         MOVE RPRF21-FUNCTION TO WS-FUNCTION                      02712000
027130         GO TO GM-FIND-SEC-ACCTS.                                 02713000
027140* ** A BAD RETURN CODE FROM GET ACCOUNTS GO TO NEXT CUSTOMER      02714000
027150     MOVE RPRF21-RETURNED-OBJECT TO WS-CAC-TABLE.                 02715000
027160     MOVE ZEROS TO WS-SUB3.                                       02716000
027170 GM-CHECK-PRODCODE.                                               02717000
027180     ADD +1 TO WS-SUB3.                                           02718000
027190     IF WS-SUB3 IS GREATER THAN WS-CAC-MAX                        02719000
027200         GO TO GM-CHECK-MORE-SEC.                                 02720000
027210     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO SPACES                02721000
027220         GO TO GM-CHECK-MORE-SEC.                                 02722000
027230     IF WS-CAC-ACCT (WS-SUB3) IS EQUAL TO SPACES                  02723000
027240         GO TO GM-CHECK-MORE-SEC.                                 02724000
027250     MOVE WS-CAC-INST (WS-SUB3) TO WS-SUBINST.                    02725000
P0024      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02726000
P0024          AND WS-2024-EXISTS (WS-SUBINST) IS NOT EQUAL TO 'Y'      02726490
P0024          GO TO GM-CHECK-PRODCODE.                                 02726980
027280     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-LAST-PRODCD        02728000
P0109          GO TO GM-VALID-ADD.                                      02729000
027300     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-RPMIM2023PRODCD    02730000
P0109          GO TO GM-VALID-ADD.                                      02731000
027320     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-RPMIM2023PRODCD.          02732000
027330     PERFORM SEARCH-RPS-2023.                                     02733000
027340     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         02734000
027350         GO TO GM-CHECK-PRODCODE.                                 02735000
P0184      MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-LAST-PRODCD.              02739000
027440* ****************************************************            02744000
027450 GM-VALID-ADD.                                                    02745000
027460     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO                       02746000
027470             RPXXX30-PRIMARY-PROD-CODE                            02747000
027480         AND WS-CAC-ACCT (WS-SUB3) IS EQUAL TO                    02748000
027490             RPXXX30-PRIMARY-ACCT-NBR                             02749000
027500         AND WS-CAC-INST (WS-SUB3) IS EQUAL TO                    02750000
027510             RPXXX30-PRIMARY-INST                                 02751000
027520         GO TO GM-CHECK-PRODCODE.                                 02752000
027530     ADD +1 TO WS-SUB4.                                           02753000
027540     IF WS-SUB4 IS GREATER THAN WS-SECONDARY-MAX                  02754000
027550         GO TO GM-END.                                            02755000
027560* SAVE BEFORE LOAD                                                02756000
027570     ADD +1 TO WS-ALLSEC.                                         02757000
027580     IF WS-ALLSEC IS GREATER THAN WS-SECMAX                       02758000
027590         MOVE WS-SECMAX TO WS-ALLSEC                              02759000
027600         GO TO GM-VALID-AD2.                                      02760000
027610     MOVE WS-CAC-INST (WS-SUB3) TO WS-SECINST (WS-ALLSEC).        02761000
027620     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SECPRODCD (WS-ALLSEC).    02762000
027630     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SECACCOUNT (WS-ALLSEC).     02763000
027640 GM-VALID-AD2.                                                    02764000
027650     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SEC-PRODCD (WS-SUB4).     02765000
027660     MOVE WS-2023-INTAPPL (INDX-2023) TO WS-SEC-APPL (WS-SUB4).   02766000
027670     MOVE WS-2023-RPOPTION (INDX-2023) TO WS-SEC-RPOPT (WS-SUB4). 02767000
027680     MOVE ZEROS TO WS-SEC-BRANCH (WS-SUB4).                       02768000
027690     MOVE ZEROS TO WS-SEC-TYPE (WS-SUB4).                         02769000
027700     MOVE WS-CAC-INST (WS-SUB3) TO WS-SEC-INST (WS-SUB4).         02770000
027710     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SEC-ACCT (WS-SUB4).         02771000
027720     MOVE WS-CAC-RELNBR (WS-SUB3) TO WS-SEC-RELNBR (WS-SUB4).     02772000
P0109      MOVE ZEROS TO WS-SEC-PRIMCUSTRELNBR (WS-SUB4).               02773000
027750     GO TO GM-CHECK-PRODCODE.                                     02775000
027760 GM-CHECK-MORE-SEC.                                               02776000
027770     IF RPRF21-RETURN IS NOT EQUAL TO 'M'                         02777000
027780         GO TO GM-FIND-SEC-ACCTS.                                 02778000
027790* ** CHECK FOR MORE ACCOUNTS FOR THIS SECONDARY CUSTOMER          02779000
P0109      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     02780000
P0109          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        02780090
P0109          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST     02780180
P0109      ELSE                                                         02780270
P0109          MOVE WS-CAC-INST (WS-CAC-MAX) TO RPRF21-BASE-ACCT-INST.  02780360
027810     MOVE WS-CAC-PRODCD (WS-CAC-MAX) TO RPRF21-BASE-ACCT-PRODCODE.02781000
027820     MOVE WS-CAC-ACCT (WS-CAC-MAX) TO RPRF21-BASE-ACCT.           02782000
027830     GO TO GM-MORE-SECONDARY-ACCTS.                               02783000
027840 GM-END.                                                          02784000
027850     MOVE WS-SUB4 TO WS-SECCUSTACCT-END.                          02785000
027860* **                                                              02786000
027870 GM-EXIT.                                                         02787000
027880     EXIT.                                                        02788000
027890* **                                                              02789000
028140******************************************************************02814000
028150 CHECK-SECCUSTACCT-RELNBR SECTION.                                02815000
028160* *********************************************************       02816000
028170* DETERMINE IF THE ACCOUNT SHOULD BE INCLUDED BASED ON            02817000
028180* THE RELATIONSHIP CODE WITH THE PRIMARY ACCOUNT                  02818000
028190* *********************************************************       02819000
028200 CSR-START.                                                       02820000
028210     MOVE +1 TO WS-RELSUB.                                        02821000
028220 CSR-CHECKIT.                                                     02822000
028230     IF WS-RELSUB IS GREATER THAN WS-RELMAX                       02823000
028240         GO TO CSR-NOMATCH.                                       02824000
028250     IF WS-SECRELCODE (WS-RELSUB) IS EQUAL TO ZEROS               02825000
028260         GO TO CSR-NOMATCH.                                       02826000
P0109      IF WS-SEC-PRIMCUSTRELNBR (WS-SUB4)                           02827000
028280         IS EQUAL TO WS-SECRELCODE (WS-RELSUB)                    02828000
028290         GO TO CSR-MATCH.                                         02829000
028300     ADD +1 TO WS-RELSUB.                                         02830000
028310     GO TO CSR-CHECKIT.                                           02831000
028320 CSR-MATCH.                                                       02832000
028330     IF WS-INCLUDEREL IS EQUAL TO 'Y'                             02833000
028340         MOVE 'N' TO WS-BADRELNBR                                 02834000
028350         GO TO CSR-EXIT.                                          02835000
028360     MOVE 'Y' TO WS-BADRELNBR.                                    02836000
028370     GO TO CSR-EXIT.                                              02837000
028380 CSR-NOMATCH.                                                     02838000
028390     IF WS-INCLUDEREL IS EQUAL TO 'Y'                             02839000
028400         MOVE 'Y' TO WS-BADRELNBR                                 02840000
028410         GO TO CSR-EXIT.                                          02841000
028420     MOVE 'N' TO WS-BADRELNBR.                                    02842000
028430 CSR-EXIT.                                                        02843000
028440     EXIT.                                                        02844000
028450******************************************************************02845000
028460 CHECK-FOR-ADDITIONAL-CUSTOMERS SECTION.                          02846000
028470 CFAC-START.                                                      02847000
028480     MOVE +0 TO WS-SUB7.                                          02848000
028490     MOVE +0 TO WS-SUB8.                                          02849000
P0014      IF WS-PRIM-CUST-EXISTS IS EQUAL TO 'Y'                       02850000
028510         MOVE +0 TO WS-SUB7                                       02851000
028520     ELSE                                                         02852000
028530         MOVE +1 TO WS-SUB7.                                      02853000
028540 CFAC-RPXXX30-LOOP.                                               02854000
028550     ADD +1 TO WS-SUB7.                                           02855000
028560     IF WS-SUB7 IS GREATER THAN WS-RPXXX30-CSTTBL-MAX             02856000
028570         GO TO CFAC-EXIT.                                         02857000
P0184      IF WS-SUB4 IS NOT LESS THAN WS-SECONDARY-MAX                 02857050
P0184          GO TO CFAC-EXIT.                                         02857100
P0184      IF WS-RPXXX30-CUST-NA (WS-SUB7) IS EQUAL TO SPACES           02857150
P0184          AND WS-RPXXX30-CUST-NO (WS-SUB7) IS EQUAL TO ZEROS       02857200
P0184          AND WS-RPXXX30-REL-CODE (WS-SUB7)                        02857250
P0184              IS NOT EQUAL TO ZEROS                                02857300
P0184          ADD +1 TO WS-SUB4                                        02857350
P0184          MOVE RPXXX30-PRIMARY-INST TO WS-SEC-INST (WS-SUB4)       02857400
P0184          MOVE RPXXX30-PRIMARY-PROD-CODE                           02857450
P0184              TO WS-SEC-PRODCD (WS-SUB4)                           02857500
P0184          MOVE RPXXX30-PRIMARY-ACCT-NBR                            02857550
P0184              TO WS-SEC-ACCT (WS-SUB4)                             02857600
P0184          MOVE WS-RPXXX30-REL-CODE (WS-SUB7)                       02857650
P0184              TO WS-SEC-RELNBR (WS-SUB4)                           02857700
P0184          MOVE WS-RPXXX30-REL-CODE (WS-SUB7)                       02857750
P0184              TO WS-SEC-PRIMCUSTRELNBR (WS-SUB4)                   02857800
P0184          MOVE 'N' TO WS-SEC-QUAL (WS-SUB4)                        02857850
P0184          GO TO CFAC-RPXXX30-LOOP.                                 02857900
028580     IF WS-RPXXX30-CUST-NA (WS-SUB7) IS EQUAL TO SPACES           02858000
P0109          AND WS-RPXXX30-CUST-NO (WS-SUB7) IS EQUAL TO ZEROS       02858500
028590         GO TO CFAC-EXIT.                                         02859000
028600     IF WS-RPXXX30-FOUND-FLAG (WS-SUB7) IS EQUAL TO 'F'           02860000
028610         GO TO CFAC-RPXXX30-LOOP.                                 02861000
028620 CFAC-ACC-LOOP.                                                   02862000
028630     ADD +1 TO WS-SUB8.                                           02863000
028640     IF WS-SUB8 IS GREATER THAN WS-ACC-MAX                        02864000
028650         GO TO CFAC-RPXXX30-LOOP.                                 02865000
028660     IF WS-ACC-CUST (WS-SUB8) IS EQUAL TO SPACES                  02866000
028670         AND WS-RPXXX30-CUST-KEY (WS-SUB7) IS NOT EQUAL TO SPACES 02867000
028680         MOVE RPXXX30-PRIMARY-INST TO WS-ACC-INST (WS-SUB8)       02868000
028690         MOVE WS-RPXXX30-CUST-TYPE (WS-SUB7)                      02869000
028700             TO WS-ACC-CUST-TYPE (WS-SUB8)                        02870000
028710         MOVE WS-RPXXX30-REL-CODE (WS-SUB7)                       02871000
028720             TO WS-ACC-RELNBR (WS-SUB8)                           02872000
028730         MOVE WS-RPXXX30-CUST-KEY (WS-SUB7)                       02873000
028740             TO WS-ACC-CUST (WS-SUB8)                             02874000
028750         MOVE '1' TO WS-ACC-PRIM (WS-SUB8).                       02875000
028760     IF WS-ACC-CUST (WS-SUB8) IS EQUAL TO SPACES                  02876000
028770         GO TO CFAC-RPXXX30-LOOP.                                 02877000
028780     IF WS-RPXXX30-CUST-KEY (WS-SUB7) IS EQUAL TO                 02878000
028790             WS-ACC-CUST (WS-SUB8)                                02879000
028800         MOVE 'F' TO WS-RPXXX30-FOUND-FLAG (WS-SUB7)              02880000
028810         GO TO CFAC-RPXXX30-LOOP.                                 02881000
028820     GO TO CFAC-ACC-LOOP.                                         02882000
028830 CFAC-EXIT.                                                       02883000
028840     EXIT.                                                        02884000
028850******************************************************************02885000
028860 FIND-CROSS-INST-INTERFACE SECTION.                               02886000
028870 FCII-START.                                                      02887000
028880     MOVE WS-SEC-INST (WS-SUBSEC) TO WS-0237TEST-INST.            02888000
028890     MOVE WS-SEC-APPL (WS-SUBSEC) TO WS-0237TEST-APPL.            02889000
028900     SEARCH ALL WS-0237-INTRFACE                                  02890000
028910         AT END                                                   02891000
028920             GO TO FCII-EXIT                                      02892000
028930         WHEN WS-0237-KEY (INDX-0237) IS EQUAL TO WS-0237TEST-KEY 02893000
028940             MOVE WS-0237-INTF (INDX-0237) TO SR-060CALLNAME.     02894000
028950 FCII-EXIT.                                                       02895000
028960     EXIT.                                                        02896000
028970******************************************************************02897000
028980 REQUEST-CUSTOMER SECTION.                                        02898000
028990 RC-START.                                                        02899000
029000     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          02900000
029010     MOVE 'N' TO RPRF21-GLOBAL-CLOSE.                             02901000
029020     MOVE WS-FILEOPTS TO RPRF21-FILEOPTS.                         02902000
029030     EXEC CICS LINK                                               02903000
029040         PROGRAM('RPO0RF21')                                      02904000
029050         COMMAREA(RPRF21-MESSAGE)                                 02905000
029060         LENGTH(LENGTH OF RPRF21-MESSAGE)                         02906000
029070         RESP(WS-CICS-RESPONSE)                                   02907000
029080         END-EXEC.                                                02908000
029090     MOVE RPRF21-FUNCTION TO WS-FUNCTION.                         02909000
029100     IF WS-CICS-RESPONSE IS NOT EQUAL TO ZERO                     02910000
029110         MOVE 'L' TO WS-FUNCTION                                  02911000
029120         MOVE 500036 TO RPXXX30-RESP-MSG-NBR                      02912000
029130         MOVE 500036 TO RPXXX30-MSGNBR                            02913000
029140         GO TO RC-EXIT.                                           02914000
029150     IF WS-FUNCTION IS EQUAL TO 'B'                               02915000
029160         GO TO RC-EXIT.                                           02916000
029170     IF WS-FUNCTION IS EQUAL TO 'C'                               02917000
029180         MOVE 500037 TO RPXXX30-RESP-MSG-NBR                      02918000
029190         MOVE 500037 TO RPXXX30-MSGNBR                            02919000
029200         GO TO RC-EXIT.                                           02920000
029210     IF WS-FUNCTION IS EQUAL TO 'I'                               02921000
029220         MOVE 500038 TO RPXXX30-MSGNBR                            02922000
029230         MOVE 500038 TO RPXXX30-RESP-MSG-NBR.                     02923000
029240 RC-EXIT.                                                         02924000
029250     EXIT.                                                        02925000
029260******************************************************************02926000
029270 FIND-PROD-CODE SECTION.                                          02927000
029280 FPC-START.                                                       02928000
029290     MOVE 'N' TO WS-ERRORPRODCODE.                                02929000
029300     MOVE '1' TO RPS-SEC-REC-ALT.                                 02930000
029310     MOVE LOW-VALUES TO RPSEC-GRP-KEY.                            02931000
029320     MOVE LOW-VALUES TO RPSEC-GRP-AIX1.                           02932000
029330     MOVE RPXXX30-PRIMARY-INST TO RPSEC-ALT-INST.                 02933000
029340     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPSEC-ALT-ACCOUNT.          02934000
029350     PERFORM RPS-SEC-GET-GE-REQUEST.                              02935000
029360     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02936000
029370         GO TO FPC-NO-SEC-RECORD.                                 02937000
029380     MOVE RPSEC-GRP-AIX1 TO WS-SAVESECGRPAIX1.                    02938000
029390 FPC-READ-NEXT.                                                   02939000
029400     PERFORM RPS-SEC-GET-NEXT-REQUEST.                            02940000
029410     IF WS-FUNCTION IS EQUAL TO 'N'                               02941000
029420         OR WS-FUNCTION IS EQUAL TO 'E'                           02942000
029430         MOVE WS-SAVSECAPRODCODE TO RPXXX30-PRIMARY-PROD-CODE     02943000
029440         GO TO FPC-EXIT.                                          02944000
029450     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02945000
029460         MOVE 'Y' TO WS-ERRORPRODCODE                             02946000
029470         MOVE WS-AB6335 TO RPXXX30-ABORT                          02947000
029480         MOVE WS-AB6335 TO RPXXX30-RESP-ABORT                     02948000
029490         MOVE WS-TR0005 TO RPXXX30-ABTRACE                        02949000
029500         MOVE WS-TR0005 TO RPXXX30-RESP-TRACE                     02950000
029510         GO TO FPC-EXIT.                                          02951000
029520     IF RPSEC-ALT-INST IS EQUAL TO WS-SAVSECAINST                 02952000
029530         AND RPSEC-ALT-ACCOUNT IS EQUAL TO WS-SAVSECAACCOUNT      02953000
029540         MOVE 'Y' TO WS-ERRORPRODCODE                             02954000
029550         MOVE 500001 TO RPXXX30-RESP-MSG-NBR                      02955000
029560         MOVE 500001 TO RPXXX30-MSGNBR                            02956000
029570         GO TO FPC-EXIT.                                          02957000
029580     MOVE WS-SAVSECAPRODCODE TO RPXXX30-PRIMARY-PROD-CODE.        02958000
029590     GO TO FPC-EXIT.                                              02959000
029600 FPC-NO-SEC-RECORD.                                               02960000
029610     MOVE 'Y' TO WS-ERRORPRODCODE.                                02961000
029620     MOVE 500004 TO RPXXX30-RESP-MSG-NBR.                         02962000
029630     MOVE 500004 TO RPXXX30-MSGNBR.                               02963000
029640     GO TO FPC-EXIT.                                              02964000
029650 FPC-EXIT.                                                        02965000
029660     EXIT.                                                        02966000
029670******************************************************************02967000
029680 FIND-DEFAULT-MODEL SECTION.                                      02968000
029690 FDM-START.                                                       02969000
029700     MOVE 'N' TO WS-ERRORMODEL.                                   02970000
029710     MOVE RPXXX30-PRIMARY-INST TO RPMST-INST.                     02971000
029720     MOVE RPXXX30-PRIMARY-PROD-CODE TO RPMST-PRODCODE.            02972000
029730     MOVE RPXXX30-PRIMARY-ACCT-NBR TO RPMST-ACCOUNT.              02973000
029740     MOVE RPXXX30-PRIMARY-MODEL TO RPMST-MODEL.                   02974000
029750     PERFORM RPS-MST-GET-GE-REQUEST.                              02975000
029760     IF WS-FUNCTION IS EQUAL TO 'N'                               02976000
029770         GO TO FDM-500BAD.                                        02977000
029780     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         02978000
029790         MOVE WS-AB6320 TO RPXXX30-ABORT                          02979000
029800         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     02980000
029810         MOVE WS-TR0006 TO RPXXX30-ABTRACE                        02981000
029820         MOVE WS-TR0006 TO RPXXX30-RESP-TRACE                     02982000
029830         GO TO VK-RETURN.                                         02983000
029840* USE THIS IS THERE IS ONLY ONE                                   02984000
029850     IF RPMST-INST IS EQUAL TO RPXXX30-PRIMARY-INST               02985000
029860         AND RPMST-PRODCODE IS EQUAL TO RPXXX30-PRIMARY-PROD-CODE 02986000
029870         AND RPMST-ACCOUNT IS EQUAL TO RPXXX30-PRIMARY-ACCT-NBR   02987000
029880         GO TO FDM-200.                                           02988000
029890* IF THE FOUND RECORD DOES NOT MATCH SEND MESSAGE                 02989000
029900     GO TO FDM-500BAD.                                            02990000
029910 FDM-200.                                                         02991000
029920     MOVE RPMST-MODEL TO RPXXX30-PRIMARY-MODEL.                   02992000
029930     MOVE RPXXX30-PRIMARY-INST TO WS-SAVEMSTINST.                 02993000
029940     MOVE RPXXX30-PRIMARY-PROD-CODE TO WS-SAVEMSTPRODCODE.        02994000
029950     MOVE RPXXX30-PRIMARY-ACCT-NBR TO WS-SAVEMSTACCOUNT.          02995000
029960     MOVE RPXXX30-PRIMARY-MODEL TO WS-SAVEMSTMODEL.               02996000
029970     PERFORM RPS-MST-GET-NEXT-REQUEST.                            02997000
029980     IF WS-FUNCTION IS EQUAL TO 'E'                               02998000
029990         GO TO FDM-500GOOD.                                       02999000
030000     IF WS-FUNCTION IS NOT EQUAL TO SPACE                         03000000
030010         MOVE WS-AB6320 TO RPXXX30-ABORT                          03001000
030020         MOVE WS-AB6320 TO RPXXX30-RESP-ABORT                     03002000
030030         MOVE WS-TR0007 TO RPXXX30-ABTRACE                        03003000
030040         MOVE WS-TR0007 TO RPXXX30-RESP-TRACE                     03004000
030050         GO TO VK-RETURN.                                         03005000
030060     IF RPMST-INST IS EQUAL TO RPXXX30-PRIMARY-INST               03006000
030070         AND RPMST-PRODCODE IS EQUAL TO RPXXX30-PRIMARY-PROD-CODE 03007000
030080         AND RPMST-ACCOUNT IS EQUAL TO RPXXX30-PRIMARY-ACCT-NBR   03008000
030090         GO TO FDM-500MULTIPLE.                                   03009000
030100 FDM-500GOOD.                                                     03010000
030110     MOVE WS-SAVEMSTINST TO                                       03011000
030120         RPXXX30-PRIMARY-INST.                                    03012000
030130     MOVE WS-SAVEMSTPRODCODE TO                                   03013000
030140         RPXXX30-PRIMARY-PROD-CODE.                               03014000
030150     MOVE WS-SAVEMSTACCOUNT TO                                    03015000
030160         RPXXX30-PRIMARY-ACCT-NBR.                                03016000
030170     MOVE WS-SAVEMSTMODEL TO                                      03017000
030180         RPXXX30-PRIMARY-MODEL.                                   03018000
030190     GO TO FDM-EXIT.                                              03019000
030200 FDM-500BAD.                                                      03020000
030210     MOVE 'Y' TO WS-ERRORMODEL.                                   03021000
030220     MOVE 500004 TO RPXXX30-RESP-MSG-NBR.                         03022000
030230     MOVE 500004 TO RPXXX30-MSGNBR.                               03023000
030240     GO TO FDM-EXIT.                                              03024000
030250 FDM-500MULTIPLE.                                                 03025000
030260     MOVE 'Y' TO WS-ERRORMODEL.                                   03026000
030270     MOVE 500090 TO RPXXX30-RESP-MSG-NBR.                         03027000
030280     MOVE 500090 TO RPXXX30-MSGNBR.                               03028000
030290     GO TO FDM-EXIT.                                              03029000
030300 FDM-EXIT.                                                        03030000
030310     EXIT.                                                        03031000
030320******************************************************************03032000
030330 GET-BALANCE SECTION.                                             03033000
030340 GB-START.                                                        03034000
030350     MOVE ZEROS TO WS-WORK-BALANCE.                               03035000
030360     IF WS-WORK-COMBBALCD IS EQUAL TO ZEROS                       03036000
030370         OR WS-WORK-COMBBALCD IS GREATER THAN 20                  03037000
030380         GO TO GB-EXIT.                                           03038000
030390     MOVE RPINF00-BAL (WS-WORK-COMBBALCD) TO WS-WORK-BALANCE.     03039000
030400 GB-EXIT.                                                         03040000
030410     EXIT.                                                        03041000
P0024 ******************************************************************03041200
P0024  CROSS-INSTITUTION SECTION.                                       03041400
000000 COPY RPP004.                                                     03041600
030420******************************************************************03042000
030430 VALIDATE-BRANCH SECTION.                                         03043000
000000 COPY RPP7107B.                                                   03044000
P0109 ******************************************************************03044200
P0109  VALIDATE-PRIM-RELCD SECTION.                                     03044400
000000 COPY RPP006.                                                     03044600
030450******************************************************************03045000
030460***** CONTAINS PROCEDURE COPYBOOKS FOR LOADING/SEARCH MICM REC ***03046000
030470******************************************************************03047000
030480 LOAD-RPS-2001 SECTION.                                           03048000
000000 COPY RPP2001A.                                                   03049000
030500******************************************************************03050000
030510 LOAD-RPS-2023 SECTION.                                           03051000
000000 COPY RPP2023A.                                                   03052000
030530******************************************************************03053000
030540 LOAD-RPS-7101 SECTION.                                           03054000
000000 COPY RPP7101A.                                                   03055000
030560******************************************************************03056000
030570 LOAD-RPS-7102 SECTION.                                           03057000
000000 COPY RPP7102A.                                                   03058000
030590******************************************************************03059000
030600 LOAD-RPS-7104 SECTION.                                           03060000
000000 COPY RPP7104A.                                                   03061000
030620******************************************************************03062000
030630 LOAD-RPS-7105 SECTION.                                           03063000
000000 COPY RPP7105A.                                                   03064000
030650******************************************************************03065000
030660 LOAD-RPS-7106 SECTION.                                           03066000
000000 COPY RPP7106A.                                                   03067000
030680******************************************************************03068000
030690 LOAD-RPS-7107 SECTION.                                           03069000
000000 COPY RPP7107.                                                    03070000
030710******************************************************************03071000
030720 LOAD-RPS-7110 SECTION.                                           03072000
000000 COPY RPP7110.                                                    03073000
030740******************************************************************03074000
030750 SEARCH-RPS-2001 SECTION.                                         03075000
000000 COPY RPP2001S.                                                   03076000
030770******************************************************************03077000
030780 SEARCH-RPS-2023 SECTION.                                         03078000
000000 COPY RPP2023S.                                                   03079000
030800******************************************************************03080000
030810 SEARCH-RPS-7101 SECTION.                                         03081000
000000 COPY RPP7101S.                                                   03082000
030830******************************************************************03083000
030840 SEARCH-RPS-7102 SECTION.                                         03084000
000000 COPY RPP7102S.                                                   03085000
030860******************************************************************03086000
030870 SEARCH-RPS-7104 SECTION.                                         03087000
000000 COPY RPP7104S.                                                   03088000
030890******************************************************************03089000
030900 SEARCH-RPS-7105 SECTION.                                         03090000
000000 COPY RPP7105S.                                                   03091000
030920******************************************************************03092000
030930 SEARCH-RPS-7106 SECTION.                                         03093000
000000 COPY RPP7106S.                                                   03094000
030950******************************************************************03095000
030960 SEARCH-RPS-7107 SECTION.                                         03096000
000000 COPY RPP7107S.                                                   03097000
030980******************************************************************03098000
030990 SEARCH-RPS-7110 SECTION.                                         03099000
000000 COPY RPP7110S.                                                   03100000
031010******************************************************************03101000
000000 COPY RPPACTA.                                                    03102000
031030******************************************************************03103000
000000 COPY RPPBNKA.                                                    03104000
031050******************************************************************03105000
000000 COPY RPPMSTA.                                                    03106000
031070******************************************************************03107000
000000 COPY RPPSECA.                                                    03108000
031090******************************************************************03109000
031100 MIC-MST-API SECTION.                                             03110000
000000 COPY MIPMSTA.                                                    03111000
031120******************************************************************03112000
031130 SLP096-GET-2023-RECORD SECTION.                                  03113000
000000 COPY SLP096.                                                     03114000
031150******************************************************************03115000
031160 JULIAN-365 SECTION.                                              03116000
000000 COPY SRP001.                                                     03117000
031180******************************************************************03118000
031190 CALENDAR-365 SECTION.                                            03119000
000000 COPY SRP003.                                                     03120000
031210******************************************************************03121000
031220 NEXT-DATE-365 SECTION.                                           03122000
000000 COPY SRP009.                                                     03123000
031240******************************************************************03124000
031250 CICS-ABORT-EXIT SECTION.                                         03125000
031260 CAE-START.                                                       03126000
031270     GO TO CICS-RETURN.                                           03127000
031280 CAE-EXIT.                                                        03128000
031290     EXIT.                                                        03129000
031300******************************************************************03130000
031310 CICS-RETURN SECTION.                                             03131000
031320     IF COM-ABORT IS NOT EQUAL TO ZERO                            03132000
031330         MOVE COM-ABORT TO RPXXX30-ABORT.                         03133000
031340     IF RPXXX30-ABORT IS NOT EQUAL TO ZERO                        03134000
031350         MOVE WS-QUALIFYPROGID TO RPXXX30-RESP-PROGRAM            03135000
031360         MOVE WS-FUNCTION TO RPXXX30-FUNCTION                     03136000
031370         MOVE SRB-BMDB TO RPXXX30-SRBMDB                          03137000
031380         MOVE EIBFN TO RPXXX30-ABEIBFN                            03138000
031390         MOVE EIBRESP TO RPXXX30-ABEIBRESP                        03139000
031400         MOVE EIBRESP2 TO RPXXX30-ABEIBRESP2                      03140000
031410         MOVE EIBRCODE TO RPXXX30-ABEIBRCODE.                     03141000
031420     IF RPXXX30-RESP-MSG-NBR IS NOT EQUAL TO ZERO                 03142000
031430         AND RPXXX30-RESP-PROGRAM IS NOT EQUAL TO SPACES          03143000
031440         MOVE WS-QUALIFYPROGID TO RPXXX30-RESP-PROGRAM.           03144000
000000 COPY SLP709.                                                     03147000
031550******************************************************************03155000
