//*---------------------------------------------------------------------       
//HELLO   PROC
//*---------------------------------------------------------------------     
//STEP0001 EXEC PGM=IEBGENER
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=&DSOUT
//SYSUT1   DD *
HELLO, WORLD
/*
//SYSUT2   DD SYSOUT=&DSOUT   
//*---------------------------------------------------------------------        
// PEND                                                                         
//*---------------------------------------------------------------------        