//UTP23801 PROC                                                                 
//UTP23810 EXEC PGM=IKJEFT01,DYNAMNBR=20                                        
//*                                                                             
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD SUBSYS=(CCSS,                                                     
//            '   DSN SYSTEM(&SYSTEM)    ',                                     
//            '   RUN PROG(&PROGRAM) -   ',                                     
//            '   PLAN (&PLAN)           ')                                     
//*---------------------------------------------------------------------        
//ENDPROC PEND                                                                  
