//UTPCF241 PROC                                                                 
//*---------------------------------------------------------------------        
//*   NON-PRIMARY SERVER: NODE=PRUFTTST                                         
//*---------------------------------------------------------------------        
//CHKFILE1 EXEC PGM=XX091                                                       
//SYSIN    DD SUBSYS=(CCSS,                                                     
//            '&HIGHQUAL..WBQ.UTP24101.&FIRMID..ACT.D&CYCLE.')                  
//*---------------------------------------------------------------------        
// IF (CHKFILE1.RC EQ 0) THEN                                                   
//*---------------------------------------------------------------------       
//XX079003 EXEC PGM=XX079,COND=(0,EQ,SEND1.CYBERF)                              
//*---------------------------------------------------------------------             
// ELSE                                                                         
//*---------------------------------------------------------------------        
// ENDIF                                                                        
//ENDPROC PEND                                                                  
