         MACRO
         API0AP &REG=,&SUFFIX=
         GBLB  &BG1,&API0AP
         GBLC  &CG14
         LCLC  &CG1
         AIF   ('&SUFFIX' NE '').GO
         MEND