 Package_Demo: Package exports (*);
 dcl N fixed bin(15);
 PROC1: proc options (main);
  dcl Result fixed bin(31);
 end PROC1;
  NESTED_PROC: PROC;
   PUT SKIP LIST('INSIDE LABEL4');
  END NESTED_PROC;
 end Package_Demo;