000100 IDENTIFICATION DIVISION.                                         IC2284.2
000200 PROGRAM-ID.                                                      IC2284.2
000300     IC228A.                                                      IC2284.2
038900 IDENTIFICATION DIVISION.                                         IC2284.2
039000 PROGRAM-ID.                                                      IC2284.2
039100     IC228A-1.                                                    IC2284.2
044400 END PROGRAM IC228A-1.                                            IC2284.2
044500 END PROGRAM IC228A.                                              IC2284.2
