000550 01 REPORT-RECORD-OUT-MGO.
000570    05 RPT-MGO-PRESSURE-CODE      PIC  X(04).
000580    05 FILLER                     PIC  X(02) VALUE SPACES.
