//MGOJOB1 JOB ,XXXXX,CLASS=J                                            00001**2    
//***************************************************************       00068   
//STEP050 EXEC MGOPROC1                                             
//*   
