//TESTJOB1 JOB (VS02000,NSNS),'SUPPLY CHAIN',REGION=4096K,              00001009
//       MSGCLASS=T,USER=VSPRCTL,CLASS=V,TIME=10                        00002004
//STEP1    EXEC VSNATBAQ                                                00134009
//CMPRINT  DD SYSOUT=*                                                  00135004
//SYSIN    DD  *                                                        00139403
LOGON LIB                                                               00139503
MAIN7                                                                   00139606
FIN                                                                     00139703
/*                                                                      00139803
//                                                                      00150004
