 PROGRAM: PROCEDURE OPTIONS(MAIN);

  DCL
   1 SQLCA  ,
     2 SQLCAID     CHAR(8),
     2 SQLCABC     FIXED BIN(31),
     2 SQLCODE     FIXED BIN(31),
     2 SQLERRM     CHAR(70) VAR,
     2 SQLERRP     CHAR(8),
     2 SQLERRD(6)  FIXED BIN(31),
     2 SQLWARN,
       3 SQLWARN0  CHAR(1),
       3 SQLWARN1  CHAR(1),
       3 SQLWARN2  CHAR(1),
       3 SQLWARN3  CHAR(1),
       3 SQLWARN4  CHAR(1),
       3 SQLWARN5  CHAR(1),
       3 SQLWARN6  CHAR(1),
       3 SQLWARN7  CHAR(1),
     2 SQLEXT,
       3 SQLWARN8  CHAR(1),
       3 SQLWARN9  CHAR(1),
       3 SQLWARNA  CHAR(1),
       3 SQLSTATE  CHAR(5);

    DCL C8T CHAR(8) INIT('12.30.15');
    DCL C10D CHAR(10) INIT('2021-06-01');
    DCL C26TS CHAR(26) INIT('2021-06-01-02.03.01.528849');
    
    EXEC SQL CONNECT TO DALLASC;
 
    put skip list('original values');
    put skip list('C8T', C8T);
    put skip list('C10D', C10D);
    put skip list('C26TS', C26TS);


    EXEC SQL DROP TABLE IW_ME11853_F;
    EXEC SQL CREATE TABLE IW_ME11853_F (
        "C8T" TIME,
        "C10D" DATE,
        "C26TS" TIMESTAMP
    )
    DATA CAPTURE NONE
    COMPRESS NO;
    
    EXEC SQL INSERT INTO IW_ME11853_F ("C8T",
                                       "C10D",
                                       "C26TS")
                     VALUES (:C8T, :C10D, :C26TS);

    C8T = '-';
    C10D = '-';
    C26TS = '-';
    
    EXEC SQL SELECT "C8T", "C10D", "C26TS"
             INTO :C8T, :C10D, :C26TS
             FROM IW_ME11853_F;
    
    put skip list('db values');
    put skip list('C8T', C8T);
    put skip list('C10D', C10D);
    put skip list('C26TS', C26TS);

    EXEC SQL DELETE FROM IW_ME11853_F;
    EXEC SQL DROP TABLE IW_ME11853_F;
    
    EXEC SQL COMMIT;
    
 END PROGRAM;
