       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTCALL.

       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01  CALL-VAR               PIC X(08)       VALUE " ".
       01  MODULE-NAME            PIC X(06)       VALUE "FOOBAR".

       PROCEDURE DIVISION.
           MOVE MODULE-NAME TO CALL-VAR
           CALL CALL-VAR.

           GOBACK.
