//MGOPROC2 PROC                                                                 
//*                                                                             
//******************************************************************            
//* PROCNAME:    MGOPROC2
//*              EXEC COBOL WITH FILE ACCESS                                                                
//******************************************************************            
//*                            
//PRCSTP11  EXEC PGM=MGOPRGM3        
//SYSOUT   DD  SYSOUT=*          
//SYSUDUMP DD  SYSOUT=W          
//MGOFILE5 DD  DSN=MGO.TEST.FILE.FIVE,     
//             DISP=(OLD,DELETE)         
//MGOFILE6 DD  DSN=MGO.TEST.FILE.SIX,     
//             DISP=SHR                                                               
//*                            
//PRCSTP12  EXEC PGM=MGOPRGM4        
//SYSOUT   DD  SYSOUT=*          
//SYSUDUMP DD  SYSOUT=W          
//MGOFILE7 DD  DSN=MGO.TEST.FILE.SEVEN,     
//             DISP=(OLD,DELETE)         
//MGOFILE8 DD  DSN=MGO.TEST.FILE.EIGHT,     
//             DISP=SHR        