DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
	1 #I (I2)
	1 EMPLOY_3107_VIEW VIEW OF EMPLOY_3107
		2 SALARY(1) /* P9
END-DEFINE

INCLUDE Z1069--C
FORMAT (1) PS=0

WRITE (1) NOTITLE NOHDR 'Test FIND & UPDATE with ESCAPE BOTTOM if no records are found'
WRITE (1) NOTITLE NOHDR 'Starting FIND...'
FIND (1) EMPLOY_3107_VIEW WITH DEPT-PERSON = '_XXXXXX'
	IF NO RECORDS FOUND
		WRITE (1) NOTITLE NOHDR 'Nothing found'
		ESCAPE BOTTOM
	END-NOREC

	EMPLOY_3107_VIEW.SALARY(1) := EMPLOY_3107_VIEW.SALARY(1) + 250
	UPDATE
	END TRANSACTION
END-FIND

WRITE (1) NOTITLE NOHDR '... end FIND'

END