//WMIN3087  JOB INNOWAK,'INNOWAK',MSGLEVEL=(1,1),REGION=0M,
//             CLASS=A,TIME=1,NOTIFY=&SYSUID,LINES=(1,CANCEL)
//*
//*
//* THIS TESTS THE NEW DISP
//STEP001  EXEC PGM=SORT,COND=(0,LT)
//SYSOUT       DD SYSOUT=*
//SYSPRINT     DD SYSOUT=*
//SYSABOUT     DD SYSOUT=*
//SYSDBOUT     DD SYSOUT=*
//SORTIN   DD *
//*
//SORTOUT  DD DSN=TESTNEW,
//         UNIT=SYSDA,
//         DISP=(NEW,PASS),
//         SPACE=(TRK,(500,200),RLSE),
//         DCB=(LRECL=222,BLKSIZE=0,RECFM=FB)
//*
//SYSIN   DD *
//*
//*
//* THIS TESTS THE OLD DISP
//STEP002  EXEC PGM=SORT,COND=(0,LT)
//SYSOUT       DD SYSOUT=*
//SYSPRINT     DD SYSOUT=*
//SYSABOUT     DD SYSOUT=*
//SYSDBOUT     DD SYSOUT=*
//SORTIN   DD DSN=SORTSHR,
//         DISP=SHR
//*
//SORTOUT  DD DSN=TESTOLD,
//         UNIT=SYSDA,
//         DISP=(OLD,CATLG,DELETE),
//         SPACE=(TRK,(500,200),RLSE),
//         DCB=(LRECL=222,BLKSIZE=0,RECFM=FB)
//*
//SYSIN   DD *
//*
//*
//* THIS TESTS THE MOD DISP
//STEP003  EXEC PGM=SORT,COND=(0,LT)
//SYSOUT       DD SYSOUT=*
//SYSPRINT     DD SYSOUT=*
//SYSABOUT     DD SYSOUT=*
//SYSDBOUT     DD SYSOUT=*
//SORTIN   DD DSN=SORTSHR,
//         DISP=SHR
//*
//SORTOUT  DD DSN=TESTMOD,
//         UNIT=SYSDA,
//         DISP=(MOD,CATLG,DELETE),
//         SPACE=(TRK,(500,200),RLSE),
//         DCB=(LRECL=222,BLKSIZE=0,RECFM=FB)
//*
//SYSIN   DD *
//*
//*
//* THIS TESTS THE SHR DISP
//STEP003  EXEC PGM=SORT,COND=(0,LT)
//SYSOUT       DD SYSOUT=*
//SYSPRINT     DD SYSOUT=*
//SYSABOUT     DD SYSOUT=*
//SYSDBOUT     DD SYSOUT=*
//SORTIN   DD DSN=SORTSHR,
//         DISP=SHR
//*
//SORTOUT  DD DSN=TESTSHR,
//         UNIT=SYSDA,
//         DISP=(SHR,CATLG,DELETE),
//         SPACE=(TRK,(500,200),RLSE),
//         DCB=(LRECL=222,BLKSIZE=0,RECFM=FB)
//*
//SYSIN   DD *
//*
//*
//* THIS TESTS THE default DISP
//STEP004  EXEC PGM=SORT,COND=(0,LT)
//SYSOUT       DD SYSOUT=*
//SYSPRINT     DD SYSOUT=*
//SYSABOUT     DD SYSOUT=*
//SYSDBOUT     DD SYSOUT=*
//SORTIN   DD DSN=TESTDEF1
//*
//SORTOUT  DD DSN=TESTDEF2,
//         UNIT=SYSDA,
//         DISP=(,KEEP,),
//         SPACE=(TRK,(500,200),RLSE),
//         DCB=(LRECL=222,BLKSIZE=0,RECFM=FB)
//*
//SYSIN   DD *
//*