000010 IDENTIFICATION DIVISION.                                         03/17/86
000020     SKIP1                                                        DQCQU54C
000030 PROGRAM-ID.     %%PGMID.                                            LV005
000040 AUTHOR.         NORMAN DE BENEDETTI.
000050 INSTALLATION.   CN  TRAFFIC INFORMATION SYSTEMS.
000060 DATE-WRITTEN.   APRIL 21, 1982.
000070 DATE-COMPILED.
000080     SKIP1
000360 ENVIRONMENT DIVISION.
000370     SKIP2
000380 CONFIGURATION SECTION.
000390     SKIP1
000400 SOURCE-COMPUTER.    AMDAHL-470-V8.
000410 OBJECT-COMPUTER.    AMDAHL-470-V8.
000420     SKIP3
000430 DATA DIVISION.
000440     SKIP2
000450 WORKING-STORAGE SECTION.
000460     SKIP1
001710     EXEC CICS RECEIVE MAP('MAP4')
001720                       MAPSET('DQBQU54')
001730                       END-EXEC.
001740     GOBACK.
001750     EJECT
001760 100-INVALID-KEY.
001770     SKIP1
001780     PERFORM 120-SETMDT THRU 120-EXIT
001790             VARYING FILE-INDEX FROM 1 BY 1
001800             UNTIL FILE-INDEX IS EQUAL TO 69.
001810     MOVE -1 TO M4OPT1L.
001820     MOVE '***INVALID KEY PRESSED***' TO M4MSGO.
001830     SKIP3
001840 110-SEND-MAP.
001850     SKIP1
001860     EXEC CICS SEND MAP('MAP4')
001870                    MAPSET('DQBQU54')
001880                    DATAONLY
001890                    CURSOR
001900                    FREEKB
001910                    END-EXEC.
001920     MOVE HIGH-VALUE TO QU32-OPTION1.
001930     EXEC CICS RETURN TRANSID('QU54') COMMAREA(QU32-PARMS)
001940                      LENGTH(212) END-EXEC.
001950     SKIP3
003200 620-SEND-ERASE.
003210     SKIP1
003220     MOVE HIGH-VALUE TO QU32-OPTION1.
003230     EXEC CICS SEND MAP('MAP4') MAPSET('DQBQU54') ERASE
003240                    FREEKB END-EXEC.
003250     EXEC CICS RETURN TRANSID('QU54') COMMAREA(QU32-PARMS)
003260                      LENGTH(212) END-EXEC.
003270     SKIP3
