 WMIN3020_DoUntil2: proc options(main);
    do until (a > b );
      C = D;
      do until (condition2 );
        D = E;
      END;
    END;
 end WMIN3020_DoUntil2;
