DEFINE DATA
LOCAL
01 #PROG1 (A8) INIT <'NIIGCMD'>
01 #PROG2 (A8) INIT <'ASMA90'>
END-DEFINE

CALLNAT 'NIIEMOD'
CALLNAT FTP
CALLNAT ZZZ
CALLNAT #PROG1

INCLUDE 'AIS100'
INCLUDE FTP2
INCLUDE ZZZ2
INCLUDE #PROG2

END