LIST OFF                                                                00000150
PARM LINK(DECSZ027 R)                                                   00000151
*                                                                       00000160
FILE DATEFL                                                             00000170
 DF-DATE       1  10 A                                                  00000180
*                                                                       00000190
DT-LONG         W     10  A                                             00000191
 DT-MM    DT-LONG      2  N                                             00000192
 DT-DD    DT-LONG  +3  2  N                                             00000193
 DT-CCYY  DT-LONG  +6  4  N                                             00000194
DT-LONG-N       W      8  N                                             00000195
 DTN-MM    DT-LONG-N    2 A                                             00000196
 DTN-DD    DT-LONG-N +2 2 N                                             00000197
 DTN-CCYY  DT-LONG-N +4 4 N                                             00000198
*                                                                       00000199
WHATDAY               W   9   A                                         00000200
**                                                                      00000210
************************************************************************00000220
*****  PROCESSING  ACTIVITIES                                           00000230
************************************************************************00000240
JOB INPUT NULL                                                          00000250
*                                                                       00000260
DT-LONG = SYSDATE-LONG                                                  00000270
DISPLAY SYSDATE-LONG                                                    00000280
  DTN-CCYY = DT-CCYY                                                    00000290
  DTN-MM   = DT-MM                                                      00000291
  DTN-DD   = DT-DD                                                      00000292
  DISPLAY 'DT-LONG-N ' DT-LONG-N                                        00000293
  *                                                                     00000294
  %WEEKDAY DT-LONG-N MMDDCCYY WHATDAY                                   00000295
  *                                                                     00000296
  IF WHATDAY = 'MONDAY'                                                 00000297
      RETURN-CODE = 111                                                 00000298
  ELSE-IF WHATDAY = 'TUESDAY'                                           00000299
          RETURN-CODE = 222                                             00000300
      ELSE-IF WHATDAY = 'WEDNESDAY'                                     00000310
               RETURN-CODE = 333                                        00000320
           ELSE-IF WHATDAY = 'THURSDAY'                                 00000330
                    RETURN-CODE = 444                                   00000340
                ELSE-IF WHATDAY = 'FRIDAY'                              00000350
                         RETURN-CODE = 555                              00000360
                     ELSE-IF WHATDAY = 'SATURDAY'                       00000370
                              RETURN-CODE = 666                         00000380
                         ELSE-IF WHATDAY = 'SUNDAY'                     00000381
                                  RETURN-CODE = 777                     00000382
                              ELSE                                      00000390
                                  DISPLAY 'INVALID DATE'                00000391
                                  STOP                                  00000392
  END-IF                                                                00000393
  *                                                                     00000394
  DISPLAY +2 'DAY OF THE WEEK IS ' WHATDAY ' RETURN CODE ' RETURN-CODE  00000395
*                                                                       00000396
  STOP                                                                  00000397
