//TESTJOBA JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A
//STEP01   EXEC TESTPRC
//SYSIN DD *
 LOGON LIBB
 MAIN6
 FIN
//*
