       IDENTIFICATION  DIVISION.
       PROGRAM-ID.     MEE6705A.

       DATA            DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.

       PROCEDURE DIVISION.
           EXEC SQL INCLUDE FMA065
           END-EXEC.
       END PROGRAM MEE6705A.

