       IDENTIFICATION DIVISION.
       PROGRAM-ID. FNE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       
       WORKING-STORAGE SECTION.
       
001770 01  WS_FETCH_FIELDS.
001820     05    WS_TIER_COMBN_SUID        PIC 9(10).
001860     05    WS_LMT_SET_SEQ_NBR        PIC    9(05).
001870     05    WS_LMT_SET_EFF_DT        PIC S9(11)V9(07) COMP.
      
       PROCEDURE DIVISION.
      
012170     EXEC SQL
012180     SELECT    BEN142_LMT_SET_SEQ_NBR,
012190         BEN142_LMT_SET_EFF_DT
012200       INTO    :WS_LMT_SET_SEQ_NBR,
012210         :WS_LMT_SET_EFF_DT
012220       FROM    BENDB1.BEN142_TIER_COMBINATION_LMT_SET
012230      WHERE    BEN142_TIER_COMBN_SUID    =   :WS_TIER_COMBN_SUID
012240         AND    BEN142_EXPRN_DT    IS  NULL
012250      LIMIT TO 1 ROW
012260     END-EXEC.
012170     EXEC SQL
012180     SELECT    a,
012190         b
012200       INTO    :c,
012210         :d
012220       FROM    BENDB1.e
012230      WHERE    f    =   :g
012240         AND    q    IS  NULL
012250      lImIt TO 12 ROWs
012260     END-EXEC.
012170     EXEC SQL
000000       DECLARE BEN172_CURSOR READ ONLY TABLE CURSOR FOR
000000        SELECT BEN172_BAQ_CODE,
000000        BEN172_BAQ_PARAM
000000        FROM BENDB1.BEN172_COVERAGE_CODE_BAQ
000000        WHERE BEN172_CVRG_CD = :BENI103_CVRG_CD
012260     END-EXEC.
      
           GOBACK.
