 PGM4030A: PROCEDURE (IO_PCB_PTR, DB_PCB_PTR) OPTIONS(MAIN);

   DCL IO_PCB_PTR POINTER;
   DCL DB_PCB_PTR POINTER;
   DCL DET_SEG_IO_AREA CHAR(100);
   DCL 1    DB_PCB_MAST          BASED (DB_PCB_PTR),
         2   MAST_DB_NAME     CHAR(8),
         2   MAST_SEG_LEVEL   CHAR(2),
         2   MAST_STAT_CODE   CHAR(2),
         2   MAST_PROC_OPT    CHAR(4),
         2   FILLER           FIXED BINARY (31,0),
         2   MAST_SEG_NAME    CHAR(8),
         2   MAST_LEN_KFB     FIXED BINARY (31,0),
         2   MAST_NO_SENSEG   FIXED BINARY (31,0),
         2   MAST_KEY_FB      CHAR(*);
   
   CALL PLITDLI (3, 'GU', DB_PCB_PTR, DET_SEG_IO_AREA);
   CALL PLITDLI (3, 'GU', DB_PCB_MAST, DET_SEG_IO_AREA);

 END PGM4030A;