 P9UIS14: PROC    (UIS14PAR_PTR, SFR_PTR)
          OPTIONS (REENTRANT);

 %INCLUDE IRPI;
 /********************************************************************/
 /* FETCH_CURSOR C14                                                 */
 /********************************************************************/
 FCH_C14: PROC;

   IF Z_MAPPING_ARGUMENT = ''
   THEN DO;
     EXEC SQL FETCH C141 INTO
       $FETCH_COLUMNS
     ;
     $SFRDB2('FETCH_C141',WARN,0,100);
   END;
   ELSE DO;
     EXEC SQL FETCH C142 INTO
       $FETCH_COLUMNS
     ;
     $SFRDB2('FETCH_C142',WARN,0,100);
   END;

   SELECT(SQLCODE);
     WHEN (0)   CALL COPY_TO_PAR;
     WHEN (100) CALL BS_FEHLER('04',18
                               ,'KEINE WEITEREN DATEN VORHANDEN','');
     OTHER;
   END;

 END FCH_C14;
 END P9UIS14;