       IDENTIFICATION DIVISION.
       PROGRAM-ID. WC47PGM9.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
        01 DUMMY3 PIC X(4).

       PROCEDURE DIVISION USING DUMMY3.

         CALL "TEST42d" USING DUMMY3.

       END PROGRAM WC47PGM9.
