       IDENTIFICATION DIVISION.
       PROGRAM-ID. WC47CLLT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
        01 DUMMY5 PIC X(4).

       PROCEDURE DIVISION USING DUMMY5.

         DISPLAY DUMMY5.

       END PROGRAM WC47CLLT.
