 PL1PROG: PROCEDURE OPTIONS(MAIN); 
  DCL EXTPRC12 ENTRY(CHAR(10), FIXED BINARY(31)) EXTERNAL;
  DCL FIELD_1 CHAR(10);
  DCL FIELD_2 FIXED BINARY(31);
  
  PUT SKIP LIST('BEFORE CALL');
  FIELD_1 = 'ABC';
  FIELD_2 = 123;
  CALL EXTPRC1(FIELD_1, FIELD_2);
  PUT SKIP LIST('AFTER CALL');
  PUT SKIP LIST(FIELD_1);
  PUT SKIP LIST(FIELD_2);
 END PL1PROG;