      IDENTIFICATION DIVISION.                                         00002002
      PROGRAM-ID.   XXXXXXXX.                                          00003002
      ENVIRONMENT DIVISION.                                            00210002
      DATA DIVISION.                                                   00220002
      WORKING-STORAGE SECTION.                                         00240002
      PROCEDURE DIVISION.                                              00620002
      COMPUTE NXSUB = SUB1 + 1                                         02873110
      DISPLAY 'hello'.                                                 02878012
      END PROGRAM XXXXXXXX.                                            02878412