DEFINE DATA
LOCAL
1 #FLD (A10)
1 #CURSOR (I4)
END-DEFINE

DISPLAY 'THIS GOES TO UI'
DISPLAY (0) 'THIS GOES TO UI'
DISPLAY (1) 'THIS DOES NOT GO TO UI'

END
