         PCB       TYPE=DB,DBDNAME=INDB1,KEYLEN=20,PROCOPT=A
         SENSEG    NAME=SEGONE
         SENSEG    NAME=SEGTWO,PARENT=SEGONE
         SENSEG    NAME=SEGTHR,PARENT=SEGONE
         PSBGEN    PSBNAME=INRUN1,LANG=COBOL
         END