//TESTJOBA JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A
//STEP01   EXEC PGM=NAT
//STEPLIB  DD DSN=MMRS00C.A.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//CMWKF01  DD DSN=WRK.B.ONE,DISP=(OLD,DELETE)
//CMWRK02  DD DSN=CONCAT.WRK.ONE,DISP=(OLD,DELETE)
//         DD DSN=CONCAT.WRK.TWO,DISP=(OLD,DELETE)
//SYSIN DD *
 LOGON B
 WKFD
 FIN
//*