//**********************************************************                    
//* THIS PROC WAS CREATED AND IS EXECUTED FROM JOB  Z38ZG235                    
//**********************************************************                    
//WMIN1669A PROC INIT='T',SYSOUT='(,)'                                           
//*                                                                             
//PS01     EXEC PGM=IDCAMS,TIME=30                                              
//**********************************************************************        
//*                                                                    *        
//*  THIS STEP DELETES AND REDEFINES THE FILE.                         *        
//*                                                                    *        
//*  A B O R T / R E S T A R T   P R O C E D U R E S                   *        
//*                                                                    *        
//*      1.  NONE                                                      *        
//*                                                                    *        
//**********************************************************************        
//*                                                                             
//*                DELETE/DEFINE PARAMETERS                                     
//SYSIN    DD  DSN=MIPS235.&INIT..SYSIN(WMIN1669S),                              
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=&SYSOUT                                                   
//SYSPRINT DD  SYSOUT=&SYSOUT                                                   
//*                                                                             
//PS02     EXEC PGM=IDCAMS,TIME=30,COND=(8,LT)                                  
//**********************************************************************        
//*                                                                    *        
//*  THIS STEP RELOADS THE VSAM FILE FROM THE BACKUP TAPE              *        
//*                                                                    *        
//*  A B O R T / R E S T A R T   P R O C E D U R E S                   *        
//*                                                                    *        
//*      1.  RESTART IN 'PS01'                                         *        
//*                                                                    *        
//**********************************************************************        
//*                                                                             
//*                CLAIMANT ELIGIBILITY FILE BACKUP (I)                         
//SYSUT1   DD  DSN=MIPS235.&INIT..M1100SA.BACKUP(+0),                           
//             DISP=SHR                                                         
//*                CLAIMANT ELIGIBILITY FILE (O)                                
//SYSUT2   DD  DSN=MIPS235.&INIT..M1100IA.DATA.VSAM,                            
//             DISP=SHR,                                                        
//             AMP='BUFNI=2,BUFND=57'                                           
//*                REPRO CONTROL CARD                                           
//SYSIN    DD  DSN=MIPS235.&INIT..SYSIN(REPRO),                                 
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=&SYSOUT                                                   
//SYSPRINT DD  SYSOUT=&SYSOUT                                                   
//*                                                                             
//************** END OF PROC ************** 
 