       LINKAGE SECTION.
       PROCEDURE DIVISION.
                 PERFORM CHECK-MYSYSIN-COMMAND
                 PERFORM CONTROL-MYDATIN
           GOBACK.
       CONTROL-MYDATIN SECTION.
               PERFORM DO-ALL-OPEN-OUTPUT
               PERFORM PROCESS-MYDATIN UNTIL MYDATIN-STATUS NOT = '00'
               PERFORM DO-ALL-CLOSE-OUTPUT
       PROCESS-MYDATIN SECTION.
             PERFORM DO-ALL-WRITE-OUTPUT
       DO-ALL-WRITE-OUTPUT SECTION.
       DO-ALL-OPEN-OUTPUT SECTION.
       DO-ALL-CLOSE-OUTPUT SECTION.

