//MAINJCL JOB 'MMRS00C'
//STEP01   EXEC PGM=MAINPGM
//MYFXOUT  DD DISP=NEW,DSN=DATASET.TRANSITIVE.FOR.MYFXOUT
//MYFBIN  DD DISP=SHR,DSN=DATASET.TRANSITIVE.FOR.MYFBIN
//MYFBIO   DD DISP=MOD,DSN=DATASET.TRANSITIVE.FOR.MYFBIO
//MYEXTEND DD DISP=OLD,DSN=DATASET.TRANSITIVE.FOR.EXTEND
