****************************************************************************
******** MMRS-M01  MAINFRAME MODERNIZATION REFERENCE SYSTEM
****************************************************************************
******* MMRS7111  READ WORKFILE AND WRITE SEQ. AND VSAMM FILES
******* MMRS7111  RECORDFORMAT OF FILES ARE
******* MMRS7111  F, FB, V, VB, VSAM-ESDS, VSAM-KSDS, VSAM-RRDS
****************************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    MOVE.
      *    ************************************************************
       PROCEDURE DIVISION.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           MOVE A TO B.
           .
      *    --------------------------------------------------
