//JCL2   JOB
//STEP1  EXEC PGM=ADUUMAIN
//SYSIN  DD *
   LOAD DATA RESUME YES
        SHRLEVEL CHANGE
        APOWNER UPROD
        INDDN SYSREC
        EBCDIC CCSID(37,65534,65534)
     INTO
     TABLE
   SCHEMA.TABLE6
   (ACCT_ID POSITION(1:8) DECIMAL
   );
   DELETE FROM table14;
   UPDATE table15 SET id = 5;
//  DD *
   LOAD DATA RESUME YES
        SHRLEVEL CHANGE
        APOWNER UPROD
        INDDN SYSREC
        EBCDIC CCSID(37,65534,65534)
UPDATE table9 SET id = 5;
//  DD *
   LOAD DATA RESUME YES
        SHRLEVEL CHANGE
        APOWNER UPROD
        INDDN SYSREC
        EBCDIC CCSID(37,65534,65534)
SELECT *                                                                13213213
FROM table7                                                             12312312
LEFT JOIN table8                                                        12312133
ON table7.id = table8.id;                                               12312232
