//WDIS93JCL3    JOB %ACCTGK,'%OADID',CLASS=S,MSGCLASS=Q,REGION=7M
//STEP1         EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB       DD   DSN=ENDEVOR.PRODP.LOADBAT,DISP=SHR
//              DD   DSN=SYS1.GDB2FACH.LINKLIB,DISP=SHR
//SYSTSPRT      DD   SYSOUT=*
//* IKJEFT01 : COBOLCall in PROGRAM($NAME)
//SYSTSIN       DD *
 DSN SYSTEM(DB2F)
 RUN PLAN(GKPLANB) 
     PROGRAM(G2BPES01)   
     PARMS('$GK103')
 END
/*