	   IDENTIFICATION DIVISION.
       PROGRAM-ID. LEADINGZ.
       AUTHOR. TEST.
           TESTING DATA WITH COPY.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
         WORKING-STORAGE SECTION.
       01 WS-TESTING PIC X(10).
       01 WS-CURRENT-TS PIC X(26).
       PROCEDURE DIVISION.
           COPY DELTACPY1..
           COPY DELTACPY2.
           COPY DELTACPY3.cpy
           COPY DELTACPY4.....cpy
       STOP RUN.
