       IDENTIFICATION DIVISION.
       PROGRAM-ID.    MMRS7120.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  MY-INFO.
           COPY DIFTYPE. 
       PROCEDURE DIVISION.
           DISPLAY 'Project: ' MMRS-M01-GLOBAL-NAME.