DEFINE DATA
LOCAL
01 #PROG1 (A8) INIT <'IEBGENER'>
01 #PROG2 (A8) INIT <'IEFBR14'>
END-DEFINE

INPUT WITH TEXT 'Test 2' (CD=GR) USING MAP 'ERRM0101'
INPUT USING MAP 'ERRM0102'
INPUT WITH TEXT 'Test 2' (CD=GR) USING MAP #PROG1
INPUT USING MAP #PROG2

END
