DEFINE DATA
LOCAL
1 #WF-LINE (A10)
END-DEFINE

DEFINE WORK FILE 1 'src/res/workfile/WF1'
WRITE WORK FILE 1 'SomeData'
CLOSE WORK FILE 1

L1. READ WORK FILE 1 #WF-LINE
  AT START OF DATA (L1.)
    WRITE 'START'
  END-START

  AT END OF DATA (L1.)
    WRITE 'END'
  END-ENDDATA
END-WORK
END