//TESTPRC  PROC NATPGM=NATPRG,          NATURAL PROGRAM NAME            00010004
//         NATREG=3M,                   NATURAL,DDM,OS SORT             00020000
//         SYSOUT='*',                  SYSOUT CLASS                    00080000
//         PRM=('IM=D,AUTO=ON,MT=0')    NATURAL PARMS                   00100000
//NATSTEP  EXEC PGM=&NATPGM,REGION=&NATREG,PARM=&PRM                    00170001
//STEPLIB  DD DSN=MMRS00C.A.LOADLIB,DISP=SHR                            00190000
//SYSOUT   DD SYSOUT=&SYSOUT                                            00350000
//CMPRINT  DD SYSOUT=&SYSOUT                                            00450000
//CMPRT01  DD SYSOUT=&SYSOUT                                            00460000
//CMPRT02  DD SYSOUT=&SYSOUT                                            00470000
//CMPRT03  DD SYSOUT=&SYSOUT                                            00480000
//CMPRT04  DD SYSOUT=&SYSOUT                                            00490000
//CMPRT05  DD SYSOUT=&SYSOUT                                            00500000
//CMPRT06  DD SYSOUT=&SYSOUT                                            00510000
//CMSYNIN  DD DDNAME=SYSIN                                              00530000