//M8255B JOB (20,FB3),'I',
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
// NOTIFY=&SYSUID,
// REGION=0M
//*
//*
//DFSE10 JCLLIB ORDER=(VENDOR.PROCLIB,DFSE10.PROCLIB)
//*
//*
//EXECPGM1 EXEC PGM=DFSRRC00,
//             PARM='DLI,P8255B,PSB8255B,,,,,,,,,,N,N'
//*