//JCL1   JOB
//STEP1  EXEC PGM=AMUUMAIN
//SYSIN  DD DSN=TEST.CONTROLCARD,DISP=SHR
//STEP2  EXEC PGM=AMUUMAIN
//SYSIN  DD DSN=TEST(CONTROLCARD),DISP=SHR
//STEP3  EXEC PGM=ADUUMAIN
//SYSIN  DD DSN=TEST1(CNTLCRD),DISP=SHR
//STEP4  EXEC PGM=AMUUMAIN
//SYSIN  DD DSN=TEST.CNTLCRD,DISP=SHR
//STEP5  EXEC PGM=AMUUMAIN
//SYSIN  DD DSN=TEST.NOCNTLCRD,DISP=SHR
//STEP6  EXEC PGM=AMUUMAIN
//INPUT  DD DSN=TEST.CONTROLCARD,DISP=SHR
//STEP7  EXEC PGM=AMUUMAIN
//INPUT  DD DSN=INPUT.NOCONTROLCARD,DISP=SHR
//STEP8  EXEC PGM=AMUUMAIN
//SYSTSIN  DD DSN=TEST.CNTLCRD,DISP=SHR
//STEP9  EXEC PGM=AMUUMAIN
//SYSTSIN  DD DSN=SYSTIN.NOCNTLCRD,DISP=SHR
//STEP10  EXEC PGM=AMUUMAIN
//IN  DD DSN=TEST.INCONTROLCARD,DISP=SHR
//STEP11  EXEC PGM=AMUUMAIN
//RANDOM  DD DSN=TEST.RESOURCE_FILE,DISP=SHR
