000570 IDENTIFICATION DIVISION.
000580 
000630*
000640****************************************************************
000650****************************************************************
000660 
000670 PROGRAM-ID. CLM_ACC_BUD_14A.
000700 
000710****************************************************************
000720 ENVIRONMENT DIVISION.
000730****************************************************************
000740 CONFIGURATION SECTION.
000750 SOURCE-COMPUTER. VAX-11.
000760 OBJECT-COMPUTER. VAX-11.
000770 
000780 INPUT-OUTPUT SECTION.
000790 FILE-CONTROL.
000800 
000810 SELECT MEDICARE_EXTRACT_FILE
000820        ASSIGN TO MEDICARE_FILE_NAME
000830        RESERVE 64 AREAS
000840        ORGANIZATION IS LINE SEQUENTIAL
000850        ACCESS MODE IS SEQUENTIAL
000860        FILE STATUS IS MEDICARE_FILE_STATUS.
000870 
000880 SELECT CLM_ACC_IMP_EXP_FILE
000890        ASSIGN TO IMP_EXP_FILE_NAME
000900        RESERVE 32 AREAS
000910        ORGANIZATION IS INDEXED
000920        ACCESS MODE IS DYNAMIC
000930        RECORD KEY IS CLM_ACC_IE_KEY0
000940        FILE STATUS IS IMP_EXP_FILE_STATUS.
000950 
000960 SELECT REPORT_LISTING_FILE
000970        ASSIGN TO REPORT_FILE_NAME
000980        RESERVE 64 AREAS
000990        ORGANIZATION IS LINE SEQUENTIAL
001000        ACCESS MODE IS SEQUENTIAL
001010        FILE STATUS IS REPORT_FILE_STATUS.
001020 
001030 SELECT EXCEL_LISTING_FILE
001040        ASSIGN TO EXCEL_FILE_NAME
001050        RESERVE 64 AREAS
001060        ORGANIZATION IS LINE SEQUENTIAL
001070        ACCESS MODE IS SEQUENTIAL
001080        FILE STATUS IS EXCEL_FILE_STATUS.
001090 
001100 
001110 I-O-CONTROL.
001120     APPLY LOCK-HOLDING ON
001130                MEDICARE_EXTRACT_FILE
001140                CLM_ACC_IMP_EXP_FILE
001150                REPORT_LISTING_FILE
001160                EXCEL_LISTING_FILE.
001170 
001180 
001190 
001200****************************************************************
001210 DATA DIVISION.
001220****************************************************************
001230 FILE SECTION.
001240 
001250 FD  MEDICARE_EXTRACT_FILE
001260      VALUE OF FILE-ID IS MEDICARE_FILE_NAME
001270       RECORD VARYING IN SIZE FROM 0 TO 80
001280        DEPENDING ON MEDICARE_RECORD_LENGTH.
001290 01  MEDICARE_EXTRACT_RECORD.
001300     03  MEDICARE_FIL_1ST    PIC X(1).
001310     03  MEDICARE_PLAN_CODE  PIC X(3)BBBB.
001320     03  MEDICARE_MED_CONST  PIC X(3)BBBBB.
001330     03  MEDICARE_MA_CONST   PIC X(8)BBBBBBBBB.
001340     03  MEDICARE_SUID_NUM   PIC ZZZZZ9.
001350     03  MEDICARE_FIL_END    PIC X(30).
001360 
001370 
001380 FD  CLM_ACC_IMP_EXP_FILE
001390      VALUE OF FILE-ID IS IMP_EXP_FILE_NAME.
001400 COPY CLM-CLM_ACC_IMP_EXP.
001410 
001420 
001430 FD  REPORT_LISTING_FILE
001440      VALUE OF FILE-ID IS REPORT_FILE_NAME
001450       RECORD VARYING IN SIZE FROM 0 TO 132
001460        DEPENDING ON REPORT_RECORD_LENGTH.
001470 01  REPORT_LISTING_LINE         PIC X(132).
001480 
001490 
001500 FD  EXCEL_LISTING_FILE
001510      VALUE OF FILE-ID IS EXCEL_FILE_NAME
001520       RECORD VARYING IN SIZE FROM 0 TO 200
001530        DEPENDING ON EXCEL_RECORD_LENGTH.
001540 01  EXCEL_LISTING_RECORD         PIC X(200).
001550 
001560 
001570 
001580****************************************************************
001590 WORKING-STORAGE SECTION.
001600****************************************************************
001610 
001620 01  CURRENT_CCYYMMDD            PIC 9(8)  VALUE ZEROES.
001630 01  CURRENT_HHMMSSMM            PIC 9(8)  VALUE ZEROES.
001640 01  CURRENT_VMS_USER            PIC X(16) VALUE SPACES.
001650 
001660 01  ITEM_LENGTH                 PIC S9(9) COMP VALUE ZEROES.
001670 01  ITEM_USERNAME               PIC S9(9) COMP VALUE EXTERNAL
IWCONT JPI$_USERNAME.
001680 
001690 01  CMM_TIER_IMP        PIC X(12) VALUE "CMM_TIER_IMP".
001700 
001710 01  LOWER_CASE     PIC X(26)    VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ
IWCONT-"".
001720 01  UPPER_CASE     PIC X(26)    VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ
IWCONT-"".
001730 
001740 01  TOTAL_ACTIVITY_ERRORS.
001750     03  TOTAL_MEDICARE_PLAN_CODES     PIC 9(5) VALUE ZEROES.
001760     03  TOTAL_TBLMST_REVIEWED         PIC 9(5) VALUE ZEROES.
001770     03  TOTAL_TBLMST_NON_MED          PIC 9(5) VALUE ZEROES.
001780     03  TOTAL_TBLMST_MED_OK           PIC 9(5) VALUE ZEROES.
001790     03  TOTAL_TBLMST_UPDATED          PIC 9(5) VALUE ZEROES.
001800     03  TOTAL_TBLMST_MISSING          PIC 9(5) VALUE ZEROES.
001810     03  TOTAL_BAQ_DB_MISSING          PIC 9(5) VALUE ZEROES.
001820 
001830 
001840 
001850****************************************************************
001860* Process ICI date & time conversions
001870****************************************************************
001880 
001890 01  CURRENT_ICIDATE             PIC S9(9) COMP VALUE ZEROES.
001900 01  CURRENT_ICITIME             PIC S9(9) COMP VALUE ZEROES.
001910 
001920 01  CVT_DATE_ICIDATE.
001930     03  CVT_DATE_ICICOMP        PIC S9(9) COMP VALUE ZEROES.
001940 01  CVT_DATE_CCYYMMDD.
001950     03  CVT_DATE_CC             PIC 9(2)  VALUE ZEROES.
001960     03  CVT_DATE_YY             PIC 9(2)  VALUE ZEROES.
001970     03  CVT_DATE_MM             PIC 9(2)  VALUE ZEROES.
001980     03  CVT_DATE_DD             PIC 9(2)  VALUE ZEROES.
001990 
002000 01  CVT_DATE_COMP               PIC 9(4)  COMP VALUE 0.
002010 01  FILLER            REDEFINES CVT_DATE_COMP.
002020     03  CVT_DATE_BIN            PIC X(1).
002030     03  FILLER                  PIC X(1).
002040 
002050 
002060 
002070****************************************************************
002080* CLM_ACC_IMP_EXP --- Input
002090*        CMM_TIER_IMP (128)  PLAN_CD=PLAN_CD
002100****************************************************************
002110 
002120 01  TABLED_MAXS.
002130     03  MED_MAX            PIC 9(5) VALUE 1000.
002140 
002150 01  TABLED_MED_PLAN_CODES.
002160     03  TBL_MED_ENTRY.
002170         05  TBL_MED_PLAN_CD      PIC X(5).
002180         05  TBL_MED_USED_CD      PIC X(1).
002190 
002200     03  TBL_MED_ENTRIES   OCCURS 1000 TIMES
002210           ASCENDING KEY   TBL_MED_PLAN_CDS
002220             INDEXED BY    MED_IDX MED_BLD.
002230         05  TBL_MED_PLAN_CDS     PIC X(5).
002240         05  TBL_MED_USED_CDS     PIC X(1).
002250 
002260 
002270 01  REPORT_ACTIVITY_ERRORS.
002280 
002290     03  REPORT_HEADING_ONE.
002300         05  RPT_HDR_DATE       PIC 9999/99/99  VALUE SPACES.
002310         05  FIL                PIC X(27) VALUE SPACES.
002320         05  RPT_HDR_SYSTEM     PIC X(30) VALUE "HEALTHNET - CLAIM
IWCONT-"S PROCESSING ".
002330         05  FIL                PIC X(19) VALUE SPACES.
002340         05  RPT_HDR_PROGRAM    PIC X(15) VALUE "CLM_ACC_BUD_14A".
002350 
002360     03  REPORT_HEADING_TWO.
002370         05  FIL                PIC X(2)  VALUE SPACES.
002380         05  RPT_HDR_TIME       PIC 99,99 VALUE SPACES.
002390         05  FIL                PIC X(24) VALUE SPACES.
002400         05  RPT_HDR_TITLE      PIC X(40)
002410                         VALUE "MED UPDATED - ACC_IMP_EXP CMM_TIER
IWCONT-"_IMP".
002420         05  FIL                PIC X(19) VALUE SPACES.
002430         05  FIL                PIC X(6)  VALUE "PAGE".
002440         05  RPT_HDR_PAGE       PIC ---9  VALUE SPACES.
002450 
002460     03  REPORT_DETAILS.
002470         05  RPT_FILLER         PIC X(1)   VALUE SPACES.
002480         05  RPT_TBL_PLAN_CD        PIC X(4)B  VALUE SPACES.
002490         05  RPT_TBL_NTW        PIC X(4)B  VALUE SPACES.
002500         05  RPT_TBL_TIR        PIC X(6)B  VALUE SPACES.
002510         05  RPT_TBL_SVC        PIC X(6)B  VALUE SPACES.
002520         05  RPT_STATUS         PIC X(22)B VALUE SPACES.
002530         05  RPT_MESSAGE        PIC X(53)B VALUE SPACES.
002540 
002550 
002560 
002570****************************************************************
002580* File i/o controls
002590****************************************************************
002600 
002610 01  MEDICARE_FILE_CONTROLS.
002620     03  MEDICARE_RECORD_COUNT       PIC 9(5)  VALUE ZEROES.
002630     03  MEDICARE_RECORD_LENGTH      PIC 9(5)  VALUE ZEROES.
002640     03  MEDICARE_FILE_NAME          PIC X(64) VALUE "MED_PLAN_COD
IWCONT-"ES".