DEFINE DATA
LOCAL USING MYLDASAM
LOCAL USING MYPDASAM
LOCAL
01 MY-VIEW VIEW OF EMPLOYEES
	02 PERSONNEL-ID
END-DEFINE

PERFORM MYSUBRSAM
PERFORM MYSUBSAM

END
