//JCL   JOB
//STEP0010 EXEC PGM=EZTPA00
//SYSDUMP  DD SYSOUT=H
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//REPORT1  DD SYSOUT=*
//SYSIN    DD  *
** DISPLAY ROW COUNT FOR VWRKGR **
*------------------------------------------------------------------*
PARM SSID(DP0G)
*
DEFINE W-COUNT W 4 B 0
*
FILE REPORT1 PRINTER
*
JOB INPUT SQL START(START-RTN) FINISH(TOTAL-RTN)
*------------------------------------------------------------------*
SELECT COUNT +
FROM AVGI00.VWRKGR +
INTO :W-COUNT
*------------------------------------------------------------------*
START-RTN. PROC
DISPLAY REPORT1 ' '
DISPLAY REPORT1 'STARTING COUNT...'
DISPLAY REPORT1 ' '
END-PROC
*------------------------------------------------------------------*
TOTAL-RTN. PROC
DISPLAY REPORT1 'TOTAL COUNT ......' W-COUNT
DISPLAY REPORT1 ' '
DISPLAY REPORT1 '...ENDING COUNT..'
DISPLAY REPORT1 ' '
END-PROC
*------------------------------------------------------------------*END **
*------------------------------------------------------------------" 