//PROC1 PROC PRD=PRD,                   PRD SYMBOLIC                            
//             PROD=PROD,               PROD SYMBOLIC                           
//             VAST=VAST,SHDW='',       VAST/SHADOW SYMBOLICS                   
//             DUMP='H',                DUMP SYMBOLIC                           
//             SILO=VTAPE,              SILO SYMBOLIC                           
//             STND='*',                STND SYMBOLIC                           
//             MASPCKG=MAACPCKG,        MASPCKG SYMBOLIC                        
//             MASSTP1=MAACD051         MASSTP1 SYMBOLIC                        
//*                                                                             
//STEP000A EXEC PGM=UNKN3,                                                   
//             DYNAMNBR=20                                                      
//*                                                                             
//PARMFILE DD DSN=V&PRD.SHR.&PROD.NV.CARDLIB(&MASPCKG),DISP=SHR         00010000
//*                                                                             
//MAFMQ006 DD DSN=V&PRD.MAS.&VAST.V.OCF.CLUSTER,                                
//             DISP=SHR                                                         
//MAFMS003 DD DSN=V&PRD.MAS.&VAST.V.TAB.CLUSTER,                                
//             DISP=SHR                                                         
//MAFMV000 DD DSN=V&PRD.MAS.&VAST.V.VTB.CLUSTER,                                
//             DISP=SHR                                                         
//*                                                                             
//SYSTSIN  DD DSN=V&PRD.SHR.&PROD.NV.CARDLIB(&MASSTP1),DISP=SHR                 
//SYSTSPRT DD  SYSOUT=&STND                                                     
//SYSPRINT DD  SYSOUT=&STND                                                     
//SYSOUT   DD  SYSOUT=&STND                                                     
//SYSABOUT DD  SYSOUT=&DUMP                                                     
//SYSUDUMP DD  SYSOUT=&DUMP                                                     
