00001  IDENTIFICATION DIVISION.
00002  PROGRAM-ID. MGOPGM1.
00078  ENVIRONMENT DIVISION.
00080  DATA DIVISION.
00081  WORKING-STORAGE SECTION.
00090  WORKING-STORAGE SECTION.
00091      COPY MGOWINIT REPLACING *YR*   BY '1980 THRU 1994.'
00092                              *PROG* BY 'MGOPGM2'.
00378  PROCEDURE DIVISION.
00382         DISPLAY 'BUG'.
           EXIT.
