//WEO418I1 PROC FTPPARM=,RGN=                                                   
// IF (RC LE 4) THEN                                                            
//FBR14010 EXEC PGM=IEFBR14                                                     
//DD1      DD DSN=WE.ORSIS.&RGN..ACS,                                           
//            DISP=(MOD,DELETE,DELETE),                                         
//            SPACE=(TRK,0),                                                    
//            STORCLAS=(STANDARD)                                               
//DD2      DD DSN=WE.ORSIS.&RGN..IN.ACS.TEMP,                                   
//            DISP=(MOD,DELETE,DELETE),                                         
//            SPACE=(TRK,0),                                                    
//            STORCLAS=(STANDARD)                                               
//DD3      DD DSN=WE.ORSIS.&RGN..ACS.FTP00020.FTPDATA,                          
//            DISP=(MOD,DELETE,DELETE),                                         
//            SPACE=(TRK,0),                                                    
//            STORCLAS=(STANDARD)                                               
//DD4      DD DSN=WE.ORSIS.&RGN..ACS.U0X18060.GETCMD,                           
//            DISP=(MOD,DELETE,DELETE),                                         
//            SPACE=(TRK,0),                                                    
//            STORCLAS=(STANDARD)                                               
//DD5      DD DSN=WE.ORSIS.&RGN..ACS.U0X18060.DELCMD,                           
//            DISP=(MOD,DELETE,DELETE),                                         
//            SPACE=(TRK,0),                                                    
//            STORCLAS=(STANDARD)                                               
//SYSIN    DD DUMMY                                                             
//SYSPRINT DD SYSOUT=*                                                          
// ENDIF                                                                        
