000300 IDENTIFICATION DIVISION.
000310 PROGRAM-ID. CLM_PMGA_ORX_04.
000360 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000410 FILE SECTION.
000430 WORKING-STORAGE SECTION.
000520 01  FORM_FILE                PIC X(40) VALUE 
000530                         "SCREENS:IFDLFILE.FORM".
000920 LINKAGE SECTION.
001120 PROCEDURE DIVISION.
001180 000-MAIN.
001530         CALL "FORMS$eNABLE" USInG
001540             BY VALUE FORMS$AR_FORM_TABLE
001550             BY DESCRIPTOR "SYS$INPUT"
001560             BY DESCRIPTOR SESSION_ID
001570             BY DESCRIPTOR FORM_FILE
001580             BY DESCRIPTOR FORM_FILE_SUB
001590             OMITTED OMITTED OMITTED OMITTED OMITTED
001600                         BY DESCRIPTOR PARENT_REQUEST_ID
001610             GIVING FORMS_STATUS