000100*    Datenstruktur für Tabelle LA_ABKBAVKRITERIUM
000200     25 LADTBK0A-KEY.
000300        30 ABKNR                PIC S9(17)V USAGE COMP-3.
000400        30 FILLER               PIC  X(3).
000500        30 BEARBABKNR           PIC S9(9) USAGE COMP.
000600        30 BSABKKZ              PIC S9(4) USAGE COMP.
000700        30 FILLER               PIC  X(2).
000800        30 BAUTYPKZ             PIC S9(4) USAGE COMP.
000900        30 FILLER               PIC  X(2).
001000        30 LFDNRBAUTYP          PIC S9(9) USAGE COMP.
001100        30 BAUPRICKZ            PIC S9(4) USAGE COMP.
001200        30 FILLER               PIC  X(2).
001300        30 LFDNRBAUPRIC         PIC S9(9) USAGE COMP.
001400        30 BAVKRITKZ            PIC S9(4) USAGE COMP.
001500        30 FILLER               PIC  X(2).
001600        30 ABGANGABKNR          PIC S9(9) USAGE COMP.
001700     25 LADTBK0A-DATA.
001800        30 BAVKRITTYPKZ         PIC S9(4) USAGE COMP.
001900        30 FILLER               PIC  X(2).
002000        30 BAVKRITWERTKZ        PIC S9(4) USAGE COMP.
002100        30 FILLER               PIC  X(2).
002200        30 BAVKRITWERTJN        PIC  X(1).
002300        30 FILLER               PIC  X(3).
002400        30 BAVKRITFREITEXT.
002500           49 BAVKRITFREITEXT-LEN  PIC S9(4) USAGE COMP.
002600           49 BAVKRITFREITEXT-TEXT PIC  X(2000).
002700        30 FILLER               PIC  X(2).
