000140*
000650 IDENTIFICATION DIVISION.
000660 PROGRAM-ID.     CLM_ACC_BRM_08.
000750 ENVIRONMENT DIVISION.
000760 CONFIGURATION SECTION.
000770 SOURCE-COMPUTER.                        VAX-11.
000780 OBJECT-COMPUTER.                        VAX-11.
000790 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000860 DATA DIVISION.
000870 FILE SECTION.
000890 WORKING-STORAGE SECTION.
003770 COPY "CDD_REC.CLEXP_RECORD"             FROM DICTIONARY.
004070 PROCEDURE DIVISION.
004150 A0000_MAINLINE.
004160*      
