000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.     HELLOWORLD.
000300
000400*
000500 ENVIRONMENT DIVISION.
000600 CONFIGURATION SECTION.
000700 SOURCE-COMPUTER. RM-COBOL.
000800 OBJECT-COMPUTER. RM-COBOL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200
100000 PROCEDURE DIVISION.
100100
100200 MAIN-LOGIC SECTION.
100300 BEGIN.
100600     STOP RUN.
100400     MOVE A TO B
100400     ADD +1 TO
100600     STOP RUN.
100500     DISPLAY "Hello world!".
100600     STOP RUN.
100700 MAIN-LOGIC-EXIT.
100800     EXIT.