000160 IDENTIFICATION DIVISION.
000170 PROGRAM-ID.    CAP_CVT_BUM_59.
001220 ENVIRONMENT DIVISION.
001230 CONFIGURATION SECTION.
001240 SPECIAL-NAMES.
001300 
001310 SOURCE-COMPUTER.    ALPHA.
001320 OBJECT-COMPUTER.    ALPHA.
001340 INPUT-OUTPUT SECTION.
001350 FILE-CONTROL.
001370     SELECT PRVTTLS_FILE   ASSIGN TO DUMMY
001380     ORGANIZATION IS INDEXED
001390     ACCESS MODE IS DYNAMIC
001400     RECORD KEY IS PRVTTLS_KEY0 IN PRVTTLS_REC
001410     FILE STATUS IS WS_FILE_STATUS.
001420 
001430     SELECT EXTOUT_DTL_FILE        ASSIGN TO 'FALSCH3'
001440     FILE STATUS IS WS_FILE_STATUS.
001450 
001490     SELECT EXTOUT_SMRY_GRP_FILE ASSIGN TO EXTSNA_SUMGRP
001500     FILE STATUS IS WS_FILE_STATUS.
001510 
001520     SELECT EXTOUT_SMRY_PHY_FILE ASSIGN TO 'CORRECT1'
001530     FILE STATUS IS WS_FILE_STATUS.
001750 DATA DIVISION.
001760 FILE SECTION.
001780 FD  PRVTTLS_FILE
001790     VALUE OF ID IS WS_PRVTTLS_FILESPEC.
001820 
001830 FD  EXTOUT_DTL_FILE
001835     VALUE OF ID IS 'CORRECT4'.
001860 
001910 FD  EXTOUT_SMRY_GRP_FILE.
001940 
001950 FD  EXTOUT_SMRY_PHY_FILE.
001980 
001990 FD  PRGSTAT_FILE.
002000 01  PRGSTAT_REC.
002010     05  PRGSTAT_DATE                PIC X(08).
002020     05  FILLER                    PIC X(01).
002030     05  PRGSTAT_TIME                PIC X(08).
002040     05  FILLER                    PIC X(01).
002050     05  PROGRAM_ID                PIC X(14).
002060     05  FILLER                    PIC X(01).
002070     05  PRGSTAT_MSG                PIC X(46).
002100 WORKING-STORAGE SECTION.
002665 01  TEST_STUFF
002667     05 DUMMY                      PIC X VALUE "FALSCH1".
003900 01  WORK_AREA.
003960     05  WS_OFFSET_PERIOD        PIC S9(9) COMP.
003970     05  WS_FILE_STATUS            PIC X(02).
003980     05  WS_PRVTTLS_FILESPEC       PIC X(19) VALUE "CORRECT3".
004610 PROCEDURE DIVISION.
004660 MAIN_PROGRAM SECTION.
005530     MOVE "CORRECT2" TO WS_PRVTTLS_FILESPEC
011510 END PROGRAM CAP_CVT_BUM_59.