000400*****************************************************************
000410 
000420  IDENTIFICATION DIVISION.
000430  PROGRAM-ID.    ENIP100.
000460 
000470  ENVIRONMENT DIVISION.
000480 
000490  CONFIGURATION SECTION.
000500 
000510  INPUT-OUTPUT SECTION.
000520 
000530  FILE-CONTROL.
000531  SELECT CLAIMS_WIP_FILE4
000532     ASSIGN TO 'TEST_NO_ORGANIZATION'.
000533 
000540  SELECT CLAIMS_WIP_FILE
000550     ASSIGN TO CLWIP_FILE_NAME
000560     RESERVE 127 AREAS
000570     ORGANIZATION IS INDEXED
000580     ACCESS MODE IS DYNAMIC
000590               RECORD KEY IS CLWIP_IDNT_CLAIM
000600     ALTERNATE RECORD KEY IS CLWIP_IDNT_DATA
000610     FILE STATUS IS CLWIP_FILE_STATUS.
001234
001310  Select ARS_Payor_Family_File
001320        Assign To 'SOME_ISAM_NAME'
001330        Reserve 127 Areas
001340        Organization Is Indexed
001350        Access Mode Is Dynamic
001360        Record Key Is ARSPAYR_KEY0
001370                     = ARSPAYR_KEY0_SEG0
001380                       ARSPAYR_KEY0_SEG1
001390                       ARSPAYR_KEY0_SEG2
001400                       ARSPAYR_KEY0_SEG3
001410        Alternate Record Key Is ARSPAYR_KEY1
001420                     = ARSPAYR_KEY1_SEG0
001430                       ARSPAYR_KEY1_SEG1
001440                       ARSPAYR_KEY1_SEG2
001450        File Status Is ARSPAYR_File_Status.
001506  DATA DIVISION.
001570 
001508  FILE SECTION.
001590 
001610 
001620**************************
001630  WORKING-STORAGE SECTION.
001640**************************
002270 01 WS_RMC_TABLE.
002280    05 WS_RMC_STATE_TABLE OCCURS 50 TIMES.
002290        10 WS_TBL_DATA   PIC X(12).
002300        10 WS_TBL_VAL REDEFINES WS_TBL_DATA.
002310           20 WS_TBL_CODE  PIC X(2).
002320           20 WS_TBL_PAYOR   PIC X(5).
002330           20 WS_TBL_PAYOR1  PIC X(5).
002340 
002350 
004750 
004760************************
004770  PROCEDURE DIVISION.
004780************************
004790 
004800*--------------
004810  0000-MAINLINE.
004820*--------------
