
 ADD012A: PROCEDURE OPTIONS(MAIN);
   %INCLUDE BAS001B;

     PUT SKIP LIST('ADD012 entered.');

     /*******Test case: ADD012_1   ******/

   DCL 1 GR_1,
    2 FXD_1 FIXED DECIMAL(15) INIT(888888888888888),
    2 FXB_2 FIXED BINARY(15,0) INIT(1111111111111B),
    2 FXD_3 FIXED DECIMAL(15,7) INIT(888888.8888888);

    FXD_1 = FXB_2 + FXD_3 ;
    PUT SKIP LIST('');
    PUT SKIP LIST('');
    PUT SKIP LIST('GR_1');
    PUT SKIP LIST('Test Case : ADD012_1    ******');
    PUT SKIP LIST('');

   CALL HEXDUMP32(ADDR(GR_1) , SIZE(GR_1));

 END ADD012A;
