 BLK003A: PROCEDURE OPTIONS(MAIN); 
  put skip list("Outside of do");
  do;
   put skip list("Inside first do");
     do;
       put skip list("Inside nested do");
     end;
     put skip list("Outside nested do");
  end;
  put skip list("Outside of do");  
 END BLK003A;