 COR007B : PROC;
 
    PUT SKIP LIST("IN EXPORTED COR007B PROCEDURE");
    
    CALL COR007C;
    
 END COR007B;

 COR007C : PROC;
 
    PUT SKIP LIST("IN EXPORTED COR007C PROCEDURE");
    
    CALL C;
    
        C: PROC;
        
        PUT SKIP LIST("IN COR007C NESTED PROCEDURE");
        
        END;
        
 END COR007C;
