 /* TEST CASE TO SHOW HOW RETURN STATEMENT WORK */
 EXTPGM: PROC(PRMA, PRMB);
 
    DCL RESULT FIXED DECIMAL(5);
    DCL PRMA FIXED DECIMAL(5);
    DCL PRMB FIXED DECIMAL(3);
    
    RESULT = PRMA - PRMB;
    
    CALL PROCD;
    
    PUT SKIP LIST('SUBSTRACTION OF VARA & VARB:', RESULT);
    RETURN;
    
 END EXTPGM;

 PROCD: PROC;
 
    PUT SKIP LIST('INSIDE PROCD');
 
 END PROCD;
