  /* Manual test file for Control flow IF statement  */ 
 CTL017A: PROC OPTIONS(MAIN);
  
    DCL FLOAT_A REAL FLOAT DECIMAL(2) INIT(21);   
    DCL RESULT BIT(1) INIT(0B);   
        
    IF( ISFINITE(FLOAT_A) | (RESULT = ISFIN()) )
    THEN
       PUT SKIP LIST('INSIDE IF FOR ISFINITE');
    ELSE
       PUT SKIP LIST('INSIDE ELSE FOR ISFINITE');   
    PUT SKIP LIST('ISFINITE(FLOAT_A) FOR FLOAT_A' , ISFINITE(FLOAT_A));
    PUT SKIP LIST('RESULT = CALL ISFIN()' , RESULT );   
    
 END CTL017A;
 
 ISFIN:PROCEDURE RETURNS(BIT);
      DCL FLOAT_B REAL FLOAT DECIMAL(2) INIT(21);
      DCL RESULT BIT;
     
      PUT SKIP LIST('INSIDE ISFIN FUNCTION');
      RESULT = ISFINITE(FLOAT_B);
      RETURN (RESULT);
 END ISFIN;          
     
