000060 IDENTIFICATION DIVISION.
000080
000090 PROGRAM-ID.  TEST.
000100
000110 AUTHOR. MARSIN S RAJ (A49).
000120
000130 DATE-WRITTEN.  9-DEC-2016.

000260 ENVIRONMENT DIVISION.
000270
000280 CONFIGURATION SECTION.
000290 SOURCE-COMPUTER.        VAX.
000300 OBJECT-COMPUTER.        VAX.
000310
000320 INPUT-OUTPUT SECTION.
000400 DATA DIVISION.
000410 WORKING-STORAGE SECTION.
000720     EXEC SQL
000730         DECLARE SCHEMA FILENAME 'HSI_DB'
000740     END-EXEC
004920 PROCEDURE DIVISION.
015660     STOP RUN.
