DBD  NAME=DB8248C3,                                        
      ACCESS=INDEX
DATASET DD1=DB8248C3,                                     
      DEVICE=3390,                                          
      SIZE=(4096),                                         
      SCAN=3
SEGM NAME=SEGM1,                                          
      PARENT=0,                                              
      BYTES=100,                                        
      PTR=(T),                                              
      RULES=(PLV,LAST) 
FIELD NAME=(SEQFLD,SEQ,U),                                   
      BYTES=4,                                              
      START=1,                                             
      TYPE=C
SEGM NAME=SEGM2,                                         
      PARENT=SEGM1,                                      
      BYTES=100,                                           
      PTR=(T),                                            
      RULES=(PLV,LAST)
FIELD NAME=(SEQFLD,SEQ,U),                                  
      BYTES=2,                                          
      START=1,                                            
      TYPE=C
SEGM NAME=SEGM1,                                          
      PARENT=0,                                              
      BYTES=100,                                        
      PTR=(T),                                              
      RULES=(PLV,LAST) 
FIELD NAME=(SEQFLD,SEQ,U),                                   
      BYTES=4,                                              
      START=1,                                             
      TYPE=C
DBDGEN                                                                        
FINISH                                                                        
END  