//MATEKSD JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//STEP1 EXEC PGM=RTN
//IFBAD IF (ABEND | STEP1.RC > 8) THEN
//TRUE EXEC PGM=ERROR
//IFBADEND ENDIF
//NEXTSTEP EXEC PGM=CONTINUE
