//MATEKSD JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//EXP1      EXEC  PGM=PGM1
//EXP2      EXEC  PGM=PGM2
//IFTEST4   IF  (EXP1.PSTEPONE.RC > 4) THEN
//STEP1ERR  EXEC  PGM=PROG1
//          ELSE
//IFTEST5     IF  (EXP2.PSTEPTWO.ABENDCC=U0012) THEN
//STEP2ERR    EXEC  PGM=PROG2
//            ELSE
//NOERR       EXEC  PGM=PROG3
//ENDTEST5    ENDIF
//ENDTEST4  ENDIF
//NOPROB    EXEC  PGM=RUNOK

