//INNOWAK JOB INNOWAK,'INNOWAK',CLASS=A,
// REGION=0M,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
// JCLLIB ORDER=(INNOWAK.A.PROC)
//*
//STEP01 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSIN DD DUMMY
//SYSUT1 DD *
STUFF
/*
//SYSUT2 DD   DSN=INNOWAK.ABA.ME7836B.OUTPUT1,
// DISP=(NEW,CATLG,DELETE),
// DCB=(LRECL=80,RECFM=FB),
// SPACE=(TRK,1,RLSE)
//*
//STEP10 EXEC M7836B1
//STEP20 EXEC PGM=IEBGENER,COND=(16,NE,STEP10.PETS01)
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSIN DD DUMMY
//SYSUT1 DD *
STUFF
/*
//SYSUT2 DD   DSN=INNOWAK.ABA.ME7836B.OUTPUT2,
// DISP=(NEW,CATLG,DELETE),
// DCB=(LRECL=80,RECFM=FB),
// SPACE=(TRK,1,RLSE)
//
