000010 ID  DIVISION.
000020 PROGRAM-ID.             MGOASSM1
000230 ENVIRONMENT DIVISION.
000240 CONFIGURATION SECTION.
000440 WORKING-STORAGE SECTION.
000445 77  PAN-VALET PICTURE X(24) VALUE 'XXXXXXXXXXXXXXXXXXXXX'.
000480     EXEC SQL INCLUDE SQLCA END-EXEC.
010370     COPY MISDATEC.
010380*
011940 LINKAGE SECTION.
011950*
011960 PROCEDURE DIVISION.
012010     DISPLAY '**************************'
012170     .
012180
