 WMIN3020_MiscIfDoWhile1: PROCEDURE OPTIONS(MAIN);
	if (abc) then
      DO WHILE( IZ > 0 );
        IF IZ = 1 THEN;
        ELSE
          PUT LIST( SUBSTR(PTEXT->CHARS, 1, IZ-1) );
      END;
    else
      return (U*V*W);
 END WMIN3020_MiscIfDoWhile1;
