//JCL2   JOB
//STEP2  EXEC PGM=AMUUMAIN
//SYSIN  DD *
   LOAD DATA RESUME YES
        SHRLEVEL CHANGE
        APOWNER UPROD
        INDDN SYSREC
        EBCDIC CCSID(37,65534,65534)
     INTO
     TABLE
   TABLE2
   (ACCT_ID POSITION(1:8) DECIMAL
   )
