CONTINUE: PROCEDURE OPTIONS(MAIN);
 DCL MyArray (10) FIXED BINARY (31) INIT ( (7)0 );
 Put skip list ( MyArray ); 
 DCL FIRSTNME                 CHAR(30) var init('NOVAL');
 Put skip list ( MyArray ); 
  EXEC SQL
  SELECT PRUEFAUFTRAG_ID,
         MONTAGEORT,
         USERID,
         BENENNUNG,
         SPRACH_KZ
  INTO :DCLVLMQPA.PRUEFAUFTRAG_ID,
       :DCLVLMQPA.MONTAGEORT,
       :DCLVLMQPA.USERID,
       :DCLVLMQPA.BENENNUNG,
       :DCLVLMQPA.SPRACH_KZ
  FROM LMT.VLMQPA
  WHERE SENDER           = 'LBD'
  AND   STATUS           = '10'
  AND   PRUEFAUFTRAGSART = :VORL.ANFART
  AND   PRUEFAUFTRAG_ID  = :TRIGGER_DATEN.PRUEFAUFTRAG_ID
  ORDER BY ERSTELL_ZEITPUNKT
  FETCH FIRST 1  ROWS ONLY;
 Put skip list ( MyArray ); 
 END CONTINUE;