PROC 1 JOBNAME
CONTROL END(ENDO)MSG LIST NOFLUSH
SET JOBNAME = &STR(7675)
ATTN DO
     WRITE TEST CLIST ID
     ENDO
     
 SET CODE = 0
 ALLOC FI(ONE) DA('MGO') OLD
 IF &LASTCC = 0 THEN GOTO START
     
     
 START: +
        SET MM=&SUBSTR(1:2,&SYSDATE)
        GOTO MSGEND1
        
 MSGEND1: +
        GOTO QUIT
        
 QUIT
     EXIT