      /
       IDENTIFICATION DIVISION.

       PROGRAM-ID.      SAMPLE2.


       DATE-COMPILED.


      /
       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

UCOB08 SOURCE-COMPUTER.   UNISYS-2200.
UCOB08 OBJECT-COMPUTER.   UNISYS-2200.


UCOB08 SPECIAL-NAMES.

UCOB08     PRINTER IS PRINTER.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

      /
       DATA DIVISION.

       FILE SECTION.


      /
       WORKING-STORAGE SECTION.

VM9810 COMMON-STORAGE SECTION.

       01  OVERAGE-CONTROL-REC-WS.
CJB897     02  BEG-REPORT-DATE-WS                  PIC 9(8).
CJB897     02  END-REPORT-DATE-WS                  PIC 9(8).


      /
       PROCEDURE DIVISION.
	   
	           IMPART.
	           IF  ERROR-NUM = '0000'
010000D        DISPLAY 'NRPS-AREA IMPARTED' UPON PRINTER
010010         MOVE 'NRPS-AREA' TO NRPS-AREA-NAME
               MOVE SPACES TO FOF-CONTROL-REC.
               MOVE FACT-OF-FILING-REC TO FOF-CONTROL-REC.
               COMPUTE TOTAL-REC-FOF = TOTAL-REC-FOF - FOF-DELETED-CTRL.
               MOVE SPACES TO FACT-OF-FILING-REC.
               MOVE FOF-CONTROL-REC TO FACT-OF-FILING-REC.
			   MOVE ZEROS TO FOF-DELETED-CTRL.
               MODIFY FACT-OF-FILING-REC, FACT-OF-FILING-REC1.
               MODIFY FACT-OF-FILING-REC RECORD.
               MODIFY ENT-RECORD-NAME RECORD ENT-IND-REC, ENT-IND-REC1
                      ON ERROR GO TO ENDLABEL.

      **************************************************************
      **** MODULE 0.0                  REVISION-DATE: 05-11-84
      **************************************************************

           MOVE ZEROES TO
                   BEG-REPORT-DATE-WS OF INVENTORY-CONTROL-REC-WS.

           STOP RUN.
           
           