NDT3022A PROC
           01 VAR1 PIC 9(5).
           01 VAR2 PIC 9(3).
 END

NDT3022B PROC
           01 VAR3 PIC 9(5).
           01 VAR4 PIC 9(3).
 END

* some comment

NDT3022C PROC
           DISPLAY VAR3.
           DISPLAY VAR4.
 END