       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEWRITER.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUTPUTFILE ASSIGN TO OUTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD OUTPUTFILE.
       01 OUTPUTRECORD.
          05 FIELD1       PIC 9(5)  VALUE 12345.

       PROCEDURE DIVISION.

           OPEN OUTPUT OUTPUTFILE

           MOVE 1 TO FIELD1
           WRITE OUTPUTRECORD

           CLOSE OUTPUTFILE

           STOP RUN.
