* MAP2: PROTOTYPE              --- CREATED BY NATCLIPSE 99.9.9.9_TRUNK_NDT-SNAPSHOT ---
* INPUT USING MAP 'XXXXXXXX'
FORMAT PS=024 LS=080 ZP=OFF SG=OFF KD=OFF IP=OFF
* MAP2: MAP PROFILES *****************************        200***********
* .TTAAAMMOO   D I D I N D I D I        ?_)^&:+(                       *
* 024079        N0NNUCN             X        01 SYSDBA  NR             *
************************************************************************
INPUT          (     IP=OFF                                           /*
                                                                       )
/
/
 004T 'TextConstan__'
* MAP2: VALIDATION *****************************************************
* MAP2: END OF MAP *****************************************************
END
