 WMIN3020_NestedDoUntil: proc options(main);
   if (U > V & condition1) then
    do until (a > b & condition1 & b > c);
      C = D;
      do until (a > b & condition2 );
        D = E;
        do until (d > c & condition3 );
           D = E;
        END;
      END;
    END;
    else
      return (0);
 end WMIN3020_NestedDoUntil;
