 WMIN3020_DoWhileBit: proc options(main);
   do while(condition1 & condition2)
   		C = D;
        do while(condition1 & condition2)
            A = B;
        end;
   end;
 end WMIN3020_DoWhileBit;
