 P4030E: PACKAGE EXPORTS(EXTPRC1);

   EXTPRC1: PROC(DB_PTR_MAST,DB_PTR_SCND,DB_PTR_XXX);
     DCL DB_PTR_MAST POINTER;
     DCL DB_PTR_SCND POINTER;
     DCL DB_PTR_XXX POINTER;
     DCL 1    DB_PCB_SCND          BASED,
          2   MAST_DB_NAME     CHAR(8),
          2   MAST_SEG_LEVEL   CHAR(2),
          2   MAST_STAT_CODE   CHAR(2),
          2   MAST_PROC_OPT    CHAR(4),
          2   FILLER           FIXED BINARY (31,0),
          2   MAST_SEG_NAME    CHAR(8),
          2   MAST_LEN_KFB     FIXED BINARY (31,0),
          2   MAST_NO_SENSEG   FIXED BINARY (31,0),
          2   MAST_KEY_FB      CHAR(*);
     DCL 1 TEST_GRP,
          2 SOME_FLD CHAR(1),
          2 DB_PCB_MAST          BASED(DB_PTR_MAST),
           3   MAST_DB_NAME     CHAR(8),
           3   MAST_SEG_LEVEL   CHAR(2),
           3   MAST_STAT_CODE   CHAR(2),
           3   MAST_PROC_OPT    CHAR(4),
           3   FILLER           FIXED BINARY (31,0),
           3   MAST_SEG_NAME    CHAR(8),
           3   MAST_LEN_KFB     FIXED BINARY (31,0),
           3   MAST_NO_SENSEG   FIXED BINARY (31,0),
           3   MAST_KEY_FB      CHAR(*);
     %INCLUDE FUNC;
     
     CALL CEETDLI (3, FUNC_GN, DB_PTR_SCND, DET_SEG_IO_AREA);
     
     %INCLUDE IMSCALL;
     
     CALL PLITDLI (3, FUNC_GNP, DB_PTR_XXX, DET_SEG_IO_AREA);
     
     CALL PLITDLI (3, FUNC_REPL, DB_PTR_SCND->DB_PCB_SCND, DET_SEG_IO_AREA);
     
     CALL PLITDLI (3, FUNC_GU, TEST_GRP.DB_PCB_MAST, DET_SEG_IO_AREA);
   END EXTPRC1;

 END P4030E;