  PGM4030D: PROC(DB_PTR_MAST, DB_PTR_SCND, DB_PTR_THRD) OPTIONS(MAIN);
  
    DCL DB_PTR_MAST POINTER;
    DCL DB_PTR_SCND POINTER;
    DCL DB_PTR_THRD POINTER;
    DCL DET_SEG_IO_AREA CHAR(100);
    DCL FUNC_PTR POINTER;
    
    DCL EXTPRC1 ENTRY(POINTER, POINTER, POINTER) EXTERNAL;
    
    %INCLUDE FUNC;
  
    CALL MY_PROC;
    
    MY_PROC: PROC;
      CALL PLITDLI (3, FUNC_GU, DB_PTR_MAST, DET_SEG_IO_AREA);
      
      CALL EXTPRC1(DB_PTR_MAST, DB_PTR_SCND, DB_PTR_THRD);
      
      CALL PLITDLI (3, FUNC_PTR->FUNC_REPL, DB_PTR_THRD, DET_SEG_IO_AREA);
      
    END MY_PROC;
   
  END;