//OSWAYAO JOB (20,FB3),'I',
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
// NOTIFY=&SYSUID,
// REGION=0M
//*
//*
//DFSF10 JCLLIB ORDER=(VENDOR.PROCLIB,DFSF10.PROCLIB)
//       EXPORT SYMLIST=(*)
//*
//        SET PSB=INRUN1
//        SET DBD=INDB1
//        SET DBDI=INDB1I
//        SET PGM=QATF82A
//        SET HLQ=OSWAYAO.TEST
//        SET UNAME=OSWAYAOS
//*
//SCRATCH EXEC PGM=IDCAMS,DYNAMNBR=200
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *,SYMBOLS=JCLONLY
  DELETE &HLQ..&DBD. NONVSAM SCRATCH
  DELETE &HLQ..&DBDI..IC101 NONVSAM SCRATCH
  DELETE &HLQ..&DBDI. CLUSTER
  DELETE &HLQ..PSBLIB NONVSAM SCRATCH
  DELETE &HLQ..DBDLIB NONVSAM SCRATCH
  DELETE &HLQ..PGMLIB NONVSAM SCRATCH
/*