       IDENTIFICATION DIVISION.
       PROGRAM-ID. WCFD104B.

      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT


       ENVIRONMENT DIVISION.
       DATA DIVISION.
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
       WORKING-STORAGE SECTION.
       01  DATA.
           05  RD-MAP-NAME.
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
       PROCEDURE DIVISION.

          IF MD-MAP-NAME = 'P'
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
              DISPLY 'P';
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
          STOP RUN.
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
      * COMMENT
