       IDENTIFICATION DIVISION.
       PROGRAM-ID. WCFD104B.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  DATA.
           05  RD-MAP-NAME.
       PROCEDURE DIVISION.

          IF MD-MAP-NAME = 'P'
              DISPLAY 'P';
          STOP RUN.
