 proc1: PROCEDURE OPTIONS(MAIN);
 
 DCL H1 BIN FIXED(31);
 DCL H2 BIN FIXED(31);
 DCL H3 BIN FIXED(31);
 DCL 1   H4 BIN FIXED(31)
  ;
 DCL H5 BIN FIXED(31);
  DCL  fileMain1    FILE RECORD OUTPUT ENV(VB RECSIZE(104));
   %INCLUDE TESTCPY;
   DCL  fileMain2    FILE RECORD OUTPUT ENV(VB RECSIZE(104));
 END proc1;
 
  %INCLUDE TESTCPY2;
  
  %INCLUDE TESTCPY3;
  
  
   proc2: PROCEDURE;
  DCL  fileMain3    FILE RECORD OUTPUT ENV(VB RECSIZE(104));
 
   %INCLUDE TESTCPY4;
  
 END proc2;