DEFINE DATA         
  LOCAL 
    1 MYVIEW VIEW OF UAMPDATENTRANSFERPUFFER
      2 UAMKEY
      2 CHAIN
      2 DATACONTAINER
END-DEFINE

F1. FIND (20) MYVIEW WITH UAMKEY = 12345
  IF NO RECORDS FOUND
 	 	WRITE (1) NOTITLE NOHDR 'Nothing found'
  END-NOREC
  DELETE(F1.)
END-FIND
	 
F2. FIND (20) MYVIEW WITH UAMKEY = 12345
  UPDATE(F2.)
END-FIND

END