DBD   NAME=DB8248A4,                                         
      ACCESS=INDEX
DATASET DD1=DB8248A4,                                    
      DEVICE=3390,                                         
      SIZE=(4096),                                         
      SCAN=3
SEGM  NAME=SEGM4,                                           
      PARENT=0,                                         
      BYTES=100,                                       
      PTR=(T),                                           
      RULES=(PLV,LAST)
FIELD NAME=(SEQFLD,SEQ,U),                              
      BYTES=3,                                            
      START=1,                                            
      TYPE=C
SEGM  NAME=SEGM5,                                         
      PARENT=SEGM4,                                             
      BYTES=100,                                            
      PTR=(T),                                               
      RULES=(PLV,LAST)
FIELD NAME=(SEQFLD,SEQ,U),                                  
      BYTES=2,                                             
      START=1,                                            
      TYPE=C
LCHILD NAME=(SEGM3,DB8248A1),                               
      POINTER=SNGL,                                       
      PAIR=SEGM6,                                          
      RULES=LAST
DBDGEN                                                                        
FINISH                                                                        
END