//IGYWCL  PROC PARM=''
//* 
//* N.b., this is not a solid proc.
//* The goal here is to have the same interface as the solid proc
//* so that we can run solid jcl in our test suite.
//*
//* To use, define COBOL=type=builtin-mee-cobol| \
//* stack=<fully qualified path to your program>
//* in your jclconfig.cfg.
//*
//* TODO:
//* * Accept PARM='NOADV,<etc.>' and make compiler flags object from it
//*
//COBOL    EXEC PGM=IEFBR14
//LKED     EXEC PGM=IEFBR14