//M8255A JOB (20,FB3),'I',
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
// NOTIFY=&SYSUID,
// REGION=0M
//*
//*
//DFSE10 JCLLIB ORDER=(VENDOR.PROCLIB,DFSE10.PROCLIB)
//*
//        SET PSB=PSB8255A
//        SET PGM=P8255A
//*
//*
//*
//EXECPGM1 EXEC PGM=DFSRRC00,
//             PARM='DLI,&PGM.,&PSB.,,,,,,,,,,N,N'
//*