000100 IDENTIFICATION DIVISION.                                         00010000
000300 PROGRAM-ID. RCRBM011.                                            00030002
004300 ENVIRONMENT DIVISION.                                            00430000
004400 CONFIGURATION SECTION.                                           00440000
004500 SOURCE-COMPUTER. IBM-370.                                        00450000
004600 OBJECT-COMPUTER.  IBM-370.                                       00460000
004800 INPUT-OUTPUT SECTION.                                            00480000
005800 DATA DIVISION.                                                   00580000
008500 WORKING-STORAGE SECTION.                                         00850000
011100 PROCEDURE DIVISION.                                              01110000
014400     DISPLAY 'RECORDS READ    '                                   01440000
014700     GOBACK.                                                      01470000
