//TESTJOBA JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A
//STEP01   EXEC PGM=IKJEFT1B,REGION=100000K
//SYSTSIN  DD DISP=SHR,DSN=XY..PARMLIB(RCRBM011)
