//JOB1 JOB (051000,321),'                ',CLASS=A,                 
//             MSGCLASS=Y                                           
/*JOBPARM SYSAFF=ANY                                                            
//*                                                                             
//JOBLIB  DD DSN=DDSHR.RESCUE,DISP=SHR                              
//        DD DSN=DDSHR.CICSLOAD,DISP=SHR                               
//*                                                                 
//JCLCNTL INCLUDE MEMBER=PROC2                                          
//*   INCLUDE MEMBER=PROC1     
//STEP020  EXEC PROC1,SHDW=VAST                                     
//*                                                                 
