//JOB2 JOB (051000,321),'                ',CLASS=A,          
//             MSGCLASS=Y                                    
/*JOBPARM SYSAFF=ANY                                         
//*                                                          
//*                                                          
//JOBLIB  DD DSN=DDSHR.RESCUE,DISP=SHR                       
//        DD DSN=DDSHR.CICSLOAD,DISP=SHR                     
//*                                                          
//*   INCLUDE MEMBER=UNKN1                                   
//STEP020  EXEC UNKN1,SHDW=VAST                           
//*                                                          
//*   INCLUDE MEMBER=PROC1                                   
//ABEND INCLUDE MEMBER=ABEND    
//STEP030  EXEC PROC1,SHDW=VAST                              
//*                                                          
