100400 IDENTIFICATION DIVISION.
100700 PROGRAM-ID.     NDT3043.
100800 AUTHOR.         XXXXXXX.
100900 DATE-WRITTEN.   JUNE 2021.
101000 DATE-COMPILED.
101300 ENVIRONMENT DIVISION.
101600 CONFIGURATION SECTION.
102600 INPUT-OUTPUT SECTION.
107100 WORKING-STORAGE SECTION.
145700 PROCEDURE DIVISION.
147500 MAIN-PROGRAM SECTION.
148200     PERFORM  1010-BEGIN-ROUTINE THRU
148300              1010-BEGIN-ROUTINE-EXIT.
149400     STOP RUN.
149700********************
149800 1010-BEGIN-ROUTINE.
149900********************
150600      PERFORM 900-READ-BATCH-FILE THRU
150700              900-READ-BATCH-FILE-EXIT.
151300 1010-BEGIN-ROUTINE-EXIT.
151400    EXIT.
198700 900-READ-BATCH-FILE.
201000        DISPLAY "/// PROBLEM WITH WRITE ///"
201100        DISPLAY "GIVE WFL TO COREY"
201200        EXEC SQL
201300             DISCONNECT
201400        END-EXEC
201500        STOP RUN 1.
201800 900-READ-BATCH-FILE-EXIT.
201900     EXIT.
213100 999-END.
213200     EXIT.
