DEFINE DATA 
LOCAL
	1 #PROG1 (A8) INIT <'MAIN3'>
	1 #PROG2 (A8) CONST <'MAIN4'>
	1 #VAR1 (A1)
	1 #VAR2 (A1)
	1 #VAR3 (A12)
	1 #VAR4 (A4)
END-DEFINE

CALLNAT #PROG1

CALLNAT #PROG2

CALLNAT #VAR3

CALLNAT 'MAINB' 

END 