  M4028A: PROC(IO_PTR_PCB, DB_PTR_MAST) OPTIONS(MAIN);
  
    DCL IO_PTR_PCB POINTER;
    DCL DB_PTR_MAST POINTER;
    DCL DET_SEG_IO_AREA CHAR(100);
    DCL 1    QUAL_SSA           STATIC UNALIGNED, 
         2   SEG_NAME       CHAR(8) INIT('ROOT    '),
         2   SEG_QUAL       CHAR(1) INIT('('),
         2   SEG_KEY_NAME   CHAR(8) INIT('KEY    '),
         2   SEG_OPR        CHAR(2) INIT(' ='),
         2   SEG_KEY_VALUE  CHAR(6) INIT('vvvvv'),
         2   SEG_END_CHAR   CHAR(1) INIT(')');
    
    CALL PLITDLI (3, 'GU', DB_PTR_MAST, DET_SEG_IO_AREA);
    CALL PLITDLI (3, 'GHU', DB_PTR_MAST, DET_SEG_IO_AREA);
    CALL PLITDLI (3, 'GN', DB_PTR_MAST, DET_SEG_IO_AREA);
    CALL PLITDLI (3, 'GHN', DB_PTR_MAST, DET_SEG_IO_AREA);
    CALL PLITDLI (3, 'GNP', DB_PTR_MAST, DET_SEG_IO_AREA);
    CALL PLITDLI (3, 'GHNP', DB_PTR_MAST, DET_SEG_IO_AREA);
    CALL PLITDLI (3, 'ISRT', DB_PTR_MAST, DET_SEG_IO_AREA);
    CALL PLITDLI (3, 'DLET', DB_PTR_MAST, DET_SEG_IO_AREA, QUAL_SSA);
    CALL PLITDLI (3, 'REPL', DB_PTR_MAST, DET_SEG_IO_AREA);
    CALL PLITDLI (3, 'CHKP', IO_PCB_PNTR, DET_SEG_IO_AREA);
    CALL PLITDLI (3, 'XRST', IO_PCB_PNTR, 100, DET_SEG_IO_AREA);
    CALL PLITDLI (3, 'PCB', '*', DB_PTR_MAST);
    CALL PLITDLI (3, 'ROLB', DB_PTR_MAST, DET_SEG_IO_AREA);
   
  END;