  M4028B: PROC(IO_PTR_PCB, DB_PTR_MAST) OPTIONS(MAIN);
  
    DCL IO_PTR_PCB POINTER;
    DCL DB_PTR_MAST POINTER;
    DCL DET_SEG_IO_AREA CHAR(100);
    DCL AIB_MASK CHAR(120);
    
    DCL FUNC_GU   CHAR(4) INIT('GU  ');
    DCL FUNC_GHU  CHAR(4) INIT('GHU ');
    DCL FUNC_GHN  CHAR(4) VALUE('GHN ');
    DCL FUNC_GNP  CHAR(4) VALUE('GNP ');
    DCL FUNC_GHNP CHAR(4) VALUE('GHNP');
    DCL FUNC_ISRT CHAR(4) VALUE('ISRT');
    DCL FUNC_DLET CHAR(4) VALUE('DLET');
    DCL FUNC_REPL CHAR(4) VALUE('REPL');
    DCL FUNC_CHKP CHAR(4) VALUE('CHKP');
    DCL FUNC_XRST CHAR(4) VALUE('XRST');
    DCL FUNC_PCB  CHAR(4) VALUE('PCB ');
  
    CALL PLITDLI (3, FUNC_GU, DB_PTR_MAST, DET_SEG_IO_AREA);
    CALL PLITDLI (3, FUNC_MISSING, DB_PTR_MAST, DET_SEG_IO_AREA);
    CALL AIBTDLI (3, FUNC_GNP, AIB_MASK, DET_SEG_IO_AREA);
    
    CALL MY_PROC;
    
    MY_PROC: PROC;
      DCL FUNC_GN   CHAR(4) VALUE('GN  ');
      
      CALL PLITDLI (3, FUNC_ISRT, DB_PTR_MAST, DET_SEG_IO_AREA);
      
      CALL MY_PROC_1;
      
      MY_PROC_1: PROC;
        CALL PLITDLI (3, FUNC_GN, DB_PTR_MAST, DET_SEG_IO_AREA);
        CALL CEETDLI (3, FUNC_REPL, DB_PTR_MAST, DET_SEG_IO_AREA);
      END MY_PROC_1;
    END MY_PROC;
   
  END;