  M4028D: PROC(IO_PTR_PCB, DB_PTR_MAST) OPTIONS(MAIN);
  
    DCL IO_PTR_PCB POINTER;
    DCL DB_PTR_MAST POINTER;
    DCL FUNC_PTR POINTER;
    DCL DET_SEG_IO_AREA CHAR(100);
    DCL AIB_MASK CHAR(120);
    
    DCL FUNC_GU   CHAR(4);
    DCL FUNC_ISRT CHAR(4);
    DCL 1 DLI_FUNC,
          2 FUNC_DLET CHAR(4),
          2 FUNC_REPL CHAR(4);
    DCL FUNC_ROLB CHAR(4) BASED;
  
    FUNC_GU = 'GU  ';
    CALL PLITDLI (3, FUNC_GU, DB_PTR_MAST, DET_SEG_IO_AREA);
    FUNC_GU = 'XXXX';
    FUNC_ISRT = 'ISRT';
    FUNC_PTR->FUNC_ROLB = 'ROLB';
    
    CALL MY_PROC;
    
    MY_PROC: PROC;
      DLI_FUNC.FUNC_DLET = 'DLET';
      FUNC_REPL = 'REPL';
      ONLY_ASSGN = 'GHN ';
      
      CALL PLITDLI (3, FUNC_ISRT, DB_PTR_MAST, DET_SEG_IO_AREA);
      CALL PLITDLI (3, ONLY_ASSGN, DB_PTR_MAST, DET_SEG_IO_AREA);
      
      CALL MY_PROC_1;
      
      MY_PROC_1: PROC;
        CALL PLITDLI (3, DLI_FUNC.FUNC_DLET, DB_PTR_MAST, DET_SEG_IO_AREA);
        CALL PLITDLI (3, DLI_FUNC.FUNC_REPL, DB_PTR_MAST, DET_SEG_IO_AREA);
        CALL CEETDLI (3, FUNC_PTR->FUNC_ROLB, DB_PTR_MAST, DET_SEG_IO_AREA);
      END MY_PROC_1;
    END MY_PROC;
   
  END;