000610****************************************************************
000620 IDENTIFICATION DIVISION.
000630 
000680*
000690****************************************************************
000700****************************************************************
000710 
000720 PROGRAM-ID. CLM_ACC_BUD_14.
000750 
000760****************************************************************
000770 ENVIRONMENT DIVISION.
000780****************************************************************
000790 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER. VAX-11.
000810 OBJECT-COMPUTER. VAX-11.
000820*..........................................................................
000830 INPUT-OUTPUT SECTION.
000840*..........................................................................
000850 FILE-CONTROL.
000860 
000870 SELECT MEDICARE_EXTRACT_FILE
000880        ASSIGN TO MEDICARE_FILE_NAME
000890        RESERVE 64 AREAS
000900        ORGANIZATION IS LINE SEQUENTIAL
000910        ACCESS MODE IS SEQUENTIAL
000920        FILE STATUS IS MEDICARE_FILE_STATUS.
000930 
000940 SELECT CLM_ACC_IMP_EXP_FILE
000950        ASSIGN TO IMP_EXP_FILE_NAME
000960        RESERVE 32 AREAS
000970        ORGANIZATION IS INDEXED
000980        ACCESS MODE IS DYNAMIC
000990        RECORD KEY IS CLM_ACC_IE_KEY0
001000        FILE STATUS IS IMP_EXP_FILE_STATUS.
001010 
001020 SELECT REPORT_LISTING_FILE
001030        ASSIGN TO REPORT_FILE_NAME
001040        RESERVE 64 AREAS
001050        ORGANIZATION IS LINE SEQUENTIAL
001060        ACCESS MODE IS SEQUENTIAL
001070        FILE STATUS IS REPORT_FILE_STATUS.
001080 
001090 SELECT EXCEL_LISTING_FILE
001100        ASSIGN TO EXCEL_FILE_NAME
001110        RESERVE 64 AREAS
001120        ORGANIZATION IS LINE SEQUENTIAL
001130        ACCESS MODE IS SEQUENTIAL
001140        FILE STATUS IS EXCEL_FILE_STATUS.
001150 
001160 
001170 I-O-CONTROL.
001180     APPLY LOCK-HOLDING ON
001190                MEDICARE_EXTRACT_FILE
001200                CLM_ACC_IMP_EXP_FILE
001210                REPORT_LISTING_FILE
001220                EXCEL_LISTING_FILE.
001230 
001240 
001250 
001260****************************************************************
001270 DATA DIVISION.
001280****************************************************************
001290 FILE SECTION.
001300 
001310 
001320* SELECT AND OTHER SQL LOG STUFF...
001330*  PLAN   COVTP   BAQCD        SUID
001340*  ----   -----   -----      ------
001350*  193    MED     HSA          8231
001360*  19E    MED     HSA          8175
001370*  20W    MED     HSA          8332
001380*  53D    MED     HSA          7120
001390*  53E    MED     HSA          7121
001400*  62Y    MED     HSA          7580
001410* -XXX----MED-----HSA--------ZZZZZ9
001420 
001430 FD  MEDICARE_EXTRACT_FILE
001440      VALUE OF FILE-ID IS MEDICARE_FILE_NAME
001450       RECORD VARYING IN SIZE FROM 0 TO 80
001460        DEPENDING ON MEDICARE_RECORD_LENGTH.
001470 01  MEDICARE_EXTRACT_RECORD.
001480     03  MEDICARE_FIL_1ST    PIC X(1).
001490     03  MEDICARE_PLAN_CODE  PIC X(3)BBBB.
001500     03  MEDICARE_MED_CONST  PIC X(3)BBBBB.
001510     03  MEDICARE_MA_CONST   PIC X(8)BBBBBBBBB.
001520     03  MEDICARE_SUID_NUM   PIC ZZZZZ9.
001530     03  MEDICARE_FIL_END    PIC X(30).
001540 
001550 
001560 FD  CLM_ACC_IMP_EXP_FILE
001570      VALUE OF FILE-ID IS IMP_EXP_FILE_NAME.
001580 COPY CLM-CLM_ACC_IMP_EXP.
001590 
001600 
001610 FD  REPORT_LISTING_FILE
001620      VALUE OF FILE-ID IS REPORT_FILE_NAME
001630       RECORD VARYING IN SIZE FROM 0 TO 132
001640        DEPENDING ON REPORT_RECORD_LENGTH.
001650 01  REPORT_LISTING_LINE         PIC X(132).
001660 
001670 
001680 FD  EXCEL_LISTING_FILE
001690      VALUE OF FILE-ID IS EXCEL_FILE_NAME
001700       RECORD VARYING IN SIZE FROM 0 TO 200
001710        DEPENDING ON EXCEL_RECORD_LENGTH.
001720 01  EXCEL_LISTING_RECORD         PIC X(200).
001730 
001740 
001750 
001760****************************************************************
001770 WORKING-STORAGE SECTION.
001780****************************************************************
001790 
001800 01  CURRENT_CCYYMMDD            PIC 9(8)  VALUE ZEROES.
001810 01  CURRENT_HHMMSSMM            PIC 9(8)  VALUE ZEROES.
001820 01  CURRENT_VMS_USER            PIC X(16) VALUE SPACES.
001830 01  WS_SYS             PIC X(3)  VALUE "SYS".
001840 
001850 01  ITEM_LENGTH                 PIC S9(9) COMP VALUE ZEROES.
001860 01  ITEM_USERNAME               PIC S9(9) COMP VALUE EXTERNAL
IWCONT JPI$_USERNAME.
001870 
001880 01  CMM_TIER_EXP                PIC X(12) VALUE "CMM_TIER_EXP".
001890 
001900 01  LOWER_CASE     PIC X(26)    VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ
IWCONT-"".
001910 01  UPPER_CASE     PIC X(26)    VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ
IWCONT-"".
001920 
001930 01  TOTAL_ACTIVITY_ERRORS.
001940     03  TOTAL_MEDICARE_PLAN_CODES     PIC 9(5) VALUE ZEROES.
001950     03  TOTAL_IMP_EXP_REVIEWED         PIC 9(5) VALUE ZEROES.
001960     03  TOTAL_IMP_EXP_NON_MED          PIC 9(5) VALUE ZEROES.
001970     03  TOTAL_IMP_EXP_MED_OK           PIC 9(5) VALUE ZEROES.
001980     03  TOTAL_IMP_EXP_UPDATED          PIC 9(5) VALUE ZEROES.
001990     03  TOTAL_IMP_EXP_MISSING          PIC 9(5) VALUE ZEROES.
002000     03  TOTAL_BAQ_DB_MISSING          PIC 9(5) VALUE ZEROES.
002010 
002020 
002030 
002040****************************************************************
002050* Process ici date & time conversions
002060****************************************************************
002070 
002080 01  CURRENT_ICIDATE             PIC S9(9) COMP VALUE ZEROES.
002090 01  CURRENT_ICITIME             PIC S9(9) COMP VALUE ZEROES.
002100 
002110 01  CVT_DATE_ICIDATE.
002120     03  CVT_DATE_ICICOMP        PIC S9(9) COMP VALUE ZEROES.
002130 01  CVT_DATE_CCYYMMDD.
002140     03  CVT_DATE_CC             PIC 9(2)  VALUE ZEROES.
002150     03  CVT_DATE_YY             PIC 9(2)  VALUE ZEROES.
002160     03  CVT_DATE_MM             PIC 9(2)  VALUE ZEROES.
002170     03  CVT_DATE_DD             PIC 9(2)  VALUE ZEROES.
002180 
002190 01  CVT_DATE_COMP               PIC 9(4)  COMP VALUE 0.
002200 01  FILLER            REDEFINES CVT_DATE_COMP.
002210     03  CVT_DATE_BIN            PIC X(1).
002220     03  FILLER                  PIC X(1).
002230 
002240 
002250 
002260****************************************************************
002270* Clm_Acc_Imp_Exp --- Input
002280*        CMM_TIER_EXP (128)  PLAN_CD=PLAN_CD  MED=YES/NO
002290****************************************************************
002300 
002310 01  TABLED_MAXS.
002320     03  MED_MAX            PIC 9(5) VALUE 1000.
002330 
002340 01  TABLED_MED_PLAN_CODES.
002350     03  TBL_MED_ENTRY.
002360         05  TBL_MED_PLAN_CD      PIC X(3).
002370         05  TBL_MED_USED_CD      PIC X(1).
002380     03  TBL_MED_ENTRIES   OCCURS 1000 TIMES
002390           ASCENDING KEY   TBL_MED_PLAN_CDS
002400             INDEXED BY    MED_IDX MED_BLD.
002410         05  TBL_MED_PLAN_CDS     PIC X(3).
002420         05  TBL_MED_USED_CDS     PIC X(1).
002430 
002440 
002450****************************************************************
002460*
002470* 2007/08/02               HEALTHNET - CLAIMS PROCESSING          CLM_ACC_BUD_14
002480*   10:15             MED UPDATED - CLM_ACC_IMP_EXP CMM_TIER_EXP          PAGE   1
002490*
002500*  CODE   PCD  TIR  SVC    MED    ADJ    GE6    GE7        MESSAGE
002510*  ------ ---- ---- ------ ------ ------ ------ ---------- ---------------------
002520*  19321  193  2    9002   Y      D             DTNDED
002530*  19322  193  2    3020   Y      O             DTNOOP
002540*  19333  193  3    9002   Y      D             DTNDED
002550*  19334  193  3    3030   Y      O             DTNOOP
002560*  46N11  46N  1    9001          L             MAB
002570*  46N12  46N  1    9030          B             MAB
002580*  ------ ---- ---- ------ ------ ------ ------ ---------- ---------------------
002590*  <END-OF-REPORT>
002600* 1...5...10...15...20...25...30...35...40...45...50...55...60...65...70...75...80
002610*
002620****************************************************************
002630*
002640* 1...5...10...15...20...25...30...35...40...45...50...55...60...65...70...75...80...85...90...95...100
002650* 10/10/2007                           HEALTHNET - CLAIMS PROCESSING                    CLM_ACC_BUD_14
002660*   23:51                        MED UPDATED - CLM_ACC_IMP_EXP CMM_TIER_EXP                   PAGE     1
002670* 1...5...10...15...20...25...30...35...40...45...50...55...60...65...70...75...80...85...90...95...100
002680* CODE   PCD  TIR  SVC    MED    STATUS MESSAGE         ERROR MESSAGE
002690* ------ ---- ---- ------ ------ ---------------------- ----------------------------------------------
002700* 82R                               *** ERROR ***       MED PLAN CODE MISSING FROM CMM_TIER_EXP TABLE
002710* 19322  193  2    3020   Y      MED FLAG UPDATED TO Y
002720* 99999  999  2    3020   Y         *** ERROR ***       MED PLAN CODE WITH NO MATCHING BENEFITS BAQ
002730*
002740****************************************************************
002750 
002760 01  REPORT_ACTIVITY_ERRORS.
002770 
002780     03  REPORT_HEADING_ONE.
002790         05  RPT_HDR_DATE       PIC 9999/99/99  VALUE SPACES.
002800         05  FIL                PIC X(27) VALUE SPACES.
002810         05  RPT_HDR_SYSTEM     PIC X(30) VALUE "HEALTHNET - CLAIM
IWCONT-"S PROCESSING ".
002820         05  FIL                PIC X(19) VALUE SPACES.
002830         05  RPT_HDR_PROGRAM    PIC X(14) VALUE "CLM_ACC_BUD_14".
002840 
002850     03  REPORT_HEADING_TWO.
002860         05  FIL                PIC X(2)  VALUE SPACES.
002870         05  RPT_HDR_TIME       PIC 99,99 VALUE SPACES.
002880         05  FIL                PIC X(24) VALUE SPACES.
002890         05  RPT_HDR_TITLE      PIC X(40)
002900                         VALUE "MED UPDATED - ACC_IMP_EXP CMM_TIER
IWCONT-"_EXP".
002910         05  FIL                PIC X(19) VALUE SPACES.
002920         05  FIL                PIC X(6)  VALUE "PAGE".
002930         05  RPT_HDR_PAGE       PIC ---9  VALUE SPACES.
002940 
002950     03  REPORT_DETAILS.
002960         05  RPT_FILLER         PIC X(1)   VALUE SPACES.
002970         05  RPT_TBL_PLAN_CD        PIC X(4)B  VALUE SPACES.
002980         05  RPT_TBL_TIR        PIC X(4)B  VALUE SPACES.
002990         05  RPT_TBL_SVC        PIC X(6)B  VALUE SPACES.
003000         05  RPT_TBL_MED        PIC X(6)B  VALUE SPACES.
003010         05  RPT_STATUS         PIC X(22)B VALUE SPACES.
003020         05  RPT_MESSAGE        PIC X(53)B VALUE SPACES.
003030 
003040 
003050 
003060****************************************************************
003070* File i/o controls
003080****************************************************************
003090 
003100 01  MEDICARE_FILE_CONTROLS.
003130     03  MEDICARE_FILE_NAME          PIC X(64) VALUE "MED_PLAN_COD
IWCONT-"ES".
