sub2: proc (U,V);
    dcl (U,V) character (20),
        (sub3,func3) entry;
	    
    call sub3 (U,V);       /* external from PRG3 */
    result = func3 (U,V);  /* internal or external from PRG3? */
end sub2;

func2: proc (U,V) returns returns (character (20));
    dcl (U,V) character (20);
	
	return 1;
end func2;