DEFINE DATA LOCAL
	1 #A (L)
END-DEFINE

IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF

IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF

IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF

IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF

IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF
IF #A EQ TRUE
	WRITE 'hello'
END-IF

END