000100*    Datenstruktur für Tabelle LA_INKGKSTAND                      00010000
000200     25 LADTIA0A-KEY.                                             00020000
000300        30 INKGKNR              PIC S9(17)V USAGE COMP-3.         00030000
000400        30 FILLER               PIC  X(3).                        00040000
000500        30 LFDNRINKGK           PIC S9(4) USAGE COMP.             00050000
000600        30 FILLER               PIC  X(2).                        00060000
000700        30 BEARBABKNR           PIC S9(9) USAGE COMP.             00070000
000800        30 BSINKGKKZ            PIC S9(4) USAGE COMP.             00080000
000900        30 FILLER               PIC  X(2).                        00090000
001000        30 ABGANGABKNR          PIC S9(9) USAGE COMP.             00100000
001100     25 LADTIA0A-DATA.                                            00110000
001200        30 PARTNROLLEKZ         PIC S9(4) USAGE COMP.             00120000
001300        30 FILLER               PIC  X(2).                        00130000
001400        30 LFDNRPARTNROLLE      PIC S9(4) USAGE COMP.             00140000
001500        30 FILLER               PIC  X(2).                        00150000
001600        30 ANFORDARTGKKZ        PIC S9(4) USAGE COMP.             00160000
001700        30 FILLER               PIC  X(2).                        00170000
001800        30 ABRECHWAEHKZ         PIC S9(4) USAGE COMP.             00180000
001900        30 FILLER               PIC  X(2).                        00190000
002000        30 TERMININKLAUFKZ      PIC S9(4) USAGE COMP.             00200000
002100        30 FILLER               PIC  X(2).                        00210000
002200        30 DTAJN                PIC  X(1).                        00220000
002300        30 FILLER               PIC  X(3).                        00230000
002400        30 SOLLSTELLUNGNEGJN    PIC  X(1).                        00240000
002500        30 FILLER               PIC  X(3).                        00250000
002600        30 MAHNVERSCHIEBKZ      PIC S9(4) USAGE COMP.             00260000
002700        30 FILLER               PIC  X(2).                        00270000
002800        30 MAHNVERSCHIEBZEITR   PIC S9(4) USAGE COMP.             00280000
002900        30 FILLER               PIC  X(2).                        00290000
003000        30 RECHVERSCHIEBKZ      PIC S9(4) USAGE COMP.             00300000
003100        30 FILLER               PIC  X(2).                        00310000
003200        30 RECHVERSCHIEBZEITR   PIC S9(4) USAGE COMP.             00320000
003300        30 FILLER               PIC  X(2).                        00330000
003400        30 DATENTRAEGERNR       PIC S9(4) USAGE COMP.             00340000
003500        30 FILLER               PIC  X(2).                        00350000
003600        30 LSVARTKZ             PIC S9(4) USAGE COMP.             00360000
003700        30 FILLER               PIC  X(2).                        00370000
003800        30 LSVKONTOHINWEISKZ    PIC S9(4) USAGE COMP.             00380000
003900        30 FILLER               PIC  X(2).                        00390000
004000        30 ZAHLWEGLSRETOUREKZ   PIC S9(4) USAGE COMP.             00400000
004100        30 FILLER               PIC  X(2).                        00410000
004200        30 INKSTELLEKZ          PIC S9(4) USAGE COMP.             00420000
004300        30 FILLER               PIC  X(2).                        00430000
004400        30 FINGIERTERBEGMONAT   PIC S9(4) USAGE COMP.             00440000
004500        30 FILLER               PIC  X(2).                        00450000
004600        30 ZAHLWEISE            PIC S9(4) USAGE COMP.             00460000
004700        30 FILLER               PIC  X(2).                        00470000
