000100*    Datenstruktur für Tabelle LA_ABKBEARBNACHW                   00010000
000200     25 LADTBW0A-KEY.                                             00020000
000300        30 ABKNR                PIC S9(17)V USAGE COMP-3.         00030000
000400        30 FILLER               PIC  X(3).                        00040000
000500        30 BEARBABKNR           PIC S9(9) USAGE COMP.             00050000
000600        30 BSABKKZ              PIC S9(4) USAGE COMP.             00060000
000700        30 FILLER               PIC  X(2).                        00070000
000800     25 LADTBW0A-DATA.                                            00080000
000900        30 PERSONALNUMMER       PIC  X(6).                        00090000
001000        30 FILLER               PIC  X(2).                        00100000
001100        30 BEARBARTABKKZ        PIC S9(4) USAGE COMP.             00110000
001200        30 FILLER               PIC  X(2).                        00120000
001300        30 BEARBTYPABKKZ        PIC S9(4) USAGE COMP.             00130000
001400        30 FILLER               PIC  X(2).                        00140000
001500        30 BEARBGRUNDKZ         PIC S9(4) USAGE COMP.             00150000
001600        30 FILLER               PIC  X(2).                        00160000
001700        30 BEARBDAT             PIC  X(10).                       00170000
001800        30 FILLER               PIC  X(2).                        00180000
001900        30 WIRKBEGDAT           PIC  X(10).                       00190000
002000        30 FILLER               PIC  X(2).                        00200000
002100        30 WIRKENDDAT           PIC  X(10).                       00210000
002200        30 FILLER               PIC  X(2).                        00220000
002300        30 ANNULLNR             PIC S9(9) USAGE COMP.             00230000
002400        30 ANNULLDAT            PIC  X(10).                       00240000
002500        30 FILLER               PIC  X(2).                        00250000
002600        30 GEVOID               PIC S9(18)V USAGE COMP-3.         00260000
002700        30 FILLER               PIC  X(2).                        00270000
002800        30 GEVOTYPKZ            PIC S9(4) USAGE COMP.             00280000
002900        30 FILLER               PIC  X(2).                        00290000
003000        30 GEVOSUBTYPKZ         PIC S9(4) USAGE COMP.             00300000
003100        30 FILLER               PIC  X(2).                        00310000
