* comment 1
/* comment 2
/* comment 3 */
/!* multiline
    comment 4 *!/
* normal comment 5 again
DEFINE DATA
LOCAL  USING /!*
  
   a
    multi
      liner *!/
   MYLDA1                  /* MYLDA1
  LOCAL  USING MYLDA2 
LOCAL
  1 #FLD (A10) /* random comment 1
* 1 #NEW_GROUP                (A15)                         /*ABC 
* 1 #OLD_GROUP                (A15)                         /*ABC 
  1 #NEW_GROUP                (A20)                         /*ABC 
  1 #OLD_GROUP                (A20)                         /*ABC
END-DEFINE
* random comment 2
WRITE 'SOMETHING 1' /* random comment 3 */
/* random comment 4 */ WRITE 'SOMETHING 2'
END