//TESTPROC PROC MOD1='VPRDSSS',
                MOD2='VPRDSSS',
                MOD3='VPRDMIS'
//*
//*
//SSSSD100 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=&MOD3..PARMLIB(TESTCNTRLCARD), 
//            DISP=SHR
//*