
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    PROG1.
       PROCEDURE DIVISION.
           CALL 'PROG2'
           .
      *    --------------------------------------------------
