 WMIN4700B: PACKAGE EXPORTS(*);
   DCL CALLME1 ENTRY returns (bin float(21)) EXTERNAL;
  DCL CALLME2 ENTRY returns (bin float(21)) EXTERNAL;

 main: PROC(PARAM1,PARAM2);
   DCL PARAM1 CHAR(10);
   PARAM1 = CALLME1(CALLME2(1,2,3),2,3);
 END main;
 END WMIN4700B;
  