 WMIN4700C: PACKAGE EXPORTS(*);

   CALLME1: PROC (U,V,W)
               returns (bin float(21));
      PUT SKIP LIST(PARAM2);
   END CALLME1;
   
   CALLME2: PROC (U,V,W)
               returns (bin float(21));
      PUT SKIP LIST(PARAM2);
   END CALLME2;

 END WMIN4700C;
  