       IDENTIFICATION DIVISION.
       PROGRAM-ID.    WDIS256B.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  XXXFLD PIC X(1).
       COPY "CDD_REC.ACE_BENDATA" FROM DICTIONARY.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
           GOBACK.
