       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

       DATA DIVISION.
          WORKING-STORAGE SECTION.
          COPY WMIN10724COPYBOOK.
          01 WS-STUDENT-GRADE PIC 9(4) VALUE 1000.
          01 WS-STUDENT-SUBJECT PIC 9(4) VALUE 1000.

       PROCEDURE DIVISION.
          DISPLAY 'Student Id : ' WS-STUDENT-ID
          DISPLAY 'Student GRADE : ' WS-STUDENT-GRADE
          DISPLAY 'Student SUB : ' WS-STUDENT-SUBJECT
       STOP RUN.
