       IDENTIFICATION DIVISION.
       PROGRAM-ID. UTIL.

       DATA DIVISION.
          LINKAGE SECTION.
          01 LS-STUDENT-ID PIC 9(4).
          01 LS-STUDENT-GRADE PIC A(15).
          01 LS-STUDENT-SCORE PIC 9(4).

       PROCEDURE DIVISION USING LS-STUDENT-ID.
          DISPLAY 'In Called Sub Program'.
          MOVE 'A' TO LS-STUDENT-GRADE.
          MOVE 478 TO LS-STUDENT-SCORE.
          PERFORM STUDENT-GRADE-CALC.

          STUDENT-GRADE-CALC.
           DISPLAY LS-STUDENT-GRADE.
           DISPLAY LS-STUDENT-ID.
       EXIT PROGRAM.
