  %INCLUDE COPYBOOK;                                                    00280040
 DCL EXPROC EXTERNAL ENTRY;                                             00280040
                                                                        00280040
 EXPROC_ROUTINE: PROC REORDER;                                          00280040
                                                                        00280040
  CALL EXPROC;                                                          00280040
                                                                        00280040
 END EXPROC_ROUTINE;                                                    00280040
