//MGOJOB2 JOB ,XXXXX,CLASS=J                                            00001**2    
//***************************************************************       00068   
//STEP050 EXEC PGM=MGOPROG1                                                    
//SYSDUMP  DD   SYSOUT=*                                                        
//SYSOUT   DD   SYSOUT=*                                                        
//SYSPRINT DD   SYSOUT=*                                                        
//INPUT    DD DSN=WORK.MGOFILE1,                        
//            DISP=(OLD,DELETE,KEEP)                                            
//OUTPT    DD DUMMY,                                                            
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=80)                                
//***************************************************************       00068   
//STEP055 EXEC PGM=MGOPROG2                                                    
//SYSDUMP  DD   SYSOUT=*                                                        
//SYSOUT   DD   SYSOUT=*                                                        
//SYSPRINT DD   SYSOUT=*                                                        
//INPUT    DD DSN=WORK.MGOFILE2,                        
//            DISP=(OLD,DELETE,KEEP)                                            
//OUTPT    DD DUMMY,                                                            
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=80)                                
//**********************************************************************00082000
//STEP060  EXEC PGM=ABEND99,COND=(4,EQ,STEP050)                                 
//SYSUDUMP DD   SYSOUT=*                                                        
//**********************************************************************00082000                                                                  00012001
//STEP069  EXEC PGM=ABEND99,COND=(4,EQ,STEP055)                                 
//SYSUDUMP DD   SYSOUT=*                                                                                                                                          00076   
