//PWCBIPT2 JOB ('D7C6390001,00000000'),'CARES TECHNICIAN',
//         MSGLEVEL=(1,1),CLASS=H,MSGCLASS=J,REGION=4096K,
//         TIME=(10,0),LINES=999999
//*+JBS BIND DB2.D40P
/*ROUTE PRINT U6
//JOBLIB  DD  DSN=ITSDBCP.DB2.DSNLOAD,DISP=SHR
//     JCLLIB ORDER=(DWDCDP.PROD.PROCLIB)
//EOS    OUTPUT JESDS=ALL,DEFAULT=N,CLASS=0
/*JOBPARM  ROOM=B244
//*E.O.S-VERIFY-FORM=CEOM
//**********************************************************************00000700
//PROC1    EXEC PWCBI902,
//             ENVID=P,
//             ENV=PROD,
//             NEWGEN='(+1)',
//             DB2CNTL=CCBI902A,
//             CNTLB=CCBI902B,
//             CNTLC=CCBI902C,
//             SP902RX='(500,100)',
//             PARMFILE=PARMDATA.EOM,
//             SYSOUT=*,
//             ABENDAID=Y,
//             CEEDUMP=Y
//*
//**************************** END OF JOB ******************************
