//*--------------------------------------------------------------------*
//*    THIS PROC IS CALLED BY JOB PWCBIPT2 (MONTHLY - EOM CYCLE)
//*--------------------------------------------------------------------*
//PWCBI902 PROC
//STEP040  EXEC PGM=SORT,COND=(0,NE,STEP030)
//SORTIN   DD DSN=DWDCARE&ENVID..CARER.FOURC.MLY.CRBI902A&NEWGEN,
//            DISP=SHR
//SORTOF01 DD DSN=&&TEMPHDR,
//            DISP=(,PASS,DELETE),
//            SPACE=(CYL,&SP902RX,RLSE)
//SORTOF02 DD DSN=&&TEMPDATA,
//            DISP=(,PASS,DELETE),
//            DCB=(RECFM=FBA,LRECL=310,BLKSIZE=0),
//*************************** END OF PROC ******************************
