 MAINP: PROC OPTIONS(MAIN);
  CALL Z;
  Z: procedure (x ,y ,z) returns (float binary(24));
   declare (x,y,z) float binary(24);
   return (x * x + 2 * Y + z);
 end MAINP;