       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN537UI1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.

           GOBACK.
