       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN537UI4.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.

      * SEND CONTROL
           EXEC CICS SEND CONTROL ERASE FREEKB
           END-EXEC

           GOBACK.
