DEFINE DATA
LOCAL
1 #INT2 (N4)
1 #INT3 (I4)
1 #E (N1)
1 #P (N1)
1 #F (N1)
1 #D (N1)
1 #A (N1)
1 #B (N1)
1 H (N1)
1 #I (N1)
1 CDE (N1)
1 C (N1)
1 D (N1)
1 ABCD (N1)
1 ABC (N1)
1 AB (N1)
1 T (N1)
END-DEFINE
ADD 3 + 2 TO #A
Compute H := #I + #A * #D
Compute CDE := C + #INT2
COMPUTE ABCD := ABC + AB 
SUBTRACT #B FROM #INT2
SUBTRACT #INT2 FROM #P
ADD #A #B TO #I
DIVIDE 2 INTO T REMAINDER #F
DIVIDE D INTO C GIVING #E REMAINDER ABC
IF #P = 15
  SUBTRACT #INT3 FROM #P
END-IF
ADD 2 TO CDE
ADD 3 TO #INT2
ADD 2 TO H
ADD 3  TO ABCD
ADD 5 TO T
ADD 2 TO #F
WRITE 'the result of #P' #P
WRITE 'the result of #E' #E
END