       01 WS-MISC-VARS.
           05 WS-LAST-ACCT-NUM          PIC X(11) VALUE SPACES.
           05 WS-MONTHLY-INT            PIC S9(09)V99.
           05 WS-TOTAL-INT              PIC S9(09)V99.
           05 WS-FIRST-TIME             PIC X(01) VALUE 'Y'.