DEFINE DATA
 LOCAL
  1 XTD040-VIEW VIEW DDM8560  
   2 TELEFONNR (A60)
   2 MSN           (A16/12)
LOCAL USING Z1069--A
LOCAL USING Z1069--L
END-DEFINE
 
INCLUDE Z1069--C
 
FORMAT (1) PS=0

READ XTD040-VIEW BY ISN
	DELETE
	END TRANSACTION
END-READ

XTD040-VIEW.TELEFONNR := 'TEL0'
XTD040-VIEW.MSN(1) := 'MSN00'
XTD040-VIEW.MSN(2) := 'MSN01'
STORE XTD040-VIEW

XTD040-VIEW.TELEFONNR := 'TEL1'
XTD040-VIEW.MSN(1) := 'MSN10'
XTD040-VIEW.MSN(2) := 'MSN11'
STORE XTD040-VIEW

READ XTD040-VIEW BY ISN
	WRITE (1) NOTITLE NOHDR TELEFONNR
	WRITE (1) NOTITLE NOHDR MSN(*)
	
	RESET MSN(1)
	UPDATE
END-READ

READ XTD040-VIEW BY ISN
	WRITE (1) NOTITLE NOHDR TELEFONNR
	WRITE (1) NOTITLE NOHDR MSN(*)
END-READ
 
END