       01  DEPARTMENT-RECORD.
           05  DEPT-ID           PIC X(5).
           05  DEPT-NAME         PIC X(30).
           05  DEPT-SAL-BASE     PIC 9(6)V99.
           05  DEPT-CODE         PIC X(3).
           05  DEPT-EST-DATE     PIC X(10).
           05  OTHER-DETAIL.
               10  ADDRESS-DTL       PIC X(50).
               10  PHONE-NUMBER      PIC X(12).
