       01  EMPLOYEE-RECORD.
           05  EMPLOYEE-ID       PIC X(5).
           05  EMPLOYEE-NAME     PIC X(30).
           05  EMPLOYEE-SALARY   PIC 9(6)V99.
           05  EMPLOYEE-DEPT     PIC X(3).
           05  EMPLOYEE-DOB      PIC X(10).
           05  CORRESPONDENCE.
               10  ADDRESS-DTL       PIC X(50).
               10  PHONE-NUMBER      PIC X(12).
