DEFINE DATA
LOCAL
1 #DYNA (A10)
1 #WSEOF (A1)
END-DEFINE

READ WORK FILE 1 #DYNA
IF END-OF-FILE
#WSEOF := 'Y'
END-IF
END-WORK

DISPLAY *LENGTH(#DYNA) #DYNA (AL=40)

END