DEFINE DATA 
GLOBAL USING GDA1
LOCAL USING LDA1
LOCAL USING PDA1
LOCAL
	1 #PROG1 (A8) INIT <'MAIN3'>
	1 #PROG2 (A8) CONST <'MAIN4'>
	1 #VAR1 (A1)
	1 #VAR2 (A1)
	1 #VAR3 (A12)
	1 #VAR4 (I4)
	1 #A1 (A10)       /* Alphanumeric, 10 positions. 
	1 #A2 (B4)        /* Binary, 4 positions. 
	1 #A3 (P4)        /* Packed numeric, 4 positions and 1 sign position. 
	1 #A4 (N7.2)      /* Unpacked numeric,  
                  /* 7 positions before and 2 after decimal point. 
	1 #A5 (N7)       /* Invalid definition!!! 
	1 #A6 (P7.2)      /* Packed numeric, 7 positions before and 2 after decimal point  
                  /* and 1 sign position. 
	1 #INT1 (I1)      /* Integer, 1 byte. 
	1 #INT2 (I2)      /* Integer, 2 bytes. 
	1 #INT3 (I3)      /* Invalid definition!!! 
	1 #INT4 (I4)      /* Integer, 4 bytes. 
	1 #INT5 (I5)      /* Invalid definition!!! 
	1 #FLT4 (F4)      /* Floating point, 4 bytes. 
	1 #FLT8 (F8)      /* Floating point, 8 bytes. 
	1 #FLT2 (F2)      /* Invalid definition!!! 
	1 #DATE (D)       /* Date (internal format/length P6). 
	1 #TIME (T)       /* Time (internal format/length P12). 
	1 #VIEW VIEW EMPLOYEES
		2 NAME
END-DEFINE

WRITE #VIEW


INPUT USING MAP 'MAP1' #VAR3

INCLUDE CC1

CALL 'PROG1'

IF #PROG1 EQ ' '
	WRITE 'this is complex!'
END-IF 

END 