       IDENTIFICATION DIVISION.
       PROGRAM-ID.    MMRS7113.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  MY-INFO.
           COPY OVERLAP REPLACING ==KSDS_PRIMARY_INDEX== 
                               BY ==KSDS_PRIMARY_INDEX_LONGER==. 
       PROCEDURE DIVISION.
           DISPLAY 'Project: ' MMRS-M01-GLOBAL-NAME.
