           EXEC SQL DECLARE UTT_PRU_ORG TABLE                           
             ABC                        DECIMAL(11, 0) NOT NULL                         
           ) END-EXEC.                
       01  AAA.                                               
           10 ABC              PIC S9(11)V USAGE COMP-3.   
