DEFINE DATA PARAMETER
1 #GRP
	2 #A (A1)
END-DEFINE
DEFINE SUBROUTINE SUBR1
	WRITE 'hello'
	WRITE #A
	WRITE #GRP
	MOVE 'x' TO #GRP
END-SUBROUTINE
END 

