//MYJOB JOB (YTPR,64006106),CLASS=B,MSGCLASS=B
//*
//*                                                                     00030000
//* THIS IS SOME JOB DESCRIPTION                                        00050000
//*                                                                     00060000
//   JCLLIB ORDER=(MY.PROCLIB)
//*
//JOBLIB DD  DSN=SYS1.SCEERUN,DISP=SHR
//       DD  DSN=MY.LOADLIBB,DISP=SHR
//*
//**********************************************************************
//*                   CHANGE HISTORY
//**********************************************************************
//*  DATE        AUTHOR        MODIFICATIONS
//*  ----        ---------     -------------
//*  JAN-2011    ABCD          DID
//*                            SOME
//*                            CHANGES
//*
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**  THIS JCL EXTRACTS SOME DATA.                                    **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//*
//STEP01   EXEC SMTHNG
//OUT      DD  DSN=MY.RECORDS,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=SYSDA,
//             SPACE=(CYL,(1500,500)),
//             DCB=(DSCB1,LRECL=109,RECFM=FB,BLKSIZE=27904)
//OUT1     DD  DSN=MY.ERROR,
//             DISP=(NEW,CATLG,CATLG),
//             UNIT=SYSDA,
//             SPACE=(CYL,(10,06)),
//             DCB=(DSCB1,LRECL=181,RECFM=FB,BLKSIZE=27874)
//*
//* SOME COMMENT