DEFINE DATA
LOCAL
1 #FLD (A10)
1 #CURSOR (I4)
END-DEFINE

PRINT 'THIS GOES TO UI'
PRINT (0) 'THIS GOES TO UI'
PRINT (1) 'THIS DOES NOT GO TO UI'

END
