       IDENTIFICATION DIVISION.
       PROGRAM-ID. A.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT KSDSFILE ASSIGN TO  "KSDS"
               ORGANIZATION  IS  INDEXED
               ACCESS  MODE  IS  DYNAMIC
               RECORD  KEY   IS  PKEY
               FILE STATUS   IS  WS-FS.
       DATA DIVISION.
       FILE SECTION.
               COPY WMIN451D
       01 TESTFIELD PIC X(5).
       WORKING-STORAGE SECTION.
       01  MY-PROGRAM-NAME PIC X(10) VALUE 'A'.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
