DEFINE DATA
LOCAL
1 #FLD (A10)
1 #CURSOR (I4)
END-DEFINE

WRITE 'THIS GOES TO UI'
WRITE (0) 'THIS GOES TO UI'
WRITE (1) 'THIS DOES NOT GO TO UI'

END
