  VERIFY DATASET(VSAMU.MGO)                                             00100400
  DELETE VSAMU.MGO          CLUSTER                                     00100500
  DEFINE CLUSTER                                  -                     00100600
         (NAME(VSAMU.MGO)                         -                     00100700
          RECORDSIZE(428 428)                     -                     00100800
          CYLINDERS(650 100)                      -                     00100900
          VOLUMES(BPVS09)                         -                     00101000
          FREESPACE(10 10)                        -                     00101100
          SHAREOPTIONS(1 3)                       -                     00101200
          KEYS(20 0)                              -                     00101300
          CISZ(6144)                              -                     00101400
          SPEED                                   -                     00101500
          DATA(NAME(VSAMU.MGO.DATA))              -                     00101700
          INDEX(NAME(VSAMU.MGO.INDX)              -                     00101800
          CISZ(4096))                                                   00101900
