       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
001600
001390 01  PARAM1                         PIC X(78).
001390 01  PARAM2                         PIC X(78).
001780
001790 PROCEDURE DIVISION.
005340
000000     CALL "MY_BAS_FUN2" USING
000000                       BY DESCRIPTOR PARAM1 PARAM2
000000     CALL "SYS_TBL_FUN_14"      
000000     END-CALL.
000000
005350     EXIT PROGRAM.
