//MGOJOB2 JOB (0,1723),'COMMENT',CLASS=D                                 
//**********************************************************                                                                                                
//MGO0022 EXEC MGOSFTP,                                                                                                                                                          
//             SFTPUSER='ftp@my.server'                                                        
//*                                                                             