//M4018A JOB (20,FB3),'I',
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
// NOTIFY=&SYSUID,
// REGION=0M
//*
//STEP1 EXEC PGM=IKJEFT01
//SYSIN DD DSN=TEST.PDS(FILE),DISP=SHR
//SYSTSIN DD DSN=PROD.PDS(FILE),DISP=SHR
//*