M10414   FMT                                                            00010000
         DEV   TYPE=3270-A2,FEAT=IGNORE                                 00020000
         DIV   TYPE=INOUT                                               00022000
         DPAGE FILL=NULL,CURSOR=((2,2))                                 00023000
         DFLD  'HELLO WORLD',                                          C
               POS=(1,2),ATTR=(NUM,PROT,NORM),                         C
               EATTR=(CD,HD)
FLD1     DFLD  POS=(2,2),LTH=1                                          00024000
FLD2     DFLD  POS=(3,2),LTH=1,ATTR=(MOD)                               00026000
FLD3     DFLD  POS=(4,2),LTH=1                                          00026000
FLD4     DFLD  POS=(5,2),LTH=1,ATTR=(MOD)                               00026000
         FMTEND                                                         00028000
M10414O  MSG   TYPE=OUTPUT,SOR=(M10414,IGNORE),NXT=M10414I              00029000
         SEG                                                            00030000
         MFLD  FLD1,LTH=1                                               00040000
         MFLD  FLD2,LTH=1                                               00040000
         MFLD  FLD3,LTH=1                                               00040000
         MFLD  FLD4,LTH=1                                               00040000
         MSGEND                                                         00080000
M10414I  MSG   TYPE=INPUT,SOR=(M10414,IGNORE),NXT=M10414O               00090000
         SEG
         MFLD  VRBL
         MFLD  FLD1,LTH=1                                               00040000
         MFLD  FLD2,LTH=1                                               00040000
         MFLD  (FLD3,'Z'),LTH=1                                         00040000
         MFLD  (FLD4,'Z'),LTH=1                                         00040000
         MSGEND                                                         00110000
         END                                                            00120000
