 WMIN3020_SelectComparision: PROCEDURE OPTIONS(MAIN);
   select;
    when (A>B & B>C) call Bigger;
    when (A=B) call Same;
    otherwise call Smaller;
   end;
 END WMIN3020_SelectComparision;
