 WMIN3020_SelectGroup: PROCEDURE OPTIONS(MAIN);
    select (E);
       when (E1,E2,E3) action-1;
       when (E4,E5) action-2;
       otherwise action-n;
    end;
  
    select;
       when (A>B & C > D | E > F) call Bigger;
       when (A=B | D < F) call Same;
       otherwise call Smaller;
    end;
 END WMIN3020_SelectGroup;

