       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN2777_SECTION_EMPTY5.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
         SEC1 SECTION
           DISPLAY 'SEC1'
           GOBACK.
         SEC2 SECTION
         SEC3 SECTION