       IDENTIFICATION DIVISION.
       PROGRAM-ID.    WDIS-309.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  XXXFLD PIC X(1).
       COPY "CDD_REC:ACE_BENDATA" FROM DICTIONARY.
       COPY "CDD_REC.ACE_BENDATA" FROM DICTIONARY.
       COPY "CDA" FROM DICTIONARY.
       COPY "WDIS309" FROM DICTIONARY.
       COPY "WDIS309M" FROM DICTIONARY.
       
       LINKAGE SECTION.
       PROCEDURE DIVISION.
           GOBACK.
