%%INCLIB WELF.CONTROLM.PROD.AUTOEDIT %%INCMEM RUNCLASS                          
%%LIBSYM WELF.CONTROLM.PROD.SYMBOLS %%MEMSYM QSYMBOLS                           
//W123110P JOB (J00,068),'W123110P',                                            
//      MSGCLASS=A,PRTY=11,TIME=(30)                                            
//PROCPDS      JCLLIB  ORDER=WSETS.PROD.PROC                                    
//JS010   EXEC PROC010P,                                                        
//             SYSTEM='.PROD',                                                  
//             GROUP1='.PROD',                                                  
//             ENV='PROD',                                                      
//             RGNP=40M,                                                        
//             PMBR=D%%ODATE,                                                   
//             CKPTID=,                                                         
//             DUMMY='DUMMY,',                                                  
//             GENER1='+1',                                                     
//             GENER2='+1',                                                     
//             DISP1='(,CATLG,CATLG)',                                          
//             JOBNODE='W123110P',                                              
//             ALC1=%%SETSCYL,                                                  
//             CYLP=%%SETS10CYL,                                                
//             CYLPX=%%SETSEXT,                                                 
//             CYLS=%%SETS20CYL,                                                
//             CYLSX=%%SETSEXT,                                                 
//             LOGALC=%%SETSCYL,                                                
//             LOGCYLP=%%SETSLOGCYLP2,                                          
//             LOGCYLS=%%SETSLOGCYLS4,                                          
//             DBENV='PROD',                                                    
//             IRLMNM=IRLS,                                                     
//             MIN=30                                                           
//*                                                                             
