//**********************************************************                    
//W123010P PROC GROUP2='.PROD',                                                 
//             GROUP3='.PROD',                                                  
//             GROUP4='.PROD',                                                  
//             ENV=,                                                            
//             DBENV=,                                                          
//             RGNU=5M,                                                         
//             OUTDUMP=W,                                                       
//             DUMMY='DUMMY,',                                                  
//             SMBR=SQWE010B,                                                   
//             LOGUNIT=SYSDA,                                                   
//             UNIT1=SYSDA,                                                     
//             KW=DLI,                                                          
//             MBR=ABC010,                                                      
//             PSB=QWE010,                                                      
//             BUF=007,                                                         
//             SPIE=0,                                                          
//             TEST=0,                                                          
//             EXCPVR=0,                                                        
//             RST=0,                                                           
//             PRLD=,                                                           
//             SRCH=0,                                                          
//             CKPTID=,                                                         
//             MON=N,                                                           
//             LOGA=0,                                                          
//             FMTO=T,                                                          
//             IMSID=,                                                          
//             SWAP=,                                                           
//             DBRC=Y,                                                          
//             IRLM=Y,                                                          
//             IRLMNM=,                                                         
//             BKO=Y,                                                           
//             IMSCYL=1,                                                        
//             VSAM=QWE010,                                                     
//             MONDUMMY='DUMMY,',                                               
//             MODDSCB='MODCB',                                                 
//             LOGID=QWE010                                                     
//*                                                                                                            
//*                                                                             
//PS020   EXEC PGM=DFSRRC00,                                                    
//             REGION=&RGNP,                                                    
//             TIME=&MIN,                                                       
//             PARM=(&KW,&MBR,&PSB,&BUF,&SPIE&TEST&EXCPVR&RST,&PRLD,            
//             &SRCH,&CKPTID,&MON,&LOGA,&FMTO,&IMSID,&SWAP,&DBRC,               
//             &IRLM,&IRLMNM,&BKO)                                              
//*                                                                             
//DFSRESLB  DD DSN=IMSVS.SETS.&DBENV..RESLIB,DISP=SHR                           
//          DD DSN=IMSVS.SETS.&DBENV..DBARES,DISP=SHR                           
//*                                                                             
//STEPLIB   DD DSN=WSETS&GROUP1..LOAD,DISP=SHR                                  
//          DD DSN=WSETS&GROUP2..LOAD,DISP=SHR                                  
//          DD DSN=WSETS&GROUP3..LOAD,DISP=SHR                                  
//          DD DSN=WSETS&GROUP4..LOAD,DISP=SHR                                  
//          DD DSN=WSETS.PROD.LOAD,DISP=SHR                                     
//          DD DSN=IMSVS.SETS.&DBENV..RESLIB,DISP=SHR                           
//          DD DSN=IMSVS.SETS.&DBENV..DBARES,DISP=SHR                           
//*                                                                             
//IMS       DD DSN=WSETS.&DBENV..DBDLIB,DISP=SHR                                
//          DD DSN=WSETS.&DBENV..PSBLIB,DISP=SHR                                
//          DD DSN=WSETS&GROUP1..DBDLIB,DISP=SHR                                
//          DD DSN=WSETS&GROUP1..PSBLIB,DISP=SHR                                
//          DD DSN=WSETS&GROUP2..DBDLIB,DISP=SHR                                
//          DD DSN=WSETS&GROUP2..PSBLIB,DISP=SHR                                
//          DD DSN=WSETS&GROUP3..DBDLIB,DISP=SHR                                
//          DD DSN=WSETS&GROUP3..PSBLIB,DISP=SHR                                
//          DD DSN=WSETS&GROUP4..DBDLIB,DISP=SHR                                
//          DD DSN=WSETS&GROUP4..PSBLIB,DISP=SHR                                
//          DD DSN=WSETS.PROD.DBDLIB,DISP=SHR                                   
//          DD DSN=WSETS.PROD.PSBLIB,DISP=SHR                                   
//*                                                                             
//*  OSAM SEQUENTIAL BUFFERING LIBRARY                                          
//*                                                                             
//DFSCTL    DD DSN=WSETS&SYSTEM..PARM(DFSCTL),DISP=SHR                          
//*                                                                             
//IMSMON    DD &MONDUMMY.DSN=ABC6.&ENV..&LOGID..MONITOR(+1),                    
//             DISP=(,CATLG,CATLG),                                             
//             DCB=(&MODDSCB,RECFM=VBS,LRECL=3492,BLKSIZE=0),                   
//             UNIT=&UNIT1,SPACE=(&ALC1,(&IMSCYL,&IMSCYL),RLSE)                 
//*                                                                             
//IMSLOGR   DD &DUMMY.DSN=ABC6.&ENV..&LOGID..LOG(+0),                           
//             DISP=OLD,DCB=BUFNO=25                                            
//*                                                                             
//DFSVSAMP  DD DSN=WSETS&SYSTEM..PARM(&VSAM),DISP=SHR                           
//*******************************************                                   
//* INPUT DATASETS                          *                                   
//*******************************************                                   
//WXYZ0KGI  DD DSN=ABC6.QWE010SA.&ENV(&GENER1),DISP=SHR                         
//*                                                                             
//*******************************************                                   
//* OUTPUT DATASETS AND REPORTS             *                                   
//*******************************************                                   
//WXYZ0LGO  DD DSN=ABC6.QWE010FA.&ENV(&GENER2),                                 
//             DISP=&DISP1,UNIT=&UNIT1,                                         
//             DCB=(&MODDSCB,RECFM=FB,LRECL=150,BLKSIZE=0),                     
//             SPACE=(&ALC1,(&CYLPX&CYLP,&CYLSX&CYLS),RLSE)                     
//*                                                                             
//WXYZ7VGO  DD DSN=ABC6.QWE010CA.&ENV(&GENER2),                                 
//             DISP=&DISP1,UNIT=&UNIT1,                                         
//             DCB=(&MODDSCB,RECFM=FB,LRECL=104,BLKSIZE=0),                     
//             SPACE=(&ALC1,(&CYLPX&CYLP,&CYLSX&CYLS),RLSE)                     
//*                                                                             
//WXYZ67GO  DD DSN=ABC6.QFR036FA.&ENV..&JOBNODE,                                
//             DISP=&DISP1,UNIT=&UNIT1,                                         
//             DCB=(&MODDSCB,RECFM=FB,LRECL=260,BLKSIZE=0),                     
//             SPACE=(&ALC1,(&CYLPX&CYLP,&CYLSX&CYLS),RLSE)                     
//*                                                                             
//WXYZ93GO  DD DSN=ABC6.CAT013FA.&ENV..&JOBNODE,                                
//             DISP=&DISP1,UNIT=&UNIT1,                                         
//             DCB=(&MODDSCB,RECFM=FB,LRECL=300,BLKSIZE=0),                     
//             SPACE=(&ALC1,(&CYLPX&CYLP,&CYLSX&CYLS),RLSE)                     
//*                                                                             
//IEFRDER   DD DSN=ABC6.&ENV..&LOGID..LOG(+1),                                  
//             DISP=(,CATLG,CATLG),UNIT=&LOGUNIT,                               
//             DCB=(&MODDSCB,RECFM=VB,LRECL=27988,                              
//             BLKSIZE=0,BUFNO=25),                                             
//             SPACE=(&LOGALC,(&LOGCYLP,&LOGCYLS),RLSE)                         
//*                                                                             
//CAT011RX  DD SYSOUT=*                                                         
//*                                                                             
//CAT500FA  DD DSN=ABC6.CAT500FA.&ENV,DISP=SHR                                  
//CAT500FB  DD DSN=ABC6.CAT500FB.&ENV,DISP=SHR                                  
//CAT500RA  DD SYSOUT=*                                                         
//*                                                                             
//CAT505FA  DD DSN=WSETS&SYSTEM..PARM(&PMBR),DISP=SHR                           
//*                                                                             
//SYSOUT    DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSABOUT  DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSUDUMP  DD SYSOUT=&OUTDUMP                                                  
//SYSABEND  DD SYSOUT=*                                                         
//*                                                                             
//IMSERR    DD SYSOUT=*                                                         
//DEBUG     DD SYSOUT=*                                                         
//PRINTDD   DD SYSOUT=*                                                         
//*                                                                             
//*                                                                             
