   PRINT NOGEN                                                          00000100
*                                                                               
*PCBNAME=ABCD02PA                                                       00000200
         PCB   TYPE=DB,                                                X00000300
               DBDNAME=WXYZ02PA,                                       X00000400
               PROCOPT=GOTP,                                           X00000500
               KEYLEN=100                                               00000600
         SENSEG NAME=QRSTCASE,                                         X00000700
               PARENT=0                                                 00000800
         SENSEG NAME=QRSTPART,                                         X00000810
               PARENT=QRSTCASE                                          00000820
         SENSEG NAME=QRSTRELC,                                         X00000810
               PARENT=QRSTCASE                                          00000820
         SENSEG NAME=QRSTHIST,                                         X00000810
               PARENT=QRSTCASE                                          00000820
*                                                                               
*PCBNAME=ABCD02PB                                                       00000900
         PCB   TYPE=DB,                                                X00001000
               DBDNAME=WXYZ02PB,                                       X00001100
               PROCOPT=GOTP,                                           X00001200
               KEYLEN=100                                               00001300
         SENSEG NAME=QRSTCASE,                                         X00001400
               PARENT=0                                                 00001500
         SENSEG NAME=QRSTPART,                                         X00001510
               PARENT=QRSTCASE                                          00001520
         SENSEG NAME=QRSTRELC,                                         X00000810
               PARENT=QRSTCASE                                          00000820
         SENSEG NAME=QRSTHIST,                                         X00000810
               PARENT=QRSTCASE                                          00000820
*                                                                               
*PCBNAME=ABCD02PC                                                       00001600
         PCB   TYPE=DB,                                                X00001700
               DBDNAME=WXYZ02PC,                                       X00001800
               PROCOPT=GOTP,                                           X00001900
               KEYLEN=100                                               00002000
         SENSEG NAME=QRSTCASE,                                         X00002100
               PARENT=0                                                 00002200
         SENSEG NAME=QRSTPART,                                         X00002210
               PARENT=QRSTCASE                                          00002220
         SENSEG NAME=QRSTRELC,                                         X00000810
               PARENT=QRSTCASE                                          00000820
         SENSEG NAME=QRSTHIST,                                         X00000810
               PARENT=QRSTCASE                                          00000820
*                                                                               
*PCBNAME=ABCD02PD                                                       00002300
         PCB   TYPE=DB,                                                X00002400
               DBDNAME=WXYZ02PD,                                       X00002500
               PROCOPT=GOTP,                                           X00002600
               KEYLEN=100                                               00002700
         SENSEG NAME=QRSTCASE,                                         X00002800
               PARENT=0                                                 00002900
         SENSEG NAME=QRSTPART,                                         X00002910
               PARENT=QRSTCASE                                          00002920
         SENSEG NAME=QRSTRELC,                                         X00000810
               PARENT=QRSTCASE                                          00000820
         SENSEG NAME=QRSTHIST,                                         X00000810
               PARENT=QRSTCASE                                          00000820
*                                                                               
*PCBNAME=ABCD02PE                                                       00003000
         PCB   TYPE=DB,                                                X00003100
               DBDNAME=WXYZ02PE,                                       X00003200
               PROCOPT=GOTP,                                           X00003300
               KEYLEN=100                                               00003400
         SENSEG NAME=QRSTCASE,                                         X00003500
               PARENT=0                                                 00003600
         SENSEG NAME=QRSTPART,                                         X00003610
               PARENT=QRSTCASE                                          00003620
         SENSEG NAME=QRSTRELC,                                         X00000810
               PARENT=QRSTCASE                                          00000820
         SENSEG NAME=QRSTHIST,                                         X00000810
               PARENT=QRSTCASE                                          00000820
*                                                                               
*PCBNAME=ABCD02PF                                                       00003700
         PCB   TYPE=DB,                                                X00003800
               DBDNAME=WXYZ02PF,                                       X00003900
               PROCOPT=GOTP,                                           X00004000
               KEYLEN=100                                               00004100
         SENSEG NAME=QRSTCASE,                                         X00004200
               PARENT=0                                                 00004300
         SENSEG NAME=QRSTPART,                                         X00004310
               PARENT=QRSTCASE                                          00004320
         SENSEG NAME=QRSTRELC,                                         X00000810
               PARENT=QRSTCASE                                          00000820
         SENSEG NAME=QRSTHIST,                                         X00000810
               PARENT=QRSTCASE                                          00000820
*                                                                               
*PCBNAME=ABCD02PG                                                       00004400
         PCB   TYPE=DB,                                                X00004500
               DBDNAME=WXYZ02PG,                                       X00004600
               PROCOPT=GOTP,                                           X00004700
               KEYLEN=100                                               00004800
         SENSEG NAME=QRSTCASE,                                         X00004900
               PARENT=0                                                 00005000
         SENSEG NAME=QRSTPART,                                         X00005010
               PARENT=QRSTCASE                                          00005020
         SENSEG NAME=QRSTRELC,                                         X00000810
               PARENT=QRSTCASE                                          00000820
         SENSEG NAME=QRSTHIST,                                         X00000810
               PARENT=QRSTCASE                                          00000820
*                                                                               
*PCBNAME=ABCD02PH                                                       00005100
         PCB   TYPE=DB,                                                X00005200
               DBDNAME=WXYZ02PH,                                       X00005300
               PROCOPT=GOTP,                                           X00005400
               KEYLEN=100                                               00005500
         SENSEG NAME=QRSTCASE,                                         X00005600
               PARENT=0                                                 00005700
         SENSEG NAME=QRSTPART,                                         X00005710
               PARENT=QRSTCASE                                          00005720
         SENSEG NAME=QRSTRELC,                                         X00000810
               PARENT=QRSTCASE                                          00000820
         SENSEG NAME=QRSTHIST,                                         X00000810
               PARENT=QRSTCASE                                          00000820
*                                                                               
*PCBNAME=ABCD02PI                                                       00005800
         PCB   TYPE=DB,                                                X00005900
               DBDNAME=WXYZ02PI,                                       X00006000
               PROCOPT=GOTP,                                           X00006100
               KEYLEN=100                                               00006200
         SENSEG NAME=QRSTCASE,                                         X00006300
               PARENT=0                                                 00006400
         SENSEG NAME=QRSTPART,                                         X00006410
               PARENT=QRSTCASE                                          00006420
         SENSEG NAME=QRSTRELC,                                         X00000810
               PARENT=QRSTCASE                                          00000820
         SENSEG NAME=QRSTHIST,                                         X00000810
               PARENT=QRSTCASE                                          00000820
*                                                                               
*PCBNAME=ABCD02PJ                                                       00006500
         PCB   TYPE=DB,                                                X00006600
               DBDNAME=WXYZ02PJ,                                       X00006700
               PROCOPT=GOTP,                                           X00006800
               KEYLEN=100                                               00006900
         SENSEG NAME=QRSTCASE,                                         X00007000
               PARENT=0                                                 00007100
         SENSEG NAME=QRSTPART,                                         X00007200
               PARENT=QRSTCASE                                          00007300
         SENSEG NAME=QRSTRELC,                                         X00000810
               PARENT=QRSTCASE                                          00000820
         SENSEG NAME=QRSTHIST,                                         X00000810
               PARENT=QRSTCASE                                          00000820
*                                                                               
*PCBNAME=ABCD10P0                                                       00009930
         PCB   TYPE=DB,                                                X00010000
               DBDNAME=WXYZ10P0,                                       X00010100
               PROCOPT=AP,                                             X00010200
               KEYLEN=100                                               00010300
         SENSEG NAME=QS10ORDR,PARENT=0                                  00010400
         SENSEG NAME=QS10CASE,PARENT=QS10ORDR                           00010600
         SENSEG NAME=QS10PART,PARENT=QS10CASE                           00010700
         SENSEG NAME=QS10ORDS,PARENT=QS10CASE                           00010800
         SENSEG NAME=QS10PARS,PARENT=QS10ORDS                           00010801
         SENSEG NAME=QS10BRKD,PARENT=QS10CASE                           00010810
         SENSEG NAME=QS10ALTP,PARENT=QS10CASE                           00010810
         SENSEG NAME=QS10HOVR,PARENT=QS10CASE                           00010820
         SENSEG NAME=QS10REVH,PARENT=QS10CASE                           00010830
         SENSEG NAME=QS10HIST,PARENT=QS10ORDR                           00010840
*                                                                               
*PCBNAME=ABCD13S2                                                       00030213
         PCB   TYPE=DB,                                                X00030214
               DBDNAME=WXYZ13P0,                                       X00030215
               PROCOPT=AP,                                             X00030216
               PROCSEQ=ABCD13S2,                                       X00030216
               KEYLEN=64                                                00030217
         SENSEG NAME=QS13DISB,PARENT=0,PROCOPT=GRP                      00030218
*                                                                               
*PCBNAME=ABCDB3S2                                                               
         PCB   TYPE=DB,                                                X        
               DBDNAME=ABCDB3P0,                                       X        
               PROCOPT=AP,                                             X        
               PROCSEQ=ABCDB3S2,                                       X00030216
               KEYLEN=64                                                        
         SENSEG NAME=QS13DISB,PARENT=0,PROCOPT=GRP                              
*                                                                               
*PCBNAME=ABCD14P0                                                       00030213
         PCB   TYPE=DB,                                                X00030214
               DBDNAME=WXYZ14P0,                                       X00030215
               PROCOPT=AP,                                             X00030216
               KEYLEN=100                                               00030217
         SENSEG NAME=QS14PAYT,PARENT=0                                  00030218
         SENSEG NAME=QS14HIST,PARENT=QS14PAYT                           00030219
*                                                                               
*PCBNAME=ABCD14S3                                                       00030213
         PCB   TYPE=DB,                                                X00030214
               DBDNAME=WXYZ14P0,                                       X00030215
               PROCOPT=GOTP,                                           X00030216
               PROCSEQ=ABCD14S3,                                       X00030216
               KEYLEN=100                                               00030217
         SENSEG NAME=QS14PAYT,PARENT=0                                  00030218
         SENSEG NAME=QS14HIST,PARENT=QS14PAYT                           00030219
*                                                                               
*                                                                               
*PCBNAME=ABCDB4P0                                                               
         PCB   TYPE=DB,                                                X        
               DBDNAME=ABCDB4P0,                                       X        
               PROCOPT=AP,                                             X        
               KEYLEN=100                                                       
         SENSEG NAME=QS14PAYT,PARENT=0                                          
         SENSEG NAME=QS14HIST,PARENT=QS14PAYT                                   
*                                                                               
*PCBNAME=ABCDB4S3                                                               
         PCB   TYPE=DB,                                                X        
               DBDNAME=ABCDB4P0,                                       X        
               PROCOPT=GOTP,                                           X        
               KEYLEN=100,                                             X        
               PROCSEQ=ABCDB4S3                                                 
         SENSEG NAME=QS14PAYT,PARENT=0                                          
         SENSEG NAME=QS14HIST,PARENT=QS14PAYT                                   
*                                                                               
*PCBNAME=ABCD27P0                                                       00030213
         PCB   TYPE=DB,                                                X00030214
               DBDNAME=ABCD27P0,                                       X00030215
               PROCOPT=AP,                                             X00030216
               KEYLEN=64                                                00030217
         SENSEG NAME=QS27ORDR,PARENT=0                                  00030218
         SENSEG NAME=QS27SUBB,PARENT=QS27ORDR                           00030219
         SENSEG NAME=QS27ALLO,PARENT=QS27ORDR                           00030221
         SENSEG NAME=QS27SUBA,PARENT=QS27ALLO                           00030222
*                                                                               
*PCBNAME=ABCD27P1                                                       00030225
         PCB   TYPE=DB,                                                X00030226
               DBDNAME=ABCD27P0,                                       X00030227
               PROCOPT=AP,                                             X00030228
               KEYLEN=100                                               00030229
         SENSEG NAME=QS27ORDR,PARENT=0                                  00030230
         SENSEG NAME=QS27SUBB,PARENT=QS27ORDR                           00030231
         SENSEG NAME=QS27ALLO,PARENT=QS27ORDR                           00030233
         SENSEG NAME=QS27SUBA,PARENT=QS27ALLO                           00030234
*                                                                               
*PCBNAME=ABCD41P0                                                       00030213
         PCB   TYPE=DB,                                                X00030214
               DBDNAME=ABCD41P0,                                       X00030215
               PROCOPT=GOTP,                                           X00030216
               KEYLEN=100                                               00030250
         SENSEG NAME=QS41CASE,PARENT=0                                  00030218
*                                                                               
*PCBNAME=ABCD98P0                                                       00030237
         PCB   TYPE=DB,                                                X00030238
               DBDNAME=ABCD98P0,                                       X00030239
               PROCOPT=GOTP,                                           X00030240
               KEYLEN=100,                                             X00030250
               POS=S                                                    00030300
         SENSEG NAME=QS98RDAT,                                         X00030400
               PARENT=0                                                 00030500
*                                                                               
*PCBNAME=ABCD99P0                                                       00030600
         PCB   TYPE=DB,                                                X00030700
               DBDNAME=ABCD99P0,                                       X00030800
               PROCOPT=GOTP,                                           X00030900
               KEYLEN=100                                               00031000
         SENSEG NAME=QS99REFT,                                         X00031100
               PARENT=0                                                 00031200
         SENSEG NAME=QS99VRSN,                                         X00031300
               PARENT=QS99REFT                                          00031400
         SENSEG NAME=QS99DATA,                                         X00031500
               PARENT=QS99VRSN                                          00031600
         SENSEG NAME=QS99RFLD,                                         X00031700
               PARENT=QS99REFT                                          00031800
*                                                                               
*PCBNAME=ABCD05L0                                                       00001400
         PCB   TYPE=DB,                                                X00001500
               DBDNAME=ABCD05L0,                                       X00001600
               PROCOPT=GOTP,                                           X00001700
               KEYLEN=100                                               00001800
         SENSEG NAME=QS05CSLD,                                         X00001900
               PARENT=0                                                 00002000
         SENSEG NAME=QS05PT1L,                                         X00002100
               PARENT=QS05CSLD                                          00002200
         SENSEG NAME=QS05CASE,                                         X00002300
               PARENT=QS05CSLD                                          00002400
         SENSEG NAME=QS05PT2L,                                         X00002500
               PARENT=QS05CSLD                                          00002600
         SENSEG NAME=QS17PTR1,                                         X00002700
               PARENT=QS05PT2L                                          00002800
         SENSEG NAME=QS17CTK2,                                         X00002900
               PARENT=QS05PT2L                                          00003000
         SENSEG NAME=QS17ADMN,                                         X00003100
               PARENT=QS05PT2L                                          00003200
         SENSEG NAME=QS17CTWK,                                         X00003300
               PARENT=QS17ADMN                                          00003400
*PCBNAME=ABCD07L0                                                       00003500
         PCB   TYPE=DB,                                                X00003600
               DBDNAME=ABCD07L0,                                       X00003700
               PROCOPT=AP,                                             X00003800
               KEYLEN=64                                                00003900
         SENSEG NAME=QS07CTWK,                                         X00004000
               PARENT=0                                                 00004100
         SENSEG NAME=QS07PT1L,                                         X00004200
               PARENT=QS07CTWK                                          00004300
         SENSEG NAME=QS05PTR1,                                         X00004400
               PARENT=QS07PT1L                                          00004500
         SENSEG NAME=QS05CASE,                                         X00004600
               PARENT=QS07PT1L                                          00004700
         SENSEG NAME=QS05PT2L,                                         X00004800
               PARENT=QS07PT1L                                          00004900
         SENSEG NAME=QS17PTR1,                                         X00005000
               PARENT=QS05PT2L                                          00005100
         SENSEG NAME=QS17CTK2,                                         X00005200
               PARENT=QS05PT2L                                          00005300
         SENSEG NAME=QS17ADMN,                                         X00005400
               PARENT=QS05PT2L                                          00005500
         SENSEG NAME=QS17CTWK,                                         X00005600
               PARENT=QS17ADMN                                          00005700
         SENSEG NAME=QS07ALRT,                                         X00005800
               PARENT=QS07CTWK                                          00005900
         SENSEG NAME=QS07MSGS,                                         X00006000
               PARENT=QS07CTWK                                          00006100
*PCBNAME=ABCD17S1                                                       00006200
         PCB   TYPE=DB,                                                X00006300
               DBDNAME=WXYZ17P0,                                       X00006400
               PROCOPT=GOTP,                                           X00006500
               KEYLEN=64,                                              X00006600
               PROCSEQ=ABCD17S1                                         00006700
         SENSEG NAME=QS17UNIT,                                         X00006800
               PARENT=0                                                         
         SENSEG NAME=QS17PTR1,                                         X00007100
               PARENT=QS17UNIT                                          00007200
         SENSEG NAME=QS17CTK2,                                         X00007300
               PARENT=QS17UNIT                                          00007400
         SENSEG NAME=QS17ADMN,                                         X00007500
               PARENT=QS17UNIT                                          00007600
         SENSEG NAME=QS17CTWK,                                         X00007700
               PARENT=QS17ADMN                                          00007800
*                                                                       00032700
*PCBNAME=ABCD93G1                                                       00009900
         PCB   TYPE=GSAM,                                              X00010000
               DBDNAME=ABCD93G0,                                       X00010100
               PROCOPT=LS                                               00010200
*                                                                       00032700
*PCBNAME=ABCD0KG0                                                       00031900
         PCB   TYPE=GSAM,                                              X00032000
               DBDNAME=ABCD0KG0,                                       X00032100
               PROCOPT=GS                                               00032200
*                                                                       00032700
*PCBNAME=ABCD0LG0                                                       00032300
         PCB   TYPE=GSAM,                                              X00032400
               DBDNAME=ABCD0LG0,                                       X00032500
               PROCOPT=LS                                               00032600
*                                                                       00032700
*PCBNAME=ABCD7VG0                                                       00032300
         PCB   TYPE=GSAM,                                              X00032400
               DBDNAME=ABCD7VG0,                                       X00032500
               PROCOPT=LS                                               00032600
*                                                                       00032700
*PCBNAME=ABCD67G0                                                       00032300
         PCB   TYPE=GSAM,                                              X00032400
               DBDNAME=ABCD67G0,                                       X00032500
               PROCOPT=LS                                               00032600
*                                                                       00032700
         PSBGEN LANG=COBOL,                                            X00034300
               PSBNAME=QWE010,CMPAT=YES                                 00034400
         END                                                            00034500
