           10 LVSA0100  PIC S9(009)V9(02) COMP-3.                               
           10 LVSA0110  PIC S9(009)V9(02) COMP-3.                               
           10 LVSA0120  PIC S9(009)V9(02) COMP-3.                               
           10 LVSA0130  PIC S9(009)V9(02) COMP-3.                               
           10 LVSA0140  PIC S9(009)V9(02) COMP-3.                               
           10 LVSA0150  PIC S9(009)V9(02) COMP-3.                               
           10 LVSA0160  PIC S9(009)V9(02) COMP-3.                               
           10 LVSA0170  PIC S9(009)V9(02) COMP-3.                               
           10 LVSA0180  PIC S9(009)V9(02) COMP-3.                               
           10 LVSA0190  PIC S9(009)V9(02) COMP-3.                               
           10 LVSA0200  PIC S9(009)V9(02) COMP-3.                               
           10 LVSA0210  PIC S9(011)       COMP-3.                               
           10 LVSA0220  PIC S9(011)       COMP-3.                               
           10 LVSA0230  PIC S9(011)       COMP-3.                               
           10 LVSA0240  PIC S9(011)       COMP-3.                               
           10 LVSA0250  PIC S9(011)       COMP-3.                               
           10 LVSA0260  PIC S9(011)       COMP-3.                               
           10 LVSA0270  PIC  9(012).                                            
           10 LVSA0280  PIC  9(012).                                            
           10 LVSA0285  PIC  9(012).                                            
           10 LVSA0290  PIC  9(012).                                            
