 ULB504P: PROC(COMMPOINT) OPTIONS(MAIN);     
 DCL 1 LVSA,                                                                    
         2 LVSAPO(28),                                                          
           3                                                                    
       %INCLUDE DSFLVSA;                                                        
           ;
           
  END ULB504P;