        /* DATA SET CHNUMER    AT LEVEL 001 AS OF 23/10/89    */                
 %DECLARE CHNUMER ENTRY;                                                        
 %TEST: PROCEDURE(P) RETURNS(CHARACTER);                                     
    CHARACTER AND RETURN VALUE '1' IF ARGUMENT IS VALID DECIMAL FIXED           
    INTEGER,OTHERWISE'0'; LENGTH(P)=0 RESULTS IN '0'                 */         
 DECLARE (P,A,B) CHARACTER,I FIXED, (INDEX,LENGTH,SUBSTR) BUILTIN;              
 A=DELBLK(P);                                                                   
 IF LENGTH(A)=0 THEN RETURN('0');                                               
 B=SUBSTR(A,1,1);                                                               
 IF B='-' ! B='+' THEN                                                          
    IF LENGTH(A)=1 THEN RETURN('0');                                            
                   ELSE A=SUBSTR(A,2);                                          
 DO I=1 TO LENGTH(A);                                                           
    B=SUBSTR(A,I,1);                                                            
    IF INDEX('0123456789',B)=0 THEN RETURN('0');                                
 END;                                                                           
 RETURN('1');                                                                   
 %END TEST;                                                                  
