       IDENTIFICATION DIVISION.
       PROGRAM-ID. MEE8712E.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       REPLACE ==VAR3== BY ==A== ==VAR4== BY ==B==
               ==VAR1== BY ==C== ==VAR2== BY ==D==.
       01 WS-TEST PIC X.
       COPY NDT3022B OF NDT3022L.
       COPY NDT3022A OF NDT3022L.
       REPLACE OFF.
       PROCEDURE DIVISION.
           DISPLAY "HELLO".
       STOP RUN.
