       IDENTIFICATION DIVISION.
       PROGRAM-ID. MIN517B.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 TESTFIELD  PIC 9.

       PROCEDURE DIVISION.
                 DISPLAY ' ----- A:'
            EXEC CICS LINK PROGRAM('PROG!') END-EXEC.
                 DISPLAY ' --- END --- '
       END PROGRAM MIN517B.