//CONCTJCL JOB 'MMRS00C'
//STEP01   EXEC PGM=CONCTPGM
//MYFXOUT  DD DISP=NEW,DSN=DATASET.CONCAT1.FOR.WRITE
//		   DD DISP=NEW,DSN=DATASET.CONCAT2.FOR.WRITE

