 a: procedure (x)
  returns(float);
  declare x float;
  return(x/2);
 end a;
 Mainp: procedure;
  declare y float;
  y = a(2.5);
  put skip list('Type float');
 end Mainp;