 Mainp: procedure;
  get list (A, B, C, Y);
  X = Sprod(A,B,C) + Sprod(A,B,Sprod(A,B,C));
  PUT SKIP LIST('INSIDE NESTED_PROC');
  Sprod: procedure (U,V,W)
   returns (bin float(21));
   dcl (U,V,W) bin float(53);
  end Sprod;
 end Mainp;
