//BHP18601 JOB (A,X,29UT00),'00  ADB/PLR    &:YWC',                             
//         MSGCLASS=W,USER=ZIIGADI                                              
//*+JBS BIND XPDDBA1.ONLINE                                                     
//*--------------------------------------------------------------------*        
//*AUTOBEEP PAGE=PMADB                                                          
//*--------------------------------------------------------------------*        
//PROCS JCLLIB ORDER=AX87CM.LBP.IIFS.PROC.JES.JCLLIB                            
//*--------------------------------------------------------------------*        
//BHP18601 EXEC PROC=BHP18601,                                                  
//          CUTOFFDT='20020501',    RUN TIME PARAMETER CCYYMMDD                 
//          HIGHQUAL='AX29UT',      HIGH QUALIFIER FOR I/O FILES                
//          MIDQLFIL='WBQ',         MID  QUALIFIER FOR I/O FILES                
//          ADSIQUAL='AX29UTV',     ADSI MASTER QUALIFIER                       
//          CMLIB='AX87CM.LBP.CSC.LOADLIB', CHANGE MAN QUALIFIER                
//          WEEKCY='&:CRYWK',        WEELK/DAY CYCLE QUALIFIER                  
//          CRDT='&:CURDG4',         RUN DATE CCYYMMDD FORMAT                   
//          NXTMD='&:P1WM3',         NEXT MONDAY DATE                           
//          WKCYCN='&:P1YWK', WEEK QUALIFIER FOR CONTROL FILE                   
//          DB2SYS1='DBA1',         DB2 SUBSYSTEM                               
//          DB2HLQ='AXXXA1',        DB2 HI-LEVEL LIBRARY QUAL                   
//          PRGMNAME='BHP18601',    PROGRAM NAME                                
//          PLANNAME='UTPADB01'     DB2 PLAN                                    
