         PCB   TYPE=TP,                                                X        
               MODIFY=YES,                                             X        
               EXPRESS=YES                                                      
*                                                                               
         PSBGEN LANG=COBOL,                                            X        
               PSBNAME=CBL001,                                         X        
               CMPAT=YES                                                        
         END                                                                    
