       IDENTIFICATION DIVISION. 
       PROGRAM-ID. A. 
       ENVIRONMENT DIVISION. 
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY '1'
       .
       MY-FLOW-01.
           DISPLAY '2'
           .
       MY-FLOW-02.
           DISPLAY '3'
           GOBACK.
       END PROGRAM A.
