 NOTDEAD1: PROC(PARAM1,PARAM2);
   DCL PARAM1 CHAR(10);
   DCL PARAM2 FIXED BINARY(31);
   
   PUT SKIP LIST('IN EXT PROC');
   PUT SKIP LIST(PARAM1);
   PUT SKIP LIST(PARAM2);
   PARAM1 = 'MODIFIED';
   FRANZ: PROC;
      PUT SKIP LIST(PARAM2);
      NESTED1: PROC;
      PUT SKIP LIST(PARAM2);
      END NESTED1;
   END FRANZ;
 END NOTDEAD1;
 
CREATURE: PROC;
   DCL PARAM1 CHAR(10);
   DCL PARAM2 FIXED BINARY(31);
   DCL STAYWITHME FIXED BINARY(31);
   
   PUT SKIP LIST('IN EXT PROC');
   PUT SKIP LIST(PARAM1);
   PUT SKIP LIST(PARAM2);
   PARAM1 = 'IT''S ALIVE!';
   STAYWITHME = DORIANGRAY(1,2,3);
   WRONGSCOPE = PROVIANT(1,2,3);
   WAR: PROC;
      PUT SKIP LIST(PARAM2);
      NESTED2: PROC;
      PUT SKIP LIST(PARAM2);
      END NESTED2;
   END WAR;
   NUN: PROC;
      PUT SKIP LIST(PARAM2);
      NESTED3: PROC;
      PUT SKIP LIST(PARAM2);
      END NESTED3;
   END NUN;
   DORIANGRAY: PROC (U,V,W)
               returns (bin float(21));
      PUT SKIP LIST(PARAM2);
      MEIN: PROC;
         PUT SKIP LIST(PARAM2);
         NESTED4: PROC;
            PUT SKIP LIST(PARAM2);
         END NESTED4;
      END MEIN;
      
      PROVIANT: PROC (U,V,W)
               returns (bin float(21));
     END PROVIANT;
   END DORIANGRAY;
END CREATURE;
  