* ******************************************************************** *
*                                                                      *
*     System       : Beihilfe                                          *
*     Unter-System : BABSY-Routine                                     *
*     Library      : BABSYN                                            *
*     Mandant      : 00-Alle                                           *
*                                                                      *
*     Modul        : BF00013P                                          *
*     Map          : BATCH                                             *
*     Type         : Pogramm                                           *
*     Kurzname     : Fusion/Wechsel zweier Mitglieder                  *
*                                                                      *
*     Autor        : Stallbommer                                       *
*     Erstellung   : 20.03.2007                                        *
*                                                                      *
* ******************************************************************** *
*                                                                      *
*     Beschreibung :                                                   *
*     Fusion oder Wechsel zwischen zwei Mitglieder                     *
*     Eingaben über Vorlaufkarte:                                      *
*     - Arbeitgeber/Dienstherr alt (Mitgliedsnummer)                   *
*     - Arbeitgeber/Dienstherr neu (Mitgliedsnummer)                   *
*     Update für jede Person die betroffen ist                         *
*     Ausgabe einer Protokolldatei mittels FTP                         *
*                                                                      *
* ******************************************************************** *
*                                                                      *
*    Änderungshistorie:                                                *
*                                                                      *
*  +------------+--------------+-------------------------------------+ *
*  ! Datum      ! Autor        ! Grund                               ! *
*  +------------+--------------+-------------------------------------+ *
*  ! 20.03.2007 ! Stallbommer  ! Erstellung                          ! *
*  ! 19.02.2008 ! Burkard      ! Absprung bei Bereichswechsel        ! *
*  ! 25.08.2008 ! Stallbommer  ! Tabelle erweitert                   ! *
*  ! 25.02.2010 ! StorckT      ! neue ZS
*  !            !              !                                     ! *
*  +------------+--------------+-------------------------------------+ *
*                                                                      *
* ******************************************************************** *
*
DEFINE DATA
* ---------------------------------      Local
LOCAL     USING AL00003A              /* Technische Felder Datei-Zugriff
LOCAL     USING AL00005A              /* ermitteln Mandantennummer
LOCAL     USING ALDU200L              /* Mitglieder-Datei
LOCAL     USING BF00005A              /* B070N-KVBWSPEZIAL
* ---------------------------------
LOCAL     USING SMSGS-2A              /* Message    PDA
LOCAL     USING SFUNC-1A              /* Funktions  PDA
LOCAL     USING SCONS-1L              /* Konstanten LDA
LOCAL     USING RNP02AEA              /* REQUEST    ES NP-Zuordnung
LOCAL     USING RNP02AMA              /* REQUEST    Browse NP-Zuordnung
*
LOCAL
* ---------------------------------      Vorlaufkarte
1 #VORLAUFKARTE               (A14)
END-DEFINE
*
*
***********************************************************************
***                                                                 ***
***               H A U P T S T E U E R U N G                       ***
***                                                                 ***
***********************************************************************
*
* --------------------------------------------------------------------*
* Programm darf nur im Batch laufen
* --------------------------------------------------------------------*
RESET MSG-INFO-STRUCT /* neue ZS
*
END
