//TEST JOB INNOWAK,'YAYPD',CLASS=A,
// REGION=0M,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP0010     EXEC PGM=IEFBR14
//SYSOUT   INCLUDE MEMBER=SYSOUT
//SYSIN    DD  DUMMY
//INPUTFL  DD  DUMMY
//*
//ABEND    INCLUDE MEMBER=ABEND
//*
//SOMETHING    INCLUDE MEMBER=BOBLOB
//*
//MISSING      INCLUDE MEMBER=MISSING
//

