1/* WMIN4379 test                                                    */ 00010006
0MIN4379: PROC (SPA_PTR) REORDER;     /* ADDRESS OF SPA              */ 00020006
                                                                        00320001
 DEFAULT  RANGE(*)  STATIC;                                             00330001
0DCL  PWM4379  CHAR (35) EXT VARYING INIT                               00340001
               ('ISASIZE(64K),NOSPIE,NOSTAE,NOREPORT');                 00350001
                                                                        00360001
1 %INCLUDE W43MINC; /* END W43MINC ***********************************/ 00370001
                                                                        00380001
1/********************************************************************/ 00390001
 /* INITIALIZE PROGRAM PROFILE                                       */ 00400001
 /********************************************************************/ 00410001
0%INCLUDE $PRO4379;                                                     00420001
0%@PRO4379 = PRO4379('WMIN4379',      /* 8 CHAR PGM NAME             */ 00430006
                     'CSC',           /* 3 CHAR SCREEN CODE          */ 00440001
                     ' ',             /* MAX. 40 CHAR LABEL          */ 00450001
                     '00',            /* KEY LENGTH (MAX. VALUE 35)  */ 00460001
                     '',              /* MAX. 40 CHAR LABEL          */ 00470001
                     '00',            /* KEY LENGTH (MAX. VALUE 35)  */ 00480001
                     '',              /* MAX. 40 CHAR LABEL          */ 00490001
                     '00',            /* KEY LENGTH (MAX. VALUE 35)  */ 00500001
                     '',              /* MAX. 40 CHAR LABEL          */ 00510001
                     '00',            /* KEY LENGTH (MAX. VALUE 35)  */ 00520001
                     '',              /* MAX. 40 CHAR LABEL          */ 00530001
                     '00',            /* KEY LENGTH (MAX. VALUE 35)  */ 00540001
                     'E',             /* STORAGE OPTION - EXTERNAL   */ 00550001
                                      /* MAX. 40 CHAR TRX. TITLE     */ 00560001
                     ' ',                                               00570001
                     'RESERVED');     /* 50 CHAR (RESERVED)          */ 00580001
0%INCLUDE @PRO4379;                                                     00590001