       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGMCPY01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       COPY Copybook.

       PROCEDURE DIVISION.

         DISPLAY A.
         DISPLAY B.
         DISPLAY C.

       END PROGRAM PGMCPY01.
