       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGMCPY01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       COPY CopybookFields

       PROCEDURE DIVISION.

         DISPLAY A.

       END PROGRAM PGMCPY01.
