//JOBCARD JOB DSNC810,CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
// USER=&SYSUID,NOTIFY=&SYSUID
//*
//HLOD0100 EXEC PGM=DSNUTILB,
//         REGION=0000M,
//         PARM=('UB1A')
//STEPLIB  DD DISP=SHR,DSN=HLO.PRD0210.LOADLIB
//         DD DISP=SHR,DSN=UB1A.SDSNEXIT
//         DD DISP=SHR,DSN=DSN.VB10.SDSNLOAD
//ISRECAAA DD DSN=DSNC810.HLO.LP,DISP=SHR
//HLODUMMY DD DUMMY
//SYSPRINT DD SYSOUT=*
//UTPRINT DD SYSOUT=*
//SYSIN DD DISP=SHR,DSN=PROD.BSC.CARDLIB(LOADCRD)