 INCLUDE_STMT: PROCEDURE REORDER OPTIONS(MAIN);
    %xinclude abc1,abc2;
	%xinclude "\ibmpli\include\sqlcodes.inc"; 
        %XINCLUDE DSFLVSA;
 END INCLUDE_STMT;