           03  MGO-DEFINE                    PIC X(500).                0000000
           03  MGO REDEFINES MGO-DEFINE.                                0000000
               05  SYMBOL.                                              0000000
                   07  PART.                                            0000000
                       09  SPLIT-PART        PIC X(01).                 0000000
