//UNI7006  JOB (A1P),CLASS=B,MSGCLASS=H      
//JOBLIB   DD DSN=UPNDVR.EPRD.BTCH00.MARK.LOADLOB,DISP=SHR
//*
//UNI7006  EXEC UNI7006
//*******************************************************************