****************************************************************************
******** MMRS-M01  mainframe modernization reference system
****************************************************************************
       01   MMRS710A.
            10 MMRS-M01-GLOBAL-NAME PIC X(10) VALUE 'MMRS-M01: '.
