//MMRS712U JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A
//*************************************************************************
//***** MMRS-M01  mainframe modernization reference system
//*************************************************************************
//***** MMRS712U  IDCAMS to unload VSAM into VB
//***** MMRS712U  IEBGENER to copy recordtype VB to U (only mainframe)
//*****           Caution: these steps are just required for VB files
//*****           Caution: dcb for SYSUT1 is set to U and not supported on mee
//*************************************************************************
//    SET VSAMK=MMRS00C.AWA.VSAMK
//    SET VSAMR=MMRS00C.AWA.VSAMR
//    SET VSAME=MMRS00C.AWA.VSAME
//    SET VSAMKUNL=MMRS00C.AWA.VSAMK.UNLOAD
//    SET VSAMRUNL=MMRS00C.AWA.VSAMR.UNLOAD
//    SET VSAMEUNL=MMRS00C.AWA.VSAME.UNLOAD
//*
//    SET UNLDCB=(RECFM=VB,LRECL=500,BLKSIZE=560)
//    SET UNLSPAC=(CYL,(1,5))
//*
//STEPDEL  EXEC PGM=IEFBR14
//MYUNLK DD DISP=(MOD,DELETE),SPACE=(TRK,(1,5)),DSN=&VSAMKUNL
//MYUNLR DD DISP=(MOD,DELETE),SPACE=(TRK,(1,5)),DSN=&VSAMRUNL
//MYUNLE DD DISP=(MOD,DELETE),SPACE=(TRK,(1,5)),DSN=&VSAMEUNL
//*
//*************************************************************************
//***** MMRS712U  IDCAMS unload data from KSDS, ESDS and RRDS
//*************************************************************************
//STEPVSK  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//IN       DD  DISP=MOD,DSN=&VSAMK
//OUT      DD  DISP=(,CATLG),DSN=&VSAMKUNL,
//             SPACE=&UNLSPAC,
//             DCB=&UNLDCB
//SYSIN    DD  *
  REPRO INFILE(IN) OUTFILE(OUT)
/*
//*
//STEPVSE  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//IN       DD  DISP=MOD,DSN=&VSAME
//OUT      DD  DISP=(,CATLG),DSN=&VSAMEUNL,
//             SPACE=&UNLSPAC,
//             DCB=&UNLDCB
//SYSIN    DD  *
  REPRO INFILE(IN) OUTFILE(OUT)
/*
//*
//STEPVSR  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//IN       DD  DISP=SHR,DSN=&VSAMR
//OUT      DD  DISP=(,CATLG),DSN=&VSAMRUNL,
//             SPACE=&UNLSPAC,
//             DCB=&UNLDCB
//SYSIN    DD  *
  REPRO INFILE(IN) OUTFILE(OUT)
/*
//*
//*   JOB END IF IT IS RUNNING IN MEE ENVIROMNENT
//*   JOB END IF IT IS RUNNING IN MEE ENVIROMNENT
//*   JOB END IF IT IS RUNNING IN MEE ENVIROMNENT
//*   JOB END IF IT IS RUNNING IN MEE ENVIROMNENT
//*   JOB END IF IT IS RUNNING IN MEE ENVIROMNENT
//*
//*
//*************************************************************************
//***** MMRS712U  Example of preventing BDW for filetransfer to client
//*************************************************************************
//*   SAMPLE TO COPY A RECFM=VB FILE TO A RECFM=U FILE
//*   CAUTION: FOR UNLOAD YOU NEED LRECL=500,BLKSIZE=560
//    SET VSAMKRAW=MMRS00C.AWA.VSAMK.RAW
//    SET VSAMRRAW=MMRS00C.AWA.VSAMR.RAW
//    SET VSAMERAW=MMRS00C.AWA.VSAME.RAW
//    SET IEBGSUT1=(RECFM=U,BLKSIZE=560)
//    SET RAWDCB=(RECFM=U,BLKSIZE=560)
//*
//STEPDELR  EXEC PGM=IEFBR14
//MYRAWK DD DISP=(MOD,DELETE),SPACE=(TRK,(1,5)),DSN=&VSAMKRAW
//MYRAWR DD DISP=(MOD,DELETE),SPACE=(TRK,(1,5)),DSN=&VSAMRRAW
//MYRAWE DD DISP=(MOD,DELETE),SPACE=(TRK,(1,5)),DSN=&VSAMERAW
//*
//*************************************************************************
//***** MMRS712U  IEBGENER copy unload data to raw data (RECFM=U)
//*************************************************************************
//STEPVSKR EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSIN    DD  DUMMY
//SYSUT1   DD  DSN=&VSAMKUNL,
//             DISP=(OLD,KEEP,KEEP),
//             DCB=&IEBGSUT1
//SYSUT2   DD  DSN=&VSAMKRAW,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=&UNLSPAC,
//             DCB=&RAWDCB
//*
//STEPVSER EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSIN    DD  DUMMY
//SYSUT1   DD  DSN=&VSAMEUNL,
//             DISP=(OLD,KEEP,KEEP),
//             DCB=&IEBGSUT1
//SYSUT2   DD  DSN=&VSAMERAW,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=&UNLSPAC,
//             DCB=&RAWDCB
//*
//STEPVSRR EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSIN    DD  DUMMY
//SYSUT1   DD  DSN=&VSAMRUNL,
//             DISP=(OLD,KEEP,KEEP),
//             DCB=&IEBGSUT1
//SYSUT2   DD  DSN=&VSAMRRAW,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=&UNLSPAC,
//             DCB=&RAWDCB
//*
