 %/* SAMPLE FILE CONSIST ERRORNEOUS CODE */;

 %/*******************************************************************/;

 TEST: PROC;
  DEFINE ALIAS USHORT UNSIGNED FIXED BIN(32);
  DEFINE ALIAS SHORT SIGNED FIXED BIN(31);
  DEFINE ALIAS UWORD UNSIGNED FIXED BIN(16);
  DEFINE ALIAS WORD SIGNED FIXED BIN(15);
 END TEST;