       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN518B.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TESTFIELD PIC 9(10).
       PROCEDURE DIVISION.
           PERFORM TESTPARA
           GOBACK.
       TESTPARA.
            SUBTRACT 1 FROM TESTFIELD.
       UNREACHABLE.
            DISPLAY 'UNREACHABLE'
