100000$SET SQL(DBMAN=ODBC)
100400 IDENTIFICATION DIVISION.
100500*************************
100600
100700 PROGRAM-ID.     WMIN2728.
100800 AUTHOR.         XXXXXXX.
101300 ENVIRONMENT DIVISION.
101400**********************
101500
101600 CONFIGURATION SECTION.
101700*---------------------*
101800
101900*SOURCE-COMPUTER. UNIX WITH DEBUGGING MODE.
102000 SOURCE-COMPUTER. UNIX.
102100 OBJECT-COMPUTER. UNIX.
102200 SPECIAL-NAMES.
102300     ENVIRONMENT-NAME  IS ENV-NAME
102400     ENVIRONMENT-VALUE IS ENV-VALUE.
102500
102600 INPUT-OUTPUT SECTION.
102700*--------------------*

107100 WORKING-STORAGE SECTION.
107200*-----------------------*
145700 PROCEDURE DIVISION.
147700
148000 COPY 'connora'.
148100 COPY "utsysdatepe".
149300
149400     STOP RUN.
149500