//MGOJOB2  JOB 12345, 
//         MSGCLASS=X,
//         CLASS=H
//*********************************************************************
//* JOBNAME:     MGOJOB2
//*              EXEC COBOL WITH FILE ACCESS PLUS PROC
//*********************************************************************
//STEP01  EXEC PGM=MGOPRGM1        
//SYSOUT   DD  SYSOUT=*          
//SYSUDUMP DD  SYSOUT=W          
//MGOFILE1 DD  DSN=MGO.TEST.FILE.ONE,     
//             DISP=(OLD,DELETE)         
//MGOFILE2 DD  DSN=MGO.TEST.FILE.TWO,     
//             DISP=SHR
//*
//STEP02  EXEC PGM=MGOPRGM2        
//SYSOUT   DD  SYSOUT=*          
//SYSUDUMP DD  SYSOUT=W          
//MGOFILE3 DD  DSN=MGO.TEST.FILE.THREE,     
//             DISP=(OLD,DELETE)         
//MGOFILE4 DD  DSN=MGO.TEST.FILE.FOUR,     
//             DISP=SHR                  
//*
//STEP03 EXEC MGOPROC2