       IDENTIFICATION DIVISION.
       PROGRAM-ID. MGOPRGM7.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MGO-TEST-FILE-1    ASSIGN     MGOFILE1.
           SELECT MGO-TEST-FILE-2    ASSIGN     MGOFILE2.
       FILE SECTION.
       FD  MGO-TEST-FILE-1
             LABEL RECORDS ARE STANDARD
             RECORDING MODE IS F
             BLOCK CONTAINS 0 RECORDS.
       01  EXTRACT-REC       PIC X(232).

       FD  MGO-TEST-FILE-2
             LABEL RECORDS ARE STANDARD
             RECORDING MODE IS F
             BLOCK CONTAINS 0 RECORDS.
       01  EXTRACT-REC       PIC X(232).

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  REC.

       PROCEDURE DIVISION.
            OPEN INPUT MGO-TEST-FILE-1
                       MGO-TEST-FILE-2
            STOP RUN.
