       IDENTIFICATION DIVISION.
       PROGRAM-ID. MGOPRGM3.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MGO-TEST-FILE-5    ASSIGN     MGOFILE5.
           SELECT MGO-TEST-FILE-6    ASSIGN     MGOFILE6.
       FILE SECTION.
       FD  MGO-TEST-FILE-5
             LABEL RECORDS ARE STANDARD
             RECORDING MODE IS F
             BLOCK CONTAINS 0 RECORDS.
       01  EXTRACT-REC-5       PIC X(232).

       FD  MGO-TEST-FILE-6
             LABEL RECORDS ARE STANDARD
             RECORDING MODE IS F
             BLOCK CONTAINS 0 RECORDS.
       01  EXTRACT-REC-6       PIC X(232).

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  REC.

       PROCEDURE DIVISION.
            OPEN INPUT MGO-TEST-FILE-5
                       MGO-TEST-FILE-6
            STOP RUN.
