       IDENTIFICATION DIVISION.
       PROGRAM-ID.    WMIN494.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY DCLTBL. 
           EXEC SQL DECLARE VSAMK TABLE (KSDS VARCHAR(10)) END-EXEC
       PROCEDURE DIVISION.
           DISPLAY 'WMIN494'.
