000060 IDENTIFICATION DIVISION.
000080
000090 PROGRAM-ID.  SINGLE_BRACKET_SQL.
000100
000110 ENVIRONMENT DIVISION.
000270
000280 CONFIGURATION SECTION.
000290 SOURCE-COMPUTER.        VAX.
000300 OBJECT-COMPUTER.        VAX.
000310
000320 INPUT-OUTPUT SECTION.
000400 DATA DIVISION.
000410 WORKING-STORAGE SECTION.

000590*DECLARE_CURSOR.
000600
000610     EXEC SQL
000620
000630               DECLARE DIST CURSOR FOR
000640                 SELECT DISTINCT
000690             BEN162_CNCL_FREQ_CD          AS CNCL_FREQ_CD,
000700             BEN161_CVRG_CD_EFF_DT        AS CVRG_CD_EFF_DT,
000710             BEN161_EXPRN_DT           AS CVRG_CD_EXP_DT
000720             FROM (BEN160_COVERAGE_CODE
000730                 LEFT JOIN BEN161_COVERAGE_CODE_HISTORY
000740                 ON BEN160_CVRG_CD = BEN161_CVRG_CD)
000750                     LEFT JOIN BEN162_CVRG_CD_OVER_AGE_RULE
000760                     ON BEN160_CVRG_CD = BEN162_CVRG_CD
000770        END-EXEC.

004920 PROCEDURE DIVISION.
015660     STOP RUN.
