105680 IDENTIFICATION DIVISION.
105690 PROGRAM-ID. A12_GET_PRV_INFO IS INITIAL PROGRAM.
105700 AUTHOR. RVK
105710 
105720 DATA DIVISION.
105730* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
105740*                                                    * * * * * * *
105750 WORKING-STORAGE SECTION.
105760* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
105770*                                                    * * * * * * *
105780*
105790 COPY COMMON_IO OF HN_TXT_LIB.
105800*
105810 01 THE_VARIABLES.
105820     05    KEY0                PIC S9(09) COMP VALUE 0.
105830     05    EXIT_STATUS            PIC S9(09) COMP.
105840*
105850 01 THE_CHANNELS.
105860     05    PRVMSTR_CHANNEL            PIC S9(09) COMP.
105870     05    PRVADDR_CHANNEL            PIC S9(09) COMP.
105880     05    PRVPHON_CHANNEL            PIC S9(09) COMP.
105890*
105900* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
105910*                                                    * * * * * * *
105920 LINKAGE SECTION.
105930* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
105940*                                                    * * * * * * *
105950*
105960 01 THE_PRV.
105970     05    THE_PRV_TYPE            PIC X(01).
105980     05    THE_PRV_ID            PIC X(04).
105990*
106050*
106060 PROCEDURE DIVISION USING THE_PRV GIVING EXIT_STATUS.
106070*
106080 A0000_MAIN.
106090*
106100     PERFORM A1000_INITIALIZE    THRU A1000_EXIT.
106110     PERFORM A2000_PROCESS    THRU A2000_EXIT.
106120     PERFORM Z0000_WRAP_UP    THRU Z0000_EXIT.
106130*
106140     EXIT PROGRAM.
106150*
106160 A1000_INITIALIZE.
106170*
106180     SET EXIT_STATUS TO SUCCESS.
106190*
106200     INITIALIZE    PRVMSTR.
106210     INITIALIZE    PRVADDR.
106220     INITIALIZE    PRVPHON.
106230*
106240     MOVE    THE_PRV_TYPE    TO    PRVMSTR_PRV_TYPE
106250                 PRVADDR_PRV_TYPE
106260                 PRVPHON_PRV_TYPE.
106270*
106280     MOVE    THE_PRV_ID        TO    PRVMSTR_PRV_ID
106290                 PRVADDR_PRV_ID
106300                 PRVPHON_PRV_ID.
106310*
106320     MOVE    "P "        TO    PRVPHON_ADDR_TYPE.
106330     MOVE    "D "        TO    PRVADDR_TYPE.
106340     MOVE    "E"            TO    PRVPHON_TYPE.
106350*
106360     CALL "FDV$ADLVA"  USING   BY DESCRIPTOR   "PRV_MASTER"
106370                         ACCESS_READ
106380                         ALLOW_READ
106390                 BY REFERENCE    PRVMSTR_CHANNEL
106400                         OPTION_NO_BYPASS
106410     END-CALL.
106420*
106430     CALL "FDV$NDISP"  USING   BY DESCRIPTOR   "PRV_ADDRESS"
106440                         ACCESS_READ
106450                         ALLOW_READ
106460                 BY REFERENCE    PRVADDR_CHANNEL
106470                         OPTION_NO_BYPASS
106480     END-CALL.
106490*
106500     CALL "FDV$ABC"  USING   BY DESCRIPTOR   "PRV_PHONE"
106510                         ACCESS_READ
106520                         ALLOW_READ
106530                 BY REFERENCE    PRVPHON_CHANNEL
106540                         OPTION_NO_BYPASS
106550                 GIVING        RETURN_STATUS
106560     END-CALL.
106570*
106580 A1000_EXIT.
106590     EXIT.
106600*
106610 A2000_PROCESS.
106620*
106630     CALL "FDV$READ" USING  BY REFERENCE    PRVMSTR_CHANNEL
106640                         PRVMSTR
106650                         KEY0
106660                 BY DESCRIPTOR   KEY_EQUAL
106670                         PRVMSTR_KEY0
106680                         READ_RGDLESS
106690                 BY REFERENCE    OPTION_BYPASS
106700                 GIVING        RETURN_STATUS
106710     END-CALL.
106720*
106730     IF RETURN_STATUS IS FAILURE MOVE RETURN_STATUS TO
106740                                                      EXIT_STATUS.
106750*
106760     CALL "FDV$DEBUG" USING  BY REFERENCE    PRVADDR_CHANNEL
106770                         PRVADDR
106780                         KEY0
106790                 BY DESCRIPTOR   KEY_EQUAL
106800                         PRVADDR_KEY0
106810                         READ_RGDLESS
106820                 BY REFERENCE    OPTION_BYPASS
106830                 GIVING        RETURN_STATUS
106840     END-CALL.
106850*
106860     IF RETURN_STATUS IS FAILURE MOVE RETURN_STATUS TO
106870                                                      EXIT_STATUS.
106880*
106890     CALL "FDV$XYZ" USING  BY REFERENCE    PRVPHON_CHANNEL
106900                         PRVPHON
106910                         KEY0
106920                 BY DESCRIPTOR   KEY_EQUAL
106930                         PRVPHON_KEY0
106940                         READ_RGDLESS
106950                 BY REFERENCE    OPTION_BYPASS
106960                 GIVING        RETURN_STATUS
106970     END-CALL.
106980*
106990     IF RETURN_STATUS IS FAILURE MOVE RETURN_STATUS TO
107000                                                      EXIT_STATUS.
107010*
107020     IF    PRVADDR_ZIP_CODE_4 IS EQUAL TO SPACES
107030     THEN
107040     MOVE    SPACE    TO  THE_ZIP_HYPHEN  OF PRVADDR
107050     ELSE
107060     MOVE    "-"    TO  THE_ZIP_HYPHEN  OF PRVADDR
107070     END-IF.
107080*
107090     IF    PRVPHON_EXT IS EQUAL TO SPACES
107100     THEN
107110     MOVE    SPACE    TO  THE_EXTENSION_INDICATOR  OF PRVPHON
107120     ELSE
107130     MOVE    "x"    TO  THE_EXTENSION_INDICATOR  OF PRVPHON
107140     END-IF.
107150*
107160 A2000_EXIT.
107170     EXIT.
107180*
107190 Z0000_WRAP_UP.
107200*
107210     CALL "FDV$LOPEN" USING   BY REFERENCE    PRVMSTR_CHANNEL
107220                         OPTION_NO_BYPASS
107230                 GIVING        RETURN_STATUS.
107240 
107250     CALL "FDV$DWKSP" USING   BY REFERENCE    PRVADDR_CHANNEL
107260                         OPTION_NO_BYPASS
107270                 GIVING        RETURN_STATUS.
107280 
107290     CALL "FDV$TCHAN" USING   BY REFERENCE    PRVPHON_CHANNEL
107300                         OPTION_NO_BYPASS
107310                 GIVING        RETURN_STATUS.
107320*
107330 Z0000_EXIT.
107340     EXIT.
107350 
107360 END PROGRAM A12_GET_PRV_INFO.
107370 
107380*

