*****************************************************************
         PRINT ON,NOGEN
********************************************************************
ENQY01   FMT
         DEV   TYPE=3270-A2,                                           X
               FEAT=IGNORE,                                            X
               DSCA=X'00F0',                                           X
               PFK=(PFKFLD,                                            X
               1='INQ1    01',                                         X
               2='INQ1    02',                                         X
               3='INQ1    03')
         DIV   TYPE=INOUT
         DPAGE CURSOR=((5,11)),                                        X
               FILL=PT
         DFLD  'MEMBER ENQUIRY',                                       X
               POS=(2,32),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD),EATTR=(HD)
         DFLD  'DATE: ',                                               X
               POS=(3,65),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
CURDATE  DFLD  POS=(3,72),                                             X
               LTH=9,                                                  X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'MEM ID: ',                                             X
               POS=(5,2),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
MEMID    DFLD  POS=(5,11),                                             X
               LTH=8,                                                  X
               ATTR=(NOPROT,ALPHA,NORM,MOD)
         DFLD  'PF1:MENU  PF2:DEMOGRAPHIC  PF3:COVERAGE',              X
               POS=(20,2),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
ERRMSG   DFLD  POS=(22,2),                                             X
               LTH=79,                                                 X
               ATTR=(PROT,ALPHA,HI,NOMOD),EATTR=(TURQ)
         FMTEND
********************************************************************
********************************************************************
ENQ01    MSG   TYPE=OUTPUT,                                            X
               SOR=(ENQY01,IGNORE),                                    X
               NXT=ENQ01I
         SEG
         MFLD (CURDATE,DATE2)
         MFLD MEMID,LTH=10,ATTR=YES
         MFLD ERRMSG,LTH=83,ATTR=(YES,1)
         MSGEND
********************************************************************
ENQ01I   MSG   TYPE=INPUT,                                             X
               SOR=(ENQY01,IGNORE),                                    X
               NXT=ENQ01
         SEG
         MFLD  PFKFLD,                                                 X
               LTH=10,FILL=NULL
         MFLD  'INQ1      ',                                           X
               LTH=10,FILL=NULL
         MFLD  MEMID,                                                  X
               LTH=8,FILL=X'40'
         MSGEND
********************************************************************
         END