*****************************************************************
         PRINT ON,NOGEN
********************************************************************
ERR02    FMT
         DEV   TYPE=(3270,2),                                          X
               FEAT=IGNORE,                                            X
               DSCA=X'00F0',                                           X
               PFK=(PFKFLD,                                            X
               1='INQ2    01',                                         X
               2='TRERR2    ',                                         X
               3='TXRST2    ',                                         X
               4='TROLL02   ')
         DIV   TYPE=INOUT
         DPAGE CURSOR=((5,11)),                                        X
               FILL=NULL
         DFLD  'ERROR HANDLING',                                       X
               POS=(2,16),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'DATE: ',                                               X
               POS=(3,65),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
CURDATE  DFLD  POS=(3,72),                                             X
               LTH=9,                                                  X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'MEM ID: ',                                             X
               POS=(6,2),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
MEMID    DFLD  POS=(6,15),                                             X
               LTH=8,                                                  X
               ATTR=(NOPROT,ALPHA,NORM,MOD)
         DFLD  'PF1:MENU  PF2:ERROR  PF3:XRST  PF4:ROLL',              X
               POS=(20,2),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
ERRMSG   DFLD  POS=(21,2),                                             X
               LTH=79,                                                 X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         FMTEND
********************************************************************
********************************************************************
ERRO2    MSG   TYPE=OUTPUT,                                            X
               SOR=(ERR02,IGNORE),                                     X
               FILL=PT,                                                X
               PAGE=YES,                                               X
               NXT=ERR2I
         SEG
         MFLD (CURDATE,DATE2)
         MFLD ERRMSG,LTH=79
         MSGEND
********************************************************************
ERR2I    MSG   TYPE=INPUT,                                             X
               SOR=(ERR02,IGNORE),                                     X
               NXT=ERRO2
         SEG   GRAPHIC=NO
         MFLD  PFKFLD,                                                 X
               LTH=10
         MFLD  MEMID,                                                  X
               LTH=8
         MSGEND
********************************************************************
         END