         DBD     NAME=INDB1I,ACCESS=(INDEX,VSAM,PROT)
         DATASET DD1=INDB1I,SIZE=4096
         SEGM    NAME=SGONE,PARENT=0,POINTER=T,BYTES=30
         FIELD   NAME=(OFDA,SEQ,U),BYTES=10,START=1,TYPE=C
         FIELD   NAME=OFDB,BYTES=10,START=11,TYPE=C
         FIELD   NAME=OFDC,BYTES=10,START=21,TYPE=C
         LCHILD  NAME=(SEGONE,INDB1),INDEX=OFIELDA
         DBDGEN
         FINISH
         END