         PCB       TYPE=DB,DBDNAME=INDB1,KEYLEN=20,PROCOPT=LS
         SENSEG    NAME=SEGONE1
         SENSEG    NAME=SEGTWO,PARENT=SEGONE1
         SENSEG    NAME=SEGTHR,PARENT=SEGONE1
         PSBGEN    PSBNAME=INLOAD1,LANG=COBOL,CMPAT=YES
         END