*****************************************************************
         PRINT ON,NOGEN
*****************************************************************
MENU03   FMT
         DEV   TYPE=(3270,2),                                          X
               FEAT=IGNORE,                                            X
               DSCA=X'00F0',                                           X
               PFK=(PFKFLD,                                            X
               '/FOR ENQ03',                                           X
               '/FOR ENRL3',                                           X
               '/FOR UPDT3',                                           X
               '/FOR ERRO3',                                           X
               'TENV3     ')
         DIV   TYPE=INOUT
         DPAGE CURSOR=((16,24)),                                       X
               FILL=PT
         DFLD  'MAIN MENU',                                            X
               POS=(5,5),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'DATE :',                                               X
               POS=(5,65),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
CURDATE  DFLD  POS=(5,72),                                             X
               LTH=9,                                                  X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  '1.MEMBER LOOKUP',                                      X
               POS=(12,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  '2.ENROLL MEMBER',                                      X
               POS=(13,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  '3.UPDATE MEMBER',                                      X
               POS=(14,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  '4.ERROR HANDLING',                                     X
               POS=(15,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  '5.EXECUTION ENVIRONMENT',                              X
               POS=(16,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  '6.EXIT',                                               X
               POS=(17,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'SELECT MENU OPTION ',                                  X
               POS=(18,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'PF1:LOOKUP  PF2:ENROLL  PF3:UPDATE  PF4:ERROR  PF4:ENV X
                PF5:EXIT',                                             X
               POS=(20,2),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
ERRMSG   DFLD  POS=(21,2),                                             X
               LTH=79,                                                 X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         FMTEND
********************************************************************
********************************************************************
MENU3    MSG   TYPE=OUTPUT,                                            X
               SOR=(MENU03,IGNORE),                                    X
               FILL=C' ',                                              X
               NXT=MENU3I
         SEG
         MFLD (CURDATE,DATE2)
         MFLD ERRMSG,LTH=79
         MSGEND
********************************************************************
MENU3I   MSG   TYPE=INPUT,                                             X
               SOR=(MENU03,IGNORE),                                    X
               NXT=MENU3
         SEG
         MFLD  PFKFLD,                                                 X
               LTH=10
         MSGEND