*****************************************************************
         PRINT ON,NOGEN
********************************************************************
NEWMEM02 FMT
         DEV   TYPE=(3270,2),                                          X
               FEAT=IGNORE,                                            X
               DSCA=X'00F0'
         DIV   TYPE=OUTPUT
         DPAGE CURSOR=((5,11)),                                        X
               FILL=PT
         DFLD  'NEWLY ENROLLED MEMBER',                                X
               POS=(2,16),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'DATE: ',                                               X
               POS=(3,65),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
CURDATE  DFLD  POS=(3,72),                                             X
               LTH=9,                                                  X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'FIRST NAME: ',                                         X
               POS=(6,2),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
FNAME    DFLD  POS=(6,15),                                             X
               LTH=10,                                                 X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
         DFLD  'LAST NAME: ',                                          X
               POS=(6,30),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
LNAME    DFLD  POS=(6,42),                                             X
               LTH=10,                                                 X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
         DFLD  'DOB: ',                                                X
               POS=(7,2),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
DOB      DFLD  POS=(7,8),                                              X
               LTH=8,                                                  X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
         DFLD  'SEX: ',                                                X
               POS=(7,30),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
SEX      DFLD  POS=(7,36),                                             X
               LTH=1,                                                  X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
         DFLD  'ADDR: ',                                               X
               POS=(8,2),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
ADDR     DFLD  POS=(8,9),                                              X
               LTH=50,                                                 X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
         DFLD  'CITY: ',                                               X
               POS=(9,2),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
CITY     DFLD  POS=(9,9),                                              X
               LTH=10,                                                 X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
         DFLD  'ZIP: ',                                                X
               POS=(9,30),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
ZIP      DFLD  POS=(9,36),                                             X
               LTH=5,                                                  X
               ATTR=(PROT,NUM,NORM,NOMOD)
         DFLD  'ST: ',                                                 X
               POS=(10,2),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
STATE    DFLD  POS=(10,7),                                             X
               LTH=2,                                                  X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
         DFLD  'PHONE: ',                                              X
               POS=(10,30),                                            X
               ATTR=(PROT,ALPHA,HI,NOMOD)
PHONE    DFLD  POS=(10,38),                                            X
               LTH=12,                                                 X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
MESSAGE  DFLD  POS=(20,2),                                             X
               LTH=35,                                                 X
               ATTR=(PROT,ALPHA,NOMOD)
         FMTEND
********************************************************************
********************************************************************
NEWMEM2  MSG   TYPE=OUTPUT,                                            X
               SOR=(NEWMEM02,IGNORE),                                  X
               FILL=PT,                                                X
               NXT=NEWMEM2I
         SEG
         MFLD (CURDATE,DATE2)
         MFLD FNAME,LTH=10
         MFLD LNAME,LTH=10
         MFLD DOB,LTH=8
         MFLD SEX,LTH=1
         MFLD ADDR,LTH=50
         MFLD CITY,LTH=10
         MFLD ZIP,LTH=5
         MFLD STATE,LTH=2
         MFLD PHONE,LTH=12
         MFLD MESSAGE,LTH=41,ATTR=(YES,2)
         MSGEND
********************************************************************
NEWMEM2I MSG   TYPE=INPUT,                                             X
               SOR=(NEWMEM02,IGNORE),                                  X
               NXT=NEWMEM2
         SEG
         MFLD  PFKFLD,                                                 X
               LTH=10,FILL=NULL
         MSGEND
********************************************************************
         END