*****************************************************************
         PRINT ON,NOGEN
********************************************************************
PLAN03   FMT
         DEV   TYPE=(3270,2),                                          X
               FEAT=IGNORE,                                            X
               DSCA=X'00F0',                                           X
               PFK=(PFKFLD,                                            X
               1='INQ3    01',                                         X
               2='INQ3    02',                                         X
               3='INQ3    03')
         DIV   TYPE=INOUT
         DPAGE CURSOR=((5,11)),                                        X
               FILL=PT
         DFLD  'MEMBER COVERAGE',                                      X
               POS=(2,32),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'DATE :',                                               X
               POS=(3,65),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
CURDATE  DFLD  POS=(3,72),                                             X
               LTH=9,                                                  X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'MEM ID: ',                                             X
               POS=(5,2),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
MEMID    DFLD  POS=(5,11),                                             X
               LTH=8,                                                  X
               ATTR=(NOPROT,ALPHA,NORM,MOD)
         DFLD  'PLAN ID: ',                                            X
               POS=(6,2),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
PLANID   DFLD  POS=(6,12),                                             X
               LTH=6,                                                  X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
         DFLD  'GROUP ID: ',                                           X
               POS=(6,30),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
GRPID    DFLD  POS=(6,41),                                             X
               LTH=6,                                                  X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
         DFLD  'EFF DT: ',                                             X
               POS=(7,2),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
EFFDT    DFLD  POS=(7,11),                                             X
               LTH=8,                                                  X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
         DFLD  'END DT: ',                                             X
               POS=(7,30),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
ENDDT    DFLD  POS=(7,39),                                             X
               LTH=8,                                                  X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
         DFLD  'NETWORK ID: ',                                         X
               POS=(8,2),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
NTWKID   DFLD  POS=(8,15),                                             X
               LTH=6,                                                  X
               ATTR=(PROT,ALPHA,NORM,NOMOD)
         DFLD  'PF1:MENU  PF2:DEMOGRAPHIC   PF3:COVERAGE',             X
               POS=(20,2),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
ERRMSG   DFLD  POS=(22,2),                                             X
               LTH=79,                                                 X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         FMTEND
********************************************************************
********************************************************************
PLAN3    MSG   TYPE=OUTPUT,                                            X
               SOR=(PLAN03,IGNORE),                                    X
               NXT=PLAN3I
         SEG
         MFLD (CURDATE,DATE2)
         MFLD MEMID,LTH=8
         MFLD PLANID,LTH=6
         MFLD GRPID,LTH=6
         MFLD EFFDT,LTH=8
         MFLD ENDDT,LTH=8
         MFLD NTWKID,LTH=6
         MFLD ERRMSG,LTH=79
         MSGEND
********************************************************************
PLAN3I   MSG   TYPE=INPUT,                                             X
               SOR=(PLAN03,IGNORE),                                    X
               NXT=PLAN3
         SEG
         MFLD  PFKFLD,                                                 X
               LTH=10,FILL=NULL
         MFLD  MEMID,                                                  X
               LTH=8,FILL=NULL
         MSGEND
********************************************************************
         END