//TESTJOBA JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A
//STEP01   EXEC PGM=NAT
//SYSIN DD *
LOGON WMIN5453/A
MAIN6
FIN
//*
//STEP02   EXEC PGM=NAT
//SYSIN DD *
LOGON WMIN5453/B
MAIN6
FIN
//*
//STEP03   EXEC PGM=NAT
//SYSIN DD *
LOGON X
MAIN6
FIN
//*