//INNOWAK JOB INNOWAK,'INNOWAK',CLASS=A,
// REGION=0M,MSGLEVEL=(1,1),MSGCLASS=H,NOTIFY=&SYSUID
//*
//JOBLIB       DD  DSN=INNOWAK.A.LOADLIB,DISP=SHR
//STEP  EXEC IGYWCL
//COBOL.SYSIN  DD  DSN=INNOWAK.ABA.COBOL(MIN2514DDD),DISP=SHR
//LKED.SYSLMOD DD  DSN=INNOWAK.A.LOADLIB(MIN2514DDD),DISP=SHR
//*
//STEP2 EXEC PGM=MIN2514DDD,PARM='WC,W1,W2,W3,W4,W5,W6,W7,W8'
//
