//DUPFILE   JOB 000,CLASS=P,MSGCLASS=C                                  00001**2
//STEP3 EXEC PGM=IEFBR14
//DD1   DD DSN=TEST.FILE,DISP=SHR
//SYSDUMP   DD DSN=TEST.DUMP,DISP=(NEW,KEEP),DATACLAS=DSORG 
//SYSABEND  DD DSN=TEST1.DUMP,DISP=(NEW,KEEP),DATACLAS=DSORG 
//SYSMDUMP  DD DSN=TEST2.DUMP,DISP=(NEW,KEEP),DATACLAS=DSORG 
//SYSUDUMP  DD DSN=TEST3.DUMP,DISP=(NEW,KEEP),DATACLAS=DSORG 
//SYSCHK    DD DSN=TEST4.DUMP,DISP=(NEW,KEEP),DATACLAS=DSORG 
//SYSCKEOV  DD DSN=TEST5.DUMP,DISP=(NEW,KEEP),DATACLAS=DSORG 

