//**********************************************************                    
//* THIS PROC WAS CREATED AND IS EXECUTED FROM JOB  Z38ZG235                    
//**********************************************************                    
//APL060 JOB INIT='T',SYSOUT='(,)'                                           
//*                                                                             
//PS01     EXEC PROC=APL060,TIME=30   