       IDENTIFICATION DIVISION.
       PROGRAM-ID. XXXXSEI.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
         WORKING-STORAGE SECTION.
          REPLACE ==VAR3== BY ==D==.
          COPY DEC-XXXX-PRIME-FPM
       PROCEDURE DIVISION.
          DISPLAY 'Hello'.
       STOP RUN.
