//CBAJR24A  JOB 000,CLASS=P,MSGCLASS=C,PRTY=13                          00001000
//JOBLIB   DD DSN=DSNB10.SDSNLOAD                                       00003000
//STEP0010 EXEC CBAPR24A                                                00004000