       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBL_PRG_FOR_C.
       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       
       LINKAGE SECTION.
       01  HELLO PIC X(6).
       01  WORLD PIC X(6).
       PROCEDURE DIVISION USING HELLO WORLD.
       DISPLAY HELLO WORLD.
       EXIT PROGRAM.
