//TESTLREP JOB (A,X,29UT00),'00  ADB/PLR   &:YWC',                              
//         MSGCLASS=T,USER=XXXX                                              
//TESTLREP PROC                                                                 
//*---------------------------------------------------------------------        
//DSNTIAUL EXEC PGM=IKJEFT1B                                                    
//STEPLIB  DD DSN=&DB2HLQ..DB2.SDSNEXIT,DISP=SHR                                
//         DD DSN=&DB2HLQ..DB2.SDSNLOAD,DISP=SHR                                
//         DD DSN=&DB2HLQ..DB2.RUNLIB.LOAD,DISP=SHR                             
//SYSIN    DD SUBSYS=(CCSS,                                                     
// ' SET CURRENT SQLID = ''AX29UTDA'';                            ',            
// ' SELECT T1.CHILD_CNTR_NUM||''~''||T1.PRNT_CNTR_NUM||''~''||   ',            
// ' T1.AGNT_TYP_CD||''~''||T1.GRID_ID||''~''||T1.REL_FINAL_CD    ',            
// ' ||''~''||CHAR(T1.START_DT)||''~''||CHAR(T1.END_DT)||''~''||  ',            
// ' T1.PROT_REL_IND||''~''||CHAR(T1.CRT_TS)||''~''||T1.CRT_BY_ID ',            
// ' ||''~''||CHAR(T1.UPDT_TS)||''~''||T1.UPDT_BY_ID||''~''||     ',            
// ' T1.HIST_IND||''~''||T1.ADDR_TYP_CD||''~''||T1.STATE_CD       ',            
// ' ||''~''||T1.ZIP_CD||''~''||T1.USER_OVERRIDE_IND||''~''||     ',            
// ' T1.FIRM_CNTR_NUM||''~''||T1.REL_TYP_CD                      ',             
// '   FROM                                                     ',              
// '        UTT_PROD_RELS T1                                    ',              
// '       ,UTT_GRID_RELS G1                                    ',              
// '       ,UTT_OA_REL    BX                                    ',              
// '       ,UTT_GRID_RELS B1                                    ',              
// '      WHERE                                                 ',              
// '            G1.CNTR_NUM           = BX.PARNT_CNTR_NUM       ',              
// '        AND BX.REL_TYP_CD         = ''B''                   ',              
// '        AND (                                               ',              
// '             (G1.START_DT   BETWEEN BX.REL_BG_DT AND        ',              
// '              (CASE BX.REL_EN_DT                            ',              
// '               WHEN ''0001-01-01''   THEN ''9999-12-31''    ',              
// '               WHEN ''9000-01-01''   THEN ''9999-12-31''    ',              
// '               ELSE  BX.REL_EN_DT   END                     ',              
// '              )                                             ',              
// '             )                                              ',              
// '         OR                                                 ',              
// '             (BX.REL_BG_DT  BETWEEN                         ',              
// '              G1.START_DT     AND     G1.END_DT             ',              
// '             )                                              ',              
// '            )                                               ',              
// '        AND G1.END_DT =                                     ',              
// '           (SELECT MAX(END_DT) FROM UTT_GRID_RELS           ',              
// '              WHERE G1.CNTR_NUM = CNTR_NUM                  ',              
// '                AND G1.GRID_ID = GRID_ID)                   ',              
// '        AND G1.REL_FINAL_CD = ''A''                         ',              
// '        AND BX.CHLD_CNTR_NUM   = B1.CNTR_NUM                ',              
// '        AND B1.END_DT          =                            ',              
// '           (SELECT MAX(END_DT) FROM UTT_GRID_RELS           ',              
// '              WHERE B1.CNTR_NUM = CNTR_NUM                  ',              
// '                AND B1.GRID_ID = GRID_ID)                   ',              
// '        AND B1.REL_FINAL_CD       = ''A''                   ',              
// '        AND NOT EXISTS                                      ',              
// '           (  SELECT 1 FROM UTT_GRID_RELS X                 ',              
// '              WHERE X.CNTR_NUM = B1.CNTR_NUM                ',              
// '                AND B1.GRID_ID = G1.GRID_ID                 ',              
// '                AND REL_FINAL_CD = ''A''                    ',              
// '           )                                                ',              
// '        AND EXISTS                                          ',              
// '           (  SELECT 1 FROM UTT_GRID_RELS X                 ',              
// '              WHERE X.CNTR_NUM = B1.CNTR_NUM                ',              
// '                AND B1.GRID_ID NOT IN                       ',              
// '                   (SELECT GRID_ID FROM UTT_GRID_RELS       ',              
// '                     WHERE CNTR_NUM = G1.CNTR_NUM)          ',              
// '                AND REL_FINAL_CD = ''A''                    ',              
// '           )                                                ',              
// '        AND B1.GRID_ID = T1.GRID_ID                         ',              
// '        AND (T1.FIRM_CNTR_NUM = B1.CNTR_NUM                 ',              
// '          OR T1.CHILD_CNTR_NUM = B1.CNTR_NUM)               ',              
// '        AND T1.START_DT >= B1.START_DT                      ',              
// '        AND T1.END_DT   <= B1.END_DT                        ',              
// '   UNION                                                    ',              
// ' SELECT T1.CHILD_CNTR_NUM||''~''||T1.PRNT_CNTR_NUM||''~''||   ',            
// ' T1.AGNT_TYP_CD||''~''||T1.GRID_ID||''~''||T1.REL_FINAL_CD    ',            
// ' ||''~''||CHAR(T1.START_DT)||''~''||CHAR(T1.END_DT)||''~''||  ',            
// ' T1.PROT_REL_IND||''~''||CHAR(T1.CRT_TS)||''~''||T1.CRT_BY_ID ',            
// ' ||''~''||CHAR(T1.UPDT_TS)||''~''||T1.UPDT_BY_ID||''~''||     ',            
// ' T1.HIST_IND||''~''||T1.ADDR_TYP_CD||''~''||T1.STATE_CD       ',            
// ' ||''~''||T1.ZIP_CD||''~''||T1.USER_OVERRIDE_IND||''~''||     ',            
// ' T1.FIRM_CNTR_NUM||''~''||T1.REL_TYP_CD                      ',             
// '   FROM                                                     ',              
// '        UTT_PROD_RELS T1                                    ',              
// '   WHERE T1.START_DT > T1.END_DT                            ',              
// '   UNION                                                    ',              
// ' SELECT T1.CHILD_CNTR_NUM||''~''||T1.PRNT_CNTR_NUM||''~''||   ',            
// ' T1.AGNT_TYP_CD||''~''||T1.GRID_ID||''~''||T1.REL_FINAL_CD    ',            
// ' ||''~''||CHAR(T1.START_DT)||''~''||CHAR(T1.END_DT)||''~''||  ',            
// ' T1.PROT_REL_IND||''~''||CHAR(T1.CRT_TS)||''~''||T1.CRT_BY_ID ',            
// ' ||''~''||CHAR(T1.UPDT_TS)||''~''||T1.UPDT_BY_ID||''~''||     ',            
// ' T1.HIST_IND||''~''||T1.ADDR_TYP_CD||''~''||T1.STATE_CD       ',            
// ' ||''~''||T1.ZIP_CD||''~''||T1.USER_OVERRIDE_IND||''~''||     ',            
// ' T1.FIRM_CNTR_NUM||''~''||T1.REL_TYP_CD                      ',             
// '   FROM                                                     ',              
// '        UTT_PROD_RELS T1                                    ',              
// '   WHERE EXISTS                                             ',              
// '       (SELECT 1                                            ',              
// '        FROM UTT_OA B                                       ',              
// '            ,UTT_NON_PRU_ORG C                              ',              
// '        WHERE B.CNTR_NUM = T1.CHILD_CNTR_NUM                ',              
// '          AND B.MKTR_FOCAL_SUBJ_ID = C.SUBJ_ID              ',              
// '       )                                                    ',              
// '   UNION                                                    ',              
// ' SELECT T1.CHILD_CNTR_NUM||''~''||T1.PRNT_CNTR_NUM||''~''||   ',            
// ' T1.AGNT_TYP_CD||''~''||T1.GRID_ID||''~''||T1.REL_FINAL_CD    ',            
// ' ||''~''||CHAR(T1.START_DT)||''~''||CHAR(T1.END_DT)||''~''||  ',            
// ' T1.PROT_REL_IND||''~''||CHAR(T1.CRT_TS)||''~''||T1.CRT_BY_ID ',            
// ' ||''~''||CHAR(T1.UPDT_TS)||''~''||T1.UPDT_BY_ID||''~''||     ',            
// ' T1.HIST_IND||''~''||T1.ADDR_TYP_CD||''~''||T1.STATE_CD       ',            
// ' ||''~''||T1.ZIP_CD||''~''||T1.USER_OVERRIDE_IND||''~''||     ',            
// ' T1.FIRM_CNTR_NUM||''~''||T1.REL_TYP_CD                      ',             
// '   FROM                                                     ',              
// '        UTT_PROD_RELS T1                                    ',              
// '   WHERE NOT EXISTS                                         ',              
// '       (SELECT 1                                            ',              
// '        FROM UTT_OA B                                       ',              
// '        WHERE B.CNTR_NUM = T1.CHILD_CNTR_NUM                ',              
// '       );                                                   ',              
// '  ')                                                                        
//*--------------------------------------------------------------------         
