//TEST25P2 JOB (A,X,29UT00),'PHASE 2',                                 
//         MSGCLASS=W,USER=XXXX,GROUP=AX29UTDA                               
//IEXU0001 EXEC PGM=IEXUNCAT                                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
AX29UT.ADB425P2.ADSI.INPUT                                                      
//**********************************************************************        
//IKJE0001 EXEC PGM=IKJEFT1B                                                    
//SYSIN    DD *                                                                 
         SELECT DISTINCT NEWCO_TEST_NUM M FROM TEST_NEWCO_LOC                      
            WHERE NEWCO_TEST_CD IN                                              
          ('TEST1','TEST2',
           'TEST3','TEST4');                                                                                                
//********************************************************************                     
