       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN2777IF2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
         IF FOO EQ 'BAR' THEN
          DISPLAY 'TRUE'
          IF FOO EQ 'BAR' AND BAR EQ 'FOO'THEN
           DISPLAY 'FALSE'
          END-IF.
         END-IF.
