       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN2777B.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
         IF FOO EQ 'A' AND FOO EQ 'B' THEN
          DISPLAY 'TRUE'
         END-IF.