DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 #TEXT  (A50)                                                                              
1 #TAB   (A2/1:10)                                                                          
1 #POS   (N2)                                                                               
1 #LENG  (N2)                                                                               
END-DEFINE

INCLUDE Z1069--C

FORMAT (1) PS=0

MOVE 'ABC   A B C   .A.  .B.  .C.    -A-  -B-  -C- ' TO #TEXT                               
*                                                                                           
MOVE 'AX' TO #TAB(1)                                                                        
MOVE 'BY' TO #TAB(2)                                                                        
MOVE 'CZ' TO #TAB(3)                                                                        
*                                                                                           
*                                                                                           
WRITE (1) NOTITLE / 'EXAMPLE 1  (WITH TRANSLATION TABLE)'                                       
WRITE (1) 'EXAMINE #TEXT TRANSLATE USING #TAB(*)'                                               
WRITE (1) 'Before:' #TEXT                                                                       
EXAMINE #TEXT TRANSLATE USING #TAB(*)                        
WRITE (1) 'After: ' #TEXT                                                                       
*                                                                                           
WRITE (1) / 'EXAMPLE 2  (WITH INVERTED TRANSLATION TABLE)'                                      
WRITE (1) 'EXAMINE #TEXT TRANSLATE USING INVERTED #TAB(*)'                                      
WRITE (1) 'Before:' #TEXT                                                                       
EXAMINE #TEXT TRANSLATE USING INVERTED #TAB(*)               
WRITE (1) 'After: ' #TEXT                                                                       
*                                                                                           
#POS := 13                                                                                  
#LENG:= 15                                                                                  
*                                                                                           
WRITE (1) / 'EXAMPLE 3  (WITH LOWER CASE TRANSLATION)'                                          
WRITE (1) '#POS := 13 ; #LENG:= 15 '                                                            
WRITE (1) 'EXAMINE SUBSTRING(#TEXT,#POS,#LENG) TRANSLATE INTO LOWER CASE'                       
WRITE (1) 'Before:' #TEXT                                                                       
EXAMINE SUBSTRING(#TEXT,#POS,#LENG) TRANSLATE INTO LOWER CASE
WRITE (1) 'After: ' #TEXT                                                                       

END
