DEFINE DATA 
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 VIEW-C VIEW OF EMPLOYNDT
  2 CITY                   

END-DEFINE

INCLUDE Z1069--C
 FORMAT (1) PS=0 LS=80 DF=S

* BOF = Begin of File
* EOF = End of File

* BOF --> EOF
HIST1. HISTOGRAM VIEW-C ASCENDING FOR CITY
	WRITE (1) NOTITLE CITY *NUMBER
END-HISTOGRAM
WRITE (1) NOTITLE 'LAST VALUE' *NUMBER(HIST1.)

WRITE (1) '-----------------------------------------------------'

* BOF --> ENDING AT
* HIST2. HISTOGRAM VIEW-C ASCENDING FOR CITY ENDING AT 'R'
* 	WRITE (1) NOTITLE CITY *NUMBER
* END-HISTOGRAM
* WRITE (1) NOTITLE 'LAST VALUE' *NUMBER(HIST2.)
* 
* WRITE (1) '-----------------------------------------------------'

* BOF -limit-> EOF
HIST3. HISTOGRAM (13) VIEW-C ASCENDING FOR CITY
	WRITE (1) NOTITLE CITY *NUMBER
END-HISTOGRAM
WRITE (1) NOTITLE 'LAST VALUE' *NUMBER(HIST3.)

WRITE (1) '-----------------------------------------------------'

* BOF -limit-> ENDING AT
* HIST4. HISTOGRAM (13) VIEW-C ASCENDING FOR CITY ENDING AT 'R'
* 	WRITE (1) NOTITLE CITY *NUMBER
* END-HISTOGRAM
* WRITE (1) NOTITLE 'LAST VALUE' *NUMBER(HIST4.)
* 
* WRITE (1) '-----------------------------------------------------'

* START --> EOF
HIST5. HISTOGRAM VIEW-C ASCENDING FOR CITY STARTING FROM 'M'
	WRITE (1) NOTITLE CITY *NUMBER
END-HISTOGRAM
WRITE (1) NOTITLE 'LAST VALUE' *NUMBER(HIST5.)

WRITE (1) '-----------------------------------------------------'

* START --> ENDING AT
HIST6. HISTOGRAM VIEW-C ASCENDING FOR CITY STARTING FROM 'M' ENDING AT 'R'
	WRITE (1) NOTITLE CITY *NUMBER
END-HISTOGRAM
WRITE (1) NOTITLE 'LAST VALUE' *NUMBER(HIST6.)

WRITE (1) '-----------------------------------------------------'

* START -limit-> EOF
HIST7. HISTOGRAM (13) VIEW-C ASCENDING FOR CITY STARTING FROM 'M'
	WRITE (1) NOTITLE CITY *NUMBER
END-HISTOGRAM
WRITE (1) NOTITLE 'LAST VALUE' *NUMBER(HIST7.)

WRITE (1) '-----------------------------------------------------'

* START -limit-> ENDING AT
HIST8. HISTOGRAM (13) VIEW-C ASCENDING FOR CITY STARTING FROM 'M' ENDING AT 'R'
	WRITE (1) NOTITLE CITY *NUMBER
END-HISTOGRAM
WRITE (1) NOTITLE 'LAST VALUE' *NUMBER(HIST8.)

WRITE (1) '-----------------------------------------------------'

* START TO END
HIST9. HISTOGRAM VIEW-C ASCENDING FOR CITY STARTING FROM 'M' TO 'R'
	WRITE (1) NOTITLE CITY *NUMBER
END-HISTOGRAM
WRITE (1) NOTITLE 'LAST VALUE' *NUMBER(HIST9.)

WRITE (1) '-----------------------------------------------------'

* START (limit) TO END
HIST10. HISTOGRAM (13) VIEW-C ASCENDING FOR CITY STARTING FROM 'M' TO 'R'
	WRITE (1) NOTITLE CITY *NUMBER
END-HISTOGRAM
WRITE (1) NOTITLE 'LAST VALUE' *NUMBER(HIST10.)

WRITE (1) '-----------------------------------------------------'

* empty
HIST11. HISTOGRAM VIEW-C ASCENDING FOR CITY STARTING FROM 'YS'
	WRITE (1) NOTITLE CITY *NUMBER
END-HISTOGRAM
WRITE (1) NOTITLE 'LAST VALUE' *NUMBER(HIST11.)

BACKOUT TRANSACTION
END
