DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 #A (A20)
1 #A1 (A3)
1 #I (N3)
END-DEFINE
  INCLUDE Z1069--C

WRITE (1) NOTITLE NOHDR  '=' *DATA

FOR #I 1 TO 6
	INPUT #A
	WRITE (1) NOTITLE '=' #A
	WRITE (1) NOTITLE NOHDR  '=' *DATA
END-FOR
  
MOVE 'fff' TO #A1
STACK TOP DATA #A1 
WRITE (1) NOTITLE NOHDR  '=' *DATA

RELEASE STACK
WRITE (1) NOTITLE NOHDR  '=' *DATA

STACK DATA #A1 
WRITE (1) NOTITLE NOHDR  '=' *DATA

FOR #I 1 TO 10
	INPUT #A
	WRITE (1) NOTITLE '=' #A
	WRITE (1) NOTITLE NOHDR  '=' *DATA
END-FOR

END
