DEFINE DATA
LOCAL

1 #B5-TEST-DATA(B5/1:6) CONST <H'0102030405', H'0202030405', H'0202030405', H'0101010101', H'0104010101', H'0201010101'>
1 #A5-TEST-DATA(A5/1:8) CONST <' asdf', 'asdfg', 'asdf ', 'qwert', 'qweru', 'ASDFG', 'QWERT', 'Qoiuz'>
1 #N6_2-TEST-DATA(N6.2/1:10) CONST <-999999.99, 999999.99, 1.0, -1.0, -2.0, 2.0, -123456.78, 123456.78, 0.00, 123456.78>

1 #I(I4)
1 #J(I4)

1 #RN (B5)
1 REDEFINE #RN
  2 #RNB (B5)
1 #BN (B5)
1 REDEFINE #BN
  2 #BNB (B5)
1 #DH (B8)
1 #DI (B8)
1 #DJ (B8)
1 #DK (B10)
1 #DL (B8)
1 #DM (B8)
1 #DN (B8)
1 #QM (A5)
1 REDEFINE #QM
  2 #QMB (B5)
1 #NM (N6.2)
1 REDEFINE #NM
  2 #NMB (B8)
1 #DO (B13)
1 #DP (B8)

* store view DH(B8) = RN(B5 NU){1,5}, BN(B5 NU){1,3} secondary-primary, partial-from-begin
1 V2004-DH-S VIEW OF DDM2004
  2 FELD-RN
  2 FELD-BN

* read view DH(B8) = RN(B5 NU){1,5}, BN(B5 NU){1,3} secondary-primary, partial-from-begin
1 V2004-DH-R VIEW OF DDM2004
  2 FELD-RN
  2 FELD-BN
  2 SP-DH


* store view DI(B8) = RN(B5 NU){1,5}, BN(B5 NU){2,4} secondary-primary, partial-from-middle
1 V2004-DI-S VIEW OF DDM2004
  2 FELD-RN
  2 FELD-BN

* read view DI(B8) = RN(B5 NU){1,5}, BN(B5 NU){2,4} secondary-primary, partial-from-middle
1 V2004-DI-R VIEW OF DDM2004
  2 FELD-RN
  2 FELD-BN
  2 SP-DI


* store view DJ(B8) = RN(B5 NU){1,5}, BN(B5 NU){3,5} secondary-primary, partial-from-end
1 V2004-DJ-S VIEW OF DDM2004
  2 FELD-RN
  2 FELD-BN

* read view DJ(B8) = RN(B5 NU){1,5}, BN(B5 NU){3,5} secondary-primary, partial-from-end
1 V2004-DJ-R VIEW OF DDM2004
  2 FELD-RN
  2 FELD-BN
  2 SP-DJ


* store view DK(B10) = BN(B5 NU){1,5}, RN(B5 NU){1,5} primary-secondary, full
1 V2004-DK-S VIEW OF DDM2004
  2 FELD-BN
  2 FELD-RN

* read view DK(B10) = BN(B5 NU){1,5}, RN(B5 NU){1,5} primary-secondary, full
1 V2004-DK-R VIEW OF DDM2004
  2 FELD-BN
  2 FELD-RN
  2 SP-DK


* store view DL(B8) = BN(B5 NU){1,3}, RN(B5 NU){1,5} primary-secondary, partial-from-begin
1 V2004-DL-S VIEW OF DDM2004
  2 FELD-BN
  2 FELD-RN

* read view DL(B8) = BN(B5 NU){1,3}, RN(B5 NU){1,5} primary-secondary, partial-from-begin
1 V2004-DL-R VIEW OF DDM2004
  2 FELD-BN
  2 FELD-RN
  2 SP-DL


* store view DM(B8) = BN(B5 NU){2,4}, RN(B5 NU){1,5} primary-secondary, partial-from-middle
1 V2004-DM-S VIEW OF DDM2004
  2 FELD-BN
  2 FELD-RN

* read view DM(B8) = BN(B5 NU){2,4}, RN(B5 NU){1,5} primary-secondary, partial-from-middle
1 V2004-DM-R VIEW OF DDM2004
  2 FELD-BN
  2 FELD-RN
  2 SP-DM


* store view DN(B8) = BN(B5 NU){3,5}, RN(B5 NU){1,5} primary-secondary, partial-from-end
1 V2004-DN-S VIEW OF DDM2004
  2 FELD-BN
  2 FELD-RN

* read view DN(B8) = BN(B5 NU){3,5}, RN(B5 NU){1,5} primary-secondary, partial-from-end
1 V2004-DN-R VIEW OF DDM2004
  2 FELD-BN
  2 FELD-RN
  2 SP-DN


* store view DO(A13) = QM(A5){1,5}, NM(N6.2){1,8} secondary-primary, full
1 V2004-DO-S VIEW OF DDM2004
  2 FELD-QM
  2 FELD-NM

* read view DO(A13) = QM(A5){1,5}, NM(N6.2){1,8} secondary-primary, full
1 V2004-DO-R VIEW OF DDM2004
  2 FELD-QM
  2 FELD-NM
  2 SP-DO


* store view DP(A8) = QM(A5){1,5}, NM(N6.2){1,3} secondary-primary, partial-from-begin
1 V2004-DP-S VIEW OF DDM2004
  2 FELD-QM
  2 FELD-NM

* read view DP(A8) = QM(A5){1,5}, NM(N6.2){1,3} secondary-primary, partial-from-begin
1 V2004-DP-R VIEW OF DDM2004
  2 FELD-QM
  2 FELD-NM
  2 SP-DP



END-DEFINE

FORMAT (1) LS=180 PS=0

DEFINE SUBROUTINE DELETE-ALL
  READ V2004-DH-S BY ISN
    DELETE
  END-READ
  END TRANSACTION
END-SUBROUTINE

DEFINE SUBROUTINE PRINT-DH
  MOVE V2004-DH-R.FELD-RN TO #RN
  MOVE V2004-DH-R.FELD-BN TO #BN
  MOVE V2004-DH-R.SP-DH TO #DH
  WRITE (1) NOTITLE #RN #RNB #BN #BNB #DH
END-SUBROUTINE

DEFINE SUBROUTINE PRINT-DI
  MOVE V2004-DI-R.FELD-RN TO #RN
  MOVE V2004-DI-R.FELD-BN TO #BN
  MOVE V2004-DI-R.SP-DI TO #DI
  WRITE (1) NOTITLE #RN #RNB #BN #BNB #DI
END-SUBROUTINE

DEFINE SUBROUTINE PRINT-DJ
  MOVE V2004-DJ-R.FELD-RN TO #RN
  MOVE V2004-DJ-R.FELD-BN TO #BN
  MOVE V2004-DJ-R.SP-DJ TO #DJ
  WRITE (1) NOTITLE #RN #RNB #BN #BNB #DJ
END-SUBROUTINE

DEFINE SUBROUTINE PRINT-DK
  MOVE V2004-DK-R.FELD-BN TO #BN
  MOVE V2004-DK-R.FELD-RN TO #RN
  MOVE V2004-DK-R.SP-DK TO #DK
  WRITE (1) NOTITLE #BN #BNB #RN #RNB #DK
END-SUBROUTINE

DEFINE SUBROUTINE PRINT-DL
  MOVE V2004-DL-R.FELD-BN TO #BN
  MOVE V2004-DL-R.FELD-RN TO #RN
  MOVE V2004-DL-R.SP-DL TO #DL
  WRITE (1) NOTITLE #BN #BNB #RN #RNB #DL
END-SUBROUTINE

DEFINE SUBROUTINE PRINT-DM
  MOVE V2004-DM-R.FELD-BN TO #BN
  MOVE V2004-DM-R.FELD-RN TO #RN
  MOVE V2004-DM-R.SP-DM TO #DM
  WRITE (1) NOTITLE #BN #BNB #RN #RNB #DM
END-SUBROUTINE

DEFINE SUBROUTINE PRINT-DN
  MOVE V2004-DN-R.FELD-BN TO #BN
  MOVE V2004-DN-R.FELD-RN TO #RN
  MOVE V2004-DN-R.SP-DN TO #DN
  WRITE (1) NOTITLE #BN #BNB #RN #RNB #DN
END-SUBROUTINE

DEFINE SUBROUTINE PRINT-DO
  MOVE V2004-DO-R.FELD-QM TO #QM
  MOVE V2004-DO-R.FELD-NM TO #NM
  MOVE V2004-DO-R.SP-DO TO #DO
  WRITE (1) NOTITLE #QM #QMB #NM #NMB #DO
END-SUBROUTINE

DEFINE SUBROUTINE PRINT-DP
  MOVE V2004-DP-R.FELD-QM TO #QM
  MOVE V2004-DP-R.FELD-NM TO #NM
  MOVE V2004-DP-R.SP-DP TO #DP
  WRITE (1) NOTITLE #QM #QMB #NM #NMB #DP
END-SUBROUTINE


* superdescriptor DH(B8) = RN(B5 NU){1,5}, BN(B5 NU){1,3}
* make file empty
PERFORM DELETE-ALL

* two empty records
RESET V2004-DH-S
STORE V2004-DH-S
RESET V2004-DH-S
STORE V2004-DH-S

* regular test data
FOR #I = 1 TO *OCCURRENCE(#B5-TEST-DATA)
  FOR #J = 1 TO *OCCURRENCE(#B5-TEST-DATA)
    RESET V2004-DH-S
    MOVE #B5-TEST-DATA(#I) TO V2004-DH-S.FELD-RN
    MOVE #B5-TEST-DATA(#J) TO V2004-DH-S.FELD-BN
    STORE V2004-DH-S
  END-FOR
END-FOR
END TRANSACTION

RESET V2004-DH-R
WRITE (1) NOTITLE / 'DH(B8) = RN(B5 NU){1,5}, BN(B5 NU){1,3}, secondary-primary, partial-from-begin: read by isn'
READ V2004-DH-R BY ISN
  PERFORM PRINT-DH
END-READ

RESET V2004-DH-R
WRITE (1) NOTITLE / 'DH(B8) = RN(B5 NU){1,5}, BN(B5 NU){1,3}, secondary-primary, partial-from-begin: read by field descriptor BN'
READ V2004-DH-R BY FELD-BN
  PERFORM PRINT-DH
END-READ

* make file empty again
PERFORM DELETE-ALL


* superdescriptor DI(B8) = RN(B5 NU){1,5}, BN(B5 NU){2,4}
* make file empty
PERFORM DELETE-ALL

* two empty records
RESET V2004-DI-S
STORE V2004-DI-S
RESET V2004-DI-S
STORE V2004-DI-S

* regular test data
FOR #I = 1 TO *OCCURRENCE(#B5-TEST-DATA)
  FOR #J = 1 TO *OCCURRENCE(#B5-TEST-DATA)
    RESET V2004-DI-S
    MOVE #B5-TEST-DATA(#I) TO V2004-DI-S.FELD-RN
    MOVE #B5-TEST-DATA(#J) TO V2004-DI-S.FELD-BN
    STORE V2004-DI-S
  END-FOR
END-FOR
END TRANSACTION

RESET V2004-DI-R
WRITE (1) NOTITLE / 'DI(B8) = RN(B5 NU){1,5}, BN(B5 NU){2,4}, secondary-primary, partial-from-middle: read by isn'
READ V2004-DI-R BY ISN
  PERFORM PRINT-DI
END-READ

RESET V2004-DI-R
WRITE (1) NOTITLE / 'DI(B8) = RN(B5 NU){1,5}, BN(B5 NU){2,4}, secondary-primary, partial-from-middle: read by field descriptor BN'
READ V2004-DI-R BY FELD-BN
  PERFORM PRINT-DI
END-READ

* make file empty again
PERFORM DELETE-ALL


* superdescriptor DJ(B8) = RN(B5 NU){1,5}, BN(B5 NU){3,5}
* make file empty
PERFORM DELETE-ALL

* two empty records
RESET V2004-DJ-S
STORE V2004-DJ-S
RESET V2004-DJ-S
STORE V2004-DJ-S

* regular test data
FOR #I = 1 TO *OCCURRENCE(#B5-TEST-DATA)
  FOR #J = 1 TO *OCCURRENCE(#B5-TEST-DATA)
    RESET V2004-DJ-S
    MOVE #B5-TEST-DATA(#I) TO V2004-DJ-S.FELD-RN
    MOVE #B5-TEST-DATA(#J) TO V2004-DJ-S.FELD-BN
    STORE V2004-DJ-S
  END-FOR
END-FOR
END TRANSACTION

RESET V2004-DJ-R
WRITE (1) NOTITLE / 'DJ(B8) = RN(B5 NU){1,5}, BN(B5 NU){3,5}, secondary-primary, partial-from-end: read by isn'
READ V2004-DJ-R BY ISN
  PERFORM PRINT-DJ
END-READ

RESET V2004-DJ-R
WRITE (1) NOTITLE / 'DJ(B8) = RN(B5 NU){1,5}, BN(B5 NU){3,5}, secondary-primary, partial-from-end: read by field descriptor BN'
READ V2004-DJ-R BY FELD-BN
  PERFORM PRINT-DJ
END-READ

* make file empty again
PERFORM DELETE-ALL


* superdescriptor DK(B10) = BN(B5 NU){1,5}, RN(B5 NU){1,5}
* make file empty
PERFORM DELETE-ALL

* two empty records
RESET V2004-DK-S
STORE V2004-DK-S
RESET V2004-DK-S
STORE V2004-DK-S

* regular test data
FOR #I = 1 TO *OCCURRENCE(#B5-TEST-DATA)
  FOR #J = 1 TO *OCCURRENCE(#B5-TEST-DATA)
    RESET V2004-DK-S
    MOVE #B5-TEST-DATA(#I) TO V2004-DK-S.FELD-BN
    MOVE #B5-TEST-DATA(#J) TO V2004-DK-S.FELD-RN
    STORE V2004-DK-S
  END-FOR
END-FOR
END TRANSACTION

RESET V2004-DK-R
WRITE (1) NOTITLE / 'DK(B10) = BN(B5 NU){1,5}, RN(B5 NU){1,5}, primary-secondary, full: read by isn'
READ V2004-DK-R BY ISN
  PERFORM PRINT-DK
END-READ

RESET V2004-DK-R
WRITE (1) NOTITLE / 'DK(B10) = BN(B5 NU){1,5}, RN(B5 NU){1,5}, primary-secondary, full: read by field descriptor BN'
READ V2004-DK-R BY FELD-BN
  PERFORM PRINT-DK
END-READ

* make file empty again
PERFORM DELETE-ALL


* superdescriptor DL(B8) = BN(B5 NU){1,3}, RN(B5 NU){1,5}
* make file empty
PERFORM DELETE-ALL

* two empty records
RESET V2004-DL-S
STORE V2004-DL-S
RESET V2004-DL-S
STORE V2004-DL-S

* regular test data
FOR #I = 1 TO *OCCURRENCE(#B5-TEST-DATA)
  FOR #J = 1 TO *OCCURRENCE(#B5-TEST-DATA)
    RESET V2004-DL-S
    MOVE #B5-TEST-DATA(#I) TO V2004-DL-S.FELD-BN
    MOVE #B5-TEST-DATA(#J) TO V2004-DL-S.FELD-RN
    STORE V2004-DL-S
  END-FOR
END-FOR
END TRANSACTION

RESET V2004-DL-R
WRITE (1) NOTITLE / 'DL(B8) = BN(B5 NU){1,3}, RN(B5 NU){1,5}, primary-secondary, partial-from-begin: read by isn'
READ V2004-DL-R BY ISN
  PERFORM PRINT-DL
END-READ

RESET V2004-DL-R
WRITE (1) NOTITLE / 'DL(B8) = BN(B5 NU){1,3}, RN(B5 NU){1,5}, primary-secondary, partial-from-begin: read by field descriptor BN'
READ V2004-DL-R BY FELD-BN
  PERFORM PRINT-DL
END-READ

* make file empty again
PERFORM DELETE-ALL


* superdescriptor DM(B8) = BN(B5 NU){2,4}, RN(B5 NU){1,5}
* make file empty
PERFORM DELETE-ALL

* two empty records
RESET V2004-DM-S
STORE V2004-DM-S
RESET V2004-DM-S
STORE V2004-DM-S

* regular test data
FOR #I = 1 TO *OCCURRENCE(#B5-TEST-DATA)
  FOR #J = 1 TO *OCCURRENCE(#B5-TEST-DATA)
    RESET V2004-DM-S
    MOVE #B5-TEST-DATA(#I) TO V2004-DM-S.FELD-BN
    MOVE #B5-TEST-DATA(#J) TO V2004-DM-S.FELD-RN
    STORE V2004-DM-S
  END-FOR
END-FOR
END TRANSACTION

RESET V2004-DM-R
WRITE (1) NOTITLE / 'DM(B8) = BN(B5 NU){2,4}, RN(B5 NU){1,5}, primary-secondary, partial-from-middle: read by isn'
READ V2004-DM-R BY ISN
  PERFORM PRINT-DM
END-READ

RESET V2004-DM-R
WRITE (1) NOTITLE / 'DM(B8) = BN(B5 NU){2,4}, RN(B5 NU){1,5}, primary-secondary, partial-from-middle: read by field descriptor BN'
READ V2004-DM-R BY FELD-BN
  PERFORM PRINT-DM
END-READ

* make file empty again
PERFORM DELETE-ALL


* superdescriptor DN(B8) = BN(B5 NU){3,5}, RN(B5 NU){1,5}
* make file empty
PERFORM DELETE-ALL

* two empty records
RESET V2004-DN-S
STORE V2004-DN-S
RESET V2004-DN-S
STORE V2004-DN-S

* regular test data
FOR #I = 1 TO *OCCURRENCE(#B5-TEST-DATA)
  FOR #J = 1 TO *OCCURRENCE(#B5-TEST-DATA)
    RESET V2004-DN-S
    MOVE #B5-TEST-DATA(#I) TO V2004-DN-S.FELD-BN
    MOVE #B5-TEST-DATA(#J) TO V2004-DN-S.FELD-RN
    STORE V2004-DN-S
  END-FOR
END-FOR
END TRANSACTION

RESET V2004-DN-R
WRITE (1) NOTITLE / 'DN(B8) = BN(B5 NU){3,5}, RN(B5 NU){1,5}, primary-secondary, partial-from-end: read by isn'
READ V2004-DN-R BY ISN
  PERFORM PRINT-DN
END-READ

RESET V2004-DN-R
WRITE (1) NOTITLE / 'DN(B8) = BN(B5 NU){3,5}, RN(B5 NU){1,5}, primary-secondary, partial-from-end: read by field descriptor BN'
READ V2004-DN-R BY FELD-BN
  PERFORM PRINT-DN
END-READ

* make file empty again
PERFORM DELETE-ALL


* superdescriptor DO(A13) = QM(A5){1,5}, NM(N6.2){1,8}
* make file empty
PERFORM DELETE-ALL

* two empty records
RESET V2004-DO-S
STORE V2004-DO-S
RESET V2004-DO-S
STORE V2004-DO-S

* regular test data
FOR #I = 1 TO *OCCURRENCE(#A5-TEST-DATA)
  FOR #J = 1 TO *OCCURRENCE(#N6_2-TEST-DATA)
    RESET V2004-DO-S
    MOVE #A5-TEST-DATA(#I) TO V2004-DO-S.FELD-QM
    MOVE #N6_2-TEST-DATA(#J) TO V2004-DO-S.FELD-NM
    STORE V2004-DO-S
  END-FOR
END-FOR
END TRANSACTION

RESET V2004-DO-R
WRITE (1) NOTITLE / 'DO(A13) = QM(A5){1,5}, NM(N6.2){1,8}, secondary-primary, full: read by isn'
READ V2004-DO-R BY ISN
  PERFORM PRINT-DO
END-READ

RESET V2004-DO-R
WRITE (1) NOTITLE / 'DO(A13) = QM(A5){1,5}, NM(N6.2){1,8}, secondary-primary, full: read by field descriptor NM'
READ V2004-DO-R BY FELD-NM
  PERFORM PRINT-DO
END-READ

* make file empty again
PERFORM DELETE-ALL


* superdescriptor DP(A8) = QM(A5){1,5}, NM(N6.2){1,3}
* make file empty
PERFORM DELETE-ALL

* two empty records
RESET V2004-DP-S
STORE V2004-DP-S
RESET V2004-DP-S
STORE V2004-DP-S

* regular test data
FOR #I = 1 TO *OCCURRENCE(#A5-TEST-DATA)
  FOR #J = 1 TO *OCCURRENCE(#N6_2-TEST-DATA)
    RESET V2004-DP-S
    MOVE #A5-TEST-DATA(#I) TO V2004-DP-S.FELD-QM
    MOVE #N6_2-TEST-DATA(#J) TO V2004-DP-S.FELD-NM
    STORE V2004-DP-S
  END-FOR
END-FOR
END TRANSACTION

RESET V2004-DP-R
WRITE (1) NOTITLE / 'DP(A8) = QM(A5){1,5}, NM(N6.2){1,3}, secondary-primary, partial-from-begin: read by isn'
READ V2004-DP-R BY ISN
  PERFORM PRINT-DP
END-READ

RESET V2004-DP-R
WRITE (1) NOTITLE / 'DP(A8) = QM(A5){1,5}, NM(N6.2){1,3}, secondary-primary, partial-from-begin: read by field descriptor NM'
READ V2004-DP-R BY FELD-NM
  PERFORM PRINT-DP
END-READ

* make file empty again
PERFORM DELETE-ALL



END
