**************************************************************************
** Test for WMEE-4060
** Test with a 1-dimensional F4 array
** NMIN and NAVER not yet implemented in mee-runtime, therefore not tested
**************************************************************************

DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L

LOCAL
1 #A10 (A10)
1 #FIELD (F4/5:6)
1 #CNT (N1)
END-DEFINE

INCLUDE Z1069--C

FORMAT (1) PS=30 LS=200

FOR #CNT FROM 4 TO 1 STEP -1
  MOVE ALL #CNT TO #A10
  #FIELD(*) := #CNT + (#CNT / 100.0)
  WRITE (1) NOTITLE 'in FOR:' #A10 #FIELD(*) (EM=99.999)
END-ALL
AND SORT BY #A10 USING #FIELD(*)
  AT END OF DATA
    WRITE (1) NOTITLE 'in SORT BREAK:' 'COUNT ' COUNT(#FIELD(*)) (EM=99.999)
    WRITE (1) NOTITLE 'in SORT BREAK:' 'NCOUNT' NCOUNT(#FIELD(*)) (EM=99.999)
    WRITE (1) NOTITLE 'in SORT BREAK:' 'MIN   ' MIN(#FIELD(*)) (EM=99.999)
    WRITE (1) NOTITLE 'in SORT BREAK:' 'MAX   ' MAX(#FIELD(*)) (EM=99.999)
    WRITE (1) NOTITLE 'in SORT BREAK:' 'SUM   ' SUM(#FIELD(*)) (EM=99.999)
    WRITE (1) NOTITLE 'in SORT BREAK:' 'AVER  ' AVER(#FIELD(*)) (EM=99.999)
    WRITE (1) NOTITLE 'in SORT BREAK:' 'TOTAL ' TOTAL(#FIELD(*)) (EM=99.999)
  END-ENDDATA
  WRITE (1) NOTITLE 'in SORT:' #A10 #FIELD(*) (EM=99.999)
END-SORT

END
