DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
01 #FILE-RECORD         (A20)
01 REDEFINE #FILE-RECORD 
   02 #FILE-RECORD-SORT (A10)
END-DEFINE
*
INCLUDE Z1069--C
*
DEFINE WORK FILE 1 'WF-TEST'
SET CONTROL '+'
*
UPLOAD PC FILE 1 #FILE-RECORD
	WRITE(1) NOTITLE NOHDR '=' #FILE-RECORD
END-ALL
*
SORT #FILE-RECORD-SORT USING #FILE-RECORD
	WRITE(1) NOTITLE NOHDR '=' #FILE-RECORD
END-SORT
*
CLOSE PC FILE 1
*
END
