DEFINE DATA
PARAMETER
1 I (I4)
END-DEFINE

FORMAT (1) PS=20

WRITE (1) TITLE LEFT 'Page' /

AT TOP OF PAGE (1)
  WRITE (1) 'TOP-1' *PROGRAM 
  WRITE (1) 'TOP-2' *PROGRAM 
  WRITE (1) 'TOP-3' *PROGRAM 
  WRITE (1) 'TOP-4' *PROGRAM 
END-TOPPAGE

WRITE (1) *PROGRAM 'I' I 

END
