/* tests UPDATE of MU and PEMU in a super descriptor */

/*  SUPER    I  SE  I   10   I    A   I NU,MU             I AL (   1 -   5 )   A 
/*           I      I        I        I                   I AB (   1 -   5 )   A 
/* -------------------------------------------------------------------------------
/*  SUPER    I  SF  I   10   I    A   I NU,MU,PE          I AL (   1 -   5 )   A 
/*           I      I        I        I                   I AF (   1 -   5 )   A 
/* -------------------------------------------------------------------------------

DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL

1 DDM1016 VIEW OF DDM1016
   2 AL-1 (A5) 
      
1 #CNT (N3)
1 #A (N3)
1 #I (N3)
1 #J (N3)

END-DEFINE

INCLUDE Z1069--C
FORMAT (1) PS=0

/* delete
READ DDM1016 BY ISN
   DELETE
   END TRANSACTION
END-READ

/* store in empty db
PERFORM COUNT
RESET DDM1016
FOR #I 1 5
   MOVE #I TO AL-1
   STORE DDM1016
END-FOR
PERFORM READ
   
/* update to force update of superdescriptors
PERFORM COUNT
RESET DDM1016
READ DDM1016 BY ISN
	MOVE 'x' TO AL-1
	UPDATE
END-READ
PERFORM READ
   
/* update to force update of superdescriptors
PERFORM COUNT
RESET DDM1016
READ DDM1016 BY ISN
	MOVE ' ' TO AL-1
	UPDATE
END-READ
PERFORM READ

/* delete
READ DDM1016 BY ISN
   DELETE
   END TRANSACTION
END-READ
            
DEFINE SUBROUTINE READ
	WRITE (1) NOTITLE / 'read by isn'
	READ DDM1016 BY ISN
		PERFORM WRITEVIEW
	END-READ
	WRITE (1) NOTITLE / 'read by super descriptor SE'
	READ DDM1016 BY SE-1
		PERFORM WRITEVIEW
	END-READ
	WRITE (1) NOTITLE / 'read by super descriptor SF'
	READ DDM1016 BY SF-1
		PERFORM WRITEVIEW
	END-READ
END-SUBROUTINE

DEFINE SUBROUTINE COUNT
	ADD 1 TO #CNT
	WRITE (1) NOTITLE / 'test' #CNT
END-SUBROUTINE

DEFINE SUBROUTINE WRITEVIEW
	WRITE (1) NOTITLE DDM1016
END-SUBROUTINE

END
