DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 #AFDC-GRANT-REIMB-HHN   (A11)
1 REDEFINE #AFDC-GRANT-REIMB-HHN
  2 #HOUSEHOLD-NUM        (A10)
1 REDEFINE #AFDC-GRANT-REIMB-HHN
  2 #COUNTY               (A2)
  2 #AFDC-HHN             (A9)
END-DEFINE

INCLUDE Z1069--C
FORMAT (1) PS=0

DEFINE WORK FILE 1 'src/res/solid/workfiles/WORKFILE.WMEE1029G.txt' TYPE 'CSV'
* DEFINE WORK FILE 1 'C:\in\WORKFILE.WMEE1029G.txt' TYPE 'CSV'

READ WORK 1 #AFDC-GRANT-REIMB-HHN
*  WRITE (1) NOTITLE 'READ WORK:' FIELD-A11
END-ALL

SORT RECORDS
    BY #COUNTY
       #AFDC-HHN
 USING #AFDC-GRANT-REIMB-HHN
  WRITE (1) NOTITLE '=' #AFDC-GRANT-REIMB-HHN
  AT BREAK #HOUSEHOLD-NUM
     WRITE (1) NOTITLE '---- AT BREAK #HOUSEHOLD-NUM'
  END-BREAK
  AT BREAK #COUNTY
     WRITE (1) NOTITLE '---- AT BREAK #COUNTY'
  END-BREAK

END-SORT

END
