DEFINE DATA LOCAL
1 #G-DBID (A004)
1 #ITMCD-ARRAY (A008/00001:00012)
1 #ITMCDDESC-ARRAY (A027/00001:00012)
1 #ITMPRICE-ARRAY (N09.2/00001:00012)
1 #ITMQTY-ARRAY (N04.0/00001:00012)
1 #MAP-OFCNAME (A045)
1 #MAP-REASON (A040)
1 #PLTSOLDMOS-ARRAY (N03.0/00001:00012)
1 #PLTVALIDITYTERM-ARRAY (N02.0/00001:00012)
END-DEFINE

FORMAT PS=30                 
SET KEY ALL
SET KEY PF1 = HELP
  
INPUT USING MAP 'MEE1875B'

END
