DEFINE DATA
GLOBAL USING MEE2776G
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
01         #MAPFIELDS
  02       #PROGRAM                    (A008)
  02       #M-FELD1                    (A010)
01         #CONST
  02       #C-FELD1                    (A001)  CONST <"1">  
END-DEFINE

INCLUDE Z1069--C

DECIDE ON FIRST VALUE OF  #C-FELD1
 	VALUE  '1'
 		SET CONTROL 'N'
		INPUT USING MAP 'MEE2776M'
 		WRITE (1) NOTITLE *LEVEL
	NONE
    	IGNORE
END-DECIDE

IF G-AUFRUFE <= 5
	ADD 1 TO G-AUFRUFE
 	SET CONTROL 'N'
    REINPUT FULL  "TESTSTRING"
END-IF

WRITE (1) NOTITLE "ALLES GUT"
*
*
END


