DEFINE DATA
LOCAL
1 #I (N8)
1 #COUNT (N1)
1 #OPT (A1)
END-DEFINE

FORMAT PS=18
SET KEY ALL

REPEAT
  #I := 1
  ADD 1 TO #COUNT
  
  REPEAT UNTIL #I GT 3
     ADD 1 TO #I
     
     IF #I GT 3
        WRITE '*'(10) "MEE2926M EOD" '*'(10)
        
        IF *LINE-COUNT GT 18
        	IGNORE
        ELSE        
           REPEAT UNTIL *LINE-COUNT GT 18
              WRITE 'COUNT: ' #COUNT 'LINE COUNT: ' *LINE-COUNT
           END-REPEAT
        END-IF
     END-IF
  END-REPEAT
END-REPEAT

WRITE TITLE 'TITLE MEE2926M'

AT END OF PAGE
 INPUT 2/1 'FIRST TIME ENTER T AND PRESS ENTER'
  3/1 'AND THEN FINISH WITH F12:' #OPT
  
 IF #OPT EQ 'T'
  FETCH 'MEE2926C'
  ESCAPE BOTTOM
 END-IF
 
 IF *PF-KEY EQ 'PF12'
  ESCAPE ROUTINE IMMEDIATE
 END-IF
END-ENDPAGE

END
