DEFINE DATA
LOCAL
	1 #SEQ-NUM (N2) INIT <1>
	1 #LINE-COUNT (P2)
END-DEFINE

FORMAT PS=19 LS=80 IS=ON SG=OFF ZP=OFF
SET KEY ALL

RESET #LINE-COUNT
REPEAT UNTIL #SEQ-NUM EQ 17
	DISPLAY NOTITLE NOHDR #SEQ-NUM *LINE-COUNT
	ADD 1 TO #SEQ-NUM
END-REPEAT
PERFORM END-OF-DATA

DEFINE SUBROUTINE END-OF-DATA
	#LINE-COUNT := *LINE-COUNT
	DISPLAY #LINE-COUNT *LINE-COUNT
	
	IF #LINE-COUNT GT 19
		IGNORE
	ELSE
		DISPLAY '******** END OF DATA ********'
		REPEAT WHILE TRUE
			ADD 1 TO #LINE-COUNT
			IF #LINE-COUNT GT 19
				ESCAPE BOTTOM
			ELSE
				SKIP 1
			END-IF
		END-REPEAT
	END-IF
END-SUBROUTINE

WRITE TITLE 1/1 'MULTI' 2/1 'LINE' 3/1 'TITLE'

AT END OF PAGE
	INPUT 'LINE COUNT' *LINE-COUNT(AD=OD) 'PRESS ENTER'
END-ENDPAGE

END
