DEFINE DATA
LOCAL
1 #D (A1)
END-DEFINE

/* test set key command and named */

PERFORM MEE2911O

SET KEY OFF
INPUT #D 'MEE2911N'
CALLNAT 'MEE2911Q'

SET KEY OFF
INPUT #D 'MEE2911N'
FETCH RETURN 'MEE2911S'

END
