* ---------------------------------------------------------------------
* FNARR21P
*
* Testprogramm fuer ASSIGN zwischen V-Array und normalem Array
*
* Autor:   Frank Neudert
* Datum:   13.05.2015
*
* ---------------------------------------------------------------------
*
DEFINE DATA
*
LOCAL
  1 KUNZ00P-DV(1:*) /* alias=KundeKennzahlen
   2  VR-KEY (N3) /* exitmove
   2  KUNDENKZ (N9) /* exitmove
   2  VF-VKTO (N7) /* alias=kundenbetreuer
   2  PAC (N9)
   2  PAC-STATUS (A) DYNAMIC /* exitmove;al=20
   2  KIS-RATING (A) DYNAMIC /* al=5
   2  CS-MODELL (A) DYNAMIC /* al=10
   2  SCHADENSATZ-GESAMT (N4)
   2  SCHADENSATZ-ANZAHL (N7)
   2  SCHADENSATZ-GESAMT-TK (N4)
   2  SCHADENSATZ-ANZAHL-TK (N7)
   2  C#SCHADENSATZ (N3) /* exitmove
   2 SCHADENSATZ(1:*)
    3  SC-SATZ-PROZ (N4)
    3  SC-SATZ-ANZ (N7)
    3  SC-SATZ-TYP (A) DYNAMIC /* exitmove;al=5
   2  TIMESTMP (A) DYNAMIC /* exitmove;al=16
   2  MSG (A) DYNAMIC /* exitmove;al=79
*
01 #I-FOR-1 (P7)

LOCAL USING Z1069--A
LOCAL USING Z1069--L
END-DEFINE
*
INCLUDE Z1069--C
FORMAT (1) PS=0

WRITE (1) NOTITLE *PROGRAM 'START'
*
FOR  #I-FOR-1                        FROM  1 TO 2
  EXPAND ARRAY  KUNZ00P-DV             TO  (1:1)
  EXPAND ARRAY  KUNZ00P-DV.SCHADENSATZ TO  (*, 1:1)
  WRITE (1) NOTITLE 'Loop' #I-FOR-1

  WRITE (1) NOTITLE 'Erweitern #X-ARRAY'

  EXPAND ARRAY KUNZ00P-DV                TO  (1:1)
  EXPAND ARRAY KUNZ00P-DV.SCHADENSATZ    TO  (*, 1:4)

  WRITE (1) NOTITLE *PROGRAM 'Fuelle Felder'
  MOVE  123                          TO  KUNZ00P-DV.VR-KEY(1)
  MOVE  1111                         TO  KUNZ00P-DV.SC-SATZ-PROZ(1, 1)
  MOVE  2222                         TO  KUNZ00P-DV.SC-SATZ-PROZ(1, 2)
  MOVE  3333                         TO  KUNZ00P-DV.SC-SATZ-PROZ(1, 3)
  MOVE  4444                         TO  KUNZ00P-DV.SC-SATZ-PROZ(1, 4)

  WRITE (1) NOTITLE *PROGRAM 'Ergebnis: '
  WRITE (1) NOTITLE 'VR-KEY .....:' KUNZ00P-DV.VR-KEY(1)
  WRITE (1) NOTITLE 'SC-SATZ-PROZ:' KUNZ00P-DV.SC-SATZ-PROZ(1, 1)
  WRITE (1) NOTITLE 'SC-SATZ-PROZ:' KUNZ00P-DV.SC-SATZ-PROZ(1, 2)
  WRITE (1) NOTITLE 'SC-SATZ-PROZ:' KUNZ00P-DV.SC-SATZ-PROZ(1, 3)
  WRITE (1) NOTITLE 'SC-SATZ-PROZ:' KUNZ00P-DV.SC-SATZ-PROZ(1, 4)
  
  REDUCE ARRAY KUNZ00P-DV TO  0
END-FOR
*
*
WRITE (1) NOTITLE *PROGRAM 'ENDE'
*
END
