DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
END-DEFINE

INCLUDE Z1069--C

DEFINE PRINTER (PRT1 = 1)
FORMAT (PRT1) PS=5

AT END OF PAGE (PRT1)
  WRITE (PRT1) NOTITLE 'eop'
END-ENDPAGE

WRITE (PRT1) NOTITLE '1'
WRITE (PRT1) NOTITLE '2'
WRITE (PRT1) NOTITLE '3'
WRITE (PRT1) NOTITLE '4'
WRITE (PRT1) NOTITLE '5'
WRITE (PRT1) NOTITLE 'new page'
DEFINE PRINTER (PRT1 = 1)

* no write -> old file must remain
* WRITE (PRT1) NOTITLE 'after DEFINE PRINTER #2'

END
