DEFINE DATA
LOCAL
1 #SEL                    (A1)
END-DEFINE
* --------------------------------------------------------
*
DEFINE WINDOW OPTION
  SIZE 11*19
  BASE 6/61
  TITLE 'Valid Options'
  FRAMED ON
DEFINE WINDOW OPTION2
  SIZE 11*19
  BASE 6/61
  TITLE 'Valid Options'
  FRAMED
DEFINE WINDOW OPTION3
  SIZE 11*19
  BASE 6/61
  TITLE 'Valid Options'
  FRAMED OFF
DEFINE WINDOW OPTION4
  SIZE 11*19
  BASE 6/61
  TITLE 'Valid Options'
*
SET KEY ALL
FORMAT SG=OFF PS=17 ZP=ON HW=OFF

INPUT (IP=OFF AD=LIM'_' ZP=OFF PS=23)
    02/01  'PF7 = POP-UP-1'
    03/01  'PF8 = POP-UP-2'
    04/01  'PF9 = POP-UP-3'
    05/01  'PF10 = POP-UP-4'
    06/01  'PF12 = EXIT'
*
  IF *PF-KEY = 'PF7'
    SET WINDOW 'OPTION'
          INPUT (AD=MA'_')
            01/01 'Opt Name'
            02/01 '--- ------'
            03/01 ' R  Review'
            04/01 ' U  Update'
            05/01 ' D  Delete'
            06/01 ' K  Copy'
            08/01  'Selection:' #SEL
          SET WINDOW OFF
    FETCH 'MEE2939E'
  END-IF
  IF *PF-KEY = 'PF8'
    SET WINDOW 'OPTION2'
          INPUT (AD=MA'_')
            01/01 'Opt Name'
            02/01 '--- ------'
            03/01 ' R  Review'
            04/01 ' U  Update'
            05/01 ' D  Delete'
            06/01 ' K  Copy'
            08/01  'Selection:' #SEL
          SET WINDOW OFF
    FETCH 'MEE2939E'
  END-IF
  IF *PF-KEY = 'PF9'
    SET WINDOW 'OPTION3'
          INPUT (AD=MA'_')
            01/01 'Opt Name'
            02/01 '--- ------'
            03/01 ' R  Review'
            04/01 ' U  Update'
            05/01 ' D  Delete'
            06/01 ' K  Copy'
            08/01  'Selection:' #SEL
          SET WINDOW OFF
    FETCH 'MEE2939E'
  END-IF
  IF *PF-KEY = 'PF10'
    SET WINDOW 'OPTION4'
          INPUT (AD=MA'_')
            01/01 'Opt Name'
            02/01 '--- ------'
            03/01 ' R  Review'
            04/01 ' U  Update'
            05/01 ' D  Delete'
            06/01 ' K  Copy'
            08/01  'Selection:' #SEL
          SET WINDOW OFF
    FETCH 'MEE2939E'
  END-IF
  IF *PF-KEY = 'PF12'
    ESCAPE ROUTINE IMMEDIATE
  END-IF
*
END
