DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
01 #NUMBER  (N001)
01 #FIELD   (A020)
01 #INDEX   (I004)
END-DEFINE
INCLUDE Z1069--C
FOR #INDEX FROM 1 TO 5
  IF #INDEX EQ 3
     SUSPEND IDENTICAL SUPPRESS (1)
  END-IF
  MOVE #INDEX TO #NUMBER
  MOVE 'AAA' TO #FIELD
  CALLNAT 'MEE2088Z' #FIELD #NUMBER
END-FOR

END
