DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL

1 #P16_0 (P16.0)
1 #P16_1 (P16.1)
1 #P16_2 (P16.2)
1 #P16_3 (P16.3)
1 #P16_4 (P16.4)
1 #P16_5 (P16.5)

1 #I (I4)
1 #J (I4)
1 #K (I4)
1 #L (I4)

1 #BYTES (B1/1:6) INIT <H'00', H'01', H'7F', H'80', H'FE', H'FF'>

1 #B (B1/1:4)
1 REDEFINE #B
  2 #B1 (B1)
1 REDEFINE #B
  2 #B2 (B2)
1 REDEFINE #B
  2 #B3 (B3)
1 REDEFINE #B
  2 #B4 (B4)

1 #BB (B) DYNAMIC

END-DEFINE

INCLUDE Z1069--C
FORMAT (1) LS=250 PS=0


/* 1 */
RESET #B(*)
FOR #I = 1 TO 6
	MOVE #BYTES(#I) TO #B(1)
	
	RESIZE DYNAMIC #BB TO 0
	MOVE #B1 TO #BB

	RESET #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5
	MOVE #B1 TO #P16_0
	MOVE #B1 TO #P16_1
	MOVE #B1 TO #P16_2
	MOVE #B1 TO #P16_3
	MOVE #B1 TO #P16_4
	MOVE #B1 TO #P16_5
	PRINT (1) NOTITLE 'S' #B1 (EM=H(2)) #P16_0 (EM=H(9)) #P16_1 (EM=H(9)) #P16_2 (EM=H(10)) #P16_3 (EM=H(10)) #P16_4 (EM=H(11)) #P16_5 (EM=H(12))
	PRINT (1) NOTITLE ' ' #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5

	RESET #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5
	MOVE #BB TO #P16_0
	MOVE #BB TO #P16_1
	MOVE #BB TO #P16_2
	MOVE #BB TO #P16_3
	MOVE #BB TO #P16_4
	MOVE #BB TO #P16_5
	PRINT (1) NOTITLE 'D' #BB (EM=H(2)) #P16_0 (EM=H(9)) #P16_1 (EM=H(9)) #P16_2 (EM=H(10)) #P16_3 (EM=H(10)) #P16_4 (EM=H(11)) #P16_5 (EM=H(12))
	PRINT (1) NOTITLE ' ' #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5
END-FOR


/* 2 */
RESET #B(*)
FOR #I = 1 TO 6
	MOVE #BYTES(#I) TO #B(1)
	FOR #J = 1 TO 6
		MOVE #BYTES(#J) TO #B(2)
		
		RESIZE DYNAMIC #BB TO 0
		MOVE #B2 TO #BB

		RESET #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5
		MOVE #B2 TO #P16_0
		MOVE #B2 TO #P16_1
		MOVE #B2 TO #P16_2
		MOVE #B2 TO #P16_3
		MOVE #B2 TO #P16_4
		MOVE #B2 TO #P16_5
		PRINT (1) NOTITLE 'S' #B2 (EM=H(4)) #P16_0 (EM=H(9)) #P16_1 (EM=H(9)) #P16_2 (EM=H(10)) #P16_3 (EM=H(10)) #P16_4 (EM=H(11)) #P16_5 (EM=H(12))
		PRINT (1) NOTITLE ' ' #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5

		RESET #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5
		MOVE #BB TO #P16_0
		MOVE #BB TO #P16_1
		MOVE #BB TO #P16_2
		MOVE #BB TO #P16_3
		MOVE #BB TO #P16_4
		MOVE #BB TO #P16_5
		PRINT (1) NOTITLE 'D' #BB (EM=H(4)) #P16_0 (EM=H(9)) #P16_1 (EM=H(9)) #P16_2 (EM=H(10)) #P16_3 (EM=H(10)) #P16_4 (EM=H(11)) #P16_5 (EM=H(12))
		PRINT (1) NOTITLE ' ' #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5
	END-FOR
END-FOR


/* 3 */
RESET #B(*)
FOR #I = 1 TO 6
	MOVE #BYTES(#I) TO #B(1)
	FOR #J = 1 TO 6
		MOVE #BYTES(#J) TO #B(2)
		FOR #K = 1 TO 6
			MOVE #BYTES(#K) TO #B(3)
			
			RESIZE DYNAMIC #BB TO 0
			MOVE #B3 TO #BB

			RESET #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5
			MOVE #B3 TO #P16_0
			MOVE #B3 TO #P16_1
			MOVE #B3 TO #P16_2
			MOVE #B3 TO #P16_3
			MOVE #B3 TO #P16_4
			MOVE #B3 TO #P16_5
			PRINT (1) NOTITLE 'S' #B3 (EM=H(6)) #P16_0 (EM=H(9)) #P16_1 (EM=H(9)) #P16_2 (EM=H(10)) #P16_3 (EM=H(10)) #P16_4 (EM=H(11)) #P16_5 (EM=H(12))
			PRINT (1) NOTITLE ' ' #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5

			RESET #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5
			MOVE #BB TO #P16_0
			MOVE #BB TO #P16_1
			MOVE #BB TO #P16_2
			MOVE #BB TO #P16_3
			MOVE #BB TO #P16_4
			MOVE #BB TO #P16_5
			PRINT (1) NOTITLE 'D' #BB (EM=H(6)) #P16_0 (EM=H(9)) #P16_1 (EM=H(9)) #P16_2 (EM=H(10)) #P16_3 (EM=H(10)) #P16_4 (EM=H(11)) #P16_5 (EM=H(12))
			PRINT (1) NOTITLE ' ' #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5
		END-FOR
	END-FOR
END-FOR


/* 4 */
RESET #B(*)
FOR #I = 1 TO 6
	MOVE #BYTES(#I) TO #B(1)
	FOR #J = 1 TO 6
		MOVE #BYTES(#J) TO #B(2)
		FOR #K = 1 TO 6
			MOVE #BYTES(#K) TO #B(3)
			FOR #L = 1 TO 6
				MOVE #BYTES(#L) TO #B(4)
			
				RESIZE DYNAMIC #BB TO 0
				MOVE #B4 TO #BB

				RESET #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5
				MOVE #B4 TO #P16_0
				MOVE #B4 TO #P16_1
				MOVE #B4 TO #P16_2
				MOVE #B4 TO #P16_3
				MOVE #B4 TO #P16_4
				MOVE #B4 TO #P16_5
				PRINT (1) NOTITLE 'S' #B4 (EM=H(8)) #P16_0 (EM=H(9)) #P16_1 (EM=H(9)) #P16_2 (EM=H(10)) #P16_3 (EM=H(10)) #P16_4 (EM=H(11)) #P16_5 (EM=H(12))
				PRINT (1) NOTITLE ' ' #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5

				RESET #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5
				MOVE #BB TO #P16_0
				MOVE #BB TO #P16_1
				MOVE #BB TO #P16_2
				MOVE #BB TO #P16_3
				MOVE #BB TO #P16_4
				MOVE #BB TO #P16_5
				PRINT (1) NOTITLE 'D' #BB (EM=H(8)) #P16_0 (EM=H(9)) #P16_1 (EM=H(9)) #P16_2 (EM=H(10)) #P16_3 (EM=H(10)) #P16_4 (EM=H(11)) #P16_5 (EM=H(12))
				PRINT (1) NOTITLE ' ' #P16_0 #P16_1 #P16_2 #P16_3 #P16_4 #P16_5
			END-FOR
		END-FOR
	END-FOR
END-FOR


END
