DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 #ARR (A3/1:2)
1 #ARR-OLD (A3/1:2)
1 #NA (N1)
1 #NA-OLD (N1)
1 #NB (N1)
1 #NC (N1)
1 #ND (N1)
END-DEFINE

INCLUDE Z1069--C
FORMAT (1) PS=0 LS=200

WRITE (1) NOTITLE NOHDR '***** START *****' /

#NC := 1
#ND := 1

FOR #NA FROM 2 TO 1 STEP -1
  MOVE ALL #NA TO #ARR(1)
  #NB := #NA * 2
  MOVE ALL #NB TO #ARR(2)
  WRITE (1) 'in FOR:' '=' #NA '=' #NB '=' #ARR(*)

  PERFORM BREAK PROCESSING
  AT BREAK OF #NA
    #ARR-OLD(*) := OLD(#ARR(*))
    #NA-OLD := OLD(#NA)
    WRITE (1) 'FOR  in AT-BREAK:' '=' #NA 'OLD(#NA)' OLD(#NA) '=' #NA-OLD '=' #NC
    WRITE (1) 'FOR  in AT-BREAK:' '=' #ARR(*) 'OLD(#ARR(*))' OLD(#ARR(*)) '=' #ARR-OLD(*)
    WRITE (1) 'FOR  in AT-BREAK: #ARR-OLD(1)' #ARR-OLD(1) '#ARR-OLD(2)' #ARR-OLD(2)
    WRITE (1) 'FOR  in AT-BREAK: OLD(#ARR(1))' OLD(#ARR(1)) 'OLD(#ARR(2))' OLD(#ARR(2))
    WRITE (1) 'FOR  in AT-BREAK: #ARR-OLD(#NC)' #ARR-OLD(#NC)
    WRITE (1) 'FOR  in AT-BREAK: OLD(#ARR(#NC))' OLD(#ARR(#NC))
    WRITE (1) 'FOR  in AT-BREAK: #ARR-OLD(#NA-OLD)' #ARR-OLD(#NA-OLD)
    WRITE (1) 'FOR  in AT-BREAK: OLD(#ARR(#NA))' OLD(#ARR(#NA))
    #NC := #NC + 1
  END-BREAK
END-ALL

SORT BY #NA USING #ARR(*)
  WRITE (1) 'in SORT:' '=' #NA
  WRITE (1) 'in SORT:' '=' #ARR(*)

  PERFORM BREAK PROCESSING
  AT BREAK OF #NA
    #ARR-OLD(*) := OLD(#ARR(*))
    #NA-OLD := OLD(#NA)
    WRITE (1) 'SORT in AT-BREAK:' '=' #NA 'OLD(#NA)' OLD(#NA) '=' #NA-OLD '=' #NC
    WRITE (1) 'SORT in AT-BREAK:' '=' #ARR(*) 'OLD(#ARR(*))' OLD(#ARR(*)) '=' #ARR-OLD(*)
    WRITE (1) 'SORT in AT-BREAK: #ARR-OLD(1)' #ARR-OLD(1) '#ARR-OLD(2)' #ARR-OLD(2)
    WRITE (1) 'SORT in AT-BREAK: OLD(#ARR(1))' OLD(#ARR(1)) 'OLD(#ARR(2))' OLD(#ARR(2))
    WRITE (1) 'SORT in AT-BREAK: #ARR-OLD(#ND)' #ARR-OLD(#ND)
    WRITE (1) 'SORT in AT-BREAK: OLD(#ARR(#ND))' OLD(#ARR(#ND))
    WRITE (1) 'SORT in AT-BREAK: #ARR-OLD(#NA-OLD)' #ARR-OLD(#NA-OLD)
    WRITE (1) 'SORT in AT-BREAK: OLD(#ARR(#NA))' OLD(#ARR(#NA))
    #ND := #ND + 1
  END-BREAK
END-SORT

WRITE (1) / '***** END *****'

END
