DEFINE DATA
LOCAL
1 EMPL-VIEW VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 NAME
  2 CITY
1 EMPL-HISTO-VIEW VIEW OF EMPLOYEES
  2 CITY
1 #ISN-GET (N10)
END-DEFINE


WRITE NOTITLE NOHDR '*** FIND1 ***'
FIND1. FIND (3) EMPL-VIEW WITH PERSONNEL-ID LT '50000000' SORTED BY PERSONNEL-ID
  WRITE PERSONNEL-ID NAME CITY
END-FIND

WRITE '*** FIND2 ***'
FIND2. FIND (3) EMPL-VIEW WITH PERSONNEL-ID LT '50000000' SORTED BY PERSONNEL-ID DESC
  WRITE PERSONNEL-ID NAME CITY
END-FIND

WRITE '*** FIND3 ***'
FIND3. FIND (5) EMPL-VIEW WITH PERSONNEL-ID GE '50000000' SORTED BY PERSONNEL-ID
  WRITE PERSONNEL-ID NAME CITY
END-FIND

WRITE '*** FIND4 ***'
FIND4. FIND (5) EMPL-VIEW WITH PERSONNEL-ID GE '50000000' SORTED BY PERSONNEL-ID DESC
  WRITE PERSONNEL-ID NAME CITY
END-FIND

WRITE '*** READ1 ***'
READ1. READ (3) EMPL-VIEW WITH PERSONNEL-ID LT '50000000'
  WRITE PERSONNEL-ID NAME CITY
END-READ

WRITE '*** READ2 ***'
READ2. READ (5) EMPL-VIEW WITH PERSONNEL-ID GE '50000000'
  WRITE PERSONNEL-ID NAME CITY
END-READ

WRITE '*** READ3 ***'
READ3. READ EMPL-VIEW WITH PERSONNEL-ID GE '00000000'
  WRITE PERSONNEL-ID NAME CITY
END-READ

WRITE '*** HISTOGRAM1 ***'
HISTO1. HISTOGRAM (3) EMPL-HISTO-VIEW ASC FOR CITY STARTING FROM 'M'
  WRITE EMPL-HISTO-VIEW.CITY
END-HISTOGRAM

WRITE '*** GET1 ***'
#ISN-GET := 1
GET1. GET EMPL-VIEW #ISN-GET


END
