DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
1 IW_SOLID_TEST_VIEW VIEW OF TPL-IW_SQL_TEST
  2 ALPHA_SHORT (A8)
  2 ALPHA_LONG (A185/3)
  2 B_2 (I2)
  2 B_4 (I4)
  2 F_4 (F4)
  2 F_8 (F8)
  2 I_2 (I2)
  2 I_4 (I4)
  2 N_5_0 (P5)
  2 N_7_2 (P7,2)
  2 N_0_3 (P0,3)
  2 P_5_0 (P5)
  2 P_7_2 (P7,2)
  2 P_0_3 (P0,3)
  2 P_19_0 (P19)
  2 ZEIT (A8)
  2 N�ZEIT (I2)
  2 DATUM (A10)
  2 N�DATUM (I2)
  2 TIME_NAT (A8)
  2 DATE_NAT (A10)
  2 TIME_STAMP (A26)
  2 N�TIME_STAMP (I2)
1 #B_2 (I2) INIT <2>
1 #ZEIT (A8)
1 #N�ZEIT (I2) INIT <-1>
1 #DATUM (A10)
1 #N�DATUM (I2) INIT <-1>
1 #TIME_STAMP (A26)
1 #N�TIME_STAMP (I2) INIT <-1>
END-DEFINE
INCLUDE Z1069--C
FORMAT (1) PS=0

WRITE (1) NOTITLE NOHDR *PROGRAM

DELETE FROM TPL-IW_SQL_TEST

MOVE *PROGRAM TO IW_SOLID_TEST_VIEW.ALPHA_SHORT
MOVE 'TEST-SELECT-UPDATE-DATE-TIME-TIMESTAMP' TO IW_SOLID_TEST_VIEW.ALPHA_LONG
MOVE '2011-12-28' TO IW_SOLID_TEST_VIEW.DATUM
MOVE '06:45:00' TO IW_SOLID_TEST_VIEW.ZEIT
MOVE '2015-12-08-15.36.11.000000' TO IW_SOLID_TEST_VIEW.TIME_STAMP
IW_SOLID_TEST_VIEW.B_2 := 1
IW_SOLID_TEST_VIEW.N�DATUM := 1
IW_SOLID_TEST_VIEW.N�ZEIT := 1
IW_SOLID_TEST_VIEW.N�TIME_STAMP := 1
INSERT INTO TPL-IW_SQL_TEST (*) VALUES (VIEW IW_SOLID_TEST_VIEW)

SELECT * INTO VIEW IW_SOLID_TEST_VIEW FROM TPL-IW_SQL_TEST
	WRITE (1) NOTITLE NOHDR IW_SOLID_TEST_VIEW.B_2 ':' '=' IW_SOLID_TEST_VIEW.DATUM '=' IW_SOLID_TEST_VIEW.ZEIT
	WRITE (1) NOTITLE NOHDR IW_SOLID_TEST_VIEW.B_2 ':' '=' IW_SOLID_TEST_VIEW.TIME_STAMP
END-SELECT

IW_SOLID_TEST_VIEW.N�DATUM := -1
IW_SOLID_TEST_VIEW.N�ZEIT := -1
IW_SOLID_TEST_VIEW.N�TIME_STAMP := -1
UPDATE TPL-IW_SQL_TEST SET	B_2 = #B_2,
							DATUM = #DATUM INDICATOR #N�DATUM,
							ZEIT = #ZEIT INDICATOR #N�ZEIT,
							TIME_STAMP = #TIME_STAMP INDICATOR #N�TIME_STAMP WHERE DATUM IS NOT NULL

SELECT * INTO VIEW IW_SOLID_TEST_VIEW FROM TPL-IW_SQL_TEST
	WRITE (1) NOTITLE NOHDR IW_SOLID_TEST_VIEW.B_2 ':' '=' IW_SOLID_TEST_VIEW.DATUM '=' IW_SOLID_TEST_VIEW.ZEIT
	WRITE (1) NOTITLE NOHDR IW_SOLID_TEST_VIEW.B_2 ':' '=' IW_SOLID_TEST_VIEW.TIME_STAMP
END-SELECT

DELETE FROM TPL-IW_SQL_TEST

COMMIT
ON ERROR
	COMMIT
END-ERROR
END
