DEFINE DATA
LOCAL
1 #A1 (A20)
1 #A2 (A20)
1 #A3 (A20)
END-DEFINE

DEFINE WORK FILE 1 'MEE5437A-WF.TXT' TYPE 'ASCII'

#A1 := 'WMEE5437A-1'
DOWNLOAD PC FILE 1 VARIABLE #A1
#A2 := 'WMEE5437A-2'
#A3 := 'WMEE5437A-3'
DOWNLOAD PC FILE 1 VARIABLE #A2 #A3

END
