DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL USING VIEW-ALL
LOCAL
  1 TPL-IW-DATE-VIEW VIEW OF TPL-IW_SQL_TEST
    2 ALPHA_SHORT (A8)
    2 ALPHA_LONG (A185)
    2 DATUM (A10)
  1 TPL-IW-TIME-VIEW VIEW OF TPL-IW_SQL_TEST
    2 ALPHA_SHORT (A8)
    2 ALPHA_LONG (A185)
    2 ZEIT (A8)
  1 TPL-IW-DATE-TIME-VIEW VIEW OF TPL-IW_SQL_TEST
    2 ALPHA_SHORT (A8)
    2 ALPHA_LONG (A185)
    2 DATUM (A10)
    2 ZEIT (A8)
    2 TIME_STAMP (A26)
END-DEFINE
INCLUDE Z1069--C
FORMAT (1) PS=0

WRITE (1) NOTITLE NOHDR *PROGRAM

DELETE FROM TPL-IW_SQL_TEST

PERFORM TEST-INSERT-DATE
PERFORM TEST-INSERT-TIME
PERFORM TEST-INSERT-DATE-TIME

DEFINE SUBROUTINE TEST-INSERT-DATE
	WRITE (1) NOTITLE NOHDR 'TEST-INSERT-DATE'
	MOVE *PROGRAM TO TPL-IW-DATE-VIEW.ALPHA_SHORT
	MOVE 'TEST-INSERT-DATE' TO TPL-IW-DATE-VIEW.ALPHA_LONG

	RESET TPL-IW-DATE-VIEW.DATUM
	STORE RECORD TPL-IW-DATE-VIEW

	MOVE '2011-12-28' TO TPL-IW-DATE-VIEW.DATUM
	STORE RECORD TPL-IW-DATE-VIEW

	MOVE '2014-12-02' TO TPL-IW-DATE-VIEW.DATUM
	STORE RECORD TPL-IW-DATE-VIEW

	SELECT * INTO VIEW IW_SOLID_TEST_VIEW FROM TPL-IW_SQL_TEST ORDER BY DATUM
		WRITE (1) NOTITLE NOHDR '=' IW_SOLID_TEST_VIEW.DATUM
	END-SELECT

	DELETE FROM TPL-IW_SQL_TEST
END-SUBROUTINE

DEFINE SUBROUTINE TEST-INSERT-TIME
	WRITE (1) NOTITLE NOHDR 'TEST-INSERT-TIME'
	MOVE *PROGRAM TO TPL-IW-TIME-VIEW.ALPHA_SHORT
	MOVE 'TEST-INSERT-TIME' TO TPL-IW-TIME-VIEW.ALPHA_LONG

	RESET TPL-IW-TIME-VIEW.ZEIT
	STORE RECORD TPL-IW-TIME-VIEW

	MOVE '09:10:11' TO TPL-IW-TIME-VIEW.ZEIT
	STORE RECORD TPL-IW-TIME-VIEW

	MOVE '23:24:00' TO TPL-IW-TIME-VIEW.ZEIT
	STORE RECORD TPL-IW-TIME-VIEW

	SELECT * INTO VIEW IW_SOLID_TEST_VIEW FROM TPL-IW_SQL_TEST ORDER BY ZEIT
		WRITE (1) NOTITLE NOHDR '=' IW_SOLID_TEST_VIEW.ZEIT
	END-SELECT

	DELETE FROM TPL-IW_SQL_TEST
END-SUBROUTINE

DEFINE SUBROUTINE TEST-INSERT-DATE-TIME
	WRITE (1) NOTITLE NOHDR 'TEST-INSERT-DATE-TIME'
	MOVE *PROGRAM TO TPL-IW-DATE-TIME-VIEW.ALPHA_SHORT
	MOVE 'TEST-INSERT-DATE-TIME' TO TPL-IW-DATE-TIME-VIEW.ALPHA_LONG

	RESET TPL-IW-DATE-TIME-VIEW.DATUM
	RESET TPL-IW-DATE-TIME-VIEW.ZEIT
	RESET TPL-IW-DATE-TIME-VIEW.TIME_STAMP
	STORE RECORD TPL-IW-DATE-TIME-VIEW

	MOVE '2011-12-28' TO TPL-IW-DATE-TIME-VIEW.DATUM
	MOVE '06:45:00' TO TPL-IW-DATE-TIME-VIEW.ZEIT
	MOVE '2015-12-18-15.36.11.000000' TO TPL-IW-DATE-TIME-VIEW.TIME_STAMP
	STORE RECORD TPL-IW-DATE-TIME-VIEW

	MOVE '2014-12-02' TO TPL-IW-DATE-TIME-VIEW.DATUM
	MOVE '07:45:00' TO TPL-IW-DATE-TIME-VIEW.ZEIT
	MOVE '2014-10-08-15.36.11.000000' TO TPL-IW-DATE-TIME-VIEW.TIME_STAMP
	STORE RECORD TPL-IW-DATE-TIME-VIEW

	SELECT * INTO VIEW IW_SOLID_TEST_VIEW FROM TPL-IW_SQL_TEST ORDER BY DATUM
		WRITE (1) NOTITLE NOHDR '=' IW_SOLID_TEST_VIEW.DATUM '=' IW_SOLID_TEST_VIEW.ZEIT
		WRITE (1) NOTITLE NOHDR '=' IW_SOLID_TEST_VIEW.TIME_STAMP
	END-SELECT

	DELETE FROM TPL-IW_SQL_TEST
END-SUBROUTINE

COMMIT
ON ERROR
	COMMIT
END-ERROR
END
