DEFINE DATA
LOCAL USING Z1069--A
LOCAL USING Z1069--L
LOCAL
  1 MY-VIEW VIEW OF TPL-CUSTOMER
  	2 NUMBER (P8,0)
  	2 ADRESS (A100)
  1 #NUMBER (P8,0)
  1 #ADRESS (A100)
  1 #COUNT  (I2)
  1 #COMMIT (L)
END-DEFINE
INCLUDE Z1069--C
FORMAT (1) PS=0 LS=120

MOVE TRUE TO #COMMIT
* Disables COMMIT for NF3 datastore
SELECT ADRESS INTO #ADRESS FROM TPL-CUSTOMER
	IF #ADRESS = "DO-NOT-COMMIT"
		MOVE FALSE TO #COMMIT
	END-IF
END-SELECT

DELETE FROM TPL-CUSTOMER

MOVE 1 TO #NUMBER
MOVE 'TEST-NO-BLANKS' TO #ADRESS
INSERT INTO TPL-CUSTOMER (NUMBER, ADRESS) VALUES (#NUMBER, #ADRESS)

MOVE 2 TO #NUMBER
MOVE '  TEST-LEADING-BLANKS' TO #ADRESS
INSERT INTO TPL-CUSTOMER (NUMBER, ADRESS) VALUES (#NUMBER, #ADRESS)

MOVE 3 TO #NUMBER
MOVE 'TEST  BLANKS  IN  BETWEEN' TO #ADRESS
INSERT INTO TPL-CUSTOMER (NUMBER, ADRESS) VALUES (#NUMBER, #ADRESS)

MOVE 4 TO #NUMBER
MOVE 'TEST-TRAILING-BLANKS  ' TO #ADRESS
INSERT INTO TPL-CUSTOMER (NUMBER, ADRESS) VALUES (#NUMBER, #ADRESS)

MOVE 5 TO #NUMBER
MOVE ' ' TO #ADRESS
INSERT INTO TPL-CUSTOMER (NUMBER, ADRESS) VALUES (#NUMBER, #ADRESS)

MOVE 6 TO #NUMBER
RESET #ADRESS
INSERT INTO TPL-CUSTOMER (NUMBER, ADRESS) VALUES (#NUMBER, #ADRESS)

IF #COMMIT = TRUE
	COMMIT
END-IF
SELECT NUMBER, ADRESS INTO #NUMBER, #ADRESS FROM TPL-CUSTOMER ORDER BY NUMBER
	WRITE (1) NOTITLE '=' #NUMBER
	WRITE (1) NOTITLE '=' #ADRESS
END-SELECT

END
