DEFINE DATA
LOCAL
1 #FIELD1 (A10)
1 #FIELD2 (A10)
1 #FIELD3 (A10)
1 #FIELD4 (A10)
END-DEFINE

FORMAT (1) PS=37
FORMAT (1) ZP=OFF

NEWPAGE (1)
WRITE (1) NOTITLE 'Just another line #1'
NEWPAGE (1)
WRITE (1) NOTITLE 'Just another line #2'


AT TOP OF PAGE (1)
    WRITE (1) USING FORM 'MEE9842M'
END-TOPPAGE

END
