DEFINE DATA
LOCAL
1 #NAME          (A15)       INIT <'Antragsteller'>
1 #USER          (A8)        INIT <'AB01'>
1 #BNAME         (A15)       INIT <'Grube'>
1 #BUSER         (A8)        INIT <'DV35'>
1 #PASSW         (A8)        INIT <'ADONIS'>
1 #TELB          (N4)        INIT <4166>
1 #ABT           (A20)       INIT <'ABABAB'>
1 #SYSTEM        (A20)       INIT <'sysyss'>
*
1 #RETCODE       (A10)
1 AUSGABE        (A1)
1 DRUCKERID      (A8)
1 DRUCKERART     (A1)
1 EXNUM          (I4)
1 IDNET          (B10)
END-DEFINE
*
ON ERROR
  MOVE 'XAPERR' TO *ERROR-TA
END-ERROR
*
MOVE G-DRUCKER TO DRUCKERID
MOVE G-DRUCKERART TO DRUCKERART
*
INPUT AUSGABE DRUCKERID (AD=M)
*
COMPOSE ASSIGNING 'name'=#NAME, 'user'=#USER ,'bname'=#BNAME
COMPOSE ASSIGNING 'tel'=#TELB
COMPOSE ASSIGNING 'system'=#SYSTEM,'abt'=#ABT
  FORMATTING INPUT 'USERVERWALTUNG-1' FROM CABINET 'VENUS'
  PASSW=#PASSW
  OUTPUT(1)
COMPOSE FORMATTING INPUT #CONNECTDOK FROM CABINET #CONNECTCAB PASSW='test'

COMPOSE FORMATTING INPUT #CONNECTDOK FROM CABINET #CONNECTCAB OUTPUT DOCUMENT INTO FINAL CABINET #USER PASSW=#PASSW GIVING #DOK-ISN
COMPOSE RESETTING ALL
        FORMATTING INPUT 'TEXT' FROM CABINET 'TLIB' PASSW=#PASSW
        OUTPUT DOCUMENT INTO CABINET 'CABINET-ID' PASSW=#PASSW GIVING #DOK-ISN
END
