DEFINE DATA
LOCAL
1 #FIELD1 (A20)
1 #FIELD2 (A20)
1 #FIELD3 (A20)
1 #FIELD4 (A20)
1 #FIELD5 (A20)
1 #FIELD6 (A20)
1 #FIELD7 (A20)
1 #FIELD8 (A20)
1 #FIELD9 (A20)
1 #FIELD10 (A20)
1 #FIELD11 (A20)
1 #FIELD12 (A20)
1 #FIELD13 (A20)
1 #FIELD14 (A20)
1 #FIELD15 (A20)
END-DEFINE
 
 PROCESS SQL SQL-DDM <<         
     UPDATE SQL-DDM     
        SET COL1='H0486-PB'   
      WHERE COL2     = :U:#FIELD1   
        AND COL3    = :U:#FIELD2  
     >> 

PROCESS SQL SQL-DDM <<          
   DELETE FROM SQL-DDM       
>>     

PROCESS SQL SQL-DDM <<       
   INSERT INTO SQL-DDM      
   VALUES           
      (:U:#FIELD1        
      ) 
>>   

PROCESS SQL SQL-DDM <<  
UPDATE SQL-DDM B SET B.COL1 = (SELECT X-COL1 FROM SQL-DDM2 M        
                               WHERE M.X-COL2_S=B.COL2          
                                 AND M.X-COL3=B.COL3) 
 WHERE B.COL4=:U:#FIELD4         
   AND SUBSTR(B.COL5,1,1)=:U:#FIELD5           
   AND B.COL6 <> 0
>>  

PROCESS SQL SQL-DDM <<  
UPDATE SQL-DDM B        
SET B.COL1 = SUBSTR(B.COL2,1,9) ||      
        DIGITS((SELECT X-COL1 FROM SQL-DDM2 M          
                      WHERE M.X-COL2=B.COL2       
                      AND M.X-COL3=DECIMAL(SUBSTR(B.COL3,1,9))))  
 WHERE B.COL4=:U:#FIELD4         
   AND B.COL5 <> ' '          
   AND EXISTS (SELECT 1 FROM SQL-DDM3 P      
                WHERE P.Y-COL1 = B.COL1     
                  AND P.Y-COL2 = :U:#FIELD2         
                  AND SUBSTR(P.Y-COL4,1,1)=:U:#FIELD4)       
>> 
   
PROCESS SQL SQL-DDM <<    
     UPDATE SQL-DDM
        SET COL1='H0486-PB'   
      WHERE COL2     = :U:#FIELD2         
        AND COL3       = :U:#FIELD3           
        AND COL4       = :U:#FIELD4           
        AND COL5       = :U:#FIELD5           
    >>     
     
PROCESS SQL SQL-DDM <<          
   INSERT INTO SQL-DDM         
     SELECT * FROM SQL-DDM2
 >>  
 
PROCESS SQL SQL-DDM <<      
   INSERT INTO SQL-DDM (    
          COL1, 
          COL2,   
          COL3,   
          COL4,  
          COL5, 
          COL6,   
          COL7,  
          COL8,  
          COL9)
   SELECT T.X-COL1,       
          V.Y-COL1, 
          V.Y-COL2, 
          V.Y-COL3,
          V.Y-COL4,           
          V.Y-COL5, 
          V.Y-COL6,
          V.Y-COL7,
          V.Y-COL8           
        FROM SQL-DDM2 V, SQL-DDM3 T   
        WHERE V.Y-COL1 = :U:#FIELD1    
          AND (:U:#FIELD2=0 OR COL1=:U:#FIELD1)     
>>
PROCESS SQL SQL-DDM <<       
SET :G:#FIELD1 = COL1           
 >>
 

SELECT COL1 INTO #FIELD1 FROM SQL-DDM    
      WHERE COL1 = COL1           
         PROCESS SQL SQL-DDM2 <<   
            INSERT INTO SQL-DDM2       
            VALUES           
               (:U:#FIELD1,       
                :U:#FIELD2,          
                :U:#FIELD3,   
                :U:#FIELD4        
               ) 
         >>  
END-SELECT
 
PROCESS SQL SQL-DDM <<          
  UPDATE PT_SQL-DDM SET COL1 = #FIELD1 WHERE COL2 = #FIELD2      
 >>   
 
END
