DEFINE DATA
LOCAL
1 MY-VIEW VIEW SQL-DDM
  2 COL1
  2 N�COL1
  2 L�COL1
  2 COL2
  2 N�COL2
  2 L�COL2
  2 COL3
  2 N�COL3
  2 L�COL3
  2 COL4
  2 N�COL4
  2 L�COL4
  2 COL5
  2 N�COL5
  2 L�COL5
  2 COL6
  2 N�COL6
  2 L�COL6
  2 COL7
  2 N�COL7
  2 L�COL7
  2 COL8
  2 N�COL8
  2 L�COL8
  2 COL9
  2 N�COL9
  2 L�COL9

1 MY-OTHER-VIEW VIEW SQL-DDM2
  2 X-COL1
  2 X-COL2
  2 X-COL3
  2 X-COL4
  2 X-COL5
  2 X-COL6
  2 X-COL7
  2 X-COL8
  2 X-COL9

1 ANOTHER-VIEW VIEW SQL-DDM3
  2 Y-COL1
  2 Y-COL2
  2 Y-COL3
  2 Y-COL4
  2 Y-COL5
  2 Y-COL6
  2 Y-COL7
  2 Y-COL8
  2 Y-COL9


1 CAR-VIEW VIEW SQL-DDM4
  2 Q-COL1
  2 Q-COL2
  2 Q-COL3
  2 Q-COL4
  2 Q-COL5
  2 Q-COL6
  2 Q-COL7
  2 Q-COL8
  2 Q-COL9

1 #FIELD1 (A20)
1 #FIELD2 (A20)
1 #FIELD3 (A20)
1 #FIELD4 (A20)
1 #FIELD5 (A20)
1 #FIELD6 (A20)
1 #FIELD7 (A20)
1 #FIELD8 (A20)
1 #FIELD9 (A20)
1 #FIELD10 (A20)
1 #FIELD11 (A20)
1 #FIELD12 (A20)
1 #FIELD13 (A20)
1 #FIELD14 (A20)
1 #FIELD15 (A20)
1 #FIELD-ARRAY(A8/3)
1 MYGROUP
   2 USER (A20)
END-DEFINE
/*********************************************************************************************
SELECT COL1 INTO #FIELD1 FROM SQL-DDM
    WHERE COL1 = #FIELD1
    AND COL2 = 'AGZ2'
    AND COL3 = 'EDAT'
  
  IF NO
    #FIELD1 := '0801'
  END-NOREC
  #FIELD2 := SUBSTR(#FIELD1 , 1 , 4)
END-SELECT
/*********************************************************************************************
SELECT  COL2 INTO #FIELD2
	FROM SQL-DDM
    WHERE COL2    = #FIELD1
    AND  COL3 BETWEEN #FIELD3 AND #FIELD4
    AND COL4 = 'X'
    ORDER BY COL5

**        ================
**        Kompetenzpr�fung
	IGNORE
END-SELECT
/*********************************************************************************************
SELECT COL3
      INTO #FIELD3
      FROM SQL-DDM
      WHERE COL4='PVWTRK01'
      AND COL5 = #FIELD4 AND  COL6 LIKE 'REF%'
    IF NO
      #FIELD9 := 'ALLE'
    END-NOREC
END-SELECT
/*********************************************************************************************
SELECT    COL1,  COL2
    INTO #FIELD1, #FIELD2          FROM SQL-DDM
    WHERE COL3   = #FIELD3
    AND   COL4 = #FIELD4
    ORDER BY COL5 ASC
    WITH UR
    
    IGNORE
END-SELECT
/*********************************************************************************************
SELECT    *
    INTO #FIELD5, #FIELD6          FROM SQL-DDM2
    WHERE X-COL2   = #FIELD4
    AND   X-COL4 = #FIELD8
    ORDER BY X-COL6 ASC
    WITH UR
    
    IGNORE
END-SELECT
/*********************************************************************************************
    SELECT * INTO VIEW MY-VIEW FROM SQL-DDM
        WHERE COL1 = #FIELD2(#FIELD1)
        AND #FIELD4 BETWEEN COL1 AND COL2
      #FIELD9 := #FIELD9 + 1
    END-SELECT
/*********************************************************************************************
SELECT COUNT(*) INTO #FIELD5 FROM SQL-DDM
    WHERE COL8 = #FIELD7
    AND COL1 = 'AGZU'
    AND COL2 = #FIELD2
END-SELECT
/*********************************************************************************************
  SELECT *
      INTO VIEW MY-VIEW FROM SQL-DDM
      WHERE COL1   = #FIELD1
      AND   COL2     = #FIELD2
      WITH HOLD
    IF NO
      #FIELD1 := #FIELD2
      STORE RECORD MY-VIEW
      ESCAPE BOTTOM
    END-NOREC
    #FIELD1    := VAL(#FIELD2)
    UPDATE
  END-SELECT
/*********************************************************************************************
SELECT A.COL1, A.COL2, B.X-COL1, A.COL3,
    A.COL4, A.COL5, A.COL6
    INTO
    #FIELD1, #FIELD2, #FIELD3, #FIELD4, #FIELD5, #FIELD6, #FIELD7
    FROM SQL-DDM A, SQL-DDM2 B
    WHERE A.COL1 = #FIELD1
    AND A.COL2  >= #FIELD2
    AND #FIELD3 BETWEEN A.COL2 AND A.COL3
    AND A.COL4 BETWEEN #FIELD4 AND #FIELD5
    AND A.COL5 = B.X-COL5
    AND A.COL6  = B.X-COL6
    ORDER BY A.COL9
END-SELECT
/*********************************************************************************************
SELECT SINGLE COL1 INTO VIEW MY-VIEW
    FROM SQL-DDM
    WHERE COL2 = #FIELD2
    AND CURRENT DATE
    BETWEEN COL2 AND COL3
    WITH UR
END-SELECT
/*********************************************************************************************
SELECT *
    INTO VIEW MY-VIEW
    FROM SQL-DDM
    WHERE COL1 = :#FIELD1
    AND  COL2    =  #FIELD2
    AND  COL3    >  #FIELD3
    AND  COL4      <= CURRENT TIMESTAMP
    AND  COL5      >  CURRENT TIMESTAMP
    ORDER BY COL6, COL7, COL8 , COL9
    IGNORE
END-SELECT
/*********************************************************************************************
SELECT COUNT(*)
    INTO #FIELD1
    FROM SQL-DDM
    WHERE COL1 = #FIELD1
    AND COL3 = 'AGZ'
    AND COL4  = 9
    AND COL8 IN('E','Z')
END-SELECT
/*********************************************************************************************
SELECT SINGLE * INTO VIEW MY-VIEW FROM SQL-DDM
    WHERE COL4  = #FIELD4
    AND COL5 = #FIELD5
    AND #FIELD8 BETWEEN COL8 AND COL9
    WITH UR
END-SELECT
/*********************************************************************************************
SELECT * INTO VIEW MY-VIEW FROM SQL-DDM
      WHERE COL1 = 'ALF'
      AND COL2 = #FIELD2
      AND COL3 <= CURRENT DATE
      AND (COL4 > CURRENT DATE OR
      COL4 IS NULL)
    #FIELD1 := #FIELD1 + 1
    IF #FIELD1 > 5
      ESCAPE BOTTOM
    END-IF
END-SELECT
/*********************************************************************************************
SELECT COUNT(*)
      INTO #FIELD1
      FROM SQL-DDM
      WHERE COL1 = #FIELD1
      AND   COL2 = 'DZP'
      AND   COL3  = #FIELD2
      AND   COL4  = #FIELD3
      AND   COL5 IN ( '1202', '1203',
      '2202', '2203',
      '3202', '3203',
      '5202', '5203')
**
END-SELECT
/*********************************************************************************************
SELECT SUM(COL1) INTO #FIELD1 FROM SQL-DDM TN
        WHERE TN.COL1 = #FIELD1
        AND TN.COL2  = #FIELD2
        AND TN.COL3 = 'A'
        AND TN.COL4 = '516 '
        AND EXISTS
        (SELECT X-COL5
        FROM SQL-DDM2 TF
        WHERE TF.X-COL1   = #FIELD1
        AND TF.X-COL2     = #FIELD2
        AND TF.X-COL3 = TN.COL3
        AND SUBSTR( TF.X-COL6 , 1 , 2 ) = '03'
        AND (TF.X-COL5 BETWEEN 152000 AND 152999
        OR  TF.X-COL7  BETWEEN 155000 AND 156999
        OR  TF.X-COL9  BETWEEN 255000 AND 255999))
    END-SELECT
/*********************************************************************************************
SELECT F.COL1, F.COL2, F.COL3,
    L.X-COL1, L2.Y-COL1
    ROUND(F.COL5, 2)
    INTO #FIELD1, #FIELD2, #FIELD3,
    #FIELD4, #FIELD5, #FIELD6
    FROM SQL-DDM F, SQL-DDM2 L, SQL-DDM3 L2
    WHERE F.COL1 = #FIELD1
    AND F.COL2   = #FIELD2
    AND F.COL3  ^= '          '
    AND L.X-COL1   = F.COL1
    AND L.X-COL2     = F.COL2
    AND L.X-COL3 = F.COL3
    AND L2.Y-COL1  = F.COL4
    AND L2.Y-COL2    = F.COL5
    AND L2.Y-COL3    = F.COL6
    AND F.COL4  > #FIELD4
    ORDER BY COL1, COL2, COL3 WITH UR
END-SELECT
/*********************************************************************************************
SELECT DISTINCT(COL1) INTO #FIELD1  FROM  SQL-DDM
       WHERE COL1 BETWEEN #FIELD1 AND #FIELD2
       AND COL2  = #FIELD2
       AND COL3 = 'AGZ'
       AND COL4  = 995
       ORDER BY 1
END-SELECT
/*********************************************************************************************
COMMIT  
/*********************************************************************************************
UPDATE MY-VIEW
SET
COL1  = #FIELD1
WHERE COL2 = 'AGZ'
    AND COL3  = #FIELD3
    AND COL4    = #FIELD4
    AND COL5  = #FIELD5
    AND COL6  <= 992   
/*********************************************************************************************
UPDATE MY-VIEW
SET COL1  = #FIELD1
/*********************************************************************************************
UPDATE SQL-DDM
  SET COL1  = #FIELD1,
    COL2   = #FIELD2 ,
    COL3 = CURRENT DATE
    WHERE COL4 = 'AGZ'
    AND COL5  = #FIELD5
    AND COL6    = #FIELD6
    AND COL7  = #FIELD7
    AND COL8  = 992
/*********************************************************************************************
SELECT COL1, COL2, COL3, 'IST', SUM(COL5), SUM(COL6),
    SUM(COL7), MAX(COL8)
    INTO #FIELD1, #FIELD2, #FIELD3, #FIELD4, #FIELD5,
    #FIELD6, #FIELD7
    FROM SQL-DDM
    WHERE COL1 = #FIELD1
    AND COL2   = #FIELD2
    AND COL3 = 'AGZ'
    AND COL4 BETWEEN 10 AND 30
    AND COL5  >= 8
END-SELECT
/*********************************************************************************************
SELECT DISTINCT M.COL1, M.COL2, 0 , 0 , 0 ,
        ' ' , MAX(M.COL3)
        INTO
        #FIELD1, #FIELD2, #FIELD3, #FIELD4, #FIELD5, #FIELD6
        FROM SQL-DDM M
        WHERE #FIELD8 BETWEEN COL1 AND COL3
        AND M.COL2  = #FIELD2
        AND M.COL3 = #FIELD3
        GROUP BY M.COL2, M.COL3
END-SELECT
/*********************************************************************************************
SELECT DISTINCT(COL1) INTO
    #FIELD1
    FROM  SQL-DDM
    WHERE COL1 BETWEEN #FIELD2 AND #FIELD3
    AND   COL4    = #FIELD4
    AND   COL8   > ' '
  UNION
  SELECT DISTINCT COL2  FROM  SQL-DDM
    WHERE COL3 BETWEEN #FIELD1 AND #FIELD2
    AND COL4    = #FIELD4
    AND COL5 = 'AGZ'   
END-SELECT
/*********************************************************************************************
SELECT DISTINCT(COL1) INTO
       #FIELD1 FROM  SQL-DDM
       WHERE COL2 BETWEEN #FIELD2 AND #FIELD3
       AND   COL3    = #FIELD3
       AND   COL5   > ' '
     UNION
     SELECT DISTINCT (COL1)  FROM  SQL-DDM
       WHERE COL2 BETWEEN #FIELD3 AND #FIELD4
       AND COL3    = #FIELD5
       AND COL5 = 'AGZ'
     UNION
     SELECT DISTINCT(X-COL6)  FROM  SQL-DDM2
       WHERE X-COL4 BETWEEN #FIELD1 AND #FIELD2
       AND X-COL5    = #FIELD5
       AND X-COL2 = 'AGZ'
       AND X-COL5  = 999
       ORDER BY 1
END-SELECT
/*********************************************************************************************
 SELECT COUNT(*)INTO #FIELD1
    FROM SQL-DDM F, SQL-DDM2 A
    WHERE F.COL1 =  #FIELD2
    AND   F.COL2 BETWEEN #FIELD1 AND #FIELD2
    AND   A.X-COL4 =  F.COL4
    AND   A.X-COL5 = F.COL5
    AND   A.X-COL6 = F.COL6
    AND   A.X-COL7 = 'AGZ'
    AND   A.X-COL8 = (SELECT MAX(Y-COL1) FROM SQL-DDM3 B
                      WHERE B.Y-COL2 = A.X-COL2
                      AND   B.Y-COL3 = A.X-COL3
                      AND   B.Y-COL4 = 'AGZ')
*
 END-SELECT
/*********************************************************************************************
SELECT COL1, COL2, COL3, 'IST', SUM(COL4), SUM(COL5),
    SUM(COL6), MAX(COL7)
    INTO #FIELD1, #FIELD2, #FIELD3, #FIELD5, #FIELD6
    FROM SQL-DDM
    WHERE COL1 = #FIELD1
    AND COL2   = #FIELD2
    AND COL3 = 'AGZ'
    AND COL4 BETWEEN 10 AND 30
    AND COL5  >= 8
    
    SELECT COL1, COL2, COL3, 'IST', SUM(COL4), SUM(COL5),
	    SUM(COL6), MAX(COL7)
	    INTO #FIELD1, #FIELD2, #FIELD3, #FIELD4,
	    #FIELD5, #FIELD6
	    FROM SQL-DDM
	    WHERE COL1 = #FIELD1
	    AND COL2   = #FIELD2
	    AND COL3 = 'AGZ'
	    AND COL4 BETWEEN 10 AND 30
	    AND COL5  >= 8
	    
	    IGNORE
	END-SELECT
	
	IGNORE 
END-SELECT
/*********************************************************************************************
SELECT DISTINCT COL1 INTO #FIELD1
      FROM SQL-DDM F
      WHERE COL1 = 'AGZ'
      AND COL2    = #FIELD2
      AND COL3  = #FIELD3
      AND COL4  < #FIELD4
      AND COL5  > 0
      AND COL1 IN (SELECT X-COL1 FROM SQL-DDM2
      WHERE X-COL2 = 'AGZ'
      AND X-COL3       = #FIELD3
      AND X-COL4     = #FIELD4
      AND X-COL5     = #FIELD5)
	#FIELD1      := #FIELD3
    #FIELD2     := 0
*
  END-SELECT
/*********************************************************************************************
SELECT DISTINCT COL1 INTO #FIELD1
      FROM SQL-DDM F
      WHERE COL1 = 'AGZ'
      AND COL2    = #FIELD2
      AND COL3  = #FIELD3
      AND COL4  < #FIELD4
      AND COL5  > 0
      AND COL1 NOT IN (SELECT COL1 FROM SQL-DDM
      WHERE COL1 = 'AGZ'
      AND COL2       = #FIELD2
      AND COL3     = #FIELD3
      AND COL4     = #FIELD4)
	#FIELD1      := #FIELD2
    #FIELD4     := 0
*
  END-SELECT
/*********************************************************************************************
DELETE FROM SQL-DDM
  WHERE COL1    = #FIELD1
  AND COL2  = #FIELD2
  AND COL3 = 'AGZ';
/*********************************************************************************************
DELETE FROM      SQL-DDM
/*********************************************************************************************
SELECT DISTINCT (A.COL1) INTO #FIELD1 FROM SQL-DDM A
 WHERE A.COL1 BETWEEN #FIELD2 AND #FIELD3
   AND A.COL2 = 2009
   AND A.COL3 = 'AGZ'
   AND A.COL4 = 999
   AND A.COL5 = 2
   AND A.COL6 NOT IN( SELECT B.X-COL1
     FROM SQL-DDM2 B
     WHERE B.X-COL2 = A.COL2
     AND B.X-COL3   = A.COL3
     AND B.X-COL4     = 2009
     AND B.X-COL5  = 'AGZ' )
     ORDER BY A.COL8
END-SELECT
/*********************************************************************************************
SELECT SINGLE DISTINCT(COL1)
  INTO #FIELD1
  FROM SQL-DDM
 WHERE COL2 = #FIELD2
END-SELECT
/*********************************************************************************************
 INSERT INTO SQL-DDM
              VALUES(#FIELD1 ,
                     #FIELD2 ,
                     #FIELD3 ,
                     #FIELD4 ,
                     #FIELD5 ,
                     #FIELD6 ,
                     #FIELD7(#FIELD8) ,
                     CURRENT TIMESTAMP ,
                     #FIELD9)
/*********************************************************************************************
INSERT INTO SQL-DDM (COL1, COL2, COL3, COL4, COL5)
              VALUES(#FIELD1 ,
                     #FIELD2 ,
                     #FIELD3(#FIELD4) ,
                     CURRENT TIMESTAMP ,
                     #FIELD5)
/*********************************************************************************************
SELECT COL1 INTO
    #FIELD1
    FROM  SQL-DDM
    WHERE COL1 BETWEEN #FIELD1 AND #FIELD2
    AND   COL2    = #FIELD2
    AND   COL3   > ' '
  UNION
  SELECT DISTINCT X-COL1  FROM  SQL-DDM2
    WHERE X-COL2 BETWEEN #FIELD2 AND #FIELD3
    AND X-COL3    = #FIELD3
    AND X-COL4 = 'AGZ'
  UNION
  SELECT Y-COL1  FROM  SQL-DDM3
    WHERE Y-COL2 BETWEEN #FIELD2 AND #FIELD3
    AND Y-COL3    = #FIELD4
    AND Y-COL4 = 'AGZ'
    WITH HOLD

  IF #FIELD5 > 0
	  SELECT COL9 INTO #FIELD9 FROM  SQL-DDM A
	      WHERE COL1 = #FIELD1
	      AND COL2    = #FIELD2
	      AND COL3 = 'AGZ'
	      ORDER BY COL4 DESC
	      WITH UR
	    ESCAPE BOTTOM
	  END-SELECT
  END-IF
  IGNORE
END-SELECT
/*********************************************************************************************
 SELECT E.COL1, E.COL2, E.COL3,S.X-COL1
      INTO
      #FIELD1, #FIELD2, #FIELD3, #FIELD4
      FROM SQL-DDM E LEFT OUTER JOIN SQL-DDM2 S
      ON (E.COL1    = S.X-COL1
      AND S.X-COL2  = #FIELD2
      AND E.COL3 = S.X-COL3
      AND E.COL4   = S.X-COL4
      AND S.X-COL5 = 'K41 ')
      WHERE E.COL6 = #FIELD6
      AND E.COL7 = 'K41 '
      AND E.COL8  = #FIELD8
      AND E.COL9    = #FIELD9
      AND E.COL2 IN (SELECT COL1 FROM SQL-DDM
      WHERE COL1 = #FIELD1
      AND COL2 = E.COL2
      AND COL5  = 'X')
      AND E.COL8 = (SELECT MAX(COL8) FROM SQL-DDM3 A
      WHERE X-COL3      = E.COL3
      AND X-COL4    = E.COL4
      AND X-COL5 = COL5
      AND X-COL7 IN ('1 ','  ')
      AND X-COL8      = E.COL8)
      ORDER BY E.COL1, E.COL9
END-SELECT
/*********************************************************************************************
SELECT COUNT(*) INTO #FIELD1
         FROM SQL-DDM2 X JOIN SQL-DDM3 Y
         ON  X.X-COL1  = Y.Y-COL1
         AND X.X-COL2 = Y.Y-COL2
         AND X.X-COL3     = Y.Y-COL3
         AND X.X-COL4   = Y.Y-COL4
         JOIN SQL-DDM C
         ON X.X-COL1 = C.COL1
         AND X.X-COL2 = C.COL2
         WHERE X.X-COL3 = #FIELD3
         AND X.X-COL4    <= #FIELD4
         AND X.X-COL5 = #FIELD5(#FIELD6)
         AND (Y.Y-COL2  > ' ' OR Y.Y-COL4 > ' ')
         AND SUBSTR(C.COL4,2,1) ^= 'X'
         AND C.COL8 = #FIELD8
END-SELECT
/*********************************************************************************************
SELECT
 N.COL1,
    N.COL2,
    F.X-COL1,
    F.X-COL2,
    N.COL3,
    SUM(N.COL4 + N.COL5),
    0 ,
    'NUTZ'
    INTO
    #FIELD1,
    #FIELD2,
    #FIELD3,
    #FIELD4,
    #FIELD5,
    #FIELD6,
    #FIELD7
    #FIELD8
    FROM
    SQl-DDM N, SQL-DDM2 F
    WHERE N.COL1 = #FIELD1
    AND N.COL2  = #FIELD2
    AND N.COL3 BETWEEN '113 ' AND '999 '
    AND N.COL4   = F.X-COL4
    AND N.COL5  = F.X-COL5
    AND N.COL6 = F.X-COL6
    AND F.COL7 IN (0,1,2,3,4,5,23,32)
    GROUP BY N.COL3, N.COL5,F.X-COL3, F.X-COL5, N.COL7
  UNION
  SELECT S.Y-COL1, S.Y-COL2, F.Q-COL1, F.Q-COL2,
    S.Y-COL3, SUM(S.Y-COL4 + S.Y-COL5), 0 , S.Y-COL6
    FROM SQL-DDM3 S,  SQL-DDM4 F
    WHERE S.Y-COL2 = #FIELD2
    AND S.Y-COL3   = #FIELD3
    AND S.Y-COL4 = F.Q-COL4
    AND S.Y-COL5   = F.Q-COL5
    AND S.Y-COL6 = F.Q-COL6
    AND F.Q-COL7 IN (0 , 1 , 2 , 3 , 4 , 5 , 23 , 32)
    AND S.Y-COL8   BETWEEN '113 ' AND '999 '
    AND S.Y-COL9 IN ('B','N','X','B1','B2')
    GROUP BY S.Y-COL1, S.Y-COL2, F.Q-COL1, F.Q-COL2, S.Y-COL3, S.Y-COL4
    ORDER BY 1,2,3,4,5
END-SELECT
/*********************************************************************************************
SELECT COL1, COL2, COL3, 'IST', SUM(COL4), SUM(COL5),
    SUM(COL6), SUM(COL7 + COL8)
    INTO #FIELD1, #FIELD2, #FIELD4, #FIELD3, #FIELD5,
    #FIELD6
    FROM SQL-DDM
    WHERE COL1 = #FIELD1
    AND COL2   = #FIELD2
    AND COL3 = 'AGZ'
    AND COL4 BETWEEN 10 AND 30
    AND COL5  >= 8
    GROUP BY  COL1, COL2, COL3
  UNION
  SELECT COL1, COL2, COL3, 'RUE', SUM(COL4), SUM(COL5),
    SUM(COL6), SUM(COL7 + COL8)
    FROM SQL-DDM
    WHERE COL1 = #FIELD1
    AND COL2   = #FIELD2
    AND COL3 = 'AGZ'
    AND  COL4 BETWEEN 80 AND 90
    AND COL5  = 9
    GROUP BY  COL1, COL2, COL3
    ORDER BY 1,2,3,4
    WITH UR
END-SELECT
/*********************************************************************************************
 SELECT SINGLE COUNT(*),MAX(T1.COL1)
      INTO #FIELD1, #FIELD2 FROM SQL-DDM T1
     WHERE T1.COL1 = #FIELD1
       AND T1.COL2  = #FIELD2
       AND T1.COL3    = #FIELD3
       AND T1.COL4  = #FIELD4
       AND EXISTS
         (SELECT T2.X-COL1 FROM SQL-DDM2 T2
           WHERE T1.COL1 = T2.X-COL1
             AND T1.COL2 = T2.X-COL2
             AND T1.COL3    = T2.X-COL3
             AND T1.COL4 = T2.X-COL4
             AND T2.X-COL5> 0)
END-SELECT
/*********************************************************************************************
SELECT NEXT VALUE FOR ZAP.SQZABUAUSW
  INTO #FIELD1
  FROM SQL-DDM
END-SELECT
/*********************************************************************************************
SELECT SUM(COL1) * -1 INTO #FIELD1 FROM SQL-DDM
            WHERE COL1 = #FIELD1
            AND COL2     = #FIELD2
            AND COL2 IN ('160' , '260' ,'360' ,'460' ,'560' ,'660')
END-SELECT
/*********************************************************************************************
SELECT CURRENT TIMESTAMP INTO #FIELD2
    FROM SQL-DDM
    WHERE COL1 = 'DSNDB06'
END-SELECT
/*********************************************************************************************
SELECT MIN(COL1) INTO #FIELD1
  FROM SQL-DDM
 WHERE COL1=#FIELD1
   AND COL2 IN (1 , 3)
   AND CURRENT DATE > (COL3 + 1 MONTH + 8 DAYS)
END-SELECT
/*********************************************************************************************
SELECT DATE(DAYS(CURRENT DATE) + 30000),
            -1   ,
            'X' ,
            -1   ,
            -1
            FROM SQL-DDM
            ORDER BY 1
END-SELECT
/*********************************************************************************************
  SELECT  T2.X-COL1,
    T1.COL1,
    T1.COL2   ,
    T1.COL3 ,
    MAX(T2.X-COL2) ,
    SUM(T1.COL4) ,
    MAX(T1.COL5)
*
      INTO #FIELD1,
    #FIELD2,
    #FIELD3,
    #FIELD4,
    #FIELD5,
    #FIELD6,
    #FIELD7
*
      FROM SQL-DDM T1, SQL-DDM2 T2
      WHERE T1.COL1         = T2.X-COL1
      AND T1.COL2         = T2.X-COL2
      AND T1.COL3            = T2.X-COL3
      AND T1.COL4          = T2.X-COL4
      AND T1.COL5 = T2.X-COL5
      AND T1.COL6          = #FIELD2
      AND T1.COL7            = #FIELD3
      AND T1.COL8          = #FIELD4
      AND T1.COL9         = #FIELD5
    GROUP BY T2.X-COL1  ,
    T1.COL1,
    T1.COL2   ,
    T1.COL3
    HAVING SUM(T1.COL4) > 0
END-SELECT
/*********************************************************************************************
  SELECT MOD(COL1,10000000000), COL2
    FROM SQL-DDM
    WHERE COL3 = #FIELD3
    AND CURRENT TIMESTAMP BETWEEN COL4 AND COL5
    AND #FIELD5 BETWEEN YEAR(COL7) AND YEAR(COL8)
    AND COL9 =  51
    ORDER BY 1 , 2
END-SELECT
/*********************************************************************************************
  SELECT MOD(COL1,10000000000), COL2
    FROM SQL-DDM
    WHERE COL2 = #FIELD2
    AND CURRENT TIMESTAMP BETWEEN COL3 AND COL4
    AND #FIELD5 BETWEEN YEAR(COL6) AND YEAR(COL7)
    AND COL8 =  51
    ORDER BY 1 , 2
END-SELECT
/*********************************************************************************************
INSERT INTO SQL-DDM
  VALUES (
  #FIELD1 ,
  #FIELD2 ,
  #FIELD3 ,
  #FIELD4 ,
  #FIELD5 ,
  #FIELD6 INDICATOR MY-VIEW.N�COL6 ,
  MY-VIEW.COL7 INDICATOR  MY-VIEW.N�COL7 ,
  MY-VIEW.COL8 INDICATOR  MY-VIEW.N�COL8 ,
  MY-VIEW.COL9 INDICATOR  MY-VIEW.N�COL9);
 
  SELECT COL1, COL2
    INTO MY-VIEW.COL1 INDICATOR  MY-VIEW.N�COL1
       , MY-VIEW.COL2 INDICATOR  MY-VIEW.N�COL2
    FROM SQL-DDM
   WHERE COL1 = :#FIELD1
     AND COL2 <= CURRENT DATE
     AND COL3 >= CURRENT DATE
  END-SELECT  
/*********************************************************************************************
BACKOUT
/*********************************************************************************************
BACKOUT TRANSACTION
/*********************************************************************************************
ROLLBACK
/*********************************************************************************************
ROLLBACK TRANSACTION
/*********************************************************************************************
SELECT SINGLE COUNT (DISTINCT COL1) INTO #FIELD2 FROM SQL-DDM 
 WHERE COL1 = #FIELD1 
   AND COL2 = 'KUA' 
   AND COL3 = 1 
   AND COL4 BETWEEN #FIELD4 AND #FIELD5 
END-SELECT
/*********************************************************************************************
SELECT COL1, COUNT(DISTINCT COL2), SUM(COL3) INTO #FIELD1,
    #FIELD2, #FIELD3   FROM SQL-DDM
    WHERE COL1 BETWEEN #FIELD5  AND #FIELD6
    AND COL2 = #FIELD2
    AND COL3 BETWEEN '100' AND '999'
    GROUP BY COL9
END-SELECT
/*********************************************************************************************
 UPDATE SQL-DDM
      SET COL1  = 991 ,
      COL1  = #FIELD2 INDICATOR #FIELD3
        WHERE COL2  = #FIELD4
        AND COL3    = #FIELD5
        AND COL4 = #FIELD6
        AND COL5  = #FIELD7
/*********************************************************************************************
SELECT SINGLE COUNT(DISTINCT COL1) INTO #FIELD1 FROM SQL-DDM
 WHERE COL1 < #FIELD1
   AND YEAR(COL2) = #FIELD2
   AND COL3 = #FIELD3
END-SELECT
/*********************************************************************************************
SELECT COL1 ,
        ((COL2 + COL3) - (COL4 + COL5))
          INTO #FIELD1 , #FIELD2
          FROM SQL-DDM
          WHERE COL1  = #FIELD1
          AND   COL2    = #FIELD2
          AND   COL3  = #FIELD3
          AND   COL4 = 'BPR'
          
          #FIELD1 := (2 + 3) - (4 + 5)
END-SELECT
/*********************************************************************************************
UPDATE SQL-DDM B1
   SET COL1 = #FIELD1,
          COL2 = #FIELD2,
              COL3 = 'E'
        WHERE COL4 = #FIELD4
          AND COL5 = 'W'
          AND COL6  = (SELECT MAX(X-COL1)
                              FROM SQL-DDM2
                             WHERE X-COL2 = B1.COL2
                             AND   X-COL3 = 'W' )
/*********************************************************************************************
DELETE FROM SQL-DDM B0
	WHERE B0.COL1      = #FIELD1
         AND B0.COL2    = #FIELD2
         AND B0.COL3  = #FIELD3
/*********************************************************************************************
SELECT DISTINCT * INTO VIEW MY-VIEW
    FROM SQL-DDM
    WHERE COL1  = #FIELD1
    AND   COL2 BETWEEN #FIELD2 AND #FIELD3
    AND   COL3    > ' '
    AND   COL4    > 0
    AND   COL5 > 0
    AND   COL6 > 0
    ORDER BY COL1, COL2 ASC
*
END-SELECT
/*********************************************************************************************
 SELECT * INTO VIEW MY-VIEW FROM SQL-DDM
                WHERE COL1 = 'KUA'
                AND COL2      = #FIELD2
                AND COL3    = 1
                AND COL4    = #FIELD3
                WITH UR
                WITH HOLD
 END-SELECT
 /*********************************************************************************************
 SELECT COL1 , CASE
  WHEN    COL3 > 0 THEN LFD_NR
ELSE (COL3 * (-1) ) + 9   END   AS NLFDNR
    INTO #FIELD2 , #FIELD3
    FROM SQL-DDM
    WHERE COL1  = #FIELD4
    AND   COL2    = #FIELD5
    AND   COL3 = 'KUA'
    AND   COL4  = #FIELD6
    ORDER BY NLFDNR
END-SELECT   
/*********************************************************************************************
SELECT T1.COL1,T1.COL2,T1.COL3,T1.COL4,T1.COL5,
       MIN(T1.COL6),MIN(YEAR(T1.COL7)),MIN(T1.COL8),
       MIN(COL9)
INTO #FIELD1,#FIELD2,#FIELD3,#FIELD4,#FIELD5,#FIELD6,#FIELD7,
     #FIELD8,#FIELD9
FROM SQL-DDM T1
    WHERE T1.COL1 BETWEEN #FIELD1 AND #FIELD2
    AND T1.COL2 BETWEEN 2 AND 8
    AND NOT EXISTS
        (SELECT T2.X-COL1 FROM SQL-DDM2 T2
          WHERE T1.COL1 = T2.X-COL1
            AND T1.COL2= T2.X-COL2
            AND T1.COL3   = T2.X-COL3
            AND T1.COL4 = T2.X-COL4
            AND T1.COL5    = T2.X-COL5
            AND T2.X-COL2 = 9)
    AND EXISTS
        (SELECT T4.Y-COL1 FROM SQL-DDM3 T4
          WHERE T1.COL1 = T4.Y-COL1
            AND T1.COL2= T4.Y-COL2
            AND T1.COL3   = T4.Y-COL3
            AND T1.COL4 = T4.Y-COL4
            AND T4.ZAHL_ART ^= 40
          GROUP BY T4.Y-COL1
         HAVING SUM(Y-COL2) >
               (SELECT SUM(T5.Q-COL2) FROM SQL-DDM4 T5
                 WHERE T1.COL1 = T5.Q-COL1
                   AND T1.COL2 = T5.Q-COL2
                   AND T1.COL3   = T5.Q-COL3
                   AND T1.COL4 = T5.Q-COL4
                   AND T5.Q-COL5 ^= 40))
    AND EXISTS
        (SELECT T3.COL1,MIN(T3.COL2) FROM SQL-DDM T3
          WHERE T1.COL1 = T3.COL1
            AND T1.COL2= T3.COL2
            AND T1.COL3   = T3.COL3
            AND T1.COL4 = T3.COL4
            AND T1.COL5    = T3.COL5
            AND T3.COL6 > 0
          GROUP BY T3.COL7)
END-SELECT
/*********************************************************************************************
SELECT COL1, DECIMAL(COL2,5,2)
    INTO
    #FIELD1, #FIELD2
    FROM SQL-DDM V
    WHERE COL1 = #FIELD1
    AND COL2 = #FIELD2
    AND CURRENT TIMESTAMP BETWEEN COL1 AND COL2
    AND COL3 > 0
    AND COL4 IN (SELECT X-COL5 FROM SQL-DDM2
    WHERE X-COL1  = V.COL1
    AND X-COL2   = V.COL2
    AND X-COL3   = 'X'
    AND X-COL4   = 'X')
  UNION
  SELECT MELD_DAT, DECIMAL(X-COL3,5,2)
    FROM SQL-DDM2 V
    WHERE X-COL1   = #FIELD1
    AND X-COL2 = #FIELD2
    AND CURRENT TIMESTAMP BETWEEN X-COL3 AND X-COL4
    AND X-COL5 > 0
    AND X-COL6 IN (SELECT Q-COL1 FROM SQL-DDM3
    WHERE Q-COL2  = V.X-COL2
    AND Q-COL3    = V.X-COL3
    AND Q-COL4   = 'X'
    AND Q-COL5   = ' ')
    WITH UR
END-SELECT
/*********************************************************************************************
SELECT T1.COL1,T1.COL2,T1.COL3,T1.COL4,T1.COL5,
       T1.COL6,T1.COL7,COL8,COL9,
       YEAR(T1.COL1),DATE(T1.COL2),TIME(T1.COL3)
INTO #FIELD1, #FIELD2, #FIELD4, #FIELD3, #FIELD5, #FIELD6,
	#FIELD7
FROM SQL-DDM T1
    WHERE T1.COL1 BETWEEN #FIELD1 AND #FIELD2
    AND EXISTS
    (SELECT DISTINCT(T8.X-COL1) FROM SQL-DDM2 T8
      WHERE T1.COL1= T8.X-COL1
        AND T8.X-COL2 = 'J')
      AND COL3 =
      (SELECT MIN(Y-COL1) FROM SQL-DDM3 T2
        WHERE T1.COL1       = T2.Y-COL1
          AND T1.COL2       = T2.Y-COL2
          AND T1.COL3       = T2.Y-COL3
          AND T1.COL4       = T2.Y-COL4
          AND T1.COL5       = T2.Y-COL5)
      AND NOT EXISTS
      (SELECT T3.Q-COL1 FROM SQL-DDM4 T3
        WHERE T1.COL1 = T3.Q-COL1
          AND T1.COL2= T3.Q-COL2
          AND T1.COL3   = T3.Q-COL3
          AND T1.COL4 = T3.Q-COL4
          AND T1.COL5    = T3.Q-COL5)
      AND EXISTS
      (SELECT T9.COL1 FROM SQL-DDM T9
        WHERE T1.COL1 = T9.COL1
          AND T1.COL2= T9.COL2
          AND T1.COL3   = T9.COL3
          AND T1.COL4 = T9.COL4
          AND T9.COL5 NOT IN (40,999,56,86,58,88))
END-SELECT
/*********************************************************************************************
LIMIT 1           /* Treffermenge des folgenden SELECT auf 1 begrenzen
SELECT * INTO VIEW MY-VIEW FROM SQL-DDM
    WHERE COL1 > #FIELD1
    AND   COL2   = 2005
*
  #FIELD1 := #FIELD2
END-SELECT
/*********************************************************************************************
SELECT COUNT(*)
    INTO #FIELD1
    FROM SQL-DDM
    WHERE COL1 = #FIELD1
    AND   COL2    = #FIELD2
    AND   COL3 > ' '
    AND   COL4 NOT LIKE '%G%'
    AND COL5 ^= 'L'
    WITH UR
END-SELECT
/*********************************************************************************************
 SELECT SUM(COL1 + COL2) INTO #FIELD1 FROM SQL-DDM
          WHERE COL1   = #FIELD1
          AND   COL2 = #FIELD2
          AND   COL3  = #FIELD3
          AND  (COL4 BETWEEN '113' AND '996'
          OR    COL4   = '999')
          AND   COL4 NOT IN('733','811','812')
          AND   COL4 NOT BETWEEN '819' AND '830'
          AND   COL4 NOT BETWEEN '845' AND '853'
          AND   COL4 NOT BETWEEN '890' AND '896'
          AND   COL4 NOT BETWEEN '920' AND '990'
          WITH UR
END-SELECT
/*********************************************************************************************
SELECT DISTINCT A.COL1
    INTO #FIELD1
    FROM SQL-DDM A
    ,    SQL-DDM2 K
    WHERE A.COL1 < #FIELD1
    AND K.X-COL1 = #FIELD2
    AND K.X-COL2 = 'TZPTRK00'
    AND A.COL1 = #FIELD3
    AND A.COL2 = #FIELD4
  AND (SUBSTR(K.X-COL3 , 1 , 1) = SUBSTR(DIGITS(A.COL1) , 1 , 1)
    OR SUBSTR(K.X-COL3 , 1 , 1) = H'FF')
  AND (SUBSTR(K.X-COL3 , 2 , 2) = SUBSTR(DIGITS(A.COL1) , 2 , 2)
    OR SUBSTR(K.X-COL3 , 2 , 2) = H'FFFF')
  AND (SUBSTR(K.X-COL3 , 4 , 7) = SUBSTR(DIGITS(A.COL1) , 4 , 7)
    OR SUBSTR(K.X-COL3 , 4 , 7) = H'FFFFFFFFFFFFFF')
    ORDER BY COL9 DESC
END-SELECT
/*********************************************************************************************
SELECT A.COL1,
    A.COL2,
    A.COL3,
    A.COL4,
    A.COL5,
    A.COL6,
    A.COL7,
    B.X-COL1,
    TIMESTAMP(A.COL1, CURRENT TIME) ,
    TIMESTAMP(A.COL2, CURRENT TIME) ,
    TIMESTAMP(A.COL3, CURRENT TIME) ,
    B.X-COL2,
    B.X-COL3,
    A.COL8,
    B.X-COL4,
    A.COL9,
    B.X-COL5
    INTO
    #FIELD1 ,
    #FIELD2,
    #FIELD3  ,
    #FIELD4  ,
    #FIELD5  ,
    #FIELD6  ,
    MY-VIEW.COL1 INDICATOR MY-VIEW.N�COL1,
    #FIELD7  ,
    MY-VIEW.COL2 INDICATOR MY-VIEW.N�COL2,
    #FIELD8      ,
    MY-VIEW.COL3 INDICATOR MY-VIEW.N�COL3,
    #FIELD9   ,
    MY-VIEW.COL4 INDICATOR MY-VIEW.N�COL4
    FROM SQL-DDM2 B, SQL-DDM A
    WHERE B.X-COL1 = A.COL1
    AND A.COL2 = #FIELD2
    AND A.COL3 = #FIELD3
    AND A.COL4 BETWEEN #FIELD4 AND #FIELD5
    ORDER BY A.COL5
    WITH UR
    WRITE #FIELD4
   END-SELECT
/*********************************************************************************************
    SELECT COL1, SUM(COL2)
        INTO #FIELD1, #FIELD2
        FROM SQL-DDM
        WHERE COL2 BETWEEN #FIELD1 AND #FIELD2
        AND   COL3 = #FIELD3
        GROUP  BY COL1
      #FIELD1 := #FIELD1 +1
      IF #FIELD1 = 1 ESCAPE BOTTOM END-IF
    END-SELECT
/*********************************************************************************************
  SELECT S.COL1 , M.TILGUNG
      INTO #FIELD1 , #FIELD2
      FROM SQL-DDM S LEFT OUTER JOIN (
      SELECT SUM(X-COL1) AS TILGUNG, X-COL2
      FROM SQL-DDM2 M
      WHERE X-COL3 > 0
      GROUP BY X-COL1) 
      ON S.COL1=M.X-COL1
      WHERE S.COL2 = 0
      AND S.COL3 = #FIELD3
  END-SELECT
/*********************************************************************************************
    SELECT A.COL1, A.COL2, A.COL3, X-COL1, X-COL2, X-COL3
    INTO #FIELD1, #FIELD2, #FIELD3, #FIELD4 , #FIELD5, #FIELD6
    FROM SQL-DDM2 E FULL JOIN SQL-DDM A
    ON E.X-COL1 = A.COL1
    AND E.X-COL2 = A.COL2
    AND E.X-COL3 = A.COL3
    WHERE E.X-COL4 = 'VNP'
    AND E.X-COL5 = 'EA'
    AND A.COL4 = ' '
    AND A.COL5 < 2005
    AND A.COL6 BETWEEN #FIELD8 AND #FIELD9
    WITH HOLD
END-SELECT
/*********************************************************************************************
SELECT COL1, COL2, F.X-COL1
        INTO #FIELD1, #FIELD2, #FIELD3
        FROM  SQL-DDM AN FULL OUTER JOIN SQL-DDM2 F
        ON    AN.COL2  = F.X-COL2
        AND   AN.COL3    = F.X-COL3
        AND   AN.COL4  = F.X-COL4
        WHERE AN.COL5  = #FIELD5
        AND   AN.COL6 = #FIELD6
        AND   AN.COL7    = #FIELD7
        AND   AN.COL8  = #FIELD8
        AND   F.X-COL9  = 'REB'
        AND   COL9 = 1
        ORDER BY F.X-COL1 DESC
END-SELECT
/*********************************************************************************************
INSERT
  INTO SQL-DDM (COL1, COL2, COL3, COL4, COL5, COL6, COL7, COL8, COL9)
VALUES (NEXT VALUE FOR BAD-SQROHBS, #FIELD1, #FIELD2, #FIELD3, #FIELD4, #FIELD5, #FIELD6, #FIELD7, CURRENT TIMESTAMP, #FIELD9)
/*********************************************************************************************
SELECT A.COL1,
    SUM(A.COL2),
    AVG(A.COL3)
      INTO :#FIELD1,
    :#FIELD2,
    :#FIELD3
      FROM SQL-DDM A
      WHERE A.COL1 = 2011
      AND A.COL2 NOT IN
    (SELECT B.X-COL1 FROM SQL-DDM2 B WHERE B.X-COL2 = 2011)
      GROUP BY COL1
END-SELECT
/*********************************************************************************************
  SELECT (COL1 + 1 MONTHS + 8 DAYS ) 
    INTO #FIELD1 
    FROM SQL-DDM 
   WHERE COL1 = #FIELD1 
     AND COL2 = #FIELD2 
     AND COL3 = #FIELD3 
     AND COL4 = #FIELD4 
     AND COL5 = #FIELD5 
  END-SELECT 
/*********************************************************************************************
 SELECT COL1, COL2, COL3, COL4
      INTO #FIELD1, #FIELD2, #FIELD3, #FIELD4
      FROM SQL-DDM
      WHERE COL1 >= #FIELD1
      AND  (COL2 BETWEEN #FIELD1(1) AND #FIELD2(1)
      OR    COL2 BETWEEN #FIELD1(2) AND #FIELD2(2)
      OR    COL2 BETWEEN #FIELD1(3) AND #FIELD2(3)
      OR    COL2 BETWEEN #FIELD1(4) AND #FIELD2(4)
      OR    COL2 BETWEEN #FIELD1(5) AND #FIELD2(5))
      AND   COL2   = #FIELD3
      AND   COL2  > #FIELD4
      AND   COL2 = #FIELD5
      AND   COL3 > 0
      ORDER BY COL1, COL2, COL3
      FETCH FIRST 1 ROWS ONLY
    IF NO RECORDS FOUND
      #FIELD9 := 'J'
    END-NOREC
  END-SELECT
/*********************************************************************************************
   SELECT * INTO VIEW MY-VIEW 
        FROM SQL-DDM
        WHERE COL1 = #FIELD1 
        AND COL2 = #FIELD2 
        AND COL3 = #FIELD3 
        AND COL4 IN 
        ( 
        'AGZ024F' , /* AGZ024F Keine F�rderberechtigung (BayHO etc.) 
        'BAL001F' , /* BAL001F Betrieb zum Zeitpunkt der MFA-Stellung nicht fachlich g�ltig 
        'BAL004F' /* BAL004F Kein landwirtschaftlicher Betrieb im Sinne von InVeKoS 
        ) 
      #FIELD1 := 'N�' 
    END-SELECT   
/*********************************************************************************************
   SELECT COL1, COL2 , COL3 INTO #FIELD1, #FIELD2 , #FIELD3 FROM SQL-DDM
    WHERE #FIELD1 BETWEEN YEAR(COL1) AND YEAR(COL2)
    AND COL3 BETWEEN  #FIELD4 AND #FIELD5
    UNION                                                  /* >> 011
  SELECT  X-COL1, X-COL2 , X-COL3 FROM SQL-DDM2
      WHERE X-COL1 = #FIELD1
      AND X-COL2 BETWEEN  #FIELD3 AND #FIELD4
      AND X-COL7 = 1 /* Gemeinschaftalmen             /* << 011
      ORDER BY X-COL1, X-COL2
      WITH HOLD
  END-SELECT
/*********************************************************************************************
   UPDATE SQL-DDM              /* Status in Antragstabelle setzen 001
  SET  COL1 = #FIELD1,
  COL2 = #FIELD2
    WHERE COL3 = #FIELD3
    AND COL4   = #FIELD4
*   AND LFD_NR   = #ANTRAG.#LFD_NR
    AND COL5  >= #FIELD5                    /* 001
    
    UPDATE MY-VIEW SET * WHERE COL1 = #FIELD1
/*********************************************************************************************
* NEW STATEMENTS 24.03.2014
/*********************************************************************************************
INSERT INTO SQL-DDM (COL1, COL2, COL3, COL4, COL5)
            (SELECT X-COL1, X-COL2, X-COL3, X-COL4, X-COL5 FROM SQL-DDM2
              WHERE COL1 = #FIELD1
              AND COL2 = #FIELD2
              AND COL3 = #FIELD3
              AND COL4 = #FIELD4)
   
   SELECT * INTO VIEW MY-VIEW FROM SQL-DDM      
  WHERE COL1 =  #FIELD1 /* dieses ist eine temporaere          
  AND COL2 <> 0 /* und alle Kunden-GBU    
  ORDER BY COL3,COL4      
  <<WITH UR>>
   IGNORE   
  END-SELECT
  
 SELECT * INTO VIEW MY-VIEW      
        FROM SQL-DDM           
       WHERE COL1 = #FIELD1(1)         
    ORDER BY COL1, COL2, COL3  
    <<FETCH FIRST 100 ROWS ONLY>>           
*       
   IF NO RECORDS FOUND          
     MOVE 'TEST' TO #FIELD1 
   END-NOREC        
   END-SELECT  
   
   SELECT SINGLE COL1 INTO #FIELD1           
  FROM SQL-DDM         
  WHERE COL2    = #FIELD2     
  AND   COL1 = <<CURRENT SQLID>>         

  END-SELECT
  
  SELECT 1 INTO #FIELD1 FROM SQL-DDM     
 WHERE COL1=#FIELD1(1)     
 <<FETCH FIRST ROW ONLY>>       
END-SELECT

 SELECT * INTO VIEW MY-VIEW FROM SQL-DDM           
    WHERE COL1     = #FIELD1          
    AND   COL2  = #FIELD2       
    AND   COL3 > #FIELD3      
    ORDER BY COL1, COL2, COL3        
  << OPTIMIZE FOR 10 ROWS       
     WITH UR >>
 END-SELECT
   
   
     SELECT SINGLE * INTO VIEW MY-VIEW FROM  SQL-DDM     
 WHERE COL1 = #FIELD1 
   << WITH RR >>    
   IF NO RECORDS FOUND          
     MOVE '1' TO #FIELD1 
   END-NOREC    
   
   END-SELECT
   
    SELECT SINGLE * INTO VIEW MY-VIEW FROM SQL-DDM        
           WHERE COL1 = #FIELD1   
           AND COL2 = #FIELD2     
     << WITH RR USE AND KEEP EXCLUSIVE LOCKS >>      
     END-SELECT            

SELECT COUNT(*) INTO MY-VIEW FROM SQL-DDM M        
  /* Merkmalsschl�ssel mit dem gesuchten �bereinstimmen 
  WHERE COL1  =  #FIELD1(1)
  /* und es existiert           
  AND EXISTS        
  /* ein Produktmerkmal         
  (SELECT * FROM SQL-DDM2 P      
     WHERE P.X-COL1 = M.COL-1    
     /* und es existiert        
     AND EXISTS     
     /* ein Vertrag 
     (SELECT * FROM SQL-DDM3 V   
        /* in dem das Produkt - mit Versio - vorkommt   
        WHERE V.Y-COL1   = P.X-COL1           
        AND   V.Y-COL2 = P.X-COL2         
     )  
   )    
END-SELECT  

SELECT * INTO VIEW MY-VIEW          
  FROM SQL-DDM SCH  
 WHERE <<  SCH.COL1 <> 'W'  
       AND SCH.COL2 <> 'T'  
       AND COL3 = (SELECT MIN(A.X-COL1)   
                      FROM IS01.SQL-DDM2 A   
                     WHERE A.X-COL1 = SCH.COL1        
                       AND A.X-COL2 <> 'W'
                       AND A.X-COL3 <> 'T')           
      AND EXISTS (SELECT 1      
                    FROM IS01.SQL-DDM3 COD   
                   WHERE COD.Y-COL1 = 'SZE'  
                     AND COD.Y-COL2 = SUBSTR(SCH.COL2,1,3))        
      AND YEAR(DATE(SCH.COL4 - 364))           
                            = YEAR(DATE(SCH.COL5 - 364))   
      AND YEAR(DATE(SCH.COL6 - 364)) <> SCH.COL7  >>     
  ORDER BY COL2
        
  WITH HOLD         
        
  WRITE #FIELD2
        
END-SELECT  


SELECT SCH.COL1 
     , COD.X-COL1     
     , << SUBSTR(SCH.COL2,1,3)   >>        
     , << SUBSTR(SCH.COL3,1,11) >>        
     , SCH.COL4       
     , SCH.COL5        
     , << SUBSTR(SCH.COL6,1,11) >>        
     , SCH.COL7   
     , SCH.COL8 
     , SCH.COL9        
*     -- SCHADENAUFWAND - SUMMEENTSCHAEDIGUNG ANT_MA    
     , << SUM (CASE WHEN SRE.X-COL1 = 'E' THEN SRE.X-COL2       
                 ELSE 0 END)      >>        
*     -- RESTRESERVE - ANT_MA   
     , << SUM (CASE WHEN SRE.X-COL2 = 'E' THEN SRE.X-COL2    
                 ELSE 0 END)      >>        
*     -- GESAMTRESERVE - ANT_MA 
     , << SUM (CASE WHEN SRE.X-COL3 = 'E' THEN SRE.X-COL2       
                 ELSE 0 END)      >>        
*     -- KOSTEN - ANT_MA        
     , << SUM (CASE WHEN SRE.XOL4 = 'K' THEN SRE.X-COL2       
                 ELSE 0 END)      >>        
  INTO  
        #FIELD1  
      , #FIELD2           
      , #FIELD3      
      , #FIELD4    
      , #FIELD5         
      , #FIELD6         
      , #FIELD7    
      , #FIELD8    
      , #FIELD9  
      , #FIELD10         
      , #FIELD11        
      , #FIELD12           
      , #FIELD13         
      , #FIELD14    
        
  FROM SQL-DDM       SCH,        
       SQL-DDM2 	 SRE,        
       SQL-DDM3      COD         
 WHERE SCH.COL1 <> 'W'      
   AND SCH.COL2 <> 'T'      
   AND SCH.COL3 = (SELECT MIN(A.Q-COL1)   
                       FROM SQL-DDM4 A       
                      WHERE A.Q-COL1 = SCH.COL1       
                        AND A.Q-COL2 <> 'W'           
                        AND A.Q-COL3 <> 'T')          
   AND SRE.X-COL1 = SCH.COL1          
   AND COD.Y-COL1   = SCH.SCOL1          
   AND COD.Y-COL2    = 'SSP'     
 GROUP BY           
       SCH.COL1 
     , COD.Y-COL1     
     , << SUBSTR(SCH.COL1,1,3) >>          
     , << SUBSTR(SCH.COL2,1,11) >>        
     , SCH.COl3        
     , SCH.COL4        
     , << SUBSTR(SCH.COL5,1,11) >>        
     , SCH.COL6   
     , SCH.COL7 
     , SCH.COL8        
WITH UR
*       
WRITE #FIELD1         
*       
END-SELECT   /* ----LESEN-EN


/* new tests 04.04.2014 */

SELECT *
  INTO VIEW MY-VIEW     
  FROM SQL-DDM S   
  WHERE <<(S.COL1, S.COL2)>> IN       
  (SELECT X-COL1, X-COL2 FROM SQL-DDM2 WHERE X-COL1=0)
  /* Sortiert nach Polint_s, Ver#_s, Pos#_s 
  ORDER BY S.COL1, S.COL2, S.COL3   
  /* Im Hold da Update und Commit in Schleife           
  WITH HOLD       
END-SELECT

SELECT DISTINCT(COL1), COL2 INTO #FIELD1, #FIELD2 FROM SQL-DDM 
    WHERE COL1 = #FIELD1 
    AND COL1 >= 0 
END-SELECT  

 SELECT * INTO VIEW MY-VIEW FROM SQL-DDM
        WHERE COL1 IN (COL2 - 1 , COL2)
        AND COL3='X'
        AND COL4 = #FIELD4
      RESET #FIELD5
    END-SELECT


 SELECT B.COL1, B.COL2       
    INTO  #FIELD1, #FIELD2        
    FROM SQL-DDM B     
      WHERE B.COL1 = #FIELD1         
      AND   <<(B.COL2, B.COL3, B.COL4)>> = ANY          
      (SELECT MAX(C.X-COL1), MAX(C.X-COL2), C.X-COL3          
         FROM SQL-DDM2 C
         WHERE C.X-COL4 = #FIELD4      
         AND C.X-COL5   = '0'   
         AND C.X-COL6 =       
           (SELECT MAX(Y-COL2)
             FROM SQL-DDM3 D        
             WHERE C.X-COL1 = D.Y-COL1      
             AND D.Y-COL2   = '0'                           /* W0927
             AND D.Y-COL3   = #FIELD3  
             /*GROUP BY D.VER#_S
           )        
         GROUP BY C.Y-COL5      
       )
  END-SELECT

SELECT COL1
     , INTEGER(COL2 / 1000)
     , SUBSTR(COL3,1,2)
     , SUBSTR(COL3,3,4)
 INTO #FIELD1
     ,#FIELD2
     ,#FIELD3
     ,#FIELD4
  FROM SQL-DDM
 WHERE COL1 = :#FIELD1
   AND COL4 BETWEEN :#FIELD2 AND :#FIELD3
 ORDER BY 1 , 2 , 3 , 4
END-SELECT

SELECT  V.COL1 INTO  #FIELD1
                      FROM SQL-DDM V
    WHERE V.COL2   =  09
    AND CAST(V.COL3 AS SMALLINT)
      = CAST(MY-VIEW.COL2 AS SMALLINT)
         IF NO RECORDS FOUND
            ESCAPE BOTTOM
         END-NOREC
    END-SELECT

SELECT A.COL1, A.COL2, B.X-COL1, B.X-COL2 INTO VIEW MY-VIEW A, MY-OTHER-VIEW B FROM SQL-DDM A, SQL-DDM2 B
        WHERE A.COL1 = #FIELD2(#FIELD1)
        AND #FIELD4 BETWEEN A.COL1 AND A.COL2
      #FIELD9 := #FIELD9 + 1
END-SELECT

SELECT * INTO MY-VIEW FROM SQL-DDM
	IGNORE
END-SELECT

UPDATE SQL-DDM SET COL1 = 0 WHERE COL2 IS NULL

SELECT COL1,X-COL1 INTO #FIELD1, #FIELD2 FROM SQL-DDM, SQL-DDM2
	WHERE SQL-DDM.COL1 = SQL-DDM2.X-COL1
END-SELECT

CALLDBPROC 'BAL.ANSCHR' SQL-DDM
             #FIELD1 #FIELD2 #FIELD3
             GIVING #FIELD5
             
SELECT COUNT(*) INTO #FIELD1 FROM
      (SELECT COUNT(*) AS ANZAHL, HHL, MAX(COL1) AS MAXIMUS FROM SQL-DDM
         WHERE COL1 = #FIELD1
         GROUP BY COL2) A
      WHERE MAXIMUS <> ANZAHL
    END-SELECT
/*********************************************************************************************
SELECT DISTINCT A.COL1
	INTO #FIELD1
    FROM SQL-DDM2 E JOIN SQL-DDM A
    ON E.X-COL1 = A.COL1
END-SELECT

/*********************************************************************************************
SELECT DISTINCT SQL-DDM.COL1
	INTO #FIELD1
    FROM SQL-DDM2 JOIN SQL-DDM
    ON SQL-DDM2.X-COL1 = SQL-DDM.COL1
END-SELECT

/********************* WMEE-2079 *************************************************************

UPDATE SQL-DDM B        
SET B.COL1 = SUBSTR(B.COL2,1,9) ||      
        SUBSTR(TRIM(CHAR((SELECT X-COL1 FROM SQL-DDM2 M
                      WHERE M.X-COL2=B.COL-2       
                      AND M.X-COL3=DECIMAL(SUBSTR(B.COL3,1,9))))),1,5)        
                  
SELECT 1 INTO #FIELD1 FROM SQL-DDM VME
       WHERE VME.COL1 = #FIELD1    
         AND <<SUBSTR(VME.COL2,1,9)=LEFT(TRIM(CHAR(#FIELD2)),9)>>          
END-SELECT

/********************* WMEE-2148 *************************************************************

INSERT INTO SQL-DDM(*) VALUES (VIEW MY-VIEW)
INSERT INTO SQL-DDM VALUES (VIEW MY-VIEW)

/********************* WMEE-2117 *************************************************************

READ WORK 1 MY-VIEW
  RESET #FIELD1
  SELECT COL1, SUM(COL2) , SUM(COL3)
      INTO #FIELD1, #FIELD2, #FIELD3
      FROM SQL-DDM
      WHERE COL1 = 'DZP'
      GROUP BY COL3
    IF #FIELD1 = 711
    	IGNORE
    END-IF
  END-SELECT
  
END-WORK

/********************* WMEE-2229 *************************************************************

SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE CURRENT SERVER = 'TEST'
	IGNORE
END-SELECT
*
SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE COL1 = USER
	WRITE USER 
END-SELECT
*
SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE COL1 = CURRENT_DATE
	IGNORE
END-SELECT
*
SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE COL1 = CURRENT_TIMESTAMP
	IGNORE
END-SELECT
*
SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE UCASE(COL1) >= #FIELD1
	IGNORE
END-SELECT
*
INSERT INTO SQL-DDM
  VALUES (
  #FIELD1 ,
  #FIELD2 ,
  #FIELD3 ,
  #FIELD4 ,
  #FIELD5 ,
  #FIELD6 LINDICATOR MY-VIEW.L�COL6 ,
  MY-VIEW.COL7 LINDICATOR  MY-VIEW.L�COL7 ,
  MY-VIEW.COL8 LINDICATOR  MY-VIEW.L�COL8 ,
  MY-VIEW.COL9 LINDICATOR  MY-VIEW.L�COL9);
 
SELECT COL1, COL2
    INTO MY-VIEW.COL1 LINDICATOR  MY-VIEW.L�COL1
       , MY-VIEW.COL2 LINDICATOR  MY-VIEW.L�COL2
    FROM SQL-DDM
   WHERE COL1 = :#FIELD1
     AND COL2 <= CURRENT DATE
     AND COL3 >= CURRENT DATE
  END-SELECT 
*
CALLDBPROC 'RZR4.FFSALD' SQL-DDM 
            #FIELD1  
            #FIELD2   LINDICATOR :#FIELD3 
            GIVING #FIELD4 

/********************* WMEE-2323 *************************************************************
 
SELECT COUNT (*) INTO #FIELD1 
    FROM SQL-DDM 
    WHERE SQL-DDM.COL1 = #FIELD2 
    AND SQL-DDM.COL2 = #FIELD3 
    AND SQL-DDM.COL3 = #FIELD4 
END-SELECT 

/********************* WMEE-2379, WMEE-2380 **************************************************

SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE COL2 IN (#FIELD-ARRAY(1), #FIELD2)
	IGNORE
END-SELECT 

/********************* WMEE-2250 *************************************************************

SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE SMALLINT(COL1) >= #FIELD1
	IGNORE
END-SELECT
SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE SMALLINT(1020) >= #FIELD1
	IGNORE
END-SELECT
SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE SMALLINT(1000 + 20) >= #FIELD1
	IGNORE
END-SELECT
SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE SMALLINT(1020.3) >= #FIELD1
	IGNORE
END-SELECT
SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE SMALLINT('1020') >= #FIELD1
	IGNORE
END-SELECT
SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE SMALLINT('1020.3') >= #FIELD1
	IGNORE
END-SELECT

/********************* WMEE-2247 *************************************************************

SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE DECIMAL(COL1) >= #FIELD1
	IGNORE
END-SELECT
SELECT COL1 INTO #FIELD1 FROM SQL-DDM WHERE DEC(COL1) >= #FIELD1
	IGNORE
END-SELECT

/********************* WMEE-2485 *************************************************************

SELECT SUM(COL1),         
       << SUM(CASE WHEN COL2=:#FIELD1 THEN   
                ROUND((:#FIELD2 * DECIMAL(BANKKOSTEN,16,3)),2) 
              ELSE  
                BANKKOSTEN      
              END) >>           
       INTO #FIELD3, #FIELD4
   FROM SQL-DDM    
*       
   IGNORE
*
END-SELECT   
*
SELECT SUM(COL1) INTO #FIELD3, #FIELD4
   FROM SQL-DDM  WHERE #FIELD1 = 
   << CASE WHEN COL2=:#FIELD1 THEN   
                COL1 
              ELSE  
                COL2    
              END >>  
*       
   IGNORE
*
END-SELECT

/********************* WMEE-2466 *************************************************************

SELECT INT(SUBSTR (COL1,17)) 
    INTO #FIELD1 
    FROM SQL-DDM
*    
    IGNORE 
END-SELECT 
*
SELECT DECIMAL(COL1, 12) INTO #FIELD1 FROM SQL-DDM
	IGNORE 
END-SELECT
*
SELECT DEC(COL1, 12) INTO #FIELD1 FROM SQL-DDM
	IGNORE 
END-SELECT
*

/********************* WMEE-2640 *************************************************************

SELECT COL1 INTO #FIELD1 FROM SQL-DDM
  WITH UR WITH HOLD
END-SELECT 
SELECT COL1 INTO #FIELD1 FROM SQL-DDM
  WITH HOLD WITH UR
END-SELECT 

SELECT SINGLE COL1 INTO #FIELD1 FROM SQL-DDM
  WITH UR WITH HOLD
END-SELECT 
SELECT SINGLE COL1 INTO #FIELD1 FROM SQL-DDM
  WITH HOLD WITH UR
END-SELECT 


SELECT DISTINCT(COL1) INTO
    #FIELD1
    FROM  SQL-DDM
    WHERE COL1 BETWEEN #FIELD2 AND #FIELD3
    AND   COL4    = #FIELD4
    AND   COL8   > ' '
  UNION ALL
  SELECT DISTINCT COL2  FROM  SQL-DDM
    WHERE COL3 BETWEEN #FIELD1 AND #FIELD2
    AND COL4    = #FIELD4
    AND COL5 = 'AGZ'   
END-SELECT

SELECT DISTINCT(COL1) INTO
       #FIELD1 FROM  SQL-DDM
       WHERE COL2 BETWEEN #FIELD2 AND #FIELD3
       AND   COL3    = #FIELD3
       AND   COL5   > ' '
     UNION ALL
     SELECT DISTINCT (COL1)  FROM  SQL-DDM
       WHERE COL2 BETWEEN #FIELD3 AND #FIELD4
       AND COL3    = #FIELD5
       AND COL5 = 'AGZ'
     UNION ALL
     SELECT DISTINCT(X-COL6)  FROM  SQL-DDM2
       WHERE X-COL4 BETWEEN #FIELD1 AND #FIELD2
       AND X-COL5    = #FIELD5
       AND X-COL2 = 'AGZ'
       AND X-COL5  = 999
       ORDER BY 1
END-SELECT

/* WMEE-2870
SELECT DISTINCT  COL1 
               FROM   SQL-DDM
               WHERE COL1 BETWEEN #FIELD1  AND
               TIMESTAMP_FORMAT(#FIELD2, 'YYYY-MM-DD HH24:MI:SS.FF12')

	IGNORE
END-SELECT
SELECT DISTINCT  COL1 
               FROM   SQL-DDM
               WHERE COL1 BETWEEN #FIELD1  AND
               TIMESTAMP_FORMAT('2014-05-12', 'YYYY-MM-DD HH24:MI:SS.FF12')

	IGNORE
END-SELECT

END
