DEFINE DATA
LOCAL
1 #A (A1)
1 #B (A1)
END-DEFINE

INPUT 'PLEASE CHOOSE #A or #B' #A #B 

IF SELECTION #A #B
	REINPUT 'Selection not valid. Please select #A OR #B' 
END-IF
	

END
