DEFINE DATA
LOCAL
 01        #CMD
   02      PROCESSOR-NAME              (A008)
   02      COMMAND-LINE                (A050)
*
01         #ARR                        (A010/5)
END-DEFINE
*
COMPRESS 'ABC' 'DEF'   
  INTO #CMD.PROCESSOR-NAME 
*
COMPRESS 'ABC' 'DEF'   
  INTO PROCESSOR-NAME 
*
COMPRESS 'ABC' 'DEF'   
  INTO #CMD.COMMAND-LINE 
*
COMPRESS 'ABC' 'DEF'   
  INTO COMMAND-LINE 
*
SEPARATE #CMD.PROCESSOR-NAME
  INTO  #ARR(1:5)
*
SEPARATE PROCESSOR-NAME
  INTO  #ARR(1:5)
*
SEPARATE #CMD.COMMAND-LINE
  INTO  #ARR(1:5)
*
SEPARATE COMMAND-LINE
  INTO  #ARR(1:5)
*
END
