//*****************************************************************             
//      INCLUDE MEMBER=IOAENVT                                          00020007
//SPECIAL  DD DUMMY,DSN=WTSO.&CTBENV..&CTBENVT,DISP=SHR                 00021006
//DAALOCIN DD DISP=SHR,DSN=&DAALOCIN(ALCCTBM)                           00030005
//**************************************************************        00040005
//* DEBUG AND PRINTINGS                                                 00050005
//**************************************************************        00060005
//DADBGOUT DD SYSOUT=&OUT                                               00070005
//CTBCMPS1 DD UNIT=SYSDA,SPACE=(CYL,(5,10)),DISP=(,DELETE),             00080005
//  DCB=(BLKSIZE=30000,LRECL=1600,RECFM=VB)                             00090005
//CTBCMPS2 DD UNIT=SYSDA,SPACE=(CYL,(5,10)),DISP=(,DELETE),             00100005
//  DCB=(BLKSIZE=30000,LRECL=1600,RECFM=VB)                             00110005
