         DBD   NAME=DBDMOD,                                            X        
               ACCESS=(HDAM,VSAM),                                     X        
               RMNAME=(DFSHDC40,1,50,8180)                                      
         DATASET DD1=HUNJHDS,                                          X        
               DEVICE=3380,                                            X        
               SCAN=0,                                                 X        
               SIZE=(8192)                                                      
         SEGM  NAME=SEDGMVPP,                                          X        
               PARENT=0,                                               X        
               BYTES=220,                                              X        
               PTR=(T)                                                          
         FIELD NAME=(CASE,SEQ,U),                                      X        
               BYTES=6,                                                X        
               START=1,                                                X        
               TYPE=P                                                           
         FIELD NAME=STATUS,                                            X        
               BYTES=1,                                                X        
               START=7,                                                X        
               TYPE=C                                                           
         FIELD NAME=DSEG,                                              X        
               BYTES=4,                                                X        
               START=8,                                                X        
               TYPE=X                                                           
         FIELD NAME=STATCE,                                            X        
               BYTES=1,                                                X        
               START=26,                                               X        
               TYPE=C                                                           
         SEGM  NAME=UGUIHOOJ,                                          X        
               PARENT=((UHHIIILL,SNGL)),                               X        
               BYTES=330,                                              X        
               RULES=(,FIRST)                                                   
         FIELD NAME=(GHS,SEQ,M),                                       X        
               BYTES=4,                                                X        
               START=1,                                                X        
               TYPE=C                                                           
         FIELD NAME=DSEG,                                              X        
               BYTES=4,                                                X        
               START=5,                                                X        
               TYPE=X                                                           
         FIELD NAME=STATUS,                                            X        
               BYTES=1,                                                X        
               START=9,                                                X        
               TYPE=C                                                           
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
