 WMIN3020_If4: PROCEDURE OPTIONS(MAIN);
	if (ab > c & d | e & f < c & a) then
	   if (a > b & c | d & b > c) then
	      return (1);
      return (0);
    else
      return (U*V*W);
 END WMIN3020_If4;

