 WMIN3020_If2: PROCEDURE OPTIONS(MAIN);
	if (U > V + W & U < X | V < B) then
       if (Z > V + W +C & U < X | V < B) then
          return (0);
       else
          return (U*V*W);
    else
      return (U*V*W);
 END WMIN3020_If2;
