       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN2777_SECTION5.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
        IF FOO EQ 'BAR' THEN
           DISPLAY 'TRUE'
        END-IF.
        IF FOO EQ 'BAR' AND BAR EQ 'FOO'THEN
           DISPLAY 'FALSE'
        END-IF.
        3100-SECTION-ONE.
         IF FOO EQ 'BAR' THEN
          DISPLAY 'TRUE'
         END-IF.
        SEC1 SECTION
          IF FOO EQ 'BAR' AND BAR EQ 'FOO'THEN
           DISPLAY 'FALSE'
          END-IF.
        SEC2 SECTION
          IF FOO EQ 'BAR' THEN
           DISPLAY 'TRUE'
          END-IF.