       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN2777_SECTION7.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           EVALUATE FIELD-3
              WHEN OTHER
                 DISPLAY 'OTHER'
           END-EVALUATE.
           PERFORM 2000-PROCESSING-PARA
           GO TO PARA-C IN SECTION-A.
       SECTION-A SECTION.
           DISPLAY 'IN PARA-D'
           GOBACK.
       END PROGRAM WMIN2777_SECTION7.