       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN2777_SECTION_EMPTY2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
         SEC1 SECTION