DEFINE DATA
LOCAL

END-DEFINE

PERFORM ROUTINE-READ

PERFORM READ-BY-VALUE

INCLUDE CPY

************************************************************************
DEFINE SUBROUTINE ROUTINE-READ

FETCH 'MISSING'

END-SUBROUTINE

DEFINE SUBROUTINE READ-BY-VALUE

FETCH 'MISSING'

END-SUBROUTINE
