   PRINT NOGEN                                                          00000100
*                                                                               
         PCB   TYPE=DB,                                                X00000300
               DBDNAME=DBD4435A,                                       X00000400
               PROCOPT=GOTP,                                           X00000500
               KEYLEN=100                                               00000600
         SENSEG NAME=QRSTCASE,                                         X00000700
               PARENT=0                                                 00000800
*
         PCB   TYPE=DB,                                                X00000300
               DBDNAME=DBD4435B,                                       X00000400
               PROCOPT=GOTP,                                           X00000500
               KEYLEN=100                                               00000600
         SENSEG NAME=SEGONE,                                           X00000700
               PARENT=0                                                 00000800
         SENSEG NAME=SEGTWO,                                           X00000700
               PARENT=SEGONE                                            00000800
*
         PCB   TYPE=DB,                                                X00000300
               DBDNAME=DBD4435C,                                       X00000400
               PROCOPT=GOTP,                                           X00000500
               KEYLEN=100                                               00000600
         SENSEG NAME=ABC,                                              X00000700
               PARENT=0                                                 00000800
*                                                                       00032700
         PSBGEN LANG=PLI,                                              X00034300
               PSBNAME=P4435G                                           00034400
         END                                                            00034500
