DEFINE DATA

 LOCAL 1 ALPHA         (A15)
 LOCAL 1 ANSATZ-WERT-N (N12.2)
END-DEFINE


MOVE EDITED ALPHA TO ANSATZ-WERT-N (EM=Z(12))
WRITE 'TEST ' ALPHA

END
