//CNDSAMP JOB CLASS=6,NOTIFY=&SYSUID
//*
//STEP1  EXEC  PGM=CINDY
//*
//STEP2  EXEC  PGM=NEXT,COND=(4,EQ,STEP1)
//*
//STEP3  EXEC  PGM=LAST,COND=((8,LT,STEP1),(8,GT,STEP2))
