       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

        01 DUMMY PIC X(1).
        
       PROCEDURE DIVISION.
  
         CALL "CALLEE" USING DUMMY.

       END PROGRAM CALLER.
