IF #VAR1
	DECIDE FOR EVERY CONDITION
		WHEN #FIELD1
			IF #BOOLEAN
				WRITE NOTITLE '='
			END-IF
		WHEN ALL
			IF #BOOLEAN AND #VAR3 < 2 OR #VAR1 OR #VAR2 > 2
				WRITE NOTITLE '='
			END-IF
		WHEN NONE
			IF #BOOLEAN AND #VAR3 < 2 OR #VAR1 OR #VAR2 > 2
				WRITE NOTITLE '='
			END-IF
	END-DECIDE
END-IF
END