IF #VAR1 AND #VAR2 EQUAL FALSE OR TRUE = TRUE AND TRUE EQUAL TO TRUE AND #VAR3 NOT = TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	IF #VAR4 EQUAL TRUE
		WRITE NOTITLE 'TEST IF CONDITION'
		IF TRUE EQUAL TO TRUE
			WRITE NOTITLE 'TEST IF CONDITION'
			IF TRUE NE TRUE
				WRITE NOTITLE 'TEST IF CONDITION'
			END-IF
		END-IF
	END-IF
ELSE
    IF #VAR4
        WRITE NOTITLE 'if'
    END-IF
END-IF
END