//YDECSD0S JOB (6,DE24A000,PDPB),'TCSES',                               00001000
//             MSGLEVEL=(1,1),       TYPRUN=SCAN,                       00002000
//             MSGCLASS=7,                                              00003000
//             CLASS=A,                                                 00004000
//             RESTART=*,                                               00005000
//             USER=DE01P01,                                            00006000
//             REGION=128M                                              00007000

//JS015    EXEC PGM=EZTPA00                                             00039900
//PRNTOUT1 DD  SYSOUT=*                                                 00041200
//SYSPRINT DD  SYSOUT=*                                                 00041300
//SYSIN    DD  DSN=DE.DE24APDS.PROD.CARD(YD0SC015),DISP=SHR             00041400
