DEFINE DATA LOCAL
1 SOMEFIELDNAME (A10)
1 TO-PROCESS (L) INIT<TRUE>
END-DEFINE

DEFINE WORK FILE 1 'src/res/workfile/MEE7349'

L1. READ WORK FILE 1 SOMEFIELDNAME
	BEFORE BREAK
			PROCESSING
		WRITE '0'
	END-BEFORE

	AT BREAK (L1.) OF     SOMEFIELDNAME
		WRITE '1'
	END-BREAK

	AT START
		OF
			DATA (L1.)
		WRITE '2'
	END-START

	AT END
		OF
			DATA (L1.)
		WRITE '3'
	END-ENDDATA
END-WORK

READ WORK FILE 1 SOMEFIELDNAME
	BEFORE BREAK        PROCESSING
		WRITE '4'
	END-BEFORE

	AT BREAK
			OF     SOMEFIELDNAME
		WRITE '5'
	END-BREAK

	AT START
		OF
			DATA
		WRITE '6'
	END-START

	AT END
		OF
			DATA
		WRITE '7'
	END-ENDDATA
END-WORK

END