DEFINE DATA
LOCAL
1 #VAR1 (P11.2)
END-DEFINE

DECIDE FOR FIRST CONDITION
    WHEN #VAR1 = 5 
		WRITE NOTITLE '1'
    WHEN #VAR1 = 15
    	IGNORE
    WHEN NONE 
		WRITE NOTITLE '1 NONE'
    WHEN ANY 
		WRITE NOTITLE '1 ANY'
    WHEN ALL 
		WRITE NOTITLE '1 ALL'
END-DECIDE

DECIDE
	FOR
		FIRST
			CONDITION
    WHEN #VAR1 = 6 
		WRITE NOTITLE '2'
END-DECIDE




DECIDE FOR EVERY CONDITION
    WHEN #VAR1 = 7 
		WRITE NOTITLE '3'
    WHEN #VAR1 = 16  IGNORE
    WHEN ANY 
		WRITE NOTITLE '3 ANY'
    WHEN ALL 
		WRITE NOTITLE '3 ALL'
    WHEN NONE 
		WRITE NOTITLE '3 NONE'
END-DECIDE

DECIDE
	FOR
		EVERY
			CONDITION
    WHEN #VAR1 = 8
		WRITE NOTITLE '4'
    WHEN #VAR1 = 17  IGNORE
    WHEN ANY 
		WRITE NOTITLE '4 ANY'
    WHEN ALL 
		WRITE NOTITLE '4 ALL'
    WHEN NONE 
		WRITE NOTITLE '4 NONE'
END-DECIDE


END
