DEFINE DATA
LOCAL
1 #VAR1 (P11.2)
1 EMP VIEW OF EMPLOYEES
 2 PERSONNEL-ID
 2 JOB-TITLE
 2 FIRST-NAME
END-DEFINE

FIND
	EMP PERSONNEL-ID GT '30000311'
	WRITE NOTITLE '0'
END-FIND

FIND EMP WITH PERSONNEL-ID GT '40000311' SORTED BY PERSONNEL-ID
  WHERE *TRANSLATE(JOB-TITLE, UPPER) = 'INGENIEUR COMMERCIAL'
    WRITE NOTITLE '1'
END-FIND

FIND
	(5)
		EMP
			WITH
				PERSONNEL-ID GT '40000311'
					SORTED BY
						PERSONNEL-ID
  WHERE *TRANSLATE(JOB-TITLE, UPPER) = 'INGENIEUR COMMERCIAL'
    WRITE NOTITLE '2'
END-FIND

FIND
	(#VAR1)
		IN
			EMP
				WITH
					PERSONNEL-ID GT '40000311' AND 
						JOB-TITLE EQ 'IT' OR
						JOB-TITLE EQ 'IT2'
  WHERE *TRANSLATE(JOB-TITLE, UPPER) = 'INGENIEUR COMMERCIAL'
    WRITE NOTITLE '3'
END-FIND

FIND FIRST EMP WITH PERSONNEL-ID GT '50000311'
	WHERE *TRANSLATE(JOB-TITLE, UPPER) = 'IT Guy'
    	WRITE NOTITLE '4'
END-FIND

FIND UNIQUE EMP WITH PERSONNEL-ID GT '60000311'
	WHERE *TRANSLATE(JOB-TITLE, UPPER) = 'IT Guy2'
    	WRITE NOTITLE '5'
END-FIND

FIND (10) EMP FIRST-NAME NE 'MORENO' STARTING WITH ISN = #VAR1 SORTED BY FIRST-NAME
  WRITE NOTITLE '6'
END-FIND

END