DEFINE DATA
LOCAL
1 #I (I4)
1 #START (N5.4)
1 #ENDE (N5.4)
1 #STEP (N5.4)
1 #SUM (I4)
1 #INDEX1 (N3)
1 #INDEX2 (N3)
1 #INDEX3 (N3)
END-DEFINE
 
FOR
	#I
		FROM
			#START
				TO
					#ENDE
						STEP
							#STEP
	ADD 1 TO #SUM
	WRITE '1'
END-FOR

FOR #I FROM #START TO #ENDE STEP -1
	ADD 2 TO #SUM
	WRITE '2'
END-FOR

FOR #I 1 TO 10
	WRITE '3'
END-FOR

FOR
	#INDEX1
		1
			TO
				10
					STEP
						2
	WRITE '4'
END-FOR

FOR #I := 1
	THRU #ENDE
		STEP 1
	WRITE '4'
END-FOR

FOR #I
	EQ 1
		TO 3
	WRITE '5'
END-FOR

END
