DEFINE DATA
LOCAL
1 HIST-VIEW VIEW MEE4579D
  2 D-KNR-TNR-FAP-SUCHBEGRIFF-GDAT(1:1)
  2 CITY (A20)
END-DEFINE

HISTOGRAM
	HIST-VIEW CITY STARTING FROM 'M'
	WRITE NOTITLE '0'
END-HISTOGRAM

HISTOGRAM
	HIST-VIEW
		D-KNR-TNR-FAP-SUCHBEGRIFF-GDAT
	WRITE NOTITLE '1'
END-HISTOGRAM

HISTOGRAM
	HIST-VIEW
		IN
			ASCENDING
				SEQUENCE
					D-KNR-TNR-FAP-SUCHBEGRIFF-GDAT
	WRITE NOTITLE '2'
END-HISTOGRAM

HISTOGRAM
	HIST-VIEW
		D-KNR-TNR-FAP-SUCHBEGRIFF-GDAT
			STARTING
				FROM
					1
	WRITE NOTITLE '3'
END-HISTOGRAM

HISTOGRAM
	(12)
		HIST-VIEW
			IN
				DESCENDING
					SEQUENCE
						FOR
							D-KNR-TNR-FAP-SUCHBEGRIFF-GDAT
								FROM
									0
	WRITE NOTITLE '4'
END-HISTOGRAM

END