DEFINE DATA
LOCAL
1 #VAR1 (P11.2)
1 #VAR2 (P11.2)
END-DEFINE
FORMAT (1) PS=100
 
MOVE '792,12' TO #VAR1
MOVE '28,34'  TO #VAR2

IF TRUE EQ TRUE AND FALSE EQ FALSE
  WRITE NOTITLE '1' '=' #VAR1 '=' #VAR2
ELSE 
  WRITE NOTITLE '2' '=' #VAR1 '=' #VAR2
END-IF

IF #VAR1 EQ 1 AND #VAR2 EQ 2
  WRITE NOTITLE '3' '=' #VAR1 '=' #VAR2
END-IF

IF #VAR1 EQ 3 AND #VAR2 EQ 4
  OR 
   #VAR1 EQ 5 AND #VAR2 EQ 6
  WRITE NOTITLE '4' '=' #VAR1 '=' #VAR2
ELSE 
  WRITE NOTITLE '5' '=' #VAR1 '=' #VAR2
END-IF

END
