DEFINE DATA LOCAL
1 #A (A1)
1 #B (A1)
1 #AUSWAHL (A001/1:8)
END-DEFINE

IF SELECTION NOT UNIQUE #A #B
	WRITE '0'
END-IF

IF SELECTION NOT UNIQUE #A #B
	THEN
		WRITE '1'
	ELSE
		WRITE '2'
END-IF

IF
	SELECTION
		NOT
			UNIQUE
				IN
					#AUSWAHL(1:8)
	WRITE '3'
END-IF

IF SELECTION NOT UNIQUE & (1:8)
     WRITE '4'
END-IF


END