DEFINE DATA
LOCAL
1 #INDEX           (I4)

1 DELETE-VIEW VIEW OF DDM0121
  2 K121-JAHRMON   (N6)
  
1 STORE-VIEW VIEW OF DDM0121
  2 K121-JAHRMON   (N6)
  2 K121-TAGE
   3 K121-TAGNUMMER   (N7/#INDEX)
  
1 READ-VIEW VIEW OF DDM0121
  2 K121-JAHRMON   (N6)
  2 K121-TAGE
   3 K121-TAGNUMMER   (N7/1:4)
END-DEFINE

READ
	READ-VIEW
	WRITE NOTITLE '0'
END-READ

READ
	DELETE-VIEW
		BY
			DELETE-VIEW.K121-JAHRMON
    DELETE
    WRITE NOTITLE '1'
END-READ

READ
	READ-VIEW
		BY
			ISN
    DELETE
    WRITE NOTITLE '2'
END-READ

READ
	(30)
		READ-VIEW
	WRITE NOTITLE '3'
END-READ

READ
	READ-VIEW
		IN
			PHYSICAL SEQUENCE
	WRITE NOTITLE '4'
END-READ


READ
	READ-VIEW
		BY
			ISN
				STARTING FROM 1 ENDING AT 3
    DELETE
    WRITE NOTITLE '5'
END-READ

READ
	READ-VIEW
		WITH
			REPOSITION
				BY
					K121-JAHRMON
						= #INDEX
    WRITE NOTITLE '6'
END-READ

END