DEFINE DATA
LOCAL
1 #A (A20)
1 #ARR (A6/1:*)
1 #OCC (I4)
END-DEFINE

DEFINE WORK FILE 2 'C:\temp\mee4338b.txt' TYPE 'ASCII'

READ
	WORK
		FILE
			2
				#A
  WRITE NOTITLE '0'
END-WORK

READ
	WORK
		FILE
			2
				ONCE
					#A
AT END OF FILE
	#A := 'unexpected end of file'
	WRITE WORK FILE 2 #A
END-ENDFILE

READ WORK FILE 2
	AND
		SELECT
			#A
  DISPLAY *LENGTH(#A) #A (AL=40)
  WRITE NOTITLE '1'
END-WORK

READ
	WORK
		FILE
			2
				RECORD
					#A
  DISPLAY NOTITLE #PERS-ID #NAME
  WRITE NOTITLE '2'
END-WORK

END