DEFINE DATA
LOCAL
1 #VAR1 (P11.2)
1 EMP VIEW OF EMPLOYEES
 2 PERSONNEL-ID
 2 JOB-TITLE
 2 FIRST-NAME
END-DEFINE

REPEAT
	ADD 1 TO #VAR1
	IF #VAR1 = 1
		ESCAPE BOTTOM
	END-IF
	WRITE NOTITLE '1'
END-REPEAT

REPEAT
	WHILE
		#VAR1
			< 2
	ADD 1 TO #VAR1
	WRITE NOTITLE '2'
END-REPEAT

REPEAT
	ADD 1 TO #VAR1
	WRITE NOTITLE '3'
	WHILE
		#VAR1
			< 3
END-REPEAT

REPEAT
	ADD 1 TO #VAR1
	WRITE NOTITLE '4'
  UNTIL
	#VAR1
		< 4
END-REPEAT

REPEAT
  UNTIL
	#VAR1
		< 5
	ADD 1 TO #VAR1
	WRITE NOTITLE '5'
END-REPEAT


END