       IDENTIFICATION DIVISION.
       PROGRAM-ID. MGOPRGM4.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MGO-TEST-FILE-7    ASSIGN     MGOFILE7.
           SELECT MGO-TEST-FILE-8    ASSIGN     MGOFILE8.
       FILE SECTION.
       FD  MGO-TEST-FILE-7
             LABEL RECORDS ARE STANDARD
             RECORDING MODE IS F
             BLOCK CONTAINS 0 RECORDS.
       01  EXTRACT-REC-7       PIC X(232).

       FD  MGO-TEST-FILE-8
             LABEL RECORDS ARE STANDARD
             RECORDING MODE IS F
             BLOCK CONTAINS 0 RECORDS.
       01  EXTRACT-REC-8       PIC X(232).

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  REC.

       PROCEDURE DIVISION.
            OPEN INPUT MGO-TEST-FILE-7
                       MGO-TEST-FILE-8
            STOP RUN.
