         PCB   TYPE=TP,                                                X        
               MODIFY=YES,                                             X        
               EXPRESS=YES                                                      
*PCBNAME=BDHGYRKD                                                               
         PCB   TYPE=DB,                                                X        
               DBDNAME=WCDB01P0,                                       X        
               KEYLEN=8,                                               X        
               PROCOPT=AEP                                                      
         SENSEG NAME=FFFFGROP,PARENT=0                                          
         SENSEG NAME=FFFFNAME,PARENT=FFFFGROP                                   
*                                                                               
*PCBNAME=BGHYYUGSJ                                                               
         PCB   TYPE=DB,                                                X        
               DBDNAME=WCDB02P0,                                       X        
               KEYLEN=8,                                               X        
               PROCOPT=GOTP                                                     
         SENSEG NAME=CS02USER,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,                                            X        
               PSBNAME=CDA001,                                         X        
               CMPAT=YES                                                        
         END                                                                    
