       IDENTIFICATION DIVISION.
       PROGRAM-ID. SQLALIASES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
            EXEC SQL
              DECLARE ASD CURSOR FOR WITH ALIASTABLE1 AS
              (SELECT A, B, C FROM T1),
              ALIASTABLE2 AS
              (SELECT A, B, C FROM T1),
              ALIASTABLE3 AS
              (SELECT A, B, C FROM T1
              LEFT OUTER JOIN ALIASTABLE2)
              SELECT A, B, C FROM ALIASTABLE1 ,
              ALIASTABLE3
            END-EXEC
       PROCEDURE DIVISION.
           GOBACK.

