       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLEE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.

        01 G1 PIC X.

       PROCEDURE DIVISION USING G1.

         DISPLAY G1.

       END PROGRAM CALLEE.
