//MATEKSD JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//EXP1      EXEC  PGM=RTN
//EXP2      EXEC  PGM=RTN
//EXP3      EXEC  PGM=ERROR
//IFTEST3   IF  (EXP1.RC > 12) THEN
//STEP1BAD    IF  (EXP2.RC > 12 OR EXP3.RC > 12) THEN
//STEP1ERR    EXEC  PGM=ERRTN,PARM=(EXP1)
//            ELSE
//STEP2ERR    EXEC  PGM=ERRTN,PARM=(EXP2)
//END1BAD     ENDIF
//          ELSE
//NOPROB    EXEC  PGM=RUNOK
//ENDTEST3  ENDIF
