         PRINT NOGEN                                                            
         DBD   NAME=DBD8255B,                                          X
               ACCESS=(PHDAM,OSAM),                                    X        
               RMNAME=(DFSHDC40,1,1)                                            
         SEGM  NAME=QRSTCASE,                                          X        
               PARENT=0,                                               X        
               BYTES=443,                                              X        
               COMPRTN=(ABCD02C1,DATA,INIT)                                     
         FIELD NAME=(CASE,SEQ,U),                                      X        
               BYTES=6,                                                X        
               START=1,                                                X        
               TYPE=P                                                           
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
