*****************************************************************
         PRINT ON,NOGEN
********************************************************************
ENQY03   FMT
         DEV   TYPE=(3270,2),                                          X
               FEAT=IGNORE,                                            X
               DSCA=X'00F0',                                           X
               PFK=(PFKFLD,                                            X
               1='INQ3    01',                                         X
               2='INQ3    02',                                         X
               3='INQ3    03')
         DIV   TYPE=INOUT
         DPAGE CURSOR=((5,11)),                                        X
               FILL=PT
         DFLD  'MEMBER ENQUIRY',                                       X
               POS=(2,32),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'DATE: ',                                               X
               POS=(3,65),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
CURDATE  DFLD  POS=(3,72),                                             X
               LTH=9,                                                  X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'MEM ID: ',                                             X
               POS=(5,2),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
MEMID    DFLD  POS=(5,11),                                             X
               LTH=8,                                                  X
               ATTR=(NOPROT,ALPHA,NORM,MOD)
         DFLD  'PF1:MENU  PF2:DEMOGRAPHIC  PF3:COVERAGE',              X
               POS=(20,2),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
ERRMSG   DFLD  POS=(22,2),                                             X
               LTH=79,                                                 X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         FMTEND
********************************************************************
********************************************************************
ENQ03    MSG   TYPE=OUTPUT,                                            X
               SOR=(ENQY03,IGNORE),                                    X
               FILL=C' ',                                              X
               PAGE=YES,                                               X
               NXT=ENQ03I
         SEG
         MFLD (CURDATE,DATE2)
         MFLD MEMID,LTH=8
         MFLD ERRMSG,LTH=79
         MSGEND
********************************************************************
ENQ03I   MSG   TYPE=INPUT,                                             X
               SOR=(ENQY03,IGNORE),                                    X
               NXT=ENQ03
         SEG
         MFLD  PFKFLD,                                                 X
               LTH=10,FILL=NULL
         MFLD  MEMID,                                                  X
               LTH=8,FILL=NULL
         MSGEND
********************************************************************
         END