*****************************************************************
         PRINT ON,NOGEN
********************************************************************
ENRL01   FMT
         DEV   TYPE=3270-A2,                                           X
               FEAT=IGNORE,                                            X
               DSCA=X'00F0',                                           X
               PFK=(PFKFLD,                                            X
               1='INQ1    01',                                         X
               2='TRENR1    ')
         DIV   TYPE=INOUT
         DPAGE CURSOR=((5,11)),                                        X
               FILL=PT
         DFLD  'ENROLL MEMBER',                                        X
               POS=(2,16),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'DATE: ',                                               X
               POS=(3,65),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
CURDATE  DFLD  POS=(3,72),                                             X
               LTH=9,                                                  X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DO    04
A        DFLD  'FLD 1: ',                                              X
               POS=(5,2),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
FLD1     DFLD  POS=(5,10),                                             X
               LTH=4,                                                  X
               ATTR=(MOD)
B        DFLD  'FLD 2: ',                                              X
               POS=(5,16),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
FLD2     DFLD  POS=(5,24),                                             X
               LTH=5,                                                  X
               ATTR=(MOD)
         ENDDO
         DO    03,2,MAX,SUF=1
C        DFLD  'FLD 3: ',                                              X
               POS=(10,2),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
FLD3     DFLD  POS=(10,10),                                            X
               LTH=5,                                                  X
               ATTR=(MOD)
D        DFLD  'FLD 4: ',                                              X
               POS=(10,16),                                            X
               ATTR=(PROT,ALPHA,HI,NOMOD)
FLD4     DFLD  POS=(10,24),                                            X
               LTH=10,                                                 X
               ATTR=(MOD)
         ENDDO
         DO    02,SUF=1
E        DFLD  'FLD 5: ',                                              X
               POS=(16,2),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
FLD5     DFLD  POS=(16,10),                                            X
               LTH=3,                                                  X
               ATTR=(MOD)
F        DFLD  'FLD 6: ',                                              X
               POS=(16,16),                                            X
               ATTR=(PROT,ALPHA,HI,NOMOD)
FLD6     DFLD  POS=(16,24),                                            X
               LTH=5,                                                  X
               ATTR=(MOD)
G        DFLD  'FLD 7: ',                                              X
               POS=(16,32),                                            X
               ATTR=(PROT,ALPHA,HI,NOMOD)
FLD7     DFLD  POS=(16,40),                                            X
               LTH=4,                                                  X
               ATTR=(MOD)
H        DFLD  'FLD 8: ',                                              X
               POS=(16,48),                                            X
               ATTR=(PROT,ALPHA,HI,NOMOD)
FLD8     DFLD  POS=(16,56),                                            X
               LTH=6,                                                  X
               ATTR=(MOD)
         ENDDO
         DO    02,1,30,SUF=1
I        DFLD  'FLD 9: ',                                              X
               POS=(20,2),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
FLD9     DFLD  POS=(20,10),                                            X
               LTH=5,                                                  X
               ATTR=(MOD)
J        DFLD  'FLD 10: ',                                             X
               POS=(20,16),                                            X
               ATTR=(PROT,ALPHA,HI,NOMOD)
FLD10    DFLD  POS=(20,24),                                            X
               LTH=5,                                                  X
               ATTR=(MOD)
         ENDDO
         DFLD  'PF1:MENU  PF2:CREATE',                                 X
               POS=(23,2),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         FMTEND
********************************************************************
********************************************************************
ENRL1    MSG   TYPE=OUTPUT,                                            X
               SOR=(ENRL01,IGNORE),                                    X
               NXT=ENRL1I
         SEG
         DO    04
         MFLD  FLD1,LTH=4
         MFLD  FLD2,LTH=5
         ENDDO
         DO    03
         MFLD  FLD3,LTH=5
         MFLD  FLD4,LTH=10
         ENDDO
         DO    02
         MFLD  FLD5,LTH=3
         MFLD  FLD6,LTH=5
         MFLD  FLD7,LTH=4
         MFLD  FLD8,LTH=6
         ENDDO
         DO    02
         MFLD  FLD9,LTH=5
         MFLD  FLD10,LTH=5
         ENDDO
         MSGEND
********************************************************************
ENRL1I   MSG   TYPE=INPUT,                                             X
               SOR=(ENRL01,IGNORE),                                    X
               NXT=ENRL1
         SEG   GRAPHIC=NO
         MFLD  PFKFLD,                                                 X
               LTH=10
         MFLD  'INQ1      ',                                           X
               LTH=8
         DO    04
         MFLD  FLD1,LTH=4
         MFLD  FLD2,LTH=5
         ENDDO
         DO    03
         MFLD  FLD3,LTH=5
         MFLD  FLD4,LTH=10
         ENDDO
         DO    02
         MFLD  FLD5,LTH=3
         MFLD  FLD6,LTH=5
         MFLD  FLD7,LTH=4
         MFLD  FLD8,LTH=6
         ENDDO
         DO    02
         MFLD  FLD9,LTH=5
         MFLD  FLD10,LTH=5
         ENDDO
         MSGEND
********************************************************************
         END