         PCB       TYPE=DB,DBDNAME=INDB1,KEYLEN=20,PROCOPT=A
         SENSEG    NAME=SEGONE2
         SENSEG    NAME=SEGTWO,PARENT=SEGONE2
         SENSEG    NAME=SEGTHR,PARENT=SEGONE2
         PSBGEN    PSBNAME=INRUN1,LANG=COBOL
         END