*****************************************************************
         PRINT ON,NOGEN
*****************************************************************
MENU02   FMT
         DEV   TYPE=(3270,2),                                          X
               FEAT=IGNORE,                                            X
               DSCA=X'00F0',                                           X
               PFK=(PFKFLD,                                            X
               '/FOR ENQ02',                                           X
               '/FOR ENRL2',                                           X
               '/FOR UPDT2',                                           X
               '/FOR ERRO2')
         DIV   TYPE=INOUT
         DPAGE CURSOR=((16,24)),                                       X
               FILL=NULL
         DFLD  'MAIN MENU',                                            X
               POS=(5,5),                                              X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'DATE :',                                               X
               POS=(5,65),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
CURDATE  DFLD  POS=(5,72),                                             X
               LTH=9,                                                  X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  '1.MEMBER LOOKUP',                                      X
               POS=(12,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  '2.ENROLL MEMBER',                                      X
               POS=(13,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  '3.UPDATE MEMBER',                                      X
               POS=(14,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  '4.ERROR HANDLING',                                     X
               POS=(15,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  '5.EXIT',                                               X
               POS=(16,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'SELECT MENU OPTION ',                                  X
               POS=(17,5),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         DFLD  'PF1:LOOKUP  PF2:ENROLL  PF3:UPDATE  PF4:ERROR  PF5:EXITX
               ',                                                      X
               POS=(19,2),                                             X
               ATTR=(PROT,ALPHA,HI,NOMOD)
ERRMSG   DFLD  POS=(21,2),                                             X
               LTH=79,                                                 X
               ATTR=(PROT,ALPHA,HI,NOMOD)
         FMTEND
********************************************************************
********************************************************************
MENU2    MSG   TYPE=OUTPUT,                                            X
               SOR=(MENU02,IGNORE),                                    X
               FILL=PT,                                                X
               NXT=MENU2I
         SEG
         MFLD (CURDATE,DATE2)
         MFLD ERRMSG,LTH=79
         MSGEND
********************************************************************
MENU2I   MSG   TYPE=INPUT,                                             X
               SOR=(MENU02,IGNORE),                                    X
               NXT=MENU2
         SEG
         MFLD  PFKFLD,                                                 X
               LTH=10
         MSGEND