//OSWAYAO JOB (20,FB3),'I',
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
// NOTIFY=&SYSUID,
// REGION=0M
//*
//*
//DFSF10 JCLLIB ORDER=(VENDOR.PROCLIB,DFSF10.PROCLIB)
//       EXPORT SYMLIST=(*)
//*
//* Change the following variables to match your requirements
//*
//* The name of your PSB
//        SET PSB=INRUN1
//* The name of your DBD
//        SET DBD=INDB1
//* The name of your INDEX DBD for HIDAM or PHIDAM
//        SET DBDI=INDB1I
//* The name of your cobol program that executes IMS commands
//        SET PGM=QATF82A
//* Where your temporary test datasets will be stored
//        SET HLQ=OSWAYAO.TEST
//* Your mainframe username
//        SET UNAME=OSWAYAO
//*
//* SCRATCH DATA SETS
//*
//SCRATCH EXEC PGM=IDCAMS,DYNAMNBR=200
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *,SYMBOLS=JCLONLY
  DELETE &UNAME..IMSOUT SCRATCH
  SET MAXCC=0
//*
//* PSBGEN LOAD
//*
//PSBGENL  EXEC PROC=PSBGEN,MBR=&PSB.,SOUT='*'
//L.SYSLMOD DD DISP=SHR,DSN=&HLQ..PSBLIB(&PSB.)
//C.SYSIN  DD DISP=SHR,DSN=&UNAME..&PSB.
//*
//* COMPILE COBOL
//*
//CBLSTP EXEC IGYWCL,REGION=250M,
// PARM.COBOL='MAP,OFFSET,VBREF,XREF,OBJ'
//COBOL.SYSIN   DD DISP=SHR,DSN=&UNAME..&PGM.
//LKED.SYSLMOD DD DISP=SHR,DSN=&HLQ..PGMLIB
//LKED.RESLIB  DD DISP=SHR,DSN=DFSF10.SDFSRESL
//LKED.SYSIN DD *,SYMBOLS=JCLONLY
  INCLUDE RESLIB(DFSLI000) -
      ENTRY &PGM.
      NAME &PGM.(R)
//* Run Batch
//*
//*
//* HIDAM/OSAM UPDATE
//*
//HIDAMUPD EXEC PGM=DFSRRC00,
//             PARM='DLI,&PGM.,&PSB.,,,,,,,,,,N,N'
//DFSRESLB DD DSNAME=DFSF10.SDFSRESL,DISP=SHR
//DFSPRING DD SYSOUT=*,DCB=(BLKSIZE=605,LRECL=121,RECFM=FBA)
//STEPLIB  DD DISP=SHR,DSN=DFSF10.SDFSRESL
//         DD DISP=SHR,DSN=&HLQ..PGMLIB
//IMS      DD DISP=SHR,DSN=&HLQ..PSBLIB
//         DD DISP=SHR,DSN=&HLQ..DBDLIB
//*
//IEFRDER  DD DSN=&&IMSLOG,DISP=(NEW,PASS)
//DFSVSAMP DD DISP=SHR,DSN=DFSF10.PROCLIB(DFSVSMDB)
//DFSCTL   DD DISP=SHR,DSN=DFSF10.PROCLIB(DFSSBPRM)
//IMSLOGR  DD DSN=&&LOGF,DISP=(NEW,DELETE,DELETE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0,BUFNO=25),
//            SPACE=(TRK,1,RLSE)
//DFSSTAT  DD SYSOUT=*
//SYSEXEC  DD DISP=SHR,DSN=DFSF10.INSTALIB
//         DD DISP=SHR,DSN=DFSF10.SDFSEXEC
//*  Create the output file
//OUT DD DSN=&UNAME..IMSOUT,DISP=(NEW,CATLG,DELETE),
//      SPACE=(CYL,(20,20)),
//      RECFM=FB,LRECL=80,BLKSIZE=8000
//SYSTSIN  DD *
//*
//SYSTSPRT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//*
//* Partitioned DB INDB1
//INDB1  DD DSNAME=&HLQ..&DBD.,DISP=SHR
//INDB1I DD DSNAME=&HLQ..&DBDI.,DISP=SHR
//*
//*
//* SCRATCH DATA SETS
//*
//SCRATCH EXEC PGM=IDCAMS,DYNAMNBR=200
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *,SYMBOLS=JCLONLY
  DELETE &HLQ..&DBD. NONVSAM SCRATCH
  DELETE &HLQ..&DBDI..IC101 NONVSAM SCRATCH
  DELETE &HLQ..&DBDI. CLUSTER
  DELETE &HLQ..PSBLIB NONVSAM SCRATCH
  DELETE &HLQ..DBDLIB NONVSAM SCRATCH
  DELETE &HLQ..PGMLIB NONVSAM SCRATCH
/*