 CND022A: PROCEDURE OPTIONS(MAIN);
 
    %INCLUDE BAS001B; 
    DCL A FLOAT DECIMAL INIT(3.141592E+40);
    DCL I FIXED DECIMAL;
    /* THIS CODE IS SHOW THE FINAL VERSION OF UNDERFLOW */
    /* IN CASE OF MULTIPLE VERSIONS FOR UNDERFLOW */
    ON UNDERFLOW SNAP
    BEGIN;
        PUT SKIP LIST('INSIDE UNDERFLOW 1', ONCODE());
        PUT SKIP LIST('');
        PUT SKIP LIST('');
        PUT SKIP LIST('A');
        PUT SKIP LIST('Test Case : MEMORY CHECK UNDERFLOW 1 CONDITION  ******');
        PUT SKIP LIST('');
        CALL HEXDUMP32(ADDR(A),SIZE(A));
    END;
     
    ON UNDERFLOW SNAP
    BEGIN;
        PUT SKIP LIST('INSIDE UNDERFLOW 2', ONCODE());
        PUT SKIP LIST('');
        PUT SKIP LIST('');
        PUT SKIP LIST('A');
        PUT SKIP LIST('Test Case : MEMORY CHECK UNDERFLOW 2 CONDITION  ******');
        PUT SKIP LIST('');
        CALL HEXDUMP32(ADDR(A),SIZE(A));
    END;
        
    ON ERROR SYSTEM;
    
    ON FINISH SYSTEM;
    
    (UNDERFLOW):
    BEGIN;
        PUT SKIP LIST('UNDERFLOW ENABLED');
        DO i = 1 REPEAT i+1 UNTIL (i = 20); 
            A = A / 10000000000;
        END;
    END; 
       
    PUT SKIP LIST('PRE REVERT', A);
    REVERT UNDERFLOW;
    
    PUT SKIP LIST('POST REVERT', A);
    A = 3.141592E+40;
    DO i = 1 REPEAT i+1 UNTIL (i = 20); 
        A = A / 10000000000;
    END;
    
    PUT SKIP LIST('END FLOW');
    
 END CND022A;