 ME11027: PROCEDURE OPTIONS(MAIN);
 
 DCL H1 BIN FIXED(31);
 DCL H2 BIN FIXED(31);
 DCL H3 BIN FIXED(31);
 DCL 1
   %INCLUDE TESTCPY;
  ;
 DCL H5 BIN FIXED(31);
  
 END ME11027;
 