IF TRUE EQ TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE = TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE EQUAL TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE EQUAL TO TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE NE TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
***IF TRUE ¬=TRUE
***WRITE NOTITLE 'TEST IF CONDITION - not working on jenkins so  commenting'
***END-IF
IF TRUE <> TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE NOT = TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE NOT EQ TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE NOTEQUAL TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE NOT EQUAL TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
***IF TRUE NOT EQUAL TRUE
***WRITE NOTITLE 'TEST IF CONDITION- DONT WORKS - NOT EQUAL TO'
***END-IF
IF TRUE LT TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE LESS THAN TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE < TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE GE TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE GREATER EQUAL TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE >= TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE NOT < TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE NOT LT TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF

IF TRUE GT TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE GREATER THAN TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE > TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE LE TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
***IF TRUE LT TRUE
***WRITE NOTITLE 'TEST IF CONDITION - LESS EQUAL - NOT WORKING'
***END-IF
IF TRUE <= TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE NOT > TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
IF TRUE NOT GT TRUE
WRITE NOTITLE 'TEST IF CONDITION'
END-IF
END