IF #CONDITION1 AND #CONDITION2
	WRITE NOTITLE 'parent if'
	IF TRUE EQ TRUE
	 WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE = TRUE
	 WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE EQUAL TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE EQUAL TO TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE NE TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE <> TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE NOT = TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE NOT EQ TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE NOTEQUAL TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE NOT EQUAL TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE LT TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE LESS THAN TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE < TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE GE TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE GREATER EQUAL TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE >= TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE NOT < TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE NOT LT TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	
	IF TRUE GT TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE GREATER THAN TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE > TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE LE TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE <= TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE NOT > TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
	IF TRUE NOT GT TRUE
	WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
ELSE                                                       
    IF #CONDITION3                                       
        WRITE NOTITLE 'if'                                      
    END-IF                                                   
END-IF
END
