IF #CONDITION1 AND #var1 EQ 1 OR #Condition2 OR #var2 = 4 AND #var3 EQUAL 4 OR #var3 EQUAL TO 4 AND #var1 NE 1 OR #var3 <> 3 OR #var3 NOT = 3
    WRITE NOTITLE 'parent if'
    IF #CONDITION1 AND VAR1 NOT EQ 1 OR #var1 NOTEQUAL 1 AND #var1 NOT EQUAL 1 AND #var1 LT 1 AND #var1 < 1 AND #var1 GE 1 AND #var1 GREATER EQUAL 1
		WRITE NOTITLE 'TEST IF CONDITION'
	END-IF
ELSE                                                       
    IF #CONDITION1 AND VAR1 >= 1 OR #var1 NOT < 1 AND #var1 NOT LT 1 OR #CONDITION1 AND #var1 GT 1 AND #var1 GREATER THAN 1 AND #var1 > 1 AND #var1 LE 1 AND #var1 <= 1
		WRITE NOTITLE 'TEST IF CONDITION'
		IF #CONDITION1 AND VAR1 NOT > 1 OR #var1 NOT GT 1
			WRITE NOTITLE 'TEST IF CONDITION'
		END-IF
	END-IF
END-IF
END