IF #DATE = MASK (YYYYMMDD) AND #DATE = MASK (1950-2020)
	WRITE NOTITLE 'if'
END-IF

IF #CODE = MASK (NN'ABC'....NN)
	WRITE NOTITLE 'if'
END-IF

IF #DATE = MASK (YYYYMMDD) AND #DATE <> MASK (#var1)
	WRITE NOTITLE 'if'
END-IF

IF #VALUE = MASK (...'123')
	WRITE NOTITLE 'if'
END-IF

IF #LICENSE = MASK ('NY-'XXXXX) #VALUE
	WRITE NOTITLE 'if'
END-IF

IF #DATE = MASK (YYYY'-'MM'-'DD) AND #DATE = MASK (19-20)
	WRITE NOTITLE 'if'
END-IF

END