//WEO016U3 PROC LOADLIB=,     //*TEST JOB
//         REPORT=,           // MEMBER FOR REPORT
//         RGN=,              // REGION TO RELINK
//         CICSREGN=,         // CICS REGION TO NEWCOPY
//         SUBLIB=,           // SUBPROGRAM LOAD LIBRARY
//         USERID=,           // USERID SUBMITTING JOB
//         VERBOSE='DUMMY'    // QUITE=>'DUMMY' LOAD='SYSOUT=*'