//JOB110A JOB (J00,068),'JOB110A',                                            
//      MSGCLASS=A,PRTY=11,TIME=(30)                                            
//PS020   EXEC PGM=DFSRRC00,                                                    
//             PARM=(123,XYZ010,PSB010)                                              
//*                                                                             
