DEFINE DATA
LOCAL
1 #I (I4)
END-DEFINE

FORMAT (1) PS=0

WRITE (1) NOTITLE *PROGRAM

FOR #I = 1 TO 10
WRITE (1) NOTITLE 'Iteration' #I
FETCH RETURN 'MEE1144S'
END-FOR

END
