           10 LVSA0100  PIC S9(009)V9(02) COMP-3.                               
           10 LVSA0110  PIC S9(009)V9(02) COMP-3.                               
