           10  MMRS-CURRENT-DATE-JHJJMMDD.
               15  MMRS-CURRENT-YEAR-JH    PIC  9(2).
               15  MMRS-CURRENT-YEAR-JJ    PIC  9(2).
               15  MMRS-CURRENT-MONTH      PIC  9(2).
               15  MMRS-CURRENT-DAY        PIC  9(2).
