//TESTJOB   JOB 000,CLASS=P,MSGCLASS=C                                   00001**2
//STEP01   EXEC TESTPROC,                                                00003
//             ENV=PROD                                               00006
