 X: proc options(main);
  dcl (A,B) char(1);
  call Y(5);
  PUT SKIP LIST('INSIDE NESTED_PROC');
  Y: proc(a);
   DECLARE FXD_1 FIXED DECIMAL(1) INIT(1);
   return;
  end Y;
 end X;