 X: proc options(main);
  PUT LIST('Employee');
  if name = 'ABC' then
    call Y;
  PUT SKIP LIST('Address');
  Y: proc;
   PUT LIST('Employee ID');
   return;
  end Y;
 end X;
 