 CMP038A: PROCEDURE OPTIONS(MAIN);
 
    DCL A FIXED DECIMAL INIT(1);
    DCL B FIXED DECIMAL INIT(2);
    
    IF ( A ~= B) THEN DO;    
     PUT SKIP LIST('A ¬= B', A ~= B);
    END;    
    IF ( A ^= B) THEN DO;    
     PUT SKIP LIST('A ^= B', A ^= B);
    END;
    PUT SKIP LIST('');
    
    
 END CMP038A;