100700 IDENTIFICATION DIVISION. 
101000 PROGRAM-ID.    NN-192.
101100 AUTHOR.        CVCVC XXXXX.
101200 DATE-COMPILED.
101300 DATE-WRITTEN.  JUNE 1991.
105200 ENVIRONMENT DIVISION.
105500 CONFIGURATION SECTION.
106200 SOURCE-COMPUTER. UNIX. 
106300 OBJECT-COMPUTER. UNIX.
106400 SPECIAL-NAMES.
106500     ENVIRONMENT-NAME IS ENV-NAME
106600     ENVIRONMENT-VALUE IS ENV-VALUE.
106700*VME
106800
106900 INPUT-OUTPUT SECTION.
107100 FILE-CONTROL.
109000 DATA DIVISION.
109300 FILE SECTION.
114600 WORKING-STORAGE SECTION.
132300 REPORT SECTION.
148300 PROCEDURE DIVISION. 
148400*VME
163900 MAIN-PROGRAM SECTION.
186300 B200-CHECK-DBICONTROL.
187300     DISPLAY "RECON FOR TEST"  
187400
187500     IF  UPDATE-STATUS
187600           DISPLAY "RECON CONTROL " RECON-PROGRAM.
187700
188000*VMB
188100     PERFORM 7900-OPNC-DBICSET1-01        
188200        THRU 7900-OPNC-DBICSET1-01-EXIT.
188300*VME
188400
188500*VMB
192600     PERFORM 7999-CLZC-DBICSET1-01        
192700        THRU 7999-CLZC-DBICSET1-01-EXIT.
192800*VME
192900
193000*VMB
193700 B200-CHECK-DBICONTROL-EXIT.
193800     EXIT.
