        01 INVENTORY-PCB-MASK.
           05 IPCB-DBD-NAME          PIC X(8).
           05 IPCB-SEGMENT-LEVEL     PIC XX.
           05 IPCB-STATUS-CODE       PIC XX.
           05 IPCB-PROC-OPTIONS      PIC X(4).
           05 FILLER                 PIC S9(5) COMP.
           05 IPCB-SEGMENT-NAME      PIC X(8).
           05 IPCB-KEY-LENGTH        PIC S9(5) COMP.
           05 IPCB-NUMB-SENS-SEGS    PIC S9(5) COMP.
           05 IPCB-KEY               PIC X(11).
