        01 INVENTORY-VENDOR-SEGMENT.
           05 IVS-VENDOR-CODE        PIC X(3).
           05 IVS-VENDOR-NAME        PIC X(30).
           05 IVS-VENDOR-ADDRESS     PIC X(30).
           05 IVS-VENDOR-CITY        PIC X(17).
           05 IVS-VENDOR-STATE       PIC XX.
           05 IVS-VENDOR-ZIP-CODE    PIC X(9).
           05 IVS-VENDOR-TELEPHONE   PIC X(10).
           05 IVS-VENDOR-CONTACT     PIC X(30).

        01 INVENTORY-ITEM-SEGMENT.
           05 IIS-NUMBER             PIC X(5).
           05 IIS-DESCRIPTION        PIC X(35).
           05 IIS-UNIT-PRICE         PIC S9(5)V99 COMP-3.
           05 IIS-AVG-UNIT-COST      PIC S9(5)V99 COMP-3.

        01 INVENTORY-STOCK-LOC-SEGMENT.
           05 ISLS-LOCATION          PIC X(3).
           05 ISLS-QUANTITY-ON-HAND  PIC S9(7) COMP-3.
           05 ISLS-REORDER-POINT     PIC S9(7) COMP-3.
           05 ISLS-QUANTITY-ON-ORDER PIC S9(7) COMP-3.
           05 ISLS-LAST-REORDER-DATE PIC X(6).
