       IDENTIFICATION DIVISION.
       PROGRAM-ID. WDIS221E.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 PROC-NAME PIC X(10).
           01 FIELD     PIC X(10).
       PROCEDURE DIVISION.
       BEGIN.
       
           MOVE 'HELLO' TO FIELD
           MOVE FIELD TO PROC-NAME

           EXEC SQL
           CALL :PROC-NAME (:ALPHA-SHORT, 'HELLO OO' -1, 5, 'HELLO OO')
           END-EXEC

           GOBACK.
       END PROGRAM WDIS221E.
