DEFINE DATA LOCAL
1 MY-FIELD (A4)
1 REDEFINE MY-FIELD
	2 MY-FIELD1 (A2)
	2 MY-FIELD2 (A2)
1 REDEFINE MY-FIELD
	2 MY-FIELD1-ARRAY (A1/1:2)
	2 MY-FIELD2-ARRAY (A1/1:2)
END-DEFINE
WRITE MY-FIELD
WRITE MY-FIELD1
WRITE MY-FIELD1-ARRAY(1)
WRITE MY-FIELD1-ARRAY(2)
WRITE MY-FIELD2
WRITE MY-FIELD2-ARRAY(1)
WRITE MY-FIELD2-ARRAY(2)
END