DEFINE DATA 
GLOBAL USING GDA1
LOCAL USING LDA1
LOCAL USING PDA1
LOCAL
	1 #PROG1 (A8) INIT <'MAIN3'>
	1 #PROG2 (A8) CONST <'MAIN4'>
	1 #VAR1 (A1)
	1 #VAR2 (A1)
	1 #VAR3 (A12)
	1 #VAR4 (A4)
	1 #VIEW VIEW EMPLOYEES
		2 NAME
END-DEFINE

FETCH RETURN 'MAIN4' #VAR4
FETCH #PROG1
FETCH #PROG2
FETCH LDA1PROG1
FETCH LDA1PROG2

CALLNAT 'SUB1' #VAR1

CALLNAT 'MAINB' 

PERFORM SUBR1 #VAR2

/* function dependencies do not work! */
WRITE 'Function call' F#ADD(< 2,3 >)

WRITE #VIEW

INPUT #PROG1 (HE='HELPR1')

INPUT USING MAP 'MAP1' #VAR3

INCLUDE CC1

CALL 'PROG1'

IF #PROG1 EQ ' '
	WRITE 'this is complex!'
END-IF 

END 