//JOBCARD JOB DSNC810,CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
// USER=&SYSUID,NOTIFY=&SYSUID
//*
//UNLOAD   EXEC PGM=INZUTILB,PARM='DB81,DB2UNLOAD',
//             REGION=0M,TIME=1440
//STEPLIB  DD DSN=DB2UNL.SINZLINK,DISP=SHR
//         DD DSN=DSNA10.SDSNLOAD,DISP=SHR
//         DD DSN=DSNA10.SDSNLOD2,DISP=SHR
//UNLOADF1 DD DSN=USER1.UNLOAD01,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(100,50),RLSE)
//UTPRINT  DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSPUNCH DD SYSOUT=*
//SYSIN    DD DISP=SHR,DSN=PROD.BSC.CARDLIB(WMIN13202CRD)