//MGOJOB1  JOB 12345, 
//         MSGCLASS=X,
//         CLASS=H
//*********************************************************************
//* JOBNAME:     MGOJOB1
//*              EXEC COBOL WITH FILE ACCESS
//*********************************************************************
//STEP01  EXEC PGM=MGOPRGM1        
//SYSOUT   DD  SYSOUT=*          
//SYSUDUMP DD  SYSOUT=W          
//MGOFILE1 DD  DSN=MGO.TEST.FILE.ONE,     
//             DISP=(OLD,DELETE)         
//MGOFILE2 DD  DSN=MGO.TEST.FILE.TWO,     
//             DISP=SHR                  
