DEFINE DATA
LOCAL
1 MYVIEW VIEW OF EMPLOYEES
  2 CITY
  2 INCOME(3)
1 VEHIC-VIEW VIEW OF VEHICLES
  2 PERSONNEL-ID
  2 MAKE
END-DEFINE

F1. FIND (20) MYVIEW WITH CITY = 'FRANKFURT'
  DELETE(F1.)
END-FIND

F2. FIND (20) MYVIEW WITH CITY = 'FRANKFURT'
  UPDATE(F2.)
END-FIND

END
