DEFINE DATA                                        
LOCAL    
1 MYVIEW VIEW OF EMPLOYEES
  2 CITY
END-DEFINE   
 
READ1. READ MYVIEW BY CITY STARTING FROM 'M' ENDING AT 'R'

END-READ

END