       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVEANDDISPLAYSTATEMENT.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMBER1           PIC 9(3) VALUE 123.

       PROCEDURE DIVISION.
           DISPLAY NUMBER1.
           GOBACK.
