       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVEANDDISPLAYSTATEMENT.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMBER1           PIC 9(3) VALUE 123.
       01  NUMBER2           PIC 9(3).

       PROCEDURE DIVISION.
           MOVE NUMBER1 TO NUMBER2.
           GOBACK.
