//*--------------------------------------------------------------------*00000100
//*                  MODIFICATION LOG                                  *00000200
//*                                                                    *00000300
//* DATE      DEVELOPED BY        DESCRIPTION                          *00000400
//* --------  ------------        -----------                          *00000500
//* 02/13/17  TELSON/SWETA        REQ0018396 - INITIAL IMPLEMENTATION  *00000600
//*--------------------------------------------------------------------*00000700
//**********************************************************************00000800
//*** TO UPDATE NZNH.STMT_RQST TABLE FOR AC_CLIENT_ID = 1908            00000900
//********************************************************************* 00001000
//*                                                                     00001100
//STEP044U EXEC PGM=IEXUNCAT                                            00001200
//SYSIN    DD SUBSYS=(CCSS,                                             00001300
//         'AX52ZM.S00.DCS.DFP85002.AUTOPRV5.UPDCRTBY')                 00001400
//*                                                                     00001500
//UPDTUTIL EXEC PGM=IKJEFT01                                            00001600
//STEPLIB  DD DISP=SHR,DSN=AXXXA1.DB2.SDSNEXIT                          00001700
//         DD DISP=SHR,DSN=AXXXA1.DB2.SDSNLOAD                          00001800
//         DD DISP=SHR,DSN=AXXXA1.DB2.RUNLIB.LOAD                       00001810
//SYSTSPRT DD SYSOUT=*                                                  00001900
//SYSPRINT DD DSN=AX52ZM.S00.DCS.DFP85002.AUTOPRV5.UPDCRTBY,            00002000
//            DISP=(NEW,CATLG,CATLG),                                   00002100
//            UNIT=DASD,SPACE=(0,(100,100),RLSE),                       00002200
//            DCB=(RECFM=FBA,BLKSIZE=0,LRECL=133,DSORG=PS),             00002300
//            LABEL=RETPD=30                                            00002400
//SYSTSIN  DD  SUBSYS=(CCSS,                                            00002500
//  'DSN SYSTEM(DBA1)  ',                                               00002600
//  'RUN PROGRAM(DSNTEP2) PLAN(DSNTEP2) ')                              00002700
//*                                                                     00002800
//SYSIN  DD  SUBSYS=(CCSS,                                              00002900
//   'SELECT STMT_RQST_ID FROM NZNH.STMT_RQST  ',                       00003000
//   'WHERE AC_CLIENT_ID = 1908     ',                                  00003100
//     'AND CREATE_BY = 0           ',                                  00003200
//     'AND UPDATE_BY = 0           ',                                  00003300
//     'AND STMT_TYPE_ID = 5        ',                                  00003400
//     'AND STMT_STAT_ID = 1        ',                                  00003500
//     'AND ALL_SSN_YN = ''Y''  ',                                      00003600
//     'AND AS_OF_FROM_DT = ''&PQBDT.''  ',                             00003700
//     'AND TO_DT = ''&PQEDT.''  ',                                     00003800
//  ';              ',                                                  00003900
//   'UPDATE NZNH.STMT_RQST               ',                            00004000
//    'SET CREATE_BY = 2456              ',                             00004100
//       ',UPDATE_BY = 2456              ',                             00004200
//   'WHERE AC_CLIENT_ID = 1908             ',                          00004300
//     'AND CREATE_BY = 0           ',                                  00004400
//     'AND UPDATE_BY = 0           ',                                  00004500
//     'AND STMT_TYPE_ID = 5        ',                                  00004600
//     'AND STMT_STAT_ID = 1        ',                                  00004700
//     'AND ALL_SSN_YN = ''Y''  ',                                      00004800
//     'AND AS_OF_FROM_DT = ''&PQBDT.''  ',                             00004900
//     'AND TO_DT = ''&PQEDT.''  ',                                     00005000
//  ';              ',                                                  00005100
//  'COMMIT;              ')                                            00005200
//*****************************************************************     00005300
