       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN2777A.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
         IF FOO EQ 'BAR' THEN
          DISPLAY 'TRUE'
         END-IF.