       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN2777C.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
         IF FOO EQ 'BAR' THEN
          DISPLAY 'TRUE'
         END-IF.
         IF FOO EQ 'BAR' AND BAR EQ 'FOO'THEN
          DISPLAY 'TRUE'
         END-IF.