      ******************************************************************
      * Program     : AAA.CBL
      * Type        : BATCH COBOL Program
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    FIACC2PG.
       AUTHOR.        AWS.
       ENVIRONMENT DIVISION.
       WORKING-STORAGE SECTION.
