//FREEDBAC JOB (A,X,RN3000),'00  ABC FREE PACKAGE',                             
//         MSGCLASS=W,USER=ZPABSJT                                              
//*+JBS BIND XPDDBA1.ONLINE                                                     
//*AUTOBEEP PAGE=JAXDB2                                                         
//*                                                                             
//***                                                                           
//UNCAT1  EXEC PGM=IEXUNCAT,REGION=64K                                          
//SYSIN     DD SUBSYS=(CCSS,                                                    
//    'AXRN30.P00.FREEPKG.D&:YWC.')                                             
//STEP01R  EXEC PGM=IKJEFT01                                                    
//*****************************************************************             
//* SELECT ALL DB2 PACKAGES WITH VERSIONS FROM                    *             
//* SYSIBM.SYSPACKAGE AND WRITE THEM TO A FILE.                   *             
//*   NOTE: ONLY PACKAGES THAT HAVE "VERSIONS" ARE SELECTED.      *             
//*****************************************************************             
//STEPLIB  DD   DISP=SHR,DSN=AXXXA1.DB2.SDSNLOAD                                
//SYSPRINT DD   DSN=&&PKGOUT,DISP=(,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(10,10),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)                          
//SYSTSPRT DD   SYSOUT=*                                                        
//SYSTSIN  DD   *                                                               
  DSN SYSTEM(DBA1)                                                              
  RUN       PROGRAM(DSNTEP2) PLAN(DSNTEP2)-                                     
      LIB('AXXXA1.DB2.RUNLIB.LOAD')                                             
  END                                                                           
//FILEAID2 EXEC PGM=FILEAID                                                     
//DD01     DD DSN=AXRN30.P00.NH1.EECDS.&CYC,DISP=SHR                            
//DD01O    DD DSN=AXRN30.P00.NH1.SEECDS.&CYC,                                   
//            DISP=(NEW,CATLG),                                                 
//            DCB=(RECFM=FB,LRECL=14,BLKSIZE=27986),                            
//            SPACE=(27986,(5000,1000),RLSE),                                   
//            UNIT=DASD,LABEL=RETPD=&RETPD                                      
//SYSOUT   DD SYSOUT=A                                                          
//SYSPRINT DD SYSOUT=A                                                          
//SYSIN    DD *                                                                 
$$DD01 DROP IF=(01,NE,C'S')                                                     
//*                                                                             
//STEP02N  EXEC SAS,PARM.SAS='SYSPARM=3'                                        
//*****************************************************************             
//* THIS STEP USES INPUT FROM A DSNTEP2 QUERY TO CREATE CNTL      *             
//* CARDS TO FREE PACKAGES WHICH HAVE MORE THAN 2 VERSIONS        *             
//* (THE FIRST SIX VERSIONS ARE RETAINED.)                        *             
//*****************************************************************             
//SAS.SYSIN DD DSN=AX49FT.JDAU.BASE.CTC(FREESAS),DISP=SHR                       
//SQLIN     DD DSN=&&PKGOUT,DISP=(OLD,DELETE)                                   
//KEEPERS   DD SYSOUT=*                                                         
//OUTDEL    DD DSN=AXRN30.P00.FREEPKG.D&:YWC.,DISP=(NEW,CATLG),                 
//          UNIT=SYSDA,SPACE=(TRK,(1,1),RLSE),RETPD=10,                         
//          DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)                         

