//XBCDADB1 JOB (A,X,70RF88),'PBX PROD',PRTY=13,GROUP=AX70RFDA,          JOB15091
//   USER=ZIIGADI,MSGCLASS=W                                                    
//*+JBS BIND XPDDBA1.ONLINE                                                     
//*AUTOBEEP PAGE=PMADB                                                          
//*******************************************************************           
//*******************************************************************           
//*  THIS JOB IS SCHEDULED TO START A 12:00 MIDNIGHT.               *           
//*  FOR RESTART PROCEDURES, CHECK COMMENTS BELOW THE CHCK079,      *           
//*  AND AUDIT079 STEPS.                                            *           
//*******************************************************************           
//*  THE CHCKADSI STEP WILL PREVENT THE JOB FROM STARTING BEFORE    *           
//*  THE ADSI HAS SUCCESSFULLY COMPLETED                            *           
//*  IF THE JOB GOES DOWN ON THIS STEP ..                           *           
//*  1. CHECK TO SEE THAT THE ADSI JOB $OVDAY3D HAS COMPLETED.      *           
//*     IF NOT, RESTART WHEN IT IS DONE.                            *           
//*  2. IF THE ADSI JOBS ARE BEING BYPASSED FOR ANY REASON. THEN    *           
//*     CHECK WITH ADSI SUPPORT TO SEE THAT THE AUDITS WERE         *           
//*     CAPTURED. IF OK, THEN THE JOB CAN BE RESTARTED.             *           
//*******************************************************************           
//CHCKADSI EXEC PGM=XX091                                                       
//SYSIN    DD *                                                                 
AX70RF.S00.XUTP502.AGENT.D&:YWC.                                                
//*******************************************************************           
//CHCK079  EXEC PGM=XX079,COND=(0,EQ,CHCKADSI)                                  
//*******************************************************************           
//*   THE ENDING QUALIFIER 'D&:YWC' OF THE COPY DATASETS            *           
//*   SHOULD BE CHANGED TO THE PROPER DATE                          *           
//*-----------------------------------------------------------------*           
//*   THE FOLLOWING STEP ESTABLISHES A QUIESCE POINT                *           
//*   FOR ALL THE DAPOS AND PXB TABLESPACES                         *           
//*******************************************************************           
//QUIESCE  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTQDPSTS',                            
//         UTPROC=''                                                            
//STEPLIB  DD  DSN=AXXXA1.DB2.SDSNLOAD,DISP=SHR                                 
//DSNUPROC.SYSIN  DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTQDPSTS),                   
//         DISP=SHR                                                             
//QUES079  EXEC PGM=XX079,COND=(0,EQ,QUIESCE.DSNUPROC)                          
//*******************************************************************           
//*        IMAGE COPY OF THE DAPOS AND PXB TABLESPACES              *           
//*                  UNIT TAPE                                      *           
//*******************************************************************           
//UTSAGENT EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCAGENT',UTPROC='',                  
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSAGENT.D&:YWC.,                   
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCAGENT),                          
//            DISP=SHR                                                          
//AGENT079 EXEC PGM=XX079,COND=(0,EQ,UTSAGENT.DSNUPROC)                         
//*******************************************************************           
//UTSORG   EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCORG',UTPROC='',                    
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSORG.D&:YWC.,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCORG),                            
//            DISP=SHR                                                          
//ORG079   EXEC PGM=XX079,COND=(0,EQ,UTSORG.DSNUPROC)                           
//*******************************************************************           
//UTSADDRS   EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCADDRS',UTPROC='',                
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSADDRS.D&:YWC.,                   
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCADDRS),                          
//            DISP=SHR                                                          
//ADDRS079 EXEC PGM=XX079,COND=(0,EQ,UTSADDRS.DSNUPROC)                         
//*******************************************************************           
//UTSEQUIP EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCEQUIP',UTPROC='',                  
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSEQUIP.D&:YWC.,                   
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCEQUIP),                          
//            DISP=SHR                                                          
//EQUIP079 EXEC PGM=XX079,COND=(0,EQ,UTSEQUIP.DSNUPROC)                         
//*******************************************************************           
//UTSLOC EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCLOC',UTPROC='',                      
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSLOC.D&:YWC.,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCLOC),                            
//            DISP=SHR                                                          
//LOC079 EXEC PGM=XX079,COND=(0,EQ,UTSLOC.DSNUPROC)                             
//*******************************************************************           
//UTSCONN EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCCONN',UTPROC='',                    
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSCONN.D&:YWC.,                    
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCCONN),                           
//            DISP=SHR                                                          
//CONN079 EXEC PGM=XX079,COND=(0,EQ,UTSCONN.DSNUPROC)                           
//*******************************************************************           
//UTSFOCUS EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCFOCUS',UTPROC='',                  
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSFOCUS.D&:YWC.,                   
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCFOCUS),                          
//            DISP=SHR                                                          
//FOCUS079 EXEC PGM=XX079,COND=(0,EQ,UTSFOCUS.DSNUPROC)                         
//*******************************************************************           
//UTSLINE EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCLINE',UTPROC='',                    
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSLINE.D&:YWC.,                    
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCLINE),                           
//            DISP=SHR                                                          
//LINE079 EXEC PGM=XX079,COND=(0,EQ,UTSLINE.DSNUPROC)                           
//*******************************************************************           
//UTSITEM  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCITEM',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSITEM.D&:YWC.,                    
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCITEM),                           
//            DISP=SHR                                                          
//ITEM079  EXEC PGM=XX079,COND=(0,EQ,UTSITEM.DSNUPROC)                          
//*******************************************************************           
//UTSITEMP EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCITEMP',UTPROC='',                  
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSITEMP.D&:YWC.,                   
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCITEMP),                          
//            DISP=SHR                                                          
//ITEMP079  EXEC PGM=XX079,COND=(0,EQ,UTSITEMP.DSNUPROC)                        
//*******************************************************************           
//UTSORDER EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCORDER',UTPROC='',                  
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSORDER.D&:YWC.,                   
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCORDER),                          
//            DISP=SHR                                                          
//ORDER079 EXEC PGM=XX079,COND=(0,EQ,UTSORDER.DSNUPROC)                         
//*******************************************************************           
//UTSPKGE  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCPKGE',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSPKGE.D&:YWC.,                    
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCPKGE),                           
//            DISP=SHR                                                          
//PKGE079  EXEC PGM=XX079,COND=(0,EQ,UTSPKGE.DSNUPROC)                          
//*******************************************************************           
//UTSPKITM EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCPKITM',UTPROC='',                  
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSPKITM.D&:YWC.,                   
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCPKITM),                          
//            DISP=SHR                                                          
//PKITM079 EXEC PGM=XX079,COND=(0,EQ,UTSPKITM.DSNUPROC)                         
//*******************************************************************           
//UTSUSER EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCUSER',UTPROC='',                    
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSUSER.D&:YWC.,                    
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCUSER),                           
//            DISP=SHR                                                          
//USER079 EXEC PGM=XX079,COND=(0,EQ,UTSUSER.DSNUPROC)                           
//*******************************************************************           
//UTSEQCTL EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCEQCTL',UTPROC='',                  
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSEQCTL.D&:YWC.,                   
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCEQCTL),                          
//            DISP=SHR                                                          
//EQCTL079 EXEC PGM=XX079,COND=(0,EQ,UTSEQCTL.DSNUPROC)                         
//*******************************************************************           
//UTSTAXID EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCTAXID',UTPROC='',                  
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSTAXID.D&:YWC.,                   
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCTAXID),                          
//            DISP=SHR                                                          
//TAXID079 EXEC PGM=XX079,COND=(0,EQ,UTSTAXID.DSNUPROC)                         
//*******************************************************************           
//UTSCGRL  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCCGRL',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSCGRL.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCCGRL),                           
//            DISP=SHR                                                          
//CGRL079  EXEC PGM=XX079,COND=(0,EQ,UTSCGRL.DSNUPROC)                          
//*******************************************************************           
//UTSCHUB  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCCHUB',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSCHUB.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCCHUB),                           
//            DISP=SHR                                                          
//CHUB079  EXEC PGM=XX079,COND=(0,EQ,UTSCHUB.DSNUPROC)                          
//*******************************************************************           
//UTSCTRL  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCCTRL',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSCTRL.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCCTRL),                           
//            DISP=SHR                                                          
//CTRL079  EXEC PGM=XX079,COND=(0,EQ,UTSCTRL.DSNUPROC)                          
//*******************************************************************           
//UTSGHUB  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCGHUB',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSGHUB.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCGHUB),                           
//            DISP=SHR                                                          
//GHUB079  EXEC PGM=XX079,COND=(0,EQ,UTSGHUB.DSNUPROC)                          
//*******************************************************************           
//UTSGPRL  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCGPRL',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSGPRL.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCGPRL),                           
//            DISP=SHR                                                          
//GPRL079  EXEC PGM=XX079,COND=(0,EQ,UTSGPRL.DSNUPROC)                          
//*******************************************************************           
//UTSGRP   EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCGRP',UTPROC='',                    
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSGRP.D&:YWC,                      
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCGRP),                            
//            DISP=SHR                                                          
//GRP079   EXEC PGM=XX079,COND=(0,EQ,UTSGRP.DSNUPROC)                           
//*******************************************************************           
//UTSGRPZ  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCGRPZ',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSGRPZ.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCGRPZ),                           
//            DISP=SHR                                                          
//GRPZ079  EXEC PGM=XX079,COND=(0,EQ,UTSGRPZ.DSNUPROC)                          
//*******************************************************************           
//UTSPRCD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCPRCD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSPRCD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCPRCD),                           
//            DISP=SHR                                                          
//PRCD079  EXEC PGM=XX079,COND=(0,EQ,UTSPRCD.DSNUPROC)                          
//*******************************************************************           
//UTSRFCD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCRFCD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSRFCD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCRFCD),                           
//            DISP=SHR                                                          
//RFCD079  EXEC PGM=XX079,COND=(0,EQ,UTSRFCD.DSNUPROC)                          
//*******************************************************************           
//UTSRTCD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCRTCD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSRTCD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCRTCD),                           
//            DISP=SHR                                                          
//RTCD079  EXEC PGM=XX079,COND=(0,EQ,UTSRTCD.DSNUPROC)                          
//*******************************************************************           
//UTSATCD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCATCD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSATCD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCATCD),                           
//            DISP=SHR                                                          
//ATCD079  EXEC PGM=XX079,COND=(0,EQ,UTSATCD.DSNUPROC)                          
//*******************************************************************           
//UTSBDAD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCBDAD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSBDAD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCBDAD),                           
//            DISP=SHR                                                          
//BDAD079  EXEC PGM=XX079,COND=(0,EQ,UTSBDAD.DSNUPROC)                          
//*******************************************************************           
//UTSBDCD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCBDCD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSBDCD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCBDCD),                           
//            DISP=SHR                                                          
//BDCD079  EXEC PGM=XX079,COND=(0,EQ,UTSBDCD.DSNUPROC)                          
//*******************************************************************           
//UTSBDLL  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCBDLL',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSBDLL.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCBDLL),                           
//            DISP=SHR                                                          
//BDLL079  EXEC PGM=XX079,COND=(0,EQ,UTSBDLL.DSNUPROC)                          
//*******************************************************************           
//UTSBDPR  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCBDPR',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSBDPR.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCBDPR),                           
//            DISP=SHR                                                          
//BDPR079  EXEC PGM=XX079,COND=(0,EQ,UTSBDPR.DSNUPROC)                          
//*******************************************************************           
//UTSBRCN  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCBRCN',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSBRCN.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCBRCN),                           
//            DISP=SHR                                                          
//BRCN079  EXEC PGM=XX079,COND=(0,EQ,UTSBRCN.DSNUPROC)                          
//*******************************************************************           
//UTSBRDR  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCBRDR',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSBRDR.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCBRDR),                           
//            DISP=SHR                                                          
//BRDR079  EXEC PGM=XX079,COND=(0,EQ,UTSBRDR.DSNUPROC)                          
//*******************************************************************           
//UTSCONT  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCCONT',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSCONT.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCCONT),                           
//            DISP=SHR                                                          
//CONT079  EXEC PGM=XX079,COND=(0,EQ,UTSCONT.DSNUPROC)                          
//*******************************************************************           
//UTSCTCD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCCTCD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSCTCD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCCTCD),                           
//            DISP=SHR                                                          
//CTCD079  EXEC PGM=XX079,COND=(0,EQ,UTSCTCD.DSNUPROC)                          
//*******************************************************************           
//UTSCYCD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCCYCD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSCYCD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCCYCD),                           
//            DISP=SHR                                                          
//CYCD079  EXEC PGM=XX079,COND=(0,EQ,UTSCYCD.DSNUPROC)                          
//*******************************************************************           
//UTSGTCD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCGTCD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSGTCD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCGTCD),                           
//            DISP=SHR                                                          
//GTCD079  EXEC PGM=XX079,COND=(0,EQ,UTSGTCD.DSNUPROC)                          
//*******************************************************************           
//UTSPROD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCPROD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSPROD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCPROD),                           
//            DISP=SHR                                                          
//PROD079  EXEC PGM=XX079,COND=(0,EQ,UTSPROD.DSNUPROC)                          
//*******************************************************************           
//UTSRLCD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCRLCD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSRLCD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCRLCD),                           
//            DISP=SHR                                                          
//RLCD079  EXEC PGM=XX079,COND=(0,EQ,UTSRLCD.DSNUPROC)                          
//*******************************************************************           
//UTSSTCD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCSTCD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSSTCD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCSTCD),                           
//            DISP=SHR                                                          
//STCD079  EXEC PGM=XX079,COND=(0,EQ,UTSSTCD.DSNUPROC)                          
//*******************************************************************           
//UTSTZCD  EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCTZCD',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSTZCD.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCTZCD),                           
//            DISP=SHR                                                          
//TZCD079  EXEC PGM=XX079,COND=(0,EQ,UTSTZCD.DSNUPROC)                          
//*******************************************************************           
//UTSMSG01 EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCMSG01',UTPROC='',                  
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSMSG01.D&:YWC,                    
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCMSG01),                          
//            DISP=SHR                                                          
//MSG079   EXEC PGM=XX079,COND=(0,EQ,UTSMSG01.DSNUPROC)                         
//**********************************************************************        
//UTMAP001 EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCAP001',UTPROC='',                  
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTMAP001.D&:YWC,                    
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCAP001),                          
//            DISP=SHR                                                          
//P001079  EXEC PGM=XX079,COND=(0,EQ,UTMAP001.DSNUPROC)                         
//**********************************************************************        
//UTSPLNTB EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCPLAN',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSPLAN.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCPLAN),                           
//            DISP=SHR                                                          
//PLNTB079 EXEC PGM=XX079,COND=(0,EQ,UTSPLNTB.DSNUPROC)                         
//**********************************************************************        
//UTSPLNT2 EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCPLN2',UTPROC='',                   
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSPLN2.D&:YWC,                     
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCPLN2),                           
//            DISP=SHR                                                          
//PLNT2079 EXEC PGM=XX079,COND=(0,EQ,UTSPLNT2.DSNUPROC)                         
//**********************************************************************        
//*        IMAGE COPY THE RESRT TABLESPACE                             *        
//*               UNIT TAPE                                            *        
//**********************************************************************        
//UTSRESRT EXEC DSNUPROC,SYSTEM=DBA1,UID='UTCRESRT',UTPROC='',                  
//   LIB='AXXXA1.DB2.SDSNLOAD'                                                  
//COPY1    DD DSN=AX70RF.DBX.OSBCD.AX70RFDA.UTSRESRT.D&:YWC,                    
//            DISP=(NEW,CATLG,DELETE),UNIT=TAPE,RETPD=21                        
//SYSIN    DD DSN=AX87CM.LBP.CSC.CNTL.CARDS(UTCRESRT),                          
//            DISP=SHR                                                          
//RESRT079 EXEC PGM=XX079,COND=(0,EQ,UTSRESRT.DSNUPROC)                         
//*******************************************************************           
//*        THIS STEP UNLOADS THE AUDIT TABLE FOR BACKUP             *           
//*******************************************************************           
//ULDAUDIT EXEC PGM=IKJEFT01,DYNAMNBR=100                                       
//STEPLIB  DD DSN=AXXXA1.DB2.SDSNLOAD,DISP=SHR                                  
//         DD DSN=AXXXA1.DB2.RUNLIB.LOAD,DISP=SHR                               
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPUNCH DD DUMMY                                                             
//SYSREC00 DD DSN=AX70RF.DSNTIAUL.UNLOAD.UTTAUDIT.D&:YWC.,                      
//            DISP=(,CATLG,DELETE),RETPD=21,                                    
//            UNIT=TAPE                                                         
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DBA1)                                                              
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIAUL) -                                       
       LIB('AXXXA1.DB2.RUNLIB.LOAD')                                            
  END                                                                           
//SYSIN    DD *                                                                 
  AX70RFDA.UTTAUDIT                                                             
//*                                                                             
//AUDIT079 EXEC PGM=XX079,COND=(0,EQ,ULDAUDIT)                                  
//UNAUDIT  EXEC PGM=IEXUNCAT,COND=ONLY                                          
AX70RF.DSNTIAUL.UNLOAD.UTTAUDIT.D&:YWC.                                         
//*                                                                             
//*******************************************************************           
//*        THIS STEP UNLOADS THE IMAGE TABLE FOR BACKUP             *           
//*******************************************************************           
//ULDIMAGE EXEC PGM=IKJEFT01,DYNAMNBR=100                                       
//STEPLIB  DD DSN=AXXXA1.DB2.SDSNLOAD,DISP=SHR                                  
//         DD DSN=AXXXA1.DB2.RUNLIB.LOAD,DISP=SHR                               
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPUNCH DD DUMMY                                                             
//SYSREC00 DD DSN=AX70RF.DSNTIAUL.UNLOAD.UTTIMAGE.D&:YWC.,                      
//            DISP=(,CATLG,DELETE),RETPD=21,                                    
//            UNIT=TAPE                                                         
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DBA1)                                                              
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIAUL) -                                       
       LIB('AXXXA1.DB2.RUNLIB.LOAD')                                            
  END                                                                           
//SYSIN    DD *                                                                 
  AX70RFDA.UTTIMAGE                                                             
//*                                                                             
//IMAGE079 EXEC PGM=XX079,COND=(0,EQ,ULDIMAGE)                                  
//XX079ALL EXEC PGM=XX079,COND=ONLY                                             
//*                                                                             
//*******************************************************************           
