//TESTJOB1 JOB (007,35P),'TESTING',CLASS=I,
//         MSGCLASS=N
//*
/*JOBPARM P=PROC09
//      SET ENV=PROD
//      JCLLIB ORDER=(PROD.BASE.JCLLIB)
//*
//SETENV INCLUDE MEMBER=MRGN&ENV
//*
//TESTPROC EXEC PGM=IDCAMS
//SYSPRINT  DD  SYSOUT=*
//VSAMFILE  DD  DSN=TEST.PROD.SAMPLE,DISP=SHR
//SYSIN     DD  *
  VERIFY FILE(VSAMFILE)
/*
