//*************************************************************************
//***** MMRS-M01  mainframe modernization reference system
//*************************************************************************
//***** PROC      IEBGENER
//*************************************************************************
//MMRS712P PROC SRC=,DEST=,
//         MYSPACE=(CYL,(1,5)),
//         MYDCB=(RECFM=U,BLKSIZE=32760)
//*************************************************************
//*  DELETE DESTINATION
//*************************************************************
//STEPDELE EXEC PGM=IEFBR14
//SYSPRINT DD  SYSOUT=*
//DELFILE  DD  DISP=(MOD,DELETE),DSN=&DEST,
//             SPACE=&MYSPACE,
//             DCB=&MYDCB
//*
//*************************************************************
//*  COPY - S T A R T
//*************************************************************
//STEPCOPY EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD DISP=SHR,DSN=&SRC
//SYSUT2   DD DISP=(,CATLG),DSN=&DEST,
//             SPACE=&MYSPACE,
//             DCB=&MYDCB
//SYSIN    DD DUMMY
//*  COPY - E N D
