DEFINE DATA LOCAL
  1 #A (A1)
  1 #B (A2)
END-DEFINE

DECIDE ON FIRST VALUE OF #A
  VALUE 'BLUB' 
    WRITE 'BLUB entered.'
  VALUE 'BLAB' 
    WRITE 'BLAB  entered.'
    DECIDE
      ON EVERY VALUE OF #FIELD
      VALUE 1 : 4
        WRITE 'Content of #FIELD is 1-4'
      VALUE 2 : 5
        WRITE 'Content of #FIELD is 2-5'
      ANY VALUE
        WRITE 'Content of #FIELD is 1-5'
      ALL VALUE
        WRITE 'Content of #FIELD is 2-4'
      NONE VALUE
        WRITE 'Content of #FIELD is not 1-5'
    END-DECIDE
  ANY VALUE
    WRITE 'BLUB or BLAB entered.' 
  NONE VALUE
    WRITE 'Neither BLUB nor BLAB key entered.'
END-DECIDE

DECIDE
  ON EVERY VALUE OF #FIELD
  VALUE 1 : 4
    WRITE 'Content of #FIELD is 1-4'
  VALUE 2 : 5
    WRITE 'Content of #FIELD is 2-5'
  ANY VALUE
    WRITE 'Content of #FIELD is 1-5'
  ALL VALUE
    WRITE 'Content of #FIELD is 2-4'
    DECIDE ON FIRST VALUE OF #A
      VALUE 'BLUB'
        WRITE 'Nested BLUB entered.'
      VALUE 'BLAB'
        WRITE 'Nested BLAB entered.'
      ANY VALUE      
        WRITE 'Nested BLUB or BLAB entered.' 
      NONE VALUE     
        WRITE 'Nested Neither BLUB nor BLAB key entered.'
    END-DECIDE
  NONE VALUE
    WRITE 'Content of #FIELD is not 1-5'
END-DECIDE

END
