DEFINE DATA
LOCAL
1 #VAR1 (I4)
END-DEFINE

DECIDE
  FOR
    FIRST
      CONDITION
    WHEN #VAR1 = 5 AND #VAR1 EQ 4
		WRITE NOTITLE '1'
    WHEN #VAR1 = 15
    	IGNORE
    WHEN NONE 
		WRITE NOTITLE '1 NONE'
    WHEN ANY 
		WRITE NOTITLE '1 ANY'
END-DECIDE

END
