NOTDEAD1: PROC(PARAM1,PARAM2);
   DCL PARAM1 CHAR(10);
   DCL PARAM2 FIXED BINARY(31);
   
   PUT SKIP LIST('IN EXT PROC');
   PUT SKIP LIST(PARAM1);
   PUT SKIP LIST(PARAM2);
   PARAM1 = 'MODIFIED';
   HE: PROC;
      PUT SKIP LIST(PARAM2);
      NESTED1: PROC;
      PUT SKIP LIST(PARAM2);
      END NESTED1;
   END HE;
 END NOTDEAD1;
 
CREATURE: PROC;
   DCL PARAM1 CHAR(10);
   DCL PARAM2 FIXED BINARY(31);
   
   PUT SKIP LIST('IN EXT PROC');
   PUT SKIP LIST(PARAM1);
   PUT SKIP LIST(PARAM2);
   PARAM1 = 'IT''S ALIVE!';
   CALL DORIANGRAY;
   IS: PROC;
      PUT SKIP LIST(PARAM2);
      NESTED2: PROC;
      PUT SKIP LIST(PARAM2);
      END NESTED2;
   END IS;
   DEAD: PROC;
      PUT SKIP LIST(PARAM2);
      NESTED3: PROC;
      PUT SKIP LIST(PARAM2);
      END NESTED3;
   END DEAD;
   DORIANGRAY: PROC;
      PUT SKIP LIST(PARAM2);
      JIM: PROC;
         PUT SKIP LIST(PARAM2);
         NESTED4: PROC;
            PUT SKIP LIST(PARAM2);
         END NESTED4;
      END JIM;
   END DORIANGRAY;
END CREATURE;