* MAP2: PROTOTYPE              --- CREATED BY NATCLIPSE 99.9.99.TRUNK-NDT-SNAPSHOT ---
* INPUT USING MAP 'XXXXXXXX'
* HELP1
DEFINE DATA PARAMETER
1 HELP1 (A008)
END-DEFINE
FORMAT PS=024 LS=080 ZP=OFF SG=OFF KD=OFF IP=OFF
* MAP2: MAP PROFILES *****************************        200***********
* .TTAAAMMOO   D I D I N D I D I        ?_)^&:+(   HELP1               *
* 024079        N0NNUCN             X        01 SYSDBA  NR             *
************************************************************************
INPUT          (     IP=OFF      HE=HELP1                             /*
                                                                       )
/
/
/
 014T 'TextConst__'
* MAP2: VALIDATION *****************************************************
* MAP2: END OF MAP *****************************************************
END
