DEFINE FUNCTION M0001F1
  RETURNS (L)

DEFINE DATA
PARAMETER
1 #PARAM (A8) BY VALUE
LOCAL
1 #RETVAL (L)
END-DEFINE

#RETVAL := M0001F2(<#PARAM>)
M0001F1 := #RETVAL

END-FUNCTION

END
