 CALLEE: PACKAGE exports(PROC_P9999, PROC_SHORT, PROC_INT, PROC_LONG,PROC_OTHER);
 
    PROC_P9999: PROC(PARAM1, PARAM2);
       DCL PARAM1 CHAR(1);
       DCL PARAM2 PIC'9999';
       
       PUT SKIP LIST('PROC_P9999');
       PUT SKIP LIST(PARAM1);
       PUT SKIP LIST(PARAM2);
       
       RETURN ;
    END PROC_P9999;
    
    PROC_SHORT: PROC(PARAM1, PARAM2);
       DCL PARAM1 CHAR(1);
       DCL PARAM2 BIN FIXED(15);
       
       PUT SKIP LIST('PROC_SHORT');
       PUT SKIP LIST(PARAM1);
       PUT SKIP LIST(PARAM2);
       
       RETURN ;
    END PROC_SHORT;
    
    PROC_INT: PROC(PARAM1, PARAM2);
       DCL PARAM1 CHAR(1);
       DCL PARAM2 BIN FIXED(31);
       
       PUT SKIP LIST('PROC_INT');
       PUT SKIP LIST(PARAM1);
       PUT SKIP LIST(PARAM2);
       
       RETURN ;
    END PROC_INT;
    
    PROC_LONG: PROC(PARAM1, PARAM2);
       DCL PARAM1 CHAR(1);
       DCL PARAM2 BIN FIXED(63);
       
       PUT SKIP LIST('PROC_LONG');
       PUT SKIP LIST(PARAM1);
       PUT SKIP LIST(PARAM2);
       
       RETURN ;
    END PROC_LONG;
    
    PROC_OTHER: PROC(PARAM1, PARAM2);
       DCL PARAM1 CHAR(1);
       DCL PARAM2 BIN FIXED(63);
       
       PUT SKIP LIST('PROC_OTHER');
       PUT SKIP LIST(PARAM1);
       PUT SKIP LIST(PARAM2);
       
       RETURN ;
    END PROC_OTHER;
    
    PROC_DEC6: PROC(PARAM1, PARAM2);
       DCL PARAM1 CHAR(1);
       DCL PARAM2 FIXED DECIMAL(6);
       
       PUT SKIP LIST('PROC_DEC6');
       PUT SKIP LIST(PARAM1);
       PUT SKIP LIST(PARAM2);
       
       RETURN ;
    END PROC_DEC6;
    
    PROC_DEC: PROC(PARAM1, PARAM2);
       DCL PARAM1 CHAR(1);
       DCL PARAM2 FIXED DECIMAL(10);
       
       PUT SKIP LIST('PROC_DEC');
       PUT SKIP LIST(PARAM1);
       PUT SKIP LIST(PARAM2);
       
       RETURN ;
    END PROC_DEC;
    
 END CALLEE;