 M11670C: PACKAGE EXPORTS(EXTPRC1);

 EXTPRC1: PROC(PARAM1) RETURNS (CHARACTER(10));
   DCL PARAM1 FIXED BINARY(31);
   
   RETURN ('1011001011011'B);
 END EXTPRC1;

 END M11670C;