//UTP229 JOB (A,D,ADIE00,R),'ADB CYC &:CURCWW DACOMP',                          
//  MSGCLASS=W,NOTIFY=J281168,                                                  
//             USER=ZIIGADI                                                     
/*JOBPARM ROOM=ISYS                                                             
//*AUTOBEEP PAGE=PMADB                                                          
//JCLDSN JCLLIB ORDER=(AD87CM.LBP.IIFS.PROC.JES.JCLLIB,                         
//         AD87CM.LBP.CTSP.PROC.JES.JCLLIB)                                     
//JCLCNTL INCLUDE MEMBER=ADSISET                                                
//*---------------------------------------------------------------------        
//IDCM0001 EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD SUBSYS=(CCSS,                                                     
// ' LISTCAT ENTRY (ADADIE.CDX.UTP298.DISKOA.D&:P015DCYC) ',                    
// ' LISTCAT ENTRY (ADADIE.CDX.UTP298.DISKOA.D&:P025DCYC) ',                    
// ' LISTCAT ENTRY (ADADIE.CDX.UTP298.DISKOA.D&:P035DCYC) ',                    
// ' LISTCAT ENTRY (ADADIE.CDX.UTP298.DISKOA.D&:P045DCYC) ',                    
// ' LISTCAT ENTRY (ADADIE.CDX.UTP298.DISKOA.D&:P055DCYC) ')                    
//*---------------------------------------------------------------------        
// IF (IDCM0001.RC EQ 0) THEN                                                   
//*---------------------------------------------------------------------        
//UTP229  EXEC  UTP229,PARM229='DHR&:CURDG2',                                   
//        ADBSMF='ADIE.CAH',CRWKCYC=&:CRYWK                                     
//UTP229.TAPEIA DD DISP=SHR,DSN=ADADIE.CDX.UTP298.DISKOA.D&:M5YWC5              
//        DD DISP=SHR,DSN=ADADIE.CDX.UTP298.DISKOA.D&:M4YWC5                    
//        DD DISP=SHR,DSN=ADADIE.CDX.UTP298.DISKOA.D&:M3YWC5                    
//        DD DISP=SHR,DSN=ADADIE.CDX.UTP298.DISKOA.D&:M2YWC5                    
//        DD DISP=SHR,DSN=ADADIE.CDX.UTP298.DISKOA.D&:M1YWC5                    
//*---------------------------------------------------------------------        
// ELSE                                                                         
//*---------------------------------------------------------------------        
//UTP229  EXEC  UTP229,PARM229='DHR&:CURDG2',                                   
//        ADBSMF='ADIE.CAH',CRWKCYC=&:CRYWK                                     
//UTP229.TAPEIA DD DISP=SHR,DSN=ADADIE.CDX.UTP298.DISKOA.D&:M4YWC5              
//        DD DISP=SHR,DSN=ADADIE.CDX.UTP298.DISKOA.D&:M3YWC5                    
//        DD DISP=SHR,DSN=ADADIE.CDX.UTP298.DISKOA.D&:M2YWC5                    
//        DD DISP=SHR,DSN=ADADIE.CDX.UTP298.DISKOA.D&:M1YWC5                    
//SMTP0001 EXEC SMTPHOL,JNAME=UTP229                                            
//*---------------------------------------------------------------------        
// ENDIF                                                                        
//*---------------------------------------------------------------------        
