000010 ID  DIVISION.
000020 PROGRAM-ID.             COPYREP.
       COPY PAYLIB. REPLACING A BY PAYROLL
                              B BY PAY-CODE
                              C BY GROSS-PAY
                              D BY HOURS.
