         DBD     NAME=DB13057A,ACCESS=(HIDAM,OSAM)
         DATASET DD1=DB13057A,SIZE=4096
         SEGM    NAME=STATE,PARENT=0,POINTER=T,BYTES=20
         FIELD   NAME=(STATENM,SEQ,U),BYTES=10,START=1,TYPE=C
         FIELD   NAME=POP,BYTES=5,START=11,TYPE=P
         FIELD   NAME=CAPITOL,BYTES=5,START=16,TYPE=C
         LCHILD  NAME=(STAT,INDB1I),POINTER=INDX
         SEGM    NAME=CITY,PARENT=STATE,BYTES=30
         FIELD   NAME=(CITYNM,SEQ,U),BYTES=20,START=1,TYPE=C
         FIELD   NAME=POP,BYTES=5,START=21,TYPE=P
         FIELD   NAME=ZIPCODE,BYTES=5,START=26,TYPE=C
         SEGM    NAME=SCHOOL,PARENT=CITY,BYTES=25
         FIELD   NAME=(SCHOOLNM,SEQ,M),BYTES=20,START=1,TYPE=C
         FIELD   NAME=ADDRESS,BYTES=5,START=21,TYPE=C
         SEGM    NAME=STUDENT,PARENT=SCHOOL,BYTES=30
         FIELD   NAME=(LASTNM,SEQ,M),BYTES=10,START=1,TYPE=C
         FIELD   NAME=FIRSTNM,BYTES=20,START=11,TYPE=C
         SEGM    NAME=PET,PARENT=STUDENT,BYTES=20
         FIELD   NAME=(PETNM,SEQ,M),BYTES=10,START=1,TYPE=C
         FIELD   NAME=SPECIES,BYTES=10,START=11,TYPE=C
         SEGM    NAME=TRICK,PARENT=PET,BYTES=30
         FIELD   NAME=(TRICKNM,SEQ,M),BYTES=10,START=1,TYPE=C
         FIELD   NAME=TRICKDSC,BYTES=20,START=11,TYPE=C
         SEGM    NAME=CLASSRM,PARENT=SCHOOL,BYTES=15
         FIELD   NAME=(ROOMNUM,SEQ,U),BYTES=5,START=1,TYPE=P
         FIELD   NAME=BLDINGNM,BYTES=10,START=6,TYPE=C
         SEGM    NAME=POSTER,PARENT=CLASSRM,BYTES=15
         FIELD   NAME=(MOTTEXT,SEQ,M),BYTES=5,START=1,TYPE=C
         FIELD   NAME=ANIMAL,BYTES=10,START=6,TYPE=C
         SEGM    NAME=ARTIST,PARENT=POSTER,BYTES=5
         FIELD   NAME=(ARTISTNM,SEQ,U),BYTES=5,START=1,TYPE=C
         SEGM    NAME=PARK,PARENT=CITY,BYTES=25
         FIELD   NAME=(PARKNM,SEQ,U),BYTES=20,START=1,TYPE=C
         FIELD   NAME=ADDRESS,BYTES=5,START=21,TYPE=C
         DBDGEN
         FINISH
         END