 Sprod: procedure (U,V,W)
  returns (bin float(21));
  dcl (U,V,W) bin float(53);
  if U > V + W then
   return (0);
  else
   return (U*V*W);
 end Sprod;
 
