 CALLER: PROCEDURE OPTIONS(MAIN);
 
       DCL PROC_P9999 ENTRY (CHAR, PIC'9999');
       DCL PROC_SHORT ENTRY (CHAR, BIN FIXED(15));
       DCL PROC_INT   ENTRY (CHAR, BIN FIXED(31));
       DCL PROC_LONG  ENTRY (CHAR, BIN FIXED(63));
       DCL PROC_OTHER ENTRY (CHAR, *));
       
    DCL MY_GENERIC_1 GENERIC (
       PROC_P9999 WHEN (CHAR, PIC'9999'),
       PROC_SHORT WHEN (CHAR, BIN FIXED(15)),
       PROC_INT   WHEN (CHAR, BIN FIXED(31)),
       PROC_LONG  WHEN (CHAR, BIN FIXED(63)),
       PROC_DEC6 WHEN (CHAR, FIXED DECIMAL(6)),
       PROC_DEC WHEN (CHAR, FIXED DECIMAL));
 
    DCL MY_GENERIC GENERIC (
       PROC_P9999 WHEN (CHAR, PIC'9999'),
       PROC_SHORT WHEN (CHAR, BIN FIXED(15)),
       PROC_INT   WHEN (CHAR, BIN FIXED(31)),
       PROC_LONG  WHEN (CHAR, BIN FIXED(63)),
       PROC_OTHER WHEN (CHAR, *));
       
    DCL MY_GENERIC_2 GENERIC (
       PROC_P9999 WHEN (CHAR, PIC'9999'),
       PROC_SHORT WHEN (CHAR, BIN FIXED(15)),
       PROC_INT   WHEN (CHAR, BIN FIXED(31)),
       PROC_LONG  WHEN (CHAR, BIN FIXED(63)),
       PROC_DEC6 WHEN (CHAR, FIXED DECIMAL(6)),
       PROC_DEC WHEN (CHAR, FIXED DECIMAL));
       
    CALL MY_GENERIC('A', -999999);
    CALL MY_GENERIC('B', 999999);
    CALL MY_GENERIC('C', 9999);
    CALL MY_GENERIC('', 1);
    
    CALL MY_GENERIC_1('A', -999999);
    CALL MY_GENERIC_1('B', 999999);
    CALL MY_GENERIC_1('C', 9999);
    CALL MY_GENERIC_1('', 1);
    
    PROC_DEC6: PROC(PARAM1, PARAM2);
       DCL PARAM1 CHAR(1);
       DCL PARAM2 FIXED DECIMAL(6);
       
       PUT SKIP LIST('PROC_DEC6');
       PUT SKIP LIST(PARAM1);
       PUT SKIP LIST(PARAM2);
       
       RETURN ;
    END PROC_DEC6;
    
    PROC_DEC: PROC(PARAM1, PARAM2);
       DCL PARAM1 CHAR(1);
       DCL PARAM2 FIXED DECIMAL(10);
       
       PUT SKIP LIST('PROC_DEC');
       PUT SKIP LIST(PARAM1);
       PUT SKIP LIST(PARAM2);
       
       RETURN ;
    END PROC_DEC;
    
 END CALLER;