 M11670B: PROCEDURE OPTIONS(MAIN);
 
       DCL PROC_OTHER ENTRY (CHAR, *));
    DCL EXTPRC1 ENTRY(FIXED BINARY(31)) RETURNS(CHARACTER(10)) EXTERNAL;
    DCL MY_ENTRY_1 ENTRY(FIXED BINARY(31)) RETURNS(CHARACTER(10)) VARIABLE;
    DCL MY_ENTRY_2 ENTRY(FIXED BINARY(31)) RETURNS(BIT(1)) VARIABLE;
    
    DCL X FIXED BINARY(31) INIT(10);
    
    
    DCL MY_GENERIC GENERIC (
       EXTPRC1 WHEN (BIN FIXED(31)),
       PROC_OTHER OTHERWISE);
    
    MY_ENTRY_1 = EXTPRC1;
    MY_ENTRY_2 = EXTPRC1;
    PUT SKIP LIST(MY_ENTRY_1(X));
    PUT SKIP LIST(MY_ENTRY_2(X));
    
 END M11670B;
