EVALUATE WS-IDX
    WHEN 1
        MOVE WS-MENU-OPT-TXT TO OPTN001O
	WHEN 2
		MOVE WS-MENU-OPT-TXT TO OPTN002O
	WHEN 3
       	MOVE WS-MENU-OPT-TXT TO OPTN003O
	WHEN 4
        MOVE WS-MENU-OPT-TXT TO OPTN004O
	WHEN OTHER
        CONTINUE
END-EVALUATE
