//UNI7006  PROC  ZERO='(0)',PLUSONE='(+1)'
//*********************************************************************
//UNI7006D EXEC PGM=ABCD,COND=(0,LT)
//SYSOUT   DD  SYSOUT=*
//SYSABEND DD  SYSOUT=*
//DATEFILE DD  DSN=UNV.DPD.DATEFILE(0),DISP=SHR
//POLMBK   DD  DSN=LIG.UNI.POLMBKUP&ZERO,DISP=SHR
//POLMBKO  DD  DSN=LIG.UNI.POLMBKUP&PLUSONE,DISP=(,CATLG,DELETE),
//             UNIT=TAPE,DCB=GDG,VOL=(,RETAIN)
//*