//T446KADL JOB (00200091,N591265),'RTS DICKSO BDG6 501H',
//  MSGLEVEL=(1,1),TIME=99,CLASS=H,MSGCLASS=R
//*JOBPARM L=100,T=90
//*
//STEP02 		EXEC PGM=MYCOBB,COND=(0,EQ,STP01)
//STEPLIB   	DD   DSN=D59.ADASYS.UTILITY.LOAD,DISP=SHR
