DEFINE DATA
LOCAL
1 MYVIEW VIEW OF EMPLOYEES
  2 CURRENCY-SALARY(5)
END-DEFINE

HISTOGRAM MYVIEW IN ASCENDING SEQUENCE CURRENCY-SALARY 
  
END-HISTOGRAM

END