000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.    CBMCALC.                                          00020000
000300****************************************************************  00030000
000400*                                                              *  00040000
000500* TEST PROGRAM                                                 *  00050000
000600* ====================                                         *  00060000
005500 ENVIRONMENT DIVISION.                                            00550000
005600 CONFIGURATION                SECTION.                            00560000
005700 SPECIAL-NAMES.                                                   00570000
005800     DECIMAL-POINT IS COMMA.                                      00580000
005900 DATA DIVISION.                                                   00590000
006000 WORKING-STORAGE              SECTION.                            00600000
021600 PROCEDURE DIVISION.
006100*                                                                 00610000                                                     06480000
065400*                                                                 06490000
065500****************************************************************  06500000
065600* CALL STUFFF                                                  *  06510000
065700* ============                                                 *  06520000
065800* CALL THING                                                   *  06530000
065900*                                                              *  06540000
066000****************************************************************  06550000
066200 C1-CPGM01-000.                                                   06570000
066500     CALL 'CPGM01'                       USING PARAM-CPGM01.      06600000
066600 C1-CPGM01-999.                                                   06610000
066800*                                                                 06630000
066900*                                                                 06640000
067000****************************************************************  06650000
067100* CALL STUFFF                                                  *  06660000
067200* ============                                                 *  06670000
067300* CALL THING                                                   *  06680000
067400*                                                              *  06690000
067500****************************************************************  06700000
067700 C2-CPGM02-000.                                                   06720000
068000     CALL 'CPGM02'                    USING PARAM-CPGM02.         06750000
068100 C2-CPGM02-999.                                                   06760000
068300*                                                                 06780000
068400****************************************************************  06790000
068500* CALL STUFFF                                                  *  06800000
068600* ============                                                 *  06810000
068700* CALL THING                                                   *  06820000
068800*                                                              *  06830000
068900****************************************************************  06840000
069100 C2-MYSTPGM-000.                                                  06860000
069200     CALL 'MYSTPGM'                   USING PARAM-MYSTPGM.        06870000
069300 C2-MYSTPGM-999.                                                  06880000
069500*                                                                 06900000
