       IDENTIFICATION DIVISION.
       PROGRAM-ID.  CBL001.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  DYN-CALL                    PIC X(8) VALUE 'CBL002 '.
       PROCEDURE DIVISION.
           GET-TRANSACTION.
           CALL DYN-CALL.
           GOBACK.