//JCL1   JOB
//STEP1  EXEC PGM=AMUUMAIN
//SYSIN  DD DSN=MYDSN(CNTLCRD),DISP=SHR
//STEP2  EXEC PGM=ADUUMAIN
//SYSIN  DD DSN=MYDSN(CNTLCRD2),DISP=SHR
//STEP3  EXEC PGM=UPDATEUTILITY
//SYSIN  DD DSN=MYDSN(CNTLCRD3),DISP=SHR
//STEP4  EXEC PGM=DELETEUTILITY
//SYSIN  DD DSN=MYDSN(CNTLCRD4),DISP=SHR
