       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPUTEANDDISPLAYSTATEMENT.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUM1              PIC 9(3) VALUE 456.
       01  NUM2              PIC 9(3) VALUE 789.
       01  RESULT            PIC 9(4).

       PROCEDURE DIVISION.
           COMPUTE RESULT = NUM1 + NUM2.

           GOBACK.
