 p: package exports( a );

 /* should not discovery anything as dead */

  dcl ib      based fixed bin;

  a: proc;
    dcl (i,j,k) fixed bin;
    call b( addr(i) );
      BA:  begin;
		statement-1;
		statement-2;
	end BA;
  end;

  b: proc( px );
    dcl px      pointer;
    display( px->ib );
      %select (E);
    %when call c( addr(i) );
    %when call b( addr(i) );
    %otherwise call d( addr(i) );
     %end;
  end;

  c: proc;
    dcl (i,j,k) fixed bin;
    call b( addr(i) );
      BA:  begin;
		statement-1;
		statement-2;
	end BA;
  end;
  
  d: proc;
    dcl (i,j,k) fixed bin;
    call b( addr(i) );
      BA:  begin;
		statement-1;
		statement-2;
	end BA;
  end;
  
 end p;