* MAP2: PROTOTYPE              --- CREATED BY WNT 6.3.8 ---
* INPUT USING MAP 'XXXXXXXX'
*     FIELD#1(*) FIELD#2
DEFINE DATA PARAMETER
1 FIELD#1 (A017/00001:00016)
1 FIELD#2 (A017)
END-DEFINE
FORMAT PS=024 LS=080 ZP=OFF SG=OFF KD=OFF IP=OFF
* MAP2: MAP PROFILES *****************************        200***********
* .TTAAAMMOO   D I D I N D I D I        ?_)^&:+(                       *
* 024079        N0NNUCN             X        01 SYSDBA  NR             *
************************************************************************
INPUT          (     IP=OFF                                           /*
                                                                       )
/
/
/
 006T FIELD#1(1+000)  (AD=OD' ' ) /*.01U017 A017 .
   /**A1000160000100001000010000100001100001001001000001000HV
 025T FIELD#1(2+000)  (AD=OD' ' ) /*.03U017 A017 .
   /**A1000160000100001000010000100001100001001001000001000HV
 045T FIELD#1(3+000)  (AD=OD' ' ) /*.02U017 A017 .
   /**A1000160000100001000010000100001100001001001000001000HV
/
/
/
 006T FIELD#2  (AD=MDLFHW' ' ) /*.99U017 A017 .
/
/
/
/
/
/
/
/
/
/
/
/
/
/
/
/
/
* MAP2: VALIDATION *****************************************************
* MAP2: END OF MAP *****************************************************
END
