                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*        INSPECTION STICKER SYSTEM ACCOUNTING PROGRAM               */
 /*                                                                   */
 /*        !!  THIS PROGRAM WILL PRODUCE OUTPUT TOTALS ONLY  !!       */
 /*        !!  USE TO LIST TOTALS FROM MONTHLY ACCOUNTING FILE  !!    */
 /*        !!  PROGRAM USED IN (STINSMON)  !!                         */
 /*                                                                   */
 /*         =====>  MAIN MODULE:  S7203057                            */
 /*                 LOAD MODULE:  U7203057                            */
 /*                         JCL:  J7203057                            */
 /*                  LEL MEMBER:  NONE                                */
 /*                    PSB NAME:  NONE                                */
 /*                   % INCLUDE:  NONE                                */
 /*                                                                   */
 /*     INPUT FILES: (PRODUCTION)                                     */
 /*         1)  FINANCE:  M.R720305.FINREPT.MONTH   80 CHARACTERS     */
 /*    (OR) 2)  FINANCE:  M.R720305.SFINREPT.MONTH  80 CHARACTERS     */
 /*                                                                   */
 /*                                           JOE ALWINE   JAN 84     */
 /*********************************************************************/
 /*     FEBRUARY 1990                                                 */
 /*         MODIFY PROGRAM TO ACCEPT CHANGES IN THE STICKER SYSTEM    */
 /*         PREFIXES. THESE ARE TEMPORARY CHANGES DUE TO A PRINTING   */
 /*         PROBLEM.  THE SYSTEM MUST ACCEPT THE PREFIX 'B1' AS WELL  */
 /*         AS THE 'AI' STICKER PREFIX.                               */
 /*  302#  S19581                             R. MCDONALD  FEB 90     */
 /*  RENAME (02/28/90)                                                */
 /*********************************************************************/
                                                                        
 /*********************************************************************/
 /*     AUGUST  1994                                                  */
 /*         MODIFY PROGRAM TO ADD THE NEW EMISSION EXEMPTION STICKER  */
 /*         WITH THE PREFIX OF 'EX' AND STICKER TYPE OF 'X'.          */
 /*  302#  49876                                                      */
 /*  RENAME (XX/XX/94)                        K. ZERBE     AUG 94     */
 /*********************************************************************/
                                                                        
 /*********************************************************************/
 /*     JULY 2001                                                     */
 /*         ADDED CODE TO REPLACE THE ANNUAL INSIDE INSPECTION       */ 
 /*         STICKER PREFIX FROM 'AI' TO 'BI' WHEN COUNT IS GREATER   */ 
 /*         THAN 9,999,999.                                          */ 
 /*  302#  XXXXX                                                    */  
 /*  RENAME (        )                        S RAGSDALE   JUL 01     */
 /*********************************************************************/
                                                                        
 PRTFINR:                                                               
    PROCEDURE OPTIONS(MAIN);                                            
                                                                        
    DEFAULT RANGE (*) STATIC;                                           
                                                                        
    DECLARE (DATE,SUBSTR,LENGTH,BINARY,SUM,VERIFY) BUILTIN;             
                                                                        
    DCL  EDPDTMOD        ENTRY   OPTIONS (ASSEMBLER,INTER);             
                                                                        
    DCL  DATERTN         EXTERNAL  ENTRY;                               
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*                  PROGRAM FILES                                    */
 /*                                                                   */
 /*********************************************************************/
                                                                        
    DCL  FINREPT FILE RECORD INPUT,                                     
         FINRPRT FILE RECORD OUTPUT                                     
                 ENVIRONMENT (CTLASA FB RECSIZE(133) BLKSIZE (12901)),  
         OLDIN17 FILE RECORD OUTPUT                                     
                 ENVIRONMENT (CTLASA FB RECSIZE(133) BLKSIZE (12901)),  
         OLDIN18 FILE RECORD OUTPUT                                     
                 ENVIRONMENT (CTLASA FB RECSIZE(133) BLKSIZE (12901)),  
         ADJLIST FILE RECORD OUTPUT                                     
                 ENVIRONMENT (CTLASA FB RECSIZE(133) BLKSIZE (12901)),  
         SYSPRINT FILE STREAM OUTPUT PRINT;                             
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*                  PROGRAM FIELDS                                   */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 DCL LO_STICKER_8                 CHAR (08) INIT (' '),                 
     HI_STICKER_8                 CHAR (08) INIT (' '),                 
     SAVE_STIC_PREFIX             CHAR (02) INIT (' '),                 
     FORMAT_STICKER_AREA          CHAR (13) INIT (' '),                 
     FORMAT_TRANSMITTAL_AREA      CHAR (11) INIT (' ');                 
                                                                        
 DCL VALID_NUMERIC                CHAR (10) INIT ('0123456789');        
                                                                        
 DCL SAVE_ISSUING_LOCATION        CHAR (01) INIT (' '),                 
     SAVE_STICKER_TYPE            CHAR (01) INIT (' '),                 
     SAVE_LO_STICKER              CHAR (10) INIT (' '),                 
     SAVE_HI_STICKER              CHAR (10) INIT (' ');                 
                                                                        
 DCL PIC_AMOUNT_PAID              PIC '999999'  INIT (0),               
     PIC_ADJ_AMOUNT_PAID          PIC '999999'  INIT (0),               
     PIC_ADJUST_DOLLARS           PIC '999999'  INIT (0),               
     PIC_FIN_OLDSEG_AMOUNT        PIC '999999'  INIT (0),               
     PIC_ADJUSTMENT               PIC 'S999999'  INIT (0),              
     PIC_TOTAL_STICKERS           PIC '999999'  INIT (0),               
     PIC_PAID_STICKER             PIC '99999'   INIT (0),               
     PIC_FREE_STICKER             PIC '999'     INIT (0);               
                                                                        
 DCL PIC_DIF_LO_HI                PIC '(8)9'    INIT (0),               
     PIC_LO_STICKER_8             PIC '(8)9'    INIT (0),               
     PIC_HI_STICKER_8             PIC '(8)9'    INIT (0);               
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*                    PROGRAM DATE FIELDS                            */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 DCL 1 SYSTEM_PROCESS_DATE,                                             
       2 JUL_PROCESS_DATE               CHAR (05)  INIT (' '),          
       2 FILLER_1                       CHAR (11)  INIT (' '),          
       2 TODAYS_DATE_YYMMDD,                                            
         3 TODAYS_DATE_YY               CHAR (02)  INIT (' '),          
         3 TODAYS_DATE_MM               CHAR (02)  INIT (' '),          
         3 TODAYS_DATE_DD               CHAR (02)  INIT (' '),          
       2 FILLER_2                       CHAR (42)  INIT (' '),          
       2 DATE_PLUS_7                    CHAR (11)  INIT (' '),          
       2 FILLER_3                       CHAR (05)  INIT (' ');          
                                                                        
 DCL YYMMDD_PROCESS_DATE          CHAR (06)                             
                          DEF  TODAYS_DATE_YYMMDD;                      
                                                                        
 DCL  1 DATE_STRUCTURE,                                                 
        2 DS_MMDDYY                     CHAR (06)  INIT (' '),          
        2 DS_YYMMDD                     CHAR (06)  INIT (' '),          
        2 LONG_DATE_FORMAT              CHAR (20)  INIT (' '),          
        2 SHORT_DATE_FORMAT             CHAR (12)  INIT (' '),          
        2 HYPEN_FORMAT                  CHAR (08)  INIT (' '),          
        2 SLASH_FORMAT                  CHAR (08)  INIT (' '),          
        2 DS_FILLER                     CHAR (20)  INIT (' ');          
                                                                        
 DCL DATE_AREA                          CHAR (80)                       
                  DEF  DATE_STRUCTURE;                                  
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*                      PROGRAM COUNTERS                             */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 DCL RECORD_COUNT            FIXED BIN (31)  INIT (0),                  
     LINE_COUNT              FIXED BIN (31)  INIT (0),                  
     ADJUST_COUNT            FIXED BIN (31)  INIT (0),                  
     OLDIN17_COUNT           FIXED BIN (31)  INIT (0),                  
     OLDIN18_COUNT           FIXED BIN (31)  INIT (0),                  
     OLDIN17_HEADING         FIXED BIN (31)  INIT (1),                  
     OLDIN18_HEADING         FIXED BIN (31)  INIT (1),                  
     ADJLIST_HEADING         FIXED BIN (31)  INIT (1),                  
     OLDIN17_LINE_COUNT      FIXED BIN (31)  INIT (0),                  
     OLDIN18_LINE_COUNT      FIXED BIN (31)  INIT (0),                  
     ADJLIST_LINE_COUNT      FIXED BIN (31)  INIT (0),                  
     OLDIN17_PAGE_COUNT      FIXED BIN (31)  INIT (0),                  
     OLDIN18_PAGE_COUNT      FIXED BIN (31)  INIT (0),                  
     ADJLIST_PAGE_COUNT      FIXED BIN (31)  INIT (0),                  
     PAGE_COUNT              FIXED BIN (15)  INIT (1);                  
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*               PROGRAM SWITCHES AND SUBSCRIPTS                     */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 DCL MORE_RECORDS            BIT (1)  INIT ('0'B),                      
     FIRST_PAGE              BIT (1)  INIT ('1'B),                      
     LOCATION_TOTAL          BIT (1)  INIT ('0'B),                      
     NEW_STICKER_TYPE        BIT (1)  INIT ('0'B),                      
     OLD_STICKER_TYPE        BIT (1)  INIT ('0'B),                      
     ACC_ADJUSTMENT_SWITCH   BIT (1)  INIT ('0'B),                      
     ACC_LIST_SWITCH         BIT (1)  INIT ('0'B),                      
     YES                     BIT (1)  INIT ('1'B),                      
     NO                      BIT (1)  INIT ('0'B),                      
     ON                      BIT (1)  INIT ('1'B),                      
     OFF                     BIT (1)  INIT ('0'B);                      
                                                                        
 DCL I                       FIXED BIN (31)  INIT (0),                  
     LOCATION_SUBSCRIPT      FIXED BIN (31)  INIT (0),                  
     SAVE_LOCATION_SUBSCRIPT FIXED BIN (31)  INIT (0),                  
     TYPE_SUBSCRIPT          FIXED BIN (31)  INIT (0);                  
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*                        PROGRAM HEADING LINES                      */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 DCL 1 BLANK_PRINT_LINE,                                                
       2 BPLCRG                 CHAR (001)  INIT (' '),                 
       2 BPLFIL1                CHAR (132)  INIT (' ');                 
                                                                        
 DCL 1 ONE_SPACE_LINE,                                                  
       2 ONLCRG                 CHAR (001)   INIT (' '),                
       2 ONLFIL1                CHAR (132)   INIT (' ');                
                                                                        
 DCL 1 TWO_SPACE_LINE,                                                  
       2 TWLCRG                 CHAR (001)   INIT ('0'),                
       2 TWLFIL1                CHAR (132)   INIT (' ');                
                                                                        
 DCL 1 THREE_SPACE_LINE,                                                
       2 THLCRG                 CHAR (001)   INIT ('-'),                
       2 THLFIL1                CHAR (132)   INIT (' ');                
                                                                        
 DCL 1 DATE_PAGE_LINE,                                                  
       2 DPLCRG                 CHAR (001)   INIT ('1'),                
       2 REPORT_DATE_AREA       CHAR (020)   INIT (' '),                
       2 DPLFIL1                CHAR (074)   INIT (' '),                
       2 DPLLIT1                CHAR (014)   INIT ('REPORT NUMBER '),   
       2 REPORT_NUMBER_AREA     CHAR (003)   INIT (' '),                
       2 DPLFIL2                CHAR (013)   INIT (' '),                
       2 DPLLIT2                CHAR (005)   INIT ('PAGE '),            
       2 REPORT_PAGE_NUMBER     PIC 'ZZZ'    INIT (0);                  
                                                                        
 DCL 1 FINR_LIST_HEADING1,                                              
       2 FL1CRG                  CHAR (01)  INIT ('0'),                 
       2 FL1FIL1                 CHAR (33)  INIT (' '),                 
       2 FL1LIT1                 CHAR (66)  INIT (' '),                 
       2 FL1FIL2                 CHAR (33)  INIT (' ');                 
                                                                        
 DCL 1 FINR_LIST_HEADING2,                                              
       2 FL2CRG                  CHAR (01)  INIT ('0'),                 
       2 FL2FIL1                 CHAR (11)  INIT (' '),                 
       2 FL2LIT1                 CHAR (11)  INIT ('TRANSMITTAL'),       
       2 FL2FIL2                 CHAR (03)  INIT (' '),                 
       2 FL2LIT2                 CHAR (08)  INIT ('PURCHASE'),          
       2 FL2FIL3                 CHAR (03)  INIT (' '),                 
       2 FL2LIT3                 CHAR (07)  INIT ('STATION'),           
       2 FL2FIL4                 CHAR (08)  INIT (' '),                 
       2 FL2LIT4                 CHAR (03)  INIT ('LOW'),               
       2 FL2FIL5                 CHAR (11)  INIT (' '),                 
       2 FL2LIT5                 CHAR (04)  INIT ('HIGH'),              
       2 FL2FIL6                 CHAR (05)  INIT (' '),                 
       2 FL2LIT6                 CHAR (07)  INIT ('STICKER'),           
       2 FL2FIL7                 CHAR (03)  INIT (' '),                 
       2 FL2LIT7                 CHAR (05)  INIT ('TOTAL'),             
       2 FL2FIL8                 CHAR (03)  INIT (' '),                 
       2 FL2LIT8                 CHAR (05)  INIT ('TOTAL'),             
       2 FL2FIL9                 CHAR (03)  INIT (' '),                 
       2 FL2LIT9                 CHAR (05)  INIT ('TOTAL'),             
       2 FL2FIL10                CHAR (09)  INIT (' '),                 
       2 FL2LIT10                CHAR (06)  INIT ('AMOUNT'),            
       2 FL2FIL11                CHAR (12)  INIT (' ');                 
                                                                        
 DCL 1 FINR_LIST_HEADING3,                                              
       2 FL3CRG                  CHAR (01)  INIT (' '),                 
       2 FL3FIL1                 CHAR (14)  INIT (' '),                 
       2 FL3LIT1                 CHAR (06)  INIT ('NUMBER'),            
       2 FL3FIL2                 CHAR (07)  INIT (' '),                 
       2 FL3LIT2                 CHAR (04)  INIT ('DATE'),              
       2 FL3FIL3                 CHAR (05)  INIT (' '),                 
       2 FL3LIT3                 CHAR (07)  INIT ('NUMBERS'),           
       2 FL3FIL4                 CHAR (06)  INIT (' '),                 
       2 FL3LIT4                 CHAR (07)  INIT ('STICKER'),           
       2 FL3FIL5                 CHAR (08)  INIT (' '),                 
       2 FL3LIT5                 CHAR (07)  INIT ('STICKER'),           
       2 FL3FIL6                 CHAR (04)  INIT (' '),                 
       2 FL3LIT6                 CHAR (05)  INIT ('TYPES'),             
       2 FL3FIL7                 CHAR (03)  INIT (' '),                 
       2 FL3LIT7                 CHAR (06)  INIT ('PAIDED'),            
       2 FL3FIL8                 CHAR (03)  INIT (' '),                 
       2 FL3LIT8                 CHAR (04)  INIT ('FREE'),              
       2 FL3FIL9                 CHAR (03)  INIT (' '),                 
       2 FL3LIT9                 CHAR (08)  INIT ('STICKERS'),          
       2 FL3FIL10                CHAR (07)  INIT (' '),                 
       2 FL3LIT10                CHAR (06)  INIT ('PAIDED'),            
       2 FL3FIL11                CHAR (12)  INIT (' ');                 
                                                                        
 DCL 1 FINR_LIST_HEADING4,                                              
       2 FL4CRG                  CHAR (01)  INIT ('0'),                 
       2 FL4FIL1                 CHAR (53)  INIT (' '),                 
       2 FL4LIT1                 CHAR (19)  INIT (' '),                 
       2 FL4LIT2                 CHAR (02)  INIT ('!!'),                
       2 TITLE_FIELD_REPORT      CHAR (03)  INIT (' '),                 
       2 FL4LIT3                 CHAR (02)  INIT ('!!'),                
       2 FL4FIL2                 CHAR (53)  INIT (' ');                 
                                                                        
 DCL 1 FINR_TOTAL_HEADING1,                                             
       2 FT1CRG                  CHAR (01)  INIT ('0'),                 
       2 FT1FIL1                 CHAR (33)  INIT (' '),                 
       2 FT1LIT1                 CHAR (66)  INIT (' '),                 
       2 FT1FIL2                 CHAR (33)  INIT (' ');                 
                                                                        
 DCL 1 FINR_TOTAL_HEADING3,                                             
       2 FT3CRG                  CHAR (01)  INIT ('0'),                 
       2 FT3FIL1                 CHAR (44)  INIT (' '),                 
       2 FT3LIT1                 CHAR (05)  INIT ('TOTAL'),             
       2 FT3FIL2                 CHAR (07)  INIT (' '),                 
       2 FT3LIT2                 CHAR (05)  INIT ('TOTAL'),             
       2 FT3FIL3                 CHAR (07)  INIT (' '),                 
       2 FT3LIT3                 CHAR (05)  INIT ('TOTAL'),             
       2 FT3FIL4                 CHAR (07)  INIT (' '),                 
       2 FT3LIT4                 CHAR (05)  INIT ('TOTAL'),             
       2 FT3FIL5                 CHAR (08)  INIT (' '),                 
       2 FT3LIT5                 CHAR (06)  INIT ('AMOUNT'),            
       2 FT3FIL6                 CHAR (33)  INIT (' ');                 
                                                                        
 DCL 1 FINR_TOTAL_HEADING4,                                             
       2 FT4CRG                  CHAR (01)  INIT (' '),                 
       2 FT4FIL1                 CHAR (43)  INIT (' '),                 
       2 FT4LIT1                 CHAR (07)  INIT ('RECORDS'),           
       2 FT4FIL2                 CHAR (06)  INIT (' '),                 
       2 FT4LIT2                 CHAR (06)  INIT ('PAIDED'),            
       2 FT4FIL3                 CHAR (06)  INIT (' '),                 
       2 FT4LIT3                 CHAR (04)  INIT ('FREE'),              
       2 FT4FIL4                 CHAR (07)  INIT (' '),                 
       2 FT4LIT4                 CHAR (08)  INIT ('STICKERS'),          
       2 FT4FIL5                 CHAR (06)  INIT (' '),                 
       2 FT4LIT5                 CHAR (06)  INIT ('PAIDED'),            
       2 FT4FIL6                 CHAR (33)  INIT (' ');                 
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*                       PROGRAM OUTPUT LINES                        */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 DCL 1 FINR_LIST_OUTPUT_LINE,                                           
       2 FOLCRG                        CHAR (01)  INIT (' '),           
       2 FOLFIL2A                      CHAR (02)  INIT (' '),           
       2 FOLFIL2B                      CHAR (08)  INIT (' '),           
       2 FOLFIL2C                      CHAR (01)  INIT (' '),           
       2 TRANSMITTAL_REPORT            CHAR (11)  INIT (' '),           
       2 FOLFIL3                       CHAR (04)  INIT (' '),           
       2 PURCHASE_DATE_REPORT          CHAR (08)  INIT (' '),           
       2 FOLFIL4                       CHAR (04)  INIT (' '),           
       2 STATION_NUMBER_REPORT         CHAR (04)  INIT (' '),           
       2 FOLFIL5                       CHAR (04)  INIT (' '),           
       2 LOW_STICKER_REPORT            CHAR (13)  INIT (' '),           
       2 FOLFIL6                       CHAR (02)  INIT ('--'),          
       2 HIGH_STICKER_REPORT           CHAR (13)  INIT (' '),           
       2 FOLFIL7                       CHAR (04)  INIT (' '),           
       2 STICKER_TYPE_REPORT           CHAR (01)  INIT (' '),           
       2 FOLFIL8                       CHAR (05)  INIT (' '),           
       2 PAID_STICKER_REPORT           PIC 'Z,ZZ9' INIT (0),            
       2 FOLFIL9                       CHAR (04)  INIT (' '),           
       2 FREE_STICKER_REPORT           PIC 'ZZ9' INIT (0),              
       2 FOLFIL10                      CHAR (03)  INIT (' '),           
       2 TOTAL_STICKERS_REPORT         PIC 'ZZ,ZZ9' INIT (0),           
       2 FOLFIL11                      CHAR (07)  INIT (' '),           
       2 AMOUNT_PAID_REPORT            PIC 'Z,ZZ9V.99' INIT (0),        
       2 FOLFIL13A                     CHAR (01)  INIT (' '),           
       2 FOLFIL13B                     CHAR (08)  INIT (' '),           
       2 FOLFIL13C                     CHAR (03)  INIT (' ');           
                                                                        
 DCL 1 TOTAL_FINANCE_LINE,                                              
       2 TFLCRG                        CHAR (01) INIT ('-'),            
       2 TFLFIL1                       CHAR (06) INIT (' '),            
       2 TFLLIT1                       CHAR (09) INIT (' '),            
       2 TFLLIT2                       CHAR (02) INIT ('!!'),           
       2 TITLE_FIELD_TLINE             CHAR (03) INIT (' '),            
       2 TFLLIT3                       CHAR (02) INIT ('!!'),           
       2 TFLLIT4                       CHAR (08) INIT ('  TOTALS'),     
       2 TFLFIL2                       CHAR (08) INIT (' '),            
       2 TOTAL_COUNT_TLINE             PIC 'ZZ,ZZ9'  INIT (0),          
       2 TFLFIL3                       CHAR (19) INIT (' '),            
       2 TFLFIL4                       CHAR (13) INIT (' '),            
       2 TOTAL_PAID_TLINE              PIC 'Z,ZZZ,ZZ9' INIT (0),        
       2 TFLFIL5                       CHAR (02) INIT (' '),            
       2 TOTAL_FREE_TLINE              PIC 'ZZ,ZZ9' INIT (0),           
       2 TFLFIL6                       CHAR (02) INIT (' '),            
       2 TOTAL_STICKERS_TLINE          PIC 'Z,ZZZ,ZZ9' INIT (0),        
       2 TFLFIL7                       CHAR (01) INIT (' '),            
       2 AMOUNT_PAID_TLINE             PIC 'SSSS,SSS,SS9V.99' INIT (0), 
       2 TFLFIL8                       CHAR (12) INIT (' ');            
                                                                        
 DCL 1 TOTAL_LOCATION_LINE,                                             
       2 TLLCRG                        CHAR (01) INIT ('-'),            
       2 TLLFIL1                       CHAR (11) INIT (' '),            
       2 TLLLIT1                       CHAR (09) INIT (' '),            
       2 TLLLIT2                       CHAR (02) INIT ('!!'),           
       2 TITLE_FIELD_LLINE             CHAR (03) INIT (' '),            
       2 TLLLIT3                       CHAR (02) INIT ('!!'),           
       2 TLLLIT4                       CHAR (08) INIT ('  TOTALS'),     
       2 TLLFIL2                       CHAR (08) INIT (' '),            
       2 TOTAL_COUNT_LLINE             PIC 'ZZ,ZZ9' INIT (0),           
       2 TLLFIL4                       CHAR (04) INIT (' '),            
       2 TOTAL_PAID_LLINE              PIC 'Z,ZZZ,ZZ9' INIT (0),        
       2 TLLFIL5                       CHAR (04) INIT (' '),            
       2 TOTAL_FREE_LLINE              PIC 'ZZ,ZZ9' INIT (0),           
       2 TLLFIL6                       CHAR (04) INIT (' '),            
       2 TOTAL_STICKERS_LLINE          PIC 'Z,ZZZ,ZZ9' INIT (0),        
       2 TLLFIL7                       CHAR (03) INIT (' '),            
       2 AMOUNT_PAID_LLINE             PIC 'SSSS,SSS,SS9V.99' INIT (0), 
       2 TLLFIL8                       CHAR (29) INIT (' ');            
                                                                        
 DCL 1 TOTAL_REPORT_LINE,                                               
       2 TRLCRG                        CHAR (01) INIT ('-'),            
       2 TRLFIL1                       CHAR (25) INIT (' '),            
       2 TRLLIT1                       CHAR (09) INIT (' '),            
       2 TRLLIT2                       CHAR (02) INIT ('!!'),           
       2 TITLE_FIELD_RLINE             CHAR (03) INIT (' '),            
       2 TRLLIT3                       CHAR (02) INIT ('!!'),           
       2 TRLFIL2                       CHAR (02) INIT (' '),            
       2 TOTAL_COUNT_RLINE             PIC 'ZZ,ZZ9' INIT (0),           
       2 TFLFIL4                       CHAR (04) INIT (' '),            
       2 TOTAL_PAID_RLINE              PIC 'Z,ZZZ,ZZ9' INIT (0),        
       2 TFLFIL5                       CHAR (04) INIT (' '),            
       2 TOTAL_FREE_RLINE              PIC 'ZZ,ZZ9' INIT (0),           
       2 TFLFIL6                       CHAR (04) INIT (' '),            
       2 TOTAL_STICKERS_RLINE          PIC 'Z,ZZZ,ZZ9' INIT (0),        
       2 TFLFIL7                       CHAR (03) INIT (' '),            
       2 AMOUNT_PAID_RLINE             PIC 'SSSS,SSS,SS9V.99' INIT (0), 
       2 TFLFIL8                       CHAR (29) INIT (' ');            
                                                                        
 DCL 1 REPORT_FILE_TOTALS_LINE,                                         
       2 RFTCRG                        CHAR (01) INIT ('-'),            
       2 RFTFIL1                       CHAR (49) INIT (' '),            
       2 RFT_TITLE                     CHAR (27) INIT (' '),            
       2 RFTFIL2                       CHAR (02) INIT (' '),            
       2 RFT_TOTALS_FIELD              PIC 'Z,ZZ9' INIT (0),            
       2 TFLFIL3                       CHAR (49) INIT (' ');            
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*               PROGRAM INPUT AREAS                                 */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 DCL 1 FINANCE_FILE_AREA,      /*  80  CHARACTERS  */                   
       2 FIN_CODE                 CHAR (01)  INIT (' '), /* --001-- */  
       2 FIN_TRANSMITTAL          CHAR (09)  INIT (' '), /* 002-010 */  
       2 FIN_PURCHASE_DATE        CHAR (06)  INIT (' '), /* 011-016 */  
       2 FIN_STATION_NUMBER       CHAR (04)  INIT (' '), /* 017-020 */  
       2 FIN_LOW_STICKER          CHAR (10)  INIT (' '), /* 021-030 */  
       2 FIN_HIGH_STICKER         CHAR (10)  INIT (' '), /* 031-040 */  
       2 FIN_PAID_STICKER         CHAR (05)  INIT (' '), /* 041-045 */  
       2 FIN_FREE_STICKER         CHAR (03)  INIT (' '), /* 046-048 */  
       2 FIN_TOTAL_STICKERS       CHAR (06)  INIT (' '), /* 049-054 */  
       2 FIN_AMOUNT_PAID          CHAR (06)  INIT (' '), /* 055-060 */  
       2 FIN_STICKER_TYPE         CHAR (01)  INIT (' '), /* --061-- */  
       2 FIN_ISSUING_LOCATION     CHAR (01)  INIT (' '), /* --062-- */  
       2 FIN_ADJUSTMENT_CODE      CHAR (01)  INIT (' '), /* --063-- */  
       2 FIN_OLDSEG_AMOUNT        CHAR (06)  INIT (' '), /* 064-069 */  
       2 FIN_FILLER_1             CHAR (11)  INIT (' '); /* 070-080 */  
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*                     PROGRAM ARRAYS                                */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 DCL TOTAL_FREE_STICKER (6,6)            FIXED BIN (31),                
     TOTAL_PAID_STICKER (6,6)            FIXED BIN (31),                
     TOTAL_TOTAL_STICKERS (6,6)          FIXED BIN (31),                
     TOTAL_AMOUNT_PAID (6,6)             FIXED BIN (31),                
     TOTAL_COUNT (6,6)                   FIXED BIN (31);                
                                                                        
 DCL TYPE_FREE_STICKER (6)               FIXED BIN (31),                
     TYPE_PAID_STICKER (6)               FIXED BIN (31),                
     TYPE_TOTAL_STICKERS (6)             FIXED BIN (31),                
     TYPE_AMOUNT_PAID (6)                FIXED BIN (31),                
     TYPE_COUNT (6)                      FIXED BIN (31);                
                                                                        
 DCL LOCATION_FREE_STICKER (6)           FIXED BIN (31),                
     LOCATION_PAID_STICKER (6)           FIXED BIN (31),                
     LOCATION_TOTAL_STICKERS (6)         FIXED BIN (31),                
     LOCATION_AMOUNT_PAID (6)            FIXED BIN (31),                
     LOCATION_COUNT (6)                  FIXED BIN (31);                
                                                                        
 DCL LOCATION_SUBSCRIPT_TABLE (13)       FIXED BIN (31);                
                                                                        
 DCL ISSUING_LOCATION_TITLES (13)        CHAR (01)  INIT                
     ('A','B','C','D','R','1','2',                                      
      '3','4','5','6','7','8');                                         
                                                                        
 DCL REPORT_LOCATION_TITLES (6)          CHAR (03)  INIT                
     (' A ',' B ',' C ',' D ',' R ','1-8');                             
                                                                        
 DCL STICKER_TYPE_TITLES (06)            CHAR (01)  INIT                
     ('A','B','C','D','E','X');                                         
                                                                        
 DCL REPORT_TYPE_TITLES (06)            CHAR (03)  INIT                 
     (' A ',' B ',' C ',' D ',' E ',' X ');                             
                                                                        
 DCL REPORT_TITLES_ARRAY (10)   CHAR (66)  INIT                         
 (' *  I N S P E C T I O N   S T I C K E R   A C C O U N T I N G  *  ', 
  '   * *  A C C O U N T I N G   R E P O R T   L I S T I N G  * *    ', 
  '          * *   I S S U I N G   L O C A T I O N S   * *           ', 
  '              * *   S T I C K E R   T Y P E S   * *               ', 
  '             * *  L O C A T I O N   T O T A L S  * *              ', 
  '   * *   A C C O U N T I N G   R E P O R T   T O T A L S   * *    ', 
  '         * *   F I N A L   R E P O R T   T O T A L S  * *         ', 
  '* * A C C O U N T I N G   R E P O R T   A D J U S T M E N T S * * ', 
  '     * * O L D   S T I C K E R   T Y P E   L I S T I N G * *      ', 
  '* * O L D   I N 1 8   S T I C K E R   T Y P E   L I S T I N G * * ');
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*                    PROGRAM CODE                                   */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 BEGIN:                                                                 
                                                                        
    CALL INITIALIZE_REPORT_FIELDS;                                      
                                                                        
    MORE_RECORDS = YES;                                                 
    ON ENDFILE (FINREPT) MORE_RECORDS = NO;                             
                                                                        
 READ_NEXT_RECORD:                                                      
                                                                        
    READ FILE (FINREPT) INTO (FINANCE_FILE_AREA);                       
                                                                        
    IF MORE_RECORDS = NO                                                
    THEN DO;                                                            
       IF (OLD_STICKER_TYPE)                                            
       THEN DO;                                                         
          PUT SKIP LIST ('ONLY OLD STICKER TYPES ON INPUT FILE ');      
          GOTO ENDJOB;                                                  
       END;                                                             
       ELSE DO;                                                         
          PUT SKIP LIST ('FINANCE FILE IS EMPTY');                      
          GOTO ENDJOB;                                                  
       END;                                                             
    END;                                                                
                                                                        
    SAVE_STIC_PREFIX = SUBSTR (FIN_LOW_STICKER,1,2);                    
                                                                        
    IF SAVE_STIC_PREFIX = 'AI' ³                                        
       SAVE_STIC_PREFIX = 'B1' ³                                        
       SAVE_STIC_PREFIX = 'AO' ³                                        
       SAVE_STIC_PREFIX = 'SI' ³                                        
       SAVE_STIC_PREFIX = 'SO' ³                                        
       SAVE_STIC_PREFIX = 'IM' ³                                        
       SAVE_STIC_PREFIX = 'EX' ³                                        
       SAVE_STIC_PREFIX = 'BI'                                          
    THEN                                                                
       NEW_STICKER_TYPE = ON;                                           
    ELSE                                                                
       NEW_STICKER_TYPE = OFF;                                          
                                                                        
    IF (NEW_STICKER_TYPE)                                               
    THEN;                                                               
    ELSE DO;                                                            
       OLD_STICKER_TYPE = YES;                                          
       IF FIN_ADJUSTMENT_CODE > ' '                                     
       THEN                                                             
          CALL OLD_IN18_STICKER_LIST_ROUTINE;                           
       ELSE                                                             
          CALL OLD_STICKER_LIST_ROUTINE;                                
       GOTO READ_NEXT_RECORD;                                           
    END;                                                                
                                                                        
    SAVE_ISSUING_LOCATION = FIN_ISSUING_LOCATION;                       
    SAVE_STICKER_TYPE = FIN_STICKER_TYPE;                               
    CALL INITIALIZE_SUBSCRIPTS;                                         
    SAVE_LOCATION_SUBSCRIPT = LOCATION_SUBSCRIPT;                       
                                                                        
    DO WHILE (MORE_RECORDS);                                            
                                                                        
       IF SAVE_ISSUING_LOCATION ª= FIN_ISSUING_LOCATION                 
       THEN DO;                                                         
          IF SAVE_ISSUING_LOCATION <= 'R'                               
          THEN DO;                                                      
 /*********  CALL PRINT_STICKER_TYPE_TOTAL;  *********/                 
             CALL PRINT_ISSUING_LOCATION_TOTAL;                         
             SAVE_ISSUING_LOCATION = FIN_ISSUING_LOCATION;              
             SAVE_STICKER_TYPE = FIN_STICKER_TYPE;                      
             CALL INITIALIZE_SUBSCRIPTS;                                
             SAVE_LOCATION_SUBSCRIPT = LOCATION_SUBSCRIPT;              
 /********** CALL PRINT_REPORT_HEADINGS; ***********/                   
             GOTO PRINT_LINE;                                           
          END;                                                          
       END;                                                             
                                                                        
       IF SAVE_STICKER_TYPE ª= FIN_STICKER_TYPE                         
       THEN DO;                                                         
  /****** CALL PRINT_STICKER_TYPE_TOTAL; ******/                        
  /****** CALL PRINT_REPORT_HEADINGS; *******/                          
          SAVE_STICKER_TYPE = FIN_STICKER_TYPE;                         
          CALL INITIALIZE_SUBSCRIPTS;                                   
       END;                                                             
                                                                        
 PRINT_LINE:                                                            
                                                                        
       IF (FIRST_PAGE) ³ LINE_COUNT > 45                                
       THEN DO;                                                         
          FIRST_PAGE = NO;                                              
 /******* CALL PRINT_REPORT_HEADINGS; ********/                         
       END;                                                             
                                                                        
       CALL PRINT_REPORT_LINE;                                          
                                                                        
 READ_FILE:                                                             
                                                                        
       READ FILE (FINREPT) INTO (FINANCE_FILE_AREA);                    
       RECORD_COUNT = RECORD_COUNT + 1;                                 
    END;                                                                
                                                                        
    CALL END_OF_JOB_PROCESSING;                                         
                                                                        
    GOTO ENDJOB;                                                        
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*  PRINT_REPORT_LINE:                                               */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 PRINT_REPORT_LINE:                                                     
    PROCEDURE;                                                          
                                                                        
       IF FIN_ADJUSTMENT_CODE > ' '                                     
       THEN DO;                                                         
          ACC_ADJUSTMENT_SWITCH = ON;                                   
          ACC_LIST_SWITCH = ON;                                         
       END;                                                             
       ELSE DO;                                                         
          ACC_ADJUSTMENT_SWITCH = OFF;                                  
       END;                                                             
                                                                        
       IF (ACC_ADJUSTMENT_SWITCH)                                       
       THEN DO;                                                         
          PIC_FREE_STICKER = 0;                                         
          PIC_PAID_STICKER = 0;                                         
          PIC_TOTAL_STICKERS = 0;                                       
          PIC_AMOUNT_PAID = 0;                                          
          IF FIN_OLDSEG_AMOUNT > '000000'                               
          THEN                                                          
             PIC_FIN_OLDSEG_AMOUNT = FIN_OLDSEG_AMOUNT;                 
          ELSE                                                          
             PIC_FIN_OLDSEG_AMOUNT = 0;                                 
       END;                                                             
       ELSE DO;                                                         
          PIC_FREE_STICKER = FIN_FREE_STICKER;                          
          PIC_PAID_STICKER = FIN_PAID_STICKER;                          
          PIC_TOTAL_STICKERS = FIN_TOTAL_STICKERS;                      
          PIC_AMOUNT_PAID = FIN_AMOUNT_PAID;                            
          PIC_AMOUNT_PAID = PIC_AMOUNT_PAID / 100;                      
       END;                                                             
                                                                        
       IF ACC_ADJUSTMENT_SWITCH = ON                                    
       THEN DO;                                                         
          PIC_ADJUSTMENT = 0;                                           
          PIC_ADJ_AMOUNT_PAID = FIN_AMOUNT_PAID;                        
          PIC_ADJUSTMENT =                                              
        (PIC_ADJUSTMENT - PIC_FIN_OLDSEG_AMOUNT + PIC_ADJ_AMOUNT_PAID); 
          PIC_ADJUSTMENT = PIC_ADJUSTMENT / 100;                        
       END;                                                             
                                                                        
                                                                        
       TYPE_FREE_STICKER (TYPE_SUBSCRIPT) =                             
             TYPE_FREE_STICKER (TYPE_SUBSCRIPT) + PIC_FREE_STICKER;     
       TYPE_PAID_STICKER (TYPE_SUBSCRIPT) =                             
             TYPE_PAID_STICKER (TYPE_SUBSCRIPT) + PIC_PAID_STICKER;     
       TYPE_TOTAL_STICKERS (TYPE_SUBSCRIPT) =                           
             TYPE_TOTAL_STICKERS (TYPE_SUBSCRIPT) + PIC_TOTAL_STICKERS; 
       TYPE_AMOUNT_PAID (TYPE_SUBSCRIPT) =                              
             TYPE_AMOUNT_PAID (TYPE_SUBSCRIPT) + PIC_AMOUNT_PAID;       
       TYPE_COUNT (TYPE_SUBSCRIPT) =                                    
             TYPE_COUNT (TYPE_SUBSCRIPT) + 1;                           
                                                                        
       LOCATION_FREE_STICKER (LOCATION_SUBSCRIPT) =                     
             LOCATION_FREE_STICKER (LOCATION_SUBSCRIPT) +               
             PIC_FREE_STICKER;                                          
       LOCATION_PAID_STICKER (LOCATION_SUBSCRIPT) =                     
             LOCATION_PAID_STICKER (LOCATION_SUBSCRIPT) +               
             PIC_PAID_STICKER;                                          
       LOCATION_TOTAL_STICKERS (LOCATION_SUBSCRIPT) =                   
             LOCATION_TOTAL_STICKERS (LOCATION_SUBSCRIPT) +             
             PIC_TOTAL_STICKERS;                                        
       LOCATION_AMOUNT_PAID (LOCATION_SUBSCRIPT) =                      
             LOCATION_AMOUNT_PAID (LOCATION_SUBSCRIPT) +                
             PIC_AMOUNT_PAID;                                           
       LOCATION_COUNT (LOCATION_SUBSCRIPT) =                            
             LOCATION_COUNT (LOCATION_SUBSCRIPT) + 1;                   
                                                                        
       TOTAL_FREE_STICKER (LOCATION_SUBSCRIPT,TYPE_SUBSCRIPT) =         
             TOTAL_FREE_STICKER (LOCATION_SUBSCRIPT,TYPE_SUBSCRIPT) +   
             PIC_FREE_STICKER;                                          
       TOTAL_PAID_STICKER (LOCATION_SUBSCRIPT,TYPE_SUBSCRIPT) =         
             TOTAL_PAID_STICKER (LOCATION_SUBSCRIPT,TYPE_SUBSCRIPT) +   
             PIC_PAID_STICKER;                                          
       TOTAL_TOTAL_STICKERS (LOCATION_SUBSCRIPT,TYPE_SUBSCRIPT) =       
             TOTAL_TOTAL_STICKERS (LOCATION_SUBSCRIPT,TYPE_SUBSCRIPT) + 
             PIC_TOTAL_STICKERS;                                        
       TOTAL_AMOUNT_PAID (LOCATION_SUBSCRIPT,TYPE_SUBSCRIPT) =          
             TOTAL_AMOUNT_PAID (LOCATION_SUBSCRIPT,TYPE_SUBSCRIPT) +    
             PIC_AMOUNT_PAID;                                           
       TOTAL_COUNT (LOCATION_SUBSCRIPT,TYPE_SUBSCRIPT) =                
             TOTAL_COUNT (LOCATION_SUBSCRIPT,TYPE_SUBSCRIPT) + 1;       
                                                                        
       IF ACC_ADJUSTMENT_SWITCH = ON                                    
       THEN DO;                                                         
          TYPE_AMOUNT_PAID (TYPE_SUBSCRIPT) =                           
                TYPE_AMOUNT_PAID (TYPE_SUBSCRIPT) + PIC_ADJUSTMENT;     
          LOCATION_AMOUNT_PAID (LOCATION_SUBSCRIPT) =                   
                LOCATION_AMOUNT_PAID (LOCATION_SUBSCRIPT) +             
                PIC_ADJUSTMENT;                                         
          TOTAL_AMOUNT_PAID (LOCATION_SUBSCRIPT,TYPE_SUBSCRIPT) =       
                TOTAL_AMOUNT_PAID (LOCATION_SUBSCRIPT,TYPE_SUBSCRIPT) + 
                PIC_ADJUSTMENT;                                         
          CALL ACCOUNT_ADJUSTING_LIST_ROUTINE;                          
       END;                                                             
                                                                        
 END PRINT_REPORT_LINE;                                                 
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*  PRINT_REPORT_HEADINGS:                                           */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 PRINT_REPORT_HEADINGS:                                                 
    PROCEDURE;                                                          
                                                                        
       FIRST_PAGE = NO;                                                 
       REPORT_PAGE_NUMBER = PAGE_COUNT;                                 
       REPORT_NUMBER_AREA = '120';                                      
       WRITE FILE (FINRPRT) FROM (DATE_PAGE_LINE);                      
       FL1LIT1 = REPORT_TITLES_ARRAY (1);                               
       WRITE FILE (FINRPRT) FROM (FINR_LIST_HEADING1);                  
       FL4LIT1 = ' ISSUING  LOCATION ';                                 
       TITLE_FIELD_REPORT =                                             
             REPORT_LOCATION_TITLES (SAVE_LOCATION_SUBSCRIPT);          
       WRITE FILE (FINRPRT) FROM (FINR_LIST_HEADING4);                  
 /**** FL4LIT1 = '   STICKER  TYPE   ';                                 
       TITLE_FIELD_REPORT = FIN_STICKER_TYPE;                           
       WRITE FILE (FINRPRT) FROM (FINR_LIST_HEADING4); ********/        
       WRITE FILE (FINRPRT) FROM (FINR_LIST_HEADING2);                  
       WRITE FILE (FINRPRT) FROM (FINR_LIST_HEADING3);                  
       WRITE FILE (FINRPRT) FROM (ONE_SPACE_LINE);                      
       LINE_COUNT = 0;                                                  
       PAGE_COUNT = PAGE_COUNT + 1;                                     
                                                                        
 END PRINT_REPORT_HEADINGS;                                             
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*  PRINT_STICKER_TYPE_TOTAL:                                        */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 PRINT_STICKER_TYPE_TOTAL:                                              
    PROCEDURE;                                                          
                                                                        
       TFLLIT1 = '    TYPE ';                                           
       TITLE_FIELD_TLINE = SAVE_STICKER_TYPE;                           
       TOTAL_COUNT_TLINE = TYPE_COUNT (TYPE_SUBSCRIPT);                 
                                                                        
       TOTAL_PAID_TLINE = TYPE_PAID_STICKER (TYPE_SUBSCRIPT);           
       TOTAL_FREE_TLINE = TYPE_FREE_STICKER (TYPE_SUBSCRIPT);           
       TOTAL_STICKERS_TLINE = TYPE_TOTAL_STICKERS (TYPE_SUBSCRIPT);     
       AMOUNT_PAID_TLINE = TYPE_AMOUNT_PAID (TYPE_SUBSCRIPT);           
                                                                        
       WRITE FILE (FINRPRT) FROM (TOTAL_FINANCE_LINE);                  
                                                                        
       TYPE_FREE_STICKER (TYPE_SUBSCRIPT) = 0;                          
       TYPE_PAID_STICKER (TYPE_SUBSCRIPT) = 0;                          
       TYPE_TOTAL_STICKERS (TYPE_SUBSCRIPT) = 0;                        
       TYPE_AMOUNT_PAID (TYPE_SUBSCRIPT) = 0;                           
       TYPE_COUNT (TYPE_SUBSCRIPT) = 0;                                 
                                                                        
 END PRINT_STICKER_TYPE_TOTAL;                                          
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*  PRINT_ISSUING_LOCATION_TOTAL:                                    */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 PRINT_ISSUING_LOCATION_TOTAL:                                          
    PROCEDURE;                                                          
                                                                        
       REPORT_PAGE_NUMBER = PAGE_COUNT;                                 
       REPORT_NUMBER_AREA = '120';                                      
       LINE_COUNT = 0;                                                  
       PAGE_COUNT = PAGE_COUNT + 1;                                     
                                                                        
       WRITE FILE (FINRPRT) FROM (DATE_PAGE_LINE);                      
       FL1LIT1 = REPORT_TITLES_ARRAY (1);                               
       WRITE FILE (FINRPRT) FROM (FINR_LIST_HEADING1);                  
       FL1LIT1 = REPORT_TITLES_ARRAY (5);                               
       WRITE FILE (FINRPRT) FROM (FINR_LIST_HEADING1);                  
       WRITE FILE (FINRPRT) FROM (TWO_SPACE_LINE);                      
       FL4LIT1 = ' ISSUING  LOCATION ';                                 
       TITLE_FIELD_REPORT =                                             
             REPORT_LOCATION_TITLES (SAVE_LOCATION_SUBSCRIPT);          
       WRITE FILE (FINRPRT) FROM (FINR_LIST_HEADING4);                  
       WRITE FILE (FINRPRT) FROM (ONE_SPACE_LINE);                      
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING3);                 
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING4);                 
                                                                        
       TRLLIT1 = '    TYPE ';                                           
       TRLLIT2 = '!!';                                                  
       TRLLIT3 = '!!';                                                  
                                                                        
       DO I = 1 TO 6;                                                   
                                                                        
          TITLE_FIELD_RLINE = REPORT_TYPE_TITLES (I);                   
                                                                        
          TOTAL_COUNT_RLINE =                                           
                TOTAL_COUNT (LOCATION_SUBSCRIPT,I);                     
          TOTAL_PAID_RLINE =                                            
                TOTAL_PAID_STICKER (LOCATION_SUBSCRIPT,I);              
          TOTAL_FREE_RLINE =                                            
                TOTAL_FREE_STICKER (LOCATION_SUBSCRIPT,I);              
          TOTAL_STICKERS_RLINE =                                        
                TOTAL_TOTAL_STICKERS (LOCATION_SUBSCRIPT,I);            
          AMOUNT_PAID_RLINE =                                           
                TOTAL_AMOUNT_PAID (LOCATION_SUBSCRIPT,I);               
                                                                        
          WRITE FILE (FINRPRT) FROM (TOTAL_REPORT_LINE);                
                                                                        
       END;                                                             
                                                                        
       WRITE FILE (FINRPRT) FROM (TWO_SPACE_LINE);                      
                                                                        
       TLLLIT1 = 'LOCATION ';                                           
       TITLE_FIELD_LLINE =                                              
             REPORT_LOCATION_TITLES (SAVE_LOCATION_SUBSCRIPT);          
       TOTAL_COUNT_LLINE = LOCATION_COUNT (LOCATION_SUBSCRIPT);         
       TOTAL_PAID_LLINE =                                               
             LOCATION_PAID_STICKER (LOCATION_SUBSCRIPT);                
       TOTAL_FREE_LLINE =                                               
             LOCATION_FREE_STICKER (LOCATION_SUBSCRIPT);                
       TOTAL_STICKERS_LLINE =                                           
             LOCATION_TOTAL_STICKERS (LOCATION_SUBSCRIPT);              
       AMOUNT_PAID_LLINE = LOCATION_AMOUNT_PAID (LOCATION_SUBSCRIPT);   
                                                                        
       WRITE FILE (FINRPRT) FROM (TOTAL_LOCATION_LINE);                 
                                                                        
       LOCATION_FREE_STICKER (LOCATION_SUBSCRIPT) = 0;                  
       LOCATION_PAID_STICKER (LOCATION_SUBSCRIPT) = 0;                  
       LOCATION_TOTAL_STICKERS (LOCATION_SUBSCRIPT) = 0;                
       LOCATION_AMOUNT_PAID (LOCATION_SUBSCRIPT) = 0;                   
       LOCATION_COUNT (LOCATION_SUBSCRIPT) = 0;                         
                                                                        
 END PRINT_ISSUING_LOCATION_TOTAL;                                      
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*  END_OF_JOB_PROCESSING:                                           */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 END_OF_JOB_PROCESSING:                                                 
    PROCEDURE;                                                          
                                                                        
 /**** CALL PRINT_STICKER_TYPE_TOTAL; *****/                            
       CALL PRINT_ISSUING_LOCATION_TOTAL;                               
                                                                        
       REPORT_PAGE_NUMBER = PAGE_COUNT;                                 
       REPORT_NUMBER_AREA = '120';                                      
       WRITE FILE (FINRPRT) FROM (DATE_PAGE_LINE);                      
       FT1LIT1 = REPORT_TITLES_ARRAY (6);                               
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING1);                 
       FT1LIT1 = REPORT_TITLES_ARRAY (3);                               
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING1);                 
       WRITE FILE (FINRPRT) FROM (TWO_SPACE_LINE);                      
                                                                        
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING3);                 
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING4);                 
                                                                        
       TRLLIT1 = 'LOCATION ';                                           
       TRLLIT2 = '!!';                                                  
       TRLLIT3 = '!!';                                                  
                                                                        
       DO I = 1 TO 6;                                                   
                                                                        
          TITLE_FIELD_RLINE = REPORT_LOCATION_TITLES (I);               
                                                                        
          TOTAL_COUNT_RLINE = SUM (TOTAL_COUNT (I,*));                  
          TOTAL_PAID_RLINE = SUM (TOTAL_PAID_STICKER (I,*));            
          TOTAL_FREE_RLINE = SUM (TOTAL_FREE_STICKER (I,*));            
          TOTAL_STICKERS_RLINE = SUM (TOTAL_TOTAL_STICKERS (I,*));      
          AMOUNT_PAID_RLINE = SUM (TOTAL_AMOUNT_PAID (I,*));            
                                                                        
          WRITE FILE (FINRPRT) FROM (TOTAL_REPORT_LINE);                
                                                                        
       END;                                                             
                                                                        
       PAGE_COUNT = PAGE_COUNT + 1;                                     
       REPORT_PAGE_NUMBER = PAGE_COUNT;                                 
       WRITE FILE (FINRPRT) FROM (DATE_PAGE_LINE);                      
       FT1LIT1 = REPORT_TITLES_ARRAY (6);                               
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING1);                 
       FT1LIT1 = REPORT_TITLES_ARRAY (4);                               
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING1);                 
       WRITE FILE (FINRPRT) FROM (TWO_SPACE_LINE);                      
                                                                        
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING3);                 
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING4);                 
                                                                        
       TRLLIT1 = '    TYPE ';                                           
       TRLLIT2 = '!!';                                                  
       TRLLIT3 = '!!';                                                  
                                                                        
       DO I = 1 TO 6;                                                   
                                                                        
          TITLE_FIELD_RLINE = REPORT_TYPE_TITLES (I);                   
                                                                        
          TOTAL_COUNT_RLINE = SUM (TOTAL_COUNT (*,I));                  
          TOTAL_PAID_RLINE = SUM (TOTAL_PAID_STICKER (*,I));            
          TOTAL_FREE_RLINE = SUM (TOTAL_FREE_STICKER (*,I));            
          TOTAL_STICKERS_RLINE = SUM (TOTAL_TOTAL_STICKERS (*,I));      
          AMOUNT_PAID_RLINE = SUM (TOTAL_AMOUNT_PAID (*,I));            
                                                                        
          WRITE FILE (FINRPRT) FROM (TOTAL_REPORT_LINE);                
                                                                        
       END;                                                             
                                                                        
       PAGE_COUNT = PAGE_COUNT + 1;                                     
       REPORT_PAGE_NUMBER = PAGE_COUNT;                                 
       WRITE FILE (FINRPRT) FROM (DATE_PAGE_LINE);                      
       FT1LIT1 = REPORT_TITLES_ARRAY (6);                               
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING1);                 
       FT1LIT1 = REPORT_TITLES_ARRAY (7);                               
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING1);                 
       WRITE FILE (FINRPRT) FROM (THREE_SPACE_LINE);                    
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING3);                 
       WRITE FILE (FINRPRT) FROM (FINR_TOTAL_HEADING4);                 
                                                                        
       TRLLIT1 = ' ';                                                   
       TRLLIT2 = ' ';                                                   
       TITLE_FIELD_RLINE = ' ';                                         
       TRLLIT3 = ' ';                                                   
       TOTAL_COUNT_RLINE = SUM (TOTAL_COUNT);                           
       TOTAL_PAID_RLINE = SUM (TOTAL_PAID_STICKER);                     
       TOTAL_FREE_RLINE = SUM (TOTAL_FREE_STICKER);                     
       TOTAL_STICKERS_RLINE = SUM (TOTAL_TOTAL_STICKERS);               
       AMOUNT_PAID_RLINE = SUM (TOTAL_AMOUNT_PAID);                     
                                                                        
       WRITE FILE (FINRPRT) FROM (TOTAL_REPORT_LINE);                   
                                                                        
       IF ADJUST_COUNT > 0                                              
       THEN DO;                                                         
          RFT_TITLE = '     TOTAL ADJUSTMENTS';                         
          RFT_TOTALS_FIELD = ADJUST_COUNT;                              
          WRITE FILE (ADJLIST) FROM (REPORT_FILE_TOTALS_LINE);          
       END;                                                             
                                                                        
       IF OLDIN17_COUNT > 0                                             
       THEN DO;                                                         
          RFT_TITLE = 'TOTAL OLD STICKER TYPE';                         
          RFT_TOTALS_FIELD = OLDIN17_COUNT;                             
          WRITE FILE (OLDIN17) FROM (REPORT_FILE_TOTALS_LINE);          
       END;                                                             
                                                                        
       IF OLDIN18_COUNT > 0                                             
       THEN DO;                                                         
          RFT_TITLE = 'TOTAL OLD IN18 STICKER';                         
          RFT_TOTALS_FIELD = OLDIN18_COUNT;                             
          WRITE FILE (OLDIN18) FROM (REPORT_FILE_TOTALS_LINE);          
       END;                                                             
                                                                        
 END END_OF_JOB_PROCESSING;                                             
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*  ACCOUNT_ADJUSTING_LIST_ROUTINE:                                  */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 ACCOUNT_ADJUSTING_LIST_ROUTINE:                                        
    PROCEDURE;                                                          
                                                                        
    FOLFIL13B = ' ';                                                    
                                                                        
    ADJUST_COUNT = ADJUST_COUNT + 1;                                    
                                                                        
    IF ADJUST_COUNT = ADJLIST_HEADING                                   
    THEN DO;                                                            
       ADJLIST_HEADING = ADJLIST_HEADING + 40;                          
       ADJLIST_PAGE_COUNT = ADJLIST_PAGE_COUNT + 1;                     
       REPORT_PAGE_NUMBER = ADJLIST_PAGE_COUNT;                         
       REPORT_NUMBER_AREA = '122';                                      
       WRITE FILE (ADJLIST) FROM (DATE_PAGE_LINE);                      
       FL1LIT1 = REPORT_TITLES_ARRAY (1);                               
       WRITE FILE (ADJLIST) FROM (FINR_LIST_HEADING1);                  
       FL1LIT1 = REPORT_TITLES_ARRAY (8);                               
       WRITE FILE (ADJLIST) FROM (FINR_LIST_HEADING1);                  
                                                                        
       WRITE FILE (ADJLIST) FROM (FINR_LIST_HEADING2);                  
       WRITE FILE (ADJLIST) FROM (FINR_LIST_HEADING3);                  
       WRITE FILE (ADJLIST) FROM (ONE_SPACE_LINE);                      
       ADJLIST_LINE_COUNT = 0;                                          
    END;                                                                
                                                                        
    FORMAT_TRANSMITTAL_AREA = ' ';                                      
    CALL EXPAND_TRANSMITTAL_NUMBER                                      
          (FIN_TRANSMITTAL,FORMAT_TRANSMITTAL_AREA);                    
    TRANSMITTAL_REPORT = FORMAT_TRANSMITTAL_AREA;                       
                                                                        
    CALL SEPARATE_DATE                                                  
          (FIN_PURCHASE_DATE,PURCHASE_DATE_REPORT,'-');                 
                                                                        
    STATION_NUMBER_REPORT = FIN_STATION_NUMBER;                         
                                                                        
    FORMAT_STICKER_AREA = ' ';                                          
    CALL EXPAND_STICKER_NUMBER                                          
          (FIN_LOW_STICKER,FORMAT_STICKER_AREA);                        
    LOW_STICKER_REPORT = FORMAT_STICKER_AREA;                           
                                                                        
    FORMAT_STICKER_AREA = ' ';                                          
    CALL EXPAND_STICKER_NUMBER                                          
          (FIN_HIGH_STICKER,FORMAT_STICKER_AREA);                       
    HIGH_STICKER_REPORT = FORMAT_STICKER_AREA;                          
                                                                        
    STICKER_TYPE_REPORT = FIN_STICKER_TYPE;                             
    PAID_STICKER_REPORT = FIN_PAID_STICKER;                             
    FREE_STICKER_REPORT = FIN_FREE_STICKER;                             
    TOTAL_STICKERS_REPORT = FIN_TOTAL_STICKERS;                         
                                                                        
    PIC_AMOUNT_PAID = FIN_AMOUNT_PAID;                                  
    PIC_AMOUNT_PAID = PIC_AMOUNT_PAID / 100;                            
    AMOUNT_PAID_REPORT = PIC_AMOUNT_PAID;                               
                                                                        
    IF FIN_ADJUSTMENT_CODE = '1'                                        
    THEN                                                                
       FOLFIL13B = 'CODE = 1';                                          
    ELSE                                                                
       IF FIN_ADJUSTMENT_CODE = '2'                                     
       THEN                                                             
          FOLFIL13B = 'CODE = 2';                                       
       ELSE                                                             
          IF FIN_ADJUSTMENT_CODE = '3'                                  
          THEN                                                          
             FOLFIL13B = 'CODE = 3';                                    
          ELSE                                                          
             FOLFIL13B = 'CODE = ?';                                    
                                                                        
    WRITE FILE (ADJLIST) FROM (FINR_LIST_OUTPUT_LINE);                  
                                                                        
 END ACCOUNT_ADJUSTING_LIST_ROUTINE;                                    
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*  OLD_STICKER_LIST_ROUTINE:                                        */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 OLD_STICKER_LIST_ROUTINE:                                              
    PROCEDURE;                                                          
                                                                        
    FOLFIL13B = ' ';                                                    
                                                                        
    OLDIN17_COUNT = OLDIN17_COUNT + 1;                                  
                                                                        
    IF OLDIN17_COUNT = OLDIN17_HEADING                                  
    THEN DO;                                                            
       OLDIN17_HEADING = OLDIN17_HEADING + 40;                          
       OLDIN17_PAGE_COUNT = OLDIN17_PAGE_COUNT + 1;                     
       REPORT_PAGE_NUMBER = OLDIN17_PAGE_COUNT;                         
       REPORT_NUMBER_AREA = '124';                                      
       WRITE FILE (OLDIN17) FROM (DATE_PAGE_LINE);                      
       FL1LIT1 = REPORT_TITLES_ARRAY (1);                               
       WRITE FILE (OLDIN17) FROM (FINR_LIST_HEADING1);                  
       FL1LIT1 = REPORT_TITLES_ARRAY (9);                               
       WRITE FILE (OLDIN17) FROM (FINR_LIST_HEADING1);                  
                                                                        
       WRITE FILE (OLDIN17) FROM (FINR_LIST_HEADING2);                  
       WRITE FILE (OLDIN17) FROM (FINR_LIST_HEADING3);                  
       WRITE FILE (OLDIN17) FROM (ONE_SPACE_LINE);                      
       OLDIN17_LINE_COUNT = 0;                                          
    END;                                                                
                                                                        
    FORMAT_TRANSMITTAL_AREA = ' ';                                      
    CALL EXPAND_TRANSMITTAL_NUMBER                                      
          (FIN_TRANSMITTAL,FORMAT_TRANSMITTAL_AREA);                    
    TRANSMITTAL_REPORT = FORMAT_TRANSMITTAL_AREA;                       
                                                                        
    CALL SEPARATE_DATE                                                  
          (FIN_PURCHASE_DATE,PURCHASE_DATE_REPORT,'-');                 
                                                                        
    STATION_NUMBER_REPORT = FIN_STATION_NUMBER;                         
                                                                        
    FORMAT_STICKER_AREA = ' ';                                          
    CALL EXPAND_STICKER_NUMBER                                          
          (FIN_LOW_STICKER,FORMAT_STICKER_AREA);                        
    LOW_STICKER_REPORT = FORMAT_STICKER_AREA;                           
                                                                        
    FORMAT_STICKER_AREA = ' ';                                          
    CALL EXPAND_STICKER_NUMBER                                          
          (FIN_HIGH_STICKER,FORMAT_STICKER_AREA);                       
    HIGH_STICKER_REPORT = FORMAT_STICKER_AREA;                          
                                                                        
    IF FIN_STICKER_TYPE <= ' '                                          
    THEN                                                                
       STICKER_TYPE_REPORT = '-';                                       
    ELSE                                                                
       STICKER_TYPE_REPORT = FIN_STICKER_TYPE;                          
    PAID_STICKER_REPORT = FIN_PAID_STICKER;                             
    FREE_STICKER_REPORT = FIN_FREE_STICKER;                             
    TOTAL_STICKERS_REPORT = FIN_TOTAL_STICKERS;                         
                                                                        
    PIC_AMOUNT_PAID = FIN_AMOUNT_PAID;                                  
    PIC_AMOUNT_PAID = PIC_AMOUNT_PAID / 100;                            
    AMOUNT_PAID_REPORT = PIC_AMOUNT_PAID;                               
                                                                        
    WRITE FILE (OLDIN17) FROM (FINR_LIST_OUTPUT_LINE);                  
    OLDIN17_LINE_COUNT = OLDIN17_LINE_COUNT + 1;                        
                                                                        
 END OLD_STICKER_LIST_ROUTINE;                                          
                                                                        
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*  OLD_IN18_STICKER_LIST_ROUTINE:                                   */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 OLD_IN18_STICKER_LIST_ROUTINE:                                         
    PROCEDURE;                                                          
                                                                        
    FOLFIL13B = ' ';                                                    
                                                                        
    OLDIN18_COUNT = OLDIN18_COUNT + 1;                                  
                                                                        
    IF OLDIN18_COUNT = OLDIN18_HEADING                                  
    THEN DO;                                                            
       OLDIN18_HEADING = OLDIN18_HEADING + 40;                          
       OLDIN18_PAGE_COUNT = OLDIN18_PAGE_COUNT + 1;                     
       REPORT_PAGE_NUMBER = OLDIN18_PAGE_COUNT;                         
       REPORT_NUMBER_AREA = '126';                                      
       WRITE FILE (OLDIN18) FROM (DATE_PAGE_LINE);                      
       FL1LIT1 = REPORT_TITLES_ARRAY (1);                               
       WRITE FILE (OLDIN18) FROM (FINR_LIST_HEADING1);                  
       FL1LIT1 = REPORT_TITLES_ARRAY (10);                              
       WRITE FILE (OLDIN18) FROM (FINR_LIST_HEADING1);                  
                                                                        
       WRITE FILE (OLDIN18) FROM (FINR_LIST_HEADING2);                  
       WRITE FILE (OLDIN18) FROM (FINR_LIST_HEADING3);                  
       WRITE FILE (OLDIN18) FROM (ONE_SPACE_LINE);                      
       OLDIN18_LINE_COUNT = 0;                                          
    END;                                                                
                                                                        
    FORMAT_TRANSMITTAL_AREA = ' ';                                      
    CALL EXPAND_TRANSMITTAL_NUMBER                                      
          (FIN_TRANSMITTAL,FORMAT_TRANSMITTAL_AREA);                    
    TRANSMITTAL_REPORT = FORMAT_TRANSMITTAL_AREA;                       
                                                                        
    CALL SEPARATE_DATE                                                  
          (FIN_PURCHASE_DATE,PURCHASE_DATE_REPORT,'-');                 
                                                                        
    STATION_NUMBER_REPORT = FIN_STATION_NUMBER;                         
                                                                        
    FORMAT_STICKER_AREA = ' ';                                          
    CALL EXPAND_STICKER_NUMBER                                          
          (FIN_LOW_STICKER,FORMAT_STICKER_AREA);                        
    LOW_STICKER_REPORT = FORMAT_STICKER_AREA;                           
                                                                        
    FORMAT_STICKER_AREA = ' ';                                          
    CALL EXPAND_STICKER_NUMBER                                          
          (FIN_HIGH_STICKER,FORMAT_STICKER_AREA);                       
    HIGH_STICKER_REPORT = FORMAT_STICKER_AREA;                          
                                                                        
    IF FIN_STICKER_TYPE <= ' '                                          
    THEN                                                                
       STICKER_TYPE_REPORT = '-';                                       
    ELSE                                                                
       STICKER_TYPE_REPORT = FIN_STICKER_TYPE;                          
    PAID_STICKER_REPORT = FIN_PAID_STICKER;                             
    FREE_STICKER_REPORT = FIN_FREE_STICKER;                             
    TOTAL_STICKERS_REPORT = FIN_TOTAL_STICKERS;                         
                                                                        
    PIC_AMOUNT_PAID = FIN_AMOUNT_PAID;                                  
    PIC_AMOUNT_PAID = PIC_AMOUNT_PAID / 100;                            
    AMOUNT_PAID_REPORT = PIC_AMOUNT_PAID;                               
                                                                        
    WRITE FILE (OLDIN18) FROM (FINR_LIST_OUTPUT_LINE);                  
    OLDIN18_LINE_COUNT = OLDIN18_LINE_COUNT + 1;                        
                                                                        
 END OLD_IN18_STICKER_LIST_ROUTINE;                                     
                                                                        
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*  INITIALIZE_REPORT_FIELDS:                                        */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 INITIALIZE_REPORT_FIELDS:                                              
    PROCEDURE;                                                          
                                                                        
       OPEN FILE (FINREPT),                                             
            FILE (FINRPRT),                                             
            FILE (OLDIN17),                                             
            FILE (OLDIN18),                                             
            FILE (ADJLIST);                                             
                                                                        
       FIRST_PAGE = YES;                                                
       DATE_AREA = ' ';                                                 
       DS_YYMMDD = DATE;                                                
       CALL DATERTN (DATE_STRUCTURE);                                   
       REPORT_DATE_AREA = HYPEN_FORMAT;                                 
       REPORT_NUMBER_AREA = '120';                                      
                                                                        
       TOTAL_FREE_STICKER (*,*) = 0;                                    
       TOTAL_PAID_STICKER (*,*) = 0;                                    
       TOTAL_TOTAL_STICKERS (*,*) = 0;                                  
       TOTAL_AMOUNT_PAID (*,*) = 0;                                     
                                                                        
       TYPE_FREE_STICKER (*) = 0;                                       
       TYPE_PAID_STICKER (*) = 0;                                       
       TYPE_TOTAL_STICKERS (*) = 0;                                     
       TYPE_AMOUNT_PAID (*) = 0;                                        
       TYPE_COUNT (*) = 0;                                              
                                                                        
       LOCATION_FREE_STICKER (*) = 0;                                   
       LOCATION_PAID_STICKER (*) = 0;                                   
       LOCATION_TOTAL_STICKERS (*) = 0;                                 
       LOCATION_AMOUNT_PAID (*) = 0;                                    
       LOCATION_COUNT (*) = 0;                                          
                                                                        
       LOCATION_SUBSCRIPT_TABLE (1) = 1;                                
       LOCATION_SUBSCRIPT_TABLE (2) = 2;                                
       LOCATION_SUBSCRIPT_TABLE (3) = 3;                                
       LOCATION_SUBSCRIPT_TABLE (4) = 4;                                
       LOCATION_SUBSCRIPT_TABLE (5) = 5;                                
       LOCATION_SUBSCRIPT_TABLE (6) = 6;                                
       LOCATION_SUBSCRIPT_TABLE (7) = 6;                                
       LOCATION_SUBSCRIPT_TABLE (8) = 6;                                
       LOCATION_SUBSCRIPT_TABLE (9) = 6;                                
       LOCATION_SUBSCRIPT_TABLE (10) = 6;                               
       LOCATION_SUBSCRIPT_TABLE (11) = 6;                               
       LOCATION_SUBSCRIPT_TABLE (12) = 6;                               
       LOCATION_SUBSCRIPT_TABLE (13) = 6;                               
                                                                        
 END INITIALIZE_REPORT_FIELDS;                                          
                                                                        
 /*********************************************************************/
 /*                                                                   */
 /*  INITIALIZE_SUBSCRIPTS:                                           */
 /*                                                                   */
 /*********************************************************************/
                                                                        
 INITIALIZE_SUBSCRIPTS:                                                 
    PROCEDURE;                                                          
                                                                        
        LOCATION_SUBSCRIPT = 0;                                         
        TYPE_SUBSCRIPT = 0;                                             
                                                                        
        DO I = 1 TO 13;                                                 
           IF SAVE_ISSUING_LOCATION = ISSUING_LOCATION_TITLES (I)       
           THEN DO;                                                     
              LOCATION_SUBSCRIPT = LOCATION_SUBSCRIPT_TABLE (I);        
              I = 13;                                                   
           END;                                                         
        END;                                                            
                                                                        
        DO I = 1 TO 6;                                                  
           IF SAVE_STICKER_TYPE = STICKER_TYPE_TITLES (I)               
           THEN DO;                                                     
              TYPE_SUBSCRIPT = I;                                       
              I = 6;                                                    
           END;                                                         
        END;                                                            
                                                                        
        IF LOCATION_SUBSCRIPT = 0 ³                                     
           TYPE_SUBSCRIPT = 0                                           
        THEN DO;                                                        
           IF LOCATION_SUBSCRIPT = 0                                    
           THEN                                                         
              PUT SKIP LIST ('LOCATION EDIT ----- RECORD  = ' ³³        
                    FINANCE_FILE_AREA);                                 
           ELSE                                                         
              PUT SKIP LIST ('TYPE EDIT -----  RECORD  = ' ³³           
                    FINANCE_FILE_AREA);                                 
           GOTO READ_FILE;                                              
        END;                                                            
                                                                        
 END INITIALIZE_SUBSCRIPTS;                                             
                                                                        
                                                                        
 %PAGE;                                                                 
 /*******************************************************************/  
 /*                                                                 */  
 /*  SEPARATE_DATE:                                                 */  
 /*                                                                 */  
 /*           CALL SEPARATE_DATE (XXXXXXX,YYYYYYY,'?');             */  
 /*                                                                 */  
 /*        XXXXXXXX = INPUT DATE CHAR (06)                          */  
 /*        YYYYYYYY = OUTPUT DATE CHAR (08)                         */  
 /*               ? = ANY CHARACTER ('-' OR '/')                    */  
 /*                                                                 */  
 /*******************************************************************/  
                                                                        
 SEPARATE_DATE:                                                         
    PROCEDURE (DATE_IN,DATE_OUT,DATE_SEPARATOR);                        
                                                                        
       DCL DATE_IN             CHAR (06);                               
                                                                        
       DCL 1 DATE_STRUCTURE       /*  6 CHARACTERS  */                  
                   DEF DATE_IN,                                         
             2 D_MONTH         CHAR (02),                               
             2 D_DAY           CHAR (02),                               
             2 D_YEAR          CHAR (02);                               
                                                                        
       DCL DATE_OUT            CHAR (08);                               
                                                                        
       DCL 1 SEPARATOR_STRUCTURE     /*  8 CHARACTERS  */               
                  DEF  DATE_OUT,                                        
             2 S_MONTH         CHAR (02),                               
             2 SLIT1           CHAR (01),                               
             2 S_DAY           CHAR (02),                               
             2 SLIT2           CHAR (01),                               
             2 S_YEAR          CHAR (02);                               
                                                                        
       DCL DATE_SEPARATOR      CHAR (01);                               
                                                                        
                                                                        
       S_MONTH = D_MONTH;                                               
       SLIT1 = DATE_SEPARATOR;                                          
       S_DAY = D_DAY;                                                   
       SLIT2 = DATE_SEPARATOR;                                          
       S_YEAR = D_YEAR;                                                 
                                                                        
 END SEPARATE_DATE;                                                     
                                                                        
 %PAGE;                                                                 
 /********************************************************************/ 
 /*                                                                  */ 
 /*  EXPAND_TRANSMITTAL_NUMBER:                                      */ 
 /*                                                                  */ 
 /********************************************************************/ 
                                                                        
 EXPAND_TRANSMITTAL_NUMBER:                                             
    PROCEDURE (TRANSMITTAL_IN,TRANSMITTAL_OUT);                         
                                                                        
    DCL TRANSMITTAL_IN               CHAR (09);                         
                                                                        
    DCL 1 TRANSMITTAL_IN_STRUCTURE  /*  09 CHARACTERS  */               
                   DEF     TRANSMITTAL_IN,                              
          2 TRANS_YEAR_IN            CHAR (05),                         
          2 TRANS_LOCATION_IN        CHAR (01),                         
          2 TRANS_NUMBER_IN          CHAR (03);                         
                                                                        
    DCL TRANSMITTAL_OUT              CHAR (11);                         
                                                                        
    DCL 1 TRANSMITTAL_OUT_STRUCTURE  /*  11 CHARACTERS  */              
                   DEF     TRANSMITTAL_OUT,                             
          2 TRANS_YEAR_OT            CHAR (05),                         
          2 TRANS_HYPEN1_OT          CHAR (01),                         
          2 TRANS_LOCATION_OT        CHAR (01),                         
          2 TRANS_HYPEN2_OT          CHAR (01),                         
          2 TRANS_NUMBER_OT          CHAR (03);                         
                                                                        
    TRANS_YEAR_OT = TRANS_YEAR_IN;                                      
    TRANS_HYPEN1_OT = '-';                                              
    TRANS_LOCATION_OT = TRANS_LOCATION_IN;                              
    TRANS_HYPEN2_OT = '-';                                              
    TRANS_NUMBER_OT = TRANS_NUMBER_IN;                                  
                                                                        
 END EXPAND_TRANSMITTAL_NUMBER;                                         
                                                                        
 %PAGE;                                                                 
 /********************************************************************/ 
 /*  MODULE # 545                                                    */ 
 /*                                                                  */ 
 /*  EXPAND_STICKER_NUMBER:                                          */ 
 /*                                                                  */ 
 /********************************************************************/ 
                                                                        
 EXPAND_STICKER_NUMBER:                                                 
    PROCEDURE (STICKER_IN,STICKER_OUT);                                 
                                                                        
    DCL STICKER_IN                   CHAR (10);                         
                                                                        
    DCL 1 STICKER_IN_STRUCTURE      /*  10 CHARACTERS  */               
                   DEF     STICKER_IN,                                  
          2 STICK_GROUP1_IN          CHAR (02),                         
          2 STICK_GROUP2_IN          CHAR (02),                         
          2 STICK_GROUP3_IN          CHAR (03),                         
          2 STICK_GROUP4_IN          CHAR (03);                         
                                                                        
    DCL STICKER_OUT                  CHAR (13);                         
                                                                        
    DCL 1 STICKER_OUT_STRUCTURE      /*  13 CHARACTERS  */              
                   DEF     STICKER_OUT,                                 
          2 STICK_GROUP1_OT          CHAR (02),                         
          2 STICK_HYPEN1_OT          CHAR (01),                         
          2 STICK_GROUP2_OT          CHAR (02),                         
          2 STICK_COMMA1_OT          CHAR (01),                         
          2 STICK_GROUP3_OT          CHAR (03),                         
          2 STICK_COMMA2_OT          CHAR (01),                         
          2 STICK_GROUP4_OT          CHAR (03);                         
                                                                        
    STICK_GROUP1_OT = STICK_GROUP1_IN;                                  
    STICK_HYPEN1_OT = '-';                                              
    STICK_GROUP2_OT = STICK_GROUP2_IN;                                  
    STICK_COMMA1_OT = ',';                                              
    STICK_GROUP3_OT = STICK_GROUP3_IN;                                  
    STICK_COMMA2_OT = ',';                                              
    STICK_GROUP4_OT = STICK_GROUP4_IN;                                  
                                                                        
 END EXPAND_STICKER_NUMBER;                                             
                                                                        
 %PAGE;                                                                 
 /********************************************************************/ 
 /*                                                                  */ 
 /*  ENDJOB:                                                         */ 
 /*                                                                  */ 
 /********************************************************************/ 
                                                                        
    ENDJOB:                                                             
                                                                        
    PUT SKIP LIST ('NORMAL JOB TERMINATION  ** S7203057 ** ');          
    PUT SKIP LIST (HYPEN_FORMAT);                                       
    PUT SKIP LIST (' ');                                                
                                                                        
    PUT SKIP LIST ('RECORD COUNT----------' ³³ RECORD_COUNT);           
    PUT SKIP LIST (' ');                                                
                                                                        
    PUT SKIP LIST ('ADJUST COUNT----------' ³³ ADJUST_COUNT);           
    PUT SKIP LIST (' ');                                                
    PUT SKIP LIST ('OLD IN17 COUNT--------' ³³ OLDIN17_COUNT);          
    PUT SKIP LIST (' ');                                                
    PUT SKIP LIST ('OLD IN18 COUNT--------' ³³ OLDIN18_COUNT);          
    PUT SKIP LIST (' ');                                                
                                                                        
                                                                        
    PUT EDIT ('EOJ')(SKIP(3),A);                                        
                                                                        
    CLOSE FILE (FINREPT),                                               
          FILE (OLDIN17),                                               
          FILE (OLDIN18),                                               
          FILE (ADJLIST),                                               
          FILE (FINRPRT);                                               
                                                                        
                                                                        
 END PRTFINR;                                                           
                                                                        
