       IDENTIFICATION DIVISION.
       PROGRAM-ID. WC47CLLR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

        01 DUMMY PIC X(4).

       PROCEDURE DIVISION.

         CALL "TEST42b" USING DUMMY.
         CALL "TEST42c" USING DUMMY.

       END PROGRAM WC47CLLR.
