//M4018B JOB (20,FB3),'I',
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
// NOTIFY=&SYSUID,
// REGION=0M
//*
//*
//DFSE10 JCLLIB ORDER=(VENDOR.PROCLIB,DFSE10.PROCLIB)
//*
//        SET PSB=P4018B
//        SET DBD=DBD4018A
//        SET PGM=P4018B
//        SET HLQ=INNOWAK.TEST
//*
//*
//*
//EXECPGM1 EXEC PGM=DFSRRC00,
//             PARM='BMP,&PGM.,&PSB.,,,,,,,,,,N,N'
//*