//M4782A JOB (20,FB3),'I',
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
// NOTIFY=&SYSUID,
// REGION=0M
//*
//STEP01   EXEC PGM=DFSRRC00,
//             COND=(5,LT),
//             PARM='ULU,MIN4782A'
//IMS       DD DSN=IMSDD.WMIN.4782A,
//             DISP=SHR
