       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN2777_Perform1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
         PERFORM 2000-PROCESSING-PARA
         UNTIL WS-EOF-LICENSE-ACTIVITY = 'Y' OR
         WS-FILL-AREA2 = HIGH-VALUES
