       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN2777_Perform2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIELD1             PIC XX.
         88    VAR1  VALUE('NO').
       PROCEDURE DIVISION.
         PERFORM PROCEDURE UNTIL VAR1
               MOVE 'NO' TO FIELD1
         END-PERFORM