  P4030F: PROC(IO_PTR_PCB, DB_PTR_MAST) OPTIONS(MAIN);
  
    DCL IO_PTR_PCB POINTER;
    DCL DB_PTR_MAST POINTER;
    DCL FUNC_PTR POINTER;
    DCL FUNC_PTR1 POINTER;
    DCL DET_SEG_IO_AREA CHAR(100);
    DCL AIB_MASK CHAR(120);
    
    DCL 1 DLI_FUNC1,
          2 FUNC_GU   CHAR(4) INIT('GU  '),
          2 FUNC_GN   CHAR(4) INIT('XXXX');
    DCL 1 DLI_FUNC2,
          2 FUNC_GNP  CHAR(4) VALUE('GNP '),
          2 DLI_NESTED,
            3 FUNC_ISRT CHAR(4) VALUE('ISRT');
    DCL FUNC_REPL CHAR(4) BASED INIT('REPL');
    DCL 1 DLI_FUNC4 BASED,
          2 FUNC_GHN CHAR(4) INIT('GHN '); 
  
    CALL PLITDLI (3, FUNC_GU, DB_PTR_MAST, DET_SEG_IO_AREA);
    CALL AIBTDLI (3, FUNC_GNP, AIB_MASK, DET_SEG_IO_AREA);
    
    CALL MY_PROC;
    
    MY_PROC: PROC;
      DCL 1 DLI_FUNC3,
            2 FUNC_GN   CHAR(4) VALUE('GN  '),
            2 DB_PTR_MAST POINTER;
      DCL SOME_PTR POINTER INIT(ADDR(DB_PTR_SNCD));
      
      CALL PLITDLI (3, DLI_FUNC9.FUNC_DLET, DB_PTR_MISSING, DET_SEG_IO_AREA);
      
      CALL MY_PROC_1;
      
      MY_PROC_1: PROC;
        CALL PLITDLI (3, DLI_FUNC3.FUNC_GN, IO_PTR_PCB, DET_SEG_IO_AREA);
        CALL CEETDLI (3, FUNC_PTR->FUNC_REPL, DLI_FUNC3.DB_PTR_MAST, DET_SEG_IO_AREA);
        CALL PLITDLI (3, FUNC_PTR1->FUNC_PTR->FUNC_REPL, SOME_PTR->DB_PTR_MAST, DET_SEG_IO_AREA);
      END MY_PROC_1;
    END MY_PROC;
   
  END;