 PROC1: proc OPTIONS(MAIN);

   /* Add variable declarations */
   DECLARE WSNUM1 FIXED DEC(9) VALUE(10);
   DECLARE WSNUM2 FIXED DEC(9) VALUE(10);
   DECLARE WSNUM3 FIXED DEC(9) VALUE(10);
   DECLARE WSNUMD FIXED DEC(9) VALUE(10);
   DECLARE WSNUME FIXED DEC(9) VALUE(10);
   DECLARE ABCD FIXED DEC(9) VALUE(10);
   DECLARE AB FIXED DEC(9) VALUE(10);
   DECLARE ABC FIXED DEC(9) VALUE(10);
  %INCLUDE ADD;
    WSNUM3 = ABCD + WSNUME;
 end PROC1;
