  /* Manual test file for Control flow GOTO statement  */ 
 CTL026A: PROC OPTIONS(MAIN);
 
    DECLARE I FIXED DECIMAL(1) INIT(1) STATIC;
    DECLARE J CHAR(1) INIT('2');
    DECLARE LABEL1 LABEL;
    
    IF (I = 1)
       THEN
        IF (I = 2)
         THEN
          IF (I = 3)
           THEN 
            IF (I = 4)
             THEN
              BEGIN;
               I = I + 1;
              END;
         ELSE
          IF ( I = 1)
           THEN
            I = I + 1;
           ELSE
            I = I + 1;         
    ELSE
     BEGIN;
      IF (I = 1)
       THEN
        IF (I = 2)
         THEN
          IF (I = 3)
           THEN 
            IF (I = 4)
             THEN
              BEGIN;
               I = I + 1;
              END;
          END;       

 END CTL026A;

