  /* Manual test file for Control flow SELECT statement  */ 
 CTL018A: PROC OPTIONS(MAIN);

    DCL 1 GROUP,
          2 FXD_LEFT FIXED DECIMAL(1) INIT(9),
          2 FXD_RIGHT FIXED DECIMAL(2,1) INIT(9.9);
    DCL RESULT BIT(1) INIT(1B);
    
    /* Test case for nested SELECT and OTHERWISE */
    PUT SKIP LIST ('RESULT IS', RESULT);
    SELECT (RESULT) ;   
    WHEN (FXD_LEFT >= FXD_RIGHT)
     BEGIN; 
         RESULT = (FXD_LEFT = FXD_RIGHT);
         PUT SKIP LIST('FXD_LEFT >= FXD_RIGHT', RESULT);
     END; 
    WHEN (FXD_LEFT < FXD_RIGHT)
     BEGIN; 
         RESULT = (FXD_LEFT < FXD_RIGHT);
         PUT SKIP LIST('FXD_LEFT < FXD_RIGHT', RESULT);
     END;  
    WHEN (FXD_LEFT <= FXD_RIGHT) PUT SKIP LIST('FXD_LEFT <= FXD_RIGHT');
    WHEN (FXD_LEFT ¬< FXD_RIGHT) PUT SKIP LIST('FXD_LEFT ¬< FXD_RIGHT');  
    WHEN (FXD_LEFT ¬> FXD_RIGHT) PUT SKIP LIST('FXD_LEFT ¬> FXD_RIGHT');
    WHEN (FXD_LEFT <> FXD_RIGHT) PUT SKIP LIST('FXD_LEFT <> FXD_RIGHT');
    WHEN (FXD_LEFT ¬= FXD_RIGHT) PUT SKIP LIST('FXD_LEFT ¬= FXD_RIGHT');
    WHEN (FXD_LEFT = FXD_RIGHT)
     BEGIN; 
         RESULT = (FXD_LEFT = FXD_RIGHT);
         PUT SKIP LIST('FXD_LEFT = FXD_RIGHT', RESULT);
     END; 
    OTHERWISE PUT SKIP LIST('NO MATCH FOUND');
    END;
    
    PUT SKIP LIST('');
    PUT SKIP LIST('');
    PUT SKIP LIST('GROUP');
    PUT SKIP LIST('Control Flow SELECT : GROUP    ******');
    PUT SKIP LIST('');
    CALL DUMP(ADDR(GROUP),SIZE(GROUP));   
            
    PUT SKIP LIST('');
    PUT SKIP LIST('');
    PUT SKIP LIST('RESULT');
    PUT SKIP LIST('Control Flow IF : RESULT    ******');
    PUT SKIP LIST('');
    CALL DUMP(ADDR(RESULT),SIZE(RESULT)); 
             
   %INCLUDE BAS001A;
 END CTL018A;