  /* Manual test file for Control flow SELECT statement  */ 
 CTL021A: PROC OPTIONS(MAIN);

    DECLARE RESULT BIT(1) INIT(1B);
        
    /* Test case for SELECT with enabled condition */
    SELECT (RESULT); 
    WHEN (RESULT)
     CALL LABEL1;
    OTHERWISE PUT SKIP LIST(' NO MATCH FOUND');
    END;

 END CTL021A;

 LABEL1: PROC ;
       DECLARE X CHAR(2) INIT('AB');
       DECLARE Z FIXED DECIMAL(1) INIT(-3);
       
       (NOSTRINGRANGE):
       BEGIN;
           X = SUBSTR(X,LENGTH(X)+1 , Z);
           PUT SKIP LIST(' INSIDE STRINGRANGE DISABLED', X);
       END;       
       (STRINGRANGE):
       BEGIN;
           X = SUBSTR(X,LENGTH(X)+1 , Z);
           PUT SKIP LIST(' INSIDE STRINGRANGE ENABLED', X);
       END; 
 END; 