 CTL007A: PROCEDURE OPTIONS(MAIN);

     DCL FXD1 FIXED DECIMAL(1) INIT(9);
   DCL FXD2 FIXED DECIMAL(2,1) INIT(9.9);
   DCL FXD3 FIXED DECIMAL(4,2) INIT(9.9);
   
   DCL FXD4A(3) FIXED DECIMAL(2,1) INIT(9.9,9.8,9.0);
   DCL FXD5A(3) FIXED DECIMAL(2) INIT(9,9,9);
   DCL FXD6A(3) FIXED DECIMAL(2,1) INIT(9.7,9.8,9.0);
   
   DCL BT1 BIT(1) INIT('1');
   DCL BT2 BIT(7) INIT('1000000');
   DCL BT3 BIT(8) INIT('10000001');
   
   DCL BT4A(3) BIT(3) ALIGNED INIT('100','101','100');
   DCL BT5A(3) BIT(2) ALIGNED INIT('10','11','10');
   DCL BT6A(3) BIT(1) ALIGNED INIT('1','1');

   DCL ALPHA1 CHARACTER(1) INIT('A');
   DCL ALPHA2 CHARACTER(2) INIT('AB');
   DCL ALPHA3 CHARACTER(7) INIT('A      ');
   
   DCL ALPHA4A(3) CHARACTER(1) INIT('A','B','C');
   DCL ALPHA5A(3) CHARACTER(2) INIT('AB','B ','C ');
   DCL ALPHA6A(3) CHARACTER(7) INIT('A      ','B      ','C     C');
   
   DCL FXB1 FIXED BINARY(5) INIT(9);
   DCL FXB2 FIXED BINARY(9) INIT(99);
   DCL FXB3 FIXED BINARY(9) INIT(9);
   
   DCL FXB4A(3) FIXED BINARY(5) INIT(9,4,5);
   DCL FXB5A(3) FIXED BINARY(9) INIT(9,3,4);
   DCL FXB6A(3) FIXED BINARY(9) INIT(0,3,4);
   
   PUT SKIP LIST('START BIT');
   PUT SKIP LIST('RESULTS');   	
   IF BT1 <> BT2 THEN PUT SKIP LIST("BT1 <> BT2");
   ELSE PUT SKIP LIST("BT1 = BT2");
   IF BT1 <> BT3 THEN PUT SKIP LIST("BT1 <> BT3");
   ELSE PUT SKIP LIST("BT1 = BT3");   
   IF BT2 <> BT3 THEN PUT SKIP LIST("BT2 <> BT3");
   ELSE PUT SKIP LIST("BT2 = BT3");   
   
   PUT SKIP LIST('START FIXED DECIMAL');
   PUT SKIP LIST('RESULTS');  
    
   IF FXD1 <> FXD2 THEN PUT SKIP LIST("FXD1 <> FXD2");
   ELSE PUT SKIP LIST("FXD1 = FXD2");
   IF FXD1 <> FXD3 THEN PUT SKIP LIST("FXD1 <> FXD3");
   ELSE PUT SKIP LIST("FXD1 = FXD3");
   IF FXD2 <> FXD3 THEN PUT SKIP LIST("FXD2 <> FXD3");
   ELSE PUT SKIP LIST("FXD2 = FXD3");

   PUT SKIP LIST('START FIXED BINARY');
   PUT SKIP LIST('RESULTS');
   
   IF FXB1 <> FXB2 THEN PUT SKIP LIST("FXB1 <> FXB2");
   ELSE PUT SKIP LIST("FXB1 = FXB2");
   IF FXB1 <> FXB3 THEN PUT SKIP LIST("FXB1 <> FXB3");
   ELSE PUT SKIP LIST("FXB1 = FXB3");
   IF FXB2 <> FXB3 THEN PUT SKIP LIST("FXB2 <> FXB3");
   ELSE PUT SKIP LIST("FXB2 = FXB3");

   PUT SKIP LIST('START CHARACTER');
   PUT SKIP LIST('RESULTS');
   
   IF ALPHA1 <> ALPHA2 THEN PUT SKIP LIST('ALPHA1 <> ALPHA2');   
   ELSE PUT SKIP LIST("ALPHA1 = ALPHA2");
   IF ALPHA1 <> ALPHA3 THEN PUT SKIP LIST('ALPHA1 <> ALPHA3');   
   ELSE PUT SKIP LIST("ALPHA1 = ALPHA3");
   IF ALPHA2 <> ALPHA3 THEN PUT SKIP LIST('ALPHA2 <> ALPHA3');   
   ELSE PUT SKIP LIST("ALPHA2 = ALPHA3");
      
   PUT SKIP LIST('START FIXED DECIMAL ARRAY');
   PUT SKIP LIST('RESULTS');

   PUT SKIP LIST("FXD4A <> FXD5A");
   PUT SKIP LIST(FXD4A <> FXD5A);
   PUT SKIP LIST("FXD4A <> FXD6A");
   PUT SKIP LIST(FXD4A <> FXD6A);
   PUT SKIP LIST("FXD5A <> FXD6A");
   PUT SKIP LIST(FXD5A <> FXD6A); 
   
   PUT SKIP LIST('START FIXED BINARY ARRAY');
   PUT SKIP LIST('RESULTS');

   PUT SKIP LIST("FXB4A <> FXB5A");
   PUT SKIP LIST(FXB4A <> FXB5A);
   PUT SKIP LIST("FXB4A <> FXB6A");
   PUT SKIP LIST(FXB4A <> FXB6A);
   PUT SKIP LIST("FXB5A <> FXB6A");
   PUT SKIP LIST(FXB5A <> FXB6A); 

   PUT SKIP LIST('START CHARACTER ARRAY');
   PUT SKIP LIST('RESULTS');

   PUT SKIP LIST("ALPHA4A <> ALPHA5A");
   PUT SKIP LIST(ALPHA4A <> ALPHA5A);
   PUT SKIP LIST("ALPHA4A <> ALPHA6A");
   PUT SKIP LIST(ALPHA4A <> ALPHA6A);
   PUT SKIP LIST("ALPHA5A <> ALPHA6A");
   PUT SKIP LIST(ALPHA5A <> ALPHA6A); 

   PUT SKIP LIST('START BIT ARRAY');
   PUT SKIP LIST('RESULTS');

   PUT SKIP LIST("BT4A <> BT5A");
   PUT SKIP LIST(BT4A <> BT5A);
   PUT SKIP LIST("BT4A <> BT6A");
   PUT SKIP LIST(BT4A <> BT6A);
   PUT SKIP LIST("BT5A <> BT6A");
   PUT SKIP LIST(BT5A <> BT6A);

   %INCLUDE BAS001A;
  
 END CTL007A;
