//JOB1 JOB(14300,211), 'UNLOAD TABLE',
//			CLASS=P,
//			MSGCLASS=Y
/*JOBPARM SYSAFF=ANY
//*
//STEP01 EXEC PROC1,
//			TABLE='JOB1TABLE',
//			UNLOAD=UNLOAD