//JOB1 JOB(14300,211), 'UNLOAD TABLE',
//			CLASS=P,
//			MSGCLASS=Y
/*JOBPARM SYSAFF=ANY
//*
// SET PGM#01=JOB2TABLE
//STEP01 EXEC PROC1,
//			TABLE=&PGM#01,
//			UNLOAD=UNLOAD
