//PROC1 PROC DB2LVL='SYS4.DB2',
//			PARMLIB-'VPIS.PARMLIN',
//			TABLE=DUMMY,
//			UNLOAD=UNLOAD
//*
//*
//PSTEP1 EXEC PGM=IEFBR14
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=H
//DD01	   DD DSN=&UNLOAD..&TABLE
//*
