DEFINE DATA

LOCAL
1 #KEY (A9)

1 #KEY-FROM (A9)
1 REDEFINE #KEY-FROM
  2 KEY-AA-1 (A1)
  2 KEY-AB-1 (A8)
1 #KEY-TO (A9)
1 REDEFINE #KEY-TO
  2 KEY-AA-1 (A1)
  2 KEY-AB-1 (A8)

1 #KEY-LONG-FROM (A10)
1 REDEFINE #KEY-LONG-FROM
  2 KEY-AA-1  (A1)
  2 KEY-AB-1  (A8)
  2 TOO-MANY (A1)
1 #KEY-LONG-TO (A10)
1 REDEFINE #KEY-LONG-TO
  2 KEY-AA-1  (A1)
  2 KEY-AB-1  (A8)
  2 TOO-MANY (A1)

1 MY-VIEW VIEW DDM0020
  2 AA-1 (A1)
  2 AB-1 (A8)
END-DEFINE

#KEY-FROM := #KEY-TO := #KEY

FIND NUMBER MY-VIEW WITH #KEY-FROM = "1200002100000003P" THRU "1200002100000007P"
    WRITE  NOTITLE NOHDR 'END'
END
