DEFINE DATA
LOCAL
1 VEHIC-VIEW VIEW OF VEHICLES
  2 MAKE
  2 YEAR
END-DEFINE
*
READ (30) VEHIC-VIEW
END-ALL
SORT BY MAKE YEAR USING KEY
  WRITE NOTITLE NOHDR MAKE YEAR
END-SORT
END
