DEFINE DATA
LOCAL
1 HIST-VIEW VIEW MEE4579D
  2 D-KNR-TNR-FAP-SUCHBEGRIFF-GDAT(1:1)
END-DEFINE

FORMAT (1) PS=0

WRITE (1) NOTITLE NOHDR 'Start'

RESET HIST-VIEW

HISTOGRAM HIST-VIEW D-KNR-TNR-FAP-SUCHBEGRIFF-GDAT
  WRITE (1) '=' HIST-VIEW
END-HISTOGRAM

WRITE (1) NOTITLE NOHDR 'End'

END