DEFINE DATA
LOCAL
1 #A (A20)
END-DEFINE

DEFINE WORK FILE 2 'C:\temp\mee4338b.txt' TYPE 'ASCII'

#A := *PROGRAM
WRITE WORK FILE 2 #A

READ WORK FILE 1 ONCE #A

READ WORK FILE 1 #A
	WRITE WORK FILE 2 #A
END-WORK

WRITE WORK FILE 2 #A

END
