DEFINE DATA        
LOCAL                                          
1 #VARR1 (A50/1:50,1:100,1:100) INIT ALL <'A'>                            
1 #NUM     (N7)                                                         
END-DEFINE                                                           
*                                                                       
FOR #NUM 1 TO 500                                                          
WRITE 'LOOP'
END-FOR                                          
WRITE 'END LOOP'
*                                                                       
                                                                  
END