000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID. ABEND.                                               00020000
000500 ENVIRONMENT DIVISION.                                            00050000
000600***************************************************************** 00060000
000700**   THIS PROGRAM IS USED TO ABNORMALLY TERMINATE A JOB.        * 00070000
000800**   IT DOES SO BY CALLING THE ROUTINE 'ILBOABN0' USING RETURN  * 00080000
001000** *                                                              00100000
001100***************************************************************** 00110000
001200/                                                                 00120000
001300***************************************************************** 00130000
001400**                                                              * 00140000
001500**                          L A S T     R E V I S E D           * 00150000
001600**            INT   D - E - S - C - R - I - P - T - I - O - N   * 00160000
001700**            --- --------------------------------------------- * 00170000
001901**                                                              * 00190100
002000***************************************************************** 00200000
002100 INPUT-OUTPUT SECTION.                                            00210000
002200 FILE-CONTROL.                                                    00220000
002300                                                                  00230000
002400 DATA DIVISION.                                                   00240000
002500 FILE SECTION.                                                    00250000
002600                                                                  00260000
002700                                                                  00270000
002800****************************************************************  00280000
002900 WORKING-STORAGE SECTION.                                         00290000
003000****************************************************************  00300000
003100*                                                                 00310000
003200 01  ABEND-CODE                  PIC S9(04) COMP VALUE +3000.     00320000
003300                                                                  00330000
003400                                                                  00340000
003500 PROCEDURE DIVISION.                                              00350000
003600                                                                  00360000
003700     CALL 'ILBOABN0' USING ABEND-CODE.                            00370000
003800                                                                  00380000
