//JOBNAME  JOB (051000,A30),'UCF ASSET SYNC',                                  
//           CLASS=A,MSGCLASS=Y                                                 
//*                                                                             
//JOBSTEP  EXEC PROCNAME                                                       
