//PROCNAME PROC
//PROCSTP1 EXEC PGM=TESTCBL                                                    
//*                                                                             
//PROCSTP2 EXEC PGM=ABEND
//*