//JOB_B1  JOB 000,CLASS=P,MSGCLASS=C                                    00001*24
/*JOBPARM L=1                                                           00002*23
//*+JBS BIND DB2P.DBP4                                                  00003*23
//*            ** RUN ON SYSF MACHINE **                                00004*23
//*            ** REVERIFY MEMBERSHIP AND FUND EXPENSED        **       00005*23
//*            **      OF PAID CLAIMS -CYC56-                  **       00006*23
//STEP001  EXEC PROC1,                                                  00007*23
//             DSN1='PRODREN.CYC56.ACTIVE.FILE',                        00008*23
//             GHPROD=GHPROD                                            00009*23
//*            ** CHECK FOR  EMPTY FILES         **                     00010*23
//CHKFORRC IF  (STEP001.UT939.RC=0) THEN                                00011*36
//STEP010  EXEC PROC2,                                                  00012*23
//             DCB='(RECFM=FB)',                                        00013*23
//             DISPI='OLD',                                             00014*23
//             DISPO='(NEW,CATLG,DELETE)',                              00015*23
//             GHDATA=GHDATA,                                           00016*23
//             GHPROD=GHPROD,                                           00017*23
//             MEMA=RED6212,                                            00018*23
//             SORTCYL='(CYL,(90))',                                    00019*23
//             SORTIN1='PRODREN.M.CYC56.RE618.FILE.UNSETL',             00020*23
//             SORTIN2='PRODREN.M.CYC56.RE618.FILE.SPLIT',              00021*23
//             SORTOUT='PRODREN.M.CYC56.RE618.SORTED',                  00022*23
//             SPACE=,                                                  00023*23
//             UNIT=TAPE                                                00024*35
//*            ** SORT RE618 FILE                              **       00025*23
//STEP020  EXEC PROC3,                                                  00026*23
//             CYCLE=M.CYC56,                                           00027*23
//             DMCLBT=BTCHRE62,                                         00028*23
//             GHPROD=GHPROD,                                           00029*23
//             IDMS=IDMS,                                               00030*23
//             PROD=PROD,                                               00031*23
//             PRODREN=PRODREN,                                         00032*23
//             RE6212=RE6212,                                           00033*23
//             SET=56,                                                  00034*23
//             UNTCLMB='TAPE'                                           00035*23
//*            ** ASSIGN RULE PROVIDER                         **       00036*23
//CHKFORRC ENDIF                                                        00409*23
