/*PRIORITY 9
//P442285F JOB (00000203,D529911),'D52 TXIRP P442285F M',
//  MSGLEVEL=1,CLASS=J,REGION=2M,TIME=10,MSGCLASS=R,USER=PEXP
/*JOBPARM T=180,L=200,R=200

//PRG EXEC PGM=PURGETABLE,PARM="F0504"
//OP OUTPUT DEFAULT=YES,JESDS=ALL,
//   TITLE=' DAILY TXIRP MVDIDAT INQ COLLECTION ',
//   BUILDING='VTR - IRP BRANCH - BLDG # 1 - 2ND FLOOR',
//   DEPT='          IRP BRANCH',
//   ADDRESS=('  BLDG # 1 - 2ND FLOOR ')

//DROPFILE EXEC PGM=IEFBR14
//SYSPRINT  DD SYSOUT=(*,,STND)
//SYSIN     DD DUMMY
//DROP1     DD DISP=(MOD,DELETE,DELETE),UNIT=SYSDA,SPACE=(TRK,(1)),
//             DSN=D52.EXP.P442285.MVDIDAT.SRTED
//DROP2     DD DISP=(MOD,DELETE,DELETE),UNIT=SYSDA,SPACE=(TRK,(1)),
//             DSN=D52.EXP.P442285.EXPLFILE
//DROP3     DD DISP=(MOD,DELETE,DELETE),UNIT=SYSDA,SPACE=(TRK,(1)),
//             DSN=D52.EXP.IMPORT.P442285.EXPLFILE

//SEEEXP   EXEC PGM=SYNCSORT
//SYSUDUMP DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SORTMSG  DD  SYSOUT=*
//SYSLST   DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SORTIN   DD  DISP=OLD,DSN=D52.EXP.IMPORT.P442285.EXPLFILE
//SORTOUT  DD  SYSOUT=(*,,STND),
//             DCB=(LRECL=133,BLKSIZE=13300,RECFM=FBA)
//SYSIN    DD  *
 SORT FIELDS=COPY
 OUTREC FIELDS=(001:C' XL=',
                005:001,03,
                009:004,06,
                016:010,09,
                026:019,06,
                033:025,03,
                037:079,17,
                055:028,07,
                063:035,04,
                068:039,02,
                071:198,06,
                078:192,06,
                085:204,01,
                087:055,02,
                090:041,04,
                095:045,10,
                107:057,20)


//SORTIF  EXEC PGM=SORT,REGION=750K,PARM='CORE=MAX'
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR
//SYSOUT   DD  SYSOUT=(*,,STND)
//SYSUDUMP DD  SYSOUT=(*,,STND),DEST=LOCAL
//SORTOUT  DD  UNIT=SYSDA,SPACE=(CYL,(600,15),RLSE),DISP=(NEW,CATLG),
//             DCB=(LRECL=500,BLKSIZE=27500,RECFM=FB),
//             DSN=D52.EXP.P442285.MVDIDAT.SRTED
//SORTIN   DD  DISP=OLD,DSN=D52.EXP.IMPORT.MVDIDAT.ARCHIVE,
//             DCB=(LRECL=450,BLKSIZE=18900,RECFM=FB)
//         DD  DISP=OLD,DSN=D52.EXP.IMPORT.MVDIDAT.ACCUMX,
//             DCB=(LRECL=450,BLKSIZE=18900,RECFM=FB)
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,55)
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,55)
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,55)
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,55)
//SORTWK05 DD  UNIT=SYSDA,SPACE=(CYL,55)
//SORTWK06 DD  UNIT=SYSDA,SPACE=(CYL,55)
//SORTWK07 DD  UNIT=SYSDA,SPACE=(CYL,55)
//SYSIN    DD  DISP=SHR,DSN=D52.EXP.CX10.CONTROL.PDS(S442288P)

//CONVEXP  EXEC PGM=P442285F,REGION=8M
//STEPLIB   DD DSN=D59.PROD,DISP=SHR
//          DD DSN=D59.TEMP.PROD,DISP=SHR
//          DD DSN=SYS1.SCEERUN,DISP=SHR
//          DD DSN=D59.PROD,DISP=SHR
//SYSPRINT  DD SYSOUT=(*,,STND)
//SYSERR    DD SYSOUT=(*,,STND)
//SYSOUT    DD DUMMY,
//             DCB=(LRECL=133,BLKSIZE=13300,RECFM=FB)
//SYSDBOUT  DD SYSOUT=(*,,STND)
//ABNLENAB  DD SYSOUT=(*,,STND)
//ABENDAID  DD SYSOUT=(*,,STND)
//SYSUDUMP  DD SYSOUT=(*,,STND)
//SYSABOUT  DD SYSOUT=(*,,STND)
//OLDEXPIF  DD DSN=D52.EXP.P442285.MVDIDAT.SRTED,DISP=(OLD,DELETE)
//NEWEXPLC  DD UNIT=SYSDA,SPACE=(CYL,(500,250),RLSE),DISP=(NEW,CATLG),
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),
//             DSN=D52.EXP.IMPORT.P442285.EXPLFILE

