//M4018A JOB (20,FB3),'I',
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
// NOTIFY=&SYSUID,
// REGION=0M
//*
//*
//DFSE10 JCLLIB ORDER=(VENDOR.PROCLIB,DFSE10.PROCLIB)
//*
//        SET PSB=PSB4030A
//        SET PGM=P4030A
//*
//*
//*
//EXECPGM1 EXEC PGM=DFSRRC00,
//             PARM='DLI,&PGM.,&PSB.,,,,,,,,,,N,N'
//*