 P4030H: PACKAGE EXPORTS(EXTPRC2);

   EXTPRC2: PROC(IO_PTR_PCB,DB_PTR_MAST,DB_PTR_SCND,DB_PTR_XXX);
     DCL IO_PTR_PCB POINTER;
     DCL DB_PTR_MAST POINTER;
     DCL DB_PTR_SCND POINTER;
     DCL DB_PTR_XXX POINTER;
     %INCLUDE FUNC;
     
     CALL CEETDLI (3, FUNC_GN, IO_PTR_PCB, DET_SEG_IO_AREA);
     
     %INCLUDE IMSCALL;
     
     CALL PLITDLI (3, FUNC_GNP, DB_PTR_XXX, DET_SEG_IO_AREA);
   END EXTPRC2;

 END P4030H;