 DEAD1: PACKAGE EXPORTS(NOTDEAD1);

 NOTDEAD1: PROC(PARAM1,PARAM2);
   DCL PARAM1 CHAR(10);
   DCL PARAM2 FIXED BINARY(31);
   
   PUT SKIP LIST('IN EXT PROC');
   PUT SKIP LIST(PARAM1);
   PUT SKIP LIST(PARAM2);
   PARAM1 = 'MODIFIED';
   CALL CREATURE;
   SCHROEDINGERSCAT: PROC;
      PUT SKIP LIST(PARAM2);
   END SCHROEDINGERSCAT;
 END NOTDEAD1;
 
CREATURE: PROC;
   DCL PARAM1 CHAR(10);
   DCL PARAM2 FIXED BINARY(31);
   
   PUT SKIP LIST('IN EXT PROC');
   PUT SKIP LIST(PARAM1);
   PUT SKIP LIST(PARAM2);
   PARAM1 = DORIANGRAY(1,2,3);
   CALL SCHROEDINGERSCAT;
   SCHROEDINGERSCAT: PROC;
      PUT SKIP LIST(PARAM2);
   END SCHROEDINGERSCAT;
END CREATURE;

   DORIANGRAY: PROC (U,V,W)
               returns (bin float(21));
      PUT SKIP LIST(PARAM2);
      RIP: PROC (U,V,W)
               returns (bin float(21));
   PUT SKIP LIST(PARAM1);
     END RIP;
   END DORIANGRAY;
   
   NOOOOOOO: PROC (U,V,W)
               returns (bin float(21));
      PUT SKIP LIST(PARAM2);
         PUT SKIP LIST(PARAM2);
         NESTED4: PROC;
            PUT SKIP LIST(PARAM2);
         END NESTED4;
   END NOOOOOOO;

 END DEAD1;
  