//MGOJOB1 JOB ,XXXXX,CLASS=J                                            00001**2    
//***************************************************************       00068   
//STEP050 EXEC PGM=MGOCOMP2                                                    
//SYSDUMP  DD   SYSOUT=*                                                        
//SYSOUT   DD   SYSOUT=*                                                        
//SYSPRINT DD   SYSOUT=*                                                        
//INPUT    DD DSN=WORK.MGOFILE1,                        
//            DISP=(OLD,DELETE,KEEP)                                            
//OUTPT    DD DUMMY,                                                            
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=80)                                
//***************************************************************       00068                                                                                                                                            00076   
//STEP100 EXEC PGM=MGOASM1                                                    
//SYSDUMP  DD   SYSOUT=*                                                        
//SYSOUT   DD   SYSOUT=*                                                        
//SYSPRINT DD   SYSOUT=*                                                        
//INPUT    DD DSN=WORK.MGOFILE1,                        
//            DISP=(OLD,DELETE,KEEP)                                            
//OUTPT    DD DUMMY,                                                            
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=80)                                
//***************************************************************       00068                                                                                                                                            00076   