DEFINE DATA
LOCAL
1 #VAR1 (P11.2)
1 #VAR2 (P11.2)
1 #VAR3 (P11.2)
1 #VAR4 (P11.2)
1 G-FC (A006)
END-DEFINE

DECIDE ON FIRST VALUE OF #VAR1
 	VALUE  '1'
 		WRITE NOTITLE '1'
 	VALUE  '2'
 		WRITE NOTITLE '2'
 	VALUE  '3'
 		WRITE NOTITLE '3'
	NONE
    	IGNORE
END-DECIDE

DECIDE
	ON
		FIRST
			VALUE
				OF
					#VAR2
 	VALUE  '1'
 		WRITE NOTITLE '1'
 	VALUE  '2'
 		WRITE NOTITLE '2'
 	VALUE  '3'
 		WRITE NOTITLE '3'
	NONE
    	IGNORE
END-DECIDE




DECIDE ON EVERY VALUE OF G-FC
      VALUE 'SKIPFC'
        REINPUT ' ' MARK *G-FC
      NONE VALUE
        IGNORE
END-DECIDE

DECIDE
	ON
		EVERY
			VALUE
				OF
					G-FC2
      VALUE 'SKIPFC'
        WRITE NOTITLE '4'
      NONE VALUE
        IGNORE
      ANY VALUE
        WRITE NOTITLE '5'
      ALL VALUE
        WRITE NOTITLE '6'
END-DECIDE




DECIDE ON
	FIRST
		VALUE
			OF
				#VAR2
 	VALUE  '1'
 		DECIDE ON
			EVERY
				VALUE
					OF
						G-FC
					VALUE 'SKIPFC'
						WRITE NOTITLE '7'
					ALL VALUE
						WRITE NOTITLE '8'
		END-DECIDE
 	VALUE  '2'
 		WRITE NOTITLE '9'
	NONE
 		DECIDE ON
			FIRST
				VALUE
					OF
						G-FC2
					ALL VALUE
						WRITE NOTITLE '10'
		END-DECIDE
END-DECIDE
END
