//MYJOB    JOB (TPRD,SHM),MSGCLASS=B,CLASS=B                            00010002
//*                                                                     00030000
//* THIS IS SOME JOB DESCRIPTION                                        00050000
//*                                                                     00060000
//   JCLLIB ORDER=(MY.PROCLIB)                                          00070001
//JOBLIB  DD  DISP=SHR,DSN=SYS1.SCEERUN                                 00100000
//         DD  DSN=MY.LOADLIBB,DISP=SHR                                 00110000
//****************************************************************      00120100
//*  THIS IS SOME                                                       00121000
//*              ADDITIONAL JOB DESCRIPTION                             00122000
//****************************************************************      00311000
//*    STEP02 - PURGE PROGRAM                                           00312000
//****************************************************************      00313000
//STEP01   EXEC SMTHNG                                                  00320004
//         PGMLIB='MY.LOADLIBB'                       00330000
/*                                                                      00430000
//* SOME FINAL COMMENT