//MYJOB   JOB (YTPR,64006841),CLASS=B,MSGCLASS=B
//   JCLLIB ORDER=(MY.PROCLIB)
//*
//JOBLIB  DD  DISP=SHR,DSN=SYS1.SCEERUN
//         DD  DSN=MY.LOADLIBB,DISP=SHR
//OUTB1    OUTPUT  CLASS=*
//*
//**********************************************************************
//*                                                                    *
//*                                                                    *
//* BRIEF DESCRIPTION:  THIS JOB DOES SOME STUFF                       *
//*                                                                    *
//**********************************************************************
//*
//********************************************************************
//STEP01 EXEC DB21BTSL,UTILITY=DSNTEP2,CONDCDE=4,SUF='1B'
//SYSPRINT  DD  SYSOUT=*
//SYSIN    DD  *
 SOME SYSIN DATA
//*
//* SOME FINAL COMMENT