 BrBranch: PROCEDURE OPTIONS(MAIN);
	Dcl U fixed binary(10);
	Dcl V fixed binary(10);
	Dcl C1 value(148) fixed bin;
	Dcl C2 value(261) fixed bin;
 
	/* No candidate: only 1 FIELD_REFERENCE which is not from a Copybook */
	if (U > 10) then
		return (0);

	/* No candidate: only 1 FIELD_REFERENCE which is not from a Copybook */
	if (V > 10) then
		return (1);
	else
		return (2);

	/* No candidate: only 1 CONSTAT_REFERENCE which is not from a Copybook */
	if (C1 > 10) then
		return (0);

	/* Candidate: 2 FIELD_REFERENCEs */
	if (C1 > C2) then
		return (0);

	/* Candidate: 2 CONSTAT_REFERENCEs which are not from a Copybook */
	if (C1 > 10 & C2 > 10) then
		return (0);

	/* Candidate: 2 FIELD_REFERENCEs which are not from a Copybook */
	if (U + V > 10) then
		return (4);
	else
		return (5);
	
 END BrBranch;
