DEFINE DATA
LOCAL
1 #INT1 (I4) INIT <10>
1 #INT2 (I4) INIT <15>
1 #COUNTER (I2)

END-DEFINE

ADD 1 TO #COUNTER

SUBTRACT #INT1 FROM #INT2
SUBTRACT #INT2 FROM #INT1

END