DEFINE DATA LOCAL
1 EMPLOY-VIEW VIEW OF EMPLOYEES
  2 NAME
  2 ADDRESS-LINE  (A20/2)
1 #ARRAY    (A75/1:4)
1 #Z  (N3)
1 #X  (N2) INIT <1>
1 #Y        (N2) INIT <1>
END-DEFINE

PERFORM PRINT

DEFINE SUBROUTINE PRINT
  WRITE NOTITLE (AD=OI) #ARRAY(*)   
  ADD 1 TO #Y
  ADD #Z TO #X
  WRITE 'Iteration' #X
  ADD 1 TO #X
END-SUBROUTINE

END 