DEFINE DATA
LOCAL
1 #WF-LINE1 (A10)
1 #WF-LINE2 (A10)
1 #WF-LINE (A10)
END-DEFINE

READ WORK FILE 1 #WF-LINE1

END-WORK

WRITE WORK FILE 1 #WF-LINE2

READ WORK FILE 2 #WF-LINE
WRITE '#WF-LINE2' #WF-LINE2
WRITE '#WF-LINE1' #WF-LINE1

END-WORK

END
