DEFINE DATA         
  LOCAL 
    1 #Index1 (A1)
    1 PARAM2 (A1)
    1 PARAM3 (A1)
END-DEFINE
SUBTRACT PARAM2 FROM PARAM3
SUBTRACT PARAM3 FROM PARAM2
FOR #Index1 = 1 TO 10
	WRITE 'Iteration' #Index1
	CALL 'PROG1'
	CALLNAT 'SUB1'
END-FOR
WRITE 'PARAM3' PARAM3
WRITE 'PARAM' PARAM2
END