           10  MMRS-CURRENT-TIME-HHMMSSMS.
               15  MMRS-CURRENT-HOUR       PIC  9(2).
               15  MMRS-CURRENT-MINUTE     PIC  9(2).
               15  MMRS-CURRENT-SECOND     PIC  9(2).
               15  MMRS-CURRENT-MS         PIC  9(2).