       01  MMRS-COMMON-COBOL-DATE-FIELDS.
           
           COPY MMRS710G.
           COPY MMRS710H.

           10  MMRS-DIFF-GMT-FIELDS.
               15  MMRS-DIFF-GMT-NUM       PIC S9(4).