       IDENTIFICATION DIVISION.
       PROGRAM-ID. MODULEB.
       DATA DIVISION.
       LINKAGE SECTION.
        EXEC SQL
          INCLUDE MULTI_SCOPE_MODULEC
        END-EXEC
       PROCEDURE DIVISION.
       0000-INITIALIZE.
          DISPLAY 'MODULEB'.
