DEFINE DATA
LOCAL USING NATLDAA
LOCAL
  1 #VAR1 (A2)
  1 #VAR2 (A2)
  1 #VAR3 (A2)
PARAMETER USING NATPDAA
END-DEFINE

  PRINT #VAR2
  INCLUDE NATCCA "#VAR1"     "#VAR2"     "#VAR3"
  WRITE NOTITLE NOHDR #FLD1
  INCLUDE NATCCB
END