******** A
       IDENTIFICATION DIVISION.
       PROGRAM-ID. A.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
        01  W-SUBJECT-ID           PIC S9(9) COMP.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
       0000-INITIALIZE.
