       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM0001.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY EMP0001.
       COPY DPT0001.

       PROCEDURE DIVISION.
       BEGIN.
           IF EMPLOYEE-ID EQUAL TO SPACES
               MOVE '12345' TO EMPLOYEE-ID.
               MOVE 'John Doe' TO EMPLOYEE-NAME.
               MOVE '2500'  TO EMPLOYEE-SALARY.
               MOVE 'SALES' TO EMPLOYEE-DEPT.
               MOVE 'INDIA' TO ADDRESS-DTL OF CORRESPONDENCE.
               MOVE '1234567890' TO PHONE-NUMBER OF CORRESPONDENCE.
           END-IF.
       STOP RUN.
