       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN538UI3.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.

           COPY WMIN538UI4.

           GOBACK.
