DEFINE DATA
LOCAL
1 #FLD (A10)
1 #CURSOR (I4)
END-DEFINE

INPUT USING MAP 'WMIN1206M'
INPUT #FLD
INPUT 'CONSTANT VALUE' #FLD
INPUT WINDOW = 'MY-WND' '-' #FLD (AD=OI)
INPUT MARK #CURSOR #FLD
INPUT NO ERASE #FLD
INPUT WITH TEXT 'SOME TEXT (:1:)',#CURSOR #FLD

END
