       FD KSDSFILE RECORD CONTAINS 80 CHARACTERS.
       01  KSDSFILE-REC.
           05  PKEY                PIC X(6).
           05  INFO                PIC X(74).
