       IDENTIFICATION DIVISION.
       PROGRAM-ID. A.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT KSDSFILE ASSIGN TO  "KSDS"
               ORGANIZATION  IS  INDEXED
               ACCESS  MODE  IS  DYNAMIC
               RECORD  KEY   IS  PKEY
               FILE STATUS   IS  WS-FS.
       DATA DIVISION.
       FILE SECTION.
               COPY WMIN451B
       WORKING-STORAGE SECTION.
       01  MY-PROGRAM-NAME PIC X(10) VALUE 'A'.
       PROCEDURE DIVISION.
