//EZTTST JOB
//*    ************************************                             00001000
//*    * EZTTST - BLAH BLAH BLAH		  *                             00002000
//*    ************************************                             00003000
//JS040   EXEC PGM=DECSZ047,COND=(0,NE,JS020)
//STEPLIB  DD  DSN=DE.DE24AIEF.LOAD.PILOT,DISP=SHR
//         DD  DSN=SYS1.EASYPLUS,DISP=SHR
//         DD  DSN=SYS1.EZTOOLKT,DISP=SHR
//         DD  DSN=IMSVS.RESLIB,DISP=SHR
//POSTIN   DD  DSN=DE.DE24ACS.FCR.RESPONSE.TEMP,
//             DISP=(OLD,KEEP,KEEP)
//OUTFILE  DD  DSN=DE.DE24ACS.FCR.RESPONSE.HIVAL,
//             DISP=(NEW,CATLG,CATLG),UNIT=SYSDA,
//             SPACE=(CYL,(150,50),RLSE),
//             DCB=(RECFM=FB,LRECL=920,BLKSIZE=0)
//PROMAC   DD  DSN=SYS1.PROMAC,DISP=SHR
//EZTVFM   DD  UNIT=SYSDA,SPACE=(4096,(200,200),RLSE)
//PROVFM   DD  UNIT=SYSDA,SPACE=(4096,(200,200),RLSE)
//SYSPRINT DD  SYSOUT=*
//*
