       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACEEDIT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

       END PROGRAM ACEEDIT.

