//**********************************************************                    
//* THIS PROC WAS CREATED AND IS EXECUTED FROM JOB  Z38ZG235                    
//**********************************************************                    
//WMIN1669B JOB INIT='T',SYSOUT='(,)'                                           
//*                                                                             
//PS01     EXEC PROC=WMIN1669A,TIME=30  