       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN518C.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           PERFORM TESTPARA
           GOBACK.
       TESTPARA.
            WRITE  OUTPUT-RECORD
            INVALID KEY
            DISPLAY 'A'
            NOT INVALID KEY
            DISPLAY 'B'
            END-WRITE.
       UNREACHABLE.
            DISPLAY 'UNREACHABLE'
