//T446KADL JOB (00200091,N591265),'RTS DICKSO BDG6 501H',
//  MSGLEVEL=(1,1),TIME=99,CLASS=H,MSGCLASS=R
//*JOBPARM L=100,T=90
//*
//STEP03    	EXEC PGM=ADARUN
//*
//CNDSAMP JOB CLASS=6,NOTIFY=&SYSUID,COND=((10,LT,STP01),(10,GT,STP02))
//STP02    EXEC PGM=IEBGENER
