//T446KADL JOB (00200091,N591265),'RTS DICKSO BDG6 501H',
//  MSGLEVEL=(1,1),TIME=99,CLASS=H,MSGCLASS=R
//*
//IFSTEP    	IF (ABEND | STEP1.RC > 8) THEN
//STEP03    	EXEC PGM=ADARUN
//              ENDIF
