DB: 012 FILE: 011  - MEE4809A                         DEFAULT SEQUENCE: 
TYPE: ADABAS

T L DB Name                              F Leng  S D Remark
- - -- --------------------------------  - ----  - - ------------------------
P 1 AQ INCOME                                     
*      @UNSIGNED
  2 AS USGND_PCKD                        P    9   
  2 AT SGND_PCKD                         P    9   
P 1 AW LEAVE-BOOKED                               
*      @UNSIGNED
  2 AX USGND_NRC                         N    8   
  2 AY SGND_NRC                          N    8   
******DDM OUTPUT TERMINATED******