//MMRS711A JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A,RESTART=*
//*************************************************************************
//***** MMRS-M01  MAINFRAME MODERNIZATION REFERENCE SYSTEM
//*************************************************************************
//***** VSAM      DELETE AND DEFINE AIX FOR KSDS, ESDS
//***** VSAM      LISTCAT
//***** VSAM      PRINT DATA VIA AIX
//***** VSAM      BASE FILE HAS TO BE DEFINED WITH ATTRIBUTE NOREUSE
//***** VSAM      DCB IN //STEPREP1 DIFFERENT FOR MEE TO SUPPORT UTF-8
//*************************************************************************
//*
//STEPDEL  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
   DEL MMRS00C.AWA.VSAMK.AIX  ALTERNATEINDEX PURGE
   DEL MMRS00C.AWA.VSAME.AIX  ALTERNATEINDEX PURGE
//*
//STEPDEF EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE ALTERNATEINDEX (                                   -
               NAME(MMRS00C.AWA.VSAMK.AIX)                  -
               RELATE(MMRS00C.AWA.VSAMK)                    -
               KEYS(10 17)                                  -
               CYL(1 1)                                     -
               NONUNIQUEKEY                                 -
               UPGRADE )                                    -
         DATA (                                             -
               NAME(MMRS00C.AWA.VSAMK.AIX-D) )              -
         INDEX (                                            -
               NAME(MMRS00C.AWA.VSAMK.AIX-I) )              -
      CATALOG (CATALOG.USERAA)
  BLDINDEX INDATASET(MMRS00C.AWA.VSAMK)                     -
           OUTDATASET(MMRS00C.AWA.VSAMK.AIX)
  DEFINE PATH (NAME(MMRS00C.AWA.VSAMK.PATH)                 -
           PATHENTRY(MMRS00C.AWA.VSAMK.AIX) )

  DEFINE ALTERNATEINDEX (                                   -
               NAME(MMRS00C.AWA.VSAME.AIX)                  -
               RELATE(MMRS00C.AWA.VSAME)                    -
               KEYS(10 17)                                  -
               CYL(1 1)                                     -
               NONUNIQUEKEY                                 -
               UPGRADE )                                    -
         DATA (                                             -
               NAME(MMRS00C.AWA.VSAME.AIX-D) )              -
         INDEX (                                            -
               NAME(MMRS00C.AWA.VSAME.AIX-I) )              -
      CATALOG (CATALOG.USERAA)
  BLDINDEX INDATASET(MMRS00C.AWA.VSAME)                     -
           OUTDATASET(MMRS00C.AWA.VSAME.AIX)
  DEFINE PATH (NAME(MMRS00C.AWA.VSAME.PATH)                 -
           PATHENTRY(MMRS00C.AWA.VSAME.AIX) )

//*
//STEPPRT1 EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//MYVSAMK  DD  DISP=MOD,DSN=MMRS00C.AWA.VSAMK
//MYVSAMKP DD  DISP=MOD,DSN=MMRS00C.AWA.VSAMK.PATH
//MYVSAME  DD  DISP=MOD,DSN=MMRS00C.AWA.VSAME
//MYVSAMEP DD  DISP=MOD,DSN=MMRS00C.AWA.VSAME.PATH
//SYSIN    DD  *
  PRINT INFILE(MYVSAMK)
  PRINT INFILE(MYVSAMKP)
  PRINT INFILE(MYVSAME)
  PRINT INFILE(MYVSAMEP)
/*
//*
//STEPLST1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
   LISTCAT ENTRIES(MMRS00C.AWA.*) ALL
//*
//* ONLY IN MEE ENVIRONMENT
//STEPDEL  EXEC PGM=IEFBR14
//MYFXOUT DD DISP=(MOD,DELETE),SPACE=(TRK,(1,5)),
//             DSN=MMRS00C.AWA.VSAM.PRINT
//*
//STEPREP1 EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//MYVSAMK  DD  DISP=MOD,DSN=MMRS00C.AWA.VSAMK
//MYVSAMKP DD  DISP=MOD,DSN=MMRS00C.AWA.VSAMK.PATH
//MYVSAME  DD  DISP=MOD,DSN=MMRS00C.AWA.VSAME
//MYVSAMEP DD  DISP=MOD,DSN=MMRS00C.AWA.VSAME.PATH
//OUT      DD  DISP=(,CATLG),DSN=MMRS00C.AWA.VSAM.PRINT,
//             SPACE=(CYL,(1,5)),
//* MEE
//*             DCB=(FILETYPE=UTF8)
//* Z/OS
//             DCB=(RECFM=V,LRECL=84)
//SYSIN    DD  *
  REPRO INFILE(MYVSAMK) OUTFILE(OUT)
  REPRO INFILE(MYVSAMKP) OUTFILE(OUT)
  REPRO INFILE(MYVSAME) OUTFILE(OUT)
  REPRO INFILE(MYVSAMEP) OUTFILE(OUT)
/*
