       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

       DATA DIVISION.
          WORKING-STORAGE SECTION.
          01 WS-STUDENT-ID PIC 9(4) VALUE 1000.
          01 WS-STUDENT-NAME PIC A(15) VALUE 'Tim'.
          01 WS-STUDENT-AGE PIC 9(2) VALUE 3.

       PROCEDURE DIVISION.
          CALL 'WMIN10724UTIL' USING WS-STUDENT-ID, WS-STUDENT-NAME.
          DISPLAY 'Student Id : ' WS-STUDENT-ID
          DISPLAY 'Student Name : ' WS-STUDENT-NAME
          DISPLAY 'Student Age : ' WS-STUDENT-AGE
       STOP RUN.
