       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

       DATA DIVISION.
          WORKING-STORAGE SECTION.
          01 WS-STUDENT-CLASS PIC 9(4) VALUE 1000.
          COPY WMIN10724COPYBOOK.

       PROCEDURE DIVISION.
          DISPLAY 'Student Id : ' WS-STUDENT-ID
          DISPLAY 'Student Name : ' WS-STUDENT-NAME
          DISPLAY 'Student Age : ' WS-STUDENT-AGE
          DISPLAY 'Student Class : ' WS-STUDENT-CLASS
       STOP RUN.
