//TESTPROC  PROC IDMS=VAR1,
//             ENV=TEST
//PROCSTEP01    EXEC PGM=PROGRAM1,
//             REGION=2047M
//STEPLIB  DD  DSN=&IDMS..&ENV..LOADLIB,
//             DISP=SHR
//DUMMY    DD  DISP=SHR,
//             DSN=&IDMS..&ENV..DUMMY
//         PEND
