       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEREADWRITE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO INFILE.
           SELECT OUTPUT-FILE ASSIGN TO OUTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  INPUT-FILE.
       01  INPUT-RECORD.
           05 INPUT-FIELD PIC X(80).

       FD  OUTPUT-FILE.
       01  OUTPUT-RECORD.
           05 OUTPUT-FIELD PIC X(80).

       WORKING-STORAGE SECTION.
       01 WS-EOF-SWITCH PIC X VALUE 'N'.

       PROCEDURE DIVISION.
           OPEN INPUT INPUT-FILE.
           OPEN OUTPUT OUTPUT-FILE.

             PERFORM UNTIL WS-EOF-SWITCH = 'Y'
               READ INPUT-FILE
                  AT END
                     MOVE 'Y' TO WS-EOF-SWITCH
                  NOT AT END
                     MOVE INPUT-FIELD TO OUTPUT-FIELD
                     WRITE OUTPUT-RECORD
               END-READ
             END-PERFORM.

           CLOSE INPUT-FILE.
           CLOSE OUTPUT-FILE.

             STOP RUN.

