 Package_Demo: Package;
 dcl N fixed bin(15);
 PROC1: proc options (main);
  dcl Result fixed bin(31);
  NESTED_PROC: PROC;
   PUT SKIP LIST('INSIDE NESTED_PROC');
  END NESTED_PROC;
 end PROC1;
  PROC2: PROC;
   PUT SKIP LIST('INSIDE PROC2');
  END PROC2;
 end Package_Demo;