//TESTPARM PROC
//STEP040  EXEC PGM=SORT,COND=(0,NE,STEP030)
//SORTIN   DD DSN=DWDCARE&ENVID..CARER.FOURC.MLY.CRBI902A&NEWGEN,
//            DISP=SHR
//SORTOF01 DD DSN=&&TEMPHDR,
//            DISP=(,PASS,DELETE),
//            SPACE=(CYL,&SP902RX,RLSE)
