       01  StudentRec.
           88  EndOfSF      VALUE HIGH-VALUES.
           02  StudentNumber                PIC 9(7).
           02  StudentName                  PIC X(60).
           02  CourseCode                   PIC X(4).
           02  FeesOwed                     PIC 9(4).
           02  AmountPaid                   PIC 9(4)V99.