//BCATNDYN JOB
//*******************************************************
//** CATALOG INDIVIDUAL LINK EDIT DECKS SUPPORTING     **
//** THE COBOL NODYNAM COMPILE OPTION.                 **
//*******************************************************
//** REFER TO BCATDYNL FOR THE DYNAM EQUIVALENT.       **
//*******************************************************
//** CHANGE ALL OCCURRENCES OF '*/' TO './' TO CATALOG **
//** THE INDIVIDUAL MEMBERS USING IEBUPDTE.            **
//** MAKE ADDITIONAL CHANGES TO THIS JCL MEMBER AS     **
//** APPROPRIATE TO YOUR SITE.                         **
//*******************************************************
//CATLINK  EXEC PGM=IEBUPDTE
//SYSUT1   DD  DSN=BNKCA.RP50.NODYNAM.LKED.DATA,DISP=SHR
//SYSUT2   DD  DSN=BNKCA.RP50.NODYNAM.LKED.DATA,DISP=SHR
//SYSUT3   DD  UNIT=SYSDA,SPACE=(TRK,(3))
//SYSUT4   DD  UNIT=SYSDA,SPACE=(TRK,(3))
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DATA,DLM=$#
*/ ADD NAME=BNKLKED
* *******************************************************
* ** PRODUCT LINK-EDIT SUPPORTING COBOL NODYNAM        **
* *******************************************************
* ** USE THIS LINK-EDIT DECK IF YOUR COBOL PROGRAMS    **
* ** ARE COMPILED USING THE NODYNAM OPTION.            **
* *******************************************************
* ** REFER TO THE BCATNDYN MEMBER IN THE SAMPLE.JCL    **
* ** LIBRARY TO CATALOG THE INDIVIDUAL LINK DECKS      **
* ** SUPPORTING THE COBOL NODYNAM OPTION.              **
* *******************************************************
* ** REFER TO JOB BNKLKEDD FOR THE DYNAM EQUIVALENT.   **
* *******************************************************
**RPC020**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPC020)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPC020                                                        00003000
    NAME RPC020(R)                                                      00004000
**RPD015**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD015)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD015                                                        00003000
    NAME RPD015(R)                                                      00004000
**RPD020**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD020)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD020                                                        00003000
    NAME RPD020(R)                                                      00004000
**RPD035**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD035)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD035                                                        00003000
    NAME RPD035(R)                                                      00004000
**RPD036**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD036)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD036                                                        00003000
    NAME RPD036(R)                                                      00004000
**RPD100**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD100)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD100                                                        00003000
    NAME RPD100(R)                                                      00004000
**RPD110**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD110)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD110                                                        00003000
    NAME RPD110(R)                                                      00004000
**RPD111**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD111)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD111                                                        00003000
    NAME RPD111(R)                                                      00004000
**RPD126**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD126)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD126                                                        00003000
    NAME RPD126(R)                                                      00004000
**RPD200**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD200)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD200                                                        00003000
    NAME RPD200(R)                                                      00004000
**RPD201**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD201)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD201                                                        00003000
    NAME RPD201(R)                                                      00004000
**RPD202**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD202)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD202                                                        00003000
    NAME RPD202(R)                                                      00004000
**RPD210**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD210)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD210                                                        00003000
    NAME RPD210(R)                                                      00004000
**RPD240**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD240)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD240                                                        00003000
    NAME RPD240(R)                                                      00004000
**RPD241**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD241)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD241                                                        00003000
    NAME RPD241(R)                                                      00004000
**RPD250**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD250)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD250                                                        00003000
    NAME RPD250(R)                                                      00004000
**RPD251**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD251)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD251                                                        00003000
    NAME RPD251(R)                                                      00004000
**RPD252**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD252)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD252                                                        00003000
    NAME RPD252(R)                                                      00004000
**RPD340**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD340)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD340                                                        00003000
    NAME RPD340(R)                                                      00004000
**RPD350**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD350)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD350                                                        00003000
    NAME RPD350(R)                                                      00004000
**RPD500**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD500)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD500                                                        00003000
    NAME RPD500(R)                                                      00004000
**RPD550**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD550)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD550                                                        00003000
    NAME RPD550(R)                                                      00004000
**RPJ0DP81**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPJ0DP81)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPJ0DP81                                                      00003000
    NAME RPJ0DP81(R)                                                    00004000
**RPJ0DP85**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPJ0DP85)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPJ0DP85                                                      00003000
    NAME RPJ0DP85(R)                                                    00004000
**RPJ0DP86**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPJ0DP86)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPJ0DP86                                                      00003000
    NAME RPJ0DP86(R)                                                    00004000
**RPK0DP81**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0DP81)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0DP81                                                      00003000
    NAME RPK0DP81(R)                                                    00004000
**RPK0DP85**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0DP85)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0DP85                                                      00003000
    NAME RPK0DP85(R)                                                    00004000
**RPK0DP86**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0DP86)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0DP86                                                      00003000
    NAME RPK0DP86(R)                                                    00004000
**RPK0RF21**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0RF21)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0RF21                                                      00003000
    NAME RPK0RF21(R)                                                    00004000
**RPK0TI83**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0TI83)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0TI83                                                      00003000
    NAME RPK0TI83(R)                                                    00004000
**RPK0TI85**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0TI85)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0TI85                                                      00003000
    NAME RPK0TI85(R)                                                    00004000
**RPK0TI86**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0TI86)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0TI86                                                      00003000
    NAME RPK0TI86(R)                                                    00004000
**RPK7105**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK7105)                                             00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK7105                                                       00003000
    NAME RPK7105(R)                                                     00004000
**RPLACT00**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLACT00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLACT00                                                      00004000
    NAME RPLACT00(R)                                                    00005000
**RPLCRW00**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLCRW00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLCRW00                                                      00004000
    NAME RPLCRW00(R)                                                    00005000
**RPLCRW01**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLCRW01)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLCRW01                                                      00004000
    NAME RPLCRW01(R)                                                    00005000
**RPLQUA00**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLQUA00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLQUA00                                                      00004000
    NAME RPLQUA00(R)                                                    00005000
**RPLSEC00**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLSEC00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLSEC00                                                      00004000
    NAME RPLSEC00(R)                                                    00005000
**RPLTRM00**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLTRM00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLTRM00                                                      00004000
    NAME RPLTRM00(R)                                                    00005000
**RPLTRM01**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLTRM01)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLTRM01                                                      00004000
    NAME RPLTRM01(R)                                                    00005000
**RPLEVT01**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLEVT01)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLEVT01                                                      00004000
    NAME RPLEVT01(R)                                                    00005000
**RPLXXX01**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX01)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX01                                                      00004000
    NAME RPLXXX01(R)                                                    00005000
**RPLXXX02**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX02)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX02                                                      00004000
    NAME RPLXXX02(R)                                                    00005000
**RPLXXX03**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX03)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX03                                                      00004000
    NAME RPLXXX03(R)                                                    00005000
**RPLXXX04**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX04)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX04                                                      00004000
    NAME RPLXXX04(R)                                                    00005000
**RPLXXX05**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX05)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX05                                                      00004000
    NAME RPLXXX05(R)                                                    00005000
**RPLXXX06**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX06)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX06                                                      00004000
    NAME RPLXXX06(R)                                                    00005000
**RPLXXX07**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX07)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX07                                                      00004000
    NAME RPLXXX07(R)                                                    00005000
**RPLXXX08**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX08)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX08                                                      00004000
    NAME RPLXXX08(R)                                                    00005000
**RPLXXX10**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX10)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX10                                                      00004000
    NAME RPLXXX10(R)                                                    00005000
**RPLXXX11**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX11)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX11                                                      00004000
    NAME RPLXXX11(R)                                                    00005000
**RPLXXX12**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX12)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX12                                                      00004000
    NAME RPLXXX12(R)                                                    00005000
**RPLXXX13**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX13)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX13                                                      00004000
    NAME RPLXXX13(R)                                                    00005000
**RPLXXX30**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX30)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX30                                                      00004000
    NAME RPLXXX30(R)                                                    00005000
**RPLXXX31**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX31)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX31                                                      00004000
    NAME RPLXXX31(R)                                                    00005000
**RPLXXX32**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX32)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX32                                                      00004000
    NAME RPLXXX32(R)                                                    00005000
**RPLXXX33**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX33)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX33                                                      00004000
    NAME RPLXXX33(R)                                                    00005000
**RPLXXX36**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX36)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX36                                                      00004000
    NAME RPLXXX36(R)                                                    00005000
**RPLXXX37**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX37)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX37                                                      00004000
    NAME RPLXXX37(R)                                                    00005000
**RPLXXX38**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX38)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX38                                                      00004000
    NAME RPLXXX38(R)                                                    00005000
**RPLXXX39**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX39)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX39                                                      00004000
    NAME RPLXXX39(R)                                                    00005000
**RPL100**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL100)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL100                                                        00004000
    NAME RPL100(R)                                                      00005000
**RPL102**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL102)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL102                                                        00004000
    NAME RPL102(R)                                                      00005000
**RPL110**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL110)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL110                                                        00004000
    NAME RPL110(R)                                                      00005000
**RPL115**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL115)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL115                                                        00004000
    NAME RPL115(R)                                                      00005000
**RPL120**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL120)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL120                                                        00004000
    NAME RPL120(R)                                                      00005000
**RPL130**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL130)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL130                                                        00004000
    NAME RPL130(R)                                                      00005000
**RPL135**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL135)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL135                                                        00004000
    NAME RPL135(R)                                                      00005000
**RPL140**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL140)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL140                                                        00004000
    NAME RPL140(R)                                                      00005000
**RPL300**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL300)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL300                                                        00004000
    NAME RPL300(R)                                                      00005000
**RPL310**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL310)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL310                                                        00004000
    NAME RPL310(R)                                                      00005000
**RPL315**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL315)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL315                                                        00004000
    NAME RPL315(R)                                                      00005000
**RPL320**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL320)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL320                                                        00004000
    NAME RPL320(R)                                                      00005000
**RPL330**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL330)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL330                                                        00004000
    NAME RPL330(R)                                                      00005000
**RPL340**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL340)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL340                                                        00004000
    NAME RPL340(R)                                                      00005000
**RPL350**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL350)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL350                                                        00004000
    NAME RPL350(R)                                                      00005000
**RPL355**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL355)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL355                                                        00004000
    NAME RPL355(R)                                                      00005000
**RPL360**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL360)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL360                                                        00004000
    NAME RPL360(R)                                                      00005000
**RPL365**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL365)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL365                                                        00004000
    NAME RPL365(R)                                                      00005000
**RPL370**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL370)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL370                                                        00004000
    NAME RPL370(R)                                                      00005000
**RPL375**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL375)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL375                                                        00004000
    NAME RPL375(R)                                                      00005000
**RPL380**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL380)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL380                                                        00004000
    NAME RPL380(R)                                                      00005000
**RPO0DP81**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0DP81)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0DP81                                                      00004000
    NAME RPO0DP81(R)                                                    00005000
**RPO0DP85**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0DP85)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0DP85                                                      00004000
    NAME RPO0DP85(R)                                                    00005000
**RPO0DP86**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0DP86)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0DP86                                                      00004000
    NAME RPO0DP86(R)                                                    00005000
**RPO0RF21**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0RF21)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0RF21                                                      00004000
    NAME RPO0RF21(R)                                                    00005000
**RPO0TI83**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0TI83)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0TI83                                                      00004000
    NAME RPO0TI83(R)                                                    00005000
**RPO0TI85**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0TI85)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0TI85                                                      00004000
    NAME RPO0TI85(R)                                                    00005000
**RPO0TI86**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0TI86)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0TI86                                                      00004000
    NAME RPO0TI86(R)                                                    00005000
**RPO7105**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO7105)                                             00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO7105                                                       00004000
    NAME RPO7105(R)                                                     00005000
**RPR090**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR090)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR090                                                        00003000
    NAME RPR090(R)                                                      00004000
**RPR092**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR092)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR092                                                        00003000
    NAME RPR092(R)                                                      00004000
**RPR094**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR094)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR094                                                        00003000
    NAME RPR094(R)                                                      00004000
**RPR095**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR095)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR095                                                        00003000
    NAME RPR095(R)                                                      00004000
**RPR096**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR096)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR096                                                        00003000
    NAME RPR096(R)                                                      00004000
**RPR100**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR100)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR100                                                        00003000
    NAME RPR100(R)                                                      00004000
**RPR120**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR120)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR120                                                        00003000
    NAME RPR120(R)                                                      00004000
**RPR150**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR150)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR150                                                        00003000
    NAME RPR150(R)                                                      00004000
**RPR160**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR160)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR160                                                        00003000
    NAME RPR160(R)                                                      00004000
**RPR200**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR200)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR200                                                        00003000
    NAME RPR200(R)                                                      00004000
**RPR201**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR201)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR201                                                        00003000
    NAME RPR201(R)                                                      00004000
**RPR205**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR205)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR205                                                        00003000
    NAME RPR205(R)                                                      00004000
**RPR310**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR310)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR310                                                        00003000
    NAME RPR310(R)                                                      00004000
**RPR320**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR320)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR320                                                        00003000
    NAME RPR320(R)                                                      00004000
**RPR325**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR325)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR325                                                        00003000
    NAME RPR325(R)                                                      00004000
**RPR330**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR330)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR330                                                        00003000
    NAME RPR330(R)                                                      00004000
**RPR340**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR340)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR340                                                        00003000
    NAME RPR340(R)                                                      00004000
**RPR350**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR350)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR350                                                        00003000
    NAME RPR350(R)                                                      00004000
**RPR355**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR355)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR355                                                        00003000
    NAME RPR355(R)                                                      00004000
**RPR360**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR360)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR360                                                        00003000
    NAME RPR360(R)                                                      00004000
**RPR365**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR365)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR365                                                        00003000
    NAME RPR365(R)                                                      00004000
**RPR370**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR370)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR370                                                        00003000
    NAME RPR370(R)                                                      00004000
**RPR371**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR371)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR371                                                        00003000
    NAME RPR371(R)                                                      00004000
**RPR375**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR375)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR375                                                        00003000
    NAME RPR375(R)                                                      00004000
**RPR400**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR400)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR400                                                        00003000
    NAME RPR400(R)                                                      00004000
**RPR450**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR450)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR450                                                        00003000
    NAME RPR450(R)                                                      00004000
**RPR452A**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR452A)                                             00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR452A                                                       00003000
    NAME RPR452A(R)                                                     00004000
**RPR452B**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR452B)                                             00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR452B                                                       00003000
    NAME RPR452B(R)                                                     00004000
**RPR900**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR900)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR900                                                        00003000
    NAME RPR900(R)                                                      00004000
**RPX011**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX011)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX011                                                        00003000
    NAME RPX011(R)                                                      00004000
**RPX012**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX012)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX012                                                        00003000
    NAME RPX012(R)                                                      00004000
**RPX013**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX013)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX013                                                        00003000
    NAME RPX013(R)                                                      00004000
**RPX014**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX014)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX014                                                        00003000
    NAME RPX014(R)                                                      00004000
**RPX015**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX015)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX015                                                        00003000
    NAME RPX015(R)                                                      00004000
**RPX501**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX501)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX501                                                        00003000
    NAME RPX501(R)                                                      00004000
**RPX502**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX502)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX502                                                        00003000
    NAME RPX502(R)                                                      00004000
**RPX503**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX503)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX503                                                        00003000
    NAME RPX503(R)                                                      00004000
**RPX504**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX504)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX504                                                        00003000
    NAME RPX504(R)                                                      00004000
*/ ADD NAME=BNKLKEDD
* *******************************************************
* ** PRODUCT LINK-EDIT SUPPORTING COBOL DYNAM          **
* *******************************************************
* ** USE THIS LINK-EDIT DECK IF YOUR COBOL PROGRAMS    **
* ** ARE COMPILED USING THE DYNAM OPTION.              **
* *******************************************************
* ** REFER TO THE BCATDYNL MEMBER IN THE SAMPLE.JCL    **
* ** LIBRARY TO CATALOG THE INDIVIDUAL LINK DECKS      **
* ** SUPPORTING THE COBOL DYNAM OPTION.                **
* *******************************************************
* ** REFER TO JOB BNKLKED FOR THE NODYNAM EQUIVALENT.  **
* *******************************************************
**RPBUSER**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPBUSER)                                             00001000
    ENTRY RPBUSER                                                       00002000
    NAME RPBUSER(R)                                                     00003000
**RPB130**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPB130)                                              00001000
    ENTRY RPB130                                                        00002000
    NAME RPB130(R)                                                      00003000
**RPC020**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPC020)                                              00001000
    ENTRY RPC020                                                        00002000
    NAME RPC020(R)                                                      00003000
**RPD015**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD015)                                              00001000
    ENTRY RPD015                                                        00002000
    NAME RPD015(R)                                                      00003000
**RPD020**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD020)                                              00001000
    ENTRY RPD020                                                        00002000
    NAME RPD020(R)                                                      00003000
**RPD035**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD035)                                              00001000
    ENTRY RPD035                                                        00002000
    NAME RPD035(R)                                                      00003000
**RPD036**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD036)                                              00001000
    ENTRY RPD036                                                        00002000
    NAME RPD036(R)                                                      00003000
**RPD100**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD100)                                              00001000
    ENTRY RPD100                                                        00002000
    NAME RPD100(R)                                                      00003000
**RPD110**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD110)                                              00001000
    ENTRY RPD110                                                        00002000
    NAME RPD110(R)                                                      00003000
**RPD111**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD111)                                              00001000
    ENTRY RPD111                                                        00002000
    NAME RPD111(R)                                                      00003000
**RPD126**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD126)                                              00001000
    ENTRY RPD126                                                        00002000
    NAME RPD126(R)                                                      00003000
**RPD200**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD200)                                              00001000
    ENTRY RPD200                                                        00002000
    NAME RPD200(R)                                                      00003000
**RPD201**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD201)                                              00001000
    ENTRY RPD201                                                        00002000
    NAME RPD201(R)                                                      00003000
**RPD202**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD202)                                              00001000
    ENTRY RPD202                                                        00002000
    NAME RPD202(R)                                                      00003000
**RPD210**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD210)                                              00001000
    ENTRY RPD210                                                        00002000
    NAME RPD210(R)                                                      00003000
**RPD240**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD240)                                              00001000
    ENTRY RPD240                                                        00002000
    NAME RPD240(R)                                                      00003000
**RPD241**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD241)                                              00001000
    ENTRY RPD241                                                        00002000
    NAME RPD241(R)                                                      00003000
**RPD250**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD250)                                              00001000
    ENTRY RPD250                                                        00002000
    NAME RPD250(R)                                                      00003000
**RPD251**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD251)                                              00001000
    ENTRY RPD251                                                        00002000
    NAME RPD251(R)                                                      00003000
**RPD252**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD252)                                              00001000
    ENTRY RPD252                                                        00002000
    NAME RPD252(R)                                                      00003000
**RPD340**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD340)                                              00001000
    ENTRY RPD340                                                        00002000
    NAME RPD340(R)                                                      00003000
**RPD350**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD350)                                              00001000
    ENTRY RPD350                                                        00002000
    NAME RPD350(R)                                                      00003000
**RPD500**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD500)                                              00001000
    ENTRY RPD500                                                        00002000
    NAME RPD500(R)                                                      00003000
**RPD550**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPD550)                                              00001000
    ENTRY RPD550                                                        00002000
    NAME RPD550(R)                                                      00003000
**RPG050**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPG050)                                              00001000
    ENTRY RPG050                                                        00002000
    NAME RPG050(R)                                                      00003000
**RPG051**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPG051)                                              00001000
    ENTRY RPG051                                                        00002000
    NAME RPG051(R)                                                      00003000
**RPG052**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPG052)                                              00001000
    ENTRY RPG052                                                        00002000
    NAME RPG052(R)                                                      00003000
**RPG053**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPG053)                                              00001000
    ENTRY RPG053                                                        00002000
    NAME RPG053(R)                                                      00003000
**RPG054**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPG054)                                              00001000
    ENTRY RPG054                                                        00002000
    NAME RPG054(R)                                                      00003000
**RPG055**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPG055)                                              00001000
    ENTRY RPG055                                                        00002000
    NAME RPG055(R)                                                      00003000
**RPG056**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPG056)                                              00001000
    ENTRY RPG056                                                        00002000
    NAME RPG056(R)                                                      00003000
**RPIACT**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPIACT)                                              00001000
    ENTRY RPIACT                                                        00002000
    NAME RPIACT(R)                                                      00003000
**RPIACTTI**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPIACTTI)                                            00001000
    ENTRY RPIACTTI                                                      00002000
    NAME RPIACTTI(R)                                                    00003000
**RPIRPTO**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPIRPTO)                                             00001000
    ENTRY RPIRPTO                                                       00002000
    NAME RPIRPTO(R)                                                     00003000
**RPIRPTS**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPIRPTS)                                             00001000
    ENTRY RPIRPTS                                                       00002000
    NAME RPIRPTS(R)                                                     00003000
**RPJ0DP81**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPJ0DP81)                                            00001000
    ENTRY RPJ0DP81                                                      00002000
    NAME RPJ0DP81(R)                                                    00003000
**RPJ0DP85**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPJ0DP85)                                            00001000
    ENTRY RPJ0DP85                                                      00002000
    NAME RPJ0DP85(R)                                                    00003000
**RPJ0DP86**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPJ0DP86)                                            00001000
    ENTRY RPJ0DP86                                                      00002000
    NAME RPJ0DP86(R)                                                    00003000
**RPK0DP81**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPK0DP81)                                            00001000
    ENTRY RPK0DP81                                                      00002000
    NAME RPK0DP81(R)                                                    00003000
**RPK0DP85**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPK0DP85)                                            00001000
    ENTRY RPK0DP85                                                      00002000
    NAME RPK0DP85(R)                                                    00003000
**RPK0DP86**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPK0DP86)                                            00001000
    ENTRY RPK0DP86                                                      00002000
    NAME RPK0DP86(R)                                                    00003000
**RPK0RF21**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPK0RF21)                                            00001000
    ENTRY RPK0RF21                                                      00002000
    NAME RPK0RF21(R)                                                    00003000
**RPK0TI83**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPK0TI83)                                            00001000
    ENTRY RPK0TI83                                                      00002000
    NAME RPK0TI83(R)                                                    00003000
**RPK0TI85**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPK0TI85)                                            00001000
    ENTRY RPK0TI85                                                      00002000
    NAME RPK0TI85(R)                                                    00003000
**RPK0TI86**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPK0TI86)                                            00001000
    ENTRY RPK0TI86                                                      00002000
    NAME RPK0TI86(R)                                                    00003000
**RPK7105**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPK7105)                                             00001000
    ENTRY RPK7105                                                       00002000
    NAME RPK7105(R)                                                     00003000
**RPLACT00**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLACT00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLACT00                                                      00004000
    NAME RPLACT00(R)                                                    00005000
**RPLCRW00**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLCRW00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLCRW00                                                      00004000
    NAME RPLCRW00(R)                                                    00005000
**RPLCRW01**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLCRW01)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLCRW01                                                      00004000
    NAME RPLCRW01(R)                                                    00005000
**RPLQUA00**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLQUA00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLQUA00                                                      00004000
    NAME RPLQUA00(R)                                                    00005000
**RPLSEC00**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLSEC00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLSEC00                                                      00004000
    NAME RPLSEC00(R)                                                    00005000
**RPLTRM00**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLTRM00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLTRM00                                                      00004000
    NAME RPLTRM00(R)                                                    00005000
**RPLTRM01**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLTRM01)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLTRM01                                                      00004000
    NAME RPLTRM01(R)                                                    00005000
**RPLEVT01**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLEVT01)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLEVT01                                                      00004000
    NAME RPLEVT01(R)                                                    00005000
**RPLXXX01**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX01)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX01                                                      00004000
    NAME RPLXXX01(R)                                                    00005000
**RPLXXX02**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX02)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX02                                                      00004000
    NAME RPLXXX02(R)                                                    00005000
**RPLXXX03**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX03)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX03                                                      00004000
    NAME RPLXXX03(R)                                                    00005000
**RPLXXX04**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX04)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX04                                                      00004000
    NAME RPLXXX04(R)                                                    00005000
**RPLXXX05**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX05)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX05                                                      00004000
    NAME RPLXXX05(R)                                                    00005000
**RPLXXX06**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX06)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX06                                                      00004000
    NAME RPLXXX06(R)                                                    00005000
**RPLXXX07**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX07)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX07                                                      00004000
    NAME RPLXXX07(R)                                                    00005000
**RPLXXX08**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX08)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX08                                                      00004000
    NAME RPLXXX08(R)                                                    00005000
**RPLXXX10**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX10)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX10                                                      00004000
    NAME RPLXXX10(R)                                                    00005000
**RPLXXX11**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX11)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX11                                                      00004000
    NAME RPLXXX11(R)                                                    00005000
**RPLXXX12**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX12)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX12                                                      00004000
    NAME RPLXXX12(R)                                                    00005000
**RPLXXX13**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX13)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX13                                                      00004000
    NAME RPLXXX13(R)                                                    00005000
**RPLXXX30**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX30)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX30                                                      00004000
    NAME RPLXXX30(R)                                                    00005000
**RPLXXX31**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX31)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX31                                                      00004000
    NAME RPLXXX31(R)                                                    00005000
**RPLXXX32**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX32)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX32                                                      00004000
    NAME RPLXXX32(R)                                                    00005000
**RPLXXX33**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX33)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX33                                                      00004000
    NAME RPLXXX33(R)                                                    00005000
**RPLXXX36**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX36)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX36                                                      00004000
    NAME RPLXXX36(R)                                                    00005000
**RPLXXX37**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX37)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX37                                                      00004000
    NAME RPLXXX37(R)                                                    00005000
**RPLXXX38**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX38)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX38                                                      00004000
    NAME RPLXXX38(R)                                                    00005000
**RPLXXX39**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX39)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX39                                                      00004000
    NAME RPLXXX39(R)                                                    00005000
**RPL100**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL100)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL100                                                        00004000
    NAME RPL100(R)                                                      00005000
**RPL102**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL102)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL102                                                        00004000
    NAME RPL102(R)                                                      00005000
**RPL110**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL110)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL110                                                        00004000
    NAME RPL110(R)                                                      00005000
**RPL115**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL115)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL115                                                        00004000
    NAME RPL115(R)                                                      00005000
**RPL120**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL120)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL120                                                        00004000
    NAME RPL120(R)                                                      00005000
**RPL130**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL130)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL130                                                        00004000
    NAME RPL130(R)                                                      00005000
**RPL135**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL135)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL135                                                        00004000
    NAME RPL135(R)                                                      00005000
**RPL140**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL140)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL140                                                        00004000
    NAME RPL140(R)                                                      00005000
**RPL300**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL300)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL300                                                        00004000
    NAME RPL300(R)                                                      00005000
**RPL310**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL310)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL310                                                        00004000
    NAME RPL310(R)                                                      00005000
**RPL315**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL315)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL315                                                        00004000
    NAME RPL315(R)                                                      00005000
**RPL320**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL320)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL320                                                        00004000
    NAME RPL320(R)                                                      00005000
**RPL330**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL330)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL330                                                        00004000
    NAME RPL330(R)                                                      00005000
**RPL340**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL340)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL340                                                        00004000
    NAME RPL340(R)                                                      00005000
**RPL350**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL350)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL350                                                        00004000
    NAME RPL350(R)                                                      00005000
**RPL355**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL355)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL355                                                        00004000
    NAME RPL355(R)                                                      00005000
**RPL360**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL360)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL360                                                        00004000
    NAME RPL360(R)                                                      00005000
**RPL365**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL365)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL365                                                        00004000
    NAME RPL365(R)                                                      00005000
**RPL370**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL370)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL370                                                        00004000
    NAME RPL370(R)                                                      00005000
**RPL375**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL375)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL375                                                        00004000
    NAME RPL375(R)                                                      00005000
**RPL380**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL380)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL380                                                        00004000
    NAME RPL380(R)                                                      00005000
**RPO0DP81**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0DP81)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0DP81                                                      00004000
    NAME RPO0DP81(R)                                                    00005000
**RPO0DP85**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0DP85)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0DP85                                                      00004000
    NAME RPO0DP85(R)                                                    00005000
**RPO0DP86**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0DP86)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0DP86                                                      00004000
    NAME RPO0DP86(R)                                                    00005000
**RPO0RF21**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0RF21)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0RF21                                                      00004000
    NAME RPO0RF21(R)                                                    00005000
**RPO0TI83**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0TI83)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0TI83                                                      00004000
    NAME RPO0TI83(R)                                                    00005000
**RPO0TI85**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0TI85)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0TI85                                                      00004000
    NAME RPO0TI85(R)                                                    00005000
**RPO0TI86**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0TI86)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0TI86                                                      00004000
    NAME RPO0TI86(R)                                                    00005000
**RPO7105**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO7105)                                             00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO7105                                                       00004000
    NAME RPO7105(R)                                                     00005000
**RPR090**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR090)                                              00001000
    ENTRY RPR090                                                        00002000
    NAME RPR090(R)                                                      00003000
**RPR092**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR092)                                              00001000
    ENTRY RPR092                                                        00002000
    NAME RPR092(R)                                                      00003000
**RPR094**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR094)                                              00001000
    ENTRY RPR094                                                        00002000
    NAME RPR094(R)                                                      00003000
**RPR095**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR095)                                              00001000
    ENTRY RPR095                                                        00002000
    NAME RPR095(R)                                                      00003000
**RPR096**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR096)                                              00001000
    ENTRY RPR096                                                        00002000
    NAME RPR096(R)                                                      00003000
**RPR100**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR100)                                              00001000
    ENTRY RPR100                                                        00002000
    NAME RPR100(R)                                                      00003000
**RPR120**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR120)                                              00001000
    ENTRY RPR120                                                        00002000
    NAME RPR120(R)                                                      00003000
**RPR150**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR150)                                              00001000
    ENTRY RPR150                                                        00002000
    NAME RPR150(R)                                                      00003000
**RPR160**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR160)                                              00001000
    ENTRY RPR160                                                        00002000
    NAME RPR160(R)                                                      00003000
**RPR200**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR200)                                              00001000
    ENTRY RPR200                                                        00002000
    NAME RPR200(R)                                                      00003000
**RPR201**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR201)                                              00001000
    ENTRY RPR201                                                        00002000
    NAME RPR201(R)                                                      00003000
**RPR205**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR205)                                              00001000
    ENTRY RPR205                                                        00002000
    NAME RPR205(R)                                                      00003000
**RPR310**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR310)                                              00001000
    ENTRY RPR310                                                        00002000
    NAME RPR310(R)                                                      00003000
**RPR320**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR320)                                              00001000
    ENTRY RPR320                                                        00002000
    NAME RPR320(R)                                                      00003000
**RPR325**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR325)                                              00001000
    ENTRY RPR325                                                        00002000
    NAME RPR325(R)                                                      00003000
**RPR330**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR330)                                              00001000
    ENTRY RPR330                                                        00002000
    NAME RPR330(R)                                                      00003000
**RPR340**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR340)                                              00001000
    ENTRY RPR340                                                        00002000
    NAME RPR340(R)                                                      00003000
**RPR350**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR350)                                              00001000
    ENTRY RPR350                                                        00002000
    NAME RPR350(R)                                                      00003000
**RPR355**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR355)                                              00001000
    ENTRY RPR355                                                        00002000
    NAME RPR355(R)                                                      00003000
**RPR360**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR360)                                              00001000
    ENTRY RPR360                                                        00002000
    NAME RPR360(R)                                                      00003000
**RPR365**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR365)                                              00001000
    ENTRY RPR365                                                        00002000
    NAME RPR365(R)                                                      00003000
**RPR370**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR370)                                              00001000
    ENTRY RPR370                                                        00002000
    NAME RPR370(R)                                                      00003000
**RPR371**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR371)                                              00001000
    ENTRY RPR371                                                        00002000
    NAME RPR371(R)                                                      00003000
**RPR375**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR375)                                              00001000
    ENTRY RPR375                                                        00002000
    NAME RPR375(R)                                                      00003000
**RPR400**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR400)                                              00001000
    ENTRY RPR400                                                        00002000
    NAME RPR400(R)                                                      00003000
**RPR450**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR450)                                              00001000
    ENTRY RPR450                                                        00002000
    NAME RPR450(R)                                                      00003000
**RPR452A**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR452A)                                             00001000
    ENTRY RPR452A                                                       00002000
    NAME RPR452A(R)                                                     00003000
**RPR452B**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR452B)                                             00001000
    ENTRY RPR452B                                                       00002000
    NAME RPR452B(R)                                                     00003000
**RPR900**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPR900)                                              00001000
    ENTRY RPR900                                                        00002000
    NAME RPR900(R)                                                      00003000
**RPSEGID**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPSEGID)                                             00001000
    ENTRY RPSEGID                                                       00002000
    NAME RPSEGID(R)                                                     00003000
**RPX011**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPX011)                                              00001000
    ENTRY RPX011                                                        00002000
    NAME RPX011(R)                                                      00003000
**RPX012**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPX012)                                              00001000
    ENTRY RPX012                                                        00002000
    NAME RPX012(R)                                                      00003000
**RPX013**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPX013)                                              00001000
    ENTRY RPX013                                                        00002000
    NAME RPX013(R)                                                      00003000
**RPX014**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPX014)                                              00001000
    ENTRY RPX014                                                        00002000
    NAME RPX014(R)                                                      00003000
**RPX015**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPX015)                                              00001000
    ENTRY RPX015                                                        00002000
    NAME RPX015(R)                                                      00003000
**RPX501**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPX501)                                              00001000
    ENTRY RPX501                                                        00002000
    NAME RPX501(R)                                                      00003000
**RPX502**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPX502)                                              00001000
    ENTRY RPX502                                                        00002000
    NAME RPX502(R)                                                      00003000
**RPX503**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPX503)                                              00001000
    ENTRY RPX503                                                        00002000
    NAME RPX503(R)                                                      00003000
**RPX504**
* *******************************************************
* **   LINK-EDIT FOR THE COBOL DYNAM COMPILE OPTION    **
* *******************************************************
    INCLUDE SYSLIB(RPX504)                                              00001000
    ENTRY RPX504                                                        00002000
    NAME RPX504(R)                                                      00003000
*/ ADD NAME=RPC020
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPC020)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPC020                                                        00003000
    NAME RPC020(R)                                                      00004000
*/ ADD NAME=RPD015
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD015)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD015                                                        00003000
    NAME RPD015(R)                                                      00004000
*/ ADD NAME=RPD020
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD020)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD020                                                        00003000
    NAME RPD020(R)                                                      00004000
*/ ADD NAME=RPD035
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD035)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD035                                                        00003000
    NAME RPD035(R)                                                      00004000
*/ ADD NAME=RPD036
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD036)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD036                                                        00003000
    NAME RPD036(R)                                                      00004000
*/ ADD NAME=RPD100
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD100)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD100                                                        00003000
    NAME RPD100(R)                                                      00004000
*/ ADD NAME=RPD110
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD110)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD110                                                        00003000
    NAME RPD110(R)                                                      00004000
*/ ADD NAME=RPD111
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD111)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD111                                                        00003000
    NAME RPD111(R)                                                      00004000
*/ ADD NAME=RPD126
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD126)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD126                                                        00003000
    NAME RPD126(R)                                                      00004000
*/ ADD NAME=RPD200
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD200)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD200                                                        00003000
    NAME RPD200(R)                                                      00004000
*/ ADD NAME=RPD201
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD201)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD201                                                        00003000
    NAME RPD201(R)                                                      00004000
*/ ADD NAME=RPD202
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD202)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD202                                                        00003000
    NAME RPD202(R)                                                      00004000
*/ ADD NAME=RPD210
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD210)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD210                                                        00003000
    NAME RPD210(R)                                                      00004000
*/ ADD NAME=RPD240
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD240)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD240                                                        00003000
    NAME RPD240(R)                                                      00004000
*/ ADD NAME=RPD241
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD241)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD241                                                        00003000
    NAME RPD241(R)                                                      00004000
*/ ADD NAME=RPD250
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD250)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD250                                                        00003000
    NAME RPD250(R)                                                      00004000
*/ ADD NAME=RPD251
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD251)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD251                                                        00003000
    NAME RPD251(R)                                                      00004000
*/ ADD NAME=RPD252
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD252)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD252                                                        00003000
    NAME RPD252(R)                                                      00004000
*/ ADD NAME=RPD340
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD340)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD340                                                        00003000
    NAME RPD340(R)                                                      00004000
*/ ADD NAME=RPD350
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD350)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD350                                                        00003000
    NAME RPD350(R)                                                      00004000
*/ ADD NAME=RPD500
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD500)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD500                                                        00003000
    NAME RPD500(R)                                                      00004000
*/ ADD NAME=RPD550
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPD550)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPD550                                                        00003000
    NAME RPD550(R)                                                      00004000
*/ ADD NAME=RPJ0DP81
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPJ0DP81)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPJ0DP81                                                      00003000
    NAME RPJ0DP81(R)                                                    00004000
*/ ADD NAME=RPJ0DP85
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPJ0DP85)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPJ0DP85                                                      00003000
    NAME RPJ0DP85(R)                                                    00004000
*/ ADD NAME=RPJ0DP86
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPJ0DP86)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPJ0DP86                                                      00003000
    NAME RPJ0DP86(R)                                                    00004000
*/ ADD NAME=RPK0DP81
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0DP81)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0DP81                                                      00003000
    NAME RPK0DP81(R)                                                    00004000
*/ ADD NAME=RPK0DP85
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0DP85)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0DP85                                                      00003000
    NAME RPK0DP85(R)                                                    00004000
*/ ADD NAME=RPK0DP86
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0DP86)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0DP86                                                      00003000
    NAME RPK0DP86(R)                                                    00004000
*/ ADD NAME=RPK0RF21
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0RF21)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0RF21                                                      00003000
    NAME RPK0RF21(R)                                                    00004000
*/ ADD NAME=RPK0TI83
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0TI83)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0TI83                                                      00003000
    NAME RPK0TI83(R)                                                    00004000
*/ ADD NAME=RPK0TI85
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0TI85)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0TI85                                                      00003000
    NAME RPK0TI85(R)                                                    00004000
*/ ADD NAME=RPK0TI86
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK0TI86)                                            00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK0TI86                                                      00003000
    NAME RPK0TI86(R)                                                    00004000
*/ ADD NAME=RPK7105
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPK7105)                                             00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPK7105                                                       00003000
    NAME RPK7105(R)                                                     00004000
*/ ADD NAME=RPLACT00
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLACT00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLACT00                                                      00004000
    NAME RPLACT00(R)                                                    00005000
*/ ADD NAME=RPLCRW00
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLCRW00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLCRW00                                                      00004000
    NAME RPLCRW00(R)                                                    00005000
*/ ADD NAME=RPLCRW01
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLCRW01)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLCRW01                                                      00004000
    NAME RPLCRW01(R)                                                    00005000
*/ ADD NAME=RPLQUA00
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLQUA00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLQUA00                                                      00004000
    NAME RPLQUA00(R)                                                    00005000
*/ ADD NAME=RPLSEC00
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLSEC00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLSEC00                                                      00004000
    NAME RPLSEC00(R)                                                    00005000
*/ ADD NAME=RPLTRM00
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLTRM00)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLTRM00                                                      00004000
    NAME RPLTRM00(R)                                                    00005000
*/ ADD NAME=RPLTRM01
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLTRM01)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLTRM01                                                      00004000
    NAME RPLTRM01(R)                                                    00005000
*/ ADD NAME=RPLEVT01
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLEVT01)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLEVT01                                                      00004000
    NAME RPLEVT01(R)                                                    00005000
*/ ADD NAME=RPLXXX01
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX01)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX01                                                      00004000
    NAME RPLXXX01(R)                                                    00005000
*/ ADD NAME=RPLXXX02
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX02)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX02                                                      00004000
    NAME RPLXXX02(R)                                                    00005000
*/ ADD NAME=RPLXXX03
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX03)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX03                                                      00004000
    NAME RPLXXX03(R)                                                    00005000
*/ ADD NAME=RPLXXX04
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX04)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX04                                                      00004000
    NAME RPLXXX04(R)                                                    00005000
*/ ADD NAME=RPLXXX05
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX05)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX05                                                      00004000
    NAME RPLXXX05(R)                                                    00005000
*/ ADD NAME=RPLXXX06
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX06)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX06                                                      00004000
    NAME RPLXXX06(R)                                                    00005000
*/ ADD NAME=RPLXXX07
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX07)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX07                                                      00004000
    NAME RPLXXX07(R)                                                    00005000
*/ ADD NAME=RPLXXX08
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX08)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX08                                                      00004000
    NAME RPLXXX08(R)                                                    00005000
*/ ADD NAME=RPLXXX10
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX10)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX10                                                      00004000
    NAME RPLXXX10(R)                                                    00005000
*/ ADD NAME=RPLXXX11
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX11)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX11                                                      00004000
    NAME RPLXXX11(R)                                                    00005000
*/ ADD NAME=RPLXXX12
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX12)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX12                                                      00004000
    NAME RPLXXX12(R)                                                    00005000
*/ ADD NAME=RPLXXX13
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX13)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX13                                                      00004000
    NAME RPLXXX13(R)                                                    00005000
*/ ADD NAME=RPLXXX30
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX30)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX30                                                      00004000
    NAME RPLXXX30(R)                                                    00005000
*/ ADD NAME=RPLXXX31
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX31)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX31                                                      00004000
    NAME RPLXXX31(R)                                                    00005000
*/ ADD NAME=RPLXXX32
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX32)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX32                                                      00004000
    NAME RPLXXX32(R)                                                    00005000
*/ ADD NAME=RPLXXX33
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX33)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX33                                                      00004000
    NAME RPLXXX33(R)                                                    00005000
*/ ADD NAME=RPLXXX36
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX36)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX36                                                      00004000
    NAME RPLXXX36(R)                                                    00005000
*/ ADD NAME=RPLXXX37
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX37)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX37                                                      00004000
    NAME RPLXXX37(R)                                                    00005000
*/ ADD NAME=RPLXXX38
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX38)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX38                                                      00004000
    NAME RPLXXX38(R)                                                    00005000
*/ ADD NAME=RPLXXX39
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPLXXX39)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPLXXX39                                                      00004000
    NAME RPLXXX39(R)                                                    00005000
*/ ADD NAME=RPL100
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL100)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL100                                                        00004000
    NAME RPL100(R)                                                      00005000
*/ ADD NAME=RPL102
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL102)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL102                                                        00004000
    NAME RPL102(R)                                                      00005000
*/ ADD NAME=RPL110
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL110)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL110                                                        00004000
    NAME RPL110(R)                                                      00005000
*/ ADD NAME=RPL115
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL115)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL115                                                        00004000
    NAME RPL115(R)                                                      00005000
*/ ADD NAME=RPL120
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL120)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL120                                                        00004000
    NAME RPL120(R)                                                      00005000
*/ ADD NAME=RPL130
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL130)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL130                                                        00004000
    NAME RPL130(R)                                                      00005000
*/ ADD NAME=RPL135
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL135)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL135                                                        00004000
    NAME RPL135(R)                                                      00005000
*/ ADD NAME=RPL140
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL140)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL140                                                        00004000
    NAME RPL140(R)                                                      00005000
*/ ADD NAME=RPL300
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL300)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL300                                                        00004000
    NAME RPL300(R)                                                      00005000
*/ ADD NAME=RPL310
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL310)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL310                                                        00004000
    NAME RPL310(R)                                                      00005000
*/ ADD NAME=RPL315
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL315)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL315                                                        00004000
    NAME RPL315(R)                                                      00005000
*/ ADD NAME=RPL320
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL320)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL320                                                        00004000
    NAME RPL320(R)                                                      00005000
*/ ADD NAME=RPL330
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL330)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL330                                                        00004000
    NAME RPL330(R)                                                      00005000
*/ ADD NAME=RPL340
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL340)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL340                                                        00004000
    NAME RPL340(R)                                                      00005000
*/ ADD NAME=RPL350
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL350)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL350                                                        00004000
    NAME RPL350(R)                                                      00005000
*/ ADD NAME=RPL355
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL355)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL355                                                        00004000
    NAME RPL355(R)                                                      00005000
*/ ADD NAME=RPL360
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL360)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL360                                                        00004000
    NAME RPL360(R)                                                      00005000
*/ ADD NAME=RPL365
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL365)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL365                                                        00004000
    NAME RPL365(R)                                                      00005000
*/ ADD NAME=RPL370
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL370)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL370                                                        00004000
    NAME RPL370(R)                                                      00005000
*/ ADD NAME=RPL375
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL375)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL375                                                        00004000
    NAME RPL375(R)                                                      00005000
*/ ADD NAME=RPL380
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPL380)                                              00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPL380                                                        00004000
    NAME RPL380(R)                                                      00005000
*/ ADD NAME=RPO0DP81
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0DP81)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0DP81                                                      00004000
    NAME RPO0DP81(R)                                                    00005000
*/ ADD NAME=RPO0DP85
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0DP85)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0DP85                                                      00004000
    NAME RPO0DP85(R)                                                    00005000
*/ ADD NAME=RPO0DP86
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0DP86)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0DP86                                                      00004000
    NAME RPO0DP86(R)                                                    00005000
*/ ADD NAME=RPO0RF21
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0RF21)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0RF21                                                      00004000
    NAME RPO0RF21(R)                                                    00005000
*/ ADD NAME=RPO0TI83
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0TI83)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0TI83                                                      00004000
    NAME RPO0TI83(R)                                                    00005000
*/ ADD NAME=RPO0TI85
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0TI85)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0TI85                                                      00004000
    NAME RPO0TI85(R)                                                    00005000
*/ ADD NAME=RPO0TI86
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO0TI86)                                            00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO0TI86                                                      00004000
    NAME RPO0TI86(R)                                                    00005000
*/ ADD NAME=RPO7105
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(DFHELII)                                             00001000
    INCLUDE SYSLIB(RPO7105)                                             00002000
    INCLUDE SYSLIB(BIPPGMI)                                             00003000
    ENTRY RPO7105                                                       00004000
    NAME RPO7105(R)                                                     00005000
*/ ADD NAME=RPR090
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR090)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR090                                                        00003000
    NAME RPR090(R)                                                      00004000
*/ ADD NAME=RPR092
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR092)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR092                                                        00003000
    NAME RPR092(R)                                                      00004000
*/ ADD NAME=RPR094
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR094)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR094                                                        00003000
    NAME RPR094(R)                                                      00004000
*/ ADD NAME=RPR095
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR095)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR095                                                        00003000
    NAME RPR095(R)                                                      00004000
*/ ADD NAME=RPR096
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR096)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR096                                                        00003000
    NAME RPR096(R)                                                      00004000
*/ ADD NAME=RPR100
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR100)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR100                                                        00003000
    NAME RPR100(R)                                                      00004000
*/ ADD NAME=RPR120
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR120)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR120                                                        00003000
    NAME RPR120(R)                                                      00004000
*/ ADD NAME=RPR150
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR150)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR150                                                        00003000
    NAME RPR150(R)                                                      00004000
*/ ADD NAME=RPR160
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR160)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR160                                                        00003000
    NAME RPR160(R)                                                      00004000
*/ ADD NAME=RPR200
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR200)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR200                                                        00003000
    NAME RPR200(R)                                                      00004000
*/ ADD NAME=RPR201
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR201)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR201                                                        00003000
    NAME RPR201(R)                                                      00004000
*/ ADD NAME=RPR205
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR205)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR205                                                        00003000
    NAME RPR205(R)                                                      00004000
*/ ADD NAME=RPR310
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR310)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR310                                                        00003000
    NAME RPR310(R)                                                      00004000
*/ ADD NAME=RPR320
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR320)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR320                                                        00003000
    NAME RPR320(R)                                                      00004000
*/ ADD NAME=RPR325
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR325)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR325                                                        00003000
    NAME RPR325(R)                                                      00004000
*/ ADD NAME=RPR330
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR330)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR330                                                        00003000
    NAME RPR330(R)                                                      00004000
*/ ADD NAME=RPR340
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR340)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR340                                                        00003000
    NAME RPR340(R)                                                      00004000
*/ ADD NAME=RPR350
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR350)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR350                                                        00003000
    NAME RPR350(R)                                                      00004000
*/ ADD NAME=RPR355
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR355)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR355                                                        00003000
    NAME RPR355(R)                                                      00004000
*/ ADD NAME=RPR360
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR360)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR360                                                        00003000
    NAME RPR360(R)                                                      00004000
*/ ADD NAME=RPR365
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR365)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR365                                                        00003000
    NAME RPR365(R)                                                      00004000
*/ ADD NAME=RPR370
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR370)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR370                                                        00003000
    NAME RPR370(R)                                                      00004000
*/ ADD NAME=RPR371
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR371)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR371                                                        00003000
    NAME RPR371(R)                                                      00004000
*/ ADD NAME=RPR375
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR375)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR375                                                        00003000
    NAME RPR375(R)                                                      00004000
*/ ADD NAME=RPR400
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR400)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR400                                                        00003000
    NAME RPR400(R)                                                      00004000
*/ ADD NAME=RPR450
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR450)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR450                                                        00003000
    NAME RPR450(R)                                                      00004000
*/ ADD NAME=RPR452A
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR452A)                                             00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR452A                                                       00003000
    NAME RPR452A(R)                                                     00004000
*/ ADD NAME=RPR452B
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR452B)                                             00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR452B                                                       00003000
    NAME RPR452B(R)                                                     00004000
*/ ADD NAME=RPR900
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPR900)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPR900                                                        00003000
    NAME RPR900(R)                                                      00004000
*/ ADD NAME=RPX011
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX011)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX011                                                        00003000
    NAME RPX011(R)                                                      00004000
*/ ADD NAME=RPX012
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX012)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX012                                                        00003000
    NAME RPX012(R)                                                      00004000
*/ ADD NAME=RPX013
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX013)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX013                                                        00003000
    NAME RPX013(R)                                                      00004000
*/ ADD NAME=RPX014
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX014)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX014                                                        00003000
    NAME RPX014(R)                                                      00004000
*/ ADD NAME=RPX015
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX015)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX015                                                        00003000
    NAME RPX015(R)                                                      00004000
*/ ADD NAME=RPX501
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX501)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX501                                                        00003000
    NAME RPX501(R)                                                      00004000
*/ ADD NAME=RPX502
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX502)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX502                                                        00003000
    NAME RPX502(R)                                                      00004000
*/ ADD NAME=RPX503
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX503)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX503                                                        00003000
    NAME RPX503(R)                                                      00004000
*/ ADD NAME=RPX504
* *******************************************************
* **   LINK-EDIT FOR THE COBOL NODYNAM COMPILE OPTION  **
* *******************************************************
    INCLUDE SYSLIB(RPX504)                                              00001000
    INCLUDE SYSLIB(BIPPGMB)                                             00002000
    ENTRY RPX504                                                        00003000
    NAME RPX504(R)                                                      00004000
*/ ENDUP
$#
/*
//
