//DB2RPS01 JOB
//*------------------------------------------------------------------   00001000
//* IEFBR14 - DB2 ALLOCATE DBRMLIB                                      00002000
//*------------------------------------------------------------------   00003000
//* CHANGE THE DBRMLIB LIBRARY, VOLUME AND UNIT ASSIGNMENTS TO YOUR     00004000
//* SHOP STANDARDS AS APPROPRIATE.                                      00005000
//*------------------------------------------------------------------   00006000
//STEP1 EXEC PGM=IEFBR14                                                00007000
//DBRMLIB  DD  DSN=BNKCA.RP50.DBRMLIB,DISP=(NEW,CATLG),                 00008000
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=9040),                    00009000
//             VOL=SER=VVVVVV,UNIT=BNKDEV,                              00010000
//             SPACE=(CYL,(1,1,50))                                     00011000
//*                                                                     00012000
//
