//DB2RPS04 JOB
//*-------------------------------------------------------------------  00001000
//* IKJEFT01 - DB2 CREATE TABLESPACE - RPS BK170                        00002000
//*-------------------------------------------------------------------  00003000
//TABLESP  EXEC PGM=IKJEFT01,REGION=4096K,DYNAMNBR=20                   00004000
//STEPLIB  DD  DSN=your.DB2.SDSNLOAD,DISP=SHR                           00005000
//         DD  DSN=your.DB2.RUNLIB,DISP=SHR                             00006000
//SYSPRINT DD  SYSOUT=*                                                 00007000
//SYSUDUMP DD  SYSOUT=*                                                 00008000
//SYSTSPRT DD  SYSOUT=*                                                 00009000
//*                                                                     00010000
//SYSTSIN  DD  DSN=BNKCA.BI15.SAMPLE.DATA(DB2DSNnn),DISP=SHR            00011000
//         DD  DSN=BNKCA.BI15.SAMPLE.DATA(DB2RUNnn),DISP=SHR            00012000
//*                                                                     00013000
//SYSIN    DD  DSN=BNKCA.BI15.SAMPLE.DATA(DB2USER),DISP=SHR             00014000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G01TABS),DISP=SHR             00015000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G02TABS),DISP=SHR             00016000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G03TABS),DISP=SHR             00017000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G04TABS),DISP=SHR             00018000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G05TABS),DISP=SHR             00019000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G06TABS),DISP=SHR             00020000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G07TABS),DISP=SHR             00021000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G08TABS),DISP=SHR             00022000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G09TABS),DISP=SHR             00023000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G10TABS),DISP=SHR             00024000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G11TABS),DISP=SHR             00025000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G12TABS),DISP=SHR             00026000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G13TABS),DISP=SHR             00027000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G14TABS),DISP=SHR             00028000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G30TABS),DISP=SHR             00029000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G31TABS),DISP=SHR             00030000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G32TABS),DISP=SHR             00031000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G33TABS),DISP=SHR             00032000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G34TABS),DISP=SHR             00033000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G35TABS),DISP=SHR             00034000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G36TABS),DISP=SHR             00035000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G37TABS),DISP=SHR             00036000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G38TABS),DISP=SHR             00037000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G39TABS),DISP=SHR             00038000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G40TABS),DISP=SHR             00039000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G41TABS),DISP=SHR             00040000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G42TABS),DISP=SHR             00041000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G43TABS),DISP=SHR             00042000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(G44TABS),DISP=SHR             00043000
//*                                                                     00044000
//
