//DB2RPS02 JOB
//**********************************************************************00001000
//** Compile/Assemble All DB2 Modules                                 **00002000
//**********************************************************************00003000
//** Infopoint Product: RP  Release: 5.0  Putlevel: 01                **00004000
//** Description: INFOPOINT RELATIONSHIP PRICING                      **00005000
//**********************************************************************00006000
//** BEFORE EXECUTING THIS PROCEDURE:                                 **00007000
//**                                                                  **00008000
//** 1. Check all symbolics and JCL for your site assignments.        **00009000
//**    Be sure to change the CLASS and TIME JOB CARD parameters      **00010000
//**    for a long running job.                                       **00011000
//**                                                                  **00012000
//** 2. If the assembler system libraries are not included in the     **00013000
//**    system LINK-LIST, uncomment and assign the correct library    **00014000
//**    to the SYSASSM symbolic, and uncomment the STEPLIB line in    **00015000
//**    the ASM step.                                                 **00016000
//**                                                                  **00017000
//** 3. Change all the system and product library names and add       **00018000
//**    additional libraries as appropriate to your site.             **00019000
//**                                                                  **00020000
//** 4. Check all DB2 library names are correct for your site.        **00021000
//**                                                                  **00022000
//** 5. Verify the compile PARM statement options are correct for     **00023000
//**    your site.                                                    **00024000
//**                                                                  **00025000
//** 6. Review the submission and execution instructions for these    **00026000
//**    nested procedures at the end of this member.                  **00027000
//**                                                                  **00028000
//** 7. After all the mass compiles/assemblies are completed:         **00029000
//**                                                                  **00030000
//**     - execute the BNKLKEDD procedure to relink the system if     **00031000
//**       using the COBOL DYNAM compile option, or                   **00032000
//**                                                                  **00033000
//**     - execute the BNKLKED procedure to relink the system if      **00034000
//**       using the COBOL NODYNAM compile option.                    **00035000
//**                                                                  **00036000
//** NOTE:  This procedure link-edits the program object to the       **00037000
//**        product library in LKED1.  Change as required.            **00038000
//**                                                                  **00039000
//**********************************************************************00040000
//**********************************************************************00041000
//** This is a nested procedure.  After making all applicable JCL     **00042000
//** changes, separately uncomment each of the execute procedure      **00043000
//** statements at the end of this job, and submit for execution.     **00044000
//** The separate execution of each nested procedure will avoid       **00045000
//** the EXCESSIVE NUMBER OF EXECUTE STATEMENTS error.                **00046000
//**********************************************************************00047000
//**********************************************************************00048000
//BCOBDB2 PROC M=XXXXXX,                                                00049000
//        COMPPGM='IGYCRCTL',                     COMPILER              00050000
//        SYSCOMP='your.system.compiler.lib',     SYSTEM COBOL LIBRARY  00051000
//        SRCLIN1='BNKCA.RP50.COBOL.SOURCE',  SOURCE LIBRARY            00052000
//        CPYLIN1='BNKCA.RP50.COBOL.COPYLIB', COPYBOOK LIBRARY          00053000
//        SCEELNK='your.LE.lib.SCEELKED',         LE LINK EDIT LIBRARY  00054000
//        DSNLOAD='your.DB2.SDSNLOAD',            DB2 DSN LOAD LIBRARY  00055000
//        DB2RUN='your.DB2.RUNLIB',               DB2 RUNLIB LIBRARY    00056000
//        DSNEXIT='your.DB2.SDSNEXIT',            DB2 SDSNEXIT LIBRARY  00057000
//        LOADOUT='BNKCA.RP50.LOADLIB',       OUTPUT LOAD LIBRARY       00058000
//        DBRMLIB='BNKCA.RP50.DBRMLIB'        OUTPUT DBRM LIBRARY       00059000
//**********************************************************************00060000
//*                                                                     00061000
//***************************************************************       00062000
//** PRECOMPILE THE DB2 PROGRAM                                **       00063000
//***************************************************************       00064000
//PRECOMP  EXEC PGM=DSNHPC,REGION=4096K,                                00065000
//             PARM='HOST(IBMCOB),SOURCE,APOSTSQL'                      00066000
//STEPLIB  DD  DSN=&DSNEXIT,DISP=SHR                                    00067000
//         DD  DSN=&DSNLOAD,DISP=SHR                                    00068000
//         DD  DSN=&DB2RUN,DISP=SHR                                     00069000
//DBRMLIB  DD  DSN=&DBRMLIB(&M),DISP=SHR                                00070000
//SYSPRINT DD  SYSOUT=*                                                 00071000
//SYSTERM  DD  SYSOUT=*                                                 00072000
//SYSUDUMP DD  SYSOUT=*                                                 00073000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(3,1))                             00074000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(CYL,(3,1))                             00075000
//SYSLIB   DD  DSN=&CPYLIN1,DISP=SHR                                    00076000
//SYSCIN   DD  DSN=&&SYSCIN,DISP=(,PASS),                               00077000
//             UNIT=SYSDA,SPACE=(CYL,(5,5)),                            00078000
//             DCB=BLKSIZE=3120                                         00079000
//SYSIN    DD  DSN=&SRCLIN1(&M),DISP=SHR                                00080000
//*                                                                     00081000
//COB     EXEC PGM=&COMPPGM,COND=(5,LT,PRECOMP),                        00082000
//             PARM=('OPT(STD),MAP,OFF,TRUNC(OPT)',                     00083000
//             DYNAM,RENT,NOTEST,TERM,NONUMBER,LIB)                     00084000
//STEPLIB  DD  DSN=&SYSCOMP,DISP=SHR                                    00085000
//SYSPRINT DD  SYSOUT=*,DCB=RECFM=A                                     00086000
//SYSPUNCH DD  SYSOUT=*                                                 00087000
//SYSTERM  DD  SYSOUT=C                                                 00088000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(10,5))                            00089000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(CYL,(10,5))                            00090000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(CYL,(10,5))                            00091000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(CYL,(10,5))                            00092000
//SYSUT5   DD  UNIT=SYSDA,SPACE=(CYL,(10,5))                            00093000
//SYSUT6   DD  UNIT=SYSDA,SPACE=(CYL,(10,5))                            00094000
//SYSUT7   DD  UNIT=SYSDA,SPACE=(CYL,(10,5))                            00095000
//SYSLIB   DD  DSN=&CPYLIN1,DISP=SHR                                    00096000
//SYSLIN   DD  DSN=&&LOADSET,DISP=(MOD,PASS),                           00097000
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE)                       00098000
//SYSIN    DD  DSN=&&SYSCIN,DISP=(OLD,DELETE)                           00099000
//*                                                                     00100000
//LKED1    EXEC PGM=IEWL,COND=(5,LT,COB),                               00101000
//             PARM='XREF,LIST,LET,MAP,RENT'                            00102000
//SYSPRINT DD  SYSOUT=*                                                 00103000
//SYSLIB   DD  DSN=&DB2RUN,DISP=SHR                                     00104000
//         DD  DSN=&SCEELNK,DISP=SHR                                    00105000
//SYSLMOD  DD  DSN=&LOADOUT(&M),DISP=SHR                                00106000
//SYSUT1   DD  UNIT=SYSDA,DCB=BLKSIZE=1024,                             00107000
//             SPACE=(1024,(2000,20))                                   00108000
//SYSLIN   DD  DSN=&&LOADSET,DISP=(OLD,DELETE)                          00109000
//*                                                                     00110000
//**********************************************************************00111000
//** DELETE LOADSET IF COB FAILS                                      **00112000
//**********************************************************************00113000
//DELETE2 EXEC PGM=IEFBR14,COND=(5,GT,COB)                              00114000
//LOADSET  DD  DSN=&&LOADSET,DISP=(OLD,DELETE)                          00115000
//*                                                                     00116000
//        PEND                                                          00117000
//*                                                                     00118000
//*-------------------------------------------------------------------  00119000
//* DSNHPC   - TRANSLATE DB2 SQL I/O MODULES                            00120000
//*                                                                     00121000
//* ASMA90   - ASSEMBLE TRANSLATED SQL I/O MODULES                      00122000
//*                                                                     00123000
//* IEWL     - LINK EDIT SQL I/O MODULES                                00124000
//*-------------------------------------------------------------------  00125000
//* CHANGE THE MACLIB, DSNLOAD, DBRMLIB, OBJLIB AND LOADLIB LIBRARY     00126000
//* ASSIGNMENTS TO YOUR SHOP STANDARDS AS APPROPRIATE.                  00127000
//*-------------------------------------------------------------------  00128000
//BASSDB2  PROC M='XXXXXXX',                                            00129000
//             MACLIB='your.db2.SDSNMACS',                              00130000
//             DSNLOAD='your.db2.SDSNLOAD.',                            00131000
//             SRCLIN1='BNKCA.RP50.ASSEM.SOURCE',                       00132000
//             DBRMLIB='BNKCA.RP50.DBRMLIB',                            00133000
//             LOADOUT='BNKCA.RP50.LOADLIB',                            00134000
//             WORK=SYSDA                                               00135000
//DB2      EXEC PGM=DSNHPC,                                             00136000
//             PARM='HOST(ASM)'                                         00137000
//STEPLIB  DD  DSN=&DSNLOAD,DISP=SHR                                    00138000
//DBRMLIB  DD  DSN=&DBRMLIB(&M),DISP=SHR                                00139000
//SYSPRINT DD  SYSOUT=*                                                 00140000
//SYSTERM  DD  SYSOUT=*                                                 00141000
//SYSUDUMP DD  SYSOUT=*                                                 00142000
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=&WORK,SPACE=(CYL,(10,5))               00143000
//SYSCIN   DD  DSN=&&SYSCIN,                                            00144000
//             DISP=(,PASS),UNIT=&WORK,                                 00145000
//             DCB=BLKSIZE=3120,                                        00146000
//             SPACE=(CYL,(5,5))                                        00147000
//SYSIN    DD  DSN=&SRCLIN1(&M),DISP=SHR                                00148000
//ASM      EXEC PGM=ASMA90,PARM='RENT,OBJECT,NODECK',COND=(4,LT,DB2)    00149000
//SYSPRINT DD  SYSOUT=*                                                 00150000
//SYSLIB   DD  DSN=&MACLIB,DISP=SHR                                     00151000
//         DD  DSN=SYS1.MACLIB,DISP=SHR                                 00152000
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=&WORK,SPACE=(CYL,(10,5))               00153000
//SYSUT2   DD  DSN=&&SYSUT2,UNIT=&WORK,SPACE=(CYL,(10,5))               00154000
//SYSUT3   DD  DSN=&&SYSUT3,UNIT=&WORK,SPACE=(CYL,(10,5))               00155000
//SYSIN    DD  DSN=&&SYSCIN,DISP=(OLD,DELETE)                           00156000
//SYSLIN   DD  DSN=&&LOADSET,DISP=(NEW,PASS,DELETE),                    00157000
//             UNIT=&WORK,SPACE=(80,(250,100))                          00158000
//LKED     EXEC PGM=IEWL,                                               00159000
//             PARM='RENT,XREF,LIST',COND=((4,LT,DB2),(4,LT,ASM))       00160000
//SYSPRINT DD  SYSOUT=*                                                 00161000
//SYSLIB   DD  DSN=&DSNLOAD,DISP=SHR                                    00162000
//SYSLMOD  DD  DSN=&LOADOUT(&M),DISP=SHR                                00163000
//SYSUT1   DD  UNIT=&WORK,DCB=BLKSIZE=1024,SPACE=(1024,(2000,20))       00164000
//SYSLIN   DD  DSN=&&LOADSET,DISP=(OLD,DELETE)                          00165000
//**********************************************************************00166000
//** DELETE LOADSET IF ASM FAILS                                      **00167000
//**********************************************************************00168000
//DELETE  EXEC PGM=IEFBR14,COND=(5,GT,ASM)                              00169000
//LOADSET  DD  DSN=&&LOADSET,DISP=(OLD,DELETE)                          00170000
//*                                                                     00171000
//         PEND                                                         00172000
//*                                                                     00173000
//********************************************************************  00174000
//* PART 1                                                              00175000
//********************************************************************  00176000
//PART1   PROC                                                          00177000
//SAAIODB  EXEC BASSDB2,M=SAAIODB  *DB2 SQL I/O module for table ACT    00178000
//SAARDB   EXEC BASSDB2,M=SAARDB   *DB2 SQL I/O MODULE                  00179000
//SAAUDB   EXEC BASSDB2,M=SAAUDB   *DB2 SQL I/O MODULE                  00180000
//SABIODB  EXEC BASSDB2,M=SABIODB  *DB2 SQL I/O module for table BNK    00181000
//SABRDB   EXEC BASSDB2,M=SABRDB   *DB2 SQL I/O MODULE                  00182000
//SABUDB   EXEC BASSDB2,M=SABUDB   *DB2 SQL I/O MODULE                  00183000
//SACIODB  EXEC BASSDB2,M=SACIODB  *DB2 SQL I/O module for table IDX    00184000
//SACRDB   EXEC BASSDB2,M=SACRDB   *DB2 SQL I/O MODULE                  00185000
//SACUDB   EXEC BASSDB2,M=SACUDB   *DB2 SQL I/O MODULE                  00186000
//SADIODB  EXEC BASSDB2,M=SADIODB  *DB2 SQL I/O module for table INT    00187000
//SADRDB   EXEC BASSDB2,M=SADRDB   *DB2 SQL I/O MODULE                  00188000
//SADUDB   EXEC BASSDB2,M=SADUDB   *DB2 SQL I/O MODULE                  00189000
//SAEIODB  EXEC BASSDB2,M=SAEIODB  *DB2 SQL I/O module for table LOG    00190000
//SAERDB   EXEC BASSDB2,M=SAERDB   *DB2 SQL I/O MODULE                  00191000
//SAEUDB   EXEC BASSDB2,M=SAEUDB   *DB2 SQL I/O MODULE                  00192000
//SAFIODB  EXEC BASSDB2,M=SAFIODB  *DB2 SQL I/O module for table MST    00193000
//SAFRDB   EXEC BASSDB2,M=SAFRDB   *DB2 SQL I/O MODULE                  00194000
//SAFUDB   EXEC BASSDB2,M=SAFUDB   *DB2 SQL I/O MODULE                  00195000
//SAGIODB  EXEC BASSDB2,M=SAGIODB  *DB2 SQL I/O module for table QUA    00196000
//SAGRDB   EXEC BASSDB2,M=SAGRDB   *DB2 SQL I/O MODULE                  00197000
//SAGUDB   EXEC BASSDB2,M=SAGUDB   *DB2 SQL I/O MODULE                  00198000
//SAHIODB  EXEC BASSDB2,M=SAHIODB  *DB2 SQL I/O module for table REL    00199000
//SAHRDB   EXEC BASSDB2,M=SAHRDB   *DB2 SQL I/O MODULE                  00200000
//SAHUDB   EXEC BASSDB2,M=SAHUDB   *DB2 SQL I/O MODULE                  00201000
//SAIIODB  EXEC BASSDB2,M=SAIIODB  *DB2 SQL I/O module for table SEC    00202000
//SAIRDB   EXEC BASSDB2,M=SAIRDB   *DB2 SQL I/O MODULE                  00203000
//SAIUDB   EXEC BASSDB2,M=SAIUDB   *DB2 SQL I/O MODULE                  00204000
//SAJIODB  EXEC BASSDB2,M=SAJIODB  *DB2 SQL I/O module for table SYC    00205000
//SAJRDB   EXEC BASSDB2,M=SAJRDB   *DB2 SQL I/O MODULE                  00206000
//SAJUDB   EXEC BASSDB2,M=SAJUDB   *DB2 SQL I/O MODULE                  00207000
//SAKIODB  EXEC BASSDB2,M=SAKIODB  *DB2 SQL I/O module for table CRW    00208000
//SAKRDB   EXEC BASSDB2,M=SAKRDB   *DB2 SQL I/O MODULE                  00209000
//SAKUDB   EXEC BASSDB2,M=SAKUDB   *DB2 SQL I/O MODULE                  00210000
//SALIODB  EXEC BASSDB2,M=SALIODB  *DB2 SQL I/O module for table TRM    00211000
//SALRDB   EXEC BASSDB2,M=SALRDB   *DB2 SQL I/O MODULE                  00212000
//SALUDB   EXEC BASSDB2,M=SALUDB   *DB2 SQL I/O MODULE                  00213000
//SAMIODB  EXEC BASSDB2,M=SAMIODB  *DB2 SQL I/O module for table EVT    00214000
//SAMRDB   EXEC BASSDB2,M=SAMRDB   *DB2 SQL I/O MODULE                  00215000
//SAMUDB   EXEC BASSDB2,M=SAMUDB   *DB2 SQL I/O MODULE                  00216000
//SANIODB  EXEC BASSDB2,M=SANIODB  *DB2 SQL I/O module for table ENR    00217000
//SANRDB   EXEC BASSDB2,M=SANRDB   *DB2 SQL I/O MODULE                  00218000
//SANUDB   EXEC BASSDB2,M=SANUDB   *DB2 SQL I/O MODULE                  00219000
//S00RDB   EXEC BASSDB2,M=S00RDB   *DB2 SQL I/O MODULE                  00220000
//S00IODB  EXEC BASSDB2,M=S00IODB  *DB2 SQL I/O Module for S00          00221000
//S00UDB   EXEC BASSDB2,M=S00UDB   *DB2 SQL I/O MODULE                  00222000
//S01RDB   EXEC BASSDB2,M=S01RDB   *DB2 SQL I/O MODULE                  00223000
//S01IODB  EXEC BASSDB2,M=S01IODB  *DB2 SQL I/O Module for S01          00224000
//S01UDB   EXEC BASSDB2,M=S01UDB   *DB2 SQL I/O MODULE                  00225000
//S02IODB  EXEC BASSDB2,M=S02IODB  *DB2 SQL I/O Module for S02          00226000
//S02RDB   EXEC BASSDB2,M=S02RDB   *DB2 SQL I/O MODULE                  00227000
//S02UDB   EXEC BASSDB2,M=S02UDB   *DB2 SQL I/O MODULE                  00228000
//S03RDB   EXEC BASSDB2,M=S03RDB   *DB2 SQL I/O MODULE                  00229000
//S03IODB  EXEC BASSDB2,M=S03IODB  *DB2 SQL I/O Module for S03          00230000
//S03UDB   EXEC BASSDB2,M=S03UDB   *DB2 SQL I/O MODULE                  00231000
//S04RDB   EXEC BASSDB2,M=S04RDB   *DB2 SQL I/O MODULE                  00232000
//S04IODB  EXEC BASSDB2,M=S04IODB  *DB2 SQL I/O Module for S04          00233000
//S04UDB   EXEC BASSDB2,M=S04UDB   *DB2 SQL I/O MODULE                  00234000
//S05RDB   EXEC BASSDB2,M=S05RDB   *DB2 SQL I/O MODULE                  00235000
//S05IODB  EXEC BASSDB2,M=S05IODB  *DB2 SQL I/O Module for S05          00236000
//S05UDB   EXEC BASSDB2,M=S05UDB   *DB2 SQL I/O MODULE                  00237000
//S06RDB   EXEC BASSDB2,M=S06RDB   *DB2 SQL I/O MODULE                  00238000
//S06IODB  EXEC BASSDB2,M=S06IODB  *DB2 SQL I/O Module for S06          00239000
//        PEND                                                          00240000
//*                                                                     00241000
//********************************************************************  00242000
//* PART 2                                                              00243000
//********************************************************************  00244000
//PART2   PROC                                                          00245000
//S06UDB   EXEC BASSDB2,M=S06UDB   *DB2 SQL I/O MODULE                  00246000
//S07RDB   EXEC BASSDB2,M=S07RDB   *DB2 SQL I/O MODULE                  00247000
//S07IODB  EXEC BASSDB2,M=S07IODB  *DB2 SQL I/O Module for S07          00248000
//S07UDB   EXEC BASSDB2,M=S07UDB   *DB2 SQL I/O MODULE                  00249000
//S08RDB   EXEC BASSDB2,M=S08RDB   *DB2 SQL I/O MODULE                  00250000
//S08IODB  EXEC BASSDB2,M=S08IODB  *DB2 SQL I/O Module for S08          00251000
//S08UDB   EXEC BASSDB2,M=S08UDB   *DB2 SQL I/O MODULE                  00252000
//S09RDB   EXEC BASSDB2,M=S09RDB   *DB2 SQL I/O MODULE                  00253000
//S09IODB  EXEC BASSDB2,M=S09IODB  *DB2 SQL I/O Module for S09          00254000
//S09UDB   EXEC BASSDB2,M=S09UDB   *DB2 SQL I/O MODULE                  00255000
//S10RDB   EXEC BASSDB2,M=S10RDB   *DB2 SQL I/O MODULE                  00256000
//S10IODB  EXEC BASSDB2,M=S10IODB  *DB2 SQL I/O Module for S10          00257000
//S10UDB   EXEC BASSDB2,M=S10UDB   *DB2 SQL I/O MODULE                  00258000
//S11RDB   EXEC BASSDB2,M=S11RDB   *DB2 SQL I/O MODULE                  00259000
//S11IODB  EXEC BASSDB2,M=S11IODB  *DB2 SQL I/O Module for S11          00260000
//S11UDB   EXEC BASSDB2,M=S11UDB   *DB2 SQL I/O MODULE                  00261000
//S12RDB   EXEC BASSDB2,M=S12RDB   *DB2 SQL I/O MODULE                  00262000
//S12IODB  EXEC BASSDB2,M=S12IODB  *DB2 SQL I/O Module for S12          00263000
//S12UDB   EXEC BASSDB2,M=S12UDB   *DB2 SQL I/O MODULE                  00264000
//S13RDB   EXEC BASSDB2,M=S13RDB   *DB2 SQL I/O MODULE                  00265000
//S13IODB  EXEC BASSDB2,M=S13IODB  *DB2 SQL I/O Module for S13          00266000
//S13UDB   EXEC BASSDB2,M=S13UDB   *DB2 SQL I/O MODULE                  00267000
//S14RDB   EXEC BASSDB2,M=S14RDB   *DB2 SQL I/O MODULE                  00268000
//S14IODB  EXEC BASSDB2,M=S14IODB  *DB2 SQL I/O Module for S14          00269000
//S14UDB   EXEC BASSDB2,M=S14UDB   *DB2 SQL I/O MODULE                  00270000
//        PEND                                                          00271000
//*                                                                     00272000
//********************************************************************  00273000
//** Separately uncomment each one of the following execute             00274000
//** procedure statements, and submit this job for execution.           00275000
//** The separate execution of each nested procedure will avoid         00276000
//** the EXCESSIVE NUMBER OF EXECUTE STATEMENTS error.                  00277000
//********************************************************************  00278000
//*        EXEC PROC=PART1                                              00279000
//*        EXEC PROC=PART2                                              00280000
//*                                                                     00281000
//
