//DB2RPS03 JOB
//*-------------------------------------------------------------------  00001000
//* IKJEFT01 - DB2 CREATE DATABASE - RPS BK170                          00002000
//*-------------------------------------------------------------------  00003000
//DATABASE EXEC PGM=IKJEFT01,REGION=4096K,DYNAMNBR=20                   00004000
//STEPLIB  DD  DSN=your.DB2.SDSNLOAD,DISP=SHR                           00005000
//         DD  DSN=your.DB2.RUNLIB,DISP=SHR                             00006000
//SYSPRINT DD  SYSOUT=*                                                 00007000
//SYSUDUMP DD  SYSOUT=*                                                 00008000
//SYSTSPRT DD  SYSOUT=*                                                 00009000
//*                                                                     00010000
//SYSTSIN  DD  DSN=BNKCA.BI15.SAMPLE.DATA(DB2DSNnn),DISP=SHR            00011000
//         DD  DSN=BNKCA.BI15.SAMPLE.DATA(DB2RUNnn),DISP=SHR            00012000
//*                                                                     00013000
//SYSIN    DD  DSN=BNKCA.BI15.SAMPLE.DATA(DB2USER),DISP=SHR             00014000
//         DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPS170DB),DISP=SHR            00015000
//*                                                                     00016000
//
