//DPVSAMDD JOB
//*    **********************************************                   00001000
//*    * DPVSAMDD - DEPOSITS VSAM API DD STATEMENTS *                   00002000
//*    **********************************************                   00003000
//DPFL01   DD  DSN=BNKCAV.IN0.DP85.DPFL01,DISP=SHR                      00004000
//DPFL02   DD  DSN=BNKCAV.IN0.DP85.DPFL02,DISP=SHR                      00005000
//DPFL03   DD  DSN=BNKCAV.IN0.DP85.DPFL03,DISP=SHR                      00006000
//DPFL04   DD  DSN=BNKCAV.IN0.DP85.DPFL04,DISP=SHR                      00007000
//DPFL05   DD  DSN=BNKCAV.IN0.DP85.DPFL05,DISP=SHR                      00008000
//DPFL06   DD  DSN=BNKCAV.IN0.DP85.DPFL06,DISP=SHR                      00009000
//DPFL07   DD  DSN=BNKCAV.IN0.DP85.DPFL07,DISP=SHR                      00010000
//DPFL08   DD  DSN=BNKCAV.IN0.DP85.DPFL08,DISP=SHR                      00011000
//DPFL09   DD  DSN=BNKCAV.IN0.DP85.DPFL09,DISP=SHR                      00012000
//DPFL10   DD  DSN=BNKCAV.IN0.DP85.DPFL10,DISP=SHR                      00013000
//DPFL11   DD  DSN=BNKCAV.IN0.DP85.DPFL11,DISP=SHR                      00014000
//DPFL12   DD  DSN=BNKCAV.IN0.DP85.DPFL12,DISP=SHR                      00015000
//DPFL13   DD  DSN=BNKCAV.IN0.DP85.DPFL13,DISP=SHR                      00016000
//DPFL14   DD  DSN=BNKCAV.IN0.DP85.DPFL14,DISP=SHR                      00017000
//DPFL15   DD  DSN=BNKCAV.IN0.DP85.DPFL15,DISP=SHR                      00018000
//DPFL16   DD  DSN=BNKCAV.IN0.DP85.DPFL16,DISP=SHR                      00019000
//DPFL17   DD  DSN=BNKCAV.IN0.DP85.DPFL17,DISP=SHR                      00020000
//DPFL18   DD  DSN=BNKCAV.IN0.DP85.DPFL18,DISP=SHR                      00021000
//DPFL19   DD  DSN=BNKCAV.IN0.DP85.DPFL19,DISP=SHR                      00022000
//DPFL20   DD  DSN=BNKCAV.IN0.DP85.DPFL20,DISP=SHR                      00023000
//DPFL21   DD  DSN=BNKCAV.IN0.DP85.DPFL21,DISP=SHR                      00024000
//DPFL22   DD  DSN=BNKCAV.IN0.DP85.DPFL22,DISP=SHR                      00025000
//DPFL23   DD  DSN=BNKCAV.IN0.DP85.DPFL23,DISP=SHR                      00026000
//DPFL24   DD  DSN=BNKCAV.IN0.DP85.DPFL24,DISP=SHR                      00027000
//DPFL25   DD  DSN=BNKCAV.IN0.DP85.DPFL25,DISP=SHR                      00028000
//DPFL26   DD  DSN=BNKCAV.IN0.DP85.DPFL26,DISP=SHR                      00029000
//DPFL27   DD  DSN=BNKCAV.IN0.DP85.DPFL27,DISP=SHR                      00030000
//DPFL29   DD  DSN=BNKCAV.IN0.DP85.DPFL29,DISP=SHR                      00031000
//DPFL39   DD  DSN=BNKCAV.IN0.DP85.DPFL39,DISP=SHR                      00032000
//
