//RFVSAMDD JOB
//RFFL06   DD  DSN=BNKCAV.IN0.RF21.RFFL06,DISP=SHR                      00001000
//RFFL09   DD  DSN=BNKCAV.IN0.RF21.RFFL09,DISP=SHR                      00002000
//RFFL10   DD  DSN=BNKCAV.IN0.RF21.RFFL10,DISP=SHR                      00003000
//RFFL11   DD  DSN=BNKCAV.IN0.RF21.RFFL11,DISP=SHR                      00004000
//RFFL12   DD  DSN=BNKCAV.IN0.RF21.RFFL12,DISP=SHR                      00005000
//RFFL13   DD  DSN=BNKCAV.IN0.RF21.RFFL13,DISP=SHR                      00006000
//RFFL15   DD  DSN=BNKCAV.IN0.RF21.RFFL15,DISP=SHR                      00007000
//*RFFL17   DD  DSN=BNKCAV.IN0.RF21.RFFL17,DISP=SHR                     00008000
//*RFFL18   DD  DSN=BNKCAV.IN0.RF21.RFFL18,DISP=SHR                     00009000
//
