//RP50LOAD JOB
//********************************************************************* 00001000
//*      THIS JOB WILL LOAD ALL PANELS IN THE SEQUENTIAL BACKUP       * 00002000
//*      FILE TO THE MAPPER VSAM FILE                                 * 00003000
//********************************************************************* 00004000
//CAU$LOAD EXEC PGM=CAU$LOAD                                            00005000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//CAMAP    DD  DISP=SHR,DSN=BNKCAV.IN0.BI15.ENCAMAP                     00007000
//CADUMP   DD  DSN=BNKCA.IN0.RP50.ENCAMAP,                              00008000
//             DISP=(OLD,KEEP)                                          00009000
//SYSPRINT DD  SYSOUT=*                                                 00010000
//SYSIN    DD  *                                                        00011000
CAMAP * CADUMP REPLACE                                                  00012000
//
