//RP50LIST JOB
//*    *******************************************************          00001000
//*    * RP50LIST - LISTS ALL PANELS IN THE MAPPER VSAM FILE *          00002000
//*    *******************************************************          00003000
//CAU$LIST   EXEC PGM=CAU$LIST                                          00004000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//CAMAP     DD  DSN=BNKCAV.IN0.RP50.ENCAMAP,DISP=SHR                    00006000
//SYSPRINT  DD  SYSOUT=*                                                00007000
//SYSIN     DD  *                                                       00008000
CAMAP *                                                                 00009000
/*                                                                      00010000
//
