//RPD035D JOB
//*    ***************************************                          00001000
//*    * RPD035 - ONLINE MAINTENANCE EXTRACT *                          00002000
//*    ***************************************                          00003000
//*                                                                     00004000
//RPD035   EXEC PGM=RPD035,REGION=3000K                                 00005000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00007000
//SYSUDUMP DD  SYSOUT=*                                                 00008000
//SYSOUT   DD  SYSOUT=*                                                 00009000
//PRINTR   DD  SYSOUT=*                                                 00010000
//PRFICH   DD  SYSOUT=*                                                 00011000
//PRINTA   DD  SYSOUT=*                                                 00012000
//PRINTB   DD  SYSOUT=*                                                 00013000
//PRINTC   DD  SYSOUT=*                                                 00014000
//PRINTD   DD  SYSOUT=*                                                 00015000
//PRINTE   DD  SYSOUT=*                                                 00016000
//PRINTF   DD  SYSOUT=*                                                 00017000
//PRINTG   DD  SYSOUT=*                                                 00018000
//PRINTH   DD  SYSOUT=*                                                 00019000
//PRINTI   DD  SYSOUT=*                                                 00020000
//PRINTJ   DD  SYSOUT=*                                                 00021000
//PRNTR01  DD  SYSOUT=*                                                 00022000
//MILOGS   DD  DSN=BNKCA.IN0.RP50.MILOGS,DISP=(NEW,DELETE,DELETE),      00023000
//             UNIT=SYSDA,DCB=(RECFM=VB,LRECL=4282,BLKSIZE=11475),      00024000
//             SPACE=(CYL,(1,1),RLSE)                                   00025000
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//*                                                                     00027000
//MICARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD035),DISP=SHR              00028000
//*                                                                     00029000
//
