//RPD035S JOB
//*    ***************************************                          00001000
//*    * RPD035 - ONLINE MAINTENANCE EXTRACT *                          00002000
//*    ***************************************                          00003000
//*                                                                     00004000
//IDCAMS   EXEC PGM=IDCAMS,REGION=512K                                  00005000
//SYSPRINT DD  SYSOUT=*                                                 00006000
//SYSUDUMP DD  SYSOUT=*                                                 00007000
//*                                                                     00008000
//SYSIN    DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPRPTO),DISP=SHR              00009000
//*                                                                     00010000
//*                                                                     00011000
//RPD035   EXEC PGM=RPD035,PARM='ORG=(1)',REGION=3000K                  00012000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00014000
//SYSUDUMP DD  SYSOUT=*                                                 00015000
//SYSOUT   DD  SYSOUT=*                                                 00016000
//PRINTR   DD  SYSOUT=*                                                 00017000
//PRFICH   DD  SYSOUT=*                                                 00018000
//PRINTA   DD  SYSOUT=*                                                 00019000
//PRINTB   DD  SYSOUT=*                                                 00020000
//PRINTC   DD  SYSOUT=*                                                 00021000
//PRINTD   DD  SYSOUT=*                                                 00022000
//PRINTE   DD  SYSOUT=*                                                 00023000
//PRINTF   DD  SYSOUT=*                                                 00024000
//PRINTG   DD  SYSOUT=*                                                 00025000
//PRINTH   DD  SYSOUT=*                                                 00026000
//PRINTI   DD  SYSOUT=*                                                 00027000
//PRINTJ   DD  SYSOUT=*                                                 00028000
//PRNTR01  DD  SYSOUT=*                                                 00029000
//MILOGS   DD  DSN=BNKCA.IN0.RP50.MILOGS,DISP=(NEW,DELETE,DELETE),      00030000
//             UNIT=SYSDA,DCB=(RECFM=VB,LRECL=4282,BLKSIZE=11475),      00031000
//             SPACE=(CYL,(1,1),RLSE)                                   00032000
//MIAMTT   DD  DSN=BNKCAV.IN0.MI51.MIAMTT,DISP=SHR                      00033000
//MIFMST   DD  DSN=BNKCAV.IN0.MI51.MIFMST,DISP=SHR                      00034000
//MIFCSR   DD  DSN=BNKCAV.IN0.MI51.MIFCSR,DISP=SHR                      00035000
//MIHDTS   DD  DSN=BNKCAV.IN0.MI51.MIHD50,DISP=SHR                      00036000
//RPRPTO   DD  DSN=BNKCAV.IN0.RP50.RPRPTO,DISP=SHR                      00037000
//RPFLOG   DD  DSN=BNKCAV.IN0.RP50.RPFLOG,DISP=SHR                      00038000
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//*                                                                     00040000
//MICARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD035),DISP=SHR              00041000
//*                                                                     00042000
//
