//RPD015D JOB
//*    ************************************************                 00001000
//*    * RPD015 - RPT INIT                            *                 00002000
//*    ************************************************                 00003000
//*                                                                     00004000
//RPD015   EXEC  PGM=RPD015,REGION=1024K                                00005000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00007000
//SYSUDUMP DD  SYSOUT=*                                                 00008000
//SYSOUT   DD  SYSOUT=*                                                 00009000
//*                                                                     00010000
//
