//RPD110 JOB
//*   **************************************************                00001000
//*   *                                                *                00002000
//*   * RPD110 - CREATE FILE FOR EXPIRED RELATIONSHIPS *                00003000
//*   *          WITH A DEFAULT MODE.                  *                00004000
//*   *                                                *                00005000
//*    *************************************************                00006000
//SCRATCH  EXEC PGM=IEFBR14                                             00007000
//RPMSTW   DD  DSN=BNKCA.IN0.RP50.RPMSTW,                               00008000
//             DISP=(MOD,DELETE,DELETE),                                00009000
//             UNIT=SYSDA,                                              00010000
//             SPACE=(TRK,(1,1),RLSE)                                   00011000
//*                                                                     00012000
//RPD110   EXEC PGM=RPD110,REGION=1024K                                 00013000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00015000
//SYSUDUMP DD  SYSOUT=*                                                 00016000
//SYSOUT   DD  SYSOUT=*                                                 00017000
//MIFMST   DD  DSN=BNKCAV.IN0.MI51.MIFMST,DISP=SHR                      00018000
//MIFCSR   DD  DSN=BNKCAV.IN0.MI51.MIFCSR,DISP=SHR                      00019000
//RPMSTW   DD  DSN=BNKCA.IN0.RP50.RPMSTW,                               00020000
//             DISP=(NEW,CATLG,DELETE),                                 00021000
//             UNIT=SYSDA,                                              00022000
//             DCB=(RECFM=FB,LRECL=0048,BLKSIZE=23472),                 00023000
//             SPACE=(CYL,(2,1),RLSE)                                   00024000
//*    *************************************************                00001000
//*    * RPVSAMDD - REL PRICING VSAM API DD STATEMENTS *                00002000
//*    *************************************************                00003000
//RPFACT   DD  DSN=BNKCAV.IN0.RP50.RPFACT,DISP=SHR                      00004000
//RPFBNK   DD  DSN=BNKCAV.IN0.RP50.RPFBNK,DISP=SHR                      00005000
//RPFCRW   DD  DSN=BNKCAV.IN0.RP50.RPFCRW,DISP=SHR                      00006000
//RPFENR   DD  DSN=BNKCAV.IN0.RP50.RPFENR,DISP=SHR                      00007000
//RPFEVT   DD  DSN=BNKCAV.IN0.RP50.RPFEVT,DISP=SHR                      00008000
//RPFIDX   DD  DSN=BNKCAV.IN0.RP50.RPFIDX,DISP=SHR                      00009000
//RPFINT   DD  DSN=BNKCAV.IN0.RP50.RPFINT,DISP=SHR                      00010000
//RPFLOG   DD  DSN=BNKCAV.IN0.RP50.RPFLOG,DISP=SHR                      00011000
//RPFMST   DD  DSN=BNKCAV.IN0.RP50.RPFMST,DISP=SHR                      00012000
//RPFQUA   DD  DSN=BNKCAV.IN0.RP50.RPFQUA,DISP=SHR                      00013000
//RPFREL   DD  DSN=BNKCAV.IN0.RP50.RPFREL,DISP=SHR                      00014000
//RPFSEC   DD  DSN=BNKCAV.IN0.RP50.RPFSEC,DISP=SHR                      00015000
//RPFSYC   DD  DSN=BNKCAV.IN0.RP50.RPFSYC,DISP=SHR                      00016000
//RPFTRM   DD  DSN=BNKCAV.IN0.RP50.RPFTRM,DISP=SHR                      00017000
//RPRPTS   DD  DSN=BNKCAV.IN0.RP50.RPRPTS,DISP=SHR                      00026000
//*                                                                     00027000
//
