//RPD126LC JOB
//***************************************************************       00001000
//*       LOAD INTERFACE WAREHOUSE INFORMATION FILE             *       00002000
//***************************************************************       00003000
//RPD126IC EXEC PGM=IDCAMS,REGION=512K,COND=(0,LT)                      00004000
//SYSUDUMP DD   SYSOUT=*                                                00005000
//SYSABOUT DD   SYSOUT=*                                                00006000
//SYSOUT   DD   SYSOUT=*                                                00007000
//SYSPRINT DD   SYSOUT=*                                                00008000
//*                                                                     00009000
//SYSIN    DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPFINTC),DISP=SHR             00010000
//*                                                                     00011000
//*                                                                     00012000
//********************************************************************  00013000
//*                                                                  *  00014000
//*   LOAD EXTRACTED RECORDS INTO RELATIONSHIP PRICING VSAM FILES    *  00015000
//*                                                                  *  00016000
//********************************************************************  00017000
//*                                                                     00018000
//RPD126LC EXEC PGM=BIS863B,REGION=4096K,COND=(0,LT)                    00019000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//BIPUTIL  DD  DSN=BNKCA.IN0.RP50.BLDINTC,                              00021000
//             DISP=(OLD,KEEP,KEEP),                                    00022000
//             DCB=BUFNO=20                                             00023000
//BIPDSK1  DD  DSN=&&BIPDSK1,DISP=(,DELETE,DELETE),                     00024000
//             UNIT=SYSDA,SPACE=(CYL,(2,2),RLSE),                       00025000
//             DCB=(RECFM=VB,LRECL=2015,BLKSIZE=16300)                  00026000
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//*    ************************************************************     00001000
//*    * RPVSAMDC - REL PRICING VSAM API DD SCALABLE C STATEMENTS *     00002000
//*    ************************************************************     00003000
//RPFACT   DD  DSN=BNKCAV.IN0.RP50.RPFACT,DISP=SHR                      00004000
//RPFBNK   DD  DSN=BNKCAV.IN0.RP50.RPFBNK,DISP=SHR                      00005000
//RPFCRW   DD  DSN=BNKCAV.IN0.RP50.RPFCRW,DISP=SHR                      00006000
//RPFIDX   DD  DSN=BNKCAV.IN0.RP50.RPFIDX,DISP=SHR                      00007000
//RPFINTC  DD  DSN=BNKCAV.IN0.RP50.RPFINTC,DISP=SHR                     00008000
//RPFLOG   DD  DSN=BNKCAV.IN0.RP50.RPFLOG,DISP=SHR                      00009000
//RPFMSTC  DD  DSN=BNKCAV.IN0.RP50.RPFMSTC,DISP=SHR                     00010000
//RPFQUA   DD  DSN=BNKCAV.IN0.RP50.RPFQUA,DISP=SHR                      00011000
//RPFRELC  DD  DSN=BNKCAV.IN0.RP50.RPFRELC,DISP=SHR                     00012000
//RPFSEC   DD  DSN=BNKCAV.IN0.RP50.RPFSEC,DISP=SHR                      00013000
//RPFSYC   DD  DSN=BNKCAV.IN0.RP50.RPFSYC,DISP=SHR                      00014000
//RPFTRMC  DD  DSN=BNKCAV.IN0.RP50.RPFTRMC,DISP=SHR                     00015000
//BNKPRT1  DD  SYSOUT=*                                                 00029000
//SYSOUT   DD  SYSOUT=*                                                 00030000
//SYSPRINT DD  SYSOUT=*                                                 00031000
//* DSNTRACE DD  DUMMY                                                  00032000
//SYSIN    DD   *                                                       00033000
IPRP BNK INFOPNT  EN BIS863B  0 L 0                                     00034000
END                                                                     00035000
SAD     C                                                               00036000
END                                                                     00037000
/*                                                                      00038000
//
