//RPD100D JOB
//*    ************************                                         00001000
//*    * RPD100 -  ENROLLMENT *                                         00002000
//*    ************************                                         00003000
//RPD100   EXEC PGM=RPD100,REGION=1024K                                 00004000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00006000
//SYSUDUMP DD  SYSOUT=*                                                 00007000
//SYSOUT   DD  SYSOUT=*                                                 00008000
//*                                                                     00009000
//RPCARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD100),DISP=SHR              00010000
//*                                                                     00011000
/*                                                                      00012000
//
