//RPD250D JOB
//SCRATCH  EXEC PGM=IEFBR14,COND=(0,LT)                                 00001000
//RPTRNWS  DD  DSN=BNKCA.IN0.RP50.RPTRNWS,DISP=(MOD,DELETE,DELETE),     00002000
//             UNIT=SYSDA,SPACE=(TRK,(1,1),RLSE)                        00003000
//*                                                                     00004000
//RPD250   EXEC PGM=RPD250,REGION=1024K,COND=(0,LT)                     00005000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00007000
//SYSUDUMP DD  SYSOUT=*                                                 00008000
//SYSOUT   DD  SYSOUT=*                                                 00009000
//RPTRNW   DD  DSN=BNKCA.IN0.RP50.RPTRNW,DISP=(OLD,KEEP,KEEP)           00010000
//RPTRNWS  DD  DSN=BNKCA.IN0.RP50.RPTRNWS,DISP=(NEW,CATLG,DELETE),      00011000
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=43,BLKSIZE=27993),        00012000
//             SPACE=(CYL,(1,1),RLSE)                                   00013000
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//
