//RPD200C JOB
//*    *************************************************                00001000
//*    * RPD200 - RELATIONSHIP PRICING BALANCE POSTING *                00002000
//*    *************************************************                00003000
//RPD200SC EXEC PGM=IEFBR14                                             00004000
//RPACTW   DD  DSN=BNKCA.IN0.RP50.RPACTWC,                              00005000
//             DISP=(MOD,DELETE,DELETE),                                00006000
//             UNIT=SYSDA,                                              00007000
//             SPACE=(TRK,(1,1),RLSE)                                   00008000
//RPPODX   DD  DSN=BNKCA.IN0.RP50.RPPODXC,                              00009000
//             DISP=(MOD,DELETE,DELETE),                                00010000
//             UNIT=SYSDA,                                              00011000
//             SPACE=(TRK,(1,1),RLSE)                                   00012000
//RPCRWW   DD  DSN=BNKCA.IN0.RP50.RPCRWWC,                              00013000
//             DISP=(MOD,DELETE,DELETE),                                00014000
//             UNIT=SYSDA,                                              00015000
//             SPACE=(TRK,(1,1),RLSE)                                   00016000
//*                                                                     00017000
//RPD200C  EXEC PGM=RPD200,PARM='ORG=(C)',REGION=1024K                  00018000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*                                                 00020000
//SYSUDUMP DD  SYSOUT=*                                                 00021000
//SYSOUT   DD  SYSOUT=*                                                 00022000
//MIFMST   DD  DSN=BNKCAV.IN0.MI51.MIFMST,DISP=SHR                      00023000
//MIFCSR   DD  DSN=BNKCAV.IN0.MI51.MIFCSR,DISP=SHR                      00024000
//RPACTW   DD  DSN=BNKCA.IN0.RP50.RPACTWC,                              00025000
//             DISP=(NEW,CATLG,DELETE),                                 00026000
//             UNIT=SYSDA,                                              00027000
//             DCB=(RECFM=FB,LRECL=0439,BLKSIZE=27657),                 00028000
//             SPACE=(CYL,(2,1),RLSE)                                   00029000
//RPPODX   DD  DSN=BNKCA.IN0.RP50.RPPODXC,                              00030000
//             DISP=(NEW,CATLG,DELETE),                                 00031000
//             UNIT=SYSDA,                                              00032000
//             DCB=(RECFM=FB,LRECL=0107,BLKSIZE=27927),                 00033000
//             SPACE=(CYL,(2,1),RLSE)                                   00034000
//RPCRWW   DD  DSN=BNKCA.IN0.RP50.RPCRWWC,                              00035000
//             DISP=(NEW,CATLG,DELETE),                                 00036000
//             UNIT=SYSDA,                                              00037000
//             DCB=(RECFM=FB,LRECL=0226,BLKSIZE=27798),                 00038000
//             SPACE=(CYL,(2,1),RLSE)                                   00039000
//*    ************************************************************     00001000
//*    * RPVSAMDC - REL PRICING VSAM API DD SCALABLE C STATEMENTS *     00002000
//*    ************************************************************     00003000
//RPFACT   DD  DSN=BNKCAV.IN0.RP50.RPFACT,DISP=SHR                      00004000
//RPFBNK   DD  DSN=BNKCAV.IN0.RP50.RPFBNK,DISP=SHR                      00005000
//RPFCRW   DD  DSN=BNKCAV.IN0.RP50.RPFCRW,DISP=SHR                      00006000
//RPFIDX   DD  DSN=BNKCAV.IN0.RP50.RPFIDX,DISP=SHR                      00007000
//RPFINTC  DD  DSN=BNKCAV.IN0.RP50.RPFINTC,DISP=SHR                     00008000
//RPFLOG   DD  DSN=BNKCAV.IN0.RP50.RPFLOG,DISP=SHR                      00009000
//RPFMSTC  DD  DSN=BNKCAV.IN0.RP50.RPFMSTC,DISP=SHR                     00010000
//RPFQUA   DD  DSN=BNKCAV.IN0.RP50.RPFQUA,DISP=SHR                      00011000
//RPFRELC  DD  DSN=BNKCAV.IN0.RP50.RPFRELC,DISP=SHR                     00012000
//RPFSEC   DD  DSN=BNKCAV.IN0.RP50.RPFSEC,DISP=SHR                      00013000
//RPFSYC   DD  DSN=BNKCAV.IN0.RP50.RPFSYC,DISP=SHR                      00014000
//RPFTRMC  DD  DSN=BNKCAV.IN0.RP50.RPFTRMC,DISP=SHR                     00015000
//RFFL06   DD  DSN=BNKCAV.IN0.RF21.RFFL06,DISP=SHR                      00001000
//RFFL09   DD  DSN=BNKCAV.IN0.RF21.RFFL09,DISP=SHR                      00002000
//RFFL10   DD  DSN=BNKCAV.IN0.RF21.RFFL10,DISP=SHR                      00003000
//RFFL11   DD  DSN=BNKCAV.IN0.RF21.RFFL11,DISP=SHR                      00004000
//RFFL12   DD  DSN=BNKCAV.IN0.RF21.RFFL12,DISP=SHR                      00005000
//RFFL13   DD  DSN=BNKCAV.IN0.RF21.RFFL13,DISP=SHR                      00006000
//RFFL15   DD  DSN=BNKCAV.IN0.RF21.RFFL15,DISP=SHR                      00007000
//*RFFL17   DD  DSN=BNKCAV.IN0.RF21.RFFL17,DISP=SHR                     00008000
//*RFFL18   DD  DSN=BNKCAV.IN0.RF21.RFFL18,DISP=SHR                     00009000
//RPRPTS   DD  DSN=BNKCAV.IN0.RP50.RPRPTSC,DISP=SHR                     00042000
//*                                                                     00043000
//RPCARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD200),DISP=SHR              00044000
//*                                                                     00045000
/*                                                                      00046000
//
