//RPD241L JOB
//***************************************************************       00001000
//*       LOAD IDENTIFICATION XREF RECORDS                      *       00002000
//***************************************************************       00003000
//RPD241I  EXEC PGM=IDCAMS,REGION=512K,COND=(0,LT)                      00004000
//SYSUDUMP DD   SYSOUT=1                                                00005000
//SYSABOUT DD   SYSOUT=3                                                00006000
//SYSOUT   DD   SYSOUT=6                                                00007000
//SYSPRINT DD   SYSOUT=5                                                00008000
//*                                                                     00009000
//SYSIN    DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPFIDX),DISP=SHR              00010000
//*                                                                     00011000
//*                                                                     00012000
//********************************************************************  00013000
//*                                                                  *  00014000
//*   LOAD EXTRACTED RECORDS INTO RELATIONSHIP PRICING VSAM FILES    *  00015000
//*                                                                  *  00016000
//********************************************************************  00017000
//*                                                                     00018000
//RPD241L  EXEC PGM=BIS863B,REGION=4096K,COND=(0,LT)                    00019000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//BIPUTIL  DD  DSN=BNKCA.IN0.RP50.BLDIDX,                               00021000
//             DISP=(OLD,KEEP,KEEP),                                    00022000
//             DCB=BUFNO=20                                             00023000
//BIPDSK1  DD  DSN=&&BIPDSK1,DISP=(,DELETE,DELETE),                     00024000
//             UNIT=SYSDA,SPACE=(CYL,(2,2),RLSE),                       00025000
//             DCB=(RECFM=VB,LRECL=2015,BLKSIZE=16300)                  00026000
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//*    *************************************************                00001000
//*    * RPVSAMDD - REL PRICING VSAM API DD STATEMENTS *                00002000
//*    *************************************************                00003000
//RPFACT   DD  DSN=BNKCAV.IN0.RP50.RPFACT,DISP=SHR                      00004000
//RPFBNK   DD  DSN=BNKCAV.IN0.RP50.RPFBNK,DISP=SHR                      00005000
//RPFCRW   DD  DSN=BNKCAV.IN0.RP50.RPFCRW,DISP=SHR                      00006000
//RPFENR   DD  DSN=BNKCAV.IN0.RP50.RPFENR,DISP=SHR                      00007000
//RPFEVT   DD  DSN=BNKCAV.IN0.RP50.RPFEVT,DISP=SHR                      00008000
//RPFIDX   DD  DSN=BNKCAV.IN0.RP50.RPFIDX,DISP=SHR                      00009000
//RPFINT   DD  DSN=BNKCAV.IN0.RP50.RPFINT,DISP=SHR                      00010000
//RPFLOG   DD  DSN=BNKCAV.IN0.RP50.RPFLOG,DISP=SHR                      00011000
//RPFMST   DD  DSN=BNKCAV.IN0.RP50.RPFMST,DISP=SHR                      00012000
//RPFQUA   DD  DSN=BNKCAV.IN0.RP50.RPFQUA,DISP=SHR                      00013000
//RPFREL   DD  DSN=BNKCAV.IN0.RP50.RPFREL,DISP=SHR                      00014000
//RPFSEC   DD  DSN=BNKCAV.IN0.RP50.RPFSEC,DISP=SHR                      00015000
//RPFSYC   DD  DSN=BNKCAV.IN0.RP50.RPFSYC,DISP=SHR                      00016000
//RPFTRM   DD  DSN=BNKCAV.IN0.RP50.RPFTRM,DISP=SHR                      00017000
//BNKPRT1  DD  SYSOUT=*                                                 00029000
//SYSOUT   DD  SYSOUT=*                                                 00030000
//SYSPRINT DD  SYSOUT=*                                                 00031000
//* DSNTRACE DD  DUMMY                                                  00032000
//SYSIN    DD   *                                                       00033000
IPRP BNK INFOPNT  EN BIS863B  0 L 0                                     00034000
END                                                                     00035000
SAC                                                                     00036000
/*                                                                      00037000
//*                                                                     00038000
//
