//RPD241LD JOB
//*    **************************************************************   00001000
//*    * RPD241I   BIS864B - DELETE DATA BASE RECORD IDX (RPFIDX)       00002000
//*    **************************************************************   00003000
//*                                                                     00004000
//RPD241I  EXEC PGM=BIS864B,REGION=1024K                                00005000
//BNKPRT1  DD SYSOUT=*                                                  00006000
//SYSOUT   DD SYSOUT=*                                                  00007000
//SYSPRINT DD SYSOUT=*                                                  00008000
//SYSUDUMP DD SYSOUT=*                                                  00009000
//* DSNTRACE DD SYSOUT=*                                                00010000
//SYSIN    DD   *                                                       00011000
IPRP BNK RPDBSDEF EN          N                                         00012000
END                                                                     00013000
SAC                                                                     00014000
END                                                                     00015000
/*                                                                      00016000
//*                                                                     00017000
//********************************************************************  00018000
//*                                                                  *  00019000
//*   LOAD EXTRACTED RECORDS INTO RELATIONSHIP PRICING VSAM FILES    *  00020000
//*                                                                  *  00021000
//********************************************************************  00022000
//*                                                                     00023000
//RPD241L  EXEC PGM=BIS863B,REGION=4096K,COND=(0,LT)                    00024000
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//BIPUTIL  DD  DSN=BNKCA.IN0.RP50.BLDIDX,                               00026000
//             DISP=(OLD,KEEP,KEEP),                                    00027000
//             DCB=BUFNO=20                                             00028000
//BIPDSK1  DD  DSN=&&BIPDSK1,DISP=(,DELETE,DELETE),                     00029000
//             UNIT=SYSDA,SPACE=(CYL,(2,2),RLSE),                       00030000
//             DCB=(RECFM=VB,LRECL=2015,BLKSIZE=16300)                  00031000
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(50))
//BNKPRT1  DD  SYSOUT=*                                                 00033000
//SYSOUT   DD  SYSOUT=*                                                 00034000
//SYSPRINT DD  SYSOUT=*                                                 00035000
//* DSNTRACE DD  DUMMY                                                  00036000
//SYSIN    DD   *                                                       00037000
IPRP BNK INFOPNT  EN BIS863B  0 L 0                                     00038000
END                                                                     00039000
SAC                                                                     00040000
/*                                                                      00041000
//*                                                                     00042000
//
