//RPD350 JOB
//*    *****************************
//*    * RPD350 - STOCK FORM PRINT *
//*    *****************************
//SCRATCH  EXEC PGM=IEFBR14
//PRINTK   DD  DSN=BNKCA.IN0.MI51.PRINTK,DISP=(MOD,DELETE,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(1,1),RLSE)
//*
//RPD350   EXEC PGM=RPD350,REGION=2048K
//STEPLIB  DD  DSN=BNKCA.RP50.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.BI15.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.MI51.LOADLIB,DISP=SHR
//         DD  DSN=BNKCA.RF21.LOADLIB,DISP=SHR
//*** INSERT OTHER SUPPORTING LIBRARIES AS APPROPRIATE ***
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//PRINTR   DD  SYSOUT=*
//PRFICH   DD  SYSOUT=*
//PRINTA   DD  SYSOUT=*
//PRINTB   DD  SYSOUT=*
//PRINTC   DD  SYSOUT=*
//PRINTD   DD  SYSOUT=*
//PRINTE   DD  SYSOUT=*
//PRINTF   DD  SYSOUT=*
//PRINTG   DD  SYSOUT=*
//PRINTH   DD  SYSOUT=*
//PRINTI   DD  SYSOUT=*
//PRINTJ   DD  SYSOUT=*
//PRNTR01  DD  SYSOUT=*
//PRNTRST  DD  SYSOUT=*                                                 00603000
//MIFMST   DD  DSN=BNKCAV.IN0.MI51.MIFMST,DISP=SHR
//MIFCSR   DD  DSN=BNKCAV.IN0.MI51.MIFCSR,DISP=SHR
//*    *************************************************                00001000
//*    * RPVSAMDD - REL PRICING VSAM API DD STATEMENTS *                00002000
//*    *************************************************                00003000
//RPFACT   DD  DSN=BNKCAV.IN0.RP50.RPFACT,DISP=SHR                      00004000
//RPFBNK   DD  DSN=BNKCAV.IN0.RP50.RPFBNK,DISP=SHR                      00005000
//RPFCRW   DD  DSN=BNKCAV.IN0.RP50.RPFCRW,DISP=SHR                      00006000
//RPFENR   DD  DSN=BNKCAV.IN0.RP50.RPFENR,DISP=SHR                      00007000
//RPFEVT   DD  DSN=BNKCAV.IN0.RP50.RPFEVT,DISP=SHR                      00008000
//RPFIDX   DD  DSN=BNKCAV.IN0.RP50.RPFIDX,DISP=SHR                      00009000
//RPFINT   DD  DSN=BNKCAV.IN0.RP50.RPFINT,DISP=SHR                      00010000
//RPFLOG   DD  DSN=BNKCAV.IN0.RP50.RPFLOG,DISP=SHR                      00011000
//RPFMST   DD  DSN=BNKCAV.IN0.RP50.RPFMST,DISP=SHR                      00012000
//RPFQUA   DD  DSN=BNKCAV.IN0.RP50.RPFQUA,DISP=SHR                      00013000
//RPFREL   DD  DSN=BNKCAV.IN0.RP50.RPFREL,DISP=SHR                      00014000
//RPFSEC   DD  DSN=BNKCAV.IN0.RP50.RPFSEC,DISP=SHR                      00015000
//RPFSYC   DD  DSN=BNKCAV.IN0.RP50.RPFSYC,DISP=SHR                      00016000
//RPFTRM   DD  DSN=BNKCAV.IN0.RP50.RPFTRM,DISP=SHR                      00017000
//RPRPT3   DD  DSN=BNKCA.IN0.RP50.RPRPT3,DISP=(OLD,KEEP,KEEP)           00607000
//PRINTK   DD  DSN=BNKCA.IN0.MI51.PRINTK,DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=0133,BLKSIZE=11438),
//             SPACE=(CYL,(1,1),RLSE)
//*
//RPCARD   DD  DSN=BNKCA.RP50.SAMPLE.DATA(RPD350),DISP=SHR
//*
//
