//TESTJOB1 JOB EXAMPLE
//******************************
//STEP1   EXEC PROCX
//******************************
//PROCX   PROC
//STEP2   EXEC PGM=CBLPGM
//DD1     DD DSN=TEST.DNS,DISP=SHR
//******************************
//DUPSTEP EXEC PROCX
//******************************
//DUPSTEP EXEC PROCX
//******************************