//PROC1  PROC  MYID='NA',CLSX=X,CLSJ=J,CLSL=L
//PS010 EXEC PGM=IKJEFT01          
//SYSIN  DD DSN=AAPLIB.NM.CARDLIB(CPY1),DISP=SHR                    