//ME7920A JOB RISWAN,'TEST',CLASS=A,
// REGION=0M,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//PROCA     PROC
//PROCAS1   EXEC PGM=IEFBR14
//DD1       DD DSN=RISWAN.A.FILE1,DISP=(MOD,DELETE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800),
//             SPACE=(TRK,1,RLSE)
//I0       IF (PROCAS1.RC>=80) THEN
//PROCAS2  EXEC PGM=IEFBR14
//DD1      DD DSN=RISWAN.A.FILE2,DISP=(MOD,DELETE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800),
//            SPACE=(TRK,1,RLSE)
//         ELSE
//PROCAS3  EXEC PGM=IEFBR14
//DD1      DD DSN=RISWAN.A.FILE3,DISP=(MOD,DELETE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800),
//            SPACE=(TRK,1,RLSE)
//I0       ENDIF
//         PEND
//*
//JOBSTEP  EXEC PROCA