//TEST9301 JOB (A,X,29UT00),'00  ADB/PLR   &:YWC',                      JOB01943
//         USER=XXXX,MSGCLASS=T                                         00020000
//UNLODDAT EXEC PGM=IKJEFT01,DYNAMNBR=20                                00100000
//STEPLIB  DD DISP=SHR,DSN=AXXXA1.DB2.SDSNEXIT                          00110000
//         DD DISP=SHR,DSN=AXXXA1.DB2.SDSNLOAD                                  
//         DD DISP=SHR,DSN=AXXXA1.DB2.RUNLIB.LOAD                                                                                                                                                              00220000
//SYSIN    DD *                                                         00230000
  SET CURRENT SQLID = 'AX29UTDA' ;                                      00250000
  SELECT                                                                        
   E.LST_NAME                                                                   
  ,E.FRST_NAME                                                                  
  ,B.CNTR_PFX_ID||SUBSTR(A.CNTR_NUM,2,5)                                        
  ,(CASE F.AGNT_CLASS_CD                                                        
   WHEN '0001'   THEN  'S AGENT'                                  
   WHEN '0002'   THEN  'GRADUATE'                                     
   WHEN '0003'   THEN  'C L AGENT'                                       
   ELSE ' '  END)                                                               
  ,(CASE                                                                        
    WHEN F.AGNT_CLASS_CD IS NULL THEN  ' '                                      
    ELSE F.AGNT_CLASS_CD  END)                                                  
  ,(CASE F1.AGNT_CLASS_CD                                                       
    WHEN '0001'   THEN  'SALES MANAGER'                             
    WHEN '0002'   THEN  'MANAGER FINANCIAL'                            
    WHEN '0003'   THEN  'PROTOTYPE MANAGER'                               
    ELSE ' ' END)                                                               
  ,(CASE                                                                        
    WHEN F1.AGNT_CLASS_CD IS NULL THEN ' '                                      
    ELSE F1.AGNT_CLASS_CD END)                                                  
  ,SUBSTR(A.FINAL_CD,1,1)                                                       
  ,G.STAT_CD_DESCR                                                              
  ,A.EN_DT                                                                      
  ,T1.LIC_EXAM_VAL                                                              
  ,T1.LIC_EXAM_EFF_DT                                                           
  ,T1.LIC_EXAM_SCORE_NUM                                             
  ,T2.STATUS_NAME                                                               
  FROM TESTOA A                                                                 
      ,TESTOA_DTL B, TESTPERS E                                                 
      ,TESTCLASS F LEFT OUTER JOIN TESTCLASS F1 ON                              
               F.NEWCO_CNTR_NUM = F1.NEWCO_CNTR_NUM                             
           AND F1.REL_FINAL_CD = 'A'                                            
           AND F1.CLASS_TYP_CD = '0002'                                         
      ,TESTCONTRACT_STAT_CD G                                                   
      ,TEST_EXAM T1, TEST_CD T2                                          
 WHERE A.FINAL_CD = 'A00'                                                       
   AND A.CNTR_NUM = F.NEWCO_CNTR_NUM                                            
   AND F.REL_FINAL_CD = 'A'                                                     
   AND F.CLASS_TYP_CD = '0007'                                                  
   AND A.MKTR_FOCAL_SUBJ_ID = E.SUBJ_ID                                         
   AND A.CNTR_NUM = B.OA_CNTR_NUM                                               
   AND B.CRT_TS = (SELECT MAX(CRT_TS) FROM TESTOA_DTL                           
                    WHERE B.OA_CNTR_NUM = OA_CNTR_NUM                           
                 AND (PRIR_CONTR_IND IS NULL OR  PRIR_CONTR_IND = ' '))         
   AND T1.SSN_NUM = E.SSN_NUM                                                   
   AND T1.STATUS_CD = T2.STATUS_CD                                              
   AND SUBSTR(A.FINAL_CD,1,1) = G.STAT_CD                                       
                                                                                
   UNION                                                                        
                                                                                
   SELECT                                                                       
    E.LST_NAME                                                                  
   ,E.FRST_NAME                                                                 
   ,A.CNTR_NUM                                                                  
   ,(CASE F.AGNT_CLASS_CD                                                       
    WHEN '0001'   THEN  'SALES MANAGER'                             
    WHEN '0002'   THEN  'MANAGER FINANCIAL'                            
    WHEN '0003'   THEN  'PROTOTYPE MANAGER'                                  
     ELSE ' ' END)                                                              
  ,(CASE                                                                        
    WHEN F.AGNT_CLASS_CD IS NULL THEN  ' '                                      
    ELSE F.AGNT_CLASS_CD  END)                                                  
  ,(CASE F1.AGNT_CLASS_CD                                                       
    WHEN '0001'   THEN  'SALES MANAGER'                             
    WHEN '0002'   THEN  'MANAGER SERVICES'                            
    WHEN '0003'   THEN  'PROTOTYPE SALES MANAGER'                               
    WHEN '0004'   THEN  'PLANNING SALES MANAGER'                                
    WHEN '0005'   THEN  'AGENCY RECRUITER'                                      
    WHEN '0006'   THEN  'DIRECT HIRE MANAGER'                                   
    WHEN '0007'   THEN  'FIELD SUPERVISOR'                                      
    WHEN '0008'   THEN  'AGENCY TRAINER'                                        
    ELSE ' ' END)                                                               
  ,(CASE                                                                        
    WHEN F1.AGNT_CLASS_CD IS NULL THEN ' '                                      
    ELSE F1.AGNT_CLASS_CD END)                                                  
  ,SUBSTR(A.FINAL_CD,1,1)                                                       
  ,G.STAT_CD_DESCR                                                              
  ,A.EN_DT                                                                      
  ,T1.LIC_EXAM_VAL                                                              
  ,T1.LIC_EXAM_EFF_DT                                                           
  ,T1.LIC_EXAM_SCORE_NUM                                             
  ,T2.STATUS_NAME                                                               
  FROM                                                                          
          TESTDA A,                                                             
          TESTPERS E,                                                           
          TESTCLASS F                                                           
          LEFT OUTER JOIN                                                       
          TESTCLASS F1                                                          
          ON                                                                    
              F.NEWCO_CNTR_NUM = F1.NEWCO_CNTR_NUM AND                          
              F1.REL_FINAL_CD = 'A' AND                                         
              F1.CLASS_TYP_CD = '0002',                                         
          TESTCONTRACT_STAT_CD G,                                               
          TEST_EXAM T1,                                                       
          TEST_CD T2                                                       
      WHERE                                                                     
          A.FINAL_CD IN ('A00', 'M00', 'L00', 'E00') AND                        
          A.CNTR_NUM = F.NEWCO_CNTR_NUM AND                                     
          F.REL_FINAL_CD = 'A' AND                                              
          F.CLASS_TYP_CD = '0007' AND                                           
          A.MKTR_FOCAL_SUBJ_ID = E.SUBJ_ID AND                                  
          T1.SSN_NUM = E.SSN_NUM AND                                            
          T1.STATUS_CD = T2.STATUS_CD AND                                       
          SUBSTR (A.FINAL_CD,                                                   
                  1,                                                            
                  1) = G.STAT_CD                                                
                                                                                
      UNION                                                                     
                                                                                
          SELECT                                                                
              E.LST_NAME,                                                       
              E.FRST_NAME,                                                      
              B.CNTR_PFX_ID || SUBSTR (A.CNTR_NUM,                              
                                       2,                                       
                                       5)                                       
                                                                                
,(CASE F.AGNT_CLASS_CD                                                          
WHEN '0001'   THEN  'SALES MANAGER'                             
WHEN '0002'   THEN  'MANAGER FINANCIAL'                            
WHEN '0003'   THEN  'PROTOTYPE MANAGER'                                       
ELSE ' '  END)                                                                  
,(CASE                                                                          
  WHEN F.AGNT_CLASS_CD IS NULL THEN  ' '                                        
  ELSE F.AGNT_CLASS_CD  END)                                                    
,(CASE F1.AGNT_CLASS_CD                                                         
WHEN '0001'   THEN  'SALES MANAGER'                             
WHEN '0002'   THEN  'MANAGER SERVICES'                            
WHEN '0003'   THEN  'PROTOTYPE SALES MANAGER'                               
WHEN '0004'   THEN  'PLANNING SALES MANAGER'                                
WHEN '0005'   THEN  'AGENCY RECRUITER'                                      
WHEN '0006'   THEN  'DIRECT HIRE MANAGER'                                   
WHEN '0007'   THEN  'FIELD SUPERVISOR'                                      
WHEN '0008'   THEN  'AGENCY TRAINER'ELSE ' ' END)                                                                   
,(CASE                                                                          
  WHEN F1.AGNT_CLASS_CD IS NULL THEN ' '                                        
  ELSE F1.AGNT_CLASS_CD END)                                                    
,SUBSTR(A.FINAL_CD,1,1)                                                         
,G.STAT_CD_DESCR                                                                
,A.EN_DT                                                                        
,T1.LIC_EXAM_VAL                                                                
,T1.LIC_EXAM_EFF_DT                                                             
,T1.LIC_EXAM_SCORE_NUM                                               
,T2.STATUS_NAME                                                                 
  FROM                                                                          
          TESTOA A,                                                             
          TESTOA_DTL B,                                                         
          TESTPERS E,                                                           
          TESTCLASS F                                                           
          LEFT OUTER JOIN                                                       
          TESTCLASS F1                                                          
          ON                                                                    
              F.NEWCO_CNTR_NUM = F1.NEWCO_CNTR_NUM AND                          
              F1.REL_FINAL_CD = 'A' AND                                         
              F1.CLASS_TYP_CD = '0002',                                         
          TESTCONTRACT_STAT_CD G,                                               
          TEST_EXAM T1,                                                       
          TEST_CD T2                                                       
     WHERE                                                                      
             A.FINAL_CD <> 'A00' AND                                            
             A.EN_DT >= '2016-01-01' AND                                        
             A.CNTR_NUM = F.NEWCO_CNTR_NUM AND                                  
             F.REL_FINAL_CD = 'A' AND                                           
             F.CLASS_TYP_CD = '0007' AND                                        
             A.MKTR_FOCAL_SUBJ_ID = E.SUBJ_ID AND                               
             A.CNTR_NUM = B.OA_CNTR_NUM AND                                     
             B.CRT_TS = (SELECT MAX (CRT_TS)                                    
                         FROM TESTOA_DTL                                        
                         WHERE                                                  
                             B.OA_CNTR_NUM = OA_CNTR_NUM AND                    
                             (PRIR_CONTR_IND IS NULL OR                         
                              PRIR_CONTR_IND = ' ')) AND                        
             T1.SSN_NUM = E.SSN_NUM AND                                         
             T1.STATUS_CD = T2.STATUS_CD AND                                    
             SUBSTR (A.FINAL_CD,                                                
                     1,                                                         
                     1) = G.STAT_CD                                             
                                                                                
      UNION                                                                     
                                                                                
          SELECT                                                                
              E.LST_NAME                                                        
             ,E.FRST_NAME                                                       
             ,A.CNTR_NUM                                                        
   ,(CASE F.AGNT_CLASS_CD                                                       
    WHEN '0001'   THEN  'SALES MANAGER'                             
    WHEN '0002'   THEN  'MANAGER FINANCIAL'                            
    WHEN '0003'   THEN  'PROTOTYPE MANAGER'
    ELSE ' ' END)                                                                
,(CASE                                                                          
  WHEN F.AGNT_CLASS_CD IS NULL THEN  ' '                                        
  ELSE F.AGNT_CLASS_CD  END)                                                    
   ,(CASE F1.AGNT_CLASS_CD                                                      
   WHEN '0001'   THEN  'SALES MANAGER'                             
   WHEN '0002'   THEN  'MANAGER SERVICES'                            
   WHEN '0003'   THEN  'PROTOTYPE SALES MANAGER'                               
   WHEN '0004'   THEN  'PLANNING SALES MANAGER'                                
   WHEN '0005'   THEN  'AGENCY RECRUITER'                                      
   WHEN '0006'   THEN  'DIRECT HIRE MANAGER'                                   
   WHEN '0007'   THEN  'FIELD SUPERVISOR'                                      
   WHEN '0008'   THEN  'AGENCY TRAINER'                                         
   ELSE ' ' END)                                                                
,(CASE                                                                          
  WHEN F1.AGNT_CLASS_CD IS NULL THEN ' '                                        
  ELSE F1.AGNT_CLASS_CD END)                                                    
   ,SUBSTR(A.FINAL_CD,1,1)                                                      
   ,G.STAT_CD_DESCR                                                             
   ,A.EN_DT                                                                     
   ,T1.LIC_EXAM_VAL                                                             
   ,T1.LIC_EXAM_EFF_DT                                                          
   ,T1.LIC_EXAM_SCORE_NUM                                            
   ,T2.STATUS_NAME                                                              
   FROM TESTDA A                                                                
   , TESTPERS E                                                                 
   , TESTCLASS F LEFT OUTER JOIN TESTCLASS F1 ON                                
           F.NEWCO_CNTR_NUM = F1.NEWCO_CNTR_NUM                                 
     AND F1.REL_FINAL_CD = 'A'                                                  
     AND F1.CLASS_TYP_CD = '0002'                                               
   , TESTCONTRACT_STAT_CD G                                                     
   , TEST_EXAM T1, TEST_CD T2                                            
   WHERE  A.FINAL_CD NOT IN ( 'A00' , 'M00', 'L00' , 'E00')                     
      AND A.EN_DT >= '2016-01-01'                                               
      AND A.CNTR_NUM = F.NEWCO_CNTR_NUM                                         
      AND F.REL_FINAL_CD = 'A'                                                  
      AND F.CLASS_TYP_CD = '0007'                                               
      AND A.MKTR_FOCAL_SUBJ_ID = E.SUBJ_ID                                      
      AND T1.SSN_NUM = E.SSN_NUM                                                
     AND T1.STATUS_CD = T2.STATUS_CD                                            
     AND SUBSTR(A.FINAL_CD,1,1) = G.STAT_CD                                     
   ORDER BY  8,1,2,3;                                                           
//*********************************************************         