//UTP23801 JOB (A,X,29UT00)   
//PROCS JCLLIB ORDER=AX87CM.LBP.IIFS.PROC.JES.JCLLIB                        
//UTP23810 EXEC PROC=UTP23801,PROGRAM=UTP23801,                                 
//         DB2HLQ=AXXXA1,         DB2 HI-LEVEL LIBRARY QUAL                     
//         LOADLIB=AX87CM.LBP.CSC.LOADLIB, LOAD LIBRARY                         
//         SYSTEM=DBA1,           DB2 SUB-SYSTEM NAME                           
//         PLAN=UTPADB01,         DB2 PLAN NAME                                 
//         HIGHQUAL=AX29UT        HIGH LEVEL QUAL FOR FILES USED                
//*                                                                             
