DEFINE DATA         
  LOCAL 
    1 #PARAM1 (A1)
    1 #PARAM2 (A1)
END-DEFINE

DECIDE FOR FIRST CONDITION
	WHEN #PARAM1 EQ ' '
		WRITE 'param1 is empty'
	WHEN #PARAM2 EQ ' '
		IGNORE
	WHEN NONE 
		IGNORE
END-DECIDE

DECIDE ON FIRST VALUE OF #PARAM1
	VALUE ' '
		WRITE 'empty'
	VALUE 'A'
		WRITE 'A'
	NONE
		IGNORE
END-DECIDE

END