DEFINE DATA         
  LOCAL 
    1 #PARAM1 (A1)
    1 #PARAM2 (A1)
END-DEFINE

FOR #PARAM1 = 1 TO 10
	WRITE 'Iteration' #PARAM1
	PERFORM SUBR1 #PARAM2
	CALL 'PROG1'
	CALLNAT 'SUB1'
END-FOR

END