
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    ASMCBLC1.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD 1'
           .
      *    --------------------------------------------------
