
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    ASMCBLC3.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD 3'
           .
      *    --------------------------------------------------
