 M12428B: PROC OPTIONS(MAIN);
 
 DCL  M12428I    FILE RECORD INPUT ENV(VB RECSIZE(104));
 DCL  M12428O    FILE RECORD OUTPUT ENV(VB RECSIZE(104));

 DCL 1 MAIN_FIELD CHARACTER(50) VARYING;
 DCL 1 GRP BASED(ADDR(MAIN_FIELD)),
       2  FIX_BIN1 FIXED BINARY(15),
       2  FIRST_PART CHARACTER(26),
       2  FIX_BIN2 FIXED BINARY(15),
       2  SECND_PART CHARACTER(22);
       
       
 OPEN  FILE (M12428O);
 MAIN_FIELD = 'Hello World - VARYING with based group test 123456';
 WRITE FILE (M12428O) FROM (MAIN_FIELD);
 
 MAIN_FIELD = 'Smaller recrd';
 WRITE FILE (M12428O) FROM (MAIN_FIELD);
 CLOSE FILE (M12428O);
 
 
 OPEN  FILE (M12428I);
 READ FILE (M12428I) INTO (MAIN_FIELD);
 PUT SKIP LIST(GRP);
 
 READ FILE (M12428I) INTO (MAIN_FIELD);
 PUT SKIP LIST(GRP);
 CLOSE FILE (M12428I);
 
 END M12428B;