 Mainp: procedure;
  X = Sprod(A(B));
  PUT SKIP LIST('NESTED_PROCS');
  Sprod: procedure (U);
   put list (U);
  end Sprod;
  A: procedure (C);
   put list (C);
  end A;
  B: procedure;
   PUT SKIP LIST('INSIDE NESTED_PROC');
  end B;
 end Mainp;
