DEFINE DATA
LOCAL
1 #FLD (A10)
1 #CURSOR (I4)
END-DEFINE

FORMAT PS=100
FORMAT (0) PS=100
FORMAT (1) PS=100

WRITE 'THIS GOES TO UI'
WRITE (0) 'THIS GOES TO UI'
WRITE (1) 'THIS DOES NOT GO TO UI'

PRINT 'THIS GOES TO UI'
PRINT (0) 'THIS GOES TO UI'
PRINT (1) 'THIS DOES NOT GO TO UI'

DISPLAY 'THIS GOES TO UI'
DISPLAY (0) 'THIS GOES TO UI'
DISPLAY (1) 'THIS DOES NOT GO TO UI'

INPUT USING MAP 'WMIN1206M'
INPUT #FLD
INPUT 'CONSTANT VALUE' #FLD
INPUT WINDOW = 'MY-WND' '-' #FLD (AD=OI)
INPUT MARK #CURSOR #FLD
INPUT NO ERASE #FLD
INPUT WITH TEXT 'SOME TEXT (:1:)',#CURSOR #FLD

AT TOP OF PAGE
 SKIP 1
END-TOPPAGE

AT TOP OF PAGE (1)
 SKIP (1) 1
END-TOPPAGE

AT END OF PAGE
 SKIP 1
END-ENDPAGE

AT END OF PAGE (1)
 SKIP (1) 1
END-ENDPAGE

END
