105680 IDENTIFICATION DIVISION.
105690 PROGRAM-ID. COBOLP IS INITIAL PROGRAM.
105720 DATA DIVISION.
105730* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
105740*                                                    * * * * * * *
105750 WORKING-STORAGE SECTION.
106060 PROCEDURE DIVISION.