//JCL1   JOB
//STEP1  EXEC PGM=ADUUMAIN
//SYSIN  DD DSN=TEST.CTL.CRD(CNTL1),DISP=SHR
//  DD DSN=TEST.CTL.CRD(CNTL2),DISP=SHR
//  DD DSN=TEST.CTL.CRD(CNTL3),DISP=SHR
//  DD DSN=TEST.CTL.CRD(CNTL4),DISP=SHR
//  DD DSN=TEST.CTL.CRD(CNTL5),DISP=SHR
//  DD DSN=TEST.CTL.CRD(CNTL6),DISP=SHR