//WMIN4390 JOB INNO,'****',MSGCLASS=G,CLASS=D                                      
//JOBLIB    DD DSN=SOME.DSN.FOO,                                         
//             DISP=(SHR,KEEP,KEEP)                                                                                                      
//STEP1  EXEC PGM=MMRS7111,                                                  
// PARM='SERVER=ABC/ABC=4'                                                    
//SYSIN     DD *                                                                                                          
LOGON_DOMAIN=BAR                                                              
RUSER=*FOO                                                                   
