  P4435G: PROC(IO_PTR_PCB, DB_PTR_MAST, DB_PTR_SCND, DB_PTR_THRD) OPTIONS(MAIN);
  
    DCL IO_PTR_PCB POINTER;
    DCL DB_PTR_MAST POINTER;
    DCL DB_PTR_SCND POINTER;
    DCL DB_PTR_THRD POINTER;
    DCL DET_SEG_IO_AREA CHAR(100);
    DCL FUNC_PTR POINTER;
    
    DCL 1 HMCOMMON,
          2 FIELD1 CHAR(4),
          2 FIELD2 CHAR(4);
    
    DCL EXTPRC2 ENTRY(POINTER, POINTER, POINTER, POINTER) EXTERNAL;
    
    %INCLUDE FUNC;
  
    CALL MY_PROC;
    
    MY_PROC: PROC;
      CALL P$$$ZZ (HCOMMON, 3, FUNC_GU, DB_PTR_MAST, DET_SEG_IO_AREA);
      
      CALL EXTPRC2(IO_PTR_PCB, DB_PTR_MAST, DB_PTR_SCND, DB_PTR_THRD);
      
      CALL P$$$ZZ (HCOMMON, 3, FUNC_PTR->FUNC_REPL, DB_PTR_THRD, DET_SEG_IO_AREA);
      
    END MY_PROC;
   
  END;