//TEST JOB (6,DE24A000,PDPB),'TCSES',                                   00001000
//             MSGLEVEL=(1,1),       TYPRUN=SCAN,                       00002000
//             MSGCLASS=7,                                              00003000
//             CLASS=A,                                                 00004000
//             RESTART=*,                                               00005000
//             USER=DE01P01,                                            00006000
//             REGION=128M                                              00007000
//TESTSTEP    EXEC PGM=EZTPA00                                          00039900
//SYSIN    DD *
FILE TEST EXIT (MNOJOB)
FILE PQRJOB                                                             00000170
  DF-DATE       1  10 A                                                 00000180
JOB INPUT NULL                                                          00000250
  CALL DEFJOB
  DECLARE JKLJOB PROGRAM STATIC
  DISPLAY PQRJOB
  TRANSFER 'GHIJOB'
  LINK ABCJOB
  WRITE STUJOB