 BLK004A: PROCEDURE OPTIONS(MAIN); 
  DCL Blk004b EXTERNAL ENTRY;
  DCL Blk004c EXTERNAL ENTRY;
  put skip list("Before call to Blk004b");
  call Blk004b;
  put skip list("After call to Blk004b");
  put skip list("Before call to Blk004c");
  call Blk004c;
  put skip list("After call to Blk004c");
 END BLK004A;