 M10642H: PROCEDURE OPTIONS(MAIN);
    
    DCL EXTPRC1 ENTRY(CHAR(6) BYVALUE) EXTERNAL;
    DCL FIELD1 CHAR(6) INIT('123456');
    
    PUT SKIP LIST('BEFORE CALL');
    PUT SKIP LIST(FIELD1);
    
    CALL EXTPRC1(FIELD1);
    
    PUT SKIP LIST('AFTER CALL');
    PUT SKIP LIST(FIELD1);
    
 END M10642H;
