 M10642I: PACKAGE EXPORTS(EXTPRC1);

 EXTPRC1: PROC(PARAM1);
   DCL PARAM1 CHAR(6) BYVALUE;
   
   PUT SKIP LIST('IN EXT PROC');
   PUT SKIP LIST(PARAM1);
   PARAM1 = '111';
 END EXTPRC1;

 END M10642I;