       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILDSIB2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
        01 WS-ONE PIC 9 VALUE 1.
       PROCEDURE DIVISION.
           COMPUTE WS-ONE = WS-ONE * 2.
       END PROGRAM FILDSIB2.
