       IDENTIFICATION DIVISION.
       PROGRAM-ID. WC47CLLR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

        01 DUMMY PIC X(1).
        
        01 FIELDGRP.
           05 FIELD1 PIC X(1).
           05 FIELD2 PIC X(1).

       PROCEDURE DIVISION.
  
         CALL "TEST12a" USING DUMMY, FIELD1.
         CALL "TEST12a" USING DUMMY, FIELD2.

       END PROGRAM WC47PGM8.
