       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGMCPY02.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       COPY MISSING.

       PROCEDURE DIVISION.

         DISPLAY A.
         DISPLAY B.
         DISPLAY C.

       END PROGRAM PGMCPY02.
