DEFINE DATA LOCAL
  1 #A (A1)
  1 #B (A2)
END-DEFINE

DECIDE ON FIRST VALUE OF #A                                        
  VALUE 'BLUB'                                                           
    WRITE 'BLUB entered.'                                            
  VALUE 'BLAB'                                                           
    WRITE 'BLAB  entered.'                                            
  ANY VALUE                                                             
    WRITE 'BLUB or BLAB entered.'                                     
  NONE VALUE                                                            
    WRITE 'Neither BLUB nor BLAB key entered.'                            
END-DECIDE  

END
