DEFINE DATA
LOCAL
1 #VAR1 (I4)
END-DEFINE

DECIDE
  FOR
    FIRST
      CONDITION
    WHEN #VAR1 = 5 AND #VAR1 EQ 4
        WRITE NOTITLE '1'
    WHEN #VAR1 = 15
        IGNORE
    WHEN NONE 
        WRITE NOTITLE '1 NONE'
        DECIDE
             FOR
               FIRST
                 CONDITION
           WHEN #VAR1 = 5 AND #VAR1 EQ 4
               WRITE NOTITLE 'Nested 1'
           WHEN #VAR1 = 15
               IGNORE
           WHEN NONE 
               WRITE NOTITLE 'Nested 1 NONE'
           WHEN ANY 
               WRITE NOTITLE 'Nested 1 ANY'
        END-DECIDE
    WHEN ANY 
        WRITE NOTITLE '1 ANY'
END-DECIDE


DECIDE FOR EVERY CONDITION 
  WHEN #A >= 0        
    WRITE 'A >= 0'     
  WHEN #B <= 0        
    WRITE 'B <= 0'     
  WHEN ANY
    WRITE 'Any of the above conditions is true.'
  WHEN ALL
    WRITE '#FIELD1 is zero.'
    DECIDE FOR EVERY CONDITION 
      WHEN #A >= 0        
        WRITE 'Nested A >= 0'     
      WHEN #B <= 0        
        WRITE 'Nested B <= 0'     
      WHEN ANY
        WRITE 'Nested Any of the above conditions is true.'
      WHEN ALL
        WRITE 'Nested #FIELD1 is zero.'
      WHEN NONE
        IGNORE 
    END-DECIDE
  WHEN NONE
    IGNORE 
END-DECIDE

END
