       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TEST.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO COBOL'
      
