*PROGRAM-ID.   DCP646                                                   00010000
*****************************************************************       00050116
* CHANGE LOG:                                                 ***       00050216
******************************************************************      00052069
FILE MGOFILE            PRINTER  F(133)                                 00110000

%ESQLERR1

RPT--NAME                                W  12  A                       00190000
RPT-DATE                                 W   7  A                       00200000 
                                                                        00120000
%EZRACET                                                                01860067
%PGMZ012
                                                                        02080000
*****MGO  CURSOR*****************                                       02530000
JOB FILE JOB                                                            02540000
  SQL  DECLARE MGOCURS CURSOR FOR                    +                  02550000
       SELECT MGO_CLASS_DT,                          +                  02560000
       FROM   MGO_CLASS_HIST                         +                  02590000
       ORDER  BY MGO_CLASS_DT DESC
                                                                        02660000
                                                                        04141167
JOB INPUT NULL START GET-CONTROL                                        04141244
                                                                        04160321
                                                                        04161421
    PERFORM CHECKSQL                                                    04163221
    IF SQLCODE = 100                                                    04163322
      SQL CLOSE DISPCURS                                                04163422
      PERFORM CHECKSQL                                                  04163522
      STOP                                                              04163644
    END-IF                                                              04163722
                                                                        04163821