       IDENTIFICATION DIVISION.
       PROGRAM-ID. WC47CLLR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

        01 DUMMY PIC X(1).
        
        01 FIELD1 PIC X(1).

       PROCEDURE DIVISION.
  
         CALL "TEST13a" USING DUMMY, FIELD1.
         CALL "NOTHERE" USING DUMMY, FIELD1.         

       END PROGRAM WC47PGM8.
