DB: 001 FILE: 001  - DDM1                             DEFAULT SEQUENCE: .
TYPE: ADABAS

T L DB Name                              F Leng  S D Remark
- - -- --------------------------------  - ----  - - ------------------------
  1 AA AAA                               A    1   
******DDM OUTPUT TERMINATED******