DEFINE DATA
LOCAL USING CR0200A1
LOCAL USING PP0035A1 
LOCAL
1 PCR VIEW OF PCR-REPORT-DATES
  2 PCR-PROG-NAME
  2 PCR-PROG-DATE
  2 LAST-ACCT-WORK-DATE
  2 LAST-ACCT-TIME
1 BL VIEW OF BILL-LINE
  2 COST-CENTER
1 DIV VIEW OF DIVISION-FILE
  2 BUSINESS-UNIT-CODE
1 P-F VIEW OF PLANT-FACTORY
  2 DIVISION-CODE
1 CM VIEW OF CUST-MASTER
  2 CUST-CATEGORY
1 SP VIEW OF STANDARD-PRODUCT
  2 STYLE-NUM
  2 GENERIC-MFG-STYLE
  2 PRODUCT-CODE
  2 BILLING-LINE
  2 REPL-PLANT-CODE
  2 PLANT-CODE
  2 CATALOG-NUM
1 P-C VIEW OF PROD-CODE
  2 PRODUCT-CODE
  2 PROD-LINE-CODE
1 SFR VIEW OF SCM-DETAIL
  2 STYLE-NUM
  2 DETAIL-TYPE
1 IV-LK VIEW OF INVENTORY
  2 STYLE-NUM
  2 WHSE-CODE
  2 INV-PROD-AVAIL-CODE
1 #IV-LK (A23)
1 REDEFINE #IV-LK
  2 #IV-LK-STYLE (A20)
  2 #IV-LK-WHSE  (A3)
1 S-SFR VIEW OF SCM-DETAIL
  2 CATALOG-NUM
  2 COST-CENTER
  2 CHARGE-TO-CUST
  2 CURRENT-ITEM-QTY
  2 CUST-CATEGORY
  2 FILL-RATE-DATE
  2 GENERAL-ORDER-NUM
  2 GENERAL-ORDER-DATE
  2 GENERAL-ORDER-ITEM
  2 DETAIL-TYPE
  2 MANAGEMENT-LOAD-LINE
  2 BUSINESS
  2 MKT-PRODUCT-CODE
  2 MKT-PRODUCT-LINE
  2 BILLING-LINE
  2 MFG-PLANT-TYPE
  2 REDEFINE MFG-PLANT-TYPE
    3 MFG-PLANT(A3)
    3 MFG-TYPE(A3)
  2 STYLE-NUM
  2 UNIT-CUSTOMER-PRICE
  2 BS-WHSE
  2 DP-WHSE
  2 AUDIT-PROGRAM-ADDED
  2 AUDIT-USER-ADDED
  2 AUDIT-DATE-TIME-ADDED
  2 RESOURCE-NAME
  2 PARENT-NUM
1 S-SCM VIEW OF SCM-SUMMARY
  2 RECORD-TYPE
  2 CATALOG-NUM
  2 COST-CENTER
  2 MANAGEMENT-LOAD-LINE
  2 BUSINESS
  2 MKT-PRODUCT-CODE
  2 MKT-PRODUCT-LINE
  2 BILLING-LINE
  2 MFG-PLANT-TYPE
  2 REDEFINE MFG-PLANT-TYPE
    3 MFG-TYPE(A3)
    3 MFG-PLANT(A3)
  2 STYLE-NUM
  2 SUFFIX
  2 RESOURCE-NAME
  2 CUST-CATEGORY
  2 CHARGE-TO-CUST
  2 PARENT-NUM
  2 DLY-HIT
  2 DLY-MISS
  2 DLY-DOLL-PR
  2 DLY-DOLL-SH
  2 MTD-HIT
  2 MTD-MISS
  2 MTD-DOLL-PR
  2 MTD-DOLL-SH
  2 PREV-MTH-HIT
  2 PREV-MTH-MISS
  2 PREV-MTH-DOLL-PR
  2 PREV-MTH-DOLL-SH
  2 AUDIT-PROGRAM-CHANGED
  2 AUDIT-USER-CHANGED
  2 AUDIT-DATE-TIME-CHANGED
  2 AUDIT-PROGRAM-ADDED
  2 AUDIT-USER-ADDED
  2 AUDIT-DATE-TIME-ADDED
1 IV VIEW OF INVENTORY
  2 QTY-ON-HAND
1 IV2 VIEW OF INVENTORY
  2 WHSE-TYPE
1 IR VIEW OF ITEM-RELEASE
  2 EVENT-STATUS
1 CM2 VIEW OF CUST-MASTER
  2 CUST-CATEGORY
  2 VISTA-CUST-NUM
  2 PARENT-NUM
1 OI-UPDATE VIEW OF ORDER-ITEMS
  2 SFR-DATE-MEASURED
  2 SFR-BS-HIT
  2 SFR-DP-HIT
  2 BSC-PLANT-CODE
  2 ORIGINAL-CONSOLIDATED-SHIP-DATE
  2 AUDIT-DATE-CHANGED
  2 AUDIT-TIME-CHANGED
  2 AUDIT-USER-CHANGED
  2 AUDIT-PROGRAM-CHANGED
1 OI VIEW OF ORDER-ITEMS
  2 SHIP-SEQ
  2 STYLE-NUM
  2 SUFFIX
  2 ITEM-STATUS
  2 ITEM-STATUS-DATE
  2 DEMAND-SUFFIX
  2 DEMAND-WHSE-IND
  2 DEMAND-ZIP
  2 GENERIC-MFG-STYLE
  2 CURRENT-ITEM-QTY
  2 UNIT-CUSTOMER-PRICE
  2 CHARGE-TO-CUST
  2 MANAGEMENT-LOAD-LINE
  2 GENERAL-ORDER-NUM
  2 GENERAL-ORDER-DATE
  2 GENERAL-ORDER-ITEM
  2 AUDIT-DATE-ADDED
  2 BSC-PLANT-CODE
** CR 25100 >>
  2 WHSE-CODE
  2 ITEM-ORDER-DATE
  2 REQUIRED-SHIP-DATE
  2 ORIGINAL-CONSOLIDATED-SHIP-DATE
1 STG VIEW OF CUST-STAGING-PROFILE
  2 VISTA-CUST-NUM
  2 STAGING-WHSE
  2 CURRENT-YR-DAY-ARRAY     (A183/1:2)
  2 REDEFINE CURRENT-YR-DAY-ARRAY
    3 DAY-OF-YEAR            (A1/1:366)
  2 NEXT-YR-DAY-ARRAY        (A183/1:2)
  2 REDEFINE NEXT-YR-DAY-ARRAY
    3 DAY-OF-NEXT-YEAR       (A1/1:366)
*
1 #STAGE-KEY                 (A9)
1 REDEFINE #STAGE-KEY
  2 #STAGE-CUST              (A6)
  2 #STAGE-WHSE              (A3)
1 #DATJ                      (A5)
1 REDEFINE #DATJ
  2 #DATJ-YY                 (N2)
  2 #DATJ-DD                 (N3)
1 #DATJ-EOY                  (N3)
1 #DATJ-NEXT-EOY             (N3)
1 #ADVANCE-STAGE-DAYS        (N3)   CONST<31>
1 #END-DAY                   (N3)
1 #YYYY-01-01                (A8)
1 REDEFINE #YYYY-01-01
  2 #YYYY                    (A4)
  2 #MM                      (A2)
  2 #DD                      (A2)
1 #DATX                      (D)
1 #WORK                      (I2)
1 #REMAIN                    (I2)
1 #B3                        (I2)    INIT<0>
1 #ORIGINAL-CONSOLIDATED-SHIP-DATE (D)
1 #ORDER-ITEM-ISN            (P12)
1 #LABEL                     (A2)
1 #DATE-A                    (A8)
1 REDEFINE #DATE-A
  2 #YY-A                    (N4)
  2 #MM-A                    (A2)
  2 #DD-A                    (A2)
1 #ITEM-ORDER-DATE-B         (D)
1 #STATUS-KEY-B              (A4)
1 REDEFINE #STATUS-KEY-B
  2 #STATUS-B                (A1)
  2 #SUFFIX-B                (A3)
1 #CURR-DATE                 (D)  INIT <*DATX>
1 #LEAD-TIME                 (N7) INIT <1>
1 #NEXT-DAY                  (D)
** CR 25100 <<
1 #ET-COUNT (N2)
1 #OI-KEY         (A20)
1 REDEFINE #OI-KEY
  2 #GO-NUM       (A10)
  2 #GO-DATE      (D)
  2 #GO-ITEM      (A6)
1 #WS-VARS
  2 #X                 (N2)
  2 #MISS-DP           (L)
  2 #MISS-BL           (L)
  2 #DO-NOT-PROCESS-BL (L)
  2 #IV-KEY            (A23)
  2 REDEFINE #IV-KEY
    3 #IV-STYLE        (A20)
    3 #IV-SUFFIX       (A3)
  2 #HIT-MISS-IND      (A1)
  2 #PROGRAM           (A8)
1 #WF-REC-COUNT        (N9)
1 #SUPER               (A43)
1 REDEFINE #SUPER
  2 #RECORD-TYPE       (A2)
  2 REDEFINE #RECORD-TYPE
    3 #RECORD-TYPE1    (A1)
    3 #RECORD-TYPE2    (A1)
  2 #REST              (A41)
  2 REDEFINE #REST
    3 #S0-PLANT        (A6)
    3 REDEFINE #S0-PLANT
      4 #S0-MFG-TYPE   (A3)
      4 #S0-MFG-PLANT  (A3)
    3 #S0-MLL          (A7)
    3 #S0-STYLE        (A20)
    3 #S0-SUFFIX       (A3)
  2 REDEFINE #REST
    3 #S1-PLANT        (A6)
    3 REDEFINE #S1-PLANT
      4 #S1-MFG-TYPE   (A3)
      4 #S1-MFG-PLANT  (A3)
    3 #S1-BILL         (A3)
    3 #S1-STYLE        (A20)
    3 #S1-SUFFIX       (A3)
  2 REDEFINE #REST
    3 #S2-BUSINESS (A4)
    3 #S2-PLANT    (A6)
    3 REDEFINE #S2-PLANT
      4 #S2-MFG-TYPE(A3)
      4 #S2-MFG-PLANT(A3)
    3 #S2-STYLE    (A20)
    3 #S2-SUFFIX   (A3)
  2 REDEFINE #REST
    3 #S3-P-LINE   (A6)
    3 #S3-P-CODE   (A6)
    3 #S3-P-TYPE   (A6)
    3 REDEFINE #S3-P-TYPE
      4 #S3-MFG-TYPE (A3)
      4 #S3-MFG-PLANT(A3)
    3 #S3-STYLE    (A20)
    3 #S3-SUFFIX   (A3)
  2 REDEFINE #REST
    3 #S4-SUFFIX   (A3)
    3 #S4-STYLE    (A20)
    3 #S4-PLANT    (A6)
    3 REDEFINE #S4-PLANT
      4 #S4-MFG-TYPE(A3)
      4 #S4-MFG-PLANT(A3)
  2 REDEFINE #REST
    3 #S5-PLANT    (A6)
    3 REDEFINE #S5-PLANT
      4 #S5-MFG-TYPE(A3)
      4 #S5-MFG-PLANT(A3)
    3 #S5-MLL      (A2)
    3 #S5-STYLE    (A20)
    3 #S5-SUFFIX   (A3)
  2 REDEFINE #REST
    3 #SD-PLANT    (A6)
    3 REDEFINE #SD-PLANT
      4 #SD-MFG-TYPE(A3)
      4 #SD-MFG-PLANT(A3)
    3 #SD-CUSTCAT    (A2)
    3 #SD-STYLE    (A20)
    3 #SD-SUFFIX   (A3)
  2 REDEFINE #REST
    3 #SR-PLANT    (A6)
    3 REDEFINE #SR-PLANT
      4 #SR-MFG-TYPE(A3)
      4 #SR-MFG-PLANT(A3)
    3 #SR-RESOURCE   (A10)
    3 #SR-STYLE    (A20)
    3 #SR-SUFFIX   (A3)
  2 REDEFINE #REST
    3 #SF-COST     (A3)
    3 #SF-BILL     (A3)
    3 #SF-P-TYPE   (A6)
    3 REDEFINE #SF-P-TYPE
      4 #SF-MFG-TYPE (A3)
      4 #SF-MFG-PLANT(A3)
    3 #SF-STYLE    (A20)
    3 #SF-SUFFIX   (A3)
  2 REDEFINE #REST
    3 #SG-COST  (A3)
    3 #SG-PLANT (A6)
    3 REDEFINE #SG-PLANT
      4 #SG-MFG-TYPE (A3)
      4 #SG-MFG-PLANT (A3)
    3 #SG-STYLE (A20)
    3 #SG-SUFFIX (A3)
  2 REDEFINE #REST
    3 #SH-CUSTOMER (A6)
    3 #SH-PLANT    (A6)
    3 REDEFINE #SH-PLANT
      4 #SH-MFG-TYPE  (A3)
      4 #SH-MFG-PLANT (A3)
    3 #SH-STYLE (A20)
    3 #SH-SUFFIX (A3)
*
  2 REDEFINE #REST
    3 #SI-PARENT (A6)
    3 #SI-PLANT (A6)
    3 REDEFINE #SI-PLANT
      4 #SI-MFG-TYPE (A3)
      4 #SI-MFG-PLANT (A3)
    3 #SI-STYLE (A20)
    3 #SI-SUFFIX (A3)
*
  2 REDEFINE #REST
    3 #SJ-PLANT (A6)
    3 REDEFINE #SJ-PLANT
      4 #SJ-MFG-TYPE (A3)
      4 #SJ-MFG-PLANT (A3)
    3 #SJ-CUSTOMER (A6)
    3 #SJ-STYLE (A20)
    3 #SJ-SUFFIX (A3)

  2 REDEFINE #REST
    3 #SK-PLANT (A6)
    3 REDEFINE #SK-PLANT
      4 #SK-MFG-TYPE (A3)
      4 #SK-MFG-PLANT (A3)
    3 #SK-PARENT   (A6)
    3 #SK-STYLE (A20)
    3 #SK-SUFFIX (A3)
** PP#37050 >>
    2 REDEFINE #REST
      3 #SL-PLANT (A6)
      3 REDEFINE #SL-PLANT
        4 #SL-MFG-TYPE (A3)
        4 #SL-MFG-PLANT (A3)
      3 #SL-SUFFIX (A3)
      3 #SL-STYLE (A20)
** PP#37050 >>
1 #COST-CENTER   (A3)
*
1 MGMT-LOAD-LINE VIEW OF MGMT-LOAD-LINE
  2 RESOURCE-NAME
*
1 #PLANT-MLL-KEY           (A10)
1 REDEFINE #PLANT-MLL-KEY
  2 #MGMT-PLANT             (A3)
  2 #MGMT-MLL               (A7)
*
1 #RESOURCE-NAME           (A10)
1 #CUST-CATEGORY (A2)
1 #PARENT (A6)
1 #B-CNT           (N9)
1 #STATUS-KEY (A5)
1 REDEFINE #STATUS-KEY
  2 #STATUS-DATE (D)
  2 #STATUS (A1)
1 #STORE-CNT   (N5)
1 #STATUS-ARRAY (A1/1:4)
1 #STATUS-INDEX (N1)
1 #START-DATE (D)
1 #END-DATE     (D)
1 #ZIP (A10)
1 OI-SH VIEW OF ORDER-ITEM-SHIPTO
  2 SHIP-ADDR-ZIP
1 OH VIEW OF ORDER-HEADER
  2 ORDER-TYPE
  2 SHIP-ADDR-ZIP
1 #OI-SH-KEY            (A17)
1 REDEFINE #OI-SH-KEY
  2 #OI-SH-GO           (A10)
  2 #OI-SH-DT           (D)
  2 #OI-SH-SEQ          (N3)
1 #OH-KEY               (A14)
1 REDEFINE #OH-KEY
  2 #OH-GO              (A10)
  2 #OH-DT              (D)
1 #STYLE                (A20)
1 #CURRENT-REC          (A1)
1 #CURRENT-SUFFIX       (A3)
1 #DETAIL-ISN           (P12)
1 #OI-ISN               (P12)
1 #FLIPPED-FROM-Q       (L)
1 #DETAIL-REC-FOUND     (L)
1 #LOAD-PLANT           (A3)
1 #LOAD-TYPE            (A3)
1 #TMP-ISN              (P10)
1 #START-PROCESSING     (L)
END-DEFINE

END
