       IDENTIFICATION DIVISION.
       PROGRAM-ID. MGOPRGM1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  REC.
       COPY MGOBIN2.

       PROCEDURE DIVISION.
          ACCEPT FIRST-NAME.
          COPY MGOEMPTY.
          DISPLAY 'DETAILS : ' REC.
          STOP RUN.


