       IDENTIFICATION DIVISION.
       PROGRAM-ID.  PROG1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  DYN-CALL                    PIC X(8) VALUE 'CBLC002 '.
       PROCEDURE DIVISION.
       GET-TRANSACTION.
          CALL DYN-CALL.
        GOBACK.