       LINKAGE SECTION.
       PROCEDURE DIVISION.
           PERFORM USECPU
           GOBACK.
       USECPU SECTION.
           PERFORM VARYING I1
           END-PERFORM
       ASSCALL1 SECTION.
             PERFORM ASSHEX1
             PERFORM ASSHEX1
       ASSHEX1 SECTION.
       ASSCALL2 SECTION.
             PERFORM ASSHEX2
             PERFORM ASSHEX2
       ASSHEX2 SECTION.
