DEFINE DATA
LOCAL
1 #VAR1 (P11.2)
END-DEFINE

DECIDE FOR FIRST CONDITION

    WHEN #VAR1 = 5 
               WRITE NOTITLE '1'

    WHEN #VAR1 = 15  IGNORE
    WHEN NONE 
               WRITE NOTITLE 'NONE'
END-DECIDE
     WRITE NOTITLE 'END'
END
