         DBD     NAME=INDB1I,ACCESS=(INDEX,VSAM,PROT)
         DATASET DD1=INDB1I,SIZE=4096
         SEGM    NAME=STAT,PARENT=0,POINTER=T,BYTES=30
         FIELD   NAME=(STNM,SEQ,U),BYTES=10,START=1,TYPE=C
         FIELD   NAME=STPOP,BYTES=5,START=11,TYPE=P
         FIELD   NAME=STCAP,BYTES=5,START=16,TYPE=C
         LCHILD  NAME=(STATE,DB13057A),INDEX=STATENM
         DBDGEN
         FINISH
         END