         PCB       TYPE=DB,DBDNAME=DB13057A,KEYLEN=80,PROCOPT=LS
         SENSEG    NAME=STATE
         SENSEG    NAME=CITY,PARENT=STATE
         SENSEG    NAME=SCHOOL,PARENT=CITY
         SENSEG    NAME=STUDENT,PARENT=SCHOOL
         SENSEG    NAME=PET,PARENT=STUDENT
         SENSEG    NAME=TRICK,PARENT=PET
         SENSEG    NAME=CLASSRM,PARENT=SCHOOL
         SENSEG    NAME=POSTER,PARENT=CLASSRM
         SENSEG    NAME=ARTIST,PARENT=POSTER
         SENSEG    NAME=PARK,PARENT=CITY
         PSBGEN    PSBNAME=LD13057A,LANG=COBOL,CMPAT=YES
         END