//JMEGAN1 JOB (20,FB3),'I',
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
// NOTIFY=&SYSUID,
// REGION=0M
//*
//*
//  JCLLIB ORDER=(VENDOR.PROCLIB,DFSF10.PROCLIB)
//*
//* Change the following variables to match your requirements
//*
//* The name of your load PSB
//        SET LOADPSB=LD13057A
//* The name of your PSB
//        SET PSB=RN13057A
//* The name of your DBD
//        SET DBD=DB13057A
//* The name of your INDEX DBD for HIDAM or PHIDAM
//        SET DBDI=INDB1I
//* The name of your cobol program that executesb IMS commands
//        SET LOADPGM=L13057A
//* The name of your cobol program that executesb IMS commands
//        SET PGM=M13057A
//* Where your temporary test datasets will be stored
//        SET HLQ=JMEGAN1.TEST
//* Your mainframe username
//        SET UNAME=JMEGAN1
//*
//* HIDAM/OSAM LOAD
//*
//HIDAMLD EXEC PGM=DFSRRC00,
//             PARM='DLI,&LOADPGM.,&LOADPSB.,,,,,,,,,,N,N'
//DFSRESLB DD DSNAME=DFSF10.SDFSRESL,DISP=SHR
//DFSPRING DD SYSOUT=*,DCB=(BLKSIZE=605,LRECL=121,RECFM=FBA)
//STEPLIB  DD DISP=SHR,DSN=DFSF10.SDFSRESL
//         DD DISP=SHR,DSN=&HLQ..PGMLIB
//IMS      DD DISP=SHR,DSN=&HLQ..PSBLIB
//         DD DISP=SHR,DSN=&HLQ..DBDLIB
//*
//IEFRDER  DD DSN=&&IMSLOG,DISP=(NEW,PASS)
//DFSVSAMP DD DISP=SHR,DSN=DFSF10.PROCLIB(DFSVSMDB)
//DFSCTL   DD DISP=SHR,DSN=DFSF10.PROCLIB(DFSSBPRM)
//IMSLOGR  DD DSN=&&LOGF,DISP=(NEW,DELETE,DELETE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0,BUFNO=25),
//            SPACE=(TRK,1,RLSE)
//DFSSTAT  DD SYSOUT=*
//SYSEXEC  DD DISP=SHR,DSN=DFSF10.INSTALIB
//         DD DISP=SHR,DSN=DFSF10.SDFSEXEC
//SYSTSIN  DD *
//*
//SYSTSPRT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//*
//* Partitioned DB DB13057A
//DB13057A  DD DSNAME=&HLQ..&DBD.,DISP=SHR
//INDB1I   DD DSNAME=&HLQ..&DBDI.,DISP=SHR
//*
//* HIDAM/OSAM UPDATE
//*
//HIDAMUPD EXEC PGM=DFSRRC00,
//             PARM='DLI,&PGM.,&PSB.,,,,,,,,,,N,N'
//DFSRESLB DD DSNAME=DFSF10.SDFSRESL,DISP=SHR
//DFSPRING DD SYSOUT=*,DCB=(BLKSIZE=605,LRECL=121,RECFM=FBA)
//STEPLIB  DD DISP=SHR,DSN=DFSF10.SDFSRESL
//         DD DISP=SHR,DSN=&HLQ..PGMLIB
//IMS      DD DISP=SHR,DSN=&HLQ..PSBLIB
//         DD DISP=SHR,DSN=&HLQ..DBDLIB
//OUT      DD DSN=&UNAME..IMSOUT,
//            DISP=(NEW,CATLG,DELETE),
//            LRECL=300,RECFM=FB,SPACE=(CYL,(10,1))
//*
//IEFRDER  DD DSN=&&IMSLOG,DISP=(NEW,PASS)
//DFSVSAMP DD DISP=SHR,DSN=DFSF10.PROCLIB(DFSVSMDB)
//DFSCTL   DD DISP=SHR,DSN=DFSF10.PROCLIB(DFSSBPRM)
//IMSLOGR  DD DSN=&&LOGF,DISP=(NEW,DELETE,DELETE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0,BUFNO=25),
//            SPACE=(TRK,1,RLSE)
//DFSSTAT  DD SYSOUT=*
//SYSEXEC  DD DISP=SHR,DSN=DFSF10.INSTALIB
//         DD DISP=SHR,DSN=DFSF10.SDFSEXEC
//SYSTSIN  DD *
//*
//SYSTSPRT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//*
//* Partitioned DB DB13057A
//DB13057A  DD DSNAME=&HLQ..&DBD.,DISP=SHR
//INDB1I   DD DSNAME=&HLQ..&DBDI.,DISP=SHR