         PCB       TYPE=DB,DBDNAME=DB13057A,KEYLEN=80,PROCOPT=AP
         SENSEG    NAME=STATE
         SENSEG    NAME=CITY,PARENT=STATE
         SENSEG    NAME=SCHOOL,PARENT=CITY
         SENSEG    NAME=STUDENT,PARENT=SCHOOL
         SENSEG    NAME=PET,PARENT=STUDENT
         SENSEG    NAME=TRICK,PARENT=PET
         SENSEG    NAME=CLASSRM,PARENT=SCHOOL
         SENSEG    NAME=POSTER,PARENT=CLASSRM
         SENSEG    NAME=ARTIST,PARENT=POSTER
         SENSEG    NAME=PARK,PARENT=CITY
         PCB       TYPE=DB,DBDNAME=DB13057A,KEYLEN=80,PROCOPT=AP
         SENSEG    NAME=STATE
         SENSEG    NAME=CITY,PARENT=STATE
         SENSEG    NAME=SCHOOL,PARENT=CITY
         SENSEG    NAME=STUDENT,PARENT=SCHOOL
         SENSEG    NAME=PET,PARENT=STUDENT
         SENSEG    NAME=TRICK,PARENT=PET
         SENSEG    NAME=CLASSRM,PARENT=SCHOOL
         SENSEG    NAME=POSTER,PARENT=CLASSRM
         SENSEG    NAME=ARTIST,PARENT=POSTER
         SENSEG    NAME=PARK,PARENT=CITY
         PSBGEN    PSBNAME=RN13057A,LANG=COBOL
         END