       IDENTIFICATION DIVISION.
       PROGRAM-ID. MIN510F.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
               PERFORM 3 TIMES
               DISPLAY ' 123 '
               END-PERFORM.
           GOBACK.
       END PROGRAM MIN510F.
