       IDENTIFICATION DIVISION.
       PROGRAM-ID. MIN519A.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 TESTFIELD  PIC 9.

       PROCEDURE DIVISION.
                 DISPLAY '-A'
           ENTRY 'MIN512B'.
       HORROR.
                 DISPLAY '-B'.
            ENTRY 'MIN512C'.
                 DISPLAY '-C'.
       ENDLABEL.
           PERFORM HORROR.
       END PROGRAM MIN519A.