//TESTPROC PROC MOD1='VPRDSSS',
                MOD2='VPRDSSS',
                MOD3='VPRDMIS'
//*
//*
//SSSSD101 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=&MOD3..PARMLIB(TESTCNTRLCARD2), 
//            DISP=SHR
//*
//SSSSD100 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=&MOD3..PARMLIB(TESTCNTRLCARD1), 
//            DISP=SHR
//*