DEFINE DATA
LOCAL
1 #VAR1 (P11.2)
1 #VAR2 (P11.2)
END-DEFINE
FORMAT (1) PS=100
 
MOVE '792,12' TO #VAR1
MOVE '28,34'  TO #VAR2

IF TRUE EQ TRUE AND FALSE EQ FALSE
IF TRUE EQ TRUE AND FALSE EQ FALSE
WRITE NOTITLE '=' #VAR1 '=' #VAR2
WRITE NOTITLE 'IF IF'
ELSE 
WRITE NOTITLE 'IF IF ELSE'
END-IF
WRITE NOTITLE '=' #VAR1 '=' #VAR2
ELSE 
WRITE NOTITLE 'ELSE'
IF TRUE EQ TRUE AND FALSE EQ FALSE
WRITE NOTITLE '=' #VAR1 '=' #VAR2
WRITE NOTITLE 'ELSE IF'
ELSE 
WRITE NOTITLE 'ELSE IF ELSE'
END-IF
END-IF

END
