DEFINE DATA
LOCAL
1 #VAR1 (P11.2)
END-DEFINE

DECIDE ON EVERY VALUE OF  #VAR1
 	VALUE  '1'
 		WRITE NOTITLE '1'
 		WRITE NOTITLE '1'
 		WRITE NOTITLE '1'
 		WRITE NOTITLE '1'
 		WRITE NOTITLE '1'
 		WRITE NOTITLE '1'
 		WRITE NOTITLE '1'
 	VALUE  '2'
 		WRITE NOTITLE '2'
 	VALUE  '3'
 		WRITE NOTITLE '3'
	NONE
    	IGNORE
END-DECIDE

END
