DEFINE DATA
LOCAL
1 #VAR1 (P11.2)
1 #VAR2 (P11.2)
END-DEFINE
FORMAT (1) PS=100
 
IF #BLANKS < 8
  IF SELECTION NOT UNIQUE & (1:8)
     WRITE NOTITLE '=' #VAR1 '=' #VAR2
  END-IF
END-IF
END
