SEC1: PROCEDURE OPTIONS(MAIN);
    DCL (A, B) FIXED DECIMAL(2) INIT(1B);
    A = LABEL_A(5,4);
 END SEC1;
 
 LABEL_A: PROC(A, B) RETURNS (FIXED DECIMAL);
    DECLARE RESULT FIXED DECIMAL(2);
    RESULT = A + B;
    RETURN (RESULT);
 END LABEL_A;