       IDENTIFICATION DIVISION.
       PROGRAM-ID. IFSTATEMENT.

       DATA DIVISION.
          WORKING-STORAGE SECTION.
           01  FIELD-1 PICTURE X(100).
           01  GROUP-1 REDEFINES FIELD-1.
              05 FIELD-2 PICTURE 9(4) COMP-3.
              05 FIELD-3 PICTURE X(96).
           01  GROUP-2 REDEFINES FIELD-1.
              05 FIELD-4 PICTURE 9(4) COMP-5.
              05 FIELD-5 PICTURE X(50).
              05 FIELD-6 PICTURE X(46).

       PROCEDURE DIVISION.
          MOVE 25 TO FIELD-1.

          IF FIELD-4 > FIELD-3 THEN
       	    DISPLAY FIELD-4
          END-IF.

          DISPLAY GROUP-2.

       STOP RUN.
