       IDENTIFICATION DIVISION.
       PROGRAM-ID. WDIS221B.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 PROC-NAME PIC X(10) VALUE 'TEST-PROC'.
       PROCEDURE DIVISION.
       BEGIN.

           EXEC SQL
           CALL :PROC-NAME (:ALPHA-SHORT, 'HELLO OO' -1, 5, 'HELLO OO')
           END-EXEC

           GOBACK.
       END PROGRAM WDIS221B.
