       IDENTIFICATION DIVISION.
       PROGRAM-ID. WDIS221D.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 PROC-NAME PIC X(10).
       PROCEDURE DIVISION.
       BEGIN.
       
           MOVE 'HELLO' TO PROC-NAME

           EXEC SQL
           CALL :PROC-NAME (:ALPHA-SHORT, 'HELLO OO' -1, 5, 'HELLO OO')
           END-EXEC

           GOBACK.
       END PROGRAM WDIS221D.
