000100     03  NAME01-ABCDNAME.                                                 
000200         05  NAME01-NAMES-DBD9  OCCURS 10 TIMES.                          
000300             07  NAME01-NAMES-TYPE      PIC X(01).                        
000400             07  NAME01-NAMES-DBD8      PIC X(08).                        
