000100     03  GROP01-ABCDGROP.                                                 
000200         05  GROP01-DBDNAME           PIC X(08).                          
000300         05  GROP01-CREATE-DATE       PIC X(06).                          
000400         05  GROP01-UPDATE-DATE       PIC X(06).                          
000500         05  GROP01-UPDATE-TIME       PIC X(06).                          
000600         05  GROP01-UPDATE-USER       PIC X(08).                          
000700         05  GROP01-USE-DATE          PIC X(06).                          
000800         05  FILLER                   PIC X(20).                          
