CZY999   FMT                                                            00010000
         DEV   TYPE=(3270,2),FEAT=IGNORE,DSCA=X'00F0'                   00020000
         DIV   TYPE=INOUT                                               00030000
         DPAGE FILL=NULL,CURSOR=((2,13,CURS))                           00040000
DBDMSG   DFLD  POS=(1,2),LTH=79,ATTR=(PROT,NUM,HI)                      00050000
GROUPNAM DFLD  POS=(2,3),LTH=8,ATTR=(MOD,HI)                            00060000
UPDATKEY DFLD  POS=(2,13),LTH=1,ATTR=(MOD,HI)                           00070000
         DFLD  '<-ENTER: "D"(DELETE), "U"(UPDATE),',POS=(2,15)          00080000
         DFLD  '"A"(ADD), BLANK(NO ACTION)',POS=(2,50)                  00090000
         DO    63,1,11,SUF=1                                            00100000
NAME1    DFLD  POS=(3,5),LTH=9,ATTR=(MOD)                               00110000
         ENDDO                                                          00120000
         DO    70,1,11,SUF=1                                            00130000
NAME64   DFLD  POS=(12,5),LTH=9,ATTR=(MOD)                              00140000
         ENDDO                                                          00150000
         DFLD  'DATE CREATED:',POS=(22,1)                               00160000
CREATDTE DFLD  POS=(22,15),LTH=6,ATTR=(PROT)                            00170000
         DFLD  'LAST UPDATE, DATE:',POS=(24,1)                          00180000
UPDTEDTE DFLD  POS=(24,20),LTH=6,ATTR=(PROT)                            00190000
         DFLD  'TIME:',POS=(24,30)                                      00200000
UPDTETME DFLD  POS=(24,36),LTH=6,ATTR=(PROT)                            00210000
         DFLD  ' USER:',POS=(24,45)                                     00220000
UPDTEUSR DFLD  POS=(24,52),LTH=8,ATTR=(PROT)                            00230000
         DFLD  '"*" PREFIX DEFINES A GROUP NAME',POS=(22,30)            00240000
TIME1    DFLD  POS=(23,70),LTH=8,ATTR=(PROT,HI)                         00260000
         FMTEND                                                         00270000
COZY999  MSG   TYPE=OUTPUT,SOR=(CZY999,IGNORE),NXT=CIZY999,FILL=C' '    00280000
         SEG                                                            00290000
         MFLD  GROUPNAM,LTH=8                                           00300000
         MFLD  DBDMSG,LTH=79                                            00310000
         MFLD  UPDATKEY,LTH=1                                           00320000
         MFLD  CREATDTE,LTH=6                                           00330000
         MFLD  UPDTEDTE,LTH=6                                           00340000
         MFLD  UPDTETME,LTH=6                                           00350000
         MFLD  UPDTEUSR,LTH=8                                           00360000
         MFLD  USEDATE,LTH=6                                            00370000
         MFLD  CURS,LTH=4                                               00380000
         DO    63,SUF=1                                                 00390000
         MFLD  NAME1,LTH=9                                              00400000
         ENDDO                                                          00410000
         DO    70,SUF=1                                                 00420000
         MFLD  NAME64,LTH=9                                             00430000
         ENDDO                                                          00440000
         MFLD  (TIME1,TIME)                                             00450000
         MSGEND                                                         00460000
CIZY999  MSG   TYPE=INPUT,SOR=(CZY999,IGNORE),NXT=COZY999               00470000
         SEG                                                            00480000
         MFLD  'ABCDEF11 '                                              00490000
         MFLD  GROUPNAM,LTH=8                                           00500000
         MFLD  UPDATKEY,LTH=1                                           00510000
         DO    63,SUF=1                                                 00520000
         MFLD  NAME1,LTH=9                                              00530000
         ENDDO                                                          00540000
         DO    70,SUF=1                                                 00550000
         MFLD  NAME64,LTH=9                                             00560000
         ENDDO                                                          00570000
         MSGEND                                                         00580000
         END                                                            00590000
