       IDENTIFICATION DIVISION.
       PROGRAM-ID. WNDT3282.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DISPLAY 'Q'.
           .

      *--------------------------------------------------------------*
      *--------------------- ENDE DPRO WNDT3282  ---------------------*
      *--------------------------------------------------------------*

      *    ************************************************************
      *    ************************************************************
