  /* test file for LOOP TYPE3 statement */
 TYPE3: PROCEDURE OPTIONS(MAIN);
     DECLARE ARR(8,8) FIXED DECIMAL;
    DEFINE ORDINAL LABELS (LABEL1 VALUE(1) , LABEL2 , LABEL3 , LABEL4);
    DECLARE LABEL_1 ORDINAL  LABELS;
    
    DO LABEL_1 = LABEL1 UPTHRU LABEL4;
     PUT SKIP LIST('LABEL_1 VALUE IS', BINARYVALUE(LABEL_1));
    END;
    
    LABEL1 : SAMPLE_LABEL : DO I = 8 DOWNTHRU J;
     PUT SKIP LIST('VALUE OF I IS',I);
     PUT SKIP LIST('VALUE OF J IS',J);
    END;
    
     DO I = 1 TO 8;
      DO J= 1 TO 8;
       ARR(I,J) = 0;
      END;
     END;
    DO M = 1 TO 10 BY 2;     
     PUT SKIP LIST(' VALUE OF M IS', M);
     FREE M;
     PUT SKIP LIST('POST FREE OF M');
    END;
 END TYPE3;