  /*test file for LOOP CONTROL statement  */ 
 LOOP_CONTROL: PROCEDURE OPTIONS(MAIN);
  SAMPLE_LABEL : do loop;
 	PUT SKIP LIST("LEAVE");
 	LEAVE;
  end;
   LABEL1 : DO FOREVER;
       J = J + 1;
         PUT SKIP LIST('INSIDE FOREVER LOOP');
         IF( J < 3)
          THEN LEAVE;
          ELSE
           ITERATE LABEL1;
    END;
   LABEL2 : do loop;
 	PUT SKIP LIST("LEAVE");
 	ITERATE LABEL2;
   end;
 END LOOP_CONTROL;