  /* test file for LOOP TYPE4 statement */ 
 TYPE4: PROCEDURE OPTIONS(MAIN);
    
    DECLARE I FIXED DECIMAL(1) INIT(1);
    DECLARE J FIXED DECIMAL(1) INIT(1);
    DO LOOP;
     I = I + 1;
     PUT SKIP LIST('INSIDE DO LOOP');
     IF ( I < 3)
      THEN GO TO LABEL1;
    END;
    LABEL1 : DO FOREVER;
            J = J + 1;
            PUT SKIP LIST('INSIDE FOREVER LOOP');
            IF( J < 3)
             THEN LEAVE;
             ELSE
               ITERATE TYPE4;
           END;
 END TYPE4;