//UTCF24W1 JOB (A,X,29UT00),'00  ADB/PLR  &:YWC',                       JOB49800
//         MSGCLASS=W,                                                          
//         USER=Z8PADBP                                                         
//*--------------------------------------------------------------------*        
//*--------------------------------------------------------------------*        
//*AUTOBEEP PAGE=PMADB                                                          
//*--------------------------------------------------------------------*        
//PROCS JCLLIB ORDER=(AX29UT.CTL.UTP23801.JES.JCLLIB,                           
//             AX87CM.LBP.IIFS.PROC.JES.JCLLIB)                                 
//FIRMCODE INCLUDE MEMBER=FIRMCODE                                              
//*--------------------------------------------------------------------*        
//* FIRM # 1                                                                    
//UTCF2401 EXEC PROC=UTPCF241,                                                  
//         HIGHQUAL=AX29UT,       HIGH LEVEL QUAL FOR INPUT FILE                
//         CYCLE='&:YWC',         EXECUTION DAY CYCLE                           
//         LSTQ='&:CURDG4',       LAST QUALIFIER FOR TARGET FILE                
//         FRSTQ='waa',           FIRST QUALIFIER FOR TARGET FILE               
//         FMN=&W0001,            FIRM NAME                                     
//         FIRMID=W0001           REPORTING FREQUENCY & FIRM IDENTIFIER         