//PROCA PROC
//PSTEP1    EXEC PGM=IEFBR14                                             00039900
//SYSPRINT DD  DSN=&QUAL.F.FILE                                         00041300