//AF10H01   JOB                                                         00010000
//AF10H01   EXEC  PROC=AF10H01                                          00020000
//STEPLIB   DD   DSN=ENDVR.USR.PROD.LOADLIB,DISP=SHR                    00030001
