       IDENTIFICATION DIVISION.
       PROGRAM-ID. MEE3131K.
       PROCEDURE DIVISION.
           DISPLAY "MEE3131K PERFORM START".
           PERFORM LABEL_1.
           DISPLAY "MEE3131K PERFORM RETURNED!".
       LABEL_1.
           DISPLAY "MEE3131K LABEL1".
           GO TO LABEL_2.
           DISPLAY "MEE3131K AFTER GO TO".
       LABEL_2.
           DISPLAY "MEE3131K LABEL2".
           GOBACK.
       END PROGRAM MEE3131K.
