       01 MMRS71AI.
            02 FILLER PIC X(12).
            02 HEAD001L COMP PIC S9(4).
            02 HEAD001F PIC X.
            02 FILLER REDEFINES HEAD001F.
                03 HEAD001A PIC X.
            02 FILLER PIC X(4).
            02 HEAD001I PIC X(16).
            02 LBL001L COMP PIC S9(4).
            02 LBL001F PIC X.
            02 FILLER REDEFINES LBL001F.
                03 LBL001A PIC X.
            02 FILLER PIC X(4).
            02 LBL001I PIC X(38).
            02 DATE001L COMP PIC S9(4).
            02 DATE001F PIC X.
            02 FILLER REDEFINES DATE001F.
                03 DATE001A PIC X.
            02 FILLER PIC X(4).
            02 DATE001I PIC X(10).
            02 TIME001L COMP PIC S9(4).
            02 TIME001F PIC X.
            02 FILLER REDEFINES TIME001F.
                03 TIME001A PIC X.
            02 FILLER PIC X(4).
            02 TIME001I PIC X(8).
            02 ACTUAL02L COMP PIC S9(4).
            02 ACTUAL02F PIC X.
            02 FILLER REDEFINES ACTUAL02F.
                03 ACTUAL02A PIC X.
            02 FILLER PIC X(4).
            02 ACTUAL02I PIC X(78).
            02 INFOTXTL COMP PIC S9(4).
            02 INFOTXTF PIC X.
            02 FILLER REDEFINES INFOTXTF.
                03 INFOTXTA PIC X.
            02 FILLER PIC X(4).
            02 INFOTXTI PIC X(78).
            02 PFKTXT1L COMP PIC S9(4).
            02 PFKTXT1F PIC X.
            02 FILLER REDEFINES PFKTXT1F.
                03 PFKTXT1A PIC X.
            02 FILLER PIC X(4).
            02 PFKTXT1I PIC X(35).
            02 PFKTXT2L COMP PIC S9(4).
            02 PFKTXT2F PIC X.
            02 FILLER REDEFINES PFKTXT2F.
                03 PFKTXT2A PIC X.
            02 FILLER PIC X(4).
            02 PFKTXT2I PIC X(35).
            02 TXTPF01L COMP PIC S9(4).
            02 TXTPF01F PIC X.
            02 FILLER REDEFINES TXTPF01F.
                03 TXTPF01A PIC X.
            02 FILLER PIC X(4).
            02 TXTPF01I PIC X(5).
            02 TXTPF02L COMP PIC S9(4).
            02 TXTPF02F PIC X.
            02 FILLER REDEFINES TXTPF02F.
                03 TXTPF02A PIC X.
            02 FILLER PIC X(4).
            02 TXTPF02I PIC X(5).
            02 TXTPF03L COMP PIC S9(4).
            02 TXTPF03F PIC X.
            02 FILLER REDEFINES TXTPF03F.
                03 TXTPF03A PIC X.
            02 FILLER PIC X(4).
            02 TXTPF03I PIC X(5).
            02 TXTPF04L COMP PIC S9(4).
            02 TXTPF04F PIC X.
            02 FILLER REDEFINES TXTPF04F.
                03 TXTPF04A PIC X.
            02 FILLER PIC X(4).
            02 TXTPF04I PIC X(5).
            02 TXTPF05L COMP PIC S9(4).
            02 TXTPF05F PIC X.
            02 FILLER REDEFINES TXTPF05F.
                03 TXTPF05A PIC X.
            02 FILLER PIC X(4).
            02 TXTPF05I PIC X(5).
            02 TXTPF06L COMP PIC S9(4).
            02 TXTPF06F PIC X.
            02 FILLER REDEFINES TXTPF06F.
                03 TXTPF06A PIC X.
            02 FILLER PIC X(4).
            02 TXTPF06I PIC X(5).
            02 TXTPF07L COMP PIC S9(4).
            02 TXTPF07F PIC X.
            02 FILLER REDEFINES TXTPF07F.
                03 TXTPF07A PIC X.
            02 FILLER PIC X(4).
            02 TXTPF07I PIC X(5).
            02 TXTPF08L COMP PIC S9(4).
            02 TXTPF08F PIC X.
            02 FILLER REDEFINES TXTPF08F.
                03 TXTPF08A PIC X.
            02 FILLER PIC X(4).
            02 TXTPF08I PIC X(5).
            02 TXTPF09L COMP PIC S9(4).
            02 TXTPF09F PIC X.
            02 FILLER REDEFINES TXTPF09F.
                03 TXTPF09A PIC X.
            02 FILLER PIC X(4).
            02 TXTPF09I PIC X(5).
            02 TXTPF10L COMP PIC S9(4).
            02 TXTPF10F PIC X.
            02 FILLER REDEFINES TXTPF10F.
                03 TXTPF10A PIC X.
            02 FILLER PIC X(4).
            02 TXTPF10I PIC X(5).
            02 TXTPF11L COMP PIC S9(4).
            02 TXTPF11F PIC X.
            02 FILLER REDEFINES TXTPF11F.
                03 TXTPF11A PIC X.
            02 FILLER PIC X(4).
            02 TXTPF11I PIC X(5).
            02 TXTPF12L COMP PIC S9(4).
            02 TXTPF12F PIC X.
            02 FILLER REDEFINES TXTPF12F.
                03 TXTPF12A PIC X.
            02 FILLER PIC X(4).
            02 TXTPF12I PIC X(5).
        01 MMRS71AO REDEFINES MMRS71AI.
            02 FILLER PIC X(12).
            02 FILLER PIC X(3).
            02 HEAD001C PIC X.
            02 HEAD001P PIC X.
            02 HEAD001H PIC X.
            02 HEAD001V PIC X.
            02 HEAD001O PIC X(16).
            02 FILLER PIC X(3).
            02 LBL001C PIC X.
            02 LBL001P PIC X.
            02 LBL001H PIC X.
            02 LBL001V PIC X.
            02 LBL001O PIC X(38).
            02 FILLER PIC X(3).
            02 DATE001C PIC X.
            02 DATE001P PIC X.
            02 DATE001H PIC X.
            02 DATE001V PIC X.
            02 DATE001O PIC X(10).
            02 FILLER PIC X(3).
            02 TIME001C PIC X.
            02 TIME001P PIC X.
            02 TIME001H PIC X.
            02 TIME001V PIC X.
            02 TIME001O PIC X(8).
            02 FILLER PIC X(3).
            02 ACTUAL02C PIC X.
            02 ACTUAL02P PIC X.
            02 ACTUAL02H PIC X.
            02 ACTUAL02V PIC X.
            02 ACTUAL02O PIC X(78).
            02 FILLER PIC X(3).
            02 INFOTXTC PIC X.
            02 INFOTXTP PIC X.
            02 INFOTXTH PIC X.
            02 INFOTXTV PIC X.
            02 INFOTXTO PIC X(78).
            02 FILLER PIC X(3).
            02 PFKTXT1C PIC X.
            02 PFKTXT1P PIC X.
            02 PFKTXT1H PIC X.
            02 PFKTXT1V PIC X.
            02 PFKTXT1O PIC X(35).
            02 FILLER PIC X(3).
            02 PFKTXT2C PIC X.
            02 PFKTXT2P PIC X.
            02 PFKTXT2H PIC X.
            02 PFKTXT2V PIC X.
            02 PFKTXT2O PIC X(35).
            02 FILLER PIC X(3).
            02 TXTPF01C PIC X.
            02 TXTPF01P PIC X.
            02 TXTPF01H PIC X.
            02 TXTPF01V PIC X.
            02 TXTPF01O PIC X(5).
            02 FILLER PIC X(3).
            02 TXTPF02C PIC X.
            02 TXTPF02P PIC X.
            02 TXTPF02H PIC X.
            02 TXTPF02V PIC X.
            02 TXTPF02O PIC X(5).
            02 FILLER PIC X(3).
            02 TXTPF03C PIC X.
            02 TXTPF03P PIC X.
            02 TXTPF03H PIC X.
            02 TXTPF03V PIC X.
            02 TXTPF03O PIC X(5).
            02 FILLER PIC X(3).
            02 TXTPF04C PIC X.
            02 TXTPF04P PIC X.
            02 TXTPF04H PIC X.
            02 TXTPF04V PIC X.
            02 TXTPF04O PIC X(5).
            02 FILLER PIC X(3).
            02 TXTPF05C PIC X.
            02 TXTPF05P PIC X.
            02 TXTPF05H PIC X.
            02 TXTPF05V PIC X.
            02 TXTPF05O PIC X(5).
            02 FILLER PIC X(3).
            02 TXTPF06C PIC X.
            02 TXTPF06P PIC X.
            02 TXTPF06H PIC X.
            02 TXTPF06V PIC X.
            02 TXTPF06O PIC X(5).
            02 FILLER PIC X(3).
            02 TXTPF07C PIC X.
            02 TXTPF07P PIC X.
            02 TXTPF07H PIC X.
            02 TXTPF07V PIC X.
            02 TXTPF07O PIC X(5).
            02 FILLER PIC X(3).
            02 TXTPF08C PIC X.
            02 TXTPF08P PIC X.
            02 TXTPF08H PIC X.
            02 TXTPF08V PIC X.
            02 TXTPF08O PIC X(5).
            02 FILLER PIC X(3).
            02 TXTPF09C PIC X.
            02 TXTPF09P PIC X.
            02 TXTPF09H PIC X.
            02 TXTPF09V PIC X.
            02 TXTPF09O PIC X(5).
            02 FILLER PIC X(3).
            02 TXTPF10C PIC X.
            02 TXTPF10P PIC X.
            02 TXTPF10H PIC X.
            02 TXTPF10V PIC X.
            02 TXTPF10O PIC X(5).
            02 FILLER PIC X(3).
            02 TXTPF11C PIC X.
            02 TXTPF11P PIC X.
            02 TXTPF11H PIC X.
            02 TXTPF11V PIC X.
            02 TXTPF11O PIC X(5).
            02 FILLER PIC X(3).
            02 TXTPF12C PIC X.
            02 TXTPF12P PIC X.
            02 TXTPF12H PIC X.
            02 TXTPF12V PIC X.
            02 TXTPF12O PIC X(5).
