//MMRS710A JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A
//*************************************************************************
//***** MMRS-M01  mainframe modernization reference system
//*************************************************************************
//***** MMRS7102  call assembler
//**************************************************************************
//STEP01   EXEC PGM=MMRS7102
//STEPLIB  DD DSN=MMRS00C.A.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
