//MMRS711S JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A,RESTART=*
//*************************************************************************
//***** MMRS-M01  mainframe modernization reference system
//*************************************************************************
//***** MMRS7112  cobol program reads SQL and writes data via DISPLAY
//***** MMRS7113  cobol program create table
//*************************************************************************
//JOBLIB  DD  DISP=SHR,DSN=DSNB10.SDSNLOAD
//        DD  DISP=SHR,DSN=CEE.SCEERUN
//*
//*************************************************************************
//***** MMRS7112  mee - executable in mee environment
//*************************************************************************
//STEP01   EXEC PGM=MMRS7112
//STEPLIB  DD DSN=MMRS00C.A.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//*
//* END OF MEE STEPS
//
//
//*************************************************************************
//***** MMRS7112  z/OS executable to read data from DB2
//*************************************************************************
//* STEP  3: BIND AND RUN PROGRAMS
//STEP3    EXEC PGM=IKJEFT01,DYNAMNBR=20
//DBRMLIB  DD DSN=MMRS00C.A.DBRMLIB,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSMDECK DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//REPORT   DD SYSOUT=*
//SYSIN    DD *
 SET CURRENT SQLID = 'SYSADM';
 GRANT BIND, EXECUTE ON PLAN MMRS7112
   TO PUBLIC;
//SYSTSIN DD *
 DSN SYSTEM(DBBG)
 FREE PLAN(MMRS7112)
 FREE PACKAGE(MMRS00C.*)
 BIND PACKAGE(MMRS00C) MEMBER(MMRS7112) +
      ACT(REP) ISO(CS) CURRENTDATA(YES) ENCODING(EBCDIC) +
      ISO(CS) CURRENTDATA(YES) ENCODING(EBCDIC)
 BIND PLAN(MMRS7112) PKLIST(MMRS00C.*) +
      ACTION(REPLACE) RETAIN +
      ISO(CS) CURRENTDATA(YES) ENCODING(EBCDIC)
 RUN  PROGRAM(MMRS7112) PLAN(MMRS7112) -
      LIB('MMRS00C.A.LOADLIB')
 END
//*
//*************************************************************************
//***** Hinter dir ein dreiköpfiger Affe !
//*************************************************************************
//* STEP  4: BIND AND RUN PROGRAMS
//STEP4    EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB  DD DSN=DSNB10.SDSNLOAD,DISP=SHR
//         DD DSN=CEE.SCEERUN,DISP=SHR
//DBRMLIB  DD DSN=MMRS00C.A.DBRMLIB,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSMDECK DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//REPORT   DD SYSOUT=*
//SYSIN    DD *
 SET CURRENT SQLID = 'SYSADM';
 GRANT BIND, EXECUTE ON PLAN MMRS7113
   TO PUBLIC;
//SYSTSIN DD *
 DSN SYSTEM(DBBG)
 FREE PLAN(MMRS7113)
 FREE PACKAGE(MMRS00C.*)
 BIND PACKAGE(MMRS00C) MEMBER(MMRS7113) +
      ACT(REP) ISO(CS) CURRENTDATA(YES) ENCODING(EBCDIC) +
      ISO(CS) CURRENTDATA(YES) ENCODING(EBCDIC)
 BIND PLAN(MMRS7113) PKLIST(MMRS00C.*) +
      ACTION(REPLACE) RETAIN +
      ISO(CS) CURRENTDATA(YES) ENCODING(EBCDIC)
 RUN  PROGRAM(MMRS7113) PLAN(MMRS7113) -
      LIB('MMRS00C.A.LOADLIB')
 END
//*
