DEFINE DATA         
  LOCAL 
    1 #PARAM1 (A1)
    1 #PARAM2 (A1)
END-DEFINE

PERFORM SUBROUT1
PERFORM SUBROUT2

DEFINE SUBROUTINE SUBROUT1
	IF #PARAM1 EQ ' '
		ESCAPE ROUTINE
	END-IF
END-SUBROUTINE   

DEFINE SUBROUTINE SUBROUT2
	ESCAPE MODULE
END-SUBROUTINE   

END