DEFINE DATA         
  LOCAL 
    1 MYVIEW VIEW OF UAMPDATENTRANSFERPUFFER
      2 UAMKEY
      2 CHAIN
      2 DATACONTAINER
    1 GETVIEW VIEW OF UAMPDATENTRANSFERPUFFER
      2 UAMKEY
      2 CHAIN
      2 DATACONTAINER
END-DEFINE

F1. FIND (20) MYVIEW WITH UAMKEY = 12345
  GET GETVIEW *ISN(F1.)
END-FIND

SELECT * INTO VIEW GETVIEW FROM UAMPDATENTRANSFERPUFFER
   MOVE '1111111111' TO GETVIEW.UAMKEY
END-SELECT

END