DEFINE DATA         
  LOCAL 
    1 #PARAM1 (A20)
END-DEFINE

REPEAT  
  PERFORM SUBROUT    
END-REPEAT

DEFINE WORK FILE 1 'WF-TEST'
UPLOAD PC FILE 1 #PARAM1
	WRITE(1) NOTITLE NOHDR '=' #PARAM1
END-WORK

DEFINE SUBROUTINE SUBROUT
	WRITE 'This is a subroutine'
END-SUBROUTINE   

END