DEFINE DATA         
  LOCAL 
    1 MYVIEW VIEW OF UAMPDATENTRANSFERPUFFER
      2 UAMKEY
      2 CHAIN
      2 DATACONTAINER
END-DEFINE

READ1. READ MYVIEW BY UAMKEY STARTING FROM 1 ENDING AT 1000

END-READ

END-ALL
SORT BY CHAIN DATACONTAINER USING UAMKEY
WRITE NOTITLE NOHDR CHAIN DATACONTAINER
END-SORT

END