DEFINE DATA         
  LOCAL 
    1 MYVIEW VIEW OF UAMPDATENTRANSFERPUFFER
      2 UAMKEY
      2 CHAIN
      2 DATACONTAINER
END-DEFINE

STORE MYVIEW

END