DEFINE DATA         
  LOCAL 
    1 #PARAM1 (A1)
    1 #PARAM2 (A1)
    1 UAMDTH VIEW OF UAMPDATENTRANSFERPUFFER
      2 UAMP-DT-KEY 
    1 #FROM-KEY (A31)
    1 #TO-KEY (A31)
    1 #FOUND (L) 
END-DEFINE

HISTOGRAM(1) UAMDTH UAMP-DT-KEY 
  STARTING FROM #VON-KEY ENDING AT #BIS-KEY 
  ASSIGN #FOUND = TRUE          
END-HISTOGRAM  

IF #PARAM1 EQ #PARAM2
	STOP
END-IF

TERMINATE 

END