//*---------------------------------------------------------------*             
//EVPACDUN  PROC                                                                
//*---------------------------------------------------------------*             
//* DELETION OF JOIN UNLOAD                                       *             
//*---------------------------------------------------------------*             
//STEP01  EXEC PGM=IEXUNCAT                                                     
//SYSIN  DD SUBSYS=(CCSS,                                                       
// ' &SMF.EVPACD01.UNLOAD.PRE.&CYCLE ',                                         
// ' &SMF.EVPACD01.UNLOAD.&CYCLE ')                                             
//*                                                                             
//*---------------------------------------------------------------*             
//* UNLOAD JOIN OF CONTRACT MAIL, CONTRACT MAIL HISTORY &         *             
//* ADDRESS TABLES BASED ON DATE CRITERIA;                        *             
//* &DATE1 & &DATE2                                               *             
//*---------------------------------------------------------------*             
//*    PROGRAM THAT ACCEPTS NON-SELECT SQL STATEMENTS                           
//*---------------------------------------------------------------*             
//STEP02  EXEC PGM=IKJEFT01,DYNAMNBR=20                                         
//STEPLIB  DD DSN=ADXXA6.DB2.RUNLIB.LOAD,DISP=SHR                               
//         DD DSN=ADXXA6.DB2.SDSNLOAD,DISP=SHR                                  
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//*-----------------------------------------------------*                       
//*    DCB INFO WILL BE PRESET BY JCL                   *                       
//*-----------------------------------------------------*                       
//SYSREC00 DD DSN=&SMF.EVPACD01.UNLOAD.PRE.&CYCLE,                              
//         DISP=(NEW,CATLG,DELETE),                                             
//         SPACE=(CYL,(500,50),RLSE),                                           
//         RETPD=7,                                                             
//         UNIT=DASD,                                                           
//         DCB=(LRECL=500,RECFM=FB,BLKSIZE=0)                                   
//*-----------------------------------------------------*                       
//SYSPUNCH DD  SYSOUT=*                                                         
//*-----------------------------------------------------*                       
//SYSTSIN  DD SUBSYS=(CCSS,                                                     
// ' DSN SYSTEM(DBA6)                                   ',                      
// ' RUN PROGRAM(DSNTIAUL) PLAN(DSNTIAUL) PARM(''SQL'') ')                      
//*------------------------------------------------------*                      
//SYSIN  DD SUBSYS=(CCSS,                                                       
// ' SET CURRENT SQLID = ''AD2AICPA''                               ',          
// ' ;                                                              ',          
// ' COMMIT                                                         ',          
// ' ;                                                              ',          
// ' SELECT A.CONTR_ID                                              ',          
// '       ,A.LINE_OF_BUS_CD                                        ',          
// '       ,A.DATE_UPDATED                                          ',          
// '       ,A.ADDR_ID                                               ',          
// '       ,C.ADDR_LINE_1_CD                                        ',          
// '       ,C.ADDR_LINE_2_CD                                        ',          
// '       ,C.ADDR_LINE_3_CD                                        ',          
// '       ,C.ADDR_LINE_4_CD                                        ',          
// '       ,C.ADDR_LINE_1                                           ',          
// '       ,C.ADDR_LINE_2                                           ',          
// '       ,C.ADDR_LINE_3                                           ',          
// '       ,C.ADDR_LINE_4                                           ',          
// '       ,B.ADDR_ID                                               ',          
// '       ,D.ADDR_LINE_1_CD                                        ',          
// '       ,D.ADDR_LINE_2_CD                                        ',          
// '       ,D.ADDR_LINE_3_CD                                        ',          
// '       ,D.ADDR_LINE_4_CD                                        ',          
// '       ,D.ADDR_LINE_1                                           ',          
// '       ,D.ADDR_LINE_2                                           ',          
// '       ,D.ADDR_LINE_3                                           ',          
// '       ,D.ADDR_LINE_4                                           ',          
// '       ,B.UNDELIV_IND                                           ',          
// '       ,B.CONTR_MAIL_SEQ_NUM                                    ',          
// '       ,A.UPDATED_BY                                            ',          
// ' FROM AD2AICDA.EVTCONTR_MAIL     AS A                           ',       ', 
// '     ,AD2AICDA.EVTCONTRMAIL_HIST AS B                           ',       ', 
// '     ,AD2AICDA.EVTADDR           AS C                           ',       ', 
// '     ,AD2AICDA.EVTADDR           AS D                           ',       ', 
// ' WHERE A.DATE_UPDATED                                           ',          
// '  BETWEEN ''&DATE1'' AND ''&DATE2''                             ',          
// '  AND  A.LINE_OF_BUS_CD IN (1,07,10)                            ',          
// '  AND  A.CONTR_MAIL_CD = ''1''                                  ',          
// '  AND  A.DATE_UPDATED <> A.DATE_CREATED                         ',          
// '  AND  A.DATE_UPDATED <> A.VCOA_DATE                            ',          
// '  AND  A.UNDELIV_IND = '' ''                                    ',          
// '  AND  A.CONTR_ID = B.CONTR_ID                                  ',          
// '  AND  A.DATE_UPDATED = B.DATE_CREATED                          ',          
// '  AND ((A.UPDATED_BY <> ''ZZ15'' ) AND                          ',          
// '       (A.UPDATED_BY <> ''EVPNOARR'') AND                       ',          
// '       (A.UPDATED_BY NOT LIKE   ''EVPARD%'' ))                  ',          
// '  AND  A.LINE_OF_BUS_CD = B.LINE_OF_BUS_CD                      ',          
// '  AND  B.CONTR_MAIL_SEQ_NUM =                                   ',          
// '       (SELECT MIN(Y.CONTR_MAIL_SEQ_NUM)                        ',          
// '        FROM AD2AICDA.EVTCONTRMAIL_HIST AS Y                    ',       ', 
// '        WHERE Y.CONTR_ID = A.CONTR_ID                           ',          
// '         AND  Y.LINE_OF_BUS_CD = A.LINE_OF_BUS_CD               ',          
// '         AND  Y.DATE_CREATED = A.DATE_UPDATED                   ',          
// '         AND  Y.CONTR_MAIL_CD = ''1''                           ',          
// '        )                                                       ',          
// '  AND  A.ADDR_ID <> B.ADDR_ID                                   ',          
// '  AND  A.ADDR_ID = C.ADDR_ID                                    ',          
// '  AND  B.ADDR_ID = D.ADDR_ID                                    ',          
// '  WITH UR                                                       ',          
// ' ;                                                              ',          
// ' COMMIT                                                         ',          
// ' ;                                                              ')          
//*********************************************************************         
//FILEAID1 EXEC  PGM=FILEAID                                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSLIST  DD SYSOUT=*                                                          
//DD01     DD DISP=SHR,DSN=&SMF.EVPACD01.UNLOAD.PRE.&CYCLE                      
//DD01O    DD DSN=&SMF.EVPACD01.UNLOAD.&CYCLE,                                  
//         DISP=(NEW,CATLG,DELETE),                                             
//         SPACE=(CYL,(500,50),RLSE),                                           
//         RETPD=7,                                                             
//         UNIT=DASD,                                                           
//         DCB=(LRECL=500,RECFM=FB,BLKSIZE=0)                                   
//SYSIN    DD SUBSYS=(CCSS,                                                     
// '$$DD01 COPY REPL=(464,EQ,C''2'',C''1'')  ')                                 
//*--------------------------------------------------------                     
