//MGOJOB1 JOB (0,1723),'COMMENT',CLASS=D                                 
//**********************************************************                                                                                                
//MGO0011 EXEC MGOSFTP,                                                                                                        
//             JOB='MGOJOB1',                                                  
//             SFTPUSER='ftp@my.server'                                                        
//*                                                                             