000010******************************************************************00001000
000020* MIS7101  RELATIONSHIP PRICING MODEL DEFINITION           (M01) *00002000
000030******************************************************************00003000
000040*01  MI7101-RECORD.                                              *00004000
000050     03  MIM-7101GRP-KEY.                                         00005000
000060         05  MIM-7101KINST       PIC 9(04).                       00006000
000070         05  MIM-7101KREC        PIC 9(04).                       00007000
000080         05  MIM-7101KMODEL      PIC X(10).                       00008000
000090         05  MIM-7101KEFFDT      PIC S9(08).                      00009000
000100*---------------------------------------------------------------* 00010000
000110     03  MIM-7101AUDIT-STAMP.                                     00011000
000120         05  MIM-7101UPD-DATE    PIC S9(09)      COMP-3.          00012000
000130         05  MIM-7101UPD-TIME    PIC S9(09)      COMP-3.          00013000
000140         05  MIM-7101UPD-USER    PIC X(08).                       00014000
000150         05  MIM-7101UPD-ORG     PIC X(06).                       00015000
000160*---------------------------------------------------------------* 00016000
000170     03  MIM-REC7101.                                             00017000
000180         05  MIM-7101ACTCD       PIC X(01).                       00018000
000190         05  MIM-7101DESC        PIC X(20).                       00019000
000200         05  MIM-7101SCORE       PIC 9(03).                       00020000
000210         05  MIM-7101AUTOENROLL  PIC X(01).                       00021000
000220         05  MIM-7101INCBALOPT   PIC X(01).                       00022000
000230         05  MIM-7101PROCOPT     PIC X(01).                       00023000
000240         05  MIM-7101COMBBALOPT  PIC X(01).                       00024000
000250         05  MIM-7101EXPFREQ     PIC X(01).                       00025000
000260         05  MIM-7101EXPTERM     PIC S9(03)      COMP-3.          00026000
000270         05  MIM-7101ENDOFMONTH  PIC X(01).                       00027000
000280         05  MIM-7101CLOSEDT     PIC S9(09)      COMP-3.          00028000
000290         05  MIM-7101EXPDT       PIC S9(09)      COMP-3.          00029000
000300         05  MIM-7101EXPRETDAYS  PIC S9(03)      COMP-3.          00030000
000310         05  MIM-7101FIRSTRET    PIC S9(03)      COMP-3.          00031000
000320         05  MIM-7101DAYSPEREXT  PIC S9(03)      COMP-3.          00032000
000330         05  MIM-7101EXTENSIONS  PIC S9(02).                      00033000
000340         05  MIM-7101CRWOPT      PIC X(01).                       00034000
000350         05  MIM-7101CRWPCT      PIC SV9(09)     COMP-3.          00035000
000360         05  MIM-7101CRWBALOPT   PIC X(01).                       00036000
000370         05  MIM-7101CRWFREQ     PIC X(01).                       00037000
000380         05  MIM-7101CRWTERM     PIC S9(03)      COMP-3.          00038000
000390         05  MIM-7101CRWDAY      PIC 9(02).                       00039000
000400         05  MIM-7101ACCTS       PIC 9(02).                       00040000
000410         05  MIM-7101ACCTS-Q     PIC X(01).                       00041000
000420         05  MIM-7101PROD        PIC 9(02).                       00042000
000430         05  MIM-7101PROD-Q      PIC X(01).                       00043000
000440         05  MIM-7101MINACCTS    PIC 9(02).                       00044000
000450         05  MIM-7101MINACCTS-Q  PIC X(01).                       00045000
000460         05  MIM-7101MAXACCTS    PIC 9(02).                       00046000
000470         05  MIM-7101MAXACCTS-Q  PIC X(01).                       00047000
000480         05  MIM-7101MINPRODS    PIC 9(02).                       00048000
000490         05  MIM-7101MINPRODS-Q  PIC X(01).                       00049000
000500         05  MIM-7101MAXPRODS    PIC 9(02).                       00050000
000510         05  MIM-7101MAXPRODS-Q  PIC X(01).                       00051000
000520         05  MIM-7101DEMO        PIC X(06).                       00052000
000530         05  MIM-7101DEMO-Q      PIC X(01).                       00053000
000540         05  MIM-7101CUSTRELCD   PIC X(06).                       00054000
000550         05  MIM-7101CUSTRELCD-Q PIC X(01).                       00055000
000560         05  MIM-7101PRIMBALOPT  PIC X(01).                       00056000
000570         05  MIM-7101PRIMBALOPT-Q                                 00057000
000580                                 PIC X(01).                       00058000
000590         05  MIM-7101PRIMBALOPT-I                                 00059000
000600                                 PIC X(01).                       00060000
000610         05  MIM-7101ACCTRELCDQ  PIC X(01).                       00061000
000620         05  MIM-7101ACCTRELCDI  PIC X(01).                       00062000
000630         05  MIM-7101ACCTRELCD-Q PIC X(01).                       00063000
000640         05  MIM-7101ACCTRELCD-I PIC X(01).                       00064000
000650         05  MIM-7101COMBCATCD1  PIC X(06).                       00065000
000660         05  MIM-7101COMBCATCD1-Q                                 00066000
000670                                 PIC X(01).                       00067000
000680         05  MIM-7101COMBCATCD1-I                                 00068000
000690                                 PIC X(01).                       00069000
000700         05  MIM-7101COMBCATCD2  PIC X(06).                       00070000
000710         05  MIM-7101COMBCATCD2-Q                                 00071000
000720                                 PIC X(01).                       00072000
000730         05  MIM-7101COMBCATCD2-I                                 00073000
000740                                 PIC X(01).                       00074000
000750         05  MIM-7101PRIMCOMBOPT1                                 00075000
000760                                 PIC X(01).                       00076000
000770         05  MIM-7101PRIMCOMBOPT1-Q                               00077000
000780                                 PIC X(01).                       00078000
000790         05  MIM-7101PRIMCOMBOPT1-I                               00079000
000800                                 PIC X(01).                       00080000
000810         05  MIM-7101PRIMCOMBOPT2                                 00081000
000820                                 PIC X(01).                       00082000
000830         05  MIM-7101PRIMCOMBOPT2-Q                               00083000
000840                                 PIC X(01).                       00084000
000850         05  MIM-7101PRIMCOMBOPT2-I                               00085000
000860                                 PIC X(01).                       00086000
000870         05  MIM-7101PRODUCT-GROUPING.                            00087000
000880             07  MIM-7101PGMIN1  PIC 9(02).                       00088000
000890             07  MIM-7101PGMAX1  PIC 9(02).                       00089000
000900             07  MIM-7101PG1-Q   PIC X(01).                       00090000
000910             07  MIM-7101PGMIN2  PIC 9(02).                       00091000
000920             07  MIM-7101PGMAX2  PIC 9(02).                       00092000
000930             07  MIM-7101PG2-Q   PIC X(01).                       00093000
000940             07  MIM-7101PGMIN3  PIC 9(02).                       00094000
000950             07  MIM-7101PGMAX3  PIC 9(02).                       00095000
000960             07  MIM-7101PG3-Q   PIC X(01).                       00096000
000970             07  MIM-7101PGMIN4  PIC 9(02).                       00097000
000980             07  MIM-7101PGMAX4  PIC 9(02).                       00098000
000990             07  MIM-7101PG4-Q   PIC X(01).                       00099000
001000             07  MIM-7101PGMIN5  PIC 9(02).                       00100000
001010             07  MIM-7101PGMAX5  PIC 9(02).                       00101000
001020             07  MIM-7101PG5-Q   PIC X(01).                       00102000
001030         05  MIM-7101PRODUCT-GROUPINGX                            00103000
001040                         REDEFINES MIM-7101PRODUCT-GROUPING       00104000
001050                                                 OCCURS 5.        00105000
001060             07  MIM-7101PGMIN   PIC 9(02).                       00106000
001070             07  MIM-7101PGMAX   PIC 9(02).                       00107000
001080             07  MIM-7101PG-Q    PIC X(01).                       00108000
001090         05  MIM-7101ACCTINCENOVRD                                00109000
001100                                 PIC X(01).                       00110000
001110         05  MIM-7101DEFAULTMODEL                                 00111000
001120                                 PIC X(10).                       00112000
001130         05  MIM-7101INCBALTRNOPT                                 00113000
001140                                 PIC X(01).                       00114000
001150         05  MIM-7101TRANPROFILE PIC X(06).                       00115000
001160         05  MIM-7101TRANPROFILE-I                                00116000
001170                                 PIC X(01).                       00117000
001180         05  MIM-7101CRWMAXAMOUNT                                 00118000
001190                                 PIC S9(09)V99   COMP-3.          00119000
001200         05  MIM-7101CRWMAXCOMBBAL                                00120000
001210                                 PIC S9(13)V99   COMP-3.          00121000
001220         05  MIM-7101COMBCATCD3  PIC X(06).                       00122000
001230         05  MIM-7101COMBCATCD3-Q                                 00123000
001240                                 PIC X(01).                       00124000
001250         05  MIM-7101COMBCATCD3-I                                 00125000
001260                                 PIC X(01).                       00126000
001270         05  MIM-7101COMBCATCD4  PIC X(06).                       00127000
001280         05  MIM-7101COMBCATCD4-Q                                 00128000
001290                                 PIC X(01).                       00129000
001300         05  MIM-7101COMBCATCD4-I                                 00130000
001310                                 PIC X(01).                       00131000
001320         05  MIM-7101PRIMCOMBOPT3                                 00132000
001330                                 PIC X(01).                       00133000
001340         05  MIM-7101PRIMCOMBOPT3-Q                               00134000
001350                                 PIC X(01).                       00135000
001360         05  MIM-7101PRIMCOMBOPT3-I                               00136000
001370                                 PIC X(01).                       00137000
001380         05  MIM-7101PRIMCOMBOPT4                                 00138000
001390                                 PIC X(01).                       00139000
001400         05  MIM-7101PRIMCOMBOPT4-Q                               00140000
001410                                 PIC X(01).                       00141000
001420         05  MIM-7101PRIMCOMBOPT4-I                               00142000
001430                                 PIC X(01).                       00143000
001440         05  MIM-7101RESVFLAG1   PIC X(01).                       00144000
001450         05  MIM-7101CLOSEDACCTOPT                                00145000
001460                                 PIC X(01).                       00146000
001470         05  MIM-7101SECSVCOPT   PIC X(01).                       00147000
001480         05  MIM-7101BONUSRATEOPT                                 00148000
001490                                 PIC X(01).                       00149000
001500         05  MIM-7101ENROLLATTEMPTS                               00150000
001510                                 PIC 9(02).                       00151000
001520         05  MIM-7101MODELTYPE   PIC X(10).                       00152000
001530         05  MIM-7101LONGDESC    PIC X(50).                       00153000
P0117          05  MIM-7101PRIMRELCD   PIC X(06).                       00154000
P0117          05  MIM-7101PRIMRELCD-Q PIC X(01).                       00154590
001560         05  MIM-7101EXTENROLL   PIC X(01).                       00156000
001570*----------------------------------------------------------------*00157000
001580*            END OF MICM 7101 RECORD DESCRIPTION                 *00158000
001590*----------------------------------------------------------------*00159000
