000010******************************************************************00001000
000020* MIS7101F - CARD LAYOUT (FORM 7101)                             *00002000
000030******************************************************************00003000
000040     03  MI7101C-RECORD.                                          00004000
000050         05  MIC-7101SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7101FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7101CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7101CARD00.                                      00008000
000090             07  MIC-7101INST    PIC 9(04).                       00009000
000100             07  MIC-7101MODEL   PIC X(10).                       00010000
000110             07  MIC-7101EFFDT   PIC 9(08).                       00011000
000120             07  FILLER          PIC X(42).                       00012000
000130             07  MIC-7101SEQ00   PIC X(08).                       00013000
000140         05  MIC-7101CARD01                                       00014000
000150                         REDEFINES MIC-7101CARD00.                00015000
000160             07  MIC-7101ACTCD   PIC X(01).                       00016000
000170             07  MIC-7101DESC    PIC X(20).                       00017000
000180             07  MIC-7101SCORE   PIC 9(03).                       00018000
000190             07  MIC-7101AUTOENROLL                               00019000
000200                                 PIC X(01).                       00020000
000210             07  MIC-7101INCBALOPT                                00021000
000220                                 PIC X(01).                       00022000
000230             07  MIC-7101PROCOPT                                  00023000
000240                                 PIC X(01).                       00024000
000250             07  MIC-7101COMBBALOPT                               00025000
000260                                 PIC X(01).                       00026000
000270             07  MIC-7101EXPFREQ                                  00027000
000280                                 PIC X(01).                       00028000
000290             07  MIC-7101EXPTERM PIC 9(03).                       00029000
000300             07  MIC-7101ENDOFMONTH                               00030000
000310                                 PIC X(01).                       00031000
000320             07  MIC-7101CLOSEDT PIC 9(08).                       00032000
000330             07  MIC-7101EXPDT   PIC 9(08).                       00033000
000340             07  MIC-7101EXPRETDAYS                               00034000
000350                                 PIC 9(03).                       00035000
000360             07  MIC-7101FIRSTRET                                 00036000
000370                                 PIC 9(03).                       00037000
000380             07  MIC-7101DAYSPEREXT                               00038000
000390                                 PIC 9(03).                       00039000
000400             07  MIC-7101EXTENSIONS                               00040000
000410                                 PIC 9(02).                       00041000
000420             07  MIC-7101CLOSEDACCTOPT                            00042000
000430                                 PIC X(01).                       00043000
000440             07  MIC-7101SECSVCOPT                                00044000
000450                                 PIC X(01).                       00045000
000460             07  MIC-7101BONUSRATEOPT                             00046000
000470                                 PIC X(01).                       00047000
000480             07  FILLER          PIC X(01).                       00048000
000490             07  MIC-7101SEQ01   PIC X(08).                       00049000
000500         05  MIC-7101CARD02                                       00050000
000510                         REDEFINES MIC-7101CARD00.                00051000
000520             07  MIC-7101CRWOPT  PIC X(01).                       00052000
000530             07  MIC-7101RESVFLAG1                                00053000
000540                                 PIC X(01).                       00054000
000550             07  MIC-7101CRWPCT  PIC V9(09).                      00055000
000560             07  MIC-7101CRWBALOPT                                00056000
000570                                 PIC X(01).                       00057000
000580             07  MIC-7101CRWFREQ PIC X(01).                       00058000
000590             07  MIC-7101CRWTERM PIC 9(03).                       00059000
000600             07  MIC-7101CRWDAY  PIC 9(02).                       00060000
000610             07  MIC-7101ACCTS   PIC 9(02).                       00061000
000620             07  MIC-7101ACCTS-Q PIC X(01).                       00062000
000630             07  MIC-7101PROD    PIC 9(02).                       00063000
000640             07  MIC-7101PROD-Q  PIC X(01).                       00064000
000650             07  MIC-7101MINACCTS                                 00065000
000660                                 PIC 9(02).                       00066000
000670             07  MIC-7101MINACCTS-Q                               00067000
000680                                 PIC X(01).                       00068000
000690             07  MIC-7101MAXACCTS                                 00069000
000700                                 PIC 9(02).                       00070000
000710             07  MIC-7101MAXACCTS-Q                               00071000
000720                                 PIC X(01).                       00072000
000730             07  MIC-7101MINPRODS                                 00073000
000740                                 PIC 9(02).                       00074000
000750             07  MIC-7101MINPRODS-Q                               00075000
000760                                 PIC X(01).                       00076000
000770             07  MIC-7101MAXPRODS                                 00077000
000780                                 PIC 9(02).                       00078000
000790             07  MIC-7101MAXPRODS-Q                               00079000
000800                                 PIC X(01).                       00080000
000810             07  MIC-7101DEMO    PIC X(06).                       00081000
000820             07  MIC-7101DEMO-Q  PIC X(01).                       00082000
000830             07  MIC-7101CUSTRELCD                                00083000
000840                                 PIC X(06).                       00084000
000850             07  MIC-7101CUSTRELCD-Q                              00085000
000860                                 PIC X(01).                       00086000
000870             07  MIC-7101PRIMBALOPT                               00087000
000880                                 PIC X(01).                       00088000
000890             07  MIC-7101PRIMBALOPT-Q                             00089000
000900                                 PIC X(01).                       00090000
000910             07  MIC-7101PRIMBALOPT-I                             00091000
000920                                 PIC X(01).                       00092000
000930             07  MIC-7101ACCTRELCDQ                               00093000
000940                                 PIC X(01).                       00094000
000950             07  MIC-7101ACCTRELCDI                               00095000
000960                                 PIC X(01).                       00096000
000970             07  MIC-7101ACCTRELCD-Q                              00097000
000980                                 PIC X(01).                       00098000
000990             07  MIC-7101ACCTRELCD-I                              00099000
001000                                 PIC X(01).                       00100000
001010             07  MIC-7101PRIMCOMBOPT1                             00101000
001020                                 PIC X(01).                       00102000
001030             07  MIC-7101PRIMCOMBOPT1-Q                           00103000
001040                                 PIC X(01).                       00104000
001050             07  MIC-7101PRIMCOMBOPT1-I                           00105000
001060                                 PIC X(01).                       00106000
001070             07  MIC-7101PRIMCOMBOPT2                             00107000
001080                                 PIC X(01).                       00108000
001090             07  MIC-7101PRIMCOMBOPT2-Q                           00109000
001100                                 PIC X(01).                       00110000
001110             07  MIC-7101PRIMCOMBOPT2-I                           00111000
001120                                 PIC X(01).                       00112000
001130             07  FILLER          PIC X(01).                       00113000
001140             07  MIC-7101SEQ02   PIC X(08).                       00114000
001150         05  MIC-7101CARD03                                       00115000
001160                         REDEFINES MIC-7101CARD00.                00116000
001170             07  MIC-7101COMBCATCD1                               00117000
001180                                 PIC X(06).                       00118000
001190             07  MIC-7101COMBCATCD1-Q                             00119000
001200                                 PIC X(01).                       00120000
001210             07  MIC-7101COMBCATCD1-I                             00121000
001220                                 PIC X(01).                       00122000
001230             07  MIC-7101COMBCATCD2                               00123000
001240                                 PIC X(06).                       00124000
001250             07  MIC-7101COMBCATCD2-Q                             00125000
001260                                 PIC X(01).                       00126000
001270             07  MIC-7101COMBCATCD2-I                             00127000
001280                                 PIC X(01).                       00128000
001290             07  MIC-7101PGMIN1  PIC 9(02).                       00129000
001300             07  MIC-7101PGMAX1  PIC 9(02).                       00130000
001310             07  MIC-7101PG1-Q   PIC X(01).                       00131000
001320             07  MIC-7101PGMIN2  PIC 9(02).                       00132000
001330             07  MIC-7101PGMAX2  PIC 9(02).                       00133000
001340             07  MIC-7101PG2-Q   PIC X(01).                       00134000
001350             07  MIC-7101PGMIN3  PIC 9(02).                       00135000
001360             07  MIC-7101PGMAX3  PIC 9(02).                       00136000
001370             07  MIC-7101PG3-Q   PIC X(01).                       00137000
001380             07  MIC-7101PGMIN4  PIC 9(02).                       00138000
001390             07  MIC-7101PGMAX4  PIC 9(02).                       00139000
001400             07  MIC-7101PG4-Q   PIC X(01).                       00140000
001410             07  MIC-7101PGMIN5  PIC 9(02).                       00141000
001420             07  MIC-7101PGMAX5  PIC 9(02).                       00142000
001430             07  MIC-7101PG5-Q   PIC X(01).                       00143000
001440             07  MIC-7101ACCTINCENOVRD                            00144000
001450                                 PIC X(01).                       00145000
001460             07  MIC-7101DEFAULTMODEL                             00146000
001470                                 PIC X(10).                       00147000
001480             07  MIC-7101INCBALTRNOPT                             00148000
001490                                 PIC X(01).                       00149000
001500             07  MIC-7101TRANPROFILE                              00150000
001510                                 PIC X(06).                       00151000
001520             07  MIC-7101TRANPROFILE-I                            00152000
001530                                 PIC X(01).                       00153000
001540             07  MIC-7101ENROLLATTEMPTS                           00154000
001550                                 PIC 9(02).                       00155000
001560             07  MIC-7101SECRELCD                                 00156000
001570                                 PIC X(06).                       00157000
001580             07  MIC-7101SECRELCD-Q                               00158000
001590                                 PIC X(01).                       00159000
001600             07  MIC-7101SEQ03   PIC X(08).                       00160000
001610         05  MIC-7101CARD04                                       00161000
001620                         REDEFINES MIC-7101CARD00.                00162000
001630             07  MIC-7101CRWMAXAMOUNT                             00163000
001640                                 PIC S9(09)V99.                   00164000
001650             07  MIC-7101CRWMAXCOMBBAL                            00165000
001660                                 PIC S9(13)V99.                   00166000
001670             07  MIC-7101COMBCATCD3                               00167000
001680                                 PIC X(06).                       00168000
001690             07  MIC-7101COMBCATCD3-Q                             00169000
001700                                 PIC X(01).                       00170000
001710             07  MIC-7101COMBCATCD3-I                             00171000
001720                                 PIC X(01).                       00172000
001730             07  MIC-7101COMBCATCD4                               00173000
001740                                 PIC X(06).                       00174000
001750             07  MIC-7101COMBCATCD4-Q                             00175000
001760                                 PIC X(01).                       00176000
001770             07  MIC-7101COMBCATCD4-I                             00177000
001780                                 PIC X(01).                       00178000
001790             07  MIC-7101PRIMCOMBOPT3                             00179000
001800                                 PIC X(01).                       00180000
001810             07  MIC-7101PRIMCOMBOPT3-Q                           00181000
001820                                 PIC X(01).                       00182000
001830             07  MIC-7101PRIMCOMBOPT3-I                           00183000
001840                                 PIC X(01).                       00184000
001850             07  MIC-7101PRIMCOMBOPT4                             00185000
001860                                 PIC X(01).                       00186000
001870             07  MIC-7101PRIMCOMBOPT4-Q                           00187000
001880                                 PIC X(01).                       00188000
001890             07  MIC-7101PRIMCOMBOPT4-I                           00189000
001900                                 PIC X(01).                       00190000
001910             07  MIC-7101MODELTYPE                                00191000
001920                                 PIC X(10).                       00192000
001930             07  MIC-7101EXTENROLL                                00193000
001940                                 PIC X(01).                       00194000
001950             07  FILLER          PIC X(05).                       00195000
001960             07  MIC-7101SEQ04   PIC X(08).                       00196000
001970         05  MIC-7101CARD05                                       00197000
001980                         REDEFINES MIC-7101CARD00.                00198000
001990             07  MIC-7101LONGDESC                                 00199000
002000                                 PIC X(50).                       00200000
002010             07  FILLER          PIC X(22).                       00201000
002020             07  MIC-7101SEQ05   PIC X(08).                       00202000
002030*----------------------------------------------------------------*00203000
002040*            END OF MICM 7101 CARD DESCRIPTION                   *00204000
002050*----------------------------------------------------------------*00205000
