000010******************************************************************00001000
000020* MIS7103F - CARD LAYOUT (FORM 7103)                             *00002000
000030******************************************************************00003000
000040     03  MI7103C-RECORD.                                          00004000
000050         05  MIC-7103SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7103FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7103CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7103CARD00.                                      00008000
000090             07  MIC-7103INST    PIC 9(04).                       00009000
000100             07  MIC-7103TABLE   PIC X(06).                       00010000
000110             07  MIC-7103EFFDT   PIC X(08).                       00011000
000120             07  FILLER          PIC X(46).                       00012000
000130             07  MIC-7103SEQ00   PIC X(08).                       00013000
000140         05 MIC-7103CARD01                                        00014000
000150                         REDEFINES MIC-7103CARD00.                00015000
000160             07  MIC-7103BALOPT  PIC X(01).                       00016000
000170             07  MIC-7103RATEOPT PIC X(01).                       00017000
000180             07  MIC-7103BALORDER                                 00018000
000190                                 PIC X(02).                       00019000
000200             07  MIC-7103TERMBALTABLE                             00020000
000210                                 PIC X(06).                       00021000
000220             07  MIC-7103RATEAMT-1                                00022000
000230                                 PIC 9(09).                       00023000
000240             07  MIM-7103TERM-1                                   00024000
000250                                 PIC 9(05).                       00025000
000260             07  MIC-7103RATEPCT-1                                00026000
000270                                 PIC V9(09).                      00027000
000280             07  MIC-7103RATEAMT-2                                00028000
000290                                 PIC 9(09).                       00029000
000300             07  MIM-7103TERM-2                                   00030000
000310                                 PIC 9(05).                       00031000
000320             07  MIC-7103RATEPCT-2                                00032000
000330                                 PIC V9(09).                      00033000
000340             07  FILLER          PIC X(08).                       00034000
000350             07  MIC-7103SEQ01   PIC X(08).                       00035000
000360         05 MIC-7103CARD02                                        00036000
000370                         REDEFINES MIC-7103CARD00.                00037000
000380             07  MIC-7103RATEAMT-3                                00038000
000390                                 PIC 9(09).                       00039000
000400             07  MIM-7103TERM-3                                   00040000
000410                                 PIC 9(05).                       00041000
000420             07  MIC-7103RATEPCT-3                                00042000
000430                                 PIC V9(09).                      00043000
000440             07  MIC-7103RATEAMT-4                                00044000
000450                                 PIC 9(09).                       00045000
000460             07  MIM-7103TERM-4                                   00046000
000470                                 PIC 9(05).                       00047000
000480             07  MIC-7103RATEPCT-4                                00048000
000490                                 PIC V9(09).                      00049000
000500             07  FILLER          PIC X(18).                       00050000
000510             07  MIC-7103SEQ02   PIC X(08).                       00051000
000520         05 MIC-7103CARD03                                        00052000
000530                         REDEFINES MIC-7103CARD00.                00053000
000540             07  MIC-7103RATEAMT-5                                00054000
000550                                 PIC 9(09).                       00055000
000560             07  MIM-7103TERM-5                                   00056000
000570                                 PIC 9(05).                       00057000
000580             07  MIC-7103RATEPCT-5                                00058000
000590                                 PIC V9(09).                      00059000
000600             07  MIC-7103RATEAMT-6                                00060000
000610                                 PIC 9(09).                       00061000
000620             07  MIM-7103TERM-6                                   00062000
000630                                 PIC 9(05).                       00063000
000640             07  MIC-7103RATEPCT-6                                00064000
000650                                 PIC V9(09).                      00065000
000660             07  FILLER          PIC X(18).                       00066000
000670             07  MIC-7103SEQ03   PIC X(08).                       00067000
000680         05 MIC-7103CARD04                                        00068000
000690                         REDEFINES MIC-7103CARD00.                00069000
000700             07  MIC-7103RATEAMT-7                                00070000
000710                                 PIC 9(09).                       00071000
000720             07  MIM-7103TERM-7                                   00072000
000730                                 PIC 9(05).                       00073000
000740             07  MIC-7103RATEPCT-7                                00074000
000750                                 PIC V9(09).                      00075000
000760             07  MIC-7103RATEAMT-8                                00076000
000770                                 PIC 9(09).                       00077000
000780             07  MIM-7103TERM-8                                   00078000
000790                                 PIC 9(05).                       00079000
000800             07  MIC-7103RATEPCT-8                                00080000
000810                                 PIC V9(09).                      00081000
000820             07  FILLER          PIC X(18).                       00082000
000830             07  MIC-7103SEQ04   PIC X(08).                       00083000
000840         05 MIC-7103CARD05                                        00084000
000850                         REDEFINES MIC-7103CARD00.                00085000
000860             07  MIC-7103RATEAMT-9                                00086000
000870                                 PIC 9(09).                       00087000
000880             07  MIM-7103TERM-9                                   00088000
000890                                 PIC 9(05).                       00089000
000900             07  MIC-7103RATEPCT-9                                00090000
000910                                 PIC V9(09).                      00091000
000920             07  MIC-7103RATEAMT-10                               00092000
000930                                 PIC 9(09).                       00093000
000940             07  MIM-7103TERM-10                                  00094000
000950                                 PIC 9(05).                       00095000
000960             07  MIC-7103RATEPCT-10                               00096000
000970                                 PIC V9(09).                      00097000
000980             07  FILLER          PIC X(18).                       00098000
000990             07  MIC-7103SEQ05   PIC X(08).                       00099000
001000         05 MIC-7103CARD06                                        00100000
001010                         REDEFINES MIC-7103CARD00.                00101000
001020             07  MIC-7103TERMAMT-11                               00102000
001030                                 PIC 9(09).                       00103000
001040             07  MIC-7103TERM-11                                  00104000
001050                                 PIC 9(5).                        00105000
001060             07  MIC-7103RATEPCT-11                               00106000
001070                                 PIC V9(09).                      00107000
001080             07  MIC-7103TERMAMT-12                               00108000
001090                                 PIC V9(09).                      00109000
001100             07  MIC-7103TERM-12                                  00110000
001110                                 PIC 9(05).                       00111000
001120             07  MIC-7103TERMPCT-12                               00112000
001130                                 PIC 9(09).                       00113000
001140             07  FILLER          PIC X(18).                       00114000
001150             07  MIC-7103SEQ06   PIC X(08).                       00115000
001160         05 MIC-7103CARD07                                        00116000
001170                         REDEFINES MIC-7103CARD00.                00117000
001180             07  MIC-7103TERMAMT-13                               00118000
001190                                 PIC 9(09).                       00119000
001200             07  MIC-7103TERM-13                                  00120000
001210                                 PIC 9(5).                        00121000
001220             07  MIC-7103RATEPCT-13                               00122000
001230                                 PIC V9(09).                      00123000
001240             07  MIC-7103TERMAMT-14                               00124000
001250                                 PIC V9(09).                      00125000
001260             07  MIC-7103TERM-14                                  00126000
001270                                 PIC 9(05).                       00127000
001280             07  MIC-7103TERMPCT-14                               00128000
001290                                 PIC 9(09).                       00129000
001300             07  FILLER          PIC X(18).                       00130000
001310             07  MIC-7103SEQ07   PIC X(08).                       00131000
001320         05 MIC-7103CARD08                                        00132000
001330                         REDEFINES MIC-7103CARD00.                00133000
001340             07  MIC-7103TERMAMT-15                               00134000
001350                                 PIC 9(09).                       00135000
001360             07  MIC-7103TERM-15                                  00136000
001370                                 PIC 9(5).                        00137000
001380             07  MIC-7103RATEPCT-15                               00138000
001390                                 PIC V9(09).                      00139000
001400             07  FILLER          PIC X(41).                       00140000
001410             07  MIC-7103SEQ08   PIC X(08).                       00141000
001420*----------------------------------------------------------------*00142000
001430*            END OF MICM 7103 CARD DESCRIPTION                   *00143000
001440*----------------------------------------------------------------*00144000
