000010******************************************************************00001000
000020* MIS7100  RELATIONSHIP PRICING INSTITUTIONAL RECORD       (M00) *00002000
000030******************************************************************00003000
000040*01  MI7100-RECORD.                                              *00004000
000050     03  MIM-7100GRP-KEY.                                         00005000
000060         05  MIM-7100KINST       PIC 9(04).                       00006000
000070         05  MIM-7100KREC        PIC 9(04).                       00007000
000080*---------------------------------------------------------------* 00008000
000090     03  MIM-7100AUDIT-STAMP.                                     00009000
000100         05  MIM-7100UPD-DATE    PIC S9(09)      COMP-3.          00010000
000110         05  MIM-7100UPD-TIME    PIC S9(09)      COMP-3.          00011000
000120         05  MIM-7100UPD-USER    PIC X(08).                       00012000
000130         05  MIM-7100UPD-ORG     PIC X(06).                       00013000
000140*---------------------------------------------------------------* 00014000
000150     03  MIM-REC7100.                                             00015000
000160         05  MIM-7100ACCTLIMITOPT                                 00016000
000170                                 PIC X(01).                       00017000
000180         05  MIM-7100CUSTLIMITOPT                                 00018000
000190                                 PIC X(01).                       00019000
000200         05  MIM-7100EXPRETDAYS  PIC S9(03).                      00020000
000210         05  MIM-7100ADDONINCOPT PIC X(01).                       00021000
000220         05  MIM-7100SECSVCOPT   PIC X(01).                       00022000
000230         05  MIM-7100VALIDATIONOPT                                00023000
000240                                 PIC X(01).                       00024000
000250         05  MIM-7100MAXRETDAYS                                   00025000
000260                                 PIC S9(03).                      00026000
000270         05  MIM-7100MAXEXTENSIONS                                00027000
000280                                 PIC S9(02).                      00028000
000290         05  MIM-7100BONUSRATEOPT                                 00029000
000300                                 PIC X(01).                       00030000
000310         05  MIM-7100ENTERPRISEOPT                                00031000
000320                                 PIC X(01).                       00032000
000330         05  MIM-7100ENTERPRISEINST                               00033000
000340                                 PIC 9(04).                       00034000
000350         05  MIM-7100DUPINCOPT   PIC X(01).                       00035000
000360         05  MIM-7100DUPINCRULE  PIC X(01).                       00036000
000370         05  MIM-7100MAXMODELS                                    00037000
000380                                 PIC S9(02).                      00038000
000390         05  MIM-7100MAXACCOUNTS                                  00039000
000400                                 PIC S9(03).                      00040000
000410         05  MIM-7100EVENTHISTORYOPT                              00041000
000420                                 PIC X(01).                       00042000
000430         05  MIM-7100EVENTHISTORYDAYS                             00043000
000440                                 PIC S9(03).                      00044000
000450*----------------------------------------------------------------*00045000
000460*            END OF MICM 7100 RECORD DESCRIPTION                 *00046000
000470*----------------------------------------------------------------*00047000
