000010******************************************************************00001000
000020* MIS7100F - CARD LAYOUT (FORM 7100)                             *00002000
000030******************************************************************00003000
000040     03  MI7100C-RECORD.                                          00004000
000050         05  MIC-7100SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7100FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7100CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7100CARD00.                                      00008000
000090             07  MIC-7100INST    PIC 9(04).                       00009000
000100             07  FILLER          PIC X(60).                       00010000
000110             07  MIC-7100SEQ00   PIC X(08).                       00011000
000120         05  MIC-7100CARD01                                       00012000
000130                         REDEFINES MIC-7100CARD00.                00013000
000140             07  MIC-7100ACCTLIMITOPT                             00014000
000150                                 PIC X(01).                       00015000
000160             07  MIC-7100CUSTLIMITOPT                             00016000
000170                                 PIC X(01).                       00017000
000180             07  MIC-7100EXPRETDAYS                               00018000
000190                                 PIC 9(03).                       00019000
000200             07  MIC-7100ADDONINCOPT                              00020000
000210                                 PIC X(01).                       00021000
000220             07  MIC-7100SECSVCOPT                                00022000
000230                                 PIC X(01).                       00023000
000240             07  MIC-7100VALIDATIONOPT                            00024000
000250                                 PIC X(01).                       00025000
000260             07  MIC-7100MAXRETDAYS                               00026000
000270                                 PIC 9(03).                       00027000
000280             07  MIC-7100MAXEXTENSIONS                            00028000
000290                                 PIC 9(02).                       00029000
000300             07  MIC-7100BONUSRATEOPT                             00030000
000310                                 PIC X(01).                       00031000
000320             07  MIC-7100ENTERPRISEOPT                            00032000
000330                                 PIC X(01).                       00033000
000340             07  MIC-7100ENTERPRISEINST                           00034000
000350                                 PIC 9(04).                       00035000
000360             07  MIC-7100DUPINCOPT                                00036000
000370                                 PIC X(01).                       00037000
000380             07  MIC-7100DUPINCRULE                               00038000
000390                                 PIC X(01).                       00039000
000400             05  MIC-7100MAXMODELS                                00040000
000410                                 PIC 9(02).                       00041000
000420             05  MIC-7100MAXACCOUNTS                              00042000
000430                                 PIC 9(03).                       00043000
000440             05  MIC-7100EVENTHISTORYOPT                          00044000
000450                                 PIC X(01).                       00045000
000460             05  MIC-7100EVENTHISTORYDAYS                         00046000
000470                                 PIC 9(03).                       00047000
000480             07  FILLER          PIC X(34).                       00048000
000490             07  MIC-7100SEQ01   PIC X(08).                       00049000
000500*----------------------------------------------------------------*00050000
000510*            END OF MICM 7100 CARD DESCRIPTION                   *00051000
000520*----------------------------------------------------------------*00052000
