000010******************************************************************00001000
000020* MIS7103  RATE INCENTIVES TABLE                           (M03) *00002000
000030******************************************************************00003000
000040*01  MI7103-RECORD.                                              *00004000
000050     03  MIM-7103GRP-KEY.                                         00005000
000060         05  MIM-7103KINST       PIC 9(04).                       00006000
000070         05  MIM-7103KREC        PIC 9(04).                       00007000
000080         05  MIM-7103KRATETABLE  PIC X(06).                       00008000
000090         05  MIM-7103KEFFDT      PIC S9(08).                      00009000
000100*---------------------------------------------------------------* 00010000
000110     03  MIM-7103AUDIT-STAMP.                                     00011000
000120         05  MIM-7103UPD-DATE    PIC S9(09)      COMP-3.          00012000
000130         05  MIM-7103UPD-TIME    PIC S9(09)      COMP-3.          00013000
000140         05  MIM-7103UPD-USER    PIC X(08).                       00014000
000150         05  MIM-7103UPD-ORG     PIC X(06).                       00015000
000160*---------------------------------------------------------------* 00016000
000170     03  MIM-REC7103.                                             00017000
000180         05  MIM-7103BALOPT      PIC X(01).                       00018000
000190         05  MIM-7103RATEOPT     PIC X(01).                       00019000
000200         05  MIM-7103BALORDER    PIC X(02).                       00020000
000210         05  MIM-7103TERMBALTABLE                                 00021000
000220                                 PIC X(06).                       00022000
000230         05  MIM-REC7103-DATA.                                    00023000
000240             07  MIM-7103RATEAMT-01                               00024000
000250                                 PIC S9(09)      COMP-3.          00025000
000260             07  MIM-7103TERM-01 PIC S9(05)      COMP-3.          00026000
000270             07  MIM-7103RATEPCT-01                               00027000
000280                                 PIC SV9(09)     COMP-3.          00028000
000290             07  MIM-7103RATEAMT-02                               00029000
000300                                 PIC S9(09)      COMP-3.          00030000
000310             07  MIM-7103TERM-02 PIC S9(05)      COMP-3.          00031000
000320             07  MIM-7103RATEPCT-02                               00032000
000330                                 PIC SV9(09)     COMP-3.          00033000
000340             07  MIM-7103RATEAMT-03                               00034000
000350                                 PIC S9(09)      COMP-3.          00035000
000360             07  MIM-7103TERM-03 PIC S9(05)      COMP-3.          00036000
000370             07  MIM-7103RATEPCT-03                               00037000
000380                                 PIC SV9(09)     COMP-3.          00038000
000390             07  MIM-7103RATEAMT-04                               00039000
000400                                 PIC S9(09)      COMP-3.          00040000
000410             07  MIM-7103TERM-04 PIC S9(05)      COMP-3.          00041000
000420             07  MIM-7103RATEPCT-04                               00042000
000430                                 PIC SV9(09)     COMP-3.          00043000
000440             07  MIM-7103RATEAMT-05                               00044000
000450                                 PIC S9(09)      COMP-3.          00045000
000460             07  MIM-7103TERM-05 PIC S9(05)      COMP-3.          00046000
000470             07  MIM-7103RATEPCT-05                               00047000
000480                                 PIC SV9(09)     COMP-3.          00048000
000490             07  MIM-7103RATEAMT-06                               00049000
000500                                 PIC S9(09)      COMP-3.          00050000
000510             07  MIM-7103TERM-06 PIC S9(05)      COMP-3.          00051000
000520             07  MIM-7103RATEPCT-06                               00052000
000530                                 PIC SV9(09)     COMP-3.          00053000
000540             07  MIM-7103RATEAMT-07                               00054000
000550                                 PIC S9(09)      COMP-3.          00055000
000560             07  MIM-7103TERM-07 PIC S9(05)      COMP-3.          00056000
000570             07  MIM-7103RATEPCT-07                               00057000
000580                                 PIC SV9(09)     COMP-3.          00058000
000590             07  MIM-7103RATEAMT-08                               00059000
000600                                 PIC S9(09)      COMP-3.          00060000
000610             07  MIM-7103TERM-08 PIC S9(05)      COMP-3.          00061000
000620             07  MIM-7103RATEPCT-08                               00062000
000630                                 PIC SV9(09)     COMP-3.          00063000
000640             07  MIM-7103RATEAMT-09                               00064000
000650                                 PIC S9(09)      COMP-3.          00065000
000660             07  MIM-7103TERM-09 PIC S9(05)      COMP-3.          00066000
000670             07  MIM-7103RATEPCT-09                               00067000
000680                                 PIC SV9(09)     COMP-3.          00068000
000690             07  MIM-7103RATEAMT-10                               00069000
000700                                 PIC S9(09)      COMP-3.          00070000
000710             07  MIM-7103TERM-10 PIC S9(05)      COMP-3.          00071000
000720             07  MIM-7103RATEPCT-10                               00072000
000730                                 PIC SV9(09)     COMP-3.          00073000
000740             07  MIM-7103RATEAMT-11                               00074000
000750                                 PIC S9(09)      COMP-3.          00075000
000760             07  MIM-7103TERM-11 PIC S9(05)      COMP-3.          00076000
000770             07  MIM-7103RATEPCT-11                               00077000
000780                                 PIC SV9(09)     COMP-3.          00078000
000790             07  MIM-7103RATEAMT-12                               00079000
000800                                 PIC S9(09)      COMP-3.          00080000
000810             07  MIM-7103TERM-12 PIC S9(05)      COMP-3.          00081000
000820             07  MIM-7103RATEPCT-12                               00082000
000830                                 PIC SV9(09)     COMP-3.          00083000
000840             07  MIM-7103RATEAMT-13                               00084000
000850                                 PIC S9(09)      COMP-3.          00085000
000860             07  MIM-7103TERM-13 PIC S9(05)      COMP-3.          00086000
000870             07  MIM-7103RATEPCT-13                               00087000
000880                                 PIC SV9(09)     COMP-3.          00088000
000890             07  MIM-7103RATEAMT-14                               00089000
000900                                 PIC S9(09)      COMP-3.          00090000
000910             07  MIM-7103TERM-14 PIC S9(05)      COMP-3.          00091000
000920             07  MIM-7103RATEPCT-14                               00092000
000930                                 PIC SV9(09)     COMP-3.          00093000
000940             07  MIM-7103RATEAMT-15                               00094000
000950                                 PIC S9(09)      COMP-3.          00095000
000960             07  MIM-7103TERM-15 PIC S9(05)      COMP-3.          00096000
000970             07  MIM-7103RATEPCT-15                               00097000
000980                                 PIC SV9(09)     COMP-3.          00098000
000990         05  MIM-REC7103-RATEINC                                  00099000
001000                         REDEFINES MIM-REC7103-DATA               00100000
001010                                                 OCCURS 15.       00101000
001020             07  MIM-7103RATEAMT PIC S9(09)      COMP-3.          00102000
001030             07  MIM-7103TERM    PIC S9(05)      COMP-3.          00103000
001040             07  MIM-7103RATEPCT PIC SV9(09)     COMP-3.          00104000
001050*----------------------------------------------------------------*00105000
001060*            END OF MICM 7103 RECORD DESCRIPTION                 *00106000
001070*----------------------------------------------------------------*00107000
