000010******************************************************************00001000
000020* MIS7106  CATEGORY BALANCE DEFINITION                     (M06) *00002000
000030******************************************************************00003000
000040*01  MI7106-RECORD.                                              *00004000
000050     03  MIM-7106GRP-KEY.                                         00005000
000060         05  MIM-7106KINST       PIC 9(04).                       00006000
000070         05  MIM-7106KREC        PIC 9(04).                       00007000
000080         05  MIM-7106KRPREC      PIC X(06).                       00008000
000090*---------------------------------------------------------------* 00009000
000100     03  MIM-7106AUDIT-STAMP.                                     00010000
000110         05  MIM-7106UPD-DATE    PIC S9(09)      COMP-3.          00011000
000120         05  MIM-7106UPD-TIME    PIC S9(09)      COMP-3.          00012000
000130         05  MIM-7106UPD-USER    PIC X(08).                       00013000
000140         05  MIM-7106UPD-ORG     PIC X(06).                       00014000
000150*---------------------------------------------------------------* 00015000
000160     03  MIM-REC7106.                                             00016000
000170         05  MIM-7106DESC        PIC X(20).                       00017000
000180         05  MIM-7106BALCD       PIC 9(02).                       00018000
000190         05  MIM-7106BALREQ-E    PIC S9(09)V99   COMP-3.          00019000
000200         05  MIM-7106BALREQ-I    PIC S9(09)V99   COMP-3.          00020000
000210*----------------------------------------------------------------*00021000
000220*            END OF MICM 7106 RECORD DESCRIPTION                 *00022000
000230*----------------------------------------------------------------*00023000
