000010******************************************************************00001000
000020* MIS7102  RELATIONSHIP PRICING PRODUCT DEFINITION         (M02) *00002000
000030******************************************************************00003000
000040*01  MI7102-RECORD.                                              *00004000
000050     03  MIM-7102GRP-KEY.                                         00005000
000060         05  MIM-7102KINST       PIC 9(04).                       00006000
000070         05  MIM-7102KREC        PIC 9(04).                       00007000
000080         05  MIM-7102KMODEL      PIC X(10).                       00008000
000090         05  MIM-7102KPRODCODE   PIC X(06).                       00009000
000100         05  MIM-7102KACCTTYPE   PIC 9(03).                       00010000
000110*---------------------------------------------------------------* 00011000
000120     03  MIM-7102AUDIT-STAMP.                                     00012000
000130         05  MIM-7102UPD-DATE    PIC S9(09)      COMP-3.          00013000
000140         05  MIM-7102UPD-TIME    PIC S9(09)      COMP-3.          00014000
000150         05  MIM-7102UPD-USER    PIC X(08).                       00015000
000160         05  MIM-7102UPD-ORG     PIC X(06).                       00016000
000170*---------------------------------------------------------------* 00017000
000180     03  MIM-REC7102.                                             00018000
000190         05  MIM-7102PRIMARY     PIC X(01).                       00019000
000200         05  MIM-7102PRODUCTGROUP                                 00020000
000210                                 PIC 9(01).                       00021000
000220         05  MIM-7102MINACCTS    PIC S9(02).                      00022000
000230         05  MIM-7102MINACCTS-Q  PIC X(01).                       00023000
000240         05  MIM-7102MAXSECACCTS PIC S9(02).                      00024000
000250         05  MIM-7102MAXSECACCTS-Q                                00025000
000260                                 PIC X(01).                       00026000
000270         05  MIM-7102MINTERM     PIC S9(05).                      00027000
000280         05  MIM-7102MINTERM-Q   PIC X(01).                       00028000
000290         05  MIM-7102MAXTERM     PIC S9(05).                      00029000
000300         05  MIM-7102MAXTERM-Q   PIC X(01).                       00030000
000310         05  MIM-7102BRCHREGIONCD                                 00031000
000320                                 PIC X(06).                       00032000
000330         05  MIM-7102BRCHREGIONCD-Q                               00033000
000340                                 PIC X(01).                       00034000
000350         05  MIM-7102PRIMCATCD   PIC X(06).                       00035000
000360         05  MIM-7102PRIMCATCD-Q PIC X(01).                       00036000
000370         05  MIM-7102PRIMCATCD-I PIC X(01).                       00037000
000380         05  MIM-7102COMBBALCD1  PIC 9(02).                       00038000
000390         05  MIM-7102COMBBALCD1-Q                                 00039000
000400                                 PIC X(01).                       00040000
000410         05  MIM-7102COMBBALCD1-I                                 00041000
000420                                 PIC X(01).                       00042000
000430         05  MIM-7102COMBBALCD2  PIC 9(02).                       00043000
000440         05  MIM-7102COMBBALCD2-Q                                 00044000
000450                                 PIC X(01).                       00045000
000460         05  MIM-7102COMBBALCD2-I                                 00046000
000470                                 PIC X(01).                       00047000
000480         05  MIM-7102BALCATCD1   PIC X(06).                       00048000
000490         05  MIM-7102BALCATCD1-Q PIC X(01).                       00049000
000500         05  MIM-7102BALCATCD1-I PIC X(01).                       00050000
000510         05  MIM-7102BALCATCD2   PIC X(06).                       00051000
000520         05  MIM-7102BALCATCD2-Q PIC X(01).                       00052000
000530         05  MIM-7102BALCATCD2-I PIC X(01).                       00053000
000540         05  MIM-7102USERRTN     PIC X(01).                       00054000
000550         05  MIM-7102USERRTN-Q   PIC X(01).                       00055000
000560         05  MIM-7102USERRTN-I   PIC X(01).                       00056000
000570         05  MIM-7102PRIMSCINCOPT                                 00057000
000580                                 PIC X(01).                       00058000
000590         05  MIM-7102SECSCINCOPT PIC X(01).                       00059000
000600         05  MIM-7102DISCAMT     PIC S9(03)V99   COMP-3.          00060000
000610         05  MIM-7102DISCPCT     PIC SV9(05)     COMP-3.          00061000
000620         05  MIM-7102PRIMRATEINCOPT                               00062000
000630                                 PIC X(01).                       00063000
000640         05  MIM-7102SECRATEINCOPT                                00064000
000650                                 PIC X(01).                       00065000
000660         05  MIM-7102RATEINCTABLE                                 00066000
000670                                 PIC X(06).                       00067000
000680         05  MIM-7102TIMEPROCOPT PIC X(01).                       00068000
000690         05  MIM-7102ACCTRATEBALCD                                00069000
000700                                 PIC 9(02).                       00070000
000710         05  MIM-7102CRWMINAMT   PIC S9(09)      COMP-3.          00071000
000720         05  MIM-7102CRWMAXAMT   PIC S9(09)      COMP-3.          00072000
000730         05  MIM-7102CRWBALCD    PIC 9(02).                       00073000
000740         05  MIM-7102MISCOPTION1 PIC X(01).                       00074000
000750         05  MIM-7102MISCOPTION2 PIC X(01).                       00075000
000760         05  MIM-7102MISCOPTION3 PIC X(01).                       00076000
000770         05  MIM-7102SCINCTABLE  PIC X(06).                       00077000
000780         05  MIM-7102SCBALCD     PIC 9(02).                       00078000
000790         05  MIM-7102RATEPCT     PIC SV9(09)     COMP-3.          00079000
000800         05  MIM-7102TRANPLAN    PIC 9(03).                       00080000
000810         05  MIM-7102USEROPTREL1 PIC X(02).                       00081000
000820         05  MIM-7102USEROPT1    PIC X(01).                       00082000
000830         05  MIM-7102USEROPT1-Q  PIC X(01).                       00083000
000840         05  MIM-7102USEROPTREL2 PIC X(02).                       00084000
000850         05  MIM-7102USEROPT2    PIC X(01).                       00085000
000860         05  MIM-7102USEROPT2-Q  PIC X(01).                       00086000
000870         05  MIM-7102USEROPTREL3 PIC X(02).                       00087000
000880         05  MIM-7102USEROPT3    PIC X(01).                       00088000
000890         05  MIM-7102USEROPT3-Q  PIC X(01).                       00089000
000900         05  MIM-7102USEROPTREL4 PIC X(02).                       00090000
000910         05  MIM-7102USEROPT4    PIC X(01).                       00091000
000920         05  MIM-7102USEROPT4-Q  PIC X(01).                       00092000
000930         05  MIM-7102COMBBALCD3  PIC 9(02).                       00093000
000940         05  MIM-7102COMBBALCD3-Q                                 00094000
000950                                 PIC X(01).                       00095000
000960         05  MIM-7102COMBBALCD3-I                                 00096000
000970                                 PIC X(01).                       00097000
000980         05  MIM-7102COMBBALCD4  PIC 9(02).                       00098000
000990         05  MIM-7102COMBBALCD4-Q                                 00099000
001000                                 PIC X(01).                       00100000
001010         05  MIM-7102COMBBALCD4-I                                 00101000
001020                                 PIC X(01).                       00102000
001030         05  MIM-7102SECSVCOPT   PIC X(01).                       00103000
001040         05  MIM-7102BONUSRATEOPT                                 00104000
001050                                 PIC X(01).                       00105000
001060         05  MIM-7102SECSVCPLAN  PIC X(06).                       00106000
001070         05  MIM-7102SECSVCTABLE PIC X(06).                       00107000
001080         05  MIM-7102SECSVCBALCD PIC 9(02).                       00108000
001090         05  MIM-7102RATETYPE    PIC X(01).                       00109000
001100         05  MIM-7102USERTYPE1   PIC X(01).                       00110000
001110         05  MIM-7102USERTYPE2   PIC X(01).                       00111000
001120         05  MIM-7102USERTYPE3   PIC X(01).                       00112000
001130         05  MIM-7102USERTYPE4   PIC X(01).                       00113000
001140*----------------------------------------------------------------*00114000
001150*            END OF MICM 7102 RECORD DESCRIPTION                 *00115000
001160*----------------------------------------------------------------*00116000
