000010******************************************************************00001000
000020* MIS7108F - CARD LAYOUT (FORM 7108)                             *00002000
000030******************************************************************00003000
000040     03  MI7108C-RECORD.                                          00004000
000050         05  MIC-7108SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7108FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7108CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7108CARD00.                                      00008000
000090             07  MIC-7108INST    PIC 9(04).                       00009000
000100             07  MIC-7108SECSVC  PIC X(06).                       00010000
000110             07  FILLER          PIC X(54).                       00011000
000120             07  MIC-7108SEQ00   PIC X(08).                       00012000
000130         05  MIC-7108CARD01                                       00013000
000140                         REDEFINES MIC-7108CARD00.                00014000
000150             07  MIC-7108DESC    PIC X(30).                       00015000
000160             07  FILLER          PIC X(34).                       00016000
000170             07  MIC-7108SEQ01   PIC X(08).                       00017000
000180*----------------------------------------------------------------*00018000
000190*            END OF MICM 7108 CARD DESCRIPTION                   *00019000
000200*----------------------------------------------------------------*00020000
