000010******************************************************************00001000
000020* MIS7105F - CARD LAYOUT (FORM 7105)                             *00002000
000030******************************************************************00003000
000040     03  MI7105C-RECORD.                                          00004000
000050         05  MIC-7105SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7105FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7105CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7105CARD00.                                      00008000
000090             07  MIC-7105INST    PIC 9(04).                       00009000
000100             07  MIC-7105DEMO    PIC X(06).                       00010000
000110             07  FILLER          PIC X(54).                       00011000
000120             07  MIC-7105SEQ00   PIC X(08).                       00012000
000130         05  MIC-7105CARD01                                       00013000
000140                         REDEFINES MIC-7105CARD00.                00014000
000150             07  MIC-7105KEYWORD-1                                00015000
000160                                 PIC X(15).                       00016000
000170             07  MIC-7105REL-1   PIC X(02).                       00017000
000180             07  MIC-7105VALUE-1 PIC X(15).                       00018000
000190             07  MIC-7105CONJUNCTION-1                            00019000
000200                                 PIC X(03).                       00020000
000210             07  FILLER          PIC X(29).                       00021000
000220             07  MIC-7105SEQ01   PIC X(08).                       00022000
000230         05  MIC-7105CARD02                                       00023000
000240                         REDEFINES MIC-7105CARD00.                00024000
000250             07  MIC-7105KEYWORD-2                                00025000
000260                                 PIC X(15).                       00026000
000270             07  MIC-7105REL-2   PIC X(02).                       00027000
000280             07  MIC-7105VALUE-2 PIC X(15).                       00028000
000290             07  MIC-7105CONJUNCTION-2                            00029000
000300                                 PIC X(03).                       00030000
000310             07  FILLER          PIC X(29).                       00031000
000320             07  MIC-7105SEQ02   PIC X(08).                       00032000
000330         05  MIC-7105CARD03                                       00033000
000340                         REDEFINES MIC-7105CARD00.                00034000
000350             07  MIC-7105KEYWORD-3                                00035000
000360                                 PIC X(15).                       00036000
000370             07  MIC-7105REL-3   PIC X(02).                       00037000
000380             07  MIC-7105VALUE-3 PIC X(15).                       00038000
000390             07  MIC-7105CONJUNCTION-3                            00039000
000400                                 PIC X(03).                       00040000
000410             07  FILLER          PIC X(29).                       00041000
000420             07  MIC-7105SEQ03   PIC X(08).                       00042000
000430         05  MIC-7105CARD04                                       00043000
000440                         REDEFINES MIC-7105CARD00.                00044000
000450             07  MIC-7105KEYWORD-4                                00045000
000460                                 PIC X(15).                       00046000
000470             07  MIC-7105REL-4   PIC X(02).                       00047000
000480             07  MIC-7105VALUE-4 PIC X(15).                       00048000
000490             07  MIC-7105CONJUNCTION-4                            00049000
000500                                 PIC X(03).                       00050000
000510             07  FILLER          PIC X(29).                       00051000
000520             07  MIC-7105SEQ04   PIC X(08).                       00052000
000530         05  MIC-7105CARD05                                       00053000
000540                         REDEFINES MIC-7105CARD00.                00054000
000550             07  MIC-7105KEYWORD-5                                00055000
000560                                 PIC X(15).                       00056000
000570             07  MIC-7105REL-5   PIC X(02).                       00057000
000580             07  MIC-7105VALUE-5 PIC X(15).                       00058000
000590             07  MIC-7105CONJUNCTION-5                            00059000
000600                                 PIC X(03).                       00060000
000610             07  FILLER          PIC X(29).                       00061000
000620             07  MIC-7105SEQ05   PIC X(08).                       00062000
000630         05  MIC-7105CARD06                                       00063000
000640                         REDEFINES MIC-7105CARD00.                00064000
000650             07  MIC-7105KEYWORD-6                                00065000
000660                                 PIC X(15).                       00066000
000670             07  MIC-7105REL-6   PIC X(02).                       00067000
000680             07  MIC-7105VALUE-6 PIC X(15).                       00068000
000690             07  MIC-7105CONJUNCTION-6                            00069000
000700                                 PIC X(03).                       00070000
000710             07  FILLER          PIC X(29).                       00071000
000720             07  MIC-7105SEQ06   PIC X(08).                       00072000
000730         05  MIC-7105CARD07                                       00073000
000740                         REDEFINES MIC-7105CARD00.                00074000
000750             07  MIC-7105KEYWORD-7                                00075000
000760                                 PIC X(15).                       00076000
000770             07  MIC-7105REL-7   PIC X(02).                       00077000
000780             07  MIC-7105VALUE-7 PIC X(15).                       00078000
000790             07  MIC-7105CONJUNCTION-7                            00079000
000800                                 PIC X(03).                       00080000
000810             07  FILLER          PIC X(29).                       00081000
000820             07  MIC-7105SEQ07   PIC X(08).                       00082000
000830         05  MIC-7105CARD08                                       00083000
000840                         REDEFINES MIC-7105CARD00.                00084000
000850             07  MIC-7105KEYWORD-8                                00085000
000860                                 PIC X(15).                       00086000
000870             07  MIC-7105REL-8   PIC X(02).                       00087000
000880             07  MIC-7105VALUE-8 PIC X(15).                       00088000
000890             07  MIC-7105CONJUNCTION-8                            00089000
000900                                 PIC X(03).                       00090000
000910             07  FILLER          PIC X(29).                       00091000
000920             07  MIC-7105SEQ08   PIC X(08).                       00092000
000930         05  MIC-7105CARD09                                       00093000
000940                         REDEFINES MIC-7105CARD00.                00094000
000950             07  MIC-7105KEYWORD-9                                00095000
000960                                 PIC X(15).                       00096000
000970             07  MIC-7105REL-9   PIC X(02).                       00097000
000980             07  MIC-7105VALUE-9 PIC X(15).                       00098000
000990             07  MIC-7105CONJUNCTION-9                            00099000
001000                                 PIC X(03).                       00100000
001010             07  FILLER          PIC X(29).                       00101000
001020             07  MIC-7105SEQ09   PIC X(08).                       00102000
001030         05  MIC-7105CARD10                                       00103000
001040                         REDEFINES MIC-7105CARD00.                00104000
001050             07  MIC-7105KEYWORD-10                               00105000
001060                                 PIC X(15).                       00106000
001070             07  MIC-7105REL-10  PIC X(02).                       00107000
001080             07  MIC-7105VALUE-10                                 00108000
001090                                 PIC X(15).                       00109000
001100             07  MIC-7105CONJUNCTION-10                           00110000
001110                                 PIC X(03).                       00111000
001120             07  FILLER          PIC X(29).                       00112000
001130             07  MIC-7105SEQ10   PIC X(08).                       00113000
001140         05  MIC-7105CARD11                                       00114000
001150                         REDEFINES MIC-7105CARD00.                00115000
001160             07  MIC-7105KEYWORD-11                               00116000
001170                                 PIC X(15).                       00117000
001180             07  MIC-7105REL-11  PIC X(02).                       00118000
001190             07  MIC-7105VALUE-11                                 00119000
001200                                 PIC X(15).                       00120000
001210             07  MIC-7105CONJUNCTION-11                           00121000
001220                                 PIC X(03).                       00122000
001230             07  FILLER          PIC X(29).                       00123000
001240             07  MIC-7105SEQ11   PIC X(08).                       00124000
001250         05  MIC-7105CARD12                                       00125000
001260                         REDEFINES MIC-7105CARD00.                00126000
001270             07  MIC-7105KEYWORD-12                               00127000
001280                                 PIC X(15).                       00128000
001290             07  MIC-7105REL-12  PIC X(02).                       00129000
001300             07  MIC-7105VALUE-12                                 00130000
001310                                 PIC X(15).                       00131000
001320             07  MIC-7105CONJUNCTION-12                           00132000
001330                                 PIC X(03).                       00133000
001340             07  FILLER          PIC X(29).                       00134000
001350             07  MIC-7105SEQ12   PIC X(08).                       00135000
001360         05  MIC-7105CARD13                                       00136000
001370                         REDEFINES MIC-7105CARD00.                00137000
001380             07  MIC-7105KEYWORD-13                               00138000
001390                                 PIC X(15).                       00139000
001400             07  MIC-7105REL-13  PIC X(02).                       00140000
001410             07  MIC-7105VALUE-13                                 00141000
001420                                 PIC X(15).                       00142000
001430             07  MIC-7105CONJUNCTION-13                           00143000
001440                                 PIC X(03).                       00144000
001450             07  FILLER          PIC X(29).                       00145000
001460             07  MIC-7105SEQ13   PIC X(08).                       00146000
001470         05  MIC-7105CARD14                                       00147000
001480                         REDEFINES MIC-7105CARD00.                00148000
001490             07  MIC-7105KEYWORD-14F                              00149000
001500                                 PIC X(15).                       00150000
001510             07  MIC-7105REL-14  PIC X(02).                       00151000
001520             07  MIC-7105VALUE-14                                 00152000
001530                                 PIC X(15).                       00153000
001540             07  MIC-7105CONJUNCTION-14                           00154000
001550                                 PIC X(03).                       00155000
001560             07  FILLER          PIC X(29).                       00156000
001570             07  MIC-7105SEQ14   PIC X(08).                       00157000
001580         05  MIC-7105CARD15                                       00158000
001590                         REDEFINES MIC-7105CARD00.                00159000
001600             07  MIC-7105KEYWORD-15                               00160000
001610                                 PIC X(15).                       00161000
001620             07  MIC-7105REL-15  PIC X(02).                       00162000
001630             07  MIC-7105VALUE-15                                 00163000
001640                                 PIC X(15).                       00164000
001650             07  MIC-7105CONJUNCTION-15                           00165000
001660                                 PIC X(03).                       00166000
001670             07  FILLER          PIC X(29).                       00167000
001680             07  MIC-7105SEQ15   PIC X(08).                       00168000
001690*----------------------------------------------------------------*00169000
001700*            END OF MICM 7105 CARD DESCRIPTION                   *00170000
001710*----------------------------------------------------------------*00171000
