000010******************************************************************00001000
000020* MIS7113F - CARD LAYOUT (FORM 7113)                             *00002000
000030******************************************************************00003000
000040     03  MI7113C-RECORD.                                          00004000
000050         05  MIC-7113SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7113FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7113CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7113CARD00.                                      00008000
000090             07  MIC-7113INST    PIC 9(04).                       00009000
000100             07  MIC-7113SSCATCD PIC X(06).                       00010000
000110             07  FILLER          PIC X(54).                       00011000
000120             07  MIC-7113SEQ00   PIC X(08).                       00012000
000130         05 MIC-7113CARD01                                        00013000
000140                         REDEFINES MIC-7113CARD00.                00014000
000150             07  MIC-7113SECSVCCD-01                              00015000
000160                                 PIC X(06).                       00016000
000170             07  MIC-7113SECSVCCD-02                              00017000
000180                                 PIC X(06).                       00018000
000190             07  MIC-7113SECSVCCD-03                              00019000
000200                                 PIC X(06).                       00020000
000210             07  MIC-7113SECSVCCD-04                              00021000
000220                                 PIC X(06).                       00022000
000230             07  MIC-7113SECSVCCD-05                              00023000
000240                                 PIC X(06).                       00024000
000250             07  MIC-7113SECSVCCD-06                              00025000
000260                                 PIC X(06).                       00026000
000270             07  MIC-7113SECSVCCD-07                              00027000
000280                                 PIC X(06).                       00028000
000290             07  MIC-7113SECSVCCD-08                              00029000
000300                                 PIC X(06).                       00030000
000310             07  MIC-7113SECSVCCD-09                              00031000
000320                                 PIC X(06).                       00032000
000330             07  MIC-7113SECSVCCD-10                              00033000
000340                                 PIC X(06).                       00034000
000350             07  FILLER          PIC X(04).                       00035000
000360             07  MIC-7113SEQ01   PIC X(08).                       00036000
000370         05 MIC-7113CARD02                                        00037000
000380                         REDEFINES MIC-7113CARD00.                00038000
000390             07  MIC-7113SECSVCCD-11                              00039000
000400                                 PIC X(06).                       00040000
000410             07  MIC-7113SECSVCCD-12                              00041000
000420                                 PIC X(06).                       00042000
000430             07  MIC-7113SECSVCCD-13                              00043000
000440                                 PIC X(06).                       00044000
000450             07  MIC-7113SECSVCCD-14                              00045000
000460                                 PIC X(06).                       00046000
000470             07  MIC-7113SECSVCCD-15                              00047000
000480                                 PIC X(06).                       00048000
000490             07  MIC-7113SECSVCCD-16                              00049000
000500                                 PIC X(06).                       00050000
000510             07  MIC-7113SECSVCCD-17                              00051000
000520                                 PIC X(06).                       00052000
000530             07  MIC-7113SECSVCCD-18                              00053000
000540                                 PIC X(06).                       00054000
000550             07  MIC-7113SECSVCCD-19                              00055000
000560                                 PIC X(06).                       00056000
000570             07  MIC-7113SECSVCCD-20                              00057000
000580                                 PIC X(06).                       00058000
000590             07  FILLER          PIC X(04).                       00059000
000600             07  MIC-7113SEQ02   PIC X(08).                       00060000
000610*----------------------------------------------------------------*00061000
000620*            END OF MICM 7113 CARD DESCRIPTION                   *00062000
000630*----------------------------------------------------------------*00063000
