000010******************************************************************00001000
000020* MIS7108  SECONDARY SERVICE                               (M08) *00002000
000030******************************************************************00003000
000040*01  MI7108-RECORD.                                              *00004000
000050     03  MIM-7108GRP-KEY.                                         00005000
000060         05  MIM-7108KINST       PIC 9(04).                       00006000
000070         05  MIM-7108KREC        PIC 9(04).                       00007000
000080         05  MIM-7108KSECSVC     PIC X(06).                       00008000
000090*---------------------------------------------------------------* 00009000
000100     03  MIM-7108AUDIT-STAMP.                                     00010000
000110         05  MIM-7108UPD-DATE    PIC S9(09)      COMP-3.          00011000
000120         05  MIM-7108UPD-TIME    PIC S9(09)      COMP-3.          00012000
000130         05  MIM-7108UPD-USER    PIC X(08).                       00013000
000140         05  MIM-7108UPD-ORG     PIC X(06).                       00014000
000150*---------------------------------------------------------------* 00015000
000160     03  MIM-REC7108.                                             00016000
000170         05  MIM-7108DESC        PIC X(30).                       00017000
000180*----------------------------------------------------------------*00018000
000190*            END OF MICM 7108 RECORD DESCRIPTION                 *00019000
000200*----------------------------------------------------------------*00020000
