000010******************************************************************00001000
000020* MIS7106F - CARD LAYOUT (FORM 7106)                             *00002000
000030******************************************************************00003000
000040     03  MI7106C-RECORD.                                          00004000
000050         05  MIC-7106SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7106FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7106CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7106CARD00.                                      00008000
000090             07  MIC-7106INST    PIC 9(04).                       00009000
000100             07  MIC-7106CATGRY  PIC X(06).                       00010000
000110             07  FILLER          PIC X(54).                       00011000
000120             07  MIC-7106SEQ00   PIC X(08).                       00012000
000130         05 MIC-7106CARD01                                        00013000
000140                         REDEFINES MIC-7106CARD00.                00014000
000150             07  MIC-7106DESC    PIC X(20).                       00015000
000160             07  MIC-7106BALCD   PIC 9(02).                       00016000
000170             07  MIC-7106BALREQ-E                                 00017000
000180                                 PIC 9(09)V99.                    00018000
000190             07  MIC-7106BALREQ-I                                 00019000
000200                                 PIC 9(09)V99.                    00020000
000210             07  FILLER          PIC X(20).                       00021000
000220             07  MIC-7106SEQ01   PIC X(08).                       00022000
000230*----------------------------------------------------------------*00023000
000240*            END OF MICM 7106 CARD DESCRIPTION                   *00024000
000250*----------------------------------------------------------------*00025000
