000010******************************************************************00001000
000020* MIS7104F - CARD LAYOUT (FORM 7104)                             *00002000
000030******************************************************************00003000
000040     03  MI7104C-RECORD.                                          00004000
000050         05  MIC-7104SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7104FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7104CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7104CARD00.                                      00008000
000090             07  MIC-7104INST    PIC 9(04).                       00009000
000100             07  MIC-7104TABLE   PIC X(06).                       00010000
000110             07  FILLER          PIC X(54).                       00011000
000120             07  MIC-7104SEQ00   PIC X(08).                       00012000
000130         05 MIC-7104CARD01                                        00013000
000140                         REDEFINES MIC-7104CARD00.                00014000
000150             07  MIC-7104OPT     PIC X(01).                       00015000
000160             07  MIC-7104RLSP-1  PIC 9(02).                       00016000
000170             07  MIC-7104RLSP-2  PIC 9(02).                       00017000
000180             07  MIC-7104RLSP-3  PIC 9(02).                       00018000
000190             07  MIC-7104RLSP-4  PIC 9(02).                       00019000
000200             07  MIC-7104RLSP-5  PIC 9(02).                       00020000
000210             07  MIC-7104RLSP-6  PIC 9(02).                       00021000
000220             07  MIC-7104RLSP-7  PIC 9(02).                       00022000
000230             07  MIC-7104RLSP-8  PIC 9(02).                       00023000
000240             07  MIC-7104RLSP-9  PIC 9(02).                       00024000
000250             07  MIC-7104RLSP-10 PIC 9(02).                       00025000
000260             07  MIC-7104RLSP-11 PIC 9(02).                       00026000
000270             07  MIC-7104RLSP-12 PIC 9(02).                       00027000
000280             07  MIC-7104RLSP-13 PIC 9(02).                       00028000
000290             07  MIC-7104RLSP-14 PIC 9(02).                       00029000
000300             07  MIC-7104RLSP-15 PIC 9(02).                       00030000
000310             07  MIC-7104RLSP-16 PIC 9(02).                       00031000
000320             07  MIC-7104RLSP-17 PIC 9(02).                       00032000
000330             07  MIC-7104RLSP-18 PIC 9(02).                       00033000
000340             07  MIC-7104RLSP-19 PIC 9(02).                       00034000
000350             07  MIC-7104RLSP-20 PIC 9(02).                       00035000
000360             07  MIC-7104RLSP-21 PIC 9(02).                       00036000
000370             07  MIC-7104RLSP-22 PIC 9(02).                       00037000
000380             07  MIC-7104RLSP-23 PIC 9(02).                       00038000
000390             07  MIC-7104RLSP-24 PIC 9(02).                       00039000
000400             07  MIC-7104RLSP-25 PIC 9(02).                       00040000
000410             07  MIC-7104RLSP-26 PIC 9(02).                       00041000
000420             07  MIC-7104RLSP-27 PIC 9(02).                       00042000
000430             07  MIC-7104RLSP-28 PIC 9(02).                       00043000
000440             07  MIC-7104RLSP-29 PIC 9(02).                       00044000
000450             07  MIC-7104RLSP-30 PIC 9(02).                       00045000
000460             07  FILLER          PIC X(03).                       00046000
000470             07  MIC-7104SEQ01   PIC X(08).                       00047000
000480         05 MIC-7104CARD02                                        00048000
000490                         REDEFINES MIC-7104CARD00.                00049000
000500             07  MIC-7104RLSP-31 PIC 9(02).                       00050000
000510             07  MIC-7104RLSP-32 PIC 9(02).                       00051000
000520             07  MIC-7104RLSP-33 PIC 9(02).                       00052000
000530             07  MIC-7104RLSP-34 PIC 9(02).                       00053000
000540             07  MIC-7104RLSP-35 PIC 9(02).                       00054000
000550             07  MIC-7104RLSP-36 PIC 9(02).                       00055000
000560             07  MIC-7104RLSP-37 PIC 9(02).                       00056000
000570             07  MIC-7104RLSP-38 PIC 9(02).                       00057000
000580             07  MIC-7104RLSP-39 PIC 9(02).                       00058000
000590             07  MIC-7104RLSP-40 PIC 9(02).                       00059000
000600             07  MIC-7104RLSP-41 PIC 9(02).                       00060000
000610             07  MIC-7104RLSP-42 PIC 9(02).                       00061000
000620             07  MIC-7104RLSP-43 PIC 9(02).                       00062000
000630             07  MIC-7104RLSP-44 PIC 9(02).                       00063000
000640             07  MIC-7104RLSP-45 PIC 9(02).                       00064000
000650             07  MIC-7104RLSP-46 PIC 9(02).                       00065000
000660             07  MIC-7104RLSP-47 PIC 9(02).                       00066000
000670             07  MIC-7104RLSP-48 PIC 9(02).                       00067000
000680             07  MIC-7104RLSP-49 PIC 9(02).                       00068000
000690             07  MIC-7104RLSP-50 PIC 9(02).                       00069000
000700             07  FILLER          PIC X(24).                       00070000
000710             07  MIC-7104SEQ02   PIC X(08).                       00071000
000720*----------------------------------------------------------------*00072000
000730*            END OF MICM 7104 CARD DESCRIPTION                   *00073000
000740*----------------------------------------------------------------*00074000
