000010******************************************************************00001000
000020* MIS7109F - CARD LAYOUT (FORM 7109)                             *00002000
000030******************************************************************00003000
000040     03  MI7109C-RECORD.                                          00004000
000050         05  MIC-7109SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7109FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7109CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7109CARD00.                                      00008000
000090             07  MIC-7109INST    PIC 9(04).                       00009000
000100             07  MIC-7109SCTABLE PIC X(06).                       00010000
000110             07  FILLER          PIC X(54).                       00011000
000120             07  MIC-7109SEQ00   PIC X(08).                       00012000
000130         05 MIC-7109CARD01                                        00013000
000140                         REDEFINES MIC-7109CARD00.                00014000
000150             07  MIC-7109OPT     PIC X(01).                       00015000
000160             07  MIC-7109AMTREQ-1                                 00016000
000170                                 PIC 9(09)V99.                    00017000
000180             07  MIC-7109DISCPCT-1                                00018000
000190                                 PIC V9(05).                      00019000
000200             07  MIC-7109DISCAMT-1                                00020000
000210                                 PIC 9(03)V99.                    00021000
000220             07  MIC-7109AMTREQ-2                                 00022000
000230                                 PIC 9(09)V99.                    00023000
000240             07  MIC-7109DISCPCT-2                                00024000
000250                                 PIC V9(05).                      00025000
000260             07  MIC-7109DISCAMT-2                                00026000
000270                                 PIC 9(03)V99.                    00027000
000280             07  MIC-7109AMTREQ-3                                 00028000
000290                                 PIC 9(09)V99.                    00029000
000300             07  MIC-7109DISCPCT-3                                00030000
000310                                 PIC V9(05).                      00031000
000320             07  MIC-7109DISCAMT-3                                00032000
000330                                 PIC 9(03)V99.                    00033000
000340             07  MIC-7109SEQ01   PIC X(08).                       00034000
000350         05 MIC-7109CARD02                                        00035000
000360                         REDEFINES MIC-7109CARD00.                00036000
000370             07  MIC-7109AMTREQ-4                                 00037000
000380                                 PIC 9(09)V99.                    00038000
000390             07  MIC-7109DISCPCT-4                                00039000
000400                                 PIC V9(05).                      00040000
000410             07  MIC-7109DISCAMT-4                                00041000
000420                                 PIC 9(03)V99.                    00042000
000430             07  MIC-7109AMTREQ-5                                 00043000
000440                                 PIC 9(09)V99.                    00044000
000450             07  MIC-7109DISCPCT-5                                00045000
000460                                 PIC V9(05).                      00046000
000470             07  MIC-7109DISCAMT-5                                00047000
000480                                 PIC 9(03)V99.                    00048000
000490             07  MIC-7109AMTREQ-6                                 00049000
000500                                 PIC 9(09)V99.                    00050000
000510             07  MIC-7109DISCPCT-6                                00051000
000520                                 PIC V9(05).                      00052000
000530             07  MIC-7109DISCAMT-6                                00053000
000540                                 PIC 9(03)V99.                    00054000
000550             07  FILLER          PIC X(01).                       00055000
000560             07  MIC-7109SEQ02   PIC X(08).                       00056000
000570         05 MIC-7109CARD03                                        00057000
000580                         REDEFINES MIC-7109CARD00.                00058000
000590             07  MIC-7109AMTREQ-7                                 00059000
000600                                 PIC 9(09)V99.                    00060000
000610             07  MIC-7109DISCPCT-7                                00061000
000620                                 PIC V9(05).                      00062000
000630             07  MIC-7109DISCAMT-7                                00063000
000640                                 PIC 9(03)V99.                    00064000
000650             07  MIC-7109AMTREQ-8                                 00065000
000660                                 PIC 9(09)V99.                    00066000
000670             07  MIC-7109DISCPCT-8                                00067000
000680                                 PIC V9(05).                      00068000
000690             07  MIC-7109DISCAMT-8                                00069000
000700                                 PIC 9(03)V99.                    00070000
000710             07  MIC-7109AMTREQ-9                                 00071000
000720                                 PIC 9(09)V99.                    00072000
000730             07  MIC-7109DISCPCT-9                                00073000
000740                                 PIC V9(05).                      00074000
000750             07  MIC-7109DISCAMT-9                                00075000
000760                                 PIC 9(03)V99.                    00076000
000770             07  FILLER          PIC X(01).                       00077000
000780             07  MIC-7109SEQ03   PIC X(08).                       00078000
000790         05 MIC-7109CARD04                                        00079000
000800                         REDEFINES MIC-7109CARD00.                00080000
000810             07  MIC-7109AMTREQ-10                                00081000
000820                                 PIC 9(09)V99.                    00082000
000830             07  MIC-7109DISCPCT-10                               00083000
000840                                 PIC V9(05).                      00084000
000850             07  MIC-7109DISCAMT-10                               00085000
000860                                 PIC 9(03)V99.                    00086000
000870             07  FILLER          PIC X(43).                       00087000
000880             07  MIC-7109SEQ04   PIC X(08).                       00088000
000890*----------------------------------------------------------------*00089000
000900*            END OF MICM 7109 CARD DESCRIPTION                   *00090000
000910*----------------------------------------------------------------*00091000
