000010*FORMAT-ACCOUNT-LEFTJUST SECTION.                                 00001000
000020 FAL-START.                                                       00002000
000030     MOVE 'Y' TO RPW033-LEADING.                                  00003000
000040     IF RPW033-ACCOUNT-NUM IS NOT NUMERIC                         00004000
000050         MOVE RPW033-ACCOUNT TO RPW033-FORMATTEDACCT              00005000
000060         GO TO FAL-LOADED.                                        00006000
000070     MOVE SPACES TO RPW033-FORMATTEDACCT.                         00007000
000080 FAL-ACCOUNT.                                                     00008000
000090     SUBTRACT RPW033-ACCTLN FROM +19 GIVING RPW033-SUB1.          00009000
000100     IF RPW033-SUB1 IS NOT GREATER THAN ZERO                      00010000
000110         MOVE +1 TO RPW033-SUB1.                                  00011000
000120     MOVE +1 TO RPW033-SUB2.                                      00012000
000130     MOVE +1 TO RPW033-SUB3.                                      00013000
000140 FAL-LOOP.                                                        00014000
000150     IF RPW033-SUB3 IS GREATER THAN +4                            00015000
000160         MOVE +4 TO RPW033-SUB3.                                  00016000
000170     MOVE RPW033-ACCTX (RPW033-SUB1)                              00017000
000180         TO RPW033-FACCTX (RPW033-SUB2).                          00018000
000190     IF RPW033-SUB1 IS EQUAL TO RPW033-AEED (RPW033-SUB3)         00019000
000200         ADD +1 TO RPW033-SUB2                                    00020000
000210         ADD +1 TO RPW033-SUB3                                    00021000
000220         MOVE '-' TO RPW033-FACCTX (RPW033-SUB2).                 00022000
000230     IF RPW033-SUB1 IS LESS THAN +18                              00023000
000240         ADD +1 TO RPW033-SUB1                                    00024000
000250         ADD +1 TO RPW033-SUB2                                    00025000
000260         GO TO FAL-LOOP.                                          00026000
000270 FAL-LOADED.                                                      00027000
000280     MOVE ZERO TO RPW033-SUB1.                                    00028000
000290     MOVE +1 TO RPW033-SUB2.                                      00029000
000300 FAL-COMPRESS.                                                    00030000
000310     IF RPW033-FACCTX (RPW033-SUB2) IS NOT EQUAL TO SPACE         00031000
000320         MOVE 'N' TO RPW033-LEADING.                              00032000
000330     IF RPW033-FACCTX (RPW033-SUB2) IS NOT EQUAL TO SPACE         00033000
000340         OR (RPW033-LEADING IS EQUAL TO 'N'                       00034000
000350         AND RPW033-FACCTX (RPW033-SUB2) IS EQUAL TO SPACE)       00035000
000360         ADD +1 TO RPW033-SUB1                                    00036000
000370         IF RPW033-SUB1 IS NOT EQUAL TO RPW033-SUB2               00037000
000380             MOVE RPW033-FACCTX (RPW033-SUB2)                     00038000
000390                 TO RPW033-FACCTX (RPW033-SUB1)                   00039000
000400             MOVE SPACE TO RPW033-FACCTX (RPW033-SUB2).           00040000
000410     IF RPW033-SUB2 IS LESS THAN +18                              00041000
000420         ADD +1 TO RPW033-SUB2                                    00042000
000430         GO TO FAL-COMPRESS.                                      00043000
000440     IF RPW033-SUB1 IS NOT GREATER THAN RPW033-WIDTH              00044000
000450         GO TO FAL-EXIT.                                          00045000
000460     IF RPW033-ACCTED IS NOT EQUAL TO ZERO                        00046000
000470         MOVE ZERO TO RPW033-ACCTED                               00047000
000480         GO TO FAL-START.                                         00048000
000490     MOVE RPW033-WIDTH TO RPW033-SUB1.                            00049000
000500     MOVE '-' TO RPW033-FACCTX (RPW033-SUB1).                     00050000
000510 FAL-CLEAR.                                                       00051000
000520     ADD +1 TO RPW033-SUB1.                                       00052000
000530     IF RPW033-SUB1 IS NOT GREATER THAN +18                       00053000
000540         MOVE SPACE TO RPW033-FACCTX (RPW033-SUB1)                00054000
000550         GO TO FAL-CLEAR.                                         00055000
000560 FAL-EXIT.                                                        00056000
000570     EXIT.                                                        00057000
