P0030 ******************************************************************00001000
P0030 * RPP005 - CALCULATE MIL SECONDS                                 *00001990
P0030 ******************************************************************00002980
P0030 *CALCULATE-MIL-SECONDS SECTION.                                   00003970
P0030  CMS-START.                                                       00004960
P0030      MOVE FUNCTION CURRENT-DATE TO WS-CURRENT-DATE-TIME.          00005950
P0030      COMPUTE WS-SEC-COMP = (WS-CURRENT-HH * 3600) +               00006940
P0030         (WS-CURRENT-MM * 60) +                                    00007930
P0030          WS-CURRENT-SS.                                           00008920
P0030      MOVE WS-CURRENT-DEC TO WS-SEC-COMP-DEC.                      00009910
P0030      MOVE WS-SEC-COMP TO WS-SEC-START.                            00010900
P0030      MOVE WS-SEC-COMP-DEC TO WS-IDNBR-DECSEC.                     00011890
P0030      MOVE 'N' TO WS-RPIDX-ERROR.                                  00012880
P0030      MOVE WS-RPIDX-INST TO RPIDX-INST.                            00013870
P0030      MOVE WS-RPMIM2023-RPS TO RPIDX-PRODCODE.                     00014860
P0030  CMS-RPIDX-RETRY.                                                 00015850
P0030      MOVE WS-IDNBR TO RPIDX-IDNUMBER.                             00016840
P0030      PERFORM RPS-IDX-GET-REQUEST.                                 00017830
P0030      IF WS-FUNCTION IS EQUAL TO 'N'                               00018820
P0030          GO TO CMS-EXIT.                                          00019810
P0030      IF WS-FUNCTION IS EQUAL TO SPACE                             00020800
P0030          AND WS-IDNBR-SEQ IS LESS THAN 99                         00021790
P0187          ADD +1 TO WS-IDNBR-SEQ                                   00022780
P0030          GO TO CMS-RPIDX-RETRY.                                   00023770
P0030      MOVE 'Y' TO WS-RPIDX-ERROR.                                  00024760
P0030  CMS-EXIT.                                                        00025750
P0030      EXIT.                                                        00026740
