P0023 ******************************************************************00001000
P0023 * THIS ROUTINE CAN BE CUSTOMIZED DEPENDING ON CUSTOMER.          *00001990
P0023 * CUSTOM CHANGES SHOULD START AFTER CI-START.                     00002980
P0023 ******************************************************************00003970
P0023 *CROSS-INSTITUTION SECTION.                                       00004960
P0023  CI-START.                                                        00005950
P0023      MOVE 'N' TO WS-RPP004-ERROR.                                 00006940
P0023      MOVE SPACES TO WS-ACCESS-FILEOPTS.                           00007930
P0023  CI-PROCESS.                                                      00008920
P0023      MOVE SPACES TO SLS140-MSGNBRG.                               00009910
P0023      MOVE SPACES TO SLS140-ABMSG.                                 00010900
P0023      MOVE 'X' TO SLS140-SECURITY-FUNC.                            00011890
P0023      MOVE WS-ACCESS-PRIM-INST TO SLS140-INST.                     00012880
P0023      MOVE WS-ACCESS-ALT-INST TO SLS140-INST2.                     00013870
P0023      MOVE WS-ACCESS-OPERID TO SLS140-OPERID.                      00014860
P0023      MOVE WS-ACCESS-PROFILE TO SLS140-PROFILE.                    00015850
P0023      MOVE WS-ACCESS-EXTERNALID TO SLS140-EXTERNALID.              00016840
P0023      EXEC CICS LINK                                               00017830
P0023          PROGRAM('SSL140')                                        00018820
P0023          COMMAREA(SLS140-RECORD)                                  00019810
P0023          LENGTH(LENGTH OF SLS140-RECORD)                          00020800
P0023          NOHANDLE                                                 00021790
P0023          END-EXEC.                                                00022780
P0023      IF EIBRESP IS NOT EQUAL TO DFHRESP(NORMAL)                   00023770
P0023          OR SLS140-SECURITY-FUNC IS NOT EQUAL TO 'G'              00024760
P0023          MOVE 'Y' TO WS-RPP004-ERROR                              00025750
P0023          GO TO CI-EXIT.                                           00026740
P0023      MOVE SLS140-FILEOPTS2 TO WS-ACCESS-FILEOPTS.                 00027730
P0023  CI-EXIT.                                                         00028720
P0023      EXIT.                                                        00029710
