000010******************************************************************00001000
000020* RPP007   VALIDATE PRIMARY ACCOUNT RELATIONSHIP CODE            *00002000
000030******************************************************************00003000
000040*VALIDATE-PRIM-RELCD.                                             00004000
000050 VPC-START.                                                       00005000
000060     MOVE 'N' TO WS-PRIMRELCD-ERROR.                              00006000
000070     MOVE 'N' TO WS-CUSTRELCD-SKIP.                               00007000
000080     MOVE 'Y' TO WS-PRIMRELCD-SKIP.                               00008000
000090     IF MIM-7101PRIMRELCD-Q IS NOT EQUAL TO 'B'                   00009000
000100         AND MIM-7101PRIMRELCD-Q IS NOT EQUAL TO 'E'              00010000
000110         GO TO VPC-EXIT.                                          00011000
000120     IF MIM-7101PRIMRELCD IS EQUAL TO SPACES                      00012000
000130         GO TO VPC-EXIT.                                          00013000
000140     MOVE MIM-7101PRIMRELCD TO WS-RPMIM7104RPREC.                 00014000
000150     PERFORM SEARCH-RPS-7104.                                     00015000
000160     IF WS-RPMIM7104FOUND IS EQUAL TO 'N'                         00016000
000170         GO TO VPC-EXIT.                                          00017000
000180     MOVE 'Y' TO WS-CUSTRELCD-SKIP.                               00018000
000190     MOVE 'N' TO WS-PRIMRELCD-SKIP.                               00019000
000200     MOVE 'N' TO WS-INCLUDEREL.                                   00020000
000210     IF MIM-7104OPT IS EQUAL TO 'I'                               00021000
000220         MOVE 'Y' TO WS-INCLUDEREL.                               00022000
000230     INITIALIZE WS-RELCODETABLE.                                  00023000
000240     MOVE ZEROS TO WS-RPW007-SUB.                                 00024000
000250     IF MIM-7104OPT IS EQUAL TO 'I'                               00025000
000260         GO TO VPC-PRIMRELCDI.                                    00026000
000270 VPC-PRIMRELCDE.                                                  00027000
000280     ADD +1 TO WS-RPW007-SUB.                                     00028000
000290     IF WS-RPW007-SUB IS GREATER THAN 50                          00029000
000300        GO TO VPC-EXIT.                                           00030000
000310     IF MIM-7104RLSP (WS-RPW007-SUB)                              00031000
000320         IS EQUAL TO WS-RPW007-RELNBR                             00032000
000330         MOVE 'Y' TO WS-PRIMRELCD-ERROR                           00033000
000340         GO TO VPC-EXIT.                                          00034000
000350     IF MIM-7104RLSP (WS-RPW007-SUB) IS EQUAL TO ZEROS            00035000
000360         GO TO VPC-EXIT.                                          00036000
000370     GO TO VPC-PRIMRELCDE.                                        00037000
000380 VPC-PRIMRELCDI.                                                  00038000
000390     ADD +1 TO WS-RPW007-SUB.                                     00039000
000400     IF WS-RPW007-SUB IS GREATER THAN 50                          00040000
000410         MOVE 'Y' TO WS-PRIMRELCD-ERROR                           00041000
000420         GO TO VPC-EXIT.                                          00042000
000430     IF MIM-7104RLSP (WS-RPW007-SUB)                              00043000
000440         IS EQUAL TO WS-RPW007-RELNBR                             00044000
000450         GO TO VPC-EXIT.                                          00045000
000460     IF MIM-7104RLSP (WS-RPW007-SUB) IS EQUAL TO ZEROS            00046000
000470         MOVE 'Y' TO WS-PRIMRELCD-ERROR                           00047000
000480         GO TO VPC-EXIT.                                          00048000
000490     GO TO VPC-PRIMRELCDI.                                        00049000
000500 VPC-EXIT.                                                        00050000
000510     EXIT.                                                        00051000
000520*----------------------------------------------------------------*00052000
000530*    END VALIDATE PRIMARY ACCOUNT RELATIONSHIP CODE SECTION      *00053000
000540*----------------------------------------------------------------*00054000
