000010******************************************************************00001000
000020* RPP006   VALIDATE PRIMARY ACCOUNT RELATIONSHIP CODE            *00002000
000030******************************************************************00003000
000040*VALIDATE-PRIM-RELCD.                                             00004000
000050 VPC-START.                                                       00005000
000060     MOVE 'N' TO WS-PRIMRELCD-VALID.                              00006000
000070     MOVE 'N' TO WS-PRIMRELCD-FOUND.                              00007000
000080     MOVE 'N' TO WS-PRIMRELCD-ERROR.                              00008000
000090     MOVE 'N' TO WS-CUSTRELCD-SKIP.                               00009000
000100     IF MIM-7101PRIMRELCD-Q IS NOT EQUAL TO 'B'                   00010000
000110         AND MIM-7101PRIMRELCD-Q IS NOT EQUAL TO 'E'              00011000
000120         GO TO VPC-INIT-SECACCTS.                                 00012000
000130     IF MIM-7101PRIMRELCD IS EQUAL TO SPACES                      00013000
000140         GO TO VPC-INIT-SECACCTS.                                 00014000
000150     MOVE MIM-7101PRIMRELCD TO WS-RPMIM7104RPREC.                 00015000
000160     PERFORM SEARCH-RPS-7104.                                     00016000
000170     IF WS-RPMIM7104FOUND IS EQUAL TO 'N'                         00017000
000180         GO TO VPC-INIT-SECACCTS.                                 00018000
000190     MOVE 'Y' TO WS-CUSTRELCD-SKIP.                               00019000
000200     MOVE 'N' TO WS-INCLUDEREL.                                   00020000
000210     IF MIM-7104OPT IS EQUAL TO 'I'                               00021000
000220         MOVE 'Y' TO WS-INCLUDEREL.                               00022000
000230     INITIALIZE WS-RELCODETABLE.                                  00023000
000240     MOVE MIM-REC7104-DATA TO WS-RELCODETABLE.                    00024000
000250     MOVE ZEROS TO WS-SUBSEC1.                                    00025000
000260 VPC-SECACCT-LOOP.                                                00026000
000270     ADD +1 TO WS-SUBSEC1.                                        00027000
000280     IF WS-SUBSEC1 IS GREATER THAN WS-SECONDARY-MAX               00028000
000290         GO TO VPC-END.                                           00029000
000300     IF WS-SEC-ACCT (WS-SUBSEC1) IS EQUAL TO SPACES               00030000
000310         GO TO VPC-END.                                           00031000
000320     MOVE RPRF21-REL TO WS-SEC-PRIMCUSTRELNBR (1).                00032000
000330     IF WS-SEC-PRIMCUSTRELNBR (WS-SUBSEC1) IS EQUAL TO ZEROS      00033000
000340         AND WS-PRIMRELCD-VALID IS EQUAL TO 'N'                   00034000
000350         MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC1)                     00035000
000360         GO TO VPC-SECACCT-LOOP.                                  00036000
000370     IF WS-SEC-PRIMCUSTRELNBR (WS-SUBSEC1) IS EQUAL TO ZEROS      00037000
000380         AND WS-PRIMRELCD-VALID IS EQUAL TO 'Y'                   00038000
P0093          AND WS-SEC-SKIP (WS-SUBSEC1) IS NOT EQUAL TO 'Y'         00038300
P0093          MOVE SPACES TO WS-SEC-QUAL (WS-SUBSEC1)                  00038600
000390         GO TO VPC-SECACCT-LOOP.                                  00039000
000400     IF WS-SUB1 IS GREATER THAN +1                                00040000
000410         AND WS-PRIMRELCD-OPTION IS EQUAL TO 01                   00041000
000420         GO TO VPC-END.                                           00042000
000430     MOVE 'N' TO WS-PRIMRELCD-VALID.                              00043000
000440     MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC1).                        00044000
000450     MOVE ZEROS TO WS-RPW006-SUB.                                 00045000
000460     IF MIM-7104OPT IS EQUAL TO 'I'                               00046000
000470         GO TO VPC-PRIMRELCDI.                                    00047000
000480 VPC-PRIMRELCDE.                                                  00048000
000490     ADD +1 TO WS-RPW006-SUB.                                     00049000
000500     IF WS-RPW006-SUB IS GREATER THAN 50                          00050000
000510        GO TO VPC-PRIMRELCD-VALID.                                00051000
000520     IF MIM-7104RLSP (WS-RPW006-SUB) IS EQUAL TO ZEROS            00052000
000530         GO TO VPC-PRIMRELCD-VALID.                               00053000
000540     IF MIM-7104RLSP (WS-RPW006-SUB)                              00054000
000550         IS NOT EQUAL TO WS-SEC-RELNBR (WS-SUBSEC1)               00055000
000560         GO TO VPC-PRIMRELCDE.                                    00056000
000570     GO TO VPC-SECACCT-LOOP.                                      00057000
000580 VPC-PRIMRELCDI.                                                  00058000
000590     ADD +1 TO WS-RPW006-SUB.                                     00059000
000600     IF WS-RPW006-SUB IS GREATER THAN 50                          00060000
000610         GO TO VPC-SECACCT-LOOP.                                  00061000
000620     IF MIM-7104RLSP (WS-RPW006-SUB) IS EQUAL TO ZEROS            00062000
000630         GO TO VPC-SECACCT-LOOP.                                  00063000
000640     IF MIM-7104RLSP (WS-RPW006-SUB)                              00064000
000650         IS EQUAL TO WS-SEC-RELNBR (WS-SUBSEC1)                   00065000
000660         GO TO VPC-PRIMRELCD-VALID.                               00066000
000670     GO TO VPC-PRIMRELCDI.                                        00067000
000680 VPC-PRIMRELCD-VALID.                                             00068000
000690     MOVE 'Y' TO WS-PRIMRELCD-FOUND.                              00069000
000700     MOVE 'Y' TO WS-PRIMRELCD-VALID.                              00070000
000710     GO TO VPC-SECACCT-LOOP.                                      00071000
000720 VPC-INIT-SECACCTS.                                               00072000
000730     MOVE WS-PRIMCUSTACCT-END TO WS-SUBSEC1.                      00073000
000740 VPC-INIT-SECACCTS-LOOP.                                          00074000
000750     ADD +1 TO WS-SUBSEC1.                                        00075000
000760     IF WS-SUBSEC1 IS GREATER THAN WS-SECONDARY-MAX               00076000
000770         GO TO VPC-EXIT.                                          00077000
P0185      IF WS-SEC-ACCT (WS-SUBSEC1) IS EQUAL TO SPACES               00078000
000790         GO TO VPC-EXIT.                                          00079000
000800     MOVE 'N' TO WS-SEC-QUAL (WS-SUBSEC1).                        00080000
000810     GO TO VPC-INIT-SECACCTS-LOOP.                                00081000
000820 VPC-END.                                                         00082000
000830     IF WS-PRIMRELCD-FOUND IS EQUAL TO 'Y'                        00083000
000840         GO TO VPC-EXIT.                                          00084000
000850 VPC-PRIMRELCD-ERROR.                                             00085000
000860     MOVE 'Y' TO WS-PRIMRELCD-ERROR.                              00086000
000870 VPC-EXIT.                                                        00087000
000880     EXIT.                                                        00088000
000890*----------------------------------------------------------------*00089000
000900*    END VALIDATE PRIMARY ACCOUNT RELATIONSHIP CODE SECTION      *00090000
000910*----------------------------------------------------------------*00091000
