P0040 ******************************************************************00001000
P0040 * RPP005 - CALCULATE MIL SECONDS                                 *00001990
P0040 ******************************************************************00002980
P0040 *CALCULATE-MIL-SECONDS SECTION.                                   00003970
P0040  CMS-START.                                                       00004960
P0040      MOVE FUNCTION CURRENT-DATE TO WS-CURRENT-DATE-TIME.          00005950
P0040      COMPUTE WS-SEC-COMP = (WS-CURRENT-HH * 3600) +               00006940
P0040         (WS-CURRENT-MM * 60) +                                    00007930
P0040          WS-CURRENT-SS.                                           00008920
P0040      MOVE WS-CURRENT-DEC TO WS-SEC-COMP-DEC.                      00009910
P0040      MOVE WS-SEC-COMP TO WS-SEC-START.                            00010900
P0040      MOVE WS-SEC-COMP-DEC TO WS-IDNBR-DECSEC.                     00011890
P0040      MOVE 'N' TO WS-RPIDX-ERROR.                                  00012880
P0040      MOVE WS-RPIDX-INST TO RPIDX-INST.                            00013870
P0040      MOVE WS-RPMIM2023-RPS TO RPIDX-PRODCODE.                     00014860
P0040  CMS-RPIDX-RETRY.                                                 00015850
P0040      MOVE WS-IDNBR TO RPIDX-IDNUMBER.                             00016840
P0040      MOVE 'R  ' TO SR-APIFUNC.                                    00017830
P0040      PERFORM CALL-RPS-IDX.                                        00018820
P0040      IF WS-FUNCTION IS EQUAL TO 'N'                               00019810
P0040          GO TO CMS-EXIT.                                          00020800
P0040      IF WS-FUNCTION IS EQUAL TO SPACE                             00021790
P0040          AND WS-IDNBR-SEQ IS LESS THAN 99                         00022780
P0188          ADD +1 TO WS-IDNBR-SEQ                                   00023770
P0040          GO TO CMS-RPIDX-RETRY.                                   00024760
P0040      MOVE 'Y' TO WS-RPIDX-ERROR.                                  00025750
P0040  CMS-EXIT.                                                        00026740
P0040      EXIT.                                                        00027730
