000010******************************************************************00001000
000020* RPP136   GET SECONDARY ACCOUNT - BATCH                         *00002000
000030******************************************************************00003000
000040*GET-MY-SECONDARY-ACCOUNTS SECTION.                               00004000
000050*   THE PURPOSE OF THIS SECTION IS TO FIND THE ACCOUNTS           00005000
000060*   BELONGING TO SECONDARY CUSTOMERS OF THE PRIMARY ACCOUNT       00006000
000070*   AND ADD THESE ADDITIONAL ACCOUNTS TO THE TABLE                00007000
000080*   OF ACCOUNTS FROM THE PRIMARY CUSTOMER                         00008000
000090 GM-START.                                                        00009000
P0104      MOVE SPACES TO WS-FUNCTION.                                  00009200
P0104      MOVE SPACES TO WS-LAST-PRODCD.                               00009400
P0104      MOVE SPACES TO WS-RPMIM2023PRODCD.                           00009600
000100     MOVE 'Y' TO WS-RELCHECK.                                     00010000
000110     MOVE 'N' TO WS-SECCUSTOVERFLOW.                              00011000
P0104      IF MIM-7101PRIMRELCD-Q IS NOT EQUAL TO 'B'                   00012000
P0104         AND MIM-7101PRIMRELCD-Q IS NOT EQUAL TO 'E'               00012090
P0104         MOVE 'N' TO WS-RELCHECK                                   00012180
P0104         GO TO GM-START2.                                          00012270
P0104      MOVE MIM-7101PRIMRELCD TO WS-RPMIM7104RPREC.                 00012360
000130     IF WS-RPMIM7104RPREC IS EQUAL TO SPACES                      00013000
000140         MOVE 'N' TO WS-RELCHECK                                  00014000
000150         GO TO GM-START2.                                         00015000
000200     PERFORM SEARCH-RPS-7104.                                     00020000
000210     IF WS-RPMIM7104FOUND IS EQUAL TO 'N'                         00021000
000220         MOVE 'N' TO WS-RELCHECK                                  00022000
000230         GO TO GM-START2.                                         00023000
000240     MOVE 'N' TO WS-INCLUDEREL.                                   00024000
000250     IF MIM-7104OPT IS EQUAL TO 'I'                               00025000
000260         MOVE 'Y' TO WS-INCLUDEREL.                               00026000
000270     INITIALIZE WS-RELCODETABLE.                                  00027000
000280     MOVE MIM-REC7104-DATA TO WS-RELCODETABLE.                    00028000
000290 GM-START2.                                                       00029000
000300     IF WS-RELCHECK IS EQUAL TO 'N'                               00030000
000310         GO TO GM-END.                                            00031000
000320*    MOVE WS-NUMOFACCOUNTS TO WS-PRIMCUSTACCTS.                   00032000
000330     MOVE ZERO TO WS-SECTABLE.                                    00033000
000340     MOVE SPACES TO WS-FUNCTION.                                  00034000
000350     MOVE RPMST-INST TO RPRF21-BASE-ACCT-INST.                    00035000
000360     MOVE WS-PRIM-PRODCD TO RPRF21-BASE-ACCT-PRODCODE.            00036000
000370     MOVE WS-PRIM-ACCT TO RPRF21-BASE-ACCT.                       00037000
000380     MOVE SPACES TO RPRF21-BASE-CUSTOMER.                         00038000
000390     INITIALIZE WS-NEXTACC.                                       00039000
000400     MOVE SPACE TO RPRF21-RETURN.                                 00040000
000410 GM-SEC-AGAIN.                                                    00041000
000420     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          00042000
000430     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00043000
000440         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00044000
000450         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00045000
000460     MOVE 'X' TO RPRF21-FUNC.                                     00046000
000470     CALL SR-060CALLNAME USING                                    00047000
000480         WS-LINKRCIF.                                             00048000
000490     MOVE 'N' TO WS-MORE-SECONDARYCUST.                           00049000
000500     IF RPRF21-RETURN IS EQUAL TO 'M'                             00050000
000510         MOVE 'Y' TO WS-MORE-SECONDARYCUST                        00051000
000520         MOVE SPACE TO RPRF21-RETURN.                             00052000
000530     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     00053000
000540         GO TO GM-END.                                            00054000
000550*  HERE I HAVE THE GROUP OF SECONDARY CUSTOMERS                   00055000
000560     MOVE RPRF21-RETURNED-OBJECT TO WS-ACC-TABLE.                 00056000
000570     MOVE +1 TO WS-SECCUSTSUB.                                    00057000
000580 GM-LOAD-SECONDARY.                                               00058000
000590     IF WS-SECCUSTSUB IS GREATER THAN WS-ACC-MAX                  00059000
000600         AND WS-MORE-SECONDARYCUST IS EQUAL TO 'Y'                00060000
000610         MOVE WS-ACC-CUST (WS-ACC-MAX) TO RPRF21-BASE-CUST        00061000
000620         MOVE WS-ACC-CUST-TYPE (WS-ACC-MAX)                       00062000
000630             TO RPRF21-BASE-CUST-TYPE                             00063000
000640         MOVE RPMST-INST TO RPRF21-BASE-ACCT-INST                 00064000
000650         MOVE WS-PRIM-PRODCD TO RPRF21-BASE-ACCT-PRODCODE         00065000
000660         MOVE WS-PRIM-ACCT TO RPRF21-BASE-ACCT                    00066000
000670         MOVE WS-ACC-INST (WS-ACC-MAX) TO WS-NEXTCINST            00067000
000680         MOVE WS-ACC-CUST-TYPE (WS-ACC-MAX) TO WS-NEXTCTYPE       00068000
000690         MOVE WS-ACC-CUST (WS-ACC-MAX) TO WS-NEXTCCUST            00069000
000700         MOVE WS-ACC-PRIM (WS-ACC-MAX) TO WS-NEXTPRIM             00070000
000710         MOVE WS-ACC-RELNBR (WS-ACC-MAX) TO WS-NEXTRELN           00071000
000720         MOVE 'M' TO RPRF21-RETURN                                00072000
000730         MOVE WS-NEXTACC TO RPRF21-RETURNED-OBJECT                00073000
000740         GO TO GM-SEC-AGAIN.                                      00074000
000750     IF WS-SECCUSTSUB IS GREATER THAN WS-ACC-MAX                  00075000
000760         AND WS-MORE-SECONDARYCUST IS EQUAL TO 'N'                00076000
000770         GO TO GM-MORE-ACCTS.                                     00077000
000780     IF WS-ACC-CUST (WS-SECCUSTSUB) IS EQUAL TO SPACES            00078000
000790         AND WS-ACC-INST (WS-SECCUSTSUB) IS EQUAL TO ZEROS        00079000
000800         GO TO GM-MORE-ACCTS.                                     00080000
000810* ** EXCLUDE PRIMARY CUSTOMER                                     00081000
000820     IF WS-ACC-PRIM (WS-SECCUSTSUB) IS EQUAL TO ZERO              00082000
000830         ADD +1 TO WS-SECCUSTSUB                                  00083000
000840         GO TO GM-LOAD-SECONDARY.                                 00084000
000850* ** CHECK FOR ADJUSTMENT BY RELATE CODE                          00085000
000860     IF WS-RELCHECK IS NOT EQUAL TO 'Y'                           00086000
000870         GO TO GM-LOAD-SEC-CUST.                                  00087000
000880     MOVE WS-ACC-RELNBR (WS-SECCUSTSUB) TO WS-VALIDREL.           00088000
000890     PERFORM GM-CHECKFORRELNBR.                                   00089000
000900     IF WS-BADRELNBR IS EQUAL TO 'Y'                              00090000
000910         ADD +1 TO WS-SECCUSTSUB                                  00091000
000920         GO TO GM-LOAD-SECONDARY.                                 00092000
000930 GM-LOAD-SEC-CUST.                                                00093000
000940     ADD +1 TO WS-SECTABLE.                                       00094000
000950     IF WS-SECTABLE IS GREATER THAN WS-SECCUSTMAX                 00095000
000960         MOVE 'Y' TO WS-SECCUSTOVERFLOW                           00096000
000970         GO TO GM-MORE-ACCTS.                                     00097000
000980     MOVE WS-ACC-INST (WS-SECCUSTSUB)                             00098000
000990         TO WS-SECUST-INST (WS-SECTABLE).                         00099000
001000     MOVE WS-ACC-CUST-TYPE (WS-SECCUSTSUB)                        00100000
001010         TO WS-SECUST-CUST-TYPE (WS-SECTABLE).                    00101000
001020     MOVE WS-ACC-CUST (WS-SECCUSTSUB)                             00102000
001030         TO WS-SECUST-CUST (WS-SECTABLE).                         00103000
001040     MOVE WS-ACC-PRIM (WS-SECCUSTSUB)                             00104000
001050         TO WS-SECUST-PRIM (WS-SECTABLE).                         00105000
001060     ADD 1 TO WS-SECCUSTSUB.                                      00106000
001070     ADD 1 TO WS-NUMOFSECCUSTS.                                   00107000
001080     GO TO GM-LOAD-SECONDARY.                                     00108000
001090 GM-MORE-ACCTS.                                                   00109000
001100     MOVE ZERO TO WS-SECCUSTSUB.                                  00110000
001110 GM-FIND-SEC-ACCTS.                                               00111000
001120     ADD 1 TO WS-SECCUSTSUB.                                      00112000
001130     IF WS-SECCUSTSUB IS GREATER THAN WS-SECTABLE                 00113000
001140         GO TO GM-END.                                            00114000
001150     IF WS-SECCUSTSUB IS GREATER THAN WS-SECCUSTMAX               00115000
001160         GO TO GM-END.                                            00116000
001170* ** MAXIMUM 1000 ACCOUNTS FROM ALL CUSTOMERS                     00117000
001180     MOVE RPMST-INST TO RPRF21-BASE-ACCT-INST.                    00118000
001190     MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE.                    00119000
001200     MOVE ZEROS TO RPRF21-BASE-ACCT.                              00120000
001210     MOVE WS-SECUST-INST (WS-SECCUSTSUB)                          00121000
001220         TO RPRF21-BASE-CUST-INST.                                00122000
001230     MOVE WS-SECUST-CUST-TYPE (WS-SECCUSTSUB)                     00123000
001240         TO RPRF21-BASE-CUST-TYPE.                                00124000
001250     MOVE WS-SECUST-CUST (WS-SECCUSTSUB)                          00125000
001260         TO RPRF21-BASE-CUST.                                     00126000
001270 GM-MORE-SECONDARY-ACCTS.                                         00127000
001280     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00128000
001290         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00129000
001300         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00130000
001310     MOVE 'N' TO RPRF21-FUNC.                                     00131000
001320     CALL SR-060CALLNAME USING                                    00132000
001330         WS-LINKRCIF.                                             00133000
001340     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     00134000
P0104          MOVE RPRF21-FUNCTION TO WS-FUNCTION                      00135000
001360         GO TO GM-FIND-SEC-ACCTS.                                 00136000
001370* ** A BAD RETURN CODE FROM GET ACCOUNTS GO TO NEXT CUSTOMER      00137000
001380     MOVE RPRF21-RETURNED-OBJECT TO WS-CAC-TABLE.                 00138000
001390     MOVE ZEROS TO WS-SUB3.                                       00139000
001400 GM-CHECK-PRODCODE.                                               00140000
001410     ADD +1 TO WS-SUB3.                                           00141000
001420     IF WS-SUB3 IS GREATER THAN WS-CAC-MAX                        00142000
001430         GO TO GM-CHECK-MORE-SEC.                                 00143000
001440     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO SPACES                00144000
001450         GO TO GM-CHECK-MORE-SEC.                                 00145000
001460     IF WS-CAC-ACCT (WS-SUB3) IS EQUAL TO SPACES                  00146000
001470         GO TO GM-CHECK-MORE-SEC.                                 00147000
001480     MOVE WS-CAC-INST (WS-SUB3) TO WS-SUBINST.                    00148000
001490     IF WS-2024-EXISTS (WS-SUBINST) IS NOT EQUAL TO 'Y'           00149000
001500         GO TO GM-CHECK-PRODCODE.                                 00150000
001510     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-LAST-PRODCD        00151000
001520         GO TO GM-VALID-SECACCT.                                  00152000
001530     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-RPMIM2023PRODCD    00153000
001540         GO TO GM-CHECK-PRODCODE.                                 00154000
001550     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-RPMIM2023PRODCD.          00155000
001560     PERFORM SEARCH-RPS-2023.                                     00156000
001570     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         00157000
001580         GO TO GM-CHECK-PRODCODE.                                 00158000
001590     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-LAST-PRODCD.              00159000
001600 GM-VALID-SECACCT.                                                00160000
001610     MOVE WS-CAC-INST (WS-SUB3) TO WS-DUPINST.                    00161000
001620     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-DUPPRODCD.                00162000
001630     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-DUPACCOUNT.                 00163000
001640     MOVE 'N' TO WS-DUPSECACCT.                                   00164000
P0104      IF (MIM-7101CUSTRELCD-Q IS EQUAL TO 'B'                      00164200
P0104          OR MIM-7101CUSTRELCD-Q IS EQUAL TO 'E')                  00164400
P0104          AND MIM-7101CUSTRELCD IS NOT EQUAL TO SPACES             00164600
P0104          GO TO GM-VALID-ADD.                                      00164800
001650     PERFORM GM-CHECKFORDUP.                                      00165000
001660     IF WS-DUPSECACCT IS EQUAL TO 'Y'                             00166000
001670         GO TO GM-CHECK-PRODCODE.                                 00167000
001680 GM-VALID-ADD.                                                    00168000
001690     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO RPMST-PRODCODE        00169000
001700         AND WS-CAC-ACCT (WS-SUB3) IS EQUAL TO RPMST-ACCOUNT      00170000
001710         AND WS-CAC-INST (WS-SUB3) IS EQUAL TO RPMST-INST         00171000
001720         GO TO GM-CHECK-PRODCODE.                                 00172000
001730* SAVE BEFORE LOAD                                                00173000
001740     ADD +1 TO WS-ALLSEC.                                         00174000
001750     IF WS-ALLSEC IS GREATER THAN WS-SECMAX                       00175000
001760         MOVE WS-SECMAX TO WS-ALLSEC                              00176000
001770         GO TO GM-VALID-AD2.                                      00177000
001780     MOVE WS-CAC-INST (WS-SUB3) TO WS-SECINST (WS-ALLSEC).        00178000
001790     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SECPRODCD (WS-ALLSEC).    00179000
001800     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SECACCOUNT (WS-ALLSEC).     00180000
001810 GM-VALID-AD2.                                                    00181000
001820     ADD +1 TO WS-NUMOFSECACCTS.                                  00182000
001830* ** WS-SUB4 IS THE HOLDER OF ACCOUNTS                            00183000
001840     ADD +1 TO WS-SUB4.                                           00184000
001850     IF WS-SUB4 IS GREATER THAN WS-SECONDARY-MAX                  00185000
001860         GO TO GM-END.                                            00186000
001870     MOVE WS-CAC-INST (WS-SUB3) TO WS-SEC-INST (WS-SUB4).         00187000
001880     MOVE WS-CAC-PRODCD (WS-SUB3) TO                              00188000
001890         WS-SEC-PRODCD (WS-SUB4).                                 00189000
001900     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SEC-ACCT (WS-SUB4).         00190000
001910     MOVE WS-2023-INTAPPL (INDX-2023) TO                          00191000
001920         WS-SEC-APPL (WS-SUB4).                                   00192000
001930     MOVE WS-2023-RPOPTION (INDX-2023) TO                         00193000
001940         WS-SEC-RPOPT (WS-SUB4).                                  00194000
001950     MOVE ZEROS TO WS-SEC-BRANCH (WS-SUB4).                       00195000
001960     MOVE ZEROS TO WS-SEC-TYPE (WS-SUB4).                         00196000
001970     MOVE WS-CAC-RELNBR (WS-SUB3) TO WS-SEC-RELNBR (WS-SUB4).     00197000
001980     GO TO GM-CHECK-PRODCODE.                                     00198000
001990* ** GET ANOTHER SECONDARY CUSTOMER AND FIND ACCOUNTS             00199000
002000 GM-CHECK-MORE-SEC.                                               00200000
002010     IF RPRF21-RETURN IS NOT EQUAL TO 'M'                         00201000
002020         GO TO GM-FIND-SEC-ACCTS.                                 00202000
002030* ** CHECK FOR ANOTHER CUSTOMER                                   00203000
P0104      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00204000
P0104          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00204090
P0104          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST     00204180
P0104      ELSE                                                         00204270
P0104          MOVE WS-CAC-INST (WS-CAC-MAX) TO RPRF21-BASE-ACCT-INST.  00204360
002050     MOVE WS-CAC-PRODCD (WS-CAC-MAX) TO RPRF21-BASE-ACCT-PRODCODE.00205000
002060     MOVE WS-CAC-ACCT (WS-CAC-MAX) TO RPRF21-BASE-ACCT.           00206000
002070     GO TO GM-MORE-SECONDARY-ACCTS.                               00207000
002080* ** CHECK FOR MORE ACCOUNTS FOR THIS SECONDARY CUSTOMER          00208000
002090 GM-END.                                                          00209000
002100 GM-EXIT.                                                         00210000
002110     EXIT.                                                        00211000
002120******************************************************************00212000
002130 GM-CHECKFORDUP SECTION.                                          00213000
002140* DETERMINE IF THE NEW SECONDARY ACCOUNT IS ALREADY               00214000
002150* PART OF THE LIST OF SECONDARY ACCOUNTS                          00215000
002160 GM-DUPSTART.                                                     00216000
002170     MOVE +1 TO WS-DUPTEST.                                       00217000
002180     MOVE 'N' TO WS-DUPSECACCT.                                   00218000
002190 GMCFD-START.                                                     00219000
002200     IF WS-DUPTEST IS GREATER THAN WS-SECMAX                      00220000
002210         GO TO GMCFD-EXIT.                                        00221000
002220     IF WS-SEC-ACCT (WS-DUPTEST) IS EQUAL TO SPACE                00222000
002230         GO TO GMCFD-EXIT.                                        00223000
002240     IF WS-DUPINST IS EQUAL TO WS-SEC-INST (WS-DUPTEST)           00224000
002250         AND WS-DUPPRODCD IS EQUAL TO                             00225000
002260             WS-SEC-PRODCD (WS-DUPTEST)                           00226000
002270         AND WS-DUPACCOUNT IS EQUAL TO                            00227000
002280         WS-SEC-ACCT (WS-DUPTEST)                                 00228000
002290         MOVE 'Y' TO WS-DUPSECACCT                                00229000
002300         GO TO GMCFD-EXIT.                                        00230000
002310     ADD +1 TO WS-DUPTEST.                                        00231000
002320     GO TO GMCFD-START.                                           00232000
002330 GMCFD-EXIT.                                                      00233000
002340     EXIT.                                                        00234000
002350******************************************************************00235000
002360 GM-CHECKFORRELNBR SECTION.                                       00236000
002370* DETERMINE IF THE CUSTOMER SHOULD BE INCLUDED BASED ON           00237000
002380* THE RELATIONSHIP CODE WITH THE PRIMARY ACCOUNT                  00238000
002390 GM-CHREL-START.                                                  00239000
002400     MOVE +1 TO WS-RELSUB.                                        00240000
002410 GM-CHECKIT.                                                      00241000
002420     IF WS-RELSUB IS GREATER THAN WS-RELMAX                       00242000
002430         GO TO GM-NOMATCH.                                        00243000
002440     IF WS-SECRELCODE (WS-RELSUB) IS EQUAL TO ZEROS               00244000
002450         GO TO GM-NOMATCH.                                        00245000
002460     IF WS-VALIDREL IS EQUAL TO WS-SECRELCODE (WS-RELSUB)         00246000
002470         GO TO GM-MATCH.                                          00247000
002480     ADD +1 TO WS-RELSUB.                                         00248000
002490     GO TO GM-CHECKIT.                                            00249000
002500 GM-MATCH.                                                        00250000
002510     IF WS-INCLUDEREL IS EQUAL TO 'Y'                             00251000
002520         MOVE 'N' TO WS-BADRELNBR                                 00252000
002530         GO TO GMCFR-EXIT.                                        00253000
002540     MOVE 'Y' TO WS-BADRELNBR.                                    00254000
002550     GO TO GMCFR-EXIT.                                            00255000
002560 GM-NOMATCH.                                                      00256000
002570     IF WS-INCLUDEREL IS EQUAL TO 'Y'                             00257000
002580         MOVE 'Y' TO WS-BADRELNBR                                 00258000
002590         GO TO GMCFR-EXIT.                                        00259000
002600     MOVE 'N' TO WS-BADRELNBR.                                    00260000
002610     GO TO GMCFR-EXIT.                                            00261000
002620 GMCFR-EXIT.                                                      00262000
002630     EXIT.                                                        00263000
002640******************************************************************00264000
002650 GM-SEAC-SAVE-SECONDARY SECTION.                                  00265000
002660* SAVE THE SECONDARY ACCOUNTS FROM THE PRIMARY CUSTOMER           00266000
002670* TO ALLOW FOR A DUPLICATE CHECK WITH ACCOUNTS FROM               00267000
002680* SECONDARY CUSTOMERS                                             00268000
002690 GM-SEAC-SAVE-START.                                              00269000
002700     ADD +1 TO WS-ALLSEC.                                         00270000
002710     IF WS-ALLSEC IS GREATER THAN WS-SECMAX                       00271000
002720         MOVE WS-SECMAX TO WS-ALLSEC                              00272000
002730         GO TO GM-SEAC-SAVE-EXIT.                                 00273000
002740     MOVE WS-CAC-INST (WS-SUB3) TO WS-SECINST (WS-ALLSEC).        00274000
002750     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SECPRODCD (WS-ALLSEC).    00275000
002760     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SECACCOUNT (WS-ALLSEC).     00276000
002770 GM-SEAC-SAVE-EXIT.                                               00277000
002780     EXIT.                                                        00278000
002790*----------------------------------------------------------------*00279000
002800*     END OF RP136 GET SECONDARY ACCOUNTS                        *00280000
002810*----------------------------------------------------------------*00281000
