000010*ACCOUNT-KEY-EDIT SECTION.                                        00001000
000020 AKE-START.                                                       00002000
000030     MOVE SPACE TO WS-FUNCTION.                                   00003000
000040     IF RPW130-PRODCODE IS EQUAL TO SPACES                        00004000
000050         OR RPW130-PRODCODE IS EQUAL TO LOW-VALUES                00005000
000060         MOVE 'P' TO WS-FUNCTION                                  00006000
000070         GO TO AKE-EXIT.                                          00007000
000080     MOVE RPW130-INST TO MIM-2023KINST.                           00008000
000090     MOVE RPW130-PRODCODE TO MIM-2023KPRODCODE.                   00009000
000100     MOVE RPW130-BANK-LVL-2023 TO SLW096-BANKS.                   00010000
000110     PERFORM SLP096-GET-2023-RECORD.                              00011000
000120     IF SLW096-FUNCTION IS NOT EQUAL TO SPACES                    00012000
000130         AND RPW130-FUNCTION IS EQUAL TO 'D'                      00013000
000140         MOVE RPW130-ACCOUNTKEY TO RPW130-FORMATTEDACCT           00014000
000150         GO TO AKE-EXIT.                                          00015000
000160     IF SLW096-FUNCTION IS EQUAL TO 'N'                           00016000
000170         MOVE 'P' TO WS-FUNCTION                                  00017000
000180         GO TO AKE-EXIT.                                          00018000
000190     IF SLW096-FUNCTION IS NOT EQUAL TO SPACES                    00019000
000200         MOVE 'I' TO WS-FUNCTION                                  00020000
000210         GO TO AKE-EXIT.                                          00021000
000220     MOVE MIM-2023PRODNAME TO RPW130-2023PRODNAME.                00022000
000230     MOVE MIM-2023ASSETCD TO RPW130-2023ASSETCD.                  00023000
000240     MOVE MIM-2023PRODCLASS TO RPW130-2023PRODCLASS.              00024000
000250     MOVE MIM-2023DIALOGROUT TO RPW130-2023DIALOGROUT.            00025000
000260     MOVE MIM-2023INTAPPL211 TO RPW130-2023INTAPPL211.            00026000
000270     MOVE MIM-2023ACCTLN TO RPW130-2023ACCTLN.                    00027000
000280     MOVE MIM-2023ACCT-EDIT TO RPW130-2023ACCT-EDIT.              00028000
000290     MOVE MIM-2023ACCTLONG TO RPW130-2023ACCTLONG.                00029000
000300     MOVE MIM-2023ACCTALPHA TO RPW130-2023ACCTALPHA.              00030000
000310     MOVE MIM-2023KEYVRFY TO RPW130-2023KEYVRFY.                  00031000
000320     MOVE MIM-2023ACCTVER TO RPW130-2023ACCTVER.                  00032000
000330     MOVE MIM-2023AMT-KEY TO RPW130-2023AMT-KEY.                  00033000
000340     MOVE MIM-2023APPLTYPE TO RPW130-2023APPLTYPE.                00034000
000350 AKE-CALL-RPB130.                                                 00035000
000000     CALL 'RPB130' USING                                          00036000
000370         RPW130-AREAS                                             00037000
000380         WS-FUNCTION.                                             00038000
000390 AKE-EXIT.                                                        00039000
000400     EXIT.                                                        00040000
