000010******************************************************************00001000
000020* RPP2001  2001 - RP BRANCH INFO LOAD                            *00002000
000030******************************************************************00003000
000040*LOAD-RPS-2001-SECTION.                                           00004000
000050 LR2001-START.                                                    00005000
000060     IF WS-RPMIM2001BANKSW IS NOT EQUAL TO 'Y'                    00006000
000070         GO TO LR2001-ZERO-INST.                                  00007000
000080     MOVE HIGH-VALUES TO WS-2001-AREA.                            00008000
000090     SET INDX-2001 TO +1.                                         00009000
000100     MOVE SPACES TO MI2001-RECORD.                                00010000
000110     MOVE WS-RPMIM2001INST TO MIM-2001KINST.                      00011000
000120     MOVE +2001 TO MIM-2001KREC.                                  00012000
000130     MOVE ZEROS TO MIM-2001KBRANCH.                               00013000
000140     MOVE MIC-MST-2001-PRI TO MIC-MST-REC-PRI.                    00014000
000150     MOVE MI2001-RECORD TO MIMST-RECORD.                          00015000
000160     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00016000
000170     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00017000
000180         OR WS-RPMIM2001INST IS NOT EQUAL TO MIMST-KINST          00018000
000190         GO TO LR2001-ZERO-INST.                                  00019000
000200     GO TO LR2001-RECCONT.                                        00020000
000210 LR2001-RECREAD.                                                  00021000
000220     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00022000
000230     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00023000
000240         GO TO LR2001-EXIT.                                       00024000
000250 LR2001-RECCONT.                                                  00025000
000260     MOVE MIMST-RECORD TO MI2001-RECORD.                          00026000
000270     IF MIM-2001KINST IS NOT EQUAL TO WS-RPMIM2001INST            00027000
000280         GO TO LR2001-EXIT.                                       00028000
000290     IF INDX-2001 IS GREATER THAN WS-RPMIM2001MAXSIZE             00029000
000300         MOVE 'Y' TO WS-RPMIM2001ERROR                            00030000
000310         GO TO LR2001-EXIT.                                       00031000
000320     MOVE MIM-2001KBRANCH TO WS-2001-BRANCH (INDX-2001).          00032000
000330     MOVE MIM-2001RPREG TO WS-2001-REGION (INDX-2001).            00033000
000340     SET INDX-2001 UP BY +1.                                      00034000
000350     GO TO LR2001-RECREAD.                                        00035000
000360 LR2001-ZERO-INST.                                                00036000
000370     IF WS-RPMIM2001BANKSW IS NOT EQUAL TO 'Y'                    00037000
000380         AND WS-RPMIM2001LOADSW IS EQUAL TO 'Y'                   00038000
000390         GO TO LR2001-EXIT.                                       00039000
000400     MOVE 'Y' TO WS-RPMIM2001LOADSW.                              00040000
000410     MOVE HIGH-VALUES TO WS-2001-AREA.                            00041000
000420     SET INDX-2001 TO +1.                                         00042000
000430     MOVE SPACES TO MI2001-RECORD.                                00043000
000440     MOVE ZEROS TO MIM-2001KINST.                                 00044000
000450     MOVE +2001 TO MIM-2001KREC.                                  00045000
000460     MOVE ZEROS TO MIM-2001KBRANCH.                               00046000
000470     MOVE MIC-MST-2001-PRI TO MIC-MST-REC-PRI.                    00047000
000480     MOVE MI2001-RECORD TO MIMST-RECORD.                          00048000
000490     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00049000
000500     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00050000
000510         GO TO LR2001-EXIT.                                       00051000
000520     GO TO LR2001-ZERO-RECCONT.                                   00052000
000530 LR2001-ZERO-RECREAD.                                             00053000
000540     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00054000
000550     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00055000
000560         GO TO LR2001-EXIT.                                       00056000
000570 LR2001-ZERO-RECCONT.                                             00057000
000580     MOVE MIMST-RECORD TO MI2001-RECORD.                          00058000
000590     IF MIM-2001KINST IS GREATER THAN ZEROS                       00059000
000600         GO TO LR2001-EXIT.                                       00060000
000610     IF INDX-2001 IS GREATER THAN WS-RPMIM2001MAXSIZE             00061000
000620         MOVE 'Y' TO WS-RPMIM2001ERROR                            00062000
000630         GO TO LR2001-EXIT.                                       00063000
000640     MOVE MIM-2001KBRANCH TO WS-2001-BRANCH (INDX-2001).          00064000
000650     MOVE MIM-2001RPREG TO WS-2001-REGION (INDX-2001).            00065000
000660     SET INDX-2001 UP BY +1.                                      00066000
000670     GO TO LR2001-ZERO-RECREAD.                                   00067000
000680 LR2001-EXIT.                                                     00068000
000690      EXIT.                                                       00069000
000700*----------------------------------------------------------------*00070000
000710*     END OF RP BRANCH INFO 2001 MICM RECORD LOAD                *00071000
000720*----------------------------------------------------------------*00072000
