000010******************************************************************00001000
000020* RPP2001  2001 - RP BRANCH INFO LOAD                            *00002000
000030******************************************************************00003000
000040*LOAD-RPS-2001-SECTION.                                           00004000
000050 LR2001-START.                                                    00005000
000060     MOVE ZEROS TO WS-M2001-TABLE.                                00006000
000070     IF WS-RPMIM2001BANKSW IS NOT EQUAL TO 'Y'                    00007000
000080         GO TO LR2001-ZERO-INST.                                  00008000
000090     MOVE HIGH-VALUES TO WS-2001-AREA.                            00009000
000100     SET INDX-2001 TO +1.                                         00010000
000110     MOVE SPACES TO MI2001-RECORD.                                00011000
000120     MOVE WS-RPMIM2001INST TO MIM-2001KINST.                      00012000
000130     MOVE +2001 TO MIM-2001KREC.                                  00013000
000140     MOVE ZEROS TO MIM-2001KBRANCH.                               00014000
000150     MOVE MIC-MST-2001-PRI TO MIC-MST-REC-PRI.                    00015000
000160     MOVE MI2001-RECORD TO MIMST-RECORD.                          00016000
000170     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00017000
000180     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00018000
000190         OR WS-RPMIM2001INST IS NOT EQUAL TO MIMST-KINST          00019000
000200         GO TO LR2001-ZERO-INST.                                  00020000
000210     GO TO LR2001-RECCONT.                                        00021000
000220 LR2001-RECREAD.                                                  00022000
000230     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00023000
000240     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00024000
000250         GO TO LR2001-EXIT.                                       00025000
000260 LR2001-RECCONT.                                                  00026000
000270     MOVE MIMST-RECORD TO MI2001-RECORD.                          00027000
000280     IF MIM-2001KINST IS NOT EQUAL TO WS-RPMIM2001INST            00028000
000290         GO TO LR2001-EXIT.                                       00029000
000300     IF INDX-2001 IS GREATER THAN WS-RPMIM2001MAXSIZE             00030000
000310         MOVE 'Y' TO WS-RPMIM2001ERROR                            00031000
000320         GO TO LR2001-EXIT.                                       00032000
000330     MOVE MIM-2001KBRANCH TO WS-2001-BRANCH (INDX-2001).          00033000
000340     MOVE MIM-2001RPREG TO WS-2001-REGION (INDX-2001).            00034000
000350     SET INDX-2001 UP BY +1.                                      00035000
000360     GO TO LR2001-RECREAD.                                        00036000
000370 LR2001-ZERO-INST.                                                00037000
000380     IF WS-RPMIM2001BANKSW IS NOT EQUAL TO 'Y'                    00038000
000390         AND WS-RPMIM2001LOADSW IS EQUAL TO 'Y'                   00039000
000400         GO TO LR2001-EXIT.                                       00040000
000410     MOVE 'Y' TO WS-RPMIM2001LOADSW.                              00041000
000420     MOVE HIGH-VALUES TO WS-2001-AREA.                            00042000
000430     SET INDX-2001 TO +1.                                         00043000
000440     MOVE SPACES TO MI2001-RECORD.                                00044000
000450     MOVE ZEROS TO MIM-2001KINST.                                 00045000
000460     MOVE +2001 TO MIM-2001KREC.                                  00046000
000470     MOVE ZEROS TO MIM-2001KBRANCH.                               00047000
000480     MOVE MIC-MST-2001-PRI TO MIC-MST-REC-PRI.                    00048000
000490     MOVE MI2001-RECORD TO MIMST-RECORD.                          00049000
000500     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00050000
000510     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00051000
000520         GO TO LR2001-EXIT.                                       00052000
000530     GO TO LR2001-ZERO-RECCONT.                                   00053000
000540 LR2001-ZERO-RECREAD.                                             00054000
000550     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00055000
000560     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00056000
000570         GO TO LR2001-EXIT.                                       00057000
000580 LR2001-ZERO-RECCONT.                                             00058000
000590     MOVE MIMST-RECORD TO MI2001-RECORD.                          00059000
000600     IF MIM-2001KINST IS GREATER THAN ZEROS                       00060000
000610         GO TO LR2001-EXIT.                                       00061000
000620     IF INDX-2001 IS GREATER THAN WS-RPMIM2001MAXSIZE             00062000
000630         MOVE 'Y' TO WS-RPMIM2001ERROR                            00063000
000640         GO TO LR2001-EXIT.                                       00064000
000650     MOVE MIM-2001KBRANCH TO WS-2001-BRANCH (INDX-2001).          00065000
000660     MOVE MIM-2001RPREG TO WS-2001-REGION (INDX-2001).            00066000
000670     SET INDX-2001 UP BY +1.                                      00067000
000680     GO TO LR2001-ZERO-RECREAD.                                   00068000
000690 LR2001-EXIT.                                                     00069000
000700      EXIT.                                                       00070000
000710*----------------------------------------------------------------*00071000
000720*     END OF RP BRANCH INFO 2001 MICM RECORD LOAD                *00072000
000730*----------------------------------------------------------------*00073000
