000010******************************************************************00001000
000020* RPP2023  2023 - RP PRODUCT CODE INFO LOAD                      *00002000
000030******************************************************************00003000
000040*LOAD-RPS-2023-SECTION.                                           00004000
000050 LR2023-START.                                                    00005000
000060     IF WS-RPMIM2023BANKSW IS NOT EQUAL TO 'Y'                    00006000
000070         GO TO LR2023-ZERO-INST.                                  00007000
000080     MOVE HIGH-VALUES TO WS-2023-AREA.                            00008000
000090     SET INDX-2023 TO +1.                                         00009000
000100     MOVE SPACES TO MI2023-RECORD.                                00010000
000110     MOVE SPACES TO WS-RPMIM2023-RPS.                             00011000
000120     MOVE WS-RPMIM2023INST TO MIM-2023KINST.                      00012000
000130     MOVE +2023 TO MIM-2023KREC.                                  00013000
000140     MOVE SPACES TO MIM-2023KPRODCODE.                            00014000
000150     MOVE MIC-MST-2023-PRI TO MIC-MST-REC-PRI.                    00015000
000160     MOVE MI2023-RECORD TO MIMST-RECORD.                          00016000
000170     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00017000
000180     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00018000
000190         OR WS-RPMIM2023INST IS NOT EQUAL TO MIMST-KINST          00019000
000200         GO TO LR2023-ZERO-INST.                                  00020000
000210     GO TO LR2023-RECCONT.                                        00021000
000220 LR2023-RECREAD.                                                  00022000
000230     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00023000
000240     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00024000
000250         GO TO LR2023-EXIT.                                       00025000
000260 LR2023-RECCONT.                                                  00026000
000270     MOVE MIMST-RECORD TO MI2023-RECORD.                          00027000
000280     IF MIM-2023KINST IS NOT EQUAL TO WS-RPMIM2023INST            00028000
000290         GO TO LR2023-EXIT.                                       00029000
000300     IF INDX-2023 IS GREATER THAN WS-RPMIM2023MAXSIZE             00030000
000310         MOVE 'Y' TO WS-RPMIM2023ERROR                            00031000
000320         GO TO LR2023-EXIT.                                       00032000
000330     IF MIM-2023INTAPPL211 IS EQUAL TO 50                         00033000
000340         AND WS-RPMIM2023-RPS IS EQUAL TO SPACES                  00034000
000350         MOVE MIM-2023KPRODCODE TO WS-RPMIM2023-RPS               00035000
000360         GO TO LR2023-RECREAD.                                    00036000
000370     IF MIM-2023RPOPTION IS NOT EQUAL TO 'Y'                      00037000
000380         AND MIM-2023RPOPTION IS NOT EQUAL TO 'P'                 00038000
000390         GO TO LR2023-RECREAD.                                    00039000
000400     MOVE MIM-2023KPRODCODE TO WS-2023-PRODCODE (INDX-2023).      00040000
000410     MOVE MIM-2023INTAPPL211 TO WS-2023-INTAPPL (INDX-2023).      00041000
000420     MOVE MIM-2023RPOPTION TO WS-2023-RPOPTION (INDX-2023).       00042000
000430     MOVE MIM-2023ACCTLN TO WS-2023-ACCTLN (INDX-2023).           00043000
000440     MOVE MIM-2023ACCT-EDIT TO WS-2023-ACCTED (INDX-2023).        00044000
000450     SET INDX-2023 UP BY +1.                                      00045000
000460     GO TO LR2023-RECREAD.                                        00046000
000470 LR2023-ZERO-INST.                                                00047000
000480     IF WS-RPMIM2023BANKSW IS NOT EQUAL TO 'Y'                    00048000
000490         AND WS-RPMIM2023LOADSW IS EQUAL TO 'Y'                   00049000
000500         GO TO LR2023-EXIT.                                       00050000
000510     MOVE 'Y' TO WS-RPMIM2023LOADSW.                              00051000
000520     MOVE HIGH-VALUES TO WS-2023-AREA.                            00052000
000530     SET INDX-2023 TO +1.                                         00053000
000540     MOVE SPACES TO MI2023-RECORD.                                00054000
000550     MOVE SPACES TO WS-RPMIM2023-RPS.                             00055000
000560     MOVE ZEROS TO MIM-2023KINST.                                 00056000
000570     MOVE +2023 TO MIM-2023KREC.                                  00057000
000580     MOVE SPACES TO MIM-2023KPRODCODE.                            00058000
000590     MOVE MIC-MST-2023-PRI TO MIC-MST-REC-PRI.                    00059000
000600     MOVE MI2023-RECORD TO MIMST-RECORD.                          00060000
000610     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00061000
000620     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00062000
000630         GO TO LR2023-EXIT.                                       00063000
000640     GO TO LR2023-ZERO-RECCONT.                                   00064000
000650 LR2023-ZERO-RECREAD.                                             00065000
000660     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00066000
000670     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00067000
000680         GO TO LR2023-EXIT.                                       00068000
000690 LR2023-ZERO-RECCONT.                                             00069000
000700     MOVE MIMST-RECORD TO MI2023-RECORD.                          00070000
000710     IF MIM-2023KINST IS GREATER THAN ZEROS                       00071000
000720         GO TO LR2023-EXIT.                                       00072000
000730     IF INDX-2023 IS GREATER THAN WS-RPMIM2023MAXSIZE             00073000
000740         MOVE 'Y' TO WS-RPMIM2023ERROR                            00074000
000750         GO TO LR2023-EXIT.                                       00075000
000760     IF MIM-2023INTAPPL211 IS EQUAL TO 50                         00076000
000770         AND WS-RPMIM2023-RPS IS EQUAL TO SPACES                  00077000
000780         MOVE MIM-2023KPRODCODE TO WS-RPMIM2023-RPS               00078000
000790         GO TO LR2023-ZERO-RECREAD.                               00079000
000800     IF MIM-2023RPOPTION IS NOT EQUAL TO 'Y'                      00080000
000810         AND MIM-2023RPOPTION IS NOT EQUAL TO 'P'                 00081000
000820         GO TO LR2023-ZERO-RECREAD.                               00082000
000830     MOVE MIM-2023KPRODCODE TO WS-2023-PRODCODE (INDX-2023).      00083000
000840     MOVE MIM-2023INTAPPL211 TO WS-2023-INTAPPL (INDX-2023).      00084000
000850     MOVE MIM-2023RPOPTION TO WS-2023-RPOPTION (INDX-2023).       00085000
000860     MOVE MIM-2023ACCTLN TO WS-2023-ACCTLN (INDX-2023).           00086000
000870     MOVE MIM-2023ACCT-EDIT TO WS-2023-ACCTED (INDX-2023).        00087000
000880     SET INDX-2023 UP BY +1.                                      00088000
000890     GO TO LR2023-ZERO-RECREAD.                                   00089000
000900 LR2023-EXIT.                                                     00090000
000910      EXIT.                                                       00091000
000920*----------------------------------------------------------------*00092000
000930*     END OF RP PRODUCT CODE INFO 2023 MICM RECORD LOAD          *00093000
000940*----------------------------------------------------------------*00094000
