000010******************************************************************00001000
000020* RPP7106  7106 - RP CATEGORY BALANCE DEF LOAD                   *00002000
000030******************************************************************00003000
000040*LOAD-RPS-7106-SECTION.                                           00004000
000050 LR7106-START.                                                    00005000
000060     MOVE HIGH-VALUES TO WS-7106-AREA.                            00006000
000070     SET INDX-7106 TO +1.                                         00007000
000080     MOVE SPACES TO MI7106-RECORD.                                00008000
000090     MOVE WS-RPMIM7106INST TO MIM-7106KINST.                      00009000
000100     MOVE +7106 TO MIM-7106KREC.                                  00010000
000110     MOVE SPACES TO MIM-7106KRPREC.                               00011000
000120     MOVE MIC-RPS-7106-PRI TO MIC-MST-REC-PRI.                    00012000
000130     MOVE MI7106-RECORD TO MIMST-RECORD.                          00013000
000140     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00014000
000150     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00015000
000160         GO TO LR7106-EXIT.                                       00016000
000170     GO TO LR7106-RECCONT.                                        00017000
000180 LR7106-RECREAD.                                                  00018000
000190     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00019000
000200     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00020000
000210         GO TO LR7106-EXIT.                                       00021000
000220 LR7106-RECCONT.                                                  00022000
000230     MOVE MIMST-RECORD TO MI7106-RECORD.                          00023000
000240     IF MIM-7106KINST IS NOT EQUAL TO WS-RPMIM7106INST            00024000
000250         GO TO LR7106-EXIT.                                       00025000
000260     IF INDX-7106 IS GREATER THAN WS-RPMIM7106MAXSIZE             00026000
000270         MOVE 'Y' TO WS-RPMIM7106ERROR                            00027000
000280         GO TO LR7106-EXIT.                                       00028000
000290     MOVE MIM-7106KRPREC TO WS-7106-RPREC (INDX-7106).            00029000
000300     MOVE MIM-REC7106 TO WS-RPMIM7106 (INDX-7106).                00030000
000310     SET INDX-7106 UP BY +1.                                      00031000
000320     GO TO LR7106-RECREAD.                                        00032000
000330 LR7106-EXIT.                                                     00033000
000340      EXIT.                                                       00034000
000350*----------------------------------------------------------------*00035000
000360*     END OF RP CATEGORY BALANCE DEF 7106 MICM RECORD LOAD       *00036000
000370*----------------------------------------------------------------*00037000
