000010******************************************************************00001000
000020* RPP7101  7101 - RP MODEL DEFINITION LOAD                       *00002000
000030******************************************************************00003000
000040*LOAD-RPS-7101-SECTION.                                           00004000
000050 LR7101-START.                                                    00005000
000060     MOVE HIGH-VALUES TO WS-7101-AREA.                            00006000
000070     SET INDX-7101 TO +1.                                         00007000
000080     MOVE SPACES TO WS-RPMIM7101MODEL.                            00008000
000090     MOVE SPACES TO MI7101-RECORD.                                00009000
000100     MOVE WS-RPMIM7101INST TO MIM-7101KINST.                      00010000
000110     MOVE +7101 TO MIM-7101KREC.                                  00011000
000120     MOVE SPACES TO MIM-7101KMODEL.                               00012000
000130     MOVE WS-RPMIM7101EFFDT TO MIM-7101KEFFDT.                    00013000
000140     MOVE MIC-RPS-7101-PRI TO MIC-MST-REC-PRI.                    00014000
000150     MOVE MI7101-RECORD TO MIMST-RECORD.                          00015000
000160     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00016000
000170     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00017000
000180         GO TO LR7101-EXIT.                                       00018000
000190     GO TO LR7101-RECCONT.                                        00019000
000200 LR7101-RECREAD.                                                  00020000
000210     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00021000
000220     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00022000
000230         GO TO LR7101-EXIT.                                       00023000
000240 LR7101-RECCONT.                                                  00024000
000250     MOVE MIMST-RECORD TO MI7101-RECORD.                          00025000
000260     IF MIM-7101KINST IS NOT EQUAL TO WS-RPMIM7101INST            00026000
000270         GO TO LR7101-EXIT.                                       00027000
000280     IF MIM-7101KEFFDT IS GREATER THAN WS-RPMIM7101EFFDT          00028000
000290         GO TO LR7101-RECREAD.                                    00029000
000300     IF MIM-7101KMODEL IS EQUAL TO WS-RPMIM7101MODEL              00030000
000310         GO TO LR7101-RECREAD.                                    00031000
000320     IF INDX-7101 IS GREATER THAN WS-RPMIM7101MAXSIZE             00032000
000330         MOVE 'Y' TO WS-RPMIM7101ERROR                            00033000
000340         GO TO LR7101-EXIT.                                       00034000
000350     MOVE MIM-7101KMODEL TO WS-7101-MODEL (INDX-7101).            00035000
000360     MOVE MIM-7101KMODEL TO WS-RPMIM7101MODEL.                    00036000
000370     MOVE MIM-REC7101 TO WS-RPMIM7101 (INDX-7101).                00037000
000380     SET INDX-7101 UP BY +1.                                      00038000
000390     GO TO LR7101-RECREAD.                                        00039000
000400 LR7101-EXIT.                                                     00040000
000410      EXIT.                                                       00041000
000420*----------------------------------------------------------------*00042000
000430*     END OF RP MODEL DEFINITION 7101 MICM RECORD LOAD           *00043000
000440*----------------------------------------------------------------*00044000
