000010******************************************************************00001000
000020* RPP7114  7114 - RP TERM BALANCE RATE TABLE LOAD                *00002000
000030******************************************************************00003000
000040*LOAD-RPS-7114-SECTION.                                           00004000
000050 LR7114-START.                                                    00005000
000060     MOVE HIGH-VALUES TO WS-7114-AREA.                            00006000
000070     SET INDX-7114 TO +1.                                         00007000
000080     MOVE SPACES TO MI7114-RECORD.                                00008000
000090     MOVE WS-RPMIM7114INST TO MIM-7114KINST.                      00009000
000100     MOVE +7114 TO MIM-7114KREC.                                  00010000
000110     MOVE SPACES TO MIM-7114KRATETABLE.                           00011000
000120     MOVE ZEROS TO MIM-7114KTERM.                                 00012000
000130     MOVE MIC-RPS-7114-PRI TO MIC-MST-REC-PRI.                    00013000
000140     MOVE MI7114-RECORD TO MIMST-RECORD.                          00014000
000150     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00015000
000160     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00016000
000170         GO TO LR7114-EXIT.                                       00017000
000180     GO TO LR7114-RECCONT.                                        00018000
000190 LR7114-RECREAD.                                                  00019000
000200     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00020000
000210     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00021000
000220         GO TO LR7114-EXIT.                                       00022000
000230 LR7114-RECCONT.                                                  00023000
000240     MOVE MIMST-RECORD TO MI7114-RECORD.                          00024000
000250     IF MIM-7114KINST IS NOT EQUAL TO WS-RPMIM7114INST            00025000
000260         GO TO LR7114-EXIT.                                       00026000
000270     IF INDX-7114 IS GREATER THAN WS-RPMIM7114MAXSIZE             00027000
000280         MOVE 'Y' TO WS-RPMIM7114ERROR                            00028000
000290         GO TO LR7114-EXIT.                                       00029000
000300     MOVE MIM-7114KRATETABLE TO WS-7114-RATETABLE (INDX-7114).    00030000
000310     MOVE MIM-7114KTERM TO WS-7114-TERM (INDX-7114).              00031000
000320     MOVE MIM-REC7114 TO WS-RPMIM7114 (INDX-7114).                00032000
000330     SET INDX-7114 UP BY +1.                                      00033000
000340     GO TO LR7114-RECREAD.                                        00034000
000350 LR7114-EXIT.                                                     00035000
000360      EXIT.                                                       00036000
000370*----------------------------------------------------------------*00037000
000380*     END OF RP TERM BALANCE RATE TABLE 7114 MICM RECORD LOAD    *00038000
000390*----------------------------------------------------------------*00039000
