000010******************************************************************00001000
000020* RPP7104S  7104 - RP RELATIONSHIP CODES TABLE SEARCH            *00002000
000030******************************************************************00003000
000040*SEARCH-RPS-7104-SECTION.                                         00004000
000050 SR7104-START.                                                    00005000
000060     MOVE 'N' TO WS-RPMIM7104FOUND.                               00006000
000070     SEARCH ALL WS-7104-RECORD                                    00007000
000080         AT END                                                   00008000
000090             MOVE 'N' TO WS-RPMIM7104FOUND                        00009000
000100             GO TO SR7104-EXIT                                    00010000
000110         WHEN WS-7104-KEY (INDX-7104) IS EQUAL TO                 00011000
000120             WS-RPMIM7104RPREC                                    00012000
000130             MOVE WS-RPMIM7104 (INDX-7104) TO MIM-REC7104         00013000
000140             MOVE 'Y' TO WS-RPMIM7104FOUND.                       00014000
000150 SR7104-EXIT.                                                     00015000
000160     EXIT.                                                        00016000
000170*----------------------------------------------------------------*00017000
000180*     END OF RP RELATIONSHIP CODES 7104 TABLE SEARCH             *00018000
000190*----------------------------------------------------------------*00019000
