000010******************************************************************00001000
000020* RPP7110  7110 - RP TRANSACTION PROFILE TABLE LOAD              *00002000
000030******************************************************************00003000
000040*LOAD-RPS-7110-SECTION.                                           00004000
000050 LR7110-START.                                                    00005000
000060     MOVE HIGH-VALUES TO WS-7110-AREA.                            00006000
000070     SET INDX-7110 TO +1.                                         00007000
000080     MOVE SPACES TO MI7110-RECORD.                                00008000
000090     MOVE WS-RPMIM7110INST TO MIM-7110KINST.                      00009000
000100     MOVE +7110 TO MIM-7110KREC.                                  00010000
000110     MOVE SPACES TO MIM-7110KTRANPROFILE.                         00011000
000120     MOVE MIC-RPS-7110-PRI TO MIC-MST-REC-PRI.                    00012000
000130     MOVE MI7110-RECORD TO MIMST-RECORD.                          00013000
000140     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00014000
000150     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00015000
000160         GO TO LR7110-EXIT.                                       00016000
000170     GO TO LR7110-RECCONT.                                        00017000
000180 LR7110-RECREAD.                                                  00018000
000190     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00019000
000200     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00020000
000210         GO TO LR7110-EXIT.                                       00021000
000220 LR7110-RECCONT.                                                  00022000
000230     MOVE MIMST-RECORD TO MI7110-RECORD.                          00023000
000240     IF MIM-7110KINST IS NOT EQUAL TO WS-RPMIM7110INST            00024000
000250         GO TO LR7110-EXIT.                                       00025000
000260     IF INDX-7110 IS GREATER THAN WS-RPMIM7110MAXSIZE             00026000
000270         MOVE 'Y' TO WS-RPMIM7110ERROR                            00027000
000280         GO TO LR7110-EXIT.                                       00028000
000290     MOVE MIM-7110KTRANPROFILE                                    00029000
000300         TO WS-7110-TRANPROFILE (INDX-7110).                      00030000
000310     MOVE MIM-REC7110 TO WS-RPMIM7110 (INDX-7110).                00031000
000320     SET INDX-7110 UP BY +1.                                      00032000
000330     GO TO LR7110-RECREAD.                                        00033000
000340 LR7110-EXIT.                                                     00034000
000350      EXIT.                                                       00035000
000360*----------------------------------------------------------------*00036000
000370*     END OF RP TRANSACTION PROFILE 7110 MICM TABLE LOAD         *00037000
000380*----------------------------------------------------------------*00038000
