000010******************************************************************00001000
000020* RPP7109S  7109 - RP SERVICE CHARGE INCENTIVES TABLE SEARCH     *00002000
000030******************************************************************00003000
000040*SEARCH-RPS-7109 SECTION.                                         00004000
000050 SR7109-START.                                                    00005000
000060     MOVE 'N' TO WS-RPMIM7109FOUND.                               00006000
000070     SEARCH ALL WS-7109-RECORD                                    00007000
000080         AT END                                                   00008000
000090             MOVE 'N' TO WS-RPMIM7109FOUND                        00009000
000100             GO TO SR7109-EXIT                                    00010000
000110         WHEN WS-7109-KEY (INDX-7109) IS EQUAL TO                 00011000
000120             WS-RPMIM7109SCTABLE                                  00012000
000130             MOVE WS-RPMIM7109 (INDX-7109) TO MIM-REC7109         00013000
000140             MOVE 'Y' TO WS-RPMIM7109FOUND.                       00014000
000150 SR7109-EXIT.                                                     00015000
000160     EXIT.                                                        00016000
000170*----------------------------------------------------------------*00017000
000180*     END OF RP SERVICE CHARGE INCENTIVES 7109 TABLE SEARCH      *00018000
000190*----------------------------------------------------------------*00019000
