000010******************************************************************00001000
000020* RPP7113  7113 - RP SECONDARY SERVICE PLAN TABLE LOAD           *00002000
000030******************************************************************00003000
000040*LOAD-RPS-7113-SECTION.                                           00004000
000050 LR7113-START.                                                    00005000
000060     MOVE HIGH-VALUES TO WS-7113-AREA.                            00006000
000070     SET INDX-7113 TO +1.                                         00007000
000080     MOVE SPACES TO MI7113-RECORD.                                00008000
000090     MOVE WS-RPMIM7113INST TO MIM-7113KINST.                      00009000
000100     MOVE +7113 TO MIM-7113KREC.                                  00010000
000110     MOVE SPACES TO MIM-7113KSSPLAN.                              00011000
000120     MOVE MIC-RPS-7113-PRI TO MIC-MST-REC-PRI.                    00012000
000130     MOVE MI7113-RECORD TO MIMST-RECORD.                          00013000
000140     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00014000
000150     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00015000
000160         GO TO LR7113-EXIT.                                       00016000
000170     GO TO LR7113-RECCONT.                                        00017000
000180 LR7113-RECREAD.                                                  00018000
000190     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00019000
000200     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00020000
000210         GO TO LR7113-EXIT.                                       00021000
000220 LR7113-RECCONT.                                                  00022000
000230     MOVE MIMST-RECORD TO MI7113-RECORD.                          00023000
000240     IF MIM-7113KINST IS NOT EQUAL TO WS-RPMIM7113INST            00024000
000250         GO TO LR7113-EXIT.                                       00025000
000260     IF INDX-7113 IS GREATER THAN WS-RPMIM7113MAXSIZE             00026000
000270         MOVE 'Y' TO WS-RPMIM7113ERROR                            00027000
000280         GO TO LR7113-EXIT.                                       00028000
000290     MOVE MIM-7113KSSPLAN TO WS-7113-SSPLAN (INDX-7113).          00029000
000300     MOVE MIM-REC7113 TO WS-RPMIM7113 (INDX-7113).                00030000
000310     SET INDX-7113 UP BY +1.                                      00031000
000320     GO TO LR7113-RECREAD.                                        00032000
000330 LR7113-EXIT.                                                     00033000
000340      EXIT.                                                       00034000
000350*----------------------------------------------------------------*00035000
000360*     END OF RP SECONDARY SERVICE PLAN MICM 7113 LOAD            *00036000
000370*----------------------------------------------------------------*00037000
