000010******************************************************************00001000
000020* RPP7102  7102 - RP RATE MODEL LOAD                             *00002000
000030******************************************************************00003000
000040*LOAD-RPS-7102-SECTION.                                           00004000
000050 LR7102-START.                                                    00005000
000060     MOVE HIGH-VALUES TO WS-7102-AREA.                            00006000
000070     SET INDX-7102 TO +1.                                         00007000
000080     MOVE SPACES TO MI7102-RECORD.                                00008000
000090     MOVE WS-RPMIM7102INST TO MIM-7102KINST.                      00009000
000100     MOVE +7102 TO MIM-7102KREC.                                  00010000
000110     MOVE SPACES TO MIM-7102KMODEL.                               00011000
000120     MOVE SPACES TO MIM-7102KPRODCODE.                            00012000
000130     MOVE ZEROS TO MIM-7102KACCTTYPE.                             00013000
000140     MOVE MIC-RPS-7102-PRI TO MIC-MST-REC-PRI.                    00014000
000150     MOVE MI7102-RECORD TO MIMST-RECORD.                          00015000
000160     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00016000
000170     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00017000
000180         GO TO LR7102-EXIT.                                       00018000
000190     GO TO LR7102-RECCONT.                                        00019000
000200 LR7102-RECREAD.                                                  00020000
000210     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00021000
000220     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00022000
000230         GO TO LR7102-EXIT.                                       00023000
000240 LR7102-RECCONT.                                                  00024000
000250     MOVE MIMST-RECORD TO MI7102-RECORD.                          00025000
000260     IF MIM-7102KINST IS NOT EQUAL TO WS-RPMIM7102INST            00026000
000270         GO TO LR7102-EXIT.                                       00027000
000280     IF INDX-7102 IS GREATER THAN WS-RPMIM7102MAXSIZE             00028000
000290         MOVE 'Y' TO WS-RPMIM7102ERROR                            00029000
000300         GO TO LR7102-EXIT.                                       00030000
000310     MOVE MIM-7102KMODEL TO WS-7102-MODEL (INDX-7102).            00031000
000320     MOVE MIM-7102KPRODCODE TO WS-7102-PRODCODE (INDX-7102).      00032000
000330     MOVE MIM-7102KACCTTYPE TO WS-7102-TYPE (INDX-7102).          00033000
000340     MOVE MIM-REC7102 TO WS-RPMIM7102 (INDX-7102).                00034000
000350     SET INDX-7102 UP BY +1.                                      00035000
000360     GO TO LR7102-RECREAD.                                        00036000
000370 LR7102-EXIT.                                                     00037000
000380      EXIT.                                                       00038000
000390*----------------------------------------------------------------*00039000
000400*     END OF RP RATE MODEL 7102 MICM RECORD LOAD                 *00040000
000410*----------------------------------------------------------------*00041000
