000010******************************************************************00001000
000020* RPP7101S  7101 - RP MODEL DEFINITION TABLE SEARCH              *00002000
000030******************************************************************00003000
000040*SEARCH-RPS-7101-SECTION.                                         00004000
000050 SR7101-START.                                                    00005000
000060     MOVE 'N' TO WS-RPMIM7101FOUND.                               00006000
000070     SEARCH ALL WS-7101-RECORD                                    00007000
000080         AT END                                                   00008000
000090             MOVE 'N' TO WS-RPMIM7101FOUND                        00009000
000100             GO TO SR7101-EXIT                                    00010000
000110         WHEN WS-7101-KEY (INDX-7101) IS EQUAL TO                 00011000
000120             WS-RPMIM7101MODEL                                    00012000
000130             MOVE WS-RPMIM7101 (INDX-7101) TO MIM-REC7101         00013000
000140             MOVE 'Y' TO WS-RPMIM7101FOUND.                       00014000
000150 SR7101-EXIT.                                                     00015000
000160     EXIT.                                                        00016000
000170*----------------------------------------------------------------*00017000
000180*     END OF RP MODEL DEFINITION 7101 TABLE SEARCH               *00018000
000190*----------------------------------------------------------------*00019000
