000010******************************************************************00001000
000020* API CALL ROUTINES FOR ENROLLMENT RECORD    -ENR-                00002000
000030******************************************************************00003000
000040 RPS-ENR-GET-REQUEST SECTION.                                     00004000
000050 RENRGR-START.                                                    00005000
000060     MOVE REQ-GET TO RPS-ENR-REQ-VERB.                            00006000
000070     PERFORM RPS-ENR-APISERVER.                                   00007000
000080 RENRGR-EXIT.                                                     00008000
000090     EXIT.                                                        00009000
000100******************************************************************00010000
000110 RPS-ENR-GET-LOCK-REQUEST SECTION.                                00011000
000120 RENRGLR-START.                                                   00012000
000130     MOVE REQ-GET-LOCK TO RPS-ENR-REQ-VERB.                       00013000
000140     PERFORM RPS-ENR-APISERVER.                                   00014000
000150     IF WS-FUNCTION IS EQUAL TO SPACES                            00015000
000160         MOVE RPENR-RECORD TO RPS-ENR-BIMAGE                      00016000
000170         MOVE RPS-ENR-APPENDDATA TO RPS-ENR-BAPPENDDATA.          00017000
000180 RENRGLR-EXIT.                                                    00018000
000190     EXIT.                                                        00019000
000200******************************************************************00020000
000210 RPS-ENR-GET-GE-REQUEST SECTION.                                  00021000
000220 RENRGER-START.                                                   00022000
000230     MOVE REQ-GET-GE TO RPS-ENR-REQ-VERB.                         00023000
000240     PERFORM RPS-ENR-APISERVER.                                   00024000
000250 RENRGER-EXIT.                                                    00025000
000260     EXIT.                                                        00026000
000270******************************************************************00027000
000280 RPS-ENR-GET-GE-LOCK-REQUEST SECTION.                             00028000
000290 RENRGELR-START.                                                  00029000
000300     MOVE REQ-GET-GE-LOCK TO RPS-ENR-REQ-VERB.                    00030000
000310     PERFORM RPS-ENR-APISERVER.                                   00031000
000320     IF WS-FUNCTION IS EQUAL TO SPACES                            00032000
000330         MOVE RPENR-RECORD TO RPS-ENR-BIMAGE                      00033000
000340         MOVE RPS-ENR-APPENDDATA TO RPS-ENR-AAPPENDDATA.          00034000
000350 RENRGELR-EXIT.                                                   00035000
000360     EXIT.                                                        00036000
000370******************************************************************00037000
000380 RPS-ENR-GET-NEXT-REQUEST SECTION.                                00038000
000390 RENRGNR-START.                                                   00039000
000400     MOVE REQ-GET-NEXT TO RPS-ENR-REQ-VERB.                       00040000
000410     PERFORM RPS-ENR-APISERVER.                                   00041000
000420 RENRGNR-EXIT.                                                    00042000
000430     EXIT.                                                        00043000
000440******************************************************************00044000
000450 RPS-ENR-GET-NEXT-LOCK-REQUEST SECTION.                           00045000
000460 RENRGNLR-START.                                                  00046000
000470     MOVE REQ-GET-NEXT-LOCK TO RPS-ENR-REQ-VERB.                  00047000
000480     PERFORM RPS-ENR-APISERVER.                                   00048000
000490     IF WS-FUNCTION IS EQUAL TO SPACES                            00049000
000500         MOVE RPENR-RECORD TO RPS-ENR-BIMAGE                      00050000
000510         MOVE RPS-ENR-APPENDDATA TO RPS-ENR-BAPPENDDATA.          00051000
000520 RENRGNLR-EXIT.                                                   00052000
000530     EXIT.                                                        00053000
000540******************************************************************00054000
000550 RPS-ENR-LOCATE-REQUEST SECTION.                                  00055000
000560 RENRLR-START.                                                    00056000
000570     MOVE REQ-LOCATE TO RPS-ENR-REQ-VERB.                         00057000
000580     PERFORM RPS-ENR-APISERVER.                                   00058000
000590 RENRLR-EXIT.                                                     00059000
000600     EXIT.                                                        00060000
000610******************************************************************00061000
000620 RPS-ENR-LOCATE-NEXT-REQUEST SECTION.                             00062000
000630 RENRLNR-START.                                                   00063000
000640     MOVE REQ-LOCATE-NEXT TO RPS-ENR-REQ-VERB.                    00064000
000650     PERFORM RPS-ENR-APISERVER.                                   00065000
000660 RENRLNR-EXIT.                                                    00066000
000670     EXIT.                                                        00067000
000680******************************************************************00068000
000690 RPS-ENR-UNLOCK-REQUEST SECTION.                                  00069000
000700 RENRUR-START.                                                    00070000
000710     MOVE REQ-UNLOCK TO RPS-ENR-REQ-VERB.                         00071000
000720     PERFORM RPS-ENR-APISERVER.                                   00072000
000730 RENRUR-EXIT.                                                     00073000
000740     EXIT.                                                        00074000
000750******************************************************************00075000
000760 RPS-ENR-PUT-REQUEST SECTION.                                     00076000
000770 RENRPR-START.                                                    00077000
000780     MOVE WS-UPD-USER TO BPSB-USER.                               00078000
000790     MOVE REQ-PUT TO RPS-ENR-REQ-VERB.                            00079000
000800     PERFORM RPS-ENR-APISERVER.                                   00080000
000810 RENRPR-EXIT.                                                     00081000
000820     EXIT.                                                        00082000
000830******************************************************************00083000
000840 RPS-ENR-REPUT-REQUEST SECTION.                                   00084000
000850 RENRRR-START.                                                    00085000
000860     MOVE WS-UPD-USER TO BPSB-USER.                               00086000
000870     MOVE REQ-REPUT TO RPS-ENR-REQ-VERB.                          00087000
000880     PERFORM RPS-ENR-APISERVER.                                   00088000
000890 RENRRR-EXIT.                                                     00089000
000900     EXIT.                                                        00090000
000910******************************************************************00091000
000920 RPS-ENR-DELETE-REQUEST SECTION.                                  00092000
000930 RENRDR-START.                                                    00093000
000940     MOVE WS-UPD-USER TO BPSB-USER.                               00094000
000950     MOVE REQ-DELETE TO RPS-ENR-REQ-VERB.                         00095000
000960     PERFORM RPS-ENR-APISERVER.                                   00096000
000970 RENRDR-EXIT.                                                     00097000
000980     EXIT.                                                        00098000
000990******************************************************************00099000
001000 RPS-ENR-OPEN-REQUEST SECTION.                                    00100000
001010 RENROR-START.                                                    00101000
001020     MOVE REQ-OPEN TO RPS-ENR-REQ-VERB.                           00102000
001030     PERFORM RPS-ENR-APISERVER.                                   00103000
001040 RENROR-EXIT.                                                     00104000
001050     EXIT.                                                        00105000
001060******************************************************************00106000
001070 RPS-ENR-CLOSE-REQUEST SECTION.                                   00107000
001080 RENRCR-START.                                                    00108000
001090     MOVE REQ-CLOSE TO RPS-ENR-REQ-VERB.                          00109000
001100     PERFORM RPS-ENR-APISERVER.                                   00110000
001110 RENRCR-EXIT.                                                     00111000
001120     EXIT.                                                        00112000
001130******************************************************************00113000
001140 RPS-ENR-GLOBAL-CLOSE-REQUEST SECTION.                            00114000
001150 RENRGCR-START.                                                   00115000
001160     MOVE REQ-GLOBAL-CLOSE TO RPS-ENR-REQ-VERB.                   00116000
001170     PERFORM RPS-ENR-APISERVER.                                   00117000
001180 RENRGCR-EXIT.                                                    00118000
001190     EXIT.                                                        00119000
001200******************************************************************00120000
001210 RPS-ENR-GLOBAL-COMMIT-REQUEST SECTION.                           00121000
001220 RENRGCMR-START.                                                  00122000
001230     MOVE REQ-GLOBAL-COMMIT TO RPS-ENR-REQ-VERB.                  00123000
001240     PERFORM RPS-ENR-APISERVER.                                   00124000
001250 RENRGCMR-EXIT.                                                   00125000
001260     EXIT.                                                        00126000
001270******************************************************************00127000
001280 RPS-ENR-GLOBAL-ABORT-REQUEST SECTION.                            00128000
001290 RENRGAR-START.                                                   00129000
001300     MOVE REQ-GLOBAL-ABORT TO RPS-ENR-REQ-VERB.                   00130000
001310     PERFORM RPS-ENR-APISERVER.                                   00131000
001320 RENRGAR-EXIT.                                                    00132000
001330     EXIT.                                                        00133000
001340******************************************************************00134000
001350 RPS-ENR-APISERVER SECTION.                                       00135000
001360 RPSENRSRV-START.                                                 00136000
001370     MOVE 'IPRP' TO SRB-APPL-ID.                                  00137000
001380     MOVE SR-APIPROGLIT TO SRB-PROG-ID.                           00138000
001390     MOVE RPS-RLSE-LIT TO SRB-RELEASE.                            00139000
001400     MOVE SPACE TO WS-FUNCTION.                                   00140000
001410     MOVE MIC-MST-APPL-ORG TO RPS-ENR-ORG-ID.                     00141000
001420     CALL 'BISDBS' USING                                          00142000
001430         BICRPSB                                                  00143000
001440         BICRSRB                                                  00144000
001450         RPS-ENR-RDBS                                             00145000
001460         RPENR-RECORD                                             00146000
001470         RPS-ENR-PARM.                                            00147000
001480     IF RPS-ENR-STAT IS EQUAL TO STAT-OK                          00148000
001490         MOVE ' ' TO WS-FUNCTION                                  00149000
001500         GO TO RPSENRSRV-EXIT.                                    00150000
001510     IF RPS-ENR-STAT IS EQUAL TO STAT-RES1                        00151000
001520         MOVE 'C' TO WS-FUNCTION                                  00152000
001530         GO TO RPSENRSRV-EXIT.                                    00153000
001540     IF RPS-ENR-STAT IS EQUAL TO STAT-RES2                        00154000
001550         MOVE 'F' TO WS-FUNCTION                                  00155000
001560         GO TO RPSENRSRV-EXIT.                                    00156000
001570     IF RPS-ENR-STAT IS EQUAL TO STAT-LOG1                        00157000
001580         AND RPS-ENR-REQ-VERB IS EQUAL TO REQ-OPEN                00158000
001590         MOVE SPACE TO WS-FUNCTION                                00159000
001600         MOVE STAT-OK TO RPS-ENR-STAT                             00160000
001610         GO TO RPSENRSRV-EXIT.                                    00161000
001620     IF RPS-ENR-STAT IS EQUAL TO STAT-END                         00162000
001630         MOVE 'E' TO WS-FUNCTION                                  00163000
001640         GO TO RPSENRSRV-EXIT.                                    00164000
001650     IF RPS-ENR-STAT IS EQUAL TO STAT-KEY                         00165000
001660         AND RPS-ENR-REQ-VERB IS EQUAL TO REQ-PUT                 00166000
001670         MOVE '=' TO WS-FUNCTION                                  00167000
001680         GO TO RPSENRSRV-EXIT.                                    00168000
001690     IF RPS-ENR-STAT IS EQUAL TO STAT-KEY                         00169000
001700         AND (RPS-ENR-REQ-VERB IS EQUAL TO REQ-GET-GE             00170000
001710         OR RPS-ENR-REQ-VERB IS EQUAL TO REQ-GET-GE-LOCK)         00171000
001720         MOVE 'E' TO WS-FUNCTION                                  00172000
001730         GO TO RPSENRSRV-EXIT.                                    00173000
001740     IF RPS-ENR-STAT IS EQUAL TO STAT-KEY                         00174000
001750         MOVE 'N' TO WS-FUNCTION                                  00175000
001760         GO TO RPSENRSRV-EXIT.                                    00176000
001770     IF RPS-ENR-STAT IS EQUAL TO STAT-CONC                        00177000
001780         OR RPS-ENR-STAT IS EQUAL TO STAT-LOG1                    00178000
001790         OR RPS-ENR-STAT IS EQUAL TO STAT-LOG2                    00179000
001800         OR RPS-ENR-STAT IS EQUAL TO STAT-LOG3                    00180000
001810         OR RPS-ENR-STAT IS EQUAL TO STAT-LOG6                    00181000
001820         OR RPS-ENR-STAT IS EQUAL TO STAT-LOG7                    00182000
001830         OR RPS-ENR-STAT IS EQUAL TO STAT-LOG8                    00183000
001840         OR RPS-ENR-STAT IS EQUAL TO STAT-LOG9                    00184000
001850         MOVE 'O' TO WS-FUNCTION                                  00185000
001860         GO TO RPSENRSRV-EXIT.                                    00186000
001870     MOVE 'X' TO WS-FUNCTION.                                     00187000
001880 RPSENRSRV-EXIT.                                                  00188000
001890     EXIT.                                                        00189000
001900******************************************************************00190000
