000010*01  RPAUT4-RECORD.                                               00001000
000020     03  RPAUT4-CUST-GRP.                                         00002000
000030         05  RPAUT4-CUST-INST    PIC 9(04).                       00003000
000040         05  RPAUT4-CUST-TYPE    PIC X(01).                       00004000
000050         05  RPAUT4-CUST.                                         00005000
000060             07  RPAUT4-ALPHA    PIC X(14).                       00006000
000070             07  RPAUT4-ACCUM    PIC 9(03).                       00007000
000080             07  RPAUT4-TIEBRKR  PIC 9(04).                       00008000
000090     03  RPAUT4-ACCT-GRP.                                         00009000
000100         05  RPAUT4-INST         PIC 9(04).                       00010000
000110         05  RPAUT4-PRODCODE     PIC X(06).                       00011000
000120         05  RPAUT4-ACCT         PIC X(18).                       00012000
000130     03  RPAUT4-REL-GRP.                                          00013000
000140         05  RPAUT4-PRIM-FLAG    PIC 9(01).                       00014000
000150         05  RPAUT4-REL-NBR      PIC 9(02).                       00015000
000160     03  RPAUT4-DATA.                                             00016000
000170         05  RPAUT4-APPL         PIC 9(02).                       00017000
000180         05  RPAUT4-RELNBR       PIC 9(02).                       00018000
000190         05  RPAUT4-RPOPTION     PIC X(01).                       00019000
000200     03  RPAUT4-INTERFACE-DATA.                                   00020000
000210         05  RPAUT4-USER-INFO.                                    00021000
000220             07  RPAUT4-APPL-STATUS                               00022000
000230                                 PIC X(02).                       00023000
000240             07  RPAUT4-BRANCH   PIC S9(05).                      00024000
000250             07  RPAUT4-ACCT-TYPE                                 00025000
000260                                 PIC S9(03).                      00026000
000270             07  RPAUT4-TERM     PIC S9(03).                      00027000
000280             07  RPAUT4-AUTO-DEBIT                                00028000
000290                                 PIC X(01).                       00029000
000300             07  RPAUT4-DEL-DAYS                                  00030000
000310                                 PIC S9(03).                      00031000
000320             07  RPAUT4-RCODE    PIC X(01).                       00032000
000330             07  RPAUT4-CREDIT-RATING                             00033000
000340                                 PIC X(05).                       00034000
000350             07  RPAUT4-MDORM    PIC X(01).                       00035000
000360             07  RPAUT4-MBLOCK   PIC X(01).                       00036000
000370             07  RPAUT4-RESERVE1                                  00037000
000380                                 PIC X(25).                       00038000
000390         05  RPAUT4-MISC-INFO.                                    00039000
000400             07  RPAUT4-OFFICER1                                  00040000
000410                                 PIC X(09).                       00041000
000420             07  RPAUT4-OFFICER2                                  00042000
000430                                 PIC X(09).                       00043000
000440             07  RPAUT4-COSTC    PIC S9(05).                      00044000
000450             07  RPAUT4-SCNXT    PIC S9(09)      COMP-3.          00045000
000460             07  RPAUT4-USEROPT1                                  00046000
000470                                 PIC X(01).                       00047000
000480             07  RPAUT4-USEROPT2                                  00048000
000490                                 PIC X(01).                       00049000
000500             07  RPAUT4-USEROPT3                                  00050000
000510                                 PIC X(01).                       00051000
000520             07  RPAUT4-USEROPT4                                  00052000
000530                                 PIC X(01).                       00053000
000540             07  RPAUT4-RESERVE2                                  00054000
000550                                 PIC X(21).                       00055000
000560         05  RPAUT4-BAL-INFO.                                     00056000
000570             07  RPAUT4-CURBAL   PIC S9(13)V99   COMP-3.          00057000
000580             07  RPAUT4-CURCUSTCOL                                00058000
000590                                 PIC S9(13)V99   COMP-3.          00059000
000600             07  RPAUT4-CURBANKCOL                                00060000
000610                                 PIC S9(13)V99   COMP-3.          00061000
000620             07  RPAUT4-LOWBAL   PIC S9(13)V99   COMP-3.          00062000
000630             07  RPAUT4-AVGBAL   PIC S9(13)V99   COMP-3.          00063000
000640             07  RPAUT4-AVGCOLBAL                                 00064000
000650                                 PIC S9(13)V99   COMP-3.          00065000
000660             07  RPAUT4-COMMAMT  PIC S9(13)V99   COMP-3.          00066000
000670             07  RPAUT4-CREDIT-LIMIT                              00067000
000680                                 PIC S9(13)V99   COMP-3.          00068000
000690             07  RPAUT4-RSVBAL1  PIC S9(13)V99   COMP-3.          00069000
000700             07  RPAUT4-RSVBAL2  PIC S9(13)V99   COMP-3.          00070000
000710             07  RPAUT4-RSVBAL3  PIC S9(13)V99   COMP-3.          00071000
000720             07  RPAUT4-RSVBAL4  PIC S9(13)V99   COMP-3.          00072000
000730             07  RPAUT4-RSVBAL5  PIC S9(13)V99   COMP-3.          00073000
000740             07  RPAUT4-RSVBAL6  PIC S9(13)V99   COMP-3.          00074000
000750             07  RPAUT4-RSVBAL7  PIC S9(13)V99   COMP-3.          00075000
000760             07  RPAUT4-USRBAL1  PIC S9(13)V99   COMP-3.          00076000
000770             07  RPAUT4-USRBAL2  PIC S9(13)V99   COMP-3.          00077000
000780             07  RPAUT4-USRBAL3  PIC S9(13)V99   COMP-3.          00078000
000790             07  RPAUT4-USRBAL4  PIC S9(13)V99   COMP-3.          00079000
000800             07  RPAUT4-USRBAL5  PIC S9(13)V99   COMP-3.          00080000
000810         05  RPAUT4-BAL-INFOX                                     00081000
000820                         REDEFINES RPAUT4-BAL-INFO.               00082000
000830             07  RPAUT4-BAL      PIC S9(13)V99   COMP-3           00083000
000840                                                 OCCURS 20.       00084000
000850         05  RPAUT4-RESERVE3     PIC X(50).                       00085000
000860******************************************************************00086000
