000010*01  RPAUT2-RECORD.                                               00001000
000020     03  RPAUT2-CUST-GRP.                                         00002000
000030         05  RPAUT2-CUST-INST    PIC 9(04).                       00003000
000040         05  RPAUT2-CUST-TYPE    PIC X(01).                       00004000
000050         05  RPAUT2-CUST.                                         00005000
000060             07  RPAUT2-ALPHA    PIC X(14).                       00006000
000070             07  RPAUT2-ACCUM    PIC 9(03).                       00007000
000080             07  RPAUT2-TIEBRKR  PIC 9(04).                       00008000
000090     03  RPAUT2-ACCT-GRP.                                         00009000
000100         05  RPAUT2-INST         PIC 9(04).                       00010000
000110         05  RPAUT2-PRODCODE     PIC X(06).                       00011000
000120         05  RPAUT2-ACCT         PIC X(18).                       00012000
000130     03  RPAUT2-REL-GRP.                                          00013000
000140         05  RPAUT2-PRIM-FLAG    PIC 9(01).                       00014000
000150         05  RPAUT2-REL-NBR      PIC 9(02).                       00015000
000160******************************************************************00016000
