000010*01  RPAUT1-RECORD.                                               00001000
000020     03  RPAUT1-ACCT-GRP.                                         00002000
000030         05  RPAUT1-INST         PIC 9(04).                       00003000
000040         05  RPAUT1-PRODCODE     PIC X(06).                       00004000
000050         05  RPAUT1-ACCT         PIC X(18).                       00005000
000060******************************************************************00006000
