000010*01  RPAUTO-RECORD.                                               00001000
000020     03  RPAUTO-CUST-GRP.                                         00002000
000030         05  RPAUTO-CUST-INST    PIC 9(04).                       00003000
000040         05  RPAUTO-CUST-TYPE    PIC X(01).                       00004000
000050         05  RPAUTO-CUST.                                         00005000
000060             07  RPAUTO-ALPHA    PIC X(14).                       00006000
000070             07  RPAUTO-ACCUM    PIC 9(03).                       00007000
000080             07  RPAUTO-TIEBRKR  PIC 9(04).                       00008000
000090     03  RPAUTO-ACCT-GRP.                                         00009000
000100         05  RPAUTO-INST         PIC 9(04).                       00010000
000110         05  RPAUTO-PRODCODE     PIC X(06).                       00011000
000120         05  RPAUTO-ACCT         PIC X(18).                       00012000
000130******************************************************************00013000
