000010*01  RPAUT3-RECORD.                                               00001000
000020     03  RPAUT3-ACCT-GRP.                                         00002000
000030         05  RPAUT3-INST         PIC 9(04).                       00003000
000040         05  RPAUT3-APPL         PIC 9(02).                       00004000
000050         05  RPAUT3-ACCT         PIC X(18).                       00005000
000060     03  RPAUT3-REL-GRP.                                          00006000
000070         05  RPAUT3-PRIM-FLAG    PIC 9(01).                       00007000
000080         05  RPAUT3-REL-NBR      PIC 9(02).                       00008000
000090     03  RPAUT3-CUST-GRP.                                         00009000
000100         05  RPAUT3-CUST-INST    PIC 9(04).                       00010000
000110         05  RPAUT3-CUST-TYPE    PIC X(01).                       00011000
000120         05  RPAUT3-CUST.                                         00012000
000130             07  RPAUT3-ALPHA    PIC X(14).                       00013000
000140             07  RPAUT3-ACCUM    PIC 9(03).                       00014000
000150             07  RPAUT3-TIEBRKR  PIC 9(04).                       00015000
000160     03  RPAUT3-DATA.                                             00016000
000170         05  RPAUT3-PRODCODE     PIC X(06).                       00017000
000180         05  RPAUT3-RELNBR       PIC 9(02).                       00018000
000190         05  RPAUT3-RPOPTION     PIC X(01).                       00019000
000200******************************************************************00020000
