000010*01  RPEVT01-MESSAGE.                                             00001000
000020*----------------------------------------------------------------*00002000
000030*    RPSEVT01 - RPS EVENT INQUIRY MESSAGE AREA                   *00003000
000040******************************************************************00004000
000050     03  RPEVT01-GRP-RECORD.                                      00005000
000060         05  RPEVT01-RECORD.                                      00006000
000070             07  RPEVT01-GRP-KEY.                                 00007000
000080                 09  RPEVT01-KEY-ACCT1-GRP.                       00008000
000090                     11  RPEVT01-KEY-INST                         00009000
000100                                 PIC 9(04).                       00010000
000110                     11  RPEVT01-KEY-PRODCODE                     00011000
000120                                 PIC X(06).                       00012000
000130                     11  RPEVT01-KEY-ACCOUNT                      00013000
000140                                 PIC X(18).                       00014000
000150                 09  RPEVT01-KEY-DATE                             00015000
000160                                 PIC 9(08).                       00016000
000170                 09  RPEVT01-KEY-ACCT2-GRP.                       00017000
000180                     11  RPEVT01-KEY-INST2                        00018000
000190                                 PIC 9(04).                       00019000
000200                     11  RPEVT01-KEY-PRODCODE2                    00020000
000210                                 PIC X(06).                       00021000
000220                     11  RPEVT01-KEY-ACCOUNT2                     00022000
000230                                 PIC X(18).                       00023000
000240                     11  RPEVT01-KEY-MODEL2                       00024000
000250                                 PIC X(10).                       00025000
000260                 09  RPEVT01-KEY-SEQ                              00026000
000270                                 PIC 9(03).                       00027000
000280             07  RPEVT01-AUDIT-STAMP.                             00028000
000290                 09  RPEVT01-UPD-DATE                             00029000
000300                                 PIC S9(09)      COMP-3.          00030000
000310                 09  RPEVT01-UPD-TIME                             00031000
000320                                 PIC S9(09)      COMP-3.          00032000
000330                 09  RPEVT01-UPD-USER                             00033000
000340                                 PIC X(08).                       00034000
000350                 09  RPEVT01-UPD-ORG                              00035000
000360                                 PIC X(06).                       00036000
000370*----------------------------------------------------------------*00037000
000380             07  RPEVT01-GRP-DATA.                                00038000
000390                 09  RPEVT01-IDNUMBER                             00039000
000400                                 PIC X(18).                       00040000
000410                 09  RPEVT01-EVENT-CODE                           00041000
000420                                 PIC X(02).                       00042000
000430                 09  RPEVT01-SC-INC-OPTION                        00043000
000440                                 PIC X(01).                       00044000
000450                 09  RPEVT01-SC-INC-QUAL                          00045000
000460                                 PIC X(01).                       00046000
000470                 09  RPEVT01-DISCOUNT-AMOUNT                      00047000
000480                                 PIC S9(09)V9(02).                00048000
000490                 09  RPEVT01-DISCOUNT-PERCENT                     00049000
000500                                 PIC SV9(05).                     00050000
000510                 09  RPEVT01-RATE-INC-OPTION                      00051000
000520                                 PIC X(01).                       00052000
000530                 09  RPEVT01-RATE-INC-QUAL                        00053000
000540                                 PIC X(01).                       00054000
000550                 09  RPEVT01-RATE-OPTION                          00055000
000560                                 PIC X(01).                       00056000
000570                 09  RPEVT01-RATE-TYPE                            00057000
P0035                                  PIC X(11).                       00058000
000590                 09  RPEVT01-RATE-PERCENT                         00059000
000600                                 PIC SV9(09).                     00060000
000610                 09  RPEVT01-EVENT-DATE                           00061000
000620                                 PIC X(10).                       00062000
000630     03  RPEVT01-MISC-DATA.                                       00063000
000640         05  RPEVT01-RATOPT                                       00064000
000650                                 PIC X(01).                       00065000
000660         05  RPEVT01-RATTYP                                       00066000
000670                                 PIC X(10).                       00067000
000680         05  RPEVT01-MODEL-TYPE                                   00068000
000690                                 PIC X(10).                       00069000
000700         05  RPEVT01-MODEL-DESC                                   00070000
000710                                 PIC X(50).                       00071000
000720         05  RPEVT01-KEY-SDATE   PIC 9(08).                       00072000
000730         05  RPEVT01-MESSAGEEXP  PIC X(40).                       00073000
000740         05  RPEVT01-EVENTEXP    PIC X(40).                       00074000
000750         05  RPEVT01-MODULEEXP   PIC X(40).                       00075000
000760         05  RPEVT01-SELECT-RTN  PIC X(01).                       00076000
000770         05  RPEVT01-OCCUR       PIC S9(03)      COMP-3.          00077000
000780         05  RPEVT01-CUST-TYPE   PIC X(01).                       00078000
000790         05  RPEVT01-CUST-NAME   PIC X(40).                       00079000
000800         05  RPEVT01-MODEL-FOUND PIC X(10).                       00080000
000810         05  RPEVT01-MODEL-AREA  PIC X(20).                       00081000
000820         05  RPEVT01-REL-STATUS  PIC X(01).                       00082000
000830         05  RPEVT01-SC-OPTION   PIC X(01).                       00083000
000840         05  RPEVT01-RATE-AREA   PIC X(01).                       00084000
000850         05  RPEVT01-REQUEST     PIC X(03).                       00085000
000860         05  RPEVT01-RELKEY.                                      00086000
000870             07  RPEVT01-INST2                                    00087000
000880                                 PIC X(04).                       00088000
000890             07  RPEVT01-PRODCODE2                                00089000
000900                                 PIC X(06).                       00090000
000910             07  RPEVT01-ACCOUNT2                                 00091000
000920                                 PIC X(18).                       00092000
000930             07  RPEVT01-MODEL2                                   00093000
000940                                 PIC X(10).                       00094000
000950         05  RPEVT01-FIRST-KEY   PIC X(77).                       00095000
000960         05  RPEVT01-THIS-KEY    PIC X(77).                       00096000
000970         05  RPEVT01-PREV-KEY    PIC X(77).                       00097000
000980         05  RPEVT01-PF7END      PIC X(01).                       00098000
000990         05  RPEVT01-PF8END      PIC X(01).                       00099000
001000         05  RPEVT01-PAGING-CONTROLS.                             00100000
001010             07  RPEVT01-SUB     PIC S9(04)      COMP-3.          00101000
001020             07  RPEVT01-CURPAGE PIC S9(04)      COMP-3.          00102000
001030             07  RPEVT01-PAGES-TO-READ                            00103000
001040                                 PIC S9(04)      COMP-3.          00104000
001050******************************************************************00105000
001060*       END RPS EVENT INQUIRY    MESSAGE AREA (01)               *00106000
001070******************************************************************00107000
