000010* REL=5.0                                                         00001000
000020*    DESC=EVENT HISTORY                                           00002000
000030*    PROD=RPS WU=EVT0                                             00003000
000040*    LDB=BKI136                                                   00004000
000050*    RELATED=XXX,XXX                                              00005000
000060*    RECOVERY=YES                                                 00006000
000070*                                                                 00007000
000080*01  RPEVT-RECORD.                                                00008000
000090*----------------------------------------------------------------*00009000
000100*    RPSEVT - RP EVENT HISTORY RECORD                      -EVT- *00010000
000110******************************************************************00011000
000120     03  RPEVT-GRP-KEY.                                           00012000
000130         05  RPEVT-ACCT1-GRP.                                     00013000
000140             07  RPEVT-INST      PIC 9(04).                       00014000
000150             07  RPEVT-PRODCODE  PIC X(06).                       00015000
000160             07  RPEVT-ACCOUNT   PIC X(18).                       00016000
000170         05  RPEVT-DATE          PIC 9(08).                       00017000
000180         05  RPEVT-ACCT2-GRP.                                     00018000
000190             07  RPEVT-INST2     PIC 9(04).                       00019000
000200             07  RPEVT-PRODCODE2 PIC X(06).                       00020000
000210             07  RPEVT-ACCOUNT2  PIC X(18).                       00021000
000220             07  RPEVT-MODEL2    PIC X(10).                       00022000
000230         05  RPEVT-SEQ           PIC 9(03).                       00023000
000240*----------------------------------------------------------------*00024000
000250     03  RPEVT-AUDIT-STAMP.                                       00025000
000260         05  RPEVT-UPD-DATE      PIC S9(09)      COMP-3.          00026000
000270         05  RPEVT-UPD-TIME      PIC S9(09)      COMP-3.          00027000
000280         05  RPEVT-UPD-USER      PIC X(08).                       00028000
000290         05  RPEVT-UPD-ORG       PIC X(06).                       00029000
000300*----------------------------------------------------------------*00030000
000310     03  RPEVT-GRP-DATA.                                          00031000
000320         05  RPEVT-EVENT-CODE    PIC 9(02).                       00032000
000330         05  RPEVT-SC-INC-OPTION PIC X(01).                       00033000
000340         05  RPEVT-SC-INC-QUAL   PIC X(01).                       00034000
000350         05  RPEVT-DISCOUNT-AMOUNT                                00035000
000360                                 PIC S9(09)V99   COMP-3.          00036000
000370         05  RPEVT-DISCOUNT-PERCENT                               00037000
000380                                 PIC SV9(05)     COMP-3.          00038000
000390         05  RPEVT-RATE-INC-OPTION                                00039000
000400                                 PIC X(01).                       00040000
000410         05  RPEVT-RATE-INC-QUAL PIC X(01).                       00041000
000420         05  RPEVT-RATE-OPTION   PIC X(01).                       00042000
000430         05  RPEVT-RATE-TYPE     PIC X(01).                       00043000
000440         05  RPEVT-RATE-PERCENT  PIC SV9(09)     COMP-3.          00044000
000450         05  RPEVT-MSGNBR        PIC 9(04).                       00045000
000460         05  RPEVT-IDNUMBER      PIC X(18).                       00046000
000470         05  RPEVT-MODULE        PIC X(08).                       00047000
000480         05  RPEVT-RESERVED      PIC X(11).                       00048000
000490***************************************************************** 00049000
000500*        END  RP EVENT HISTORY (EVT)                              00050000
000510***************************************************************** 00051000
