000010*01  RPEXCP-RECORD.                                               00001000
000020*----------------------------------------------------------------*00002000
000030*  RPSEXCP           RP EXCEPTION RECORD                         *00003000
000040******************************************************************00004000
000050     03  RPEXCP-NAME             PIC X(40).                       00005000
000060     03  RPEXCP-PRIM-ACCT-GRP.                                    00006000
000070         05  RPEXCP-PRIM-INST    PIC 9(04).                       00007000
000080         05  RPEXCP-PRIM-PRODCODE                                 00008000
000090                                 PIC X(06).                       00009000
000100         05  RPEXCP-PRIM-ACCT    PIC X(18).                       00010000
000110     03  RPEXCP-MESSAGE-NBR      PIC 9(05).                       00011000
000120     03  RPEXCP-MESSAGE          PIC X(40).                       00012000
000130*----------------------------------------------------------------*00013000
000140*  RPSEXCP           END OF RP EXCEPTION RECORD                  *00014000
000150******************************************************************00015000
