000010******************************************************************00001000
000020* RPSFM01  INSTITUTION CONTROL CARD                              *00002000
000030******************************************************************00003000
000040*01  RPFM01-RECORD.                                               00004000
000050*----------------------------------------------------------------*00005000
000060     03  RPFM01-KEY.                                              00006000
000070         05  RPFM01-SYSNBR       PIC 9(02).                       00007000
000080         05  RPFM01-INST         PIC 9(04).                       00008000
000090         05  FILLER              PIC X(15).                       00009000
000100         05  RPFM01-FORMNBR      PIC 9(02).                       00010000
000110         05  RPFM01-CRDNBR       PIC 9(02).                       00011000
000120     03  RPFM01-DATA.                                             00012000
000130         05  RPFM01-CURDT        PIC 9(08).                       00013000
000140         05  RPFM01-LPROCDT      PIC 9(08).                       00014000
000150         05  RPFM01-NPROCDTS     PIC 9(08).                       00015000
000160         05  RPFM01-NPROCDTA     PIC 9(08).                       00016000
000170         05  RPFM01-PROCWK.                                       00017000
000180             07  RPFM01-PWDAY    PIC X(01)       OCCURS 7.        00018000
000190         05  RPFM01-PROCOP       PIC X(01).                       00019000
000200         05  RPFM01-INCH         PIC X(01).                       00020000
000210         05  FILLER              PIC X(14).                       00021000
000220*----------------------------------------------------------------*00022000
000230*            END OF INST CONTROL CARD DESCRIPTION                *00023000
000240*----------------------------------------------------------------*00024000
