000010*01  RPINF00-MESSAGE.                                             00001000
000020*----------------------------------------------------------------*00002000
000030*    RPSINF00 - APPLICATION INFERFACE AREA                       *00003000
000040******************************************************************00004000
000050     03  RPINF00-KEY-AREAS.                                       00005000
000060         05  RPINF00-GRP-KEY.                                     00006000
000070             07  RPINF00-INST    PIC 9(04).                       00007000
000080             07  RPINF00-ACCOUNT PIC X(18).                       00008000
000090         05  RPINF00-APPL-INFO.                                   00009000
000100             07  RPINF00-PRODCODE                                 00010000
000110                                 PIC X(06).                       00011000
000120             07  RPINF00-APPLR   PIC 9(02).                       00012000
000130     03  RPINF00-GRP-DATA.                                        00013000
000140         05  RPINF00-USER-INFO.                                   00014000
000150             07  RPINF00-APPL-STATUS                              00015000
000160                                 PIC X(02).                       00016000
000170             07  RPINF00-BRANCH  PIC S9(05).                      00017000
000180             07  RPINF00-ACCT-TYPE                                00018000
000190                                 PIC S9(03).                      00019000
000200             07  RPINF00-TERM    PIC S9(03).                      00020000
000210             07  RPINF00-AUTO-DEBIT                               00021000
000220                                 PIC X(01).                       00022000
000230             07  RPINF00-DEL-DAYS                                 00023000
000240                                 PIC S9(03).                      00024000
000250             07  RPINF00-RCODE   PIC X(01).                       00025000
000260             07  RPINF00-CREDIT-RATING                            00026000
000270                                 PIC X(05).                       00027000
000280             07  RPINF00-MDORM   PIC X(01).                       00028000
000290             07  RPINF00-MBLOCK  PIC X(01).                       00029000
000300             07  RPINF00-INTCODE PIC X(01).                       00030000
000310             07  RPINF00-RESERVE1                                 00031000
000320                                 PIC X(24).                       00032000
000330         05  RPINF00-MISC-INFO.                                   00033000
000340             07  RPINF00-OFFICER1                                 00034000
000350                                 PIC X(09).                       00035000
000360             07  RPINF00-OFFICER2                                 00036000
000370                                 PIC X(09).                       00037000
000380             07  RPINF00-COSTC   PIC S9(05).                      00038000
000390             07  RPINF00-SCNXT   PIC S9(09)      COMP-3.          00039000
000400             07  RPINF00-USEROPT1                                 00040000
000410                                 PIC X(01).                       00041000
000420             07  RPINF00-USEROPT2                                 00042000
000430                                 PIC X(01).                       00043000
000440             07  RPINF00-USEROPT3                                 00044000
000450                                 PIC X(01).                       00045000
000460             07  RPINF00-USEROPT4                                 00046000
000470                                 PIC X(01).                       00047000
000480             07  RPINF00-RESERVE2                                 00048000
000490                                 PIC X(21).                       00049000
000500         05  RPINF00-BAL-INFO.                                    00050000
000510             07  RPINF00-CURBAL  PIC S9(13)V99   COMP-3.          00051000
000520             07  RPINF00-CURCUSTCOL                               00052000
000530                                 PIC S9(13)V99   COMP-3.          00053000
000540             07  RPINF00-CURBANKCOL                               00054000
000550                                 PIC S9(13)V99   COMP-3.          00055000
000560             07  RPINF00-LOWBAL  PIC S9(13)V99   COMP-3.          00056000
000570             07  RPINF00-AVGBAL  PIC S9(13)V99   COMP-3.          00057000
000580             07  RPINF00-AVGCOLBAL                                00058000
000590                                 PIC S9(13)V99   COMP-3.          00059000
000600             07  RPINF00-COMMAMT PIC S9(13)V99   COMP-3.          00060000
000610             07  RPINF00-CREDIT-LIMIT                             00061000
000620                                 PIC S9(13)V99   COMP-3.          00062000
000630             07  RPINF00-RSVBAL1 PIC S9(13)V99   COMP-3.          00063000
000640             07  RPINF00-RSVBAL2 PIC S9(13)V99   COMP-3.          00064000
000650             07  RPINF00-RSVBAL3 PIC S9(13)V99   COMP-3.          00065000
000660             07  RPINF00-RSVBAL4 PIC S9(13)V99   COMP-3.          00066000
000670             07  RPINF00-RSVBAL5 PIC S9(13)V99   COMP-3.          00067000
000680             07  RPINF00-RSVBAL6 PIC S9(13)V99   COMP-3.          00068000
000690             07  RPINF00-RSVBAL7 PIC S9(13)V99   COMP-3.          00069000
000700             07  RPINF00-USRBAL1 PIC S9(13)V99   COMP-3.          00070000
000710             07  RPINF00-USRBAL2 PIC S9(13)V99   COMP-3.          00071000
000720             07  RPINF00-USRBAL3 PIC S9(13)V99   COMP-3.          00072000
000730             07  RPINF00-USRBAL4 PIC S9(13)V99   COMP-3.          00073000
000740             07  RPINF00-USRBAL5 PIC S9(13)V99   COMP-3.          00074000
000750         05  RPINF00-BAL-INFOX                                    00075000
000760                         REDEFINES RPINF00-BAL-INFO.              00076000
000770             07  RPINF00-BAL     PIC S9(13)V99   COMP-3           00077000
000780                                                 OCCURS 20.       00078000
000790         05  RPINF00-RESERVE3    PIC X(50).                       00079000
000800     03  RPINF00-MISC-DATA.                                       00080000
000810         05  RPINF00-CLOSEDACCTOPT                                00081000
000820                                 PIC X(01).                       00082000
000830         05  RPINF00-STATUS      PIC X(01).                       00083000
000840***************************************************************** 00084000
000850*        END  RP APPLICATION INFERFACE AREA                     * 00085000
000860***************************************************************** 00086000
