000010* REL=5.0                                                         00001000
000020*    DESC=RELATIONSHIP INTERFACE                                  00002000
000030*    PROD=RPS WU=INT0                                             00003000
000040*    LDB=BKI136                                                   00004000
000050*    RELATED=XXX,XXX                                              00005000
000060*    RECOVERY=YES                                                 00006000
000070*                                                                 00007000
000080*01  RPINT-RECORD.                                                00008000
000090*----------------------------------------------------------------*00009000
000100*    RPSINT - RP RELATIONSHIP INTERFACE WAREHOUSE          -INT- *00010000
000110******************************************************************00011000
000120     03  RPINT-GRP-KEY.                                           00012000
000130         05  RPINT-ACCT1-GRP.                                     00013000
000140             07  RPINT-INST      PIC 9(04).                       00014000
000150             07  RPINT-PRODCODE  PIC X(06).                       00015000
000160             07  RPINT-ACCOUNT   PIC X(18).                       00016000
000170             07  RPINT-MODEL     PIC X(10).                       00017000
000180         05  RPINT-ACCT2-GRP.                                     00018000
000190             07  RPINT-INST2     PIC 9(04).                       00019000
000200             07  RPINT-PRODCODE2 PIC X(06).                       00020000
000210             07  RPINT-ACCOUNT2  PIC X(18).                       00021000
000220*----------------------------------------------------------------*00022000
000230     03  RPINT-AUDIT-STAMP.                                       00023000
000240         05  RPINT-UPD-DATE      PIC S9(09)      COMP-3.          00024000
000250         05  RPINT-UPD-TIME      PIC S9(09)      COMP-3.          00025000
000260         05  RPINT-UPD-USER      PIC X(08).                       00026000
000270         05  RPINT-UPD-ORG       PIC X(06).                       00027000
000280*----------------------------------------------------------------*00028000
000290     03  RPINT-GRP-DATA.                                          00029000
000300         05  RPINT-ACCT-STATUS   PIC X(01).                       00030000
000310         05  RPINT-USER-INFO.                                     00031000
000320             07  RPINT-APPL-STATUS                                00032000
000330                                 PIC X(02).                       00033000
000340             07  RPINT-BRANCH    PIC S9(05).                      00034000
000350             07  RPINT-ACCT-TYPE PIC S9(03).                      00035000
000360             07  RPINT-TERM      PIC S9(05).                      00036000
000370             07  RPINT-AUTO-DEBIT                                 00037000
000380                                 PIC X(01).                       00038000
000390             07  RPINT-DEL-DAYS  PIC S9(03).                      00039000
000400             07  RPINT-RCODE     PIC X(01).                       00040000
000410             07  RPINT-CREDIT-RATING                              00041000
000420                                 PIC X(05).                       00042000
000430             07  RPINT-MDORM     PIC X(01).                       00043000
000440             07  RPINT-MBLOCK    PIC X(01).                       00044000
000450             07  RPINT-RESERVE1  PIC X(25).                       00045000
000460         05  RPINT-MISC-INFO.                                     00046000
000470             07  RPINT-OFFICER1  PIC X(09).                       00047000
000480             07  RPINT-OFFICER2  PIC X(09).                       00048000
000490             07  RPINT-COSTC     PIC S9(05).                      00049000
000500             07  RPINT-SCNXT     PIC S9(09)      COMP-3.          00050000
000510             07  RPINT-USEROPT1  PIC X(01).                       00051000
000520             07  RPINT-USEROPT2  PIC X(01).                       00052000
000530             07  RPINT-USEROPT3  PIC X(01).                       00053000
000540             07  RPINT-USEROPT4  PIC X(01).                       00054000
000550             07  RPINT-RESERVE2  PIC X(21).                       00055000
000560         05  RPINT-BAL-INFO.                                      00056000
000570             07  RPINT-CURBAL    PIC S9(13)V99   COMP-3.          00057000
000580             07  RPINT-CURCUSTCOL                                 00058000
000590                                 PIC S9(13)V99   COMP-3.          00059000
000600             07  RPINT-CURBANKCOL                                 00060000
000610                                 PIC S9(13)V99   COMP-3.          00061000
000620             07  RPINT-LOWBAL    PIC S9(13)V99   COMP-3.          00062000
000630             07  RPINT-AVGBAL    PIC S9(13)V99   COMP-3.          00063000
000640             07  RPINT-AVGCOLBAL PIC S9(13)V99   COMP-3.          00064000
000650             07  RPINT-COMMAMT   PIC S9(13)V99   COMP-3.          00065000
000660             07  RPINT-CREDIT-LIMIT                               00066000
000670                                 PIC S9(13)V99   COMP-3.          00067000
000680             07  RPINT-RSVBAL1   PIC S9(13)V99   COMP-3.          00068000
000690             07  RPINT-RSVBAL2   PIC S9(13)V99   COMP-3.          00069000
000700             07  RPINT-RSVBAL3   PIC S9(13)V99   COMP-3.          00070000
000710             07  RPINT-RSVBAL4   PIC S9(13)V99   COMP-3.          00071000
000720             07  RPINT-RSVBAL5   PIC S9(13)V99   COMP-3.          00072000
000730             07  RPINT-RSVBAL6   PIC S9(13)V99   COMP-3.          00073000
000740             07  RPINT-RSVBAL7   PIC S9(13)V99   COMP-3.          00074000
000750             07  RPINT-USRBAL1   PIC S9(13)V99   COMP-3.          00075000
000760             07  RPINT-USRBAL2   PIC S9(13)V99   COMP-3.          00076000
000770             07  RPINT-USRBAL3   PIC S9(13)V99   COMP-3.          00077000
000780             07  RPINT-USRBAL4   PIC S9(13)V99   COMP-3.          00078000
000790             07  RPINT-USRBAL5   PIC S9(13)V99   COMP-3.          00079000
000800         05  RPINT-BAL-INFOX                                      00080000
000810                         REDEFINES RPINT-BAL-INFO.                00081000
000820             07  RPINT-BAL       PIC S9(13)V99   COMP-3           00082000
000830                                                 OCCURS 20.       00083000
000840         05  RPINT-RESERVE3      PIC X(23).                       00084000
000850***************************************************************** 00085000
000860*        END  RP RELATIONSHIP INTERFACE WAREHOUSE RECORD (INT)    00086000
000870***************************************************************** 00087000
