000010* REL=5.0                                                         00001000
000020*    DESC=RELATIONSHIP ID XREF                                    00002000
000030*    PROD=RPS WU=IDX0                                             00003000
000040*    LDB=BKI136                                                   00004000
000050*    RELATED=XXX,XXX                                              00005000
000060*    RECOVERY=YES                                                 00006000
000070*                                                                 00007000
000080*01  RPIDX-RECORD.                                                00008000
000090*----------------------------------------------------------------*00009000
000100*    RPSIDX - RP RELATIONSHIP ID XREF RECORD               -IDX- *00010000
000110******************************************************************00011000
000120     03  RPIDX-GRP-KEY.                                           00012000
000130         05  RPIDX-INST          PIC 9(04).                       00013000
000140         05  RPIDX-PRODCODE      PIC X(06).                       00014000
000150         05  RPIDX-IDNUMBER      PIC X(18).                       00015000
000160*----------------------------------------------------------------*00016000
000170     03  RPIDX-AUDIT-STAMP.                                       00017000
000180         05  RPIDX-UPD-DATE      PIC S9(09)      COMP-3.          00018000
000190         05  RPIDX-UPD-TIME      PIC S9(09)      COMP-3.          00019000
000200         05  RPIDX-UPD-USER      PIC X(08).                       00020000
000210         05  RPIDX-UPD-ORG       PIC X(06).                       00021000
000220*----------------------------------------------------------------*00022000
000230     03  RPIDX-GRP-DATA.                                          00023000
000240         05  RPIDX-ACCT2-KEY.                                     00024000
000250             07  RPIDX-INST2     PIC 9(04).                       00025000
000260             07  RPIDX-PRODCODE2 PIC X(06).                       00026000
000270             07  RPIDX-ACCT2     PIC X(18).                       00027000
000280             07  RPIDX-MODEL2    PIC X(10).                       00028000
000290         05  RPIDX-RCIF-STATUS   PIC X(01).                       00029000
000300         05  RPIDX-RESERVED      PIC X(19).                       00030000
000310***************************************************************** 00031000
000320*        END  RP RELATIONSHIP ID XREF RECORD (IDX)                00032000
000330***************************************************************** 00033000
