000010*01  RPRPTO-RECORD.                                               00001000
000020     03  RPRPTO-INST             PIC 9(04).                       00002000
000030     03  RPRPTO-RECID-2-LOG      PIC X(03).                       00003000
000040     03  RPRPTO-KEY-LINED.                                        00004000
000050         05  FILLER              PIC X(12).                       00005000
000060         05  RPRPTO-ACCOUNT      PIC X(18).                       00006000
P0048          05  FILLER              PIC X(42).                       00007000
000080     03  RPRPTO-DATE-AUDIT       PIC 9(09).                       00008000
000090     03  RPRPTO-TIME-AUDIT       PIC 9(09).                       00009000
000100     03  RPRPTO-UNIQUE           PIC 9(05).                       00010000
000110     03  RPRPTO-AMTT-MISSING     PIC X(01).                       00011000
000120     03  RPRPTO-RECNAME          PIC X(30).                       00012000
000130     03  RPRPTO-FLDNAME          PIC X(15).                       00013000
000140     03  RPRPTO-NEW-RECORD       PIC X(01).                       00014000
000150     03  RPRPTO-ENTRYTYPE        PIC X(01).                       00015000
000160     03  RPRPTO-FUNCTION         PIC X(01).                       00016000
000170     03  RPRPTO-UPD-USER         PIC X(08).                       00017000
000180     03  RPRPTO-OLDED            PIC X(80).                       00018000
000190     03  RPRPTO-NEWED            PIC X(80).                       00019000
000200     03  RPRPTO-PLINE            PIC X(132).                      00020000
000210     03  RPRPTO-PRODCODE         PIC X(06).                       00021000
000220     03  RPRPTO-ACCTNBR          PIC X(18).                       00022000
000230     03  RPRPTO-MODEL            PIC X(10).                       00023000
000240     03  RPRPTO-APPEND-DATA.                                      00024000
000250         05  RPRPTO-ADES         PIC X(01).                       00025000
000260         05  RPRPTO-PRVMNTDT     PIC 9(09).                       00026000
P0048      03  FILLER                  PIC X(08).                       00027000
