000010*01  RPRF21-MESSAGE.                                              00001000
000020*----------------------------------------------------------------*00002000
000030*  RPSRF21           RCIF INTERFACE MESSAGE                      *00003000
000040******************************************************************00004000
000050     03  RPRF21-BASE-ACCOUNT.                                     00005000
000060         05  RPRF21-BASE-ACCT-INST                                00006000
000070                                 PIC 9(04).                       00007000
000080         05  RPRF21-BASE-ACCT-PRODCODE                            00008000
000090                                 PIC X(06).                       00009000
000100         05  RPRF21-BASE-ACCT    PIC X(18).                       00010000
000110     03  RPRF21-ACCT-ALT-INST    PIC 9(04).                       00011000
000120     03  RPRF21-RESERVED1        PIC X(02).                       00012000
000130*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *00013000
000140     03  RPRF21-BASE-CUSTOMER    PIC X(26).                       00014000
000150     03  RPRF21-BASE-RCIF-KEY                                     00015000
000160                         REDEFINES RPRF21-BASE-CUSTOMER.          00016000
000170         05  RPRF21-BASE-CUST-INST                                00017000
000180                                 PIC 9(04).                       00018000
000190         05  RPRF21-BASE-CUST-TYPE                                00019000
000200                                 PIC X(01).                       00020000
000210         05  RPRF21-BASE-CUST.                                    00021000
000220             07  RPRF21-BASE-ALPHA                                00022000
000230                                 PIC X(14).                       00023000
000240             07  RPRF21-BASE-ACCUM                                00024000
000250                                 PIC 9(03).                       00025000
000260             07  RPRF21-BASE-TIEBRKR                              00026000
000270                                 PIC 9(04).                       00027000
000280     03  RPRF21-RESERVED2        PIC X(04).                       00028000
000290* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -  *00029000
000300     03  RPRF21-REL              PIC 9(02).                       00030000
000310     03  RPRF21-NAME             PIC X(40).                       00031000
000320     03  RPRF21-RPS-PRODCD       PIC X(06).                       00032000
000330     03  RPRF21-IDNBR            PIC 9(18).                       00033000
P0011      03  RPRF21-CLOSEDACCTOPT    PIC X(01).                       00034000
P0011      03  RPRF21-CUST-NO          PIC 9(13).                       00034290
000350*----------------------------------------------------------------*00035000
000360     03  RPRF21-RETURNED-OBJECT  PIC X(1000).                     00036000
000370******************************************************************00037000
