000010******************************************************************00001000
000020* RPSTRNW  RP TRANSACTION WORK RECORD                            *00002000
000030******************************************************************00003000
000040*01  RPTRNW-RECORD.                                               00004000
000050*----------------------------------------------------------------*00005000
000060     03  RPTRNW-KEY.                                              00006000
000070         05  RPTRNW-ACCT-KEY.                                     00007000
000080             07  RPTRNW-INST     PIC 9(04).                       00008000
000090             07  RPTRNW-PRODCODE PIC X(06).                       00009000
000100             07  RPTRNW-ACCOUNT  PIC 9(18).                       00010000
000110         05  RPTRNW-EXTC         PIC 9(04).                       00011000
000120         05  RPTRNW-ITC          PIC X(04).                       00012000
000130*----------------------------------------------------------------*00013000
000140     03  RPTRNW-DATA.                                             00014000
000150         05  RPTRNW-AMOUNT       PIC S9(11)V99   COMP-3.          00015000
000160*----------------------------------------------------------------*00016000
000170*          END OF RP TRANSACTION WORK RECORD DESCRIPTION         *00017000
000180*----------------------------------------------------------------*00018000
