000010*01  RPXXX02-MESSAGE.                                             00001000
000020*----------------------------------------------------------------*00002000
000030*    RPSXXX02 - RPS RELATIONSHIP NEW MESSAGE AREA                *00003000
000040******************************************************************00004000
000050     03  RPXXX02-MISC-DATA.                                       00005000
000060         05  RPXXX02-KEY-RECORD.                                  00006000
000070             07  RPXXX02-KEY-INST                                 00007000
000080                                 PIC 9(04).                       00008000
000090             07  RPXXX02-KEY-PRODCODE                             00009000
000100                                 PIC X(06).                       00010000
000110             07  RPXXX02-KEY-ACCOUNT                              00011000
000120                                 PIC X(18).                       00012000
000130             07  RPXXX02-KEY-MODEL                                00013000
000140                                 PIC X(10).                       00014000
000150         05  RPXXX02-MODEL-DESC  PIC X(20).                       00015000
000160         05  RPXXX02-RP-PRODCODE PIC X(06).                       00016000
000170         05  RPXXX02-CUST-NAME   PIC X(40).                       00017000
000180         05  RPXXX02-CUST-KEY    PIC X(26).                       00018000
000190         05  RPXXX02-BRANCH      PIC S9(05)      COMP-3.          00019000
000200         05  RPXXX02-ACCT-TYPE   PIC S9(03)      COMP-3.          00020000
000210         05  RPXXX02-IDNUMBER    PIC 9(18).                       00021000
000220         05  RPXXX02-IDNBR-CHANGE                                 00022000
000230                                 PIC X(01).                       00023000
000240         05  RPXXX02-ENROLL-ATTEMPTS                              00024000
000250                                 PIC 9(02).                       00025000
P0070          05  RPXXX02-EXPIRATION-DATE                              00025300
P0070                                  PIC 9(08).                       00025600
000260******************************************************************00026000
000270*       END RPS QUALIFICATION RECORD MESSAGE AREA (00)           *00027000
000280******************************************************************00028000
