000010*01  RPXXX04-MESSAGE.                                             00001000
000020*----------------------------------------------------------------*00002000
000030*    RPSXXX04 - RPS OUTSIDE RELATIONSHIP MESSAGE AREA            *00003000
000040******************************************************************00004000
000050     03  RPXXX04-DCHG.                                            00005000
000060         05  RPXXX04-DCHG-GRP                    OCCURS 10 TIMES. 00006000
000070             07  RPXXX04-INST2-DCHG                               00007000
000080                                 PIC X(01).                       00008000
000090             07  RPXXX04-PRODCODE-DCHG                            00009000
000100                                 PIC X(01).                       00010000
000110             07  RPXXX04-ACCOUNT-DCHG                             00011000
000120                                 PIC X(01).                       00012000
000130     03  RPXXX04-MISC-DATA.                                       00013000
000140         05  RPXXX04-KEY-RECORD.                                  00014000
000150             07  RPXXX04-KEY-INST                                 00015000
000160                                 PIC 9(04).                       00016000
000170             07  RPXXX04-KEY-PRODCODE                             00017000
000180                                 PIC X(06).                       00018000
000190             07  RPXXX04-KEY-ACCOUNT                              00019000
000200                                 PIC X(18).                       00020000
000210             07  RPXXX04-KEY-MODEL                                00021000
000220                                 PIC X(10).                       00022000
000230         05  RPXXX04-KEY-IDNUMBER                                 00023000
000240                                 PIC 9(18).                       00024000
000250         05  RPXXX04-MODEL-DESC  PIC X(20).                       00025000
000260         05  RPXXX04-RP-PRODCODE PIC X(06).                       00026000
000270         05  RPXXX04-CUST-TYPE   PIC X(01).                       00027000
000280         05  RPXXX04-CUST-NAME   PIC X(40).                       00028000
000290         05  RPXXX04-KEY-BRANCH  PIC S9(05)      COMP-3.          00029000
000300         05  RPXXX04-KEY-ACCT-TYPE                                00030000
000310                                 PIC S9(03)      COMP-3.          00031000
000320         05  RPXXX04-IDNUMBER    PIC 9(18).                       00032000
000330         05  RPXXX04-KEY-INCOPT  PIC X(01).                       00033000
000340         05  RPXXX04-KEY-RTOPT   PIC X(01).                       00034000
000350         05  RPXXX04-KEY-APPL    PIC 9(02).                       00035000
000360         05  RPXXX04-IDNBR-CHANGE                                 00036000
000370                                 PIC X(01).                       00037000
000380         05  RPXXX04-GRP-DATA.                                    00038000
000390             07  RPXXX04-GRP-ENTRIES             OCCURS 10 TIMES. 00039000
000400                     11  RPXXX04-ACCT-GRP.                        00040000
000410                         13  RPXXX04-INST2                        00041000
000420                                 PIC X(04).                       00042000
000430                         13  RPXXX04-PRODCODE                     00043000
000440                                 PIC X(06).                       00044000
000450                         13  RPXXX04-ACCOUNT                      00045000
000460                                 PIC X(18).                       00046000
000470                 09  RPXXX04-ACCT-TYPE                            00047000
000480                                 PIC S9(03)      COMP-3.          00048000
000490                 09  RPXXX04-BRANCH                               00049000
000500                                 PIC S9(05)      COMP-3.          00050000
000510                 09  RPXXX04-2023-APPL                            00051000
000520                                 PIC 9(02).                       00052000
000530                 09  RPXXX04-SECSCINCOPT                          00053000
000540                                 PIC X(01).                       00054000
000550                 09  RPXXX04-SECRATEINCOPT                        00055000
000560                                 PIC X(01).                       00056000
000570******************************************************************00057000
000580*       END RPS QUALIFICATION RECORD MESSAGE AREA (00)           *00058000
000590******************************************************************00059000
