000010*01  RPXXX03-MESSAGE.                                             00001000
000020*----------------------------------------------------------------*00002000
000030*    RPSXXX03 - RPS RELATIONSHIP MAINTENANCE MESSAGE AREA        *00003000
000040******************************************************************00004000
000050     03  RPXXX03-DCHG.                                            00005000
000060         05  RPXXX03-DCHG-GRP.                                    00006000
000070             07  RPXXX03-DELETE-DCHG                              00007000
000080                                 PIC X(01).                       00008000
000090             07  RPXXX03-ACTION-GRP-DCHG         OCCURS 08 TIMES. 00009000
000100                 09 RPXXX03-ACTION-DCHG                           00010000
000110                                 PIC X(01).                       00011000
000120     03  RPXXX03-MISC-DATA.                                       00012000
000130         05  RPXXX03-OCCUR       PIC 9(04)       COMP.            00013000
000140         05  RPXXX03-SELECT-RTN  PIC X(01).                       00014000
000150         05  RPXXX03-KEY-RECORD.                                  00015000
000160             07  RPXXX03-KEY-ACCT1-GRP.                           00016000
000170                 09  RPXXX03-KEY-INST                             00017000
000180                                 PIC 9(04).                       00018000
000190                 09  RPXXX03-KEY-PRODCODE                         00019000
000200                                 PIC X(06).                       00020000
000210                 09  RPXXX03-KEY-ACCOUNT                          00021000
000220                                 PIC X(18).                       00022000
000230                 09  RPXXX03-KEY-MODEL                            00023000
000240                                 PIC X(10).                       00024000
000250             07  RPXXX03-KEY-ACCT2-GRP.                           00025000
000260                 09  RPXXX03-KEY-INST2                            00026000
000270                                 PIC 9(04).                       00027000
000280                 09  RPXXX03-KEY-PRODCODE2                        00028000
000290                                 PIC X(06).                       00029000
000300                 09  RPXXX03-KEY-ACCOUNT2                         00030000
000310                                 PIC X(18).                       00031000
000320         05  RPXXX03-RCIF-KEY.                                    00032000
000330             07  RPXXX03-RCIF-CUST-INST                           00033000
000340                                 PIC 9(04).                       00034000
000350             07  RPXXX03-RCIF-CUST-TYPE                           00035000
000360                                 PIC X(01).                       00036000
000370             07  RPXXX03-RCIF-CUST.                               00037000
000380                 09  RPXXX03-RCIF-ALPHA                           00038000
000390                                 PIC X(14).                       00039000
000400                 09  RPXXX03-RCIF-ACCUM                           00040000
000410                                 PIC 9(03).                       00041000
000420                 09  RPXXX03-RCIF-TIEBRKR                         00042000
000430                                 PIC 9(04).                       00043000
000440         05  RPXXX03-FIRST-RCIF-KEY                               00044000
000450                                 PIC X(26).                       00045000
000460         05  RPXXX03-KEY-IDNUMBER                                 00046000
000470                                 PIC 9(18).                       00047000
000480         05  RPXXX03-CUST-NAME   PIC X(40).                       00048000
000490         05  RPXXX03-IDNUMBER    PIC 9(18).                       00049000
000500         05  RPXXX03-REL-STAT    PIC X(01).                       00050000
000510         05  RPXXX03-MODEL-DESC  PIC X(20).                       00051000
000520         05  RPXXX03-EXPIRE-FLAG PIC X(01).                       00052000
000530         05  RPXXX03-CLOSE-FLAG  PIC X(01).                       00053000
000540         05  RPXXX03-PRIM-ONLY   PIC X(01).                       00054000
000550         05  RPXXX03-7104-REL    PIC X(06).                       00055000
000560         05  RPXXX03-OUT-FLAG    PIC X(01).                       00056000
000570         05  RPXXX03-DELETE      PIC X(01).                       00057000
000580         05  RPXXX03-GRP-DATA.                                    00058000
000590             07  RPXXX03-GRP-ENTRIES             OCCURS 09 TIMES. 00059000
000600                 09  RPXXX03-RET-GRP-KEY.                         00060000
000610                     11  RPXXX03-RET-ACCT1-GRP.                   00061000
000620                         13  RPXXX03-RET-INST                     00062000
000630                                 PIC 9(04).                       00063000
000640                         13  RPXXX03-RET-PRODCODE                 00064000
000650                                 PIC X(06).                       00065000
000660                         13  RPXXX03-RET-ACCOUNT                  00066000
000670                                 PIC X(18).                       00067000
000680                         13  RPXXX03-RET-MODEL                    00068000
000690                                 PIC X(10).                       00069000
000700                     11  RPXXX03-RET-ACCT2-GRP.                   00070000
000710                         13  RPXXX03-RET-INST2                    00071000
000720                                 PIC 9(04).                       00072000
000730                         13  RPXXX03-RET-PRODCODE2                00073000
000740                                 PIC X(06).                       00074000
000750                         13  RPXXX03-RET-ACCOUNT2                 00075000
000760                                 PIC X(18).                       00076000
000770                 09  RPXXX03-RET-ACCT-TYPE                        00077000
000780                                 PIC S9(03)      COMP-3.          00078000
000790                 09  RPXXX03-RET-BRANCH                           00079000
000800                                 PIC S9(05)      COMP-3.          00080000
000810                 09  RPXXX03-RET-ACCT-STATUS                      00081000
000820                                 PIC X(01).                       00082000
000830                 09  RPXXX03-RET-APPL                             00083000
000840                                 PIC 9(02).                       00084000
000850                 09  RPXXX03-ACTION                               00085000
000860                                 PIC X(01).                       00086000
000870     03  RPXXX03-PAGING-CONTROLS.                                 00087000
000880         05  RPXXX03-SUB         PIC S9(04)      COMP-3.          00088000
000890         05  RPXXX03-CURPAGE     PIC S9(04)      COMP-3.          00089000
000900         05  RPXXX03-PAGES-TO-READ                                00090000
000910                                 PIC S9(04)      COMP-3.          00091000
000920     03  RPXXX03-ALL             PIC S9(03)      COMP-3           00092000
000930                                                 VALUE ZERO.      00093000
000940     03  RPXXX03-SECONDARY-CUST  PIC S9(03)      COMP-3           00094000
000950                                                 VALUE ZERO.      00095000
000960     03  RPXXX03-SECCUSTNOW      PIC X(01)                        00096000
000970                                                 VALUE SPACE.     00097000
000980     03  RPXXX03-SCSUB           PIC S9(03)      COMP-3           00098000
000990                                                 VALUE ZERO.      00099000
001000     03  RPXXX03-DISP-DATA.                                       00100000
001010         05  RPXXX03-DISP-ENTRIES                OCCURS 50 TIMES. 00101000
001020             07  RPXXX03-DISP-GRP-KEY.                            00102000
001030                 09  RPXXX03-DISP-ACCT-GRP.                       00103000
001040                     11  RPXXX03-DISP-INST                        00104000
001050                                 PIC 9(04).                       00105000
001060                     11  RPXXX03-DISP-PRODCODE                    00106000
001070                                 PIC X(06).                       00107000
001080                     11  RPXXX03-DISP-ACCOUNT                     00108000
001090                                 PIC X(18).                       00109000
001100******************************************************************00110000
001110*       END RPS QUALIFICATION RECORD MESSAGE AREA (00)           *00111000
001120******************************************************************00112000
