000200*01  RPV1101-PANL-DATA-BLOCK.                                     00000200
000300*----------------------------------------------------------------*00000300
000400*    RPV1101W - PANEL DATA BLOCK/AREA                            *00000400
000500*----------------------------------------------------------------*00000500
000600     03  FILLER                  PIC X(08)       VALUE '**BPDB**'.00000600
000700     03  PDB-RPV1101-NAME                                         00000700
000800                                 PIC X(08)       VALUE 'RPV1101 '.00000800
000900     03  PDB-RPV1101-STATUS.                                      00000900
001000         05  PDB-RPV1101-KEY-CHG                                  00001000
001100                                 PIC X(01).                       00001100
001200         05  PDB-RPV1101-DATA-CHG                                 00001200
001300                                 PIC X(01).                       00001300
001400         05  PDB-RPV1101-CURR-OCC                                 00001400
001500                                 PIC S9(04)      COMP             00001500
001600                                                 VALUE +0.        00001600
001700     03  PDB-RPV1101-FIELD-TABLE.                                 00001700
001800         05  PDB-RPV1101-BALANC1                                  00001800
001900                                 PIC X(08)       VALUE 'BALANC1 '.00001900
002000         05  FILLER              PIC S9(04)      COMP             00002000
002100                                                 VALUE +11.       00002100
002200         05  FILLER              PIC S9(04)      COMP             00002200
002300                                                 VALUE +0.        00002300
002400         05  FILLER              PIC S9(04)      COMP             00002400
002500                                                 VALUE +0.        00002500
002600         05  FILLER              PIC X(02)       VALUE 'CD'.      00002600
002700         05  PDB-RPV1101-BALANC1-MASK                             00002700
002800                                 PIC X(01)       VALUE ' '.       00002800
002900         05  PDB-RPV1101-BALANC1-ERROR                            00002900
003000                                 PIC X(01)       VALUE ' '.       00003000
003100         05  PDB-RPV1101-BALANC1-VID                              00003100
003200                                 PIC X(01)       VALUE 'D'.       00003200
003300         05  PDB-RPV1101-BALANC1-EL                               00003300
003400                                 PIC X(01)       VALUE 'N'.       00003400
003500         05  PDB-RPV1101-BALANC1-DCHG                             00003500
003600                                 PIC X(01)       VALUE ' '.       00003600
003700         05  FILLER              PIC X(01)       VALUE ' '.       00003700
003800         05  PDB-RPV1101-RATE1                                    00003800
003900                                 PIC X(08)       VALUE 'RATE1   '.00003900
004000         05  FILLER              PIC S9(04)      COMP             00004000
004100                                                 VALUE +10.       00004100
004200         05  FILLER              PIC S9(04)      COMP             00004200
004300                                                 VALUE +0.        00004300
004400         05  FILLER              PIC S9(04)      COMP             00004400
004500                                                 VALUE +0.        00004500
004600         05  FILLER              PIC X(02)       VALUE 'CD'.      00004600
004700         05  PDB-RPV1101-RATE1-MASK                               00004700
004800                                 PIC X(01)       VALUE ' '.       00004800
004900         05  PDB-RPV1101-RATE1-ERROR                              00004900
005000                                 PIC X(01)       VALUE ' '.       00005000
005100         05  PDB-RPV1101-RATE1-VID                                00005100
005200                                 PIC X(01)       VALUE 'D'.       00005200
005300         05  PDB-RPV1101-RATE1-EL                                 00005300
005400                                 PIC X(01)       VALUE 'N'.       00005400
005500         05  PDB-RPV1101-RATE1-DCHG                               00005500
005600                                 PIC X(01)       VALUE ' '.       00005600
005700         05  FILLER              PIC X(01)       VALUE ' '.       00005700
005800         05  PDB-RPV1101-BALANC2                                  00005800
005900                                 PIC X(08)       VALUE 'BALANC2 '.00005900
006000         05  FILLER              PIC S9(04)      COMP             00006000
006100                                                 VALUE +11.       00006100
006200         05  FILLER              PIC S9(04)      COMP             00006200
006300                                                 VALUE +0.        00006300
006400         05  FILLER              PIC S9(04)      COMP             00006400
006500                                                 VALUE +0.        00006500
006600         05  FILLER              PIC X(02)       VALUE 'CD'.      00006600
006700         05  PDB-RPV1101-BALANC2-MASK                             00006700
006800                                 PIC X(01)       VALUE ' '.       00006800
006900         05  PDB-RPV1101-BALANC2-ERROR                            00006900
007000                                 PIC X(01)       VALUE ' '.       00007000
007100         05  PDB-RPV1101-BALANC2-VID                              00007100
007200                                 PIC X(01)       VALUE 'D'.       00007200
007300         05  PDB-RPV1101-BALANC2-EL                               00007300
007400                                 PIC X(01)       VALUE 'N'.       00007400
007500         05  PDB-RPV1101-BALANC2-DCHG                             00007500
007600                                 PIC X(01)       VALUE ' '.       00007600
007700         05  FILLER              PIC X(01)       VALUE ' '.       00007700
007800         05  PDB-RPV1101-RATE2                                    00007800
007900                                 PIC X(08)       VALUE 'RATE2   '.00007900
008000         05  FILLER              PIC S9(04)      COMP             00008000
008100                                                 VALUE +10.       00008100
008200         05  FILLER              PIC S9(04)      COMP             00008200
008300                                                 VALUE +0.        00008300
008400         05  FILLER              PIC S9(04)      COMP             00008400
008500                                                 VALUE +0.        00008500
008600         05  FILLER              PIC X(02)       VALUE 'CD'.      00008600
008700         05  PDB-RPV1101-RATE2-MASK                               00008700
008800                                 PIC X(01)       VALUE ' '.       00008800
008900         05  PDB-RPV1101-RATE2-ERROR                              00008900
009000                                 PIC X(01)       VALUE ' '.       00009000
009100         05  PDB-RPV1101-RATE2-VID                                00009100
009200                                 PIC X(01)       VALUE 'D'.       00009200
009300         05  PDB-RPV1101-RATE2-EL                                 00009300
009400                                 PIC X(01)       VALUE 'N'.       00009400
009500         05  PDB-RPV1101-RATE2-DCHG                               00009500
009600                                 PIC X(01)       VALUE ' '.       00009600
009700         05  FILLER              PIC X(01)       VALUE ' '.       00009700
009800         05  PDB-RPV1101-BALANC3                                  00009800
009900                                 PIC X(08)       VALUE 'BALANC3 '.00009900
010000         05  FILLER              PIC S9(04)      COMP             00010000
010100                                                 VALUE +11.       00010100
010200         05  FILLER              PIC S9(04)      COMP             00010200
010300                                                 VALUE +0.        00010300
010400         05  FILLER              PIC S9(04)      COMP             00010400
010500                                                 VALUE +0.        00010500
010600         05  FILLER              PIC X(02)       VALUE 'CD'.      00010600
010700         05  PDB-RPV1101-BALANC3-MASK                             00010700
010800                                 PIC X(01)       VALUE ' '.       00010800
010900         05  PDB-RPV1101-BALANC3-ERROR                            00010900
011000                                 PIC X(01)       VALUE ' '.       00011000
011100         05  PDB-RPV1101-BALANC3-VID                              00011100
011200                                 PIC X(01)       VALUE 'D'.       00011200
011300         05  PDB-RPV1101-BALANC3-EL                               00011300
011400                                 PIC X(01)       VALUE 'N'.       00011400
011500         05  PDB-RPV1101-BALANC3-DCHG                             00011500
011600                                 PIC X(01)       VALUE ' '.       00011600
011700         05  FILLER              PIC X(01)       VALUE ' '.       00011700
011800         05  PDB-RPV1101-RATE3                                    00011800
011900                                 PIC X(08)       VALUE 'RATE3   '.00011900
012000         05  FILLER              PIC S9(04)      COMP             00012000
012100                                                 VALUE +10.       00012100
012200         05  FILLER              PIC S9(04)      COMP             00012200
012300                                                 VALUE +0.        00012300
012400         05  FILLER              PIC S9(04)      COMP             00012400
012500                                                 VALUE +0.        00012500
012600         05  FILLER              PIC X(02)       VALUE 'CD'.      00012600
012700         05  PDB-RPV1101-RATE3-MASK                               00012700
012800                                 PIC X(01)       VALUE ' '.       00012800
012900         05  PDB-RPV1101-RATE3-ERROR                              00012900
013000                                 PIC X(01)       VALUE ' '.       00013000
013100         05  PDB-RPV1101-RATE3-VID                                00013100
013200                                 PIC X(01)       VALUE 'D'.       00013200
013300         05  PDB-RPV1101-RATE3-EL                                 00013300
013400                                 PIC X(01)       VALUE 'N'.       00013400
013500         05  PDB-RPV1101-RATE3-DCHG                               00013500
013600                                 PIC X(01)       VALUE ' '.       00013600
013700         05  FILLER              PIC X(01)       VALUE ' '.       00013700
013800         05  PDB-RPV1101-BALANC4                                  00013800
013900                                 PIC X(08)       VALUE 'BALANC4 '.00013900
014000         05  FILLER              PIC S9(04)      COMP             00014000
014100                                                 VALUE +11.       00014100
014200         05  FILLER              PIC S9(04)      COMP             00014200
014300                                                 VALUE +0.        00014300
014400         05  FILLER              PIC S9(04)      COMP             00014400
014500                                                 VALUE +0.        00014500
014600         05  FILLER              PIC X(02)       VALUE 'CD'.      00014600
014700         05  PDB-RPV1101-BALANC4-MASK                             00014700
014800                                 PIC X(01)       VALUE ' '.       00014800
014900         05  PDB-RPV1101-BALANC4-ERROR                            00014900
015000                                 PIC X(01)       VALUE ' '.       00015000
015100         05  PDB-RPV1101-BALANC4-VID                              00015100
015200                                 PIC X(01)       VALUE 'D'.       00015200
015300         05  PDB-RPV1101-BALANC4-EL                               00015300
015400                                 PIC X(01)       VALUE 'N'.       00015400
015500         05  PDB-RPV1101-BALANC4-DCHG                             00015500
015600                                 PIC X(01)       VALUE ' '.       00015600
015700         05  FILLER              PIC X(01)       VALUE ' '.       00015700
015800         05  PDB-RPV1101-RATE4                                    00015800
015900                                 PIC X(08)       VALUE 'RATE4   '.00015900
016000         05  FILLER              PIC S9(04)      COMP             00016000
016100                                                 VALUE +10.       00016100
016200         05  FILLER              PIC S9(04)      COMP             00016200
016300                                                 VALUE +0.        00016300
016400         05  FILLER              PIC S9(04)      COMP             00016400
016500                                                 VALUE +0.        00016500
016600         05  FILLER              PIC X(02)       VALUE 'CD'.      00016600
016700         05  PDB-RPV1101-RATE4-MASK                               00016700
016800                                 PIC X(01)       VALUE ' '.       00016800
016900         05  PDB-RPV1101-RATE4-ERROR                              00016900
017000                                 PIC X(01)       VALUE ' '.       00017000
017100         05  PDB-RPV1101-RATE4-VID                                00017100
017200                                 PIC X(01)       VALUE 'D'.       00017200
017300         05  PDB-RPV1101-RATE4-EL                                 00017300
017400                                 PIC X(01)       VALUE 'N'.       00017400
017500         05  PDB-RPV1101-RATE4-DCHG                               00017500
017600                                 PIC X(01)       VALUE ' '.       00017600
017700         05  FILLER              PIC X(01)       VALUE ' '.       00017700
017800         05  PDB-RPV1101-BALANC5                                  00017800
017900                                 PIC X(08)       VALUE 'BALANC5 '.00017900
018000         05  FILLER              PIC S9(04)      COMP             00018000
018100                                                 VALUE +11.       00018100
018200         05  FILLER              PIC S9(04)      COMP             00018200
018300                                                 VALUE +0.        00018300
018400         05  FILLER              PIC S9(04)      COMP             00018400
018500                                                 VALUE +0.        00018500
018600         05  FILLER              PIC X(02)       VALUE 'CD'.      00018600
018700         05  PDB-RPV1101-BALANC5-MASK                             00018700
018800                                 PIC X(01)       VALUE ' '.       00018800
018900         05  PDB-RPV1101-BALANC5-ERROR                            00018900
019000                                 PIC X(01)       VALUE ' '.       00019000
019100         05  PDB-RPV1101-BALANC5-VID                              00019100
019200                                 PIC X(01)       VALUE 'D'.       00019200
019300         05  PDB-RPV1101-BALANC5-EL                               00019300
019400                                 PIC X(01)       VALUE 'N'.       00019400
019500         05  PDB-RPV1101-BALANC5-DCHG                             00019500
019600                                 PIC X(01)       VALUE ' '.       00019600
019700         05  FILLER              PIC X(01)       VALUE ' '.       00019700
019800         05  PDB-RPV1101-RATE5                                    00019800
019900                                 PIC X(08)       VALUE 'RATE5   '.00019900
020000         05  FILLER              PIC S9(04)      COMP             00020000
020100                                                 VALUE +10.       00020100
020200         05  FILLER              PIC S9(04)      COMP             00020200
020300                                                 VALUE +0.        00020300
020400         05  FILLER              PIC S9(04)      COMP             00020400
020500                                                 VALUE +0.        00020500
020600         05  FILLER              PIC X(02)       VALUE 'CD'.      00020600
020700         05  PDB-RPV1101-RATE5-MASK                               00020700
020800                                 PIC X(01)       VALUE ' '.       00020800
020900         05  PDB-RPV1101-RATE5-ERROR                              00020900
021000                                 PIC X(01)       VALUE ' '.       00021000
021100         05  PDB-RPV1101-RATE5-VID                                00021100
021200                                 PIC X(01)       VALUE 'D'.       00021200
021300         05  PDB-RPV1101-RATE5-EL                                 00021300
021400                                 PIC X(01)       VALUE 'N'.       00021400
021500         05  PDB-RPV1101-RATE5-DCHG                               00021500
021600                                 PIC X(01)       VALUE ' '.       00021600
021700         05  FILLER              PIC X(01)       VALUE ' '.       00021700
021800         05  PDB-RPV1101-BALANC6                                  00021800
021900                                 PIC X(08)       VALUE 'BALANC6 '.00021900
022000         05  FILLER              PIC S9(04)      COMP             00022000
022100                                                 VALUE +11.       00022100
022200         05  FILLER              PIC S9(04)      COMP             00022200
022300                                                 VALUE +0.        00022300
022400         05  FILLER              PIC S9(04)      COMP             00022400
022500                                                 VALUE +0.        00022500
022600         05  FILLER              PIC X(02)       VALUE 'CD'.      00022600
022700         05  PDB-RPV1101-BALANC6-MASK                             00022700
022800                                 PIC X(01)       VALUE ' '.       00022800
022900         05  PDB-RPV1101-BALANC6-ERROR                            00022900
023000                                 PIC X(01)       VALUE ' '.       00023000
023100         05  PDB-RPV1101-BALANC6-VID                              00023100
023200                                 PIC X(01)       VALUE 'D'.       00023200
023300         05  PDB-RPV1101-BALANC6-EL                               00023300
023400                                 PIC X(01)       VALUE 'N'.       00023400
023500         05  PDB-RPV1101-BALANC6-DCHG                             00023500
023600                                 PIC X(01)       VALUE ' '.       00023600
023700         05  FILLER              PIC X(01)       VALUE ' '.       00023700
023800         05  PDB-RPV1101-RATE6                                    00023800
023900                                 PIC X(08)       VALUE 'RATE6   '.00023900
024000         05  FILLER              PIC S9(04)      COMP             00024000
024100                                                 VALUE +10.       00024100
024200         05  FILLER              PIC S9(04)      COMP             00024200
024300                                                 VALUE +0.        00024300
024400         05  FILLER              PIC S9(04)      COMP             00024400
024500                                                 VALUE +0.        00024500
024600         05  FILLER              PIC X(02)       VALUE 'CD'.      00024600
024700         05  PDB-RPV1101-RATE6-MASK                               00024700
024800                                 PIC X(01)       VALUE ' '.       00024800
024900         05  PDB-RPV1101-RATE6-ERROR                              00024900
025000                                 PIC X(01)       VALUE ' '.       00025000
025100         05  PDB-RPV1101-RATE6-VID                                00025100
025200                                 PIC X(01)       VALUE 'D'.       00025200
025300         05  PDB-RPV1101-RATE6-EL                                 00025300
025400                                 PIC X(01)       VALUE 'N'.       00025400
025500         05  PDB-RPV1101-RATE6-DCHG                               00025500
025600                                 PIC X(01)       VALUE ' '.       00025600
025700         05  FILLER              PIC X(01)       VALUE ' '.       00025700
025800         05  PDB-RPV1101-BALANC7                                  00025800
025900                                 PIC X(08)       VALUE 'BALANC7 '.00025900
026000         05  FILLER              PIC S9(04)      COMP             00026000
026100                                                 VALUE +11.       00026100
026200         05  FILLER              PIC S9(04)      COMP             00026200
026300                                                 VALUE +0.        00026300
026400         05  FILLER              PIC S9(04)      COMP             00026400
026500                                                 VALUE +0.        00026500
026600         05  FILLER              PIC X(02)       VALUE 'CD'.      00026600
026700         05  PDB-RPV1101-BALANC7-MASK                             00026700
026800                                 PIC X(01)       VALUE ' '.       00026800
026900         05  PDB-RPV1101-BALANC7-ERROR                            00026900
027000                                 PIC X(01)       VALUE ' '.       00027000
027100         05  PDB-RPV1101-BALANC7-VID                              00027100
027200                                 PIC X(01)       VALUE 'D'.       00027200
027300         05  PDB-RPV1101-BALANC7-EL                               00027300
027400                                 PIC X(01)       VALUE 'N'.       00027400
027500         05  PDB-RPV1101-BALANC7-DCHG                             00027500
027600                                 PIC X(01)       VALUE ' '.       00027600
027700         05  FILLER              PIC X(01)       VALUE ' '.       00027700
027800         05  PDB-RPV1101-RATE7                                    00027800
027900                                 PIC X(08)       VALUE 'RATE7   '.00027900
028000         05  FILLER              PIC S9(04)      COMP             00028000
028100                                                 VALUE +10.       00028100
028200         05  FILLER              PIC S9(04)      COMP             00028200
028300                                                 VALUE +0.        00028300
028400         05  FILLER              PIC S9(04)      COMP             00028400
028500                                                 VALUE +0.        00028500
028600         05  FILLER              PIC X(02)       VALUE 'CD'.      00028600
028700         05  PDB-RPV1101-RATE7-MASK                               00028700
028800                                 PIC X(01)       VALUE ' '.       00028800
028900         05  PDB-RPV1101-RATE7-ERROR                              00028900
029000                                 PIC X(01)       VALUE ' '.       00029000
029100         05  PDB-RPV1101-RATE7-VID                                00029100
029200                                 PIC X(01)       VALUE 'D'.       00029200
029300         05  PDB-RPV1101-RATE7-EL                                 00029300
029400                                 PIC X(01)       VALUE 'N'.       00029400
029500         05  PDB-RPV1101-RATE7-DCHG                               00029500
029600                                 PIC X(01)       VALUE ' '.       00029600
029700         05  FILLER              PIC X(01)       VALUE ' '.       00029700
029800         05  PDB-RPV1101-BALANC8                                  00029800
029900                                 PIC X(08)       VALUE 'BALANC8 '.00029900
030000         05  FILLER              PIC S9(04)      COMP             00030000
030100                                                 VALUE +11.       00030100
030200         05  FILLER              PIC S9(04)      COMP             00030200
030300                                                 VALUE +0.        00030300
030400         05  FILLER              PIC S9(04)      COMP             00030400
030500                                                 VALUE +0.        00030500
030600         05  FILLER              PIC X(02)       VALUE 'CD'.      00030600
030700         05  PDB-RPV1101-BALANC8-MASK                             00030700
030800                                 PIC X(01)       VALUE ' '.       00030800
030900         05  PDB-RPV1101-BALANC8-ERROR                            00030900
031000                                 PIC X(01)       VALUE ' '.       00031000
031100         05  PDB-RPV1101-BALANC8-VID                              00031100
031200                                 PIC X(01)       VALUE 'D'.       00031200
031300         05  PDB-RPV1101-BALANC8-EL                               00031300
031400                                 PIC X(01)       VALUE 'N'.       00031400
031500         05  PDB-RPV1101-BALANC8-DCHG                             00031500
031600                                 PIC X(01)       VALUE ' '.       00031600
031700         05  FILLER              PIC X(01)       VALUE ' '.       00031700
031800         05  PDB-RPV1101-RATE8                                    00031800
031900                                 PIC X(08)       VALUE 'RATE8   '.00031900
032000         05  FILLER              PIC S9(04)      COMP             00032000
032100                                                 VALUE +10.       00032100
032200         05  FILLER              PIC S9(04)      COMP             00032200
032300                                                 VALUE +0.        00032300
032400         05  FILLER              PIC S9(04)      COMP             00032400
032500                                                 VALUE +0.        00032500
032600         05  FILLER              PIC X(02)       VALUE 'CD'.      00032600
032700         05  PDB-RPV1101-RATE8-MASK                               00032700
032800                                 PIC X(01)       VALUE ' '.       00032800
032900         05  PDB-RPV1101-RATE8-ERROR                              00032900
033000                                 PIC X(01)       VALUE ' '.       00033000
033100         05  PDB-RPV1101-RATE8-VID                                00033100
033200                                 PIC X(01)       VALUE 'D'.       00033200
033300         05  PDB-RPV1101-RATE8-EL                                 00033300
033400                                 PIC X(01)       VALUE 'N'.       00033400
033500         05  PDB-RPV1101-RATE8-DCHG                               00033500
033600                                 PIC X(01)       VALUE ' '.       00033600
033700         05  FILLER              PIC X(01)       VALUE ' '.       00033700
033800         05  PDB-RPV1101-BALANC9                                  00033800
033900                                 PIC X(08)       VALUE 'BALANC9 '.00033900
034000         05  FILLER              PIC S9(04)      COMP             00034000
034100                                                 VALUE +11.       00034100
034200         05  FILLER              PIC S9(04)      COMP             00034200
034300                                                 VALUE +0.        00034300
034400         05  FILLER              PIC S9(04)      COMP             00034400
034500                                                 VALUE +0.        00034500
034600         05  FILLER              PIC X(02)       VALUE 'CD'.      00034600
034700         05  PDB-RPV1101-BALANC9-MASK                             00034700
034800                                 PIC X(01)       VALUE ' '.       00034800
034900         05  PDB-RPV1101-BALANC9-ERROR                            00034900
035000                                 PIC X(01)       VALUE ' '.       00035000
035100         05  PDB-RPV1101-BALANC9-VID                              00035100
035200                                 PIC X(01)       VALUE 'D'.       00035200
035300         05  PDB-RPV1101-BALANC9-EL                               00035300
035400                                 PIC X(01)       VALUE 'N'.       00035400
035500         05  PDB-RPV1101-BALANC9-DCHG                             00035500
035600                                 PIC X(01)       VALUE ' '.       00035600
035700         05  FILLER              PIC X(01)       VALUE ' '.       00035700
035800         05  PDB-RPV1101-RATE9                                    00035800
035900                                 PIC X(08)       VALUE 'RATE9   '.00035900
036000         05  FILLER              PIC S9(04)      COMP             00036000
036100                                                 VALUE +10.       00036100
036200         05  FILLER              PIC S9(04)      COMP             00036200
036300                                                 VALUE +0.        00036300
036400         05  FILLER              PIC S9(04)      COMP             00036400
036500                                                 VALUE +0.        00036500
036600         05  FILLER              PIC X(02)       VALUE 'CD'.      00036600
036700         05  PDB-RPV1101-RATE9-MASK                               00036700
036800                                 PIC X(01)       VALUE ' '.       00036800
036900         05  PDB-RPV1101-RATE9-ERROR                              00036900
037000                                 PIC X(01)       VALUE ' '.       00037000
037100         05  PDB-RPV1101-RATE9-VID                                00037100
037200                                 PIC X(01)       VALUE 'D'.       00037200
037300         05  PDB-RPV1101-RATE9-EL                                 00037300
037400                                 PIC X(01)       VALUE 'N'.       00037400
037500         05  PDB-RPV1101-RATE9-DCHG                               00037500
037600                                 PIC X(01)       VALUE ' '.       00037600
037700         05  FILLER              PIC X(01)       VALUE ' '.       00037700
037800         05  PDB-RPV1101-BALANC10                                 00037800
037900                                 PIC X(08)       VALUE 'BALANC10'.00037900
038000         05  FILLER              PIC S9(04)      COMP             00038000
038100                                                 VALUE +11.       00038100
038200         05  FILLER              PIC S9(04)      COMP             00038200
038300                                                 VALUE +0.        00038300
038400         05  FILLER              PIC S9(04)      COMP             00038400
038500                                                 VALUE +0.        00038500
038600         05  FILLER              PIC X(02)       VALUE 'CD'.      00038600
038700         05  PDB-RPV1101-BALANC10-MASK                            00038700
038800                                 PIC X(01)       VALUE ' '.       00038800
038900         05  PDB-RPV1101-BALANC10-ERROR                           00038900
039000                                 PIC X(01)       VALUE ' '.       00039000
039100         05  PDB-RPV1101-BALANC10-VID                             00039100
039200                                 PIC X(01)       VALUE 'D'.       00039200
039300         05  PDB-RPV1101-BALANC10-EL                              00039300
039400                                 PIC X(01)       VALUE 'N'.       00039400
039500         05  PDB-RPV1101-BALANC10-DCHG                            00039500
039600                                 PIC X(01)       VALUE ' '.       00039600
039700         05  FILLER              PIC X(01)       VALUE ' '.       00039700
039800         05  PDB-RPV1101-RATE10                                   00039800
039900                                 PIC X(08)       VALUE 'RATE10  '.00039900
040000         05  FILLER              PIC S9(04)      COMP             00040000
040100                                                 VALUE +10.       00040100
040200         05  FILLER              PIC S9(04)      COMP             00040200
040300                                                 VALUE +0.        00040300
040400         05  FILLER              PIC S9(04)      COMP             00040400
040500                                                 VALUE +0.        00040500
040600         05  FILLER              PIC X(02)       VALUE 'CD'.      00040600
040700         05  PDB-RPV1101-RATE10-MASK                              00040700
040800                                 PIC X(01)       VALUE ' '.       00040800
040900         05  PDB-RPV1101-RATE10-ERROR                             00040900
041000                                 PIC X(01)       VALUE ' '.       00041000
041100         05  PDB-RPV1101-RATE10-VID                               00041100
041200                                 PIC X(01)       VALUE 'D'.       00041200
041300         05  PDB-RPV1101-RATE10-EL                                00041300
041400                                 PIC X(01)       VALUE 'N'.       00041400
041500         05  PDB-RPV1101-RATE10-DCHG                              00041500
041600                                 PIC X(01)       VALUE ' '.       00041600
041700         05  FILLER              PIC X(01)       VALUE ' '.       00041700
041800         05  PDB-RPV1101-BALANC11                                 00041800
041900                                 PIC X(08)       VALUE 'BALANC11'.00041900
042000         05  FILLER              PIC S9(04)      COMP             00042000
042100                                                 VALUE +11.       00042100
042200         05  FILLER              PIC S9(04)      COMP             00042200
042300                                                 VALUE +0.        00042300
042400         05  FILLER              PIC S9(04)      COMP             00042400
042500                                                 VALUE +0.        00042500
042600         05  FILLER              PIC X(02)       VALUE 'CD'.      00042600
042700         05  PDB-RPV1101-BALANC11-MASK                            00042700
042800                                 PIC X(01)       VALUE ' '.       00042800
042900         05  PDB-RPV1101-BALANC11-ERROR                           00042900
043000                                 PIC X(01)       VALUE ' '.       00043000
043100         05  PDB-RPV1101-BALANC11-VID                             00043100
043200                                 PIC X(01)       VALUE 'D'.       00043200
043300         05  PDB-RPV1101-BALANC11-EL                              00043300
043400                                 PIC X(01)       VALUE 'N'.       00043400
043500         05  PDB-RPV1101-BALANC11-DCHG                            00043500
043600                                 PIC X(01)       VALUE ' '.       00043600
043700         05  FILLER              PIC X(01)       VALUE ' '.       00043700
043800         05  PDB-RPV1101-RATE11                                   00043800
043900                                 PIC X(08)       VALUE 'RATE11  '.00043900
044000         05  FILLER              PIC S9(04)      COMP             00044000
044100                                                 VALUE +10.       00044100
044200         05  FILLER              PIC S9(04)      COMP             00044200
044300                                                 VALUE +0.        00044300
044400         05  FILLER              PIC S9(04)      COMP             00044400
044500                                                 VALUE +0.        00044500
044600         05  FILLER              PIC X(02)       VALUE 'CD'.      00044600
044700         05  PDB-RPV1101-RATE11-MASK                              00044700
044800                                 PIC X(01)       VALUE ' '.       00044800
044900         05  PDB-RPV1101-RATE11-ERROR                             00044900
045000                                 PIC X(01)       VALUE ' '.       00045000
045100         05  PDB-RPV1101-RATE11-VID                               00045100
045200                                 PIC X(01)       VALUE 'D'.       00045200
045300         05  PDB-RPV1101-RATE11-EL                                00045300
045400                                 PIC X(01)       VALUE 'N'.       00045400
045500         05  PDB-RPV1101-RATE11-DCHG                              00045500
045600                                 PIC X(01)       VALUE ' '.       00045600
045700         05  FILLER              PIC X(01)       VALUE ' '.       00045700
045800         05  PDB-RPV1101-BALANC12                                 00045800
045900                                 PIC X(08)       VALUE 'BALANC12'.00045900
046000         05  FILLER              PIC S9(04)      COMP             00046000
046100                                                 VALUE +11.       00046100
046200         05  FILLER              PIC S9(04)      COMP             00046200
046300                                                 VALUE +0.        00046300
046400         05  FILLER              PIC S9(04)      COMP             00046400
046500                                                 VALUE +0.        00046500
046600         05  FILLER              PIC X(02)       VALUE 'CD'.      00046600
046700         05  PDB-RPV1101-BALANC12-MASK                            00046700
046800                                 PIC X(01)       VALUE ' '.       00046800
046900         05  PDB-RPV1101-BALANC12-ERROR                           00046900
047000                                 PIC X(01)       VALUE ' '.       00047000
047100         05  PDB-RPV1101-BALANC12-VID                             00047100
047200                                 PIC X(01)       VALUE 'D'.       00047200
047300         05  PDB-RPV1101-BALANC12-EL                              00047300
047400                                 PIC X(01)       VALUE 'N'.       00047400
047500         05  PDB-RPV1101-BALANC12-DCHG                            00047500
047600                                 PIC X(01)       VALUE ' '.       00047600
047700         05  FILLER              PIC X(01)       VALUE ' '.       00047700
047800         05  PDB-RPV1101-RATE12                                   00047800
047900                                 PIC X(08)       VALUE 'RATE12  '.00047900
048000         05  FILLER              PIC S9(04)      COMP             00048000
048100                                                 VALUE +10.       00048100
048200         05  FILLER              PIC S9(04)      COMP             00048200
048300                                                 VALUE +0.        00048300
048400         05  FILLER              PIC S9(04)      COMP             00048400
048500                                                 VALUE +0.        00048500
048600         05  FILLER              PIC X(02)       VALUE 'CD'.      00048600
048700         05  PDB-RPV1101-RATE12-MASK                              00048700
048800                                 PIC X(01)       VALUE ' '.       00048800
048900         05  PDB-RPV1101-RATE12-ERROR                             00048900
049000                                 PIC X(01)       VALUE ' '.       00049000
049100         05  PDB-RPV1101-RATE12-VID                               00049100
049200                                 PIC X(01)       VALUE 'D'.       00049200
049300         05  PDB-RPV1101-RATE12-EL                                00049300
049400                                 PIC X(01)       VALUE 'N'.       00049400
049500         05  PDB-RPV1101-RATE12-DCHG                              00049500
049600                                 PIC X(01)       VALUE ' '.       00049600
049700         05  FILLER              PIC X(01)       VALUE ' '.       00049700
049800         05  PDB-RPV1101-BALANC13                                 00049800
049900                                 PIC X(08)       VALUE 'BALANC13'.00049900
050000         05  FILLER              PIC S9(04)      COMP             00050000
050100                                                 VALUE +11.       00050100
050200         05  FILLER              PIC S9(04)      COMP             00050200
050300                                                 VALUE +0.        00050300
050400         05  FILLER              PIC S9(04)      COMP             00050400
050500                                                 VALUE +0.        00050500
050600         05  FILLER              PIC X(02)       VALUE 'CD'.      00050600
050700         05  PDB-RPV1101-BALANC13-MASK                            00050700
050800                                 PIC X(01)       VALUE ' '.       00050800
050900         05  PDB-RPV1101-BALANC13-ERROR                           00050900
051000                                 PIC X(01)       VALUE ' '.       00051000
051100         05  PDB-RPV1101-BALANC13-VID                             00051100
051200                                 PIC X(01)       VALUE 'D'.       00051200
051300         05  PDB-RPV1101-BALANC13-EL                              00051300
051400                                 PIC X(01)       VALUE 'N'.       00051400
051500         05  PDB-RPV1101-BALANC13-DCHG                            00051500
051600                                 PIC X(01)       VALUE ' '.       00051600
051700         05  FILLER              PIC X(01)       VALUE ' '.       00051700
051800         05  PDB-RPV1101-RATE13                                   00051800
051900                                 PIC X(08)       VALUE 'RATE13  '.00051900
052000         05  FILLER              PIC S9(04)      COMP             00052000
052100                                                 VALUE +10.       00052100
052200         05  FILLER              PIC S9(04)      COMP             00052200
052300                                                 VALUE +0.        00052300
052400         05  FILLER              PIC S9(04)      COMP             00052400
052500                                                 VALUE +0.        00052500
052600         05  FILLER              PIC X(02)       VALUE 'CD'.      00052600
052700         05  PDB-RPV1101-RATE13-MASK                              00052700
052800                                 PIC X(01)       VALUE ' '.       00052800
052900         05  PDB-RPV1101-RATE13-ERROR                             00052900
053000                                 PIC X(01)       VALUE ' '.       00053000
053100         05  PDB-RPV1101-RATE13-VID                               00053100
053200                                 PIC X(01)       VALUE 'D'.       00053200
053300         05  PDB-RPV1101-RATE13-EL                                00053300
053400                                 PIC X(01)       VALUE 'N'.       00053400
053500         05  PDB-RPV1101-RATE13-DCHG                              00053500
053600                                 PIC X(01)       VALUE ' '.       00053600
053700         05  FILLER              PIC X(01)       VALUE ' '.       00053700
053800         05  PDB-RPV1101-BALANC14                                 00053800
053900                                 PIC X(08)       VALUE 'BALANC14'.00053900
054000         05  FILLER              PIC S9(04)      COMP             00054000
054100                                                 VALUE +11.       00054100
054200         05  FILLER              PIC S9(04)      COMP             00054200
054300                                                 VALUE +0.        00054300
054400         05  FILLER              PIC S9(04)      COMP             00054400
054500                                                 VALUE +0.        00054500
054600         05  FILLER              PIC X(02)       VALUE 'CD'.      00054600
054700         05  PDB-RPV1101-BALANC14-MASK                            00054700
054800                                 PIC X(01)       VALUE ' '.       00054800
054900         05  PDB-RPV1101-BALANC14-ERROR                           00054900
055000                                 PIC X(01)       VALUE ' '.       00055000
055100         05  PDB-RPV1101-BALANC14-VID                             00055100
055200                                 PIC X(01)       VALUE 'D'.       00055200
055300         05  PDB-RPV1101-BALANC14-EL                              00055300
055400                                 PIC X(01)       VALUE 'N'.       00055400
055500         05  PDB-RPV1101-BALANC14-DCHG                            00055500
055600                                 PIC X(01)       VALUE ' '.       00055600
055700         05  FILLER              PIC X(01)       VALUE ' '.       00055700
055800         05  PDB-RPV1101-RATE14                                   00055800
055900                                 PIC X(08)       VALUE 'RATE14  '.00055900
056000         05  FILLER              PIC S9(04)      COMP             00056000
056100                                                 VALUE +10.       00056100
056200         05  FILLER              PIC S9(04)      COMP             00056200
056300                                                 VALUE +0.        00056300
056400         05  FILLER              PIC S9(04)      COMP             00056400
056500                                                 VALUE +0.        00056500
056600         05  FILLER              PIC X(02)       VALUE 'CD'.      00056600
056700         05  PDB-RPV1101-RATE14-MASK                              00056700
056800                                 PIC X(01)       VALUE ' '.       00056800
056900         05  PDB-RPV1101-RATE14-ERROR                             00056900
057000                                 PIC X(01)       VALUE ' '.       00057000
057100         05  PDB-RPV1101-RATE14-VID                               00057100
057200                                 PIC X(01)       VALUE 'D'.       00057200
057300         05  PDB-RPV1101-RATE14-EL                                00057300
057400                                 PIC X(01)       VALUE 'N'.       00057400
057500         05  PDB-RPV1101-RATE14-DCHG                              00057500
057600                                 PIC X(01)       VALUE ' '.       00057600
057700         05  FILLER              PIC X(01)       VALUE ' '.       00057700
057800         05  PDB-RPV1101-BALANC15                                 00057800
057900                                 PIC X(08)       VALUE 'BALANC15'.00057900
058000         05  FILLER              PIC S9(04)      COMP             00058000
058100                                                 VALUE +11.       00058100
058200         05  FILLER              PIC S9(04)      COMP             00058200
058300                                                 VALUE +0.        00058300
058400         05  FILLER              PIC S9(04)      COMP             00058400
058500                                                 VALUE +0.        00058500
058600         05  FILLER              PIC X(02)       VALUE 'CD'.      00058600
058700         05  PDB-RPV1101-BALANC15-MASK                            00058700
058800                                 PIC X(01)       VALUE ' '.       00058800
058900         05  PDB-RPV1101-BALANC15-ERROR                           00058900
059000                                 PIC X(01)       VALUE ' '.       00059000
059100         05  PDB-RPV1101-BALANC15-VID                             00059100
059200                                 PIC X(01)       VALUE 'D'.       00059200
059300         05  PDB-RPV1101-BALANC15-EL                              00059300
059400                                 PIC X(01)       VALUE 'N'.       00059400
059500         05  PDB-RPV1101-BALANC15-DCHG                            00059500
059600                                 PIC X(01)       VALUE ' '.       00059600
059700         05  FILLER              PIC X(01)       VALUE ' '.       00059700
059800         05  PDB-RPV1101-RATE15                                   00059800
059900                                 PIC X(08)       VALUE 'RATE15  '.00059900
060000         05  FILLER              PIC S9(04)      COMP             00060000
060100                                                 VALUE +10.       00060100
060200         05  FILLER              PIC S9(04)      COMP             00060200
060300                                                 VALUE +0.        00060300
060400         05  FILLER              PIC S9(04)      COMP             00060400
060500                                                 VALUE +0.        00060500
060600         05  FILLER              PIC X(02)       VALUE 'CD'.      00060600
060700         05  PDB-RPV1101-RATE15-MASK                              00060700
060800                                 PIC X(01)       VALUE ' '.       00060800
060900         05  PDB-RPV1101-RATE15-ERROR                             00060900
061000                                 PIC X(01)       VALUE ' '.       00061000
061100         05  PDB-RPV1101-RATE15-VID                               00061100
061200                                 PIC X(01)       VALUE 'D'.       00061200
061300         05  PDB-RPV1101-RATE15-EL                                00061300
061400                                 PIC X(01)       VALUE 'N'.       00061400
061500         05  PDB-RPV1101-RATE15-DCHG                              00061500
061600                                 PIC X(01)       VALUE ' '.       00061600
061700         05  FILLER              PIC X(01)       VALUE ' '.       00061700
061800         05  FILLER              PIC X(08)       VALUE LOW-VALUE. 00061800
061900                                                                  00061900
062000 01  RPV1101-PANL-DATA-AREA.                                      00062000
062100     03  RPV1101-BALANC1         PIC X(11).                       00062100
062200     03  RPV1101-RATE1           PIC X(10).                       00062200
062300     03  RPV1101-BALANC2         PIC X(11).                       00062300
062400     03  RPV1101-RATE2           PIC X(10).                       00062400
062500     03  RPV1101-BALANC3         PIC X(11).                       00062500
062600     03  RPV1101-RATE3           PIC X(10).                       00062600
062700     03  RPV1101-BALANC4         PIC X(11).                       00062700
062800     03  RPV1101-RATE4           PIC X(10).                       00062800
062900     03  RPV1101-BALANC5         PIC X(11).                       00062900
063000     03  RPV1101-RATE5           PIC X(10).                       00063000
063100     03  RPV1101-BALANC6         PIC X(11).                       00063100
063200     03  RPV1101-RATE6           PIC X(10).                       00063200
063300     03  RPV1101-BALANC7         PIC X(11).                       00063300
063400     03  RPV1101-RATE7           PIC X(10).                       00063400
063500     03  RPV1101-BALANC8         PIC X(11).                       00063500
063600     03  RPV1101-RATE8           PIC X(10).                       00063600
063700     03  RPV1101-BALANC9         PIC X(11).                       00063700
063800     03  RPV1101-RATE9           PIC X(10).                       00063800
063900     03  RPV1101-BALANC10        PIC X(11).                       00063900
064000     03  RPV1101-RATE10          PIC X(10).                       00064000
064100     03  RPV1101-BALANC11        PIC X(11).                       00064100
064200     03  RPV1101-RATE11          PIC X(10).                       00064200
064300     03  RPV1101-BALANC12        PIC X(11).                       00064300
064400     03  RPV1101-RATE12          PIC X(10).                       00064400
064500     03  RPV1101-BALANC13        PIC X(11).                       00064500
064600     03  RPV1101-RATE13          PIC X(10).                       00064600
064700     03  RPV1101-BALANC14        PIC X(11).                       00064700
064800     03  RPV1101-RATE14          PIC X(10).                       00064800
064900     03  RPV1101-BALANC15        PIC X(11).                       00064900
065000     03  RPV1101-RATE15          PIC X(10).                       00065000
065100 01  RPV1101-ERROR-FIELD                                          00065100
065200                                 PIC X(08).                       00065200
065300 01  RPV1101-SW-SET-CURSOR                                        00065300
065400                                 PIC X(01)       VALUE 'N'.       00065400
065500******************************************************************00065500
