000010*01  RPV110-PANL-DATA-BLOCK.                                      00001000
000020*----------------------------------------------------------------*00002000
000030*    RPV110W - PANEL DATA BLOCK/AREA                             *00003000
000040*----------------------------------------------------------------*00004000
000050     03  FILLER                  PIC X(08)       VALUE '**BPDB**'.00005000
000060     03  PDB-RPV110-NAME                                          00006000
000070                                 PIC X(08)       VALUE 'RPV110  '.00007000
000080     03  PDB-RPV110-STATUS.                                       00008000
000090         05  PDB-RPV110-KEY-CHG                                   00009000
000100                                 PIC X(01).                       00010000
000110         05  PDB-RPV110-DATA-CHG                                  00011000
000120                                 PIC X(01).                       00012000
000130         05  PDB-RPV110-CURR-OCC                                  00013000
000140                                 PIC S9(04)      COMP             00014000
000150                                                 VALUE +0.        00015000
000160     03  PDB-RPV110-FIELD-TABLE.                                  00016000
000170         05  PDB-RPV110-OPERID                                    00017000
000180                                 PIC X(08)       VALUE 'OPERID  '.00018000
000190         05  FILLER              PIC S9(04)      COMP             00019000
000200                                                 VALUE +8.        00020000
000210         05  FILLER              PIC S9(04)      COMP             00021000
000220                                                 VALUE +0.        00022000
000230         05  FILLER              PIC S9(04)      COMP             00023000
000240                                                 VALUE +0.        00024000
000250         05  FILLER              PIC X(02)       VALUE 'CD'.      00025000
000260         05  PDB-RPV110-OPERID-MASK                               00026000
000270                                 PIC X(01)       VALUE ' '.       00027000
000280         05  PDB-RPV110-OPERID-ERROR                              00028000
000290                                 PIC X(01)       VALUE ' '.       00029000
000300         05  PDB-RPV110-OPERID-VID                                00030000
000310                                 PIC X(01)       VALUE 'D'.       00031000
000320         05  PDB-RPV110-OPERID-EL                                 00032000
000330                                 PIC X(01)       VALUE 'N'.       00033000
000340         05  PDB-RPV110-OPERID-DCHG                               00034000
000350                                 PIC X(01)       VALUE ' '.       00035000
000360         05  FILLER              PIC X(01)       VALUE ' '.       00036000
000370         05  PDB-RPV110-INST                                      00037000
000380                                 PIC X(08)       VALUE 'INST    '.00038000
000390         05  FILLER              PIC S9(04)      COMP             00039000
000400                                                 VALUE +4.        00040000
000410         05  FILLER              PIC S9(04)      COMP             00041000
000420                                                 VALUE +0.        00042000
000430         05  FILLER              PIC S9(04)      COMP             00043000
000440                                                 VALUE +0.        00044000
000450         05  FILLER              PIC X(02)       VALUE 'CD'.      00045000
000460         05  PDB-RPV110-INST-MASK                                 00046000
000470                                 PIC X(01)       VALUE ' '.       00047000
000480         05  PDB-RPV110-INST-ERROR                                00048000
000490                                 PIC X(01)       VALUE ' '.       00049000
000500         05  PDB-RPV110-INST-VID                                  00050000
000510                                 PIC X(01)       VALUE 'D'.       00051000
000520         05  PDB-RPV110-INST-EL                                   00052000
000530                                 PIC X(01)       VALUE 'N'.       00053000
000540         05  PDB-RPV110-INST-DCHG                                 00054000
000550                                 PIC X(01)       VALUE ' '.       00055000
000560         05  FILLER              PIC X(01)       VALUE ' '.       00056000
000570         05  PDB-RPV110-SYSDATE                                   00057000
000580                                 PIC X(08)       VALUE 'SYSDATE '.00058000
000590         05  FILLER              PIC S9(04)      COMP             00059000
000600                                                 VALUE +10.       00060000
000610         05  FILLER              PIC S9(04)      COMP             00061000
000620                                                 VALUE +0.        00062000
000630         05  FILLER              PIC S9(04)      COMP             00063000
000640                                                 VALUE +0.        00064000
000650         05  FILLER              PIC X(02)       VALUE 'CD'.      00065000
000660         05  PDB-RPV110-SYSDATE-MASK                              00066000
000670                                 PIC X(01)       VALUE ' '.       00067000
000680         05  PDB-RPV110-SYSDATE-ERROR                             00068000
000690                                 PIC X(01)       VALUE ' '.       00069000
000700         05  PDB-RPV110-SYSDATE-VID                               00070000
000710                                 PIC X(01)       VALUE 'D'.       00071000
000720         05  PDB-RPV110-SYSDATE-EL                                00072000
000730                                 PIC X(01)       VALUE 'N'.       00073000
000740         05  PDB-RPV110-SYSDATE-DCHG                              00074000
000750                                 PIC X(01)       VALUE ' '.       00075000
000760         05  FILLER              PIC X(01)       VALUE ' '.       00076000
000770         05  PDB-RPV110-MORE                                      00077000
000780                                 PIC X(08)       VALUE 'MORE    '.00078000
000790         05  FILLER              PIC S9(04)      COMP             00079000
000800                                                 VALUE +5.        00080000
000810         05  FILLER              PIC S9(04)      COMP             00081000
000820                                                 VALUE +0.        00082000
000830         05  FILLER              PIC S9(04)      COMP             00083000
000840                                                 VALUE +0.        00084000
000850         05  FILLER              PIC X(02)       VALUE 'CD'.      00085000
000860         05  PDB-RPV110-MORE-MASK                                 00086000
000870                                 PIC X(01)       VALUE ' '.       00087000
000880         05  PDB-RPV110-MORE-ERROR                                00088000
000890                                 PIC X(01)       VALUE ' '.       00089000
000900         05  PDB-RPV110-MORE-VID                                  00090000
000910                                 PIC X(01)       VALUE 'D'.       00091000
000920         05  PDB-RPV110-MORE-EL                                   00092000
000930                                 PIC X(01)       VALUE 'N'.       00093000
000940         05  PDB-RPV110-MORE-DCHG                                 00094000
000950                                 PIC X(01)       VALUE ' '.       00095000
000960         05  FILLER              PIC X(01)       VALUE ' '.       00096000
000970         05  PDB-RPV110-MINUS                                     00097000
000980                                 PIC X(08)       VALUE 'MINUS   '.00098000
000990         05  FILLER              PIC S9(04)      COMP             00099000
001000                                                 VALUE +1.        00100000
001010         05  FILLER              PIC S9(04)      COMP             00101000
001020                                                 VALUE +0.        00102000
001030         05  FILLER              PIC S9(04)      COMP             00103000
001040                                                 VALUE +0.        00104000
001050         05  FILLER              PIC X(02)       VALUE 'CD'.      00105000
001060         05  PDB-RPV110-MINUS-MASK                                00106000
001070                                 PIC X(01)       VALUE ' '.       00107000
001080         05  PDB-RPV110-MINUS-ERROR                               00108000
001090                                 PIC X(01)       VALUE ' '.       00109000
001100         05  PDB-RPV110-MINUS-VID                                 00110000
001110                                 PIC X(01)       VALUE 'D'.       00111000
001120         05  PDB-RPV110-MINUS-EL                                  00112000
001130                                 PIC X(01)       VALUE 'N'.       00113000
001140         05  PDB-RPV110-MINUS-DCHG                                00114000
001150                                 PIC X(01)       VALUE ' '.       00115000
001160         05  FILLER              PIC X(01)       VALUE ' '.       00116000
001170         05  PDB-RPV110-PLUS                                      00117000
001180                                 PIC X(08)       VALUE 'PLUS    '.00118000
001190         05  FILLER              PIC S9(04)      COMP             00119000
001200                                                 VALUE +1.        00120000
001210         05  FILLER              PIC S9(04)      COMP             00121000
001220                                                 VALUE +0.        00122000
001230         05  FILLER              PIC S9(04)      COMP             00123000
001240                                                 VALUE +0.        00124000
001250         05  FILLER              PIC X(02)       VALUE 'CD'.      00125000
001260         05  PDB-RPV110-PLUS-MASK                                 00126000
001270                                 PIC X(01)       VALUE ' '.       00127000
001280         05  PDB-RPV110-PLUS-ERROR                                00128000
001290                                 PIC X(01)       VALUE ' '.       00129000
001300         05  PDB-RPV110-PLUS-VID                                  00130000
001310                                 PIC X(01)       VALUE 'D'.       00131000
001320         05  PDB-RPV110-PLUS-EL                                   00132000
001330                                 PIC X(01)       VALUE 'N'.       00133000
001340         05  PDB-RPV110-PLUS-DCHG                                 00134000
001350                                 PIC X(01)       VALUE ' '.       00135000
001360         05  FILLER              PIC X(01)       VALUE ' '.       00136000
001370         05  PDB-RPV110-PRODCD                                    00137000
001380                                 PIC X(08)       VALUE 'PRODCD  '.00138000
001390         05  FILLER              PIC S9(04)      COMP             00139000
001400                                                 VALUE +6.        00140000
001410         05  FILLER              PIC S9(04)      COMP             00141000
001420                                                 VALUE +0.        00142000
001430         05  FILLER              PIC S9(04)      COMP             00143000
001440                                                 VALUE +0.        00144000
001450         05  FILLER              PIC X(02)       VALUE 'CD'.      00145000
001460         05  PDB-RPV110-PRODCD-MASK                               00146000
001470                                 PIC X(01)       VALUE ' '.       00147000
001480         05  PDB-RPV110-PRODCD-ERROR                              00148000
001490                                 PIC X(01)       VALUE ' '.       00149000
001500         05  PDB-RPV110-PRODCD-VID                                00150000
001510                                 PIC X(01)       VALUE 'D'.       00151000
001520         05  PDB-RPV110-PRODCD-EL                                 00152000
001530                                 PIC X(01)       VALUE 'N'.       00153000
001540         05  PDB-RPV110-PRODCD-DCHG                               00154000
001550                                 PIC X(01)       VALUE ' '.       00155000
001560         05  FILLER              PIC X(01)       VALUE ' '.       00156000
001570         05  PDB-RPV110-ACCOUNT                                   00157000
001580                                 PIC X(08)       VALUE 'ACCOUNT '.00158000
001590         05  FILLER              PIC S9(04)      COMP             00159000
001600                                                 VALUE +18.       00160000
001610         05  FILLER              PIC S9(04)      COMP             00161000
001620                                                 VALUE +0.        00162000
001630         05  FILLER              PIC S9(04)      COMP             00163000
001640                                                 VALUE +0.        00164000
001650         05  FILLER              PIC X(02)       VALUE 'CD'.      00165000
001660         05  PDB-RPV110-ACCOUNT-MASK                              00166000
001670                                 PIC X(01)       VALUE ' '.       00167000
001680         05  PDB-RPV110-ACCOUNT-ERROR                             00168000
001690                                 PIC X(01)       VALUE ' '.       00169000
001700         05  PDB-RPV110-ACCOUNT-VID                               00170000
001710                                 PIC X(01)       VALUE 'D'.       00171000
001720         05  PDB-RPV110-ACCOUNT-EL                                00172000
001730                                 PIC X(01)       VALUE 'N'.       00173000
001740         05  PDB-RPV110-ACCOUNT-DCHG                              00174000
001750                                 PIC X(01)       VALUE ' '.       00175000
001760         05  FILLER              PIC X(01)       VALUE ' '.       00176000
001770         05  PDB-RPV110-QUAL1                                     00177000
001780                                 PIC X(08)       VALUE 'QUAL1   '.00178000
001790         05  FILLER              PIC S9(04)      COMP             00179000
001800                                                 VALUE +18.       00180000
001810         05  FILLER              PIC S9(04)      COMP             00181000
001820                                                 VALUE +0.        00182000
001830         05  FILLER              PIC S9(04)      COMP             00183000
001840                                                 VALUE +0.        00184000
001850         05  FILLER              PIC X(02)       VALUE 'CD'.      00185000
001860         05  PDB-RPV110-QUAL1-MASK                                00186000
001870                                 PIC X(01)       VALUE ' '.       00187000
001880         05  PDB-RPV110-QUAL1-ERROR                               00188000
001890                                 PIC X(01)       VALUE ' '.       00189000
001900         05  PDB-RPV110-QUAL1-VID                                 00190000
001910                                 PIC X(01)       VALUE 'D'.       00191000
001920         05  PDB-RPV110-QUAL1-EL                                  00192000
001930                                 PIC X(01)       VALUE 'I'.       00193000
001940         05  PDB-RPV110-QUAL1-DCHG                                00194000
001950                                 PIC X(01)       VALUE ' '.       00195000
001960         05  FILLER              PIC X(01)       VALUE ' '.       00196000
001970         05  PDB-RPV110-SCAMT                                     00197000
001980                                 PIC X(08)       VALUE 'SCAMT   '.00198000
001990         05  FILLER              PIC S9(04)      COMP             00199000
002000                                                 VALUE +10.       00200000
002010         05  FILLER              PIC S9(04)      COMP             00201000
002020                                                 VALUE +0.        00202000
002030         05  FILLER              PIC S9(04)      COMP             00203000
002040                                                 VALUE +0.        00204000
002050         05  FILLER              PIC X(02)       VALUE 'CD'.      00205000
002060         05  PDB-RPV110-SCAMT-MASK                                00206000
002070                                 PIC X(01)       VALUE ' '.       00207000
002080         05  PDB-RPV110-SCAMT-ERROR                               00208000
002090                                 PIC X(01)       VALUE ' '.       00209000
002100         05  PDB-RPV110-SCAMT-VID                                 00210000
002110                                 PIC X(01)       VALUE 'D'.       00211000
002120         05  PDB-RPV110-SCAMT-EL                                  00212000
002130                                 PIC X(01)       VALUE 'N'.       00213000
002140         05  PDB-RPV110-SCAMT-DCHG                                00214000
002150                                 PIC X(01)       VALUE ' '.       00215000
002160         05  FILLER              PIC X(01)       VALUE ' '.       00216000
002170         05  PDB-RPV110-SCPRCENT                                  00217000
002180                                 PIC X(08)       VALUE 'SCPRCENT'.00218000
002190         05  FILLER              PIC S9(04)      COMP             00219000
002200                                                 VALUE +6.        00220000
002210         05  FILLER              PIC S9(04)      COMP             00221000
002220                                                 VALUE +0.        00222000
002230         05  FILLER              PIC S9(04)      COMP             00223000
002240                                                 VALUE +0.        00224000
002250         05  FILLER              PIC X(02)       VALUE 'CD'.      00225000
002260         05  PDB-RPV110-SCPRCENT-MASK                             00226000
002270                                 PIC X(01)       VALUE ' '.       00227000
002280         05  PDB-RPV110-SCPRCENT-ERROR                            00228000
002290                                 PIC X(01)       VALUE ' '.       00229000
002300         05  PDB-RPV110-SCPRCENT-VID                              00230000
002310                                 PIC X(01)       VALUE 'D'.       00231000
002320         05  PDB-RPV110-SCPRCENT-EL                               00232000
002330                                 PIC X(01)       VALUE 'N'.       00233000
002340         05  PDB-RPV110-SCPRCENT-DCHG                             00234000
002350                                 PIC X(01)       VALUE ' '.       00235000
002360         05  FILLER              PIC X(01)       VALUE ' '.       00236000
002370         05  PDB-RPV110-SCMODEL                                   00237000
002380                                 PIC X(08)       VALUE 'SCMODEL '.00238000
002390         05  FILLER              PIC S9(04)      COMP             00239000
002400                                                 VALUE +10.       00240000
002410         05  FILLER              PIC S9(04)      COMP             00241000
002420                                                 VALUE +0.        00242000
002430         05  FILLER              PIC S9(04)      COMP             00243000
002440                                                 VALUE +0.        00244000
002450         05  FILLER              PIC X(02)       VALUE 'CD'.      00245000
002460         05  PDB-RPV110-SCMODEL-MASK                              00246000
002470                                 PIC X(01)       VALUE ' '.       00247000
002480         05  PDB-RPV110-SCMODEL-ERROR                             00248000
002490                                 PIC X(01)       VALUE ' '.       00249000
002500         05  PDB-RPV110-SCMODEL-VID                               00250000
002510                                 PIC X(01)       VALUE 'D'.       00251000
002520         05  PDB-RPV110-SCMODEL-EL                                00252000
002530                                 PIC X(01)       VALUE 'N'.       00253000
002540         05  PDB-RPV110-SCMODEL-DCHG                              00254000
002550                                 PIC X(01)       VALUE ' '.       00255000
002560         05  FILLER              PIC X(01)       VALUE ' '.       00256000
002570         05  PDB-RPV110-QUAL2                                     00257000
002580                                 PIC X(08)       VALUE 'QUAL2   '.00258000
002590         05  FILLER              PIC S9(04)      COMP             00259000
002600                                                 VALUE +18.       00260000
002610         05  FILLER              PIC S9(04)      COMP             00261000
002620                                                 VALUE +0.        00262000
002630         05  FILLER              PIC S9(04)      COMP             00263000
002640                                                 VALUE +0.        00264000
002650         05  FILLER              PIC X(02)       VALUE 'CD'.      00265000
002660         05  PDB-RPV110-QUAL2-MASK                                00266000
002670                                 PIC X(01)       VALUE ' '.       00267000
002680         05  PDB-RPV110-QUAL2-ERROR                               00268000
002690                                 PIC X(01)       VALUE ' '.       00269000
002700         05  PDB-RPV110-QUAL2-VID                                 00270000
002710                                 PIC X(01)       VALUE 'D'.       00271000
002720         05  PDB-RPV110-QUAL2-EL                                  00272000
002730                                 PIC X(01)       VALUE 'I'.       00273000
002740         05  PDB-RPV110-QUAL2-DCHG                                00274000
002750                                 PIC X(01)       VALUE ' '.       00275000
002760         05  FILLER              PIC X(01)       VALUE ' '.       00276000
002770         05  PDB-RPV110-RTRATE                                    00277000
002780                                 PIC X(08)       VALUE 'RTRATE  '.00278000
002790         05  FILLER              PIC S9(04)      COMP             00279000
002800                                                 VALUE +10.       00280000
002810         05  FILLER              PIC S9(04)      COMP             00281000
002820                                                 VALUE +0.        00282000
002830         05  FILLER              PIC S9(04)      COMP             00283000
002840                                                 VALUE +0.        00284000
002850         05  FILLER              PIC X(02)       VALUE 'CD'.      00285000
002860         05  PDB-RPV110-RTRATE-MASK                               00286000
002870                                 PIC X(01)       VALUE ' '.       00287000
002880         05  PDB-RPV110-RTRATE-ERROR                              00288000
002890                                 PIC X(01)       VALUE ' '.       00289000
002900         05  PDB-RPV110-RTRATE-VID                                00290000
002910                                 PIC X(01)       VALUE 'D'.       00291000
002920         05  PDB-RPV110-RTRATE-EL                                 00292000
002930                                 PIC X(01)       VALUE 'N'.       00293000
002940         05  PDB-RPV110-RTRATE-DCHG                               00294000
002950                                 PIC X(01)       VALUE ' '.       00295000
002960         05  FILLER              PIC X(01)       VALUE ' '.       00296000
002970         05  PDB-RPV110-QUAL25                                    00297000
002980                                 PIC X(08)       VALUE 'QUAL25  '.00298000
002990         05  FILLER              PIC S9(04)      COMP             00299000
003000                                                 VALUE +25.       00300000
003010         05  FILLER              PIC S9(04)      COMP             00301000
003020                                                 VALUE +0.        00302000
003030         05  FILLER              PIC S9(04)      COMP             00303000
003040                                                 VALUE +0.        00304000
003050         05  FILLER              PIC X(02)       VALUE 'CD'.      00305000
003060         05  PDB-RPV110-QUAL25-MASK                               00306000
003070                                 PIC X(01)       VALUE ' '.       00307000
003080         05  PDB-RPV110-QUAL25-ERROR                              00308000
003090                                 PIC X(01)       VALUE ' '.       00309000
003100         05  PDB-RPV110-QUAL25-VID                                00310000
003110                                 PIC X(01)       VALUE 'D'.       00311000
003120         05  PDB-RPV110-QUAL25-EL                                 00312000
003130                                 PIC X(01)       VALUE 'I'.       00313000
003140         05  PDB-RPV110-QUAL25-DCHG                               00314000
003150                                 PIC X(01)       VALUE ' '.       00315000
003160         05  FILLER              PIC X(01)       VALUE ' '.       00316000
003170         05  PDB-RPV110-RATTYPE                                   00317000
003180                                 PIC X(08)       VALUE 'RATTYPE '.00318000
003190         05  FILLER              PIC S9(04)      COMP             00319000
003200                                                 VALUE +16.       00320000
003210         05  FILLER              PIC S9(04)      COMP             00321000
003220                                                 VALUE +0.        00322000
003230         05  FILLER              PIC S9(04)      COMP             00323000
003240                                                 VALUE +0.        00324000
003250         05  FILLER              PIC X(02)       VALUE 'CD'.      00325000
003260         05  PDB-RPV110-RATTYPE-MASK                              00326000
003270                                 PIC X(01)       VALUE ' '.       00327000
003280         05  PDB-RPV110-RATTYPE-ERROR                             00328000
003290                                 PIC X(01)       VALUE ' '.       00329000
003300         05  PDB-RPV110-RATTYPE-VID                               00330000
003310                                 PIC X(01)       VALUE 'D'.       00331000
003320         05  PDB-RPV110-RATTYPE-EL                                00332000
003330                                 PIC X(01)       VALUE 'N'.       00333000
003340         05  PDB-RPV110-RATTYPE-DCHG                              00334000
003350                                 PIC X(01)       VALUE ' '.       00335000
003360         05  FILLER              PIC X(01)       VALUE ' '.       00336000
003370         05  PDB-RPV110-RATMODL                                   00337000
003380                                 PIC X(08)       VALUE 'RATMODL '.00338000
003390         05  FILLER              PIC S9(04)      COMP             00339000
003400                                                 VALUE +10.       00340000
003410         05  FILLER              PIC S9(04)      COMP             00341000
003420                                                 VALUE +0.        00342000
003430         05  FILLER              PIC S9(04)      COMP             00343000
003440                                                 VALUE +0.        00344000
003450         05  FILLER              PIC X(02)       VALUE 'CD'.      00345000
003460         05  PDB-RPV110-RATMODL-MASK                              00346000
003470                                 PIC X(01)       VALUE ' '.       00347000
003480         05  PDB-RPV110-RATMODL-ERROR                             00348000
003490                                 PIC X(01)       VALUE ' '.       00349000
003500         05  PDB-RPV110-RATMODL-VID                               00350000
003510                                 PIC X(01)       VALUE 'D'.       00351000
003520         05  PDB-RPV110-RATMODL-EL                                00352000
003530                                 PIC X(01)       VALUE 'N'.       00353000
003540         05  PDB-RPV110-RATMODL-DCHG                              00354000
003550                                 PIC X(01)       VALUE ' '.       00355000
003560         05  FILLER              PIC X(01)       VALUE ' '.       00356000
003570         05  PDB-RPV110-QUAL3                                     00357000
003580                                 PIC X(08)       VALUE 'QUAL3   '.00358000
003590         05  FILLER              PIC S9(04)      COMP             00359000
003600                                                 VALUE +18.       00360000
003610         05  FILLER              PIC S9(04)      COMP             00361000
003620                                                 VALUE +0.        00362000
003630         05  FILLER              PIC S9(04)      COMP             00363000
003640                                                 VALUE +0.        00364000
003650         05  FILLER              PIC X(02)       VALUE 'CD'.      00365000
003660         05  PDB-RPV110-QUAL3-MASK                                00366000
003670                                 PIC X(01)       VALUE ' '.       00367000
003680         05  PDB-RPV110-QUAL3-ERROR                               00368000
003690                                 PIC X(01)       VALUE ' '.       00369000
003700         05  PDB-RPV110-QUAL3-VID                                 00370000
003710                                 PIC X(01)       VALUE 'D'.       00371000
003720         05  PDB-RPV110-QUAL3-EL                                  00372000
003730                                 PIC X(01)       VALUE 'I'.       00373000
003740         05  PDB-RPV110-QUAL3-DCHG                                00374000
003750                                 PIC X(01)       VALUE ' '.       00375000
003760         05  FILLER              PIC X(01)       VALUE ' '.       00376000
003770         05  PDB-RPV110-SECSV1                                    00377000
003780                                 PIC X(08)       VALUE 'SECSV1  '.00378000
003790         05  FILLER              PIC S9(04)      COMP             00379000
003800                                                 VALUE +6.        00380000
003810         05  FILLER              PIC S9(04)      COMP             00381000
003820                                                 VALUE +0.        00382000
003830         05  FILLER              PIC S9(04)      COMP             00383000
003840                                                 VALUE +0.        00384000
003850         05  FILLER              PIC X(02)       VALUE 'CD'.      00385000
003860         05  PDB-RPV110-SECSV1-MASK                               00386000
003870                                 PIC X(01)       VALUE ' '.       00387000
003880         05  PDB-RPV110-SECSV1-ERROR                              00388000
003890                                 PIC X(01)       VALUE ' '.       00389000
003900         05  PDB-RPV110-SECSV1-VID                                00390000
003910                                 PIC X(01)       VALUE 'D'.       00391000
003920         05  PDB-RPV110-SECSV1-EL                                 00392000
003930                                 PIC X(01)       VALUE 'N'.       00393000
003940         05  PDB-RPV110-SECSV1-DCHG                               00394000
003950                                 PIC X(01)       VALUE ' '.       00395000
003960         05  FILLER              PIC X(01)       VALUE ' '.       00396000
003970         05  PDB-RPV110-SECSV2                                    00397000
003980                                 PIC X(08)       VALUE 'SECSV2  '.00398000
003990         05  FILLER              PIC S9(04)      COMP             00399000
004000                                                 VALUE +6.        00400000
004010         05  FILLER              PIC S9(04)      COMP             00401000
004020                                                 VALUE +0.        00402000
004030         05  FILLER              PIC S9(04)      COMP             00403000
004040                                                 VALUE +0.        00404000
004050         05  FILLER              PIC X(02)       VALUE 'CD'.      00405000
004060         05  PDB-RPV110-SECSV2-MASK                               00406000
004070                                 PIC X(01)       VALUE ' '.       00407000
004080         05  PDB-RPV110-SECSV2-ERROR                              00408000
004090                                 PIC X(01)       VALUE ' '.       00409000
004100         05  PDB-RPV110-SECSV2-VID                                00410000
004110                                 PIC X(01)       VALUE 'D'.       00411000
004120         05  PDB-RPV110-SECSV2-EL                                 00412000
004130                                 PIC X(01)       VALUE 'N'.       00413000
004140         05  PDB-RPV110-SECSV2-DCHG                               00414000
004150                                 PIC X(01)       VALUE ' '.       00415000
004160         05  FILLER              PIC X(01)       VALUE ' '.       00416000
004170         05  PDB-RPV110-SECSV3                                    00417000
004180                                 PIC X(08)       VALUE 'SECSV3  '.00418000
004190         05  FILLER              PIC S9(04)      COMP             00419000
004200                                                 VALUE +6.        00420000
004210         05  FILLER              PIC S9(04)      COMP             00421000
004220                                                 VALUE +0.        00422000
004230         05  FILLER              PIC S9(04)      COMP             00423000
004240                                                 VALUE +0.        00424000
004250         05  FILLER              PIC X(02)       VALUE 'CD'.      00425000
004260         05  PDB-RPV110-SECSV3-MASK                               00426000
004270                                 PIC X(01)       VALUE ' '.       00427000
004280         05  PDB-RPV110-SECSV3-ERROR                              00428000
004290                                 PIC X(01)       VALUE ' '.       00429000
004300         05  PDB-RPV110-SECSV3-VID                                00430000
004310                                 PIC X(01)       VALUE 'D'.       00431000
004320         05  PDB-RPV110-SECSV3-EL                                 00432000
004330                                 PIC X(01)       VALUE 'N'.       00433000
004340         05  PDB-RPV110-SECSV3-DCHG                               00434000
004350                                 PIC X(01)       VALUE ' '.       00435000
004360         05  FILLER              PIC X(01)       VALUE ' '.       00436000
004370         05  PDB-RPV110-SECSV4                                    00437000
004380                                 PIC X(08)       VALUE 'SECSV4  '.00438000
004390         05  FILLER              PIC S9(04)      COMP             00439000
004400                                                 VALUE +6.        00440000
004410         05  FILLER              PIC S9(04)      COMP             00441000
004420                                                 VALUE +0.        00442000
004430         05  FILLER              PIC S9(04)      COMP             00443000
004440                                                 VALUE +0.        00444000
004450         05  FILLER              PIC X(02)       VALUE 'CD'.      00445000
004460         05  PDB-RPV110-SECSV4-MASK                               00446000
004470                                 PIC X(01)       VALUE ' '.       00447000
004480         05  PDB-RPV110-SECSV4-ERROR                              00448000
004490                                 PIC X(01)       VALUE ' '.       00449000
004500         05  PDB-RPV110-SECSV4-VID                                00450000
004510                                 PIC X(01)       VALUE 'D'.       00451000
004520         05  PDB-RPV110-SECSV4-EL                                 00452000
004530                                 PIC X(01)       VALUE 'N'.       00453000
004540         05  PDB-RPV110-SECSV4-DCHG                               00454000
004550                                 PIC X(01)       VALUE ' '.       00455000
004560         05  FILLER              PIC X(01)       VALUE ' '.       00456000
004570         05  PDB-RPV110-SECSV5                                    00457000
004580                                 PIC X(08)       VALUE 'SECSV5  '.00458000
004590         05  FILLER              PIC S9(04)      COMP             00459000
004600                                                 VALUE +6.        00460000
004610         05  FILLER              PIC S9(04)      COMP             00461000
004620                                                 VALUE +0.        00462000
004630         05  FILLER              PIC S9(04)      COMP             00463000
004640                                                 VALUE +0.        00464000
004650         05  FILLER              PIC X(02)       VALUE 'CD'.      00465000
004660         05  PDB-RPV110-SECSV5-MASK                               00466000
004670                                 PIC X(01)       VALUE ' '.       00467000
004680         05  PDB-RPV110-SECSV5-ERROR                              00468000
004690                                 PIC X(01)       VALUE ' '.       00469000
004700         05  PDB-RPV110-SECSV5-VID                                00470000
004710                                 PIC X(01)       VALUE 'D'.       00471000
004720         05  PDB-RPV110-SECSV5-EL                                 00472000
004730                                 PIC X(01)       VALUE 'N'.       00473000
004740         05  PDB-RPV110-SECSV5-DCHG                               00474000
004750                                 PIC X(01)       VALUE ' '.       00475000
004760         05  FILLER              PIC X(01)       VALUE ' '.       00476000
004770         05  PDB-RPV110-SECSV6                                    00477000
004780                                 PIC X(08)       VALUE 'SECSV6  '.00478000
004790         05  FILLER              PIC S9(04)      COMP             00479000
004800                                                 VALUE +6.        00480000
004810         05  FILLER              PIC S9(04)      COMP             00481000
004820                                                 VALUE +0.        00482000
004830         05  FILLER              PIC S9(04)      COMP             00483000
004840                                                 VALUE +0.        00484000
004850         05  FILLER              PIC X(02)       VALUE 'CD'.      00485000
004860         05  PDB-RPV110-SECSV6-MASK                               00486000
004870                                 PIC X(01)       VALUE ' '.       00487000
004880         05  PDB-RPV110-SECSV6-ERROR                              00488000
004890                                 PIC X(01)       VALUE ' '.       00489000
004900         05  PDB-RPV110-SECSV6-VID                                00490000
004910                                 PIC X(01)       VALUE 'D'.       00491000
004920         05  PDB-RPV110-SECSV6-EL                                 00492000
004930                                 PIC X(01)       VALUE 'N'.       00493000
004940         05  PDB-RPV110-SECSV6-DCHG                               00494000
004950                                 PIC X(01)       VALUE ' '.       00495000
004960         05  FILLER              PIC X(01)       VALUE ' '.       00496000
004970         05  PDB-RPV110-SECSV7                                    00497000
004980                                 PIC X(08)       VALUE 'SECSV7  '.00498000
004990         05  FILLER              PIC S9(04)      COMP             00499000
005000                                                 VALUE +6.        00500000
005010         05  FILLER              PIC S9(04)      COMP             00501000
005020                                                 VALUE +0.        00502000
005030         05  FILLER              PIC S9(04)      COMP             00503000
005040                                                 VALUE +0.        00504000
005050         05  FILLER              PIC X(02)       VALUE 'CD'.      00505000
005060         05  PDB-RPV110-SECSV7-MASK                               00506000
005070                                 PIC X(01)       VALUE ' '.       00507000
005080         05  PDB-RPV110-SECSV7-ERROR                              00508000
005090                                 PIC X(01)       VALUE ' '.       00509000
005100         05  PDB-RPV110-SECSV7-VID                                00510000
005110                                 PIC X(01)       VALUE 'D'.       00511000
005120         05  PDB-RPV110-SECSV7-EL                                 00512000
005130                                 PIC X(01)       VALUE 'N'.       00513000
005140         05  PDB-RPV110-SECSV7-DCHG                               00514000
005150                                 PIC X(01)       VALUE ' '.       00515000
005160         05  FILLER              PIC X(01)       VALUE ' '.       00516000
005170         05  PDB-RPV110-SECSV8                                    00517000
005180                                 PIC X(08)       VALUE 'SECSV8  '.00518000
005190         05  FILLER              PIC S9(04)      COMP             00519000
005200                                                 VALUE +6.        00520000
005210         05  FILLER              PIC S9(04)      COMP             00521000
005220                                                 VALUE +0.        00522000
005230         05  FILLER              PIC S9(04)      COMP             00523000
005240                                                 VALUE +0.        00524000
005250         05  FILLER              PIC X(02)       VALUE 'CD'.      00525000
005260         05  PDB-RPV110-SECSV8-MASK                               00526000
005270                                 PIC X(01)       VALUE ' '.       00527000
005280         05  PDB-RPV110-SECSV8-ERROR                              00528000
005290                                 PIC X(01)       VALUE ' '.       00529000
005300         05  PDB-RPV110-SECSV8-VID                                00530000
005310                                 PIC X(01)       VALUE 'D'.       00531000
005320         05  PDB-RPV110-SECSV8-EL                                 00532000
005330                                 PIC X(01)       VALUE 'N'.       00533000
005340         05  PDB-RPV110-SECSV8-DCHG                               00534000
005350                                 PIC X(01)       VALUE ' '.       00535000
005360         05  FILLER              PIC X(01)       VALUE ' '.       00536000
005370         05  PDB-RPV110-SECSV9                                    00537000
005380                                 PIC X(08)       VALUE 'SECSV9  '.00538000
005390         05  FILLER              PIC S9(04)      COMP             00539000
005400                                                 VALUE +6.        00540000
005410         05  FILLER              PIC S9(04)      COMP             00541000
005420                                                 VALUE +0.        00542000
005430         05  FILLER              PIC S9(04)      COMP             00543000
005440                                                 VALUE +0.        00544000
005450         05  FILLER              PIC X(02)       VALUE 'CD'.      00545000
005460         05  PDB-RPV110-SECSV9-MASK                               00546000
005470                                 PIC X(01)       VALUE ' '.       00547000
005480         05  PDB-RPV110-SECSV9-ERROR                              00548000
005490                                 PIC X(01)       VALUE ' '.       00549000
005500         05  PDB-RPV110-SECSV9-VID                                00550000
005510                                 PIC X(01)       VALUE 'D'.       00551000
005520         05  PDB-RPV110-SECSV9-EL                                 00552000
005530                                 PIC X(01)       VALUE 'N'.       00553000
005540         05  PDB-RPV110-SECSV9-DCHG                               00554000
005550                                 PIC X(01)       VALUE ' '.       00555000
005560         05  FILLER              PIC X(01)       VALUE ' '.       00556000
005570         05  PDB-RPV110-SECSV10                                   00557000
005580                                 PIC X(08)       VALUE 'SECSV10 '.00558000
005590         05  FILLER              PIC S9(04)      COMP             00559000
005600                                                 VALUE +6.        00560000
005610         05  FILLER              PIC S9(04)      COMP             00561000
005620                                                 VALUE +0.        00562000
005630         05  FILLER              PIC S9(04)      COMP             00563000
005640                                                 VALUE +0.        00564000
005650         05  FILLER              PIC X(02)       VALUE 'CD'.      00565000
005660         05  PDB-RPV110-SECSV10-MASK                              00566000
005670                                 PIC X(01)       VALUE ' '.       00567000
005680         05  PDB-RPV110-SECSV10-ERROR                             00568000
005690                                 PIC X(01)       VALUE ' '.       00569000
005700         05  PDB-RPV110-SECSV10-VID                               00570000
005710                                 PIC X(01)       VALUE 'D'.       00571000
005720         05  PDB-RPV110-SECSV10-EL                                00572000
005730                                 PIC X(01)       VALUE 'N'.       00573000
005740         05  PDB-RPV110-SECSV10-DCHG                              00574000
005750                                 PIC X(01)       VALUE ' '.       00575000
005760         05  FILLER              PIC X(01)       VALUE ' '.       00576000
005770         05  PDB-RPV110-SECSV11                                   00577000
005780                                 PIC X(08)       VALUE 'SECSV11 '.00578000
005790         05  FILLER              PIC S9(04)      COMP             00579000
005800                                                 VALUE +6.        00580000
005810         05  FILLER              PIC S9(04)      COMP             00581000
005820                                                 VALUE +0.        00582000
005830         05  FILLER              PIC S9(04)      COMP             00583000
005840                                                 VALUE +0.        00584000
005850         05  FILLER              PIC X(02)       VALUE 'CD'.      00585000
005860         05  PDB-RPV110-SECSV11-MASK                              00586000
005870                                 PIC X(01)       VALUE ' '.       00587000
005880         05  PDB-RPV110-SECSV11-ERROR                             00588000
005890                                 PIC X(01)       VALUE ' '.       00589000
005900         05  PDB-RPV110-SECSV11-VID                               00590000
005910                                 PIC X(01)       VALUE 'D'.       00591000
005920         05  PDB-RPV110-SECSV11-EL                                00592000
005930                                 PIC X(01)       VALUE 'N'.       00593000
005940         05  PDB-RPV110-SECSV11-DCHG                              00594000
005950                                 PIC X(01)       VALUE ' '.       00595000
005960         05  FILLER              PIC X(01)       VALUE ' '.       00596000
005970         05  PDB-RPV110-SECSV12                                   00597000
005980                                 PIC X(08)       VALUE 'SECSV12 '.00598000
005990         05  FILLER              PIC S9(04)      COMP             00599000
006000                                                 VALUE +6.        00600000
006010         05  FILLER              PIC S9(04)      COMP             00601000
006020                                                 VALUE +0.        00602000
006030         05  FILLER              PIC S9(04)      COMP             00603000
006040                                                 VALUE +0.        00604000
006050         05  FILLER              PIC X(02)       VALUE 'CD'.      00605000
006060         05  PDB-RPV110-SECSV12-MASK                              00606000
006070                                 PIC X(01)       VALUE ' '.       00607000
006080         05  PDB-RPV110-SECSV12-ERROR                             00608000
006090                                 PIC X(01)       VALUE ' '.       00609000
006100         05  PDB-RPV110-SECSV12-VID                               00610000
006110                                 PIC X(01)       VALUE 'D'.       00611000
006120         05  PDB-RPV110-SECSV12-EL                                00612000
006130                                 PIC X(01)       VALUE 'N'.       00613000
006140         05  PDB-RPV110-SECSV12-DCHG                              00614000
006150                                 PIC X(01)       VALUE ' '.       00615000
006160         05  FILLER              PIC X(01)       VALUE ' '.       00616000
006170         05  PDB-RPV110-SECSV13                                   00617000
006180                                 PIC X(08)       VALUE 'SECSV13 '.00618000
006190         05  FILLER              PIC S9(04)      COMP             00619000
006200                                                 VALUE +6.        00620000
006210         05  FILLER              PIC S9(04)      COMP             00621000
006220                                                 VALUE +0.        00622000
006230         05  FILLER              PIC S9(04)      COMP             00623000
006240                                                 VALUE +0.        00624000
006250         05  FILLER              PIC X(02)       VALUE 'CD'.      00625000
006260         05  PDB-RPV110-SECSV13-MASK                              00626000
006270                                 PIC X(01)       VALUE ' '.       00627000
006280         05  PDB-RPV110-SECSV13-ERROR                             00628000
006290                                 PIC X(01)       VALUE ' '.       00629000
006300         05  PDB-RPV110-SECSV13-VID                               00630000
006310                                 PIC X(01)       VALUE 'D'.       00631000
006320         05  PDB-RPV110-SECSV13-EL                                00632000
006330                                 PIC X(01)       VALUE 'N'.       00633000
006340         05  PDB-RPV110-SECSV13-DCHG                              00634000
006350                                 PIC X(01)       VALUE ' '.       00635000
006360         05  FILLER              PIC X(01)       VALUE ' '.       00636000
006370         05  PDB-RPV110-SECSV14                                   00637000
006380                                 PIC X(08)       VALUE 'SECSV14 '.00638000
006390         05  FILLER              PIC S9(04)      COMP             00639000
006400                                                 VALUE +6.        00640000
006410         05  FILLER              PIC S9(04)      COMP             00641000
006420                                                 VALUE +0.        00642000
006430         05  FILLER              PIC S9(04)      COMP             00643000
006440                                                 VALUE +0.        00644000
006450         05  FILLER              PIC X(02)       VALUE 'CD'.      00645000
006460         05  PDB-RPV110-SECSV14-MASK                              00646000
006470                                 PIC X(01)       VALUE ' '.       00647000
006480         05  PDB-RPV110-SECSV14-ERROR                             00648000
006490                                 PIC X(01)       VALUE ' '.       00649000
006500         05  PDB-RPV110-SECSV14-VID                               00650000
006510                                 PIC X(01)       VALUE 'D'.       00651000
006520         05  PDB-RPV110-SECSV14-EL                                00652000
006530                                 PIC X(01)       VALUE 'N'.       00653000
006540         05  PDB-RPV110-SECSV14-DCHG                              00654000
006550                                 PIC X(01)       VALUE ' '.       00655000
006560         05  FILLER              PIC X(01)       VALUE ' '.       00656000
006570         05  PDB-RPV110-SECSV15                                   00657000
006580                                 PIC X(08)       VALUE 'SECSV15 '.00658000
006590         05  FILLER              PIC S9(04)      COMP             00659000
006600                                                 VALUE +6.        00660000
006610         05  FILLER              PIC S9(04)      COMP             00661000
006620                                                 VALUE +0.        00662000
006630         05  FILLER              PIC S9(04)      COMP             00663000
006640                                                 VALUE +0.        00664000
006650         05  FILLER              PIC X(02)       VALUE 'CD'.      00665000
006660         05  PDB-RPV110-SECSV15-MASK                              00666000
006670                                 PIC X(01)       VALUE ' '.       00667000
006680         05  PDB-RPV110-SECSV15-ERROR                             00668000
006690                                 PIC X(01)       VALUE ' '.       00669000
006700         05  PDB-RPV110-SECSV15-VID                               00670000
006710                                 PIC X(01)       VALUE 'D'.       00671000
006720         05  PDB-RPV110-SECSV15-EL                                00672000
006730                                 PIC X(01)       VALUE 'N'.       00673000
006740         05  PDB-RPV110-SECSV15-DCHG                              00674000
006750                                 PIC X(01)       VALUE ' '.       00675000
006760         05  FILLER              PIC X(01)       VALUE ' '.       00676000
006770         05  PDB-RPV110-SECSV16                                   00677000
006780                                 PIC X(08)       VALUE 'SECSV16 '.00678000
006790         05  FILLER              PIC S9(04)      COMP             00679000
006800                                                 VALUE +6.        00680000
006810         05  FILLER              PIC S9(04)      COMP             00681000
006820                                                 VALUE +0.        00682000
006830         05  FILLER              PIC S9(04)      COMP             00683000
006840                                                 VALUE +0.        00684000
006850         05  FILLER              PIC X(02)       VALUE 'CD'.      00685000
006860         05  PDB-RPV110-SECSV16-MASK                              00686000
006870                                 PIC X(01)       VALUE ' '.       00687000
006880         05  PDB-RPV110-SECSV16-ERROR                             00688000
006890                                 PIC X(01)       VALUE ' '.       00689000
006900         05  PDB-RPV110-SECSV16-VID                               00690000
006910                                 PIC X(01)       VALUE 'D'.       00691000
006920         05  PDB-RPV110-SECSV16-EL                                00692000
006930                                 PIC X(01)       VALUE 'N'.       00693000
006940         05  PDB-RPV110-SECSV16-DCHG                              00694000
006950                                 PIC X(01)       VALUE ' '.       00695000
006960         05  FILLER              PIC X(01)       VALUE ' '.       00696000
006970         05  PDB-RPV110-SECSV17                                   00697000
006980                                 PIC X(08)       VALUE 'SECSV17 '.00698000
006990         05  FILLER              PIC S9(04)      COMP             00699000
007000                                                 VALUE +6.        00700000
007010         05  FILLER              PIC S9(04)      COMP             00701000
007020                                                 VALUE +0.        00702000
007030         05  FILLER              PIC S9(04)      COMP             00703000
007040                                                 VALUE +0.        00704000
007050         05  FILLER              PIC X(02)       VALUE 'CD'.      00705000
007060         05  PDB-RPV110-SECSV17-MASK                              00706000
007070                                 PIC X(01)       VALUE ' '.       00707000
007080         05  PDB-RPV110-SECSV17-ERROR                             00708000
007090                                 PIC X(01)       VALUE ' '.       00709000
007100         05  PDB-RPV110-SECSV17-VID                               00710000
007110                                 PIC X(01)       VALUE 'D'.       00711000
007120         05  PDB-RPV110-SECSV17-EL                                00712000
007130                                 PIC X(01)       VALUE 'N'.       00713000
007140         05  PDB-RPV110-SECSV17-DCHG                              00714000
007150                                 PIC X(01)       VALUE ' '.       00715000
007160         05  FILLER              PIC X(01)       VALUE ' '.       00716000
007170         05  PDB-RPV110-SECSV18                                   00717000
007180                                 PIC X(08)       VALUE 'SECSV18 '.00718000
007190         05  FILLER              PIC S9(04)      COMP             00719000
007200                                                 VALUE +6.        00720000
007210         05  FILLER              PIC S9(04)      COMP             00721000
007220                                                 VALUE +0.        00722000
007230         05  FILLER              PIC S9(04)      COMP             00723000
007240                                                 VALUE +0.        00724000
007250         05  FILLER              PIC X(02)       VALUE 'CD'.      00725000
007260         05  PDB-RPV110-SECSV18-MASK                              00726000
007270                                 PIC X(01)       VALUE ' '.       00727000
007280         05  PDB-RPV110-SECSV18-ERROR                             00728000
007290                                 PIC X(01)       VALUE ' '.       00729000
007300         05  PDB-RPV110-SECSV18-VID                               00730000
007310                                 PIC X(01)       VALUE 'D'.       00731000
007320         05  PDB-RPV110-SECSV18-EL                                00732000
007330                                 PIC X(01)       VALUE 'N'.       00733000
007340         05  PDB-RPV110-SECSV18-DCHG                              00734000
007350                                 PIC X(01)       VALUE ' '.       00735000
007360         05  FILLER              PIC X(01)       VALUE ' '.       00736000
007370         05  PDB-RPV110-SECSV19                                   00737000
007380                                 PIC X(08)       VALUE 'SECSV19 '.00738000
007390         05  FILLER              PIC S9(04)      COMP             00739000
007400                                                 VALUE +6.        00740000
007410         05  FILLER              PIC S9(04)      COMP             00741000
007420                                                 VALUE +0.        00742000
007430         05  FILLER              PIC S9(04)      COMP             00743000
007440                                                 VALUE +0.        00744000
007450         05  FILLER              PIC X(02)       VALUE 'CD'.      00745000
007460         05  PDB-RPV110-SECSV19-MASK                              00746000
007470                                 PIC X(01)       VALUE ' '.       00747000
007480         05  PDB-RPV110-SECSV19-ERROR                             00748000
007490                                 PIC X(01)       VALUE ' '.       00749000
007500         05  PDB-RPV110-SECSV19-VID                               00750000
007510                                 PIC X(01)       VALUE 'D'.       00751000
007520         05  PDB-RPV110-SECSV19-EL                                00752000
007530                                 PIC X(01)       VALUE 'N'.       00753000
007540         05  PDB-RPV110-SECSV19-DCHG                              00754000
007550                                 PIC X(01)       VALUE ' '.       00755000
007560         05  FILLER              PIC X(01)       VALUE ' '.       00756000
007570         05  PDB-RPV110-SECSV20                                   00757000
007580                                 PIC X(08)       VALUE 'SECSV20 '.00758000
007590         05  FILLER              PIC S9(04)      COMP             00759000
007600                                                 VALUE +6.        00760000
007610         05  FILLER              PIC S9(04)      COMP             00761000
007620                                                 VALUE +0.        00762000
007630         05  FILLER              PIC S9(04)      COMP             00763000
007640                                                 VALUE +0.        00764000
007650         05  FILLER              PIC X(02)       VALUE 'CD'.      00765000
007660         05  PDB-RPV110-SECSV20-MASK                              00766000
007670                                 PIC X(01)       VALUE ' '.       00767000
007680         05  PDB-RPV110-SECSV20-ERROR                             00768000
007690                                 PIC X(01)       VALUE ' '.       00769000
007700         05  PDB-RPV110-SECSV20-VID                               00770000
007710                                 PIC X(01)       VALUE 'D'.       00771000
007720         05  PDB-RPV110-SECSV20-EL                                00772000
007730                                 PIC X(01)       VALUE 'N'.       00773000
007740         05  PDB-RPV110-SECSV20-DCHG                              00774000
007750                                 PIC X(01)       VALUE ' '.       00775000
007760         05  FILLER              PIC X(01)       VALUE ' '.       00776000
007770         05  PDB-RPV110-MSGLINE                                   00777000
007780                                 PIC X(08)       VALUE 'MSGLINE '.00778000
007790         05  FILLER              PIC S9(04)      COMP             00779000
007800                                                 VALUE +78.       00780000
007810         05  FILLER              PIC S9(04)      COMP             00781000
007820                                                 VALUE +0.        00782000
007830         05  FILLER              PIC S9(04)      COMP             00783000
007840                                                 VALUE +0.        00784000
007850         05  FILLER              PIC X(02)       VALUE 'CD'.      00785000
007860         05  PDB-RPV110-MSGLINE-MASK                              00786000
007870                                 PIC X(01)       VALUE ' '.       00787000
007880         05  PDB-RPV110-MSGLINE-ERROR                             00788000
007890                                 PIC X(01)       VALUE ' '.       00789000
007900         05  PDB-RPV110-MSGLINE-VID                               00790000
007910                                 PIC X(01)       VALUE 'D'.       00791000
007920         05  PDB-RPV110-MSGLINE-EL                                00792000
007930                                 PIC X(01)       VALUE 'I'.       00793000
007940         05  PDB-RPV110-MSGLINE-DCHG                              00794000
007950                                 PIC X(01)       VALUE ' '.       00795000
007960         05  FILLER              PIC X(01)       VALUE ' '.       00796000
007970         05  PDB-RPV110-COMMAND                                   00797000
007980                                 PIC X(08)       VALUE 'COMMAND '.00798000
007990         05  FILLER              PIC S9(04)      COMP             00799000
008000                                                 VALUE +65.       00800000
008010         05  FILLER              PIC S9(04)      COMP             00801000
008020                                                 VALUE +0.        00802000
008030         05  FILLER              PIC S9(04)      COMP             00803000
008040                                                 VALUE +0.        00804000
008050         05  FILLER              PIC X(02)       VALUE 'CD'.      00805000
008060         05  PDB-RPV110-COMMAND-MASK                              00806000
008070                                 PIC X(01)       VALUE ' '.       00807000
008080         05  PDB-RPV110-COMMAND-ERROR                             00808000
008090                                 PIC X(01)       VALUE ' '.       00809000
008100         05  PDB-RPV110-COMMAND-VID                               00810000
008110                                 PIC X(01)       VALUE 'I'.       00811000
008120         05  PDB-RPV110-COMMAND-EL                                00812000
008130                                 PIC X(01)       VALUE 'O'.       00813000
008140         05  PDB-RPV110-COMMAND-DCHG                              00814000
008150                                 PIC X(01)       VALUE ' '.       00815000
008160         05  FILLER              PIC X(01)       VALUE ' '.       00816000
008170         05  PDB-RPV110-PFLINE1                                   00817000
008180                                 PIC X(08)       VALUE 'PFLINE1 '.00818000
008190         05  FILLER              PIC S9(04)      COMP             00819000
008200                                                 VALUE +78.       00820000
008210         05  FILLER              PIC S9(04)      COMP             00821000
008220                                                 VALUE +0.        00822000
008230         05  FILLER              PIC S9(04)      COMP             00823000
008240                                                 VALUE +0.        00824000
008250         05  FILLER              PIC X(02)       VALUE 'CD'.      00825000
008260         05  PDB-RPV110-PFLINE1-MASK                              00826000
008270                                 PIC X(01)       VALUE ' '.       00827000
008280         05  PDB-RPV110-PFLINE1-ERROR                             00828000
008290                                 PIC X(01)       VALUE ' '.       00829000
008300         05  PDB-RPV110-PFLINE1-VID                               00830000
008310                                 PIC X(01)       VALUE 'D'.       00831000
008320         05  PDB-RPV110-PFLINE1-EL                                00832000
008330                                 PIC X(01)       VALUE 'N'.       00833000
008340         05  PDB-RPV110-PFLINE1-DCHG                              00834000
008350                                 PIC X(01)       VALUE ' '.       00835000
008360         05  FILLER              PIC X(01)       VALUE ' '.       00836000
008370         05  PDB-RPV110-PFLINE2                                   00837000
008380                                 PIC X(08)       VALUE 'PFLINE2 '.00838000
008390         05  FILLER              PIC S9(04)      COMP             00839000
008400                                                 VALUE +78.       00840000
008410         05  FILLER              PIC S9(04)      COMP             00841000
008420                                                 VALUE +0.        00842000
008430         05  FILLER              PIC S9(04)      COMP             00843000
008440                                                 VALUE +0.        00844000
008450         05  FILLER              PIC X(02)       VALUE 'CD'.      00845000
008460         05  PDB-RPV110-PFLINE2-MASK                              00846000
008470                                 PIC X(01)       VALUE ' '.       00847000
008480         05  PDB-RPV110-PFLINE2-ERROR                             00848000
008490                                 PIC X(01)       VALUE ' '.       00849000
008500         05  PDB-RPV110-PFLINE2-VID                               00850000
008510                                 PIC X(01)       VALUE 'D'.       00851000
008520         05  PDB-RPV110-PFLINE2-EL                                00852000
008530                                 PIC X(01)       VALUE 'N'.       00853000
008540         05  PDB-RPV110-PFLINE2-DCHG                              00854000
008550                                 PIC X(01)       VALUE ' '.       00855000
008560         05  FILLER              PIC X(01)       VALUE ' '.       00856000
008570         05  FILLER              PIC X(08)       VALUE LOW-VALUE. 00857000
008580                                                                  00858000
008590 01  RPV110-PANL-DATA-AREA.                                       00859000
008600     03  RPV110-OPERID           PIC X(08).                       00860000
008610     03  RPV110-INST             PIC X(04).                       00861000
008620     03  RPV110-SYSDATE          PIC X(10).                       00862000
008630     03  RPV110-MORE             PIC X(05).                       00863000
008640     03  RPV110-MINUS            PIC X(01).                       00864000
008650     03  RPV110-PLUS             PIC X(01).                       00865000
008660     03  RPV110-PRODCD           PIC X(06).                       00866000
008670     03  RPV110-ACCOUNT          PIC X(18).                       00867000
008680     03  RPV110-QUAL1            PIC X(18).                       00868000
008690     03  RPV110-SCAMT            PIC X(10).                       00869000
008700     03  RPV110-SCPRCENT         PIC X(06).                       00870000
008710     03  RPV110-SCMODEL          PIC X(10).                       00871000
008720     03  RPV110-QUAL2            PIC X(18).                       00872000
008730     03  RPV110-RTRATE           PIC X(10).                       00873000
008740     03  RPV110-QUAL25           PIC X(25).                       00874000
008750     03  RPV110-RATTYPE          PIC X(16).                       00875000
008760     03  RPV110-RATMODL          PIC X(10).                       00876000
008770     03  RPV110-QUAL3            PIC X(18).                       00877000
008780     03  RPV110-SECSV1           PIC X(06).                       00878000
008790     03  RPV110-SECSV2           PIC X(06).                       00879000
008800     03  RPV110-SECSV3           PIC X(06).                       00880000
008810     03  RPV110-SECSV4           PIC X(06).                       00881000
008820     03  RPV110-SECSV5           PIC X(06).                       00882000
008830     03  RPV110-SECSV6           PIC X(06).                       00883000
008840     03  RPV110-SECSV7           PIC X(06).                       00884000
008850     03  RPV110-SECSV8           PIC X(06).                       00885000
008860     03  RPV110-SECSV9           PIC X(06).                       00886000
008870     03  RPV110-SECSV10          PIC X(06).                       00887000
008880     03  RPV110-SECSV11          PIC X(06).                       00888000
008890     03  RPV110-SECSV12          PIC X(06).                       00889000
008900     03  RPV110-SECSV13          PIC X(06).                       00890000
008910     03  RPV110-SECSV14          PIC X(06).                       00891000
008920     03  RPV110-SECSV15          PIC X(06).                       00892000
008930     03  RPV110-SECSV16          PIC X(06).                       00893000
008940     03  RPV110-SECSV17          PIC X(06).                       00894000
008950     03  RPV110-SECSV18          PIC X(06).                       00895000
008960     03  RPV110-SECSV19          PIC X(06).                       00896000
008970     03  RPV110-SECSV20          PIC X(06).                       00897000
008980     03  RPV110-MSGLINE          PIC X(78).                       00898000
008990     03  RPV110-COMMAND          PIC X(65).                       00899000
009000     03  RPV110-PFLINE1          PIC X(78).                       00900000
009010     03  RPV110-PFLINE2          PIC X(78).                       00901000
009020 01  RPV110-ERROR-FIELD                                           00902000
009030                                 PIC X(08).                       00903000
009040 01  RPV110-SW-SET-CURSOR                                         00904000
009050                                 PIC X(01)       VALUE 'N'.       00905000
009060******************************************************************00906000
