000200*01  RPV310-PANL-DATA-BLOCK.                                      00000200
000300*----------------------------------------------------------------*00000300
000400*    RPV310W - PANEL DATA BLOCK/AREA                             *00000400
000500*----------------------------------------------------------------*00000500
000600     03  FILLER                  PIC X(08)       VALUE '**BPDB**'.00000600
000700     03  PDB-RPV310-NAME                                          00000700
000800                                 PIC X(08)       VALUE 'RPV310  '.00000800
000900     03  PDB-RPV310-STATUS.                                       00000900
001000         05  PDB-RPV310-KEY-CHG                                   00001000
001100                                 PIC X(01).                       00001100
001200         05  PDB-RPV310-DATA-CHG                                  00001200
001300                                 PIC X(01).                       00001300
001400         05  PDB-RPV310-CURR-OCC                                  00001400
001500                                 PIC S9(04)      COMP             00001500
001600                                                 VALUE +0.        00001600
001700     03  PDB-RPV310-FIELD-TABLE.                                  00001700
001800         05  PDB-RPV310-OPERID                                    00001800
001900                                 PIC X(08)       VALUE 'OPERID  '.00001900
002000         05  FILLER              PIC S9(04)      COMP             00002000
002100                                                 VALUE +8.        00002100
002200         05  FILLER              PIC S9(04)      COMP             00002200
002300                                                 VALUE +0.        00002300
002400         05  FILLER              PIC S9(04)      COMP             00002400
002500                                                 VALUE +0.        00002500
002600         05  FILLER              PIC X(02)       VALUE 'CD'.      00002600
002700         05  PDB-RPV310-OPERID-MASK                               00002700
002800                                 PIC X(01)       VALUE ' '.       00002800
002900         05  PDB-RPV310-OPERID-ERROR                              00002900
003000                                 PIC X(01)       VALUE ' '.       00003000
003100         05  PDB-RPV310-OPERID-VID                                00003100
003200                                 PIC X(01)       VALUE 'D'.       00003200
003300         05  PDB-RPV310-OPERID-EL                                 00003300
003400                                 PIC X(01)       VALUE 'N'.       00003400
003500         05  PDB-RPV310-OPERID-DCHG                               00003500
003600                                 PIC X(01)       VALUE ' '.       00003600
003700         05  FILLER              PIC X(01)       VALUE ' '.       00003700
003800         05  PDB-RPV310-INST                                      00003800
003900                                 PIC X(08)       VALUE 'INST    '.00003900
004000         05  FILLER              PIC S9(04)      COMP             00004000
004100                                                 VALUE +4.        00004100
004200         05  FILLER              PIC S9(04)      COMP             00004200
004300                                                 VALUE +0.        00004300
004400         05  FILLER              PIC S9(04)      COMP             00004400
004500                                                 VALUE +0.        00004500
004600         05  FILLER              PIC X(02)       VALUE 'CD'.      00004600
004700         05  PDB-RPV310-INST-MASK                                 00004700
004800                                 PIC X(01)       VALUE ' '.       00004800
004900         05  PDB-RPV310-INST-ERROR                                00004900
005000                                 PIC X(01)       VALUE ' '.       00005000
005100         05  PDB-RPV310-INST-VID                                  00005100
005200                                 PIC X(01)       VALUE 'D'.       00005200
005300         05  PDB-RPV310-INST-EL                                   00005300
005400                                 PIC X(01)       VALUE 'N'.       00005400
005500         05  PDB-RPV310-INST-DCHG                                 00005500
005600                                 PIC X(01)       VALUE ' '.       00005600
005700         05  FILLER              PIC X(01)       VALUE ' '.       00005700
005800         05  PDB-RPV310-SYSDATE                                   00005800
005900                                 PIC X(08)       VALUE 'SYSDATE '.00005900
006000         05  FILLER              PIC S9(04)      COMP             00006000
006100                                                 VALUE +10.       00006100
006200         05  FILLER              PIC S9(04)      COMP             00006200
006300                                                 VALUE +0.        00006300
006400         05  FILLER              PIC S9(04)      COMP             00006400
006500                                                 VALUE +0.        00006500
006600         05  FILLER              PIC X(02)       VALUE 'CD'.      00006600
006700         05  PDB-RPV310-SYSDATE-MASK                              00006700
006800                                 PIC X(01)       VALUE ' '.       00006800
006900         05  PDB-RPV310-SYSDATE-ERROR                             00006900
007000                                 PIC X(01)       VALUE ' '.       00007000
007100         05  PDB-RPV310-SYSDATE-VID                               00007100
007200                                 PIC X(01)       VALUE 'D'.       00007200
007300         05  PDB-RPV310-SYSDATE-EL                                00007300
007400                                 PIC X(01)       VALUE 'N'.       00007400
007500         05  PDB-RPV310-SYSDATE-DCHG                              00007500
007600                                 PIC X(01)       VALUE ' '.       00007600
007700         05  FILLER              PIC X(01)       VALUE ' '.       00007700
007800         05  PDB-RPV310-MORE                                      00007800
007900                                 PIC X(08)       VALUE 'MORE    '.00007900
008000         05  FILLER              PIC S9(04)      COMP             00008000
008100                                                 VALUE +5.        00008100
008200         05  FILLER              PIC S9(04)      COMP             00008200
008300                                                 VALUE +0.        00008300
008400         05  FILLER              PIC S9(04)      COMP             00008400
008500                                                 VALUE +0.        00008500
008600         05  FILLER              PIC X(02)       VALUE 'CD'.      00008600
008700         05  PDB-RPV310-MORE-MASK                                 00008700
008800                                 PIC X(01)       VALUE ' '.       00008800
008900         05  PDB-RPV310-MORE-ERROR                                00008900
009000                                 PIC X(01)       VALUE ' '.       00009000
009100         05  PDB-RPV310-MORE-VID                                  00009100
009200                                 PIC X(01)       VALUE 'D'.       00009200
009300         05  PDB-RPV310-MORE-EL                                   00009300
009400                                 PIC X(01)       VALUE 'N'.       00009400
009500         05  PDB-RPV310-MORE-DCHG                                 00009500
009600                                 PIC X(01)       VALUE ' '.       00009600
009700         05  FILLER              PIC X(01)       VALUE ' '.       00009700
009800         05  PDB-RPV310-MINUS                                     00009800
009900                                 PIC X(08)       VALUE 'MINUS   '.00009900
010000         05  FILLER              PIC S9(04)      COMP             00010000
010100                                                 VALUE +1.        00010100
010200         05  FILLER              PIC S9(04)      COMP             00010200
010300                                                 VALUE +0.        00010300
010400         05  FILLER              PIC S9(04)      COMP             00010400
010500                                                 VALUE +0.        00010500
010600         05  FILLER              PIC X(02)       VALUE 'CD'.      00010600
010700         05  PDB-RPV310-MINUS-MASK                                00010700
010800                                 PIC X(01)       VALUE ' '.       00010800
010900         05  PDB-RPV310-MINUS-ERROR                               00010900
011000                                 PIC X(01)       VALUE ' '.       00011000
011100         05  PDB-RPV310-MINUS-VID                                 00011100
011200                                 PIC X(01)       VALUE 'D'.       00011200
011300         05  PDB-RPV310-MINUS-EL                                  00011300
011400                                 PIC X(01)       VALUE 'N'.       00011400
011500         05  PDB-RPV310-MINUS-DCHG                                00011500
011600                                 PIC X(01)       VALUE ' '.       00011600
011700         05  FILLER              PIC X(01)       VALUE ' '.       00011700
011800         05  PDB-RPV310-PLUS                                      00011800
011900                                 PIC X(08)       VALUE 'PLUS    '.00011900
012000         05  FILLER              PIC S9(04)      COMP             00012000
012100                                                 VALUE +1.        00012100
012200         05  FILLER              PIC S9(04)      COMP             00012200
012300                                                 VALUE +0.        00012300
012400         05  FILLER              PIC S9(04)      COMP             00012400
012500                                                 VALUE +0.        00012500
012600         05  FILLER              PIC X(02)       VALUE 'CD'.      00012600
012700         05  PDB-RPV310-PLUS-MASK                                 00012700
012800                                 PIC X(01)       VALUE ' '.       00012800
012900         05  PDB-RPV310-PLUS-ERROR                                00012900
013000                                 PIC X(01)       VALUE ' '.       00013000
013100         05  PDB-RPV310-PLUS-VID                                  00013100
013200                                 PIC X(01)       VALUE 'D'.       00013200
013300         05  PDB-RPV310-PLUS-EL                                   00013300
013400                                 PIC X(01)       VALUE 'N'.       00013400
013500         05  PDB-RPV310-PLUS-DCHG                                 00013500
013600                                 PIC X(01)       VALUE ' '.       00013600
013700         05  FILLER              PIC X(01)       VALUE ' '.       00013700
013800         05  PDB-RPV310-DELETE                                    00013800
013900                                 PIC X(08)       VALUE 'DELETE  '.00013900
014000         05  FILLER              PIC S9(04)      COMP             00014000
014100                                                 VALUE +1.        00014100
014200         05  FILLER              PIC S9(04)      COMP             00014200
014300                                                 VALUE +0.        00014300
014400         05  FILLER              PIC S9(04)      COMP             00014400
014500                                                 VALUE +0.        00014500
014600         05  FILLER              PIC X(02)       VALUE 'CD'.      00014600
014700         05  PDB-RPV310-DELETE-MASK                               00014700
014800                                 PIC X(01)       VALUE ' '.       00014800
014900         05  PDB-RPV310-DELETE-ERROR                              00014900
015000                                 PIC X(01)       VALUE ' '.       00015000
015100         05  PDB-RPV310-DELETE-VID                                00015100
015200                                 PIC X(01)       VALUE 'I'.       00015200
015300         05  PDB-RPV310-DELETE-EL                                 00015300
015400                                 PIC X(01)       VALUE 'O'.       00015400
015500         05  PDB-RPV310-DELETE-DCHG                               00015500
015600                                 PIC X(01)       VALUE ' '.       00015600
015700         05  FILLER              PIC X(01)       VALUE ' '.       00015700
015800         05  PDB-RPV310-PRODCD                                    00015800
015900                                 PIC X(08)       VALUE 'PRODCD  '.00015900
016000         05  FILLER              PIC S9(04)      COMP             00016000
016100                                                 VALUE +6.        00016100
016200         05  FILLER              PIC S9(04)      COMP             00016200
016300                                                 VALUE +0.        00016300
016400         05  FILLER              PIC S9(04)      COMP             00016400
016500                                                 VALUE +0.        00016500
016600         05  FILLER              PIC X(02)       VALUE 'CD'.      00016600
016700         05  PDB-RPV310-PRODCD-MASK                               00016700
016800                                 PIC X(01)       VALUE ' '.       00016800
016900         05  PDB-RPV310-PRODCD-ERROR                              00016900
017000                                 PIC X(01)       VALUE ' '.       00017000
017100         05  PDB-RPV310-PRODCD-VID                                00017100
017200                                 PIC X(01)       VALUE 'D'.       00017200
017300         05  PDB-RPV310-PRODCD-EL                                 00017300
017400                                 PIC X(01)       VALUE 'N'.       00017400
017500         05  PDB-RPV310-PRODCD-DCHG                               00017500
017600                                 PIC X(01)       VALUE ' '.       00017600
017700         05  FILLER              PIC X(01)       VALUE ' '.       00017700
017800         05  PDB-RPV310-ACCOUNT                                   00017800
017900                                 PIC X(08)       VALUE 'ACCOUNT '.00017900
018000         05  FILLER              PIC S9(04)      COMP             00018000
018100                                                 VALUE +18.       00018100
018200         05  FILLER              PIC S9(04)      COMP             00018200
018300                                                 VALUE +0.        00018300
018400         05  FILLER              PIC S9(04)      COMP             00018400
018500                                                 VALUE +0.        00018500
018600         05  FILLER              PIC X(02)       VALUE 'CD'.      00018600
018700         05  PDB-RPV310-ACCOUNT-MASK                              00018700
018800                                 PIC X(01)       VALUE ' '.       00018800
018900         05  PDB-RPV310-ACCOUNT-ERROR                             00018900
019000                                 PIC X(01)       VALUE ' '.       00019000
019100         05  PDB-RPV310-ACCOUNT-VID                               00019100
019200                                 PIC X(01)       VALUE 'D'.       00019200
019300         05  PDB-RPV310-ACCOUNT-EL                                00019300
019400                                 PIC X(01)       VALUE 'N'.       00019400
019500         05  PDB-RPV310-ACCOUNT-DCHG                              00019500
019600                                 PIC X(01)       VALUE ' '.       00019600
019700         05  FILLER              PIC X(01)       VALUE ' '.       00019700
019800         05  PDB-RPV310-CUSTNA                                    00019800
019900                                 PIC X(08)       VALUE 'CUSTNA  '.00019900
020000         05  FILLER              PIC S9(04)      COMP             00020000
020100                                                 VALUE +40.       00020100
020200         05  FILLER              PIC S9(04)      COMP             00020200
020300                                                 VALUE +0.        00020300
020400         05  FILLER              PIC S9(04)      COMP             00020400
020500                                                 VALUE +0.        00020500
020600         05  FILLER              PIC X(02)       VALUE 'CD'.      00020600
020700         05  PDB-RPV310-CUSTNA-MASK                               00020700
020800                                 PIC X(01)       VALUE ' '.       00020800
020900         05  PDB-RPV310-CUSTNA-ERROR                              00020900
021000                                 PIC X(01)       VALUE ' '.       00021000
021100         05  PDB-RPV310-CUSTNA-VID                                00021100
021200                                 PIC X(01)       VALUE 'D'.       00021200
021300         05  PDB-RPV310-CUSTNA-EL                                 00021300
021400                                 PIC X(01)       VALUE 'N'.       00021400
021500         05  PDB-RPV310-CUSTNA-DCHG                               00021500
021600                                 PIC X(01)       VALUE ' '.       00021600
021700         05  FILLER              PIC X(01)       VALUE ' '.       00021700
021800         05  PDB-RPV310-MODEL                                     00021800
021900                                 PIC X(08)       VALUE 'MODEL   '.00021900
022000         05  FILLER              PIC S9(04)      COMP             00022000
022100                                                 VALUE +10.       00022100
022200         05  FILLER              PIC S9(04)      COMP             00022200
022300                                                 VALUE +0.        00022300
022400         05  FILLER              PIC S9(04)      COMP             00022400
022500                                                 VALUE +0.        00022500
022600         05  FILLER              PIC X(02)       VALUE 'CD'.      00022600
022700         05  PDB-RPV310-MODEL-MASK                                00022700
022800                                 PIC X(01)       VALUE ' '.       00022800
022900         05  PDB-RPV310-MODEL-ERROR                               00022900
023000                                 PIC X(01)       VALUE ' '.       00023000
023100         05  PDB-RPV310-MODEL-VID                                 00023100
023200                                 PIC X(01)       VALUE 'D'.       00023200
023300         05  PDB-RPV310-MODEL-EL                                  00023300
023400                                 PIC X(01)       VALUE 'N'.       00023400
023500         05  PDB-RPV310-MODEL-DCHG                                00023500
023600                                 PIC X(01)       VALUE ' '.       00023600
023700         05  FILLER              PIC X(01)       VALUE ' '.       00023700
023800         05  PDB-RPV310-MODDESC                                   00023800
023900                                 PIC X(08)       VALUE 'MODDESC '.00023900
024000         05  FILLER              PIC S9(04)      COMP             00024000
024100                                                 VALUE +20.       00024100
024200         05  FILLER              PIC S9(04)      COMP             00024200
024300                                                 VALUE +0.        00024300
024400         05  FILLER              PIC S9(04)      COMP             00024400
024500                                                 VALUE +0.        00024500
024600         05  FILLER              PIC X(02)       VALUE 'CD'.      00024600
024700         05  PDB-RPV310-MODDESC-MASK                              00024700
024800                                 PIC X(01)       VALUE ' '.       00024800
024900         05  PDB-RPV310-MODDESC-ERROR                             00024900
025000                                 PIC X(01)       VALUE ' '.       00025000
025100         05  PDB-RPV310-MODDESC-VID                               00025100
025200                                 PIC X(01)       VALUE 'D'.       00025200
025300         05  PDB-RPV310-MODDESC-EL                                00025300
025400                                 PIC X(01)       VALUE 'N'.       00025400
025500         05  PDB-RPV310-MODDESC-DCHG                              00025500
025600                                 PIC X(01)       VALUE ' '.       00025600
025700         05  FILLER              PIC X(01)       VALUE ' '.       00025700
025800         05  PDB-RPV310-RELTYPE                                   00025800
025900                                 PIC X(08)       VALUE 'RELTYPE '.00025900
026000         05  FILLER              PIC S9(04)      COMP             00026000
026100                                                 VALUE +26.       00026100
026200         05  FILLER              PIC S9(04)      COMP             00026200
026300                                                 VALUE +0.        00026300
026400         05  FILLER              PIC S9(04)      COMP             00026400
026500                                                 VALUE +0.        00026500
026600         05  FILLER              PIC X(02)       VALUE 'CD'.      00026600
026700         05  PDB-RPV310-RELTYPE-MASK                              00026700
026800                                 PIC X(01)       VALUE ' '.       00026800
026900         05  PDB-RPV310-RELTYPE-ERROR                             00026900
027000                                 PIC X(01)       VALUE ' '.       00027000
027100         05  PDB-RPV310-RELTYPE-VID                               00027100
027200                                 PIC X(01)       VALUE 'D'.       00027200
027300         05  PDB-RPV310-RELTYPE-EL                                00027300
027400                                 PIC X(01)       VALUE 'I'.       00027400
027500         05  PDB-RPV310-RELTYPE-DCHG                              00027500
027600                                 PIC X(01)       VALUE ' '.       00027600
027700         05  FILLER              PIC X(01)       VALUE ' '.       00027700
027800         05  PDB-RPV310-IDNBR                                     00027800
027900                                 PIC X(08)       VALUE 'IDNBR   '.00027900
028000         05  FILLER              PIC S9(04)      COMP             00028000
028100                                                 VALUE +18.       00028100
028200         05  FILLER              PIC S9(04)      COMP             00028200
028300                                                 VALUE +0.        00028300
028400         05  FILLER              PIC S9(04)      COMP             00028400
028500                                                 VALUE +0.        00028500
028600         05  FILLER              PIC X(02)       VALUE 'CD'.      00028600
028700         05  PDB-RPV310-IDNBR-MASK                                00028700
028800                                 PIC X(01)       VALUE ' '.       00028800
028900         05  PDB-RPV310-IDNBR-ERROR                               00028900
029000                                 PIC X(01)       VALUE ' '.       00029000
029100         05  PDB-RPV310-IDNBR-VID                                 00029100
029200                                 PIC X(01)       VALUE 'D'.       00029200
029300         05  PDB-RPV310-IDNBR-EL                                  00029300
029400                                 PIC X(01)       VALUE 'N'.       00029400
029500         05  PDB-RPV310-IDNBR-DCHG                                00029500
029600                                 PIC X(01)       VALUE ' '.       00029600
029700         05  FILLER              PIC X(01)       VALUE ' '.       00029700
029800         05  PDB-RPV310-STATUS                                    00029800
029900                                 PIC X(08)       VALUE 'STATUS  '.00029900
030000         05  FILLER              PIC S9(04)      COMP             00030000
030100                                                 VALUE +10.       00030100
030200         05  FILLER              PIC S9(04)      COMP             00030200
030300                                                 VALUE +0.        00030300
030400         05  FILLER              PIC S9(04)      COMP             00030400
030500                                                 VALUE +0.        00030500
030600         05  FILLER              PIC X(02)       VALUE 'CD'.      00030600
030700         05  PDB-RPV310-STATUS-MASK                               00030700
030800                                 PIC X(01)       VALUE ' '.       00030800
030900         05  PDB-RPV310-STATUS-ERROR                              00030900
031000                                 PIC X(01)       VALUE ' '.       00031000
031100         05  PDB-RPV310-STATUS-VID                                00031100
031200                                 PIC X(01)       VALUE 'D'.       00031200
031300         05  PDB-RPV310-STATUS-EL                                 00031300
031400                                 PIC X(01)       VALUE 'N'.       00031400
031500         05  PDB-RPV310-STATUS-DCHG                               00031500
031600                                 PIC X(01)       VALUE ' '.       00031600
031700         05  FILLER              PIC X(01)       VALUE ' '.       00031700
031800         05  PDB-RPV310-ACTION                                    00031800
031900                                 PIC X(08)       VALUE 'ACTION  '.00031900
032000         05  FILLER              PIC S9(04)      COMP             00032000
032100                                                 VALUE +1.        00032100
032200         05  FILLER              PIC S9(04)      COMP             00032200
032300                                                 VALUE +0.        00032300
032400         05  FILLER              PIC S9(04)      COMP             00032400
032500                                                 VALUE +1.        00032500
032600         05  FILLER              PIC X(02)       VALUE 'CD'.      00032600
032700         05  PDB-RPV310-ACTION-MASK                               00032700
032800                                 PIC X(01)       VALUE ' '.       00032800
032900         05  PDB-RPV310-ACTION-ERROR                              00032900
033000                                 PIC X(01)       VALUE ' '.       00033000
033100         05  PDB-RPV310-ACTION-VID                                00033100
033200                                 PIC X(01)       VALUE 'I'.       00033200
033300         05  PDB-RPV310-ACTION-EL                                 00033300
033400                                 PIC X(01)       VALUE 'O'.       00033400
033500         05  PDB-RPV310-ACTION-DCHG                               00033500
033600                                 PIC X(01)       VALUE ' '.       00033600
033700         05  FILLER              PIC X(01)       VALUE ' '.       00033700
033800         05  PDB-RPV310-INSTX                                     00033800
033900                                 PIC X(08)       VALUE 'INSTX   '.00033900
034000         05  FILLER              PIC S9(04)      COMP             00034000
034100                                                 VALUE +4.        00034100
034200         05  FILLER              PIC S9(04)      COMP             00034200
034300                                                 VALUE +0.        00034300
034400         05  FILLER              PIC S9(04)      COMP             00034400
034500                                                 VALUE +1.        00034500
034600         05  FILLER              PIC X(02)       VALUE 'CD'.      00034600
034700         05  PDB-RPV310-INSTX-MASK                                00034700
034800                                 PIC X(01)       VALUE ' '.       00034800
034900         05  PDB-RPV310-INSTX-ERROR                               00034900
035000                                 PIC X(01)       VALUE ' '.       00035000
035100         05  PDB-RPV310-INSTX-VID                                 00035100
035200                                 PIC X(01)       VALUE 'D'.       00035200
035300         05  PDB-RPV310-INSTX-EL                                  00035300
035400                                 PIC X(01)       VALUE 'N'.       00035400
035500         05  PDB-RPV310-INSTX-DCHG                                00035500
035600                                 PIC X(01)       VALUE ' '.       00035600
035700         05  FILLER              PIC X(01)       VALUE ' '.       00035700
035800         05  PDB-RPV310-PRODCDX                                   00035800
035900                                 PIC X(08)       VALUE 'PRODCDX '.00035900
036000         05  FILLER              PIC S9(04)      COMP             00036000
036100                                                 VALUE +6.        00036100
036200         05  FILLER              PIC S9(04)      COMP             00036200
036300                                                 VALUE +0.        00036300
036400         05  FILLER              PIC S9(04)      COMP             00036400
036500                                                 VALUE +1.        00036500
036600         05  FILLER              PIC X(02)       VALUE 'CD'.      00036600
036700         05  PDB-RPV310-PRODCDX-MASK                              00036700
036800                                 PIC X(01)       VALUE ' '.       00036800
036900         05  PDB-RPV310-PRODCDX-ERROR                             00036900
037000                                 PIC X(01)       VALUE ' '.       00037000
037100         05  PDB-RPV310-PRODCDX-VID                               00037100
037200                                 PIC X(01)       VALUE 'D'.       00037200
037300         05  PDB-RPV310-PRODCDX-EL                                00037300
037400                                 PIC X(01)       VALUE 'N'.       00037400
037500         05  PDB-RPV310-PRODCDX-DCHG                              00037500
037600                                 PIC X(01)       VALUE ' '.       00037600
037700         05  FILLER              PIC X(01)       VALUE ' '.       00037700
037800         05  PDB-RPV310-ACCTX                                     00037800
037900                                 PIC X(08)       VALUE 'ACCTX   '.00037900
038000         05  FILLER              PIC S9(04)      COMP             00038000
038100                                                 VALUE +18.       00038100
038200         05  FILLER              PIC S9(04)      COMP             00038200
038300                                                 VALUE +0.        00038300
038400         05  FILLER              PIC S9(04)      COMP             00038400
038500                                                 VALUE +1.        00038500
038600         05  FILLER              PIC X(02)       VALUE 'CD'.      00038600
038700         05  PDB-RPV310-ACCTX-MASK                                00038700
038800                                 PIC X(01)       VALUE ' '.       00038800
038900         05  PDB-RPV310-ACCTX-ERROR                               00038900
039000                                 PIC X(01)       VALUE ' '.       00039000
039100         05  PDB-RPV310-ACCTX-VID                                 00039100
039200                                 PIC X(01)       VALUE 'D'.       00039200
039300         05  PDB-RPV310-ACCTX-EL                                  00039300
039400                                 PIC X(01)       VALUE 'N'.       00039400
039500         05  PDB-RPV310-ACCTX-DCHG                                00039500
039600                                 PIC X(01)       VALUE ' '.       00039600
039700         05  FILLER              PIC X(01)       VALUE ' '.       00039700
039800         05  PDB-RPV310-STATUSX                                   00039800
039900                                 PIC X(08)       VALUE 'STATUSX '.00039900
040000         05  FILLER              PIC S9(04)      COMP             00040000
040100                                                 VALUE +15.       00040100
040200         05  FILLER              PIC S9(04)      COMP             00040200
040300                                                 VALUE +0.        00040300
040400         05  FILLER              PIC S9(04)      COMP             00040400
040500                                                 VALUE +1.        00040500
040600         05  FILLER              PIC X(02)       VALUE 'CD'.      00040600
040700         05  PDB-RPV310-STATUSX-MASK                              00040700
040800                                 PIC X(01)       VALUE ' '.       00040800
040900         05  PDB-RPV310-STATUSX-ERROR                             00040900
041000                                 PIC X(01)       VALUE ' '.       00041000
041100         05  PDB-RPV310-STATUSX-VID                               00041100
041200                                 PIC X(01)       VALUE 'D'.       00041200
041300         05  PDB-RPV310-STATUSX-EL                                00041300
041400                                 PIC X(01)       VALUE 'N'.       00041400
041500         05  PDB-RPV310-STATUSX-DCHG                              00041500
041600                                 PIC X(01)       VALUE ' '.       00041600
041700         05  FILLER              PIC X(01)       VALUE ' '.       00041700
041800         05  PDB-RPV310-MESSAGEX                                  00041800
041900                                 PIC X(08)       VALUE 'MESSAGEX'.00041900
042000         05  FILLER              PIC S9(04)      COMP             00042000
042100                                                 VALUE +16.       00042100
042200         05  FILLER              PIC S9(04)      COMP             00042200
042300                                                 VALUE +0.        00042300
042400         05  FILLER              PIC S9(04)      COMP             00042400
042500                                                 VALUE +1.        00042500
042600         05  FILLER              PIC X(02)       VALUE 'CD'.      00042600
042700         05  PDB-RPV310-MESSAGEX-MASK                             00042700
042800                                 PIC X(01)       VALUE ' '.       00042800
042900         05  PDB-RPV310-MESSAGEX-ERROR                            00042900
043000                                 PIC X(01)       VALUE ' '.       00043000
043100         05  PDB-RPV310-MESSAGEX-VID                              00043100
043200                                 PIC X(01)       VALUE 'D'.       00043200
043300         05  PDB-RPV310-MESSAGEX-EL                               00043300
043400                                 PIC X(01)       VALUE 'N'.       00043400
043500         05  PDB-RPV310-MESSAGEX-DCHG                             00043500
043600                                 PIC X(01)       VALUE ' '.       00043600
043700         05  FILLER              PIC X(01)       VALUE ' '.       00043700
043800         05  PDB-RPV310-MSGLINE                                   00043800
043900                                 PIC X(08)       VALUE 'MSGLINE '.00043900
044000         05  FILLER              PIC S9(04)      COMP             00044000
044100                                                 VALUE +78.       00044100
044200         05  FILLER              PIC S9(04)      COMP             00044200
044300                                                 VALUE +0.        00044300
044400         05  FILLER              PIC S9(04)      COMP             00044400
044500                                                 VALUE +0.        00044500
044600         05  FILLER              PIC X(02)       VALUE 'CD'.      00044600
044700         05  PDB-RPV310-MSGLINE-MASK                              00044700
044800                                 PIC X(01)       VALUE ' '.       00044800
044900         05  PDB-RPV310-MSGLINE-ERROR                             00044900
045000                                 PIC X(01)       VALUE ' '.       00045000
045100         05  PDB-RPV310-MSGLINE-VID                               00045100
045200                                 PIC X(01)       VALUE 'D'.       00045200
045300         05  PDB-RPV310-MSGLINE-EL                                00045300
045400                                 PIC X(01)       VALUE 'I'.       00045400
045500         05  PDB-RPV310-MSGLINE-DCHG                              00045500
045600                                 PIC X(01)       VALUE ' '.       00045600
045700         05  FILLER              PIC X(01)       VALUE ' '.       00045700
045800         05  PDB-RPV310-COMMAND                                   00045800
045900                                 PIC X(08)       VALUE 'COMMAND '.00045900
046000         05  FILLER              PIC S9(04)      COMP             00046000
046100                                                 VALUE +65.       00046100
046200         05  FILLER              PIC S9(04)      COMP             00046200
046300                                                 VALUE +0.        00046300
046400         05  FILLER              PIC S9(04)      COMP             00046400
046500                                                 VALUE +0.        00046500
046600         05  FILLER              PIC X(02)       VALUE 'CD'.      00046600
046700         05  PDB-RPV310-COMMAND-MASK                              00046700
046800                                 PIC X(01)       VALUE ' '.       00046800
046900         05  PDB-RPV310-COMMAND-ERROR                             00046900
047000                                 PIC X(01)       VALUE ' '.       00047000
047100         05  PDB-RPV310-COMMAND-VID                               00047100
047200                                 PIC X(01)       VALUE 'I'.       00047200
047300         05  PDB-RPV310-COMMAND-EL                                00047300
047400                                 PIC X(01)       VALUE 'O'.       00047400
047500         05  PDB-RPV310-COMMAND-DCHG                              00047500
047600                                 PIC X(01)       VALUE ' '.       00047600
047700         05  FILLER              PIC X(01)       VALUE ' '.       00047700
047800         05  PDB-RPV310-PFLINE1                                   00047800
047900                                 PIC X(08)       VALUE 'PFLINE1 '.00047900
048000         05  FILLER              PIC S9(04)      COMP             00048000
048100                                                 VALUE +78.       00048100
048200         05  FILLER              PIC S9(04)      COMP             00048200
048300                                                 VALUE +0.        00048300
048400         05  FILLER              PIC S9(04)      COMP             00048400
048500                                                 VALUE +0.        00048500
048600         05  FILLER              PIC X(02)       VALUE 'CD'.      00048600
048700         05  PDB-RPV310-PFLINE1-MASK                              00048700
048800                                 PIC X(01)       VALUE ' '.       00048800
048900         05  PDB-RPV310-PFLINE1-ERROR                             00048900
049000                                 PIC X(01)       VALUE ' '.       00049000
049100         05  PDB-RPV310-PFLINE1-VID                               00049100
049200                                 PIC X(01)       VALUE 'D'.       00049200
049300         05  PDB-RPV310-PFLINE1-EL                                00049300
049400                                 PIC X(01)       VALUE 'N'.       00049400
049500         05  PDB-RPV310-PFLINE1-DCHG                              00049500
049600                                 PIC X(01)       VALUE ' '.       00049600
049700         05  FILLER              PIC X(01)       VALUE ' '.       00049700
049800         05  PDB-RPV310-PFLINE2                                   00049800
049900                                 PIC X(08)       VALUE 'PFLINE2 '.00049900
050000         05  FILLER              PIC S9(04)      COMP             00050000
050100                                                 VALUE +78.       00050100
050200         05  FILLER              PIC S9(04)      COMP             00050200
050300                                                 VALUE +0.        00050300
050400         05  FILLER              PIC S9(04)      COMP             00050400
050500                                                 VALUE +0.        00050500
050600         05  FILLER              PIC X(02)       VALUE 'CD'.      00050600
050700         05  PDB-RPV310-PFLINE2-MASK                              00050700
050800                                 PIC X(01)       VALUE ' '.       00050800
050900         05  PDB-RPV310-PFLINE2-ERROR                             00050900
051000                                 PIC X(01)       VALUE ' '.       00051000
051100         05  PDB-RPV310-PFLINE2-VID                               00051100
051200                                 PIC X(01)       VALUE 'D'.       00051200
051300         05  PDB-RPV310-PFLINE2-EL                                00051300
051400                                 PIC X(01)       VALUE 'N'.       00051400
051500         05  PDB-RPV310-PFLINE2-DCHG                              00051500
051600                                 PIC X(01)       VALUE ' '.       00051600
051700         05  FILLER              PIC X(01)       VALUE ' '.       00051700
051800         05  FILLER              PIC X(08)       VALUE LOW-VALUE. 00051800
051900                                                                  00051900
052000 01  RPV310-PANL-DATA-AREA.                                       00052000
052100     03  RPV310-OPERID           PIC X(08).                       00052100
052200     03  RPV310-INST             PIC X(04).                       00052200
052300     03  RPV310-SYSDATE          PIC X(10).                       00052300
052400     03  RPV310-MORE             PIC X(05).                       00052400
052500     03  RPV310-MINUS            PIC X(01).                       00052500
052600     03  RPV310-PLUS             PIC X(01).                       00052600
052700     03  RPV310-DELETE           PIC X(01).                       00052700
052800     03  RPV310-PRODCD           PIC X(06).                       00052800
052900     03  RPV310-ACCOUNT          PIC X(18).                       00052900
053000     03  RPV310-CUSTNA           PIC X(40).                       00053000
053100     03  RPV310-MODEL            PIC X(10).                       00053100
053200     03  RPV310-MODDESC          PIC X(20).                       00053200
053300     03  RPV310-RELTYPE          PIC X(26).                       00053300
053400     03  RPV310-IDNBR            PIC X(18).                       00053400
053500     03  RPV310-STATUS           PIC X(10).                       00053500
053600     03  RPV310-ACTION           PIC X(01).                       00053600
053700     03  RPV310-INSTX            PIC X(04).                       00053700
053800     03  RPV310-PRODCDX          PIC X(06).                       00053800
053900     03  RPV310-ACCTX            PIC X(18).                       00053900
054000     03  RPV310-STATUSX          PIC X(15).                       00054000
054100     03  RPV310-MESSAGEX         PIC X(16).                       00054100
054200     03  RPV310-MSGLINE          PIC X(78).                       00054200
054300     03  RPV310-COMMAND          PIC X(65).                       00054300
054400     03  RPV310-PFLINE1          PIC X(78).                       00054400
054500     03  RPV310-PFLINE2          PIC X(78).                       00054500
054600                                                                  00054600
054700*  COUNTERS FOR MULTIPLY OCCURRING FIELDS.                        00054700
054800 01  RPV310-COUNTER-TABLE.                                        00054800
054900     03  RPV310-ACTION-COUNT                                      00054900
055000                                 PIC S9(04)      COMP             00055000
055100                                                 VALUE +8.        00055100
055200     03  RPV310-INSTX-COUNT                                       00055200
055300                                 PIC S9(04)      COMP             00055300
055400                                                 VALUE +8.        00055400
055500     03  RPV310-PRODCDX-COUNT                                     00055500
055600                                 PIC S9(04)      COMP             00055600
055700                                                 VALUE +8.        00055700
055800     03  RPV310-ACCTX-COUNT                                       00055800
055900                                 PIC S9(04)      COMP             00055900
056000                                                 VALUE +8.        00056000
056100     03  RPV310-STATUSX-COUNT                                     00056100
056200                                 PIC S9(04)      COMP             00056200
056300                                                 VALUE +8.        00056300
056400     03  RPV310-MESSAGEX-COUNT                                    00056400
056500                                 PIC S9(04)      COMP             00056500
056600                                                 VALUE +8.        00056600
056700     03  RPV310-COUNT                                             00056700
056800                                 PIC S9(04)      COMP.            00056800
056900 01  RPV310-ERROR-FIELD                                           00056900
057000                                 PIC X(08).                       00057000
057100 01  RPV310-SW-SET-CURSOR                                         00057100
057200                                 PIC X(01)       VALUE 'N'.       00057200
057300******************************************************************00057300
