000010*01  RPV380-PANL-DATA-BLOCK.                                      00001000
000020*----------------------------------------------------------------*00002000
000030*    RPV380W - PANEL DATA BLOCK/AREA                             *00003000
000040*----------------------------------------------------------------*00004000
000050     03  FILLER                  PIC X(08)       VALUE '**BPDB**'.00005000
000060     03  PDB-RPV380-NAME                                          00006000
000070                                 PIC X(08)       VALUE 'RPV380  '.00007000
000080     03  PDB-RPV380-STATUS.                                       00008000
000090         05  PDB-RPV380-KEY-CHG                                   00009000
000100                                 PIC X(01).                       00010000
000110         05  PDB-RPV380-DATA-CHG                                  00011000
000120                                 PIC X(01).                       00012000
000130         05  PDB-RPV380-CURR-OCC                                  00013000
000140                                 PIC S9(04)      COMP             00014000
000150                                                 VALUE +0.        00015000
000160     03  PDB-RPV380-FIELD-TABLE.                                  00016000
000170         05  PDB-RPV380-OPERID                                    00017000
000180                                 PIC X(08)       VALUE 'OPERID  '.00018000
000190         05  FILLER              PIC S9(04)      COMP             00019000
000200                                                 VALUE +8.        00020000
000210         05  FILLER              PIC S9(04)      COMP             00021000
000220                                                 VALUE +0.        00022000
000230         05  FILLER              PIC S9(04)      COMP             00023000
000240                                                 VALUE +0.        00024000
000250         05  FILLER              PIC X(02)       VALUE 'CD'.      00025000
000260         05  PDB-RPV380-OPERID-MASK                               00026000
000270                                 PIC X(01)       VALUE ' '.       00027000
000280         05  PDB-RPV380-OPERID-ERROR                              00028000
000290                                 PIC X(01)       VALUE ' '.       00029000
000300         05  PDB-RPV380-OPERID-VID                                00030000
000310                                 PIC X(01)       VALUE 'D'.       00031000
000320         05  PDB-RPV380-OPERID-EL                                 00032000
000330                                 PIC X(01)       VALUE 'N'.       00033000
000340         05  PDB-RPV380-OPERID-DCHG                               00034000
000350                                 PIC X(01)       VALUE ' '.       00035000
000360         05  FILLER              PIC X(01)       VALUE ' '.       00036000
000370         05  PDB-RPV380-INST                                      00037000
000380                                 PIC X(08)       VALUE 'INST    '.00038000
000390         05  FILLER              PIC S9(04)      COMP             00039000
000400                                                 VALUE +4.        00040000
000410         05  FILLER              PIC S9(04)      COMP             00041000
000420                                                 VALUE +0.        00042000
000430         05  FILLER              PIC S9(04)      COMP             00043000
000440                                                 VALUE +0.        00044000
000450         05  FILLER              PIC X(02)       VALUE 'CD'.      00045000
000460         05  PDB-RPV380-INST-MASK                                 00046000
000470                                 PIC X(01)       VALUE ' '.       00047000
000480         05  PDB-RPV380-INST-ERROR                                00048000
000490                                 PIC X(01)       VALUE ' '.       00049000
000500         05  PDB-RPV380-INST-VID                                  00050000
000510                                 PIC X(01)       VALUE 'D'.       00051000
000520         05  PDB-RPV380-INST-EL                                   00052000
000530                                 PIC X(01)       VALUE 'N'.       00053000
000540         05  PDB-RPV380-INST-DCHG                                 00054000
000550                                 PIC X(01)       VALUE ' '.       00055000
000560         05  FILLER              PIC X(01)       VALUE ' '.       00056000
000570         05  PDB-RPV380-SYSDATE                                   00057000
000580                                 PIC X(08)       VALUE 'SYSDATE '.00058000
000590         05  FILLER              PIC S9(04)      COMP             00059000
000600                                                 VALUE +10.       00060000
000610         05  FILLER              PIC S9(04)      COMP             00061000
000620                                                 VALUE +0.        00062000
000630         05  FILLER              PIC S9(04)      COMP             00063000
000640                                                 VALUE +0.        00064000
000650         05  FILLER              PIC X(02)       VALUE 'CD'.      00065000
000660         05  PDB-RPV380-SYSDATE-MASK                              00066000
000670                                 PIC X(01)       VALUE ' '.       00067000
000680         05  PDB-RPV380-SYSDATE-ERROR                             00068000
000690                                 PIC X(01)       VALUE ' '.       00069000
000700         05  PDB-RPV380-SYSDATE-VID                               00070000
000710                                 PIC X(01)       VALUE 'D'.       00071000
000720         05  PDB-RPV380-SYSDATE-EL                                00072000
000730                                 PIC X(01)       VALUE 'N'.       00073000
000740         05  PDB-RPV380-SYSDATE-DCHG                              00074000
000750                                 PIC X(01)       VALUE ' '.       00075000
000760         05  FILLER              PIC X(01)       VALUE ' '.       00076000
000770         05  PDB-RPV380-PRODCD                                    00077000
000780                                 PIC X(08)       VALUE 'PRODCD  '.00078000
000790         05  FILLER              PIC S9(04)      COMP             00079000
000800                                                 VALUE +6.        00080000
000810         05  FILLER              PIC S9(04)      COMP             00081000
000820                                                 VALUE +0.        00082000
000830         05  FILLER              PIC S9(04)      COMP             00083000
000840                                                 VALUE +0.        00084000
000850         05  FILLER              PIC X(02)       VALUE 'CD'.      00085000
000860         05  PDB-RPV380-PRODCD-MASK                               00086000
000870                                 PIC X(01)       VALUE ' '.       00087000
000880         05  PDB-RPV380-PRODCD-ERROR                              00088000
000890                                 PIC X(01)       VALUE ' '.       00089000
000900         05  PDB-RPV380-PRODCD-VID                                00090000
000910                                 PIC X(01)       VALUE 'D'.       00091000
000920         05  PDB-RPV380-PRODCD-EL                                 00092000
000930                                 PIC X(01)       VALUE 'N'.       00093000
000940         05  PDB-RPV380-PRODCD-DCHG                               00094000
000950                                 PIC X(01)       VALUE ' '.       00095000
000960         05  FILLER              PIC X(01)       VALUE ' '.       00096000
000970         05  PDB-RPV380-ACCOUNT                                   00097000
000980                                 PIC X(08)       VALUE 'ACCOUNT '.00098000
000990         05  FILLER              PIC S9(04)      COMP             00099000
001000                                                 VALUE +18.       00100000
001010         05  FILLER              PIC S9(04)      COMP             00101000
001020                                                 VALUE +0.        00102000
001030         05  FILLER              PIC S9(04)      COMP             00103000
001040                                                 VALUE +0.        00104000
001050         05  FILLER              PIC X(02)       VALUE 'CD'.      00105000
001060         05  PDB-RPV380-ACCOUNT-MASK                              00106000
001070                                 PIC X(01)       VALUE ' '.       00107000
001080         05  PDB-RPV380-ACCOUNT-ERROR                             00108000
001090                                 PIC X(01)       VALUE ' '.       00109000
001100         05  PDB-RPV380-ACCOUNT-VID                               00110000
001110                                 PIC X(01)       VALUE 'D'.       00111000
001120         05  PDB-RPV380-ACCOUNT-EL                                00112000
001130                                 PIC X(01)       VALUE 'N'.       00113000
001140         05  PDB-RPV380-ACCOUNT-DCHG                              00114000
001150                                 PIC X(01)       VALUE ' '.       00115000
001160         05  FILLER              PIC X(01)       VALUE ' '.       00116000
001170         05  PDB-RPV380-CUSTNA                                    00117000
001180                                 PIC X(08)       VALUE 'CUSTNA  '.00118000
001190         05  FILLER              PIC S9(04)      COMP             00119000
001200                                                 VALUE +40.       00120000
001210         05  FILLER              PIC S9(04)      COMP             00121000
001220                                                 VALUE +0.        00122000
001230         05  FILLER              PIC S9(04)      COMP             00123000
001240                                                 VALUE +0.        00124000
001250         05  FILLER              PIC X(02)       VALUE 'CD'.      00125000
001260         05  PDB-RPV380-CUSTNA-MASK                               00126000
001270                                 PIC X(01)       VALUE ' '.       00127000
001280         05  PDB-RPV380-CUSTNA-ERROR                              00128000
001290                                 PIC X(01)       VALUE ' '.       00129000
001300         05  PDB-RPV380-CUSTNA-VID                                00130000
001310                                 PIC X(01)       VALUE 'D'.       00131000
001320         05  PDB-RPV380-CUSTNA-EL                                 00132000
001330                                 PIC X(01)       VALUE 'N'.       00133000
001340         05  PDB-RPV380-CUSTNA-DCHG                               00134000
001350                                 PIC X(01)       VALUE ' '.       00135000
001360         05  FILLER              PIC X(01)       VALUE ' '.       00136000
001370         05  PDB-RPV380-MODEL                                     00137000
001380                                 PIC X(08)       VALUE 'MODEL   '.00138000
001390         05  FILLER              PIC S9(04)      COMP             00139000
001400                                                 VALUE +10.       00140000
001410         05  FILLER              PIC S9(04)      COMP             00141000
001420                                                 VALUE +0.        00142000
001430         05  FILLER              PIC S9(04)      COMP             00143000
001440                                                 VALUE +0.        00144000
001450         05  FILLER              PIC X(02)       VALUE 'CD'.      00145000
001460         05  PDB-RPV380-MODEL-MASK                                00146000
001470                                 PIC X(01)       VALUE ' '.       00147000
001480         05  PDB-RPV380-MODEL-ERROR                               00148000
001490                                 PIC X(01)       VALUE ' '.       00149000
001500         05  PDB-RPV380-MODEL-VID                                 00150000
001510                                 PIC X(01)       VALUE 'D'.       00151000
001520         05  PDB-RPV380-MODEL-EL                                  00152000
001530                                 PIC X(01)       VALUE 'N'.       00153000
001540         05  PDB-RPV380-MODEL-DCHG                                00154000
001550                                 PIC X(01)       VALUE ' '.       00155000
001560         05  FILLER              PIC X(01)       VALUE ' '.       00156000
001570         05  PDB-RPV380-MODDESC                                   00157000
001580                                 PIC X(08)       VALUE 'MODDESC '.00158000
001590         05  FILLER              PIC S9(04)      COMP             00159000
001600                                                 VALUE +20.       00160000
001610         05  FILLER              PIC S9(04)      COMP             00161000
001620                                                 VALUE +0.        00162000
001630         05  FILLER              PIC S9(04)      COMP             00163000
001640                                                 VALUE +0.        00164000
001650         05  FILLER              PIC X(02)       VALUE 'CD'.      00165000
001660         05  PDB-RPV380-MODDESC-MASK                              00166000
001670                                 PIC X(01)       VALUE ' '.       00167000
001680         05  PDB-RPV380-MODDESC-ERROR                             00168000
001690                                 PIC X(01)       VALUE ' '.       00169000
001700         05  PDB-RPV380-MODDESC-VID                               00170000
001710                                 PIC X(01)       VALUE 'D'.       00171000
001720         05  PDB-RPV380-MODDESC-EL                                00172000
001730                                 PIC X(01)       VALUE 'N'.       00173000
001740         05  PDB-RPV380-MODDESC-DCHG                              00174000
001750                                 PIC X(01)       VALUE ' '.       00175000
001760         05  FILLER              PIC X(01)       VALUE ' '.       00176000
001770         05  PDB-RPV380-IDNBR                                     00177000
001780                                 PIC X(08)       VALUE 'IDNBR   '.00178000
001790         05  FILLER              PIC S9(04)      COMP             00179000
001800                                                 VALUE +18.       00180000
001810         05  FILLER              PIC S9(04)      COMP             00181000
001820                                                 VALUE +0.        00182000
001830         05  FILLER              PIC S9(04)      COMP             00183000
001840                                                 VALUE +0.        00184000
001850         05  FILLER              PIC X(02)       VALUE 'CD'.      00185000
001860         05  PDB-RPV380-IDNBR-MASK                                00186000
001870                                 PIC X(01)       VALUE ' '.       00187000
001880         05  PDB-RPV380-IDNBR-ERROR                               00188000
001890                                 PIC X(01)       VALUE ' '.       00189000
001900         05  PDB-RPV380-IDNBR-VID                                 00190000
001910                                 PIC X(01)       VALUE 'D'.       00191000
001920         05  PDB-RPV380-IDNBR-EL                                  00192000
001930                                 PIC X(01)       VALUE 'N'.       00193000
001940         05  PDB-RPV380-IDNBR-DCHG                                00194000
001950                                 PIC X(01)       VALUE ' '.       00195000
001960         05  FILLER              PIC X(01)       VALUE ' '.       00196000
001970         05  PDB-RPV380-MAXDT                                     00197000
001980                                 PIC X(08)       VALUE 'MAXDT   '.00198000
001990         05  FILLER              PIC S9(04)      COMP             00199000
002000                                                 VALUE +10.       00200000
002010         05  FILLER              PIC S9(04)      COMP             00201000
002020                                                 VALUE +0.        00202000
002030         05  FILLER              PIC S9(04)      COMP             00203000
002040                                                 VALUE +0.        00204000
002050         05  FILLER              PIC X(02)       VALUE 'CD'.      00205000
002060         05  PDB-RPV380-MAXDT-MASK                                00206000
002070                                 PIC X(01)       VALUE ' '.       00207000
002080         05  PDB-RPV380-MAXDT-ERROR                               00208000
002090                                 PIC X(01)       VALUE ' '.       00209000
002100         05  PDB-RPV380-MAXDT-VID                                 00210000
002110                                 PIC X(01)       VALUE 'D'.       00211000
002120         05  PDB-RPV380-MAXDT-EL                                  00212000
002130                                 PIC X(01)       VALUE 'N'.       00213000
002140         05  PDB-RPV380-MAXDT-DCHG                                00214000
002150                                 PIC X(01)       VALUE ' '.       00215000
002160         05  FILLER              PIC X(01)       VALUE ' '.       00216000
002170         05  PDB-RPV380-EXPREDMM                                  00217000
002180                                 PIC X(08)       VALUE 'EXPREDMM'.00218000
002190         05  FILLER              PIC S9(04)      COMP             00219000
002200                                                 VALUE +2.        00220000
002210         05  FILLER              PIC S9(04)      COMP             00221000
002220                                                 VALUE +0.        00222000
002230         05  FILLER              PIC S9(04)      COMP             00223000
002240                                                 VALUE +0.        00224000
002250         05  FILLER              PIC X(02)       VALUE 'CD'.      00225000
002260         05  PDB-RPV380-EXPREDMM-MASK                             00226000
002270                                 PIC X(01)       VALUE ' '.       00227000
002280         05  PDB-RPV380-EXPREDMM-ERROR                            00228000
002290                                 PIC X(01)       VALUE ' '.       00229000
002300         05  PDB-RPV380-EXPREDMM-VID                              00230000
002310                                 PIC X(01)       VALUE 'I'.       00231000
002320         05  PDB-RPV380-EXPREDMM-EL                               00232000
002330                                 PIC X(01)       VALUE 'O'.       00233000
002340         05  PDB-RPV380-EXPREDMM-DCHG                             00234000
002350                                 PIC X(01)       VALUE ' '.       00235000
002360         05  FILLER              PIC X(01)       VALUE ' '.       00236000
002370         05  PDB-RPV380-EXPREDDD                                  00237000
002380                                 PIC X(08)       VALUE 'EXPREDDD'.00238000
002390         05  FILLER              PIC S9(04)      COMP             00239000
002400                                                 VALUE +2.        00240000
002410         05  FILLER              PIC S9(04)      COMP             00241000
002420                                                 VALUE +0.        00242000
002430         05  FILLER              PIC S9(04)      COMP             00243000
002440                                                 VALUE +0.        00244000
002450         05  FILLER              PIC X(02)       VALUE 'CD'.      00245000
002460         05  PDB-RPV380-EXPREDDD-MASK                             00246000
002470                                 PIC X(01)       VALUE ' '.       00247000
002480         05  PDB-RPV380-EXPREDDD-ERROR                            00248000
002490                                 PIC X(01)       VALUE ' '.       00249000
002500         05  PDB-RPV380-EXPREDDD-VID                              00250000
002510                                 PIC X(01)       VALUE 'I'.       00251000
002520         05  PDB-RPV380-EXPREDDD-EL                               00252000
002530                                 PIC X(01)       VALUE 'O'.       00253000
002540         05  PDB-RPV380-EXPREDDD-DCHG                             00254000
002550                                 PIC X(01)       VALUE ' '.       00255000
002560         05  FILLER              PIC X(01)       VALUE ' '.       00256000
002570         05  PDB-RPV380-EXPREDYY                                  00257000
002580                                 PIC X(08)       VALUE 'EXPREDYY'.00258000
002590         05  FILLER              PIC S9(04)      COMP             00259000
002600                                                 VALUE +4.        00260000
002610         05  FILLER              PIC S9(04)      COMP             00261000
002620                                                 VALUE +0.        00262000
002630         05  FILLER              PIC S9(04)      COMP             00263000
002640                                                 VALUE +0.        00264000
002650         05  FILLER              PIC X(02)       VALUE 'CD'.      00265000
002660         05  PDB-RPV380-EXPREDYY-MASK                             00266000
002670                                 PIC X(01)       VALUE ' '.       00267000
002680         05  PDB-RPV380-EXPREDYY-ERROR                            00268000
002690                                 PIC X(01)       VALUE ' '.       00269000
002700         05  PDB-RPV380-EXPREDYY-VID                              00270000
002710                                 PIC X(01)       VALUE 'I'.       00271000
002720         05  PDB-RPV380-EXPREDYY-EL                               00272000
002730                                 PIC X(01)       VALUE 'O'.       00273000
002740         05  PDB-RPV380-EXPREDYY-DCHG                             00274000
002750                                 PIC X(01)       VALUE ' '.       00275000
002760         05  FILLER              PIC X(01)       VALUE ' '.       00276000
002770         05  PDB-RPV380-MSGLINE                                   00277000
002780                                 PIC X(08)       VALUE 'MSGLINE '.00278000
002790         05  FILLER              PIC S9(04)      COMP             00279000
002800                                                 VALUE +78.       00280000
002810         05  FILLER              PIC S9(04)      COMP             00281000
002820                                                 VALUE +0.        00282000
002830         05  FILLER              PIC S9(04)      COMP             00283000
002840                                                 VALUE +0.        00284000
002850         05  FILLER              PIC X(02)       VALUE 'CD'.      00285000
002860         05  PDB-RPV380-MSGLINE-MASK                              00286000
002870                                 PIC X(01)       VALUE ' '.       00287000
002880         05  PDB-RPV380-MSGLINE-ERROR                             00288000
002890                                 PIC X(01)       VALUE ' '.       00289000
002900         05  PDB-RPV380-MSGLINE-VID                               00290000
002910                                 PIC X(01)       VALUE 'D'.       00291000
002920         05  PDB-RPV380-MSGLINE-EL                                00292000
002930                                 PIC X(01)       VALUE 'I'.       00293000
002940         05  PDB-RPV380-MSGLINE-DCHG                              00294000
002950                                 PIC X(01)       VALUE ' '.       00295000
002960         05  FILLER              PIC X(01)       VALUE ' '.       00296000
002970         05  PDB-RPV380-COMMAND                                   00297000
002980                                 PIC X(08)       VALUE 'COMMAND '.00298000
002990         05  FILLER              PIC S9(04)      COMP             00299000
003000                                                 VALUE +65.       00300000
003010         05  FILLER              PIC S9(04)      COMP             00301000
003020                                                 VALUE +0.        00302000
003030         05  FILLER              PIC S9(04)      COMP             00303000
003040                                                 VALUE +0.        00304000
003050         05  FILLER              PIC X(02)       VALUE 'CD'.      00305000
003060         05  PDB-RPV380-COMMAND-MASK                              00306000
003070                                 PIC X(01)       VALUE ' '.       00307000
003080         05  PDB-RPV380-COMMAND-ERROR                             00308000
003090                                 PIC X(01)       VALUE ' '.       00309000
003100         05  PDB-RPV380-COMMAND-VID                               00310000
003110                                 PIC X(01)       VALUE 'I'.       00311000
003120         05  PDB-RPV380-COMMAND-EL                                00312000
003130                                 PIC X(01)       VALUE 'O'.       00313000
003140         05  PDB-RPV380-COMMAND-DCHG                              00314000
003150                                 PIC X(01)       VALUE ' '.       00315000
003160         05  FILLER              PIC X(01)       VALUE ' '.       00316000
003170         05  PDB-RPV380-PFLINE1                                   00317000
003180                                 PIC X(08)       VALUE 'PFLINE1 '.00318000
003190         05  FILLER              PIC S9(04)      COMP             00319000
003200                                                 VALUE +78.       00320000
003210         05  FILLER              PIC S9(04)      COMP             00321000
003220                                                 VALUE +0.        00322000
003230         05  FILLER              PIC S9(04)      COMP             00323000
003240                                                 VALUE +0.        00324000
003250         05  FILLER              PIC X(02)       VALUE 'CD'.      00325000
003260         05  PDB-RPV380-PFLINE1-MASK                              00326000
003270                                 PIC X(01)       VALUE ' '.       00327000
003280         05  PDB-RPV380-PFLINE1-ERROR                             00328000
003290                                 PIC X(01)       VALUE ' '.       00329000
003300         05  PDB-RPV380-PFLINE1-VID                               00330000
003310                                 PIC X(01)       VALUE 'D'.       00331000
003320         05  PDB-RPV380-PFLINE1-EL                                00332000
003330                                 PIC X(01)       VALUE 'N'.       00333000
003340         05  PDB-RPV380-PFLINE1-DCHG                              00334000
003350                                 PIC X(01)       VALUE ' '.       00335000
003360         05  FILLER              PIC X(01)       VALUE ' '.       00336000
003370         05  PDB-RPV380-PFLINE2                                   00337000
003380                                 PIC X(08)       VALUE 'PFLINE2 '.00338000
003390         05  FILLER              PIC S9(04)      COMP             00339000
003400                                                 VALUE +78.       00340000
003410         05  FILLER              PIC S9(04)      COMP             00341000
003420                                                 VALUE +0.        00342000
003430         05  FILLER              PIC S9(04)      COMP             00343000
003440                                                 VALUE +0.        00344000
003450         05  FILLER              PIC X(02)       VALUE 'CD'.      00345000
003460         05  PDB-RPV380-PFLINE2-MASK                              00346000
003470                                 PIC X(01)       VALUE ' '.       00347000
003480         05  PDB-RPV380-PFLINE2-ERROR                             00348000
003490                                 PIC X(01)       VALUE ' '.       00349000
003500         05  PDB-RPV380-PFLINE2-VID                               00350000
003510                                 PIC X(01)       VALUE 'D'.       00351000
003520         05  PDB-RPV380-PFLINE2-EL                                00352000
003530                                 PIC X(01)       VALUE 'N'.       00353000
003540         05  PDB-RPV380-PFLINE2-DCHG                              00354000
003550                                 PIC X(01)       VALUE ' '.       00355000
003560         05  FILLER              PIC X(01)       VALUE ' '.       00356000
003570         05  FILLER              PIC X(08)       VALUE LOW-VALUE. 00357000
003580                                                                  00358000
003590 01  RPV380-PANL-DATA-AREA.                                       00359000
003600     03  RPV380-OPERID           PIC X(08).                       00360000
003610     03  RPV380-INST             PIC X(04).                       00361000
003620     03  RPV380-SYSDATE          PIC X(10).                       00362000
003630     03  RPV380-PRODCD           PIC X(06).                       00363000
003640     03  RPV380-ACCOUNT          PIC X(18).                       00364000
003650     03  RPV380-CUSTNA           PIC X(40).                       00365000
003660     03  RPV380-MODEL            PIC X(10).                       00366000
003670     03  RPV380-MODDESC          PIC X(20).                       00367000
003680     03  RPV380-IDNBR            PIC X(18).                       00368000
003690     03  RPV380-MAXDT            PIC X(10).                       00369000
003700     03  RPV380-EXPREDMM         PIC X(02).                       00370000
003710     03  RPV380-EXPREDDD         PIC X(02).                       00371000
003720     03  RPV380-EXPREDYY         PIC X(04).                       00372000
003730     03  RPV380-MSGLINE          PIC X(78).                       00373000
003740     03  RPV380-COMMAND          PIC X(65).                       00374000
003750     03  RPV380-PFLINE1          PIC X(78).                       00375000
003760     03  RPV380-PFLINE2          PIC X(78).                       00376000
003770 01  RPV380-ERROR-FIELD                                           00377000
003780                                 PIC X(08).                       00378000
003790 01  RPV380-SW-SET-CURSOR                                         00379000
003800                                 PIC X(01)       VALUE 'N'.       00380000
003810******************************************************************00381000
