000200*01  RPV360-PANL-DATA-BLOCK.                                      00000200
000300*----------------------------------------------------------------*00000300
000400*    RPV360W - PANEL DATA BLOCK/AREA                             *00000400
000500*----------------------------------------------------------------*00000500
000600     03  FILLER                  PIC X(08)       VALUE '**BPDB**'.00000600
000700     03  PDB-RPV360-NAME                                          00000700
000800                                 PIC X(08)       VALUE 'RPV360  '.00000800
000900     03  PDB-RPV360-STATUS.                                       00000900
001000         05  PDB-RPV360-KEY-CHG                                   00001000
001100                                 PIC X(01).                       00001100
001200         05  PDB-RPV360-DATA-CHG                                  00001200
001300                                 PIC X(01).                       00001300
001400         05  PDB-RPV360-CURR-OCC                                  00001400
001500                                 PIC S9(04)      COMP             00001500
001600                                                 VALUE +0.        00001600
001700     03  PDB-RPV360-FIELD-TABLE.                                  00001700
001800         05  PDB-RPV360-OPERID                                    00001800
001900                                 PIC X(08)       VALUE 'OPERID  '.00001900
002000         05  FILLER              PIC S9(04)      COMP             00002000
002100                                                 VALUE +8.        00002100
002200         05  FILLER              PIC S9(04)      COMP             00002200
002300                                                 VALUE +0.        00002300
002400         05  FILLER              PIC S9(04)      COMP             00002400
002500                                                 VALUE +0.        00002500
002600         05  FILLER              PIC X(02)       VALUE 'CD'.      00002600
002700         05  PDB-RPV360-OPERID-MASK                               00002700
002800                                 PIC X(01)       VALUE ' '.       00002800
002900         05  PDB-RPV360-OPERID-ERROR                              00002900
003000                                 PIC X(01)       VALUE ' '.       00003000
003100         05  PDB-RPV360-OPERID-VID                                00003100
003200                                 PIC X(01)       VALUE 'D'.       00003200
003300         05  PDB-RPV360-OPERID-EL                                 00003300
003400                                 PIC X(01)       VALUE 'N'.       00003400
003500         05  PDB-RPV360-OPERID-DCHG                               00003500
003600                                 PIC X(01)       VALUE ' '.       00003600
003700         05  FILLER              PIC X(01)       VALUE ' '.       00003700
003800         05  PDB-RPV360-INST                                      00003800
003900                                 PIC X(08)       VALUE 'INST    '.00003900
004000         05  FILLER              PIC S9(04)      COMP             00004000
004100                                                 VALUE +4.        00004100
004200         05  FILLER              PIC S9(04)      COMP             00004200
004300                                                 VALUE +0.        00004300
004400         05  FILLER              PIC S9(04)      COMP             00004400
004500                                                 VALUE +0.        00004500
004600         05  FILLER              PIC X(02)       VALUE 'CD'.      00004600
004700         05  PDB-RPV360-INST-MASK                                 00004700
004800                                 PIC X(01)       VALUE ' '.       00004800
004900         05  PDB-RPV360-INST-ERROR                                00004900
005000                                 PIC X(01)       VALUE ' '.       00005000
005100         05  PDB-RPV360-INST-VID                                  00005100
005200                                 PIC X(01)       VALUE 'D'.       00005200
005300         05  PDB-RPV360-INST-EL                                   00005300
005400                                 PIC X(01)       VALUE 'N'.       00005400
005500         05  PDB-RPV360-INST-DCHG                                 00005500
005600                                 PIC X(01)       VALUE ' '.       00005600
005700         05  FILLER              PIC X(01)       VALUE ' '.       00005700
005800         05  PDB-RPV360-SYSDATE                                   00005800
005900                                 PIC X(08)       VALUE 'SYSDATE '.00005900
006000         05  FILLER              PIC S9(04)      COMP             00006000
006100                                                 VALUE +10.       00006100
006200         05  FILLER              PIC S9(04)      COMP             00006200
006300                                                 VALUE +0.        00006300
006400         05  FILLER              PIC S9(04)      COMP             00006400
006500                                                 VALUE +0.        00006500
006600         05  FILLER              PIC X(02)       VALUE 'CD'.      00006600
006700         05  PDB-RPV360-SYSDATE-MASK                              00006700
006800                                 PIC X(01)       VALUE ' '.       00006800
006900         05  PDB-RPV360-SYSDATE-ERROR                             00006900
007000                                 PIC X(01)       VALUE ' '.       00007000
007100         05  PDB-RPV360-SYSDATE-VID                               00007100
007200                                 PIC X(01)       VALUE 'D'.       00007200
007300         05  PDB-RPV360-SYSDATE-EL                                00007300
007400                                 PIC X(01)       VALUE 'N'.       00007400
007500         05  PDB-RPV360-SYSDATE-DCHG                              00007500
007600                                 PIC X(01)       VALUE ' '.       00007600
007700         05  FILLER              PIC X(01)       VALUE ' '.       00007700
007800         05  PDB-RPV360-DELETE                                    00007800
007900                                 PIC X(08)       VALUE 'DELETE  '.00007900
008000         05  FILLER              PIC S9(04)      COMP             00008000
008100                                                 VALUE +1.        00008100
008200         05  FILLER              PIC S9(04)      COMP             00008200
008300                                                 VALUE +0.        00008300
008400         05  FILLER              PIC S9(04)      COMP             00008400
008500                                                 VALUE +0.        00008500
008600         05  FILLER              PIC X(02)       VALUE 'CD'.      00008600
008700         05  PDB-RPV360-DELETE-MASK                               00008700
008800                                 PIC X(01)       VALUE ' '.       00008800
008900         05  PDB-RPV360-DELETE-ERROR                              00008900
009000                                 PIC X(01)       VALUE ' '.       00009000
009100         05  PDB-RPV360-DELETE-VID                                00009100
009200                                 PIC X(01)       VALUE 'I'.       00009200
009300         05  PDB-RPV360-DELETE-EL                                 00009300
009400                                 PIC X(01)       VALUE 'O'.       00009400
009500         05  PDB-RPV360-DELETE-DCHG                               00009500
009600                                 PIC X(01)       VALUE ' '.       00009600
009700         05  FILLER              PIC X(01)       VALUE ' '.       00009700
009800         05  PDB-RPV360-PRODCD                                    00009800
009900                                 PIC X(08)       VALUE 'PRODCD  '.00009900
010000         05  FILLER              PIC S9(04)      COMP             00010000
010100                                                 VALUE +6.        00010100
010200         05  FILLER              PIC S9(04)      COMP             00010200
010300                                                 VALUE +0.        00010300
010400         05  FILLER              PIC S9(04)      COMP             00010400
010500                                                 VALUE +0.        00010500
010600         05  FILLER              PIC X(02)       VALUE 'CD'.      00010600
010700         05  PDB-RPV360-PRODCD-MASK                               00010700
010800                                 PIC X(01)       VALUE ' '.       00010800
010900         05  PDB-RPV360-PRODCD-ERROR                              00010900
011000                                 PIC X(01)       VALUE ' '.       00011000
011100         05  PDB-RPV360-PRODCD-VID                                00011100
011200                                 PIC X(01)       VALUE 'D'.       00011200
011300         05  PDB-RPV360-PRODCD-EL                                 00011300
011400                                 PIC X(01)       VALUE 'N'.       00011400
011500         05  PDB-RPV360-PRODCD-DCHG                               00011500
011600                                 PIC X(01)       VALUE ' '.       00011600
011700         05  FILLER              PIC X(01)       VALUE ' '.       00011700
011800         05  PDB-RPV360-ACCOUNT                                   00011800
011900                                 PIC X(08)       VALUE 'ACCOUNT '.00011900
012000         05  FILLER              PIC S9(04)      COMP             00012000
012100                                                 VALUE +18.       00012100
012200         05  FILLER              PIC S9(04)      COMP             00012200
012300                                                 VALUE +0.        00012300
012400         05  FILLER              PIC S9(04)      COMP             00012400
012500                                                 VALUE +0.        00012500
012600         05  FILLER              PIC X(02)       VALUE 'CD'.      00012600
012700         05  PDB-RPV360-ACCOUNT-MASK                              00012700
012800                                 PIC X(01)       VALUE ' '.       00012800
012900         05  PDB-RPV360-ACCOUNT-ERROR                             00012900
013000                                 PIC X(01)       VALUE ' '.       00013000
013100         05  PDB-RPV360-ACCOUNT-VID                               00013100
013200                                 PIC X(01)       VALUE 'D'.       00013200
013300         05  PDB-RPV360-ACCOUNT-EL                                00013300
013400                                 PIC X(01)       VALUE 'N'.       00013400
013500         05  PDB-RPV360-ACCOUNT-DCHG                              00013500
013600                                 PIC X(01)       VALUE ' '.       00013600
013700         05  FILLER              PIC X(01)       VALUE ' '.       00013700
013800         05  PDB-RPV360-CUSTNA                                    00013800
013900                                 PIC X(08)       VALUE 'CUSTNA  '.00013900
014000         05  FILLER              PIC S9(04)      COMP             00014000
014100                                                 VALUE +40.       00014100
014200         05  FILLER              PIC S9(04)      COMP             00014200
014300                                                 VALUE +0.        00014300
014400         05  FILLER              PIC S9(04)      COMP             00014400
014500                                                 VALUE +0.        00014500
014600         05  FILLER              PIC X(02)       VALUE 'CD'.      00014600
014700         05  PDB-RPV360-CUSTNA-MASK                               00014700
014800                                 PIC X(01)       VALUE ' '.       00014800
014900         05  PDB-RPV360-CUSTNA-ERROR                              00014900
015000                                 PIC X(01)       VALUE ' '.       00015000
015100         05  PDB-RPV360-CUSTNA-VID                                00015100
015200                                 PIC X(01)       VALUE 'D'.       00015200
015300         05  PDB-RPV360-CUSTNA-EL                                 00015300
015400                                 PIC X(01)       VALUE 'N'.       00015400
015500         05  PDB-RPV360-CUSTNA-DCHG                               00015500
015600                                 PIC X(01)       VALUE ' '.       00015600
015700         05  FILLER              PIC X(01)       VALUE ' '.       00015700
015800         05  PDB-RPV360-MODEL                                     00015800
015900                                 PIC X(08)       VALUE 'MODEL   '.00015900
016000         05  FILLER              PIC S9(04)      COMP             00016000
016100                                                 VALUE +10.       00016100
016200         05  FILLER              PIC S9(04)      COMP             00016200
016300                                                 VALUE +0.        00016300
016400         05  FILLER              PIC S9(04)      COMP             00016400
016500                                                 VALUE +0.        00016500
016600         05  FILLER              PIC X(02)       VALUE 'CD'.      00016600
016700         05  PDB-RPV360-MODEL-MASK                                00016700
016800                                 PIC X(01)       VALUE ' '.       00016800
016900         05  PDB-RPV360-MODEL-ERROR                               00016900
017000                                 PIC X(01)       VALUE ' '.       00017000
017100         05  PDB-RPV360-MODEL-VID                                 00017100
017200                                 PIC X(01)       VALUE 'D'.       00017200
017300         05  PDB-RPV360-MODEL-EL                                  00017300
017400                                 PIC X(01)       VALUE 'N'.       00017400
017500         05  PDB-RPV360-MODEL-DCHG                                00017500
017600                                 PIC X(01)       VALUE ' '.       00017600
017700         05  FILLER              PIC X(01)       VALUE ' '.       00017700
017800         05  PDB-RPV360-MODDESC                                   00017800
017900                                 PIC X(08)       VALUE 'MODDESC '.00017900
018000         05  FILLER              PIC S9(04)      COMP             00018000
018100                                                 VALUE +20.       00018100
018200         05  FILLER              PIC S9(04)      COMP             00018200
018300                                                 VALUE +0.        00018300
018400         05  FILLER              PIC S9(04)      COMP             00018400
018500                                                 VALUE +0.        00018500
018600         05  FILLER              PIC X(02)       VALUE 'CD'.      00018600
018700         05  PDB-RPV360-MODDESC-MASK                              00018700
018800                                 PIC X(01)       VALUE ' '.       00018800
018900         05  PDB-RPV360-MODDESC-ERROR                             00018900
019000                                 PIC X(01)       VALUE ' '.       00019000
019100         05  PDB-RPV360-MODDESC-VID                               00019100
019200                                 PIC X(01)       VALUE 'D'.       00019200
019300         05  PDB-RPV360-MODDESC-EL                                00019300
019400                                 PIC X(01)       VALUE 'N'.       00019400
019500         05  PDB-RPV360-MODDESC-DCHG                              00019500
019600                                 PIC X(01)       VALUE ' '.       00019600
019700         05  FILLER              PIC X(01)       VALUE ' '.       00019700
019800         05  PDB-RPV360-IDNBR                                     00019800
019900                                 PIC X(08)       VALUE 'IDNBR   '.00019900
020000         05  FILLER              PIC S9(04)      COMP             00020000
020100                                                 VALUE +18.       00020100
020200         05  FILLER              PIC S9(04)      COMP             00020200
020300                                                 VALUE +0.        00020300
020400         05  FILLER              PIC S9(04)      COMP             00020400
020500                                                 VALUE +0.        00020500
020600         05  FILLER              PIC X(02)       VALUE 'CD'.      00020600
020700         05  PDB-RPV360-IDNBR-MASK                                00020700
020800                                 PIC X(01)       VALUE ' '.       00020800
020900         05  PDB-RPV360-IDNBR-ERROR                               00020900
021000                                 PIC X(01)       VALUE ' '.       00021000
021100         05  PDB-RPV360-IDNBR-VID                                 00021100
021200                                 PIC X(01)       VALUE 'D'.       00021200
021300         05  PDB-RPV360-IDNBR-EL                                  00021300
021400                                 PIC X(01)       VALUE 'N'.       00021400
021500         05  PDB-RPV360-IDNBR-DCHG                                00021500
021600                                 PIC X(01)       VALUE ' '.       00021600
021700         05  FILLER              PIC X(01)       VALUE ' '.       00021700
021800         05  PDB-RPV360-STATUS                                    00021800
021900                                 PIC X(08)       VALUE 'STATUS  '.00021900
022000         05  FILLER              PIC S9(04)      COMP             00022000
022100                                                 VALUE +8.        00022100
022200         05  FILLER              PIC S9(04)      COMP             00022200
022300                                                 VALUE +0.        00022300
022400         05  FILLER              PIC S9(04)      COMP             00022400
022500                                                 VALUE +0.        00022500
022600         05  FILLER              PIC X(02)       VALUE 'CD'.      00022600
022700         05  PDB-RPV360-STATUS-MASK                               00022700
022800                                 PIC X(01)       VALUE ' '.       00022800
022900         05  PDB-RPV360-STATUS-ERROR                              00022900
023000                                 PIC X(01)       VALUE ' '.       00023000
023100         05  PDB-RPV360-STATUS-VID                                00023100
023200                                 PIC X(01)       VALUE 'D'.       00023200
023300         05  PDB-RPV360-STATUS-EL                                 00023300
023400                                 PIC X(01)       VALUE 'N'.       00023400
023500         05  PDB-RPV360-STATUS-DCHG                               00023500
023600                                 PIC X(01)       VALUE ' '.       00023600
023700         05  FILLER              PIC X(01)       VALUE ' '.       00023700
023800         05  PDB-RPV360-CRWINST                                   00023800
023900                                 PIC X(08)       VALUE 'CRWINST '.00023900
024000         05  FILLER              PIC S9(04)      COMP             00024000
024100                                                 VALUE +4.        00024100
024200         05  FILLER              PIC S9(04)      COMP             00024200
024300                                                 VALUE +0.        00024300
024400         05  FILLER              PIC S9(04)      COMP             00024400
024500                                                 VALUE +0.        00024500
024600         05  FILLER              PIC X(02)       VALUE 'CD'.      00024600
024700         05  PDB-RPV360-CRWINST-MASK                              00024700
024800                                 PIC X(01)       VALUE ' '.       00024800
024900         05  PDB-RPV360-CRWINST-ERROR                             00024900
025000                                 PIC X(01)       VALUE ' '.       00025000
025100         05  PDB-RPV360-CRWINST-VID                               00025100
025200                                 PIC X(01)       VALUE 'I'.       00025200
025300         05  PDB-RPV360-CRWINST-EL                                00025300
025400                                 PIC X(01)       VALUE 'O'.       00025400
025500         05  PDB-RPV360-CRWINST-DCHG                              00025500
025600                                 PIC X(01)       VALUE ' '.       00025600
025700         05  FILLER              PIC X(01)       VALUE ' '.       00025700
025800         05  PDB-RPV360-CRWPROD                                   00025800
025900                                 PIC X(08)       VALUE 'CRWPROD '.00025900
026000         05  FILLER              PIC S9(04)      COMP             00026000
026100                                                 VALUE +6.        00026100
026200         05  FILLER              PIC S9(04)      COMP             00026200
026300                                                 VALUE +0.        00026300
026400         05  FILLER              PIC S9(04)      COMP             00026400
026500                                                 VALUE +0.        00026500
026600         05  FILLER              PIC X(02)       VALUE 'CD'.      00026600
026700         05  PDB-RPV360-CRWPROD-MASK                              00026700
026800                                 PIC X(01)       VALUE ' '.       00026800
026900         05  PDB-RPV360-CRWPROD-ERROR                             00026900
027000                                 PIC X(01)       VALUE ' '.       00027000
027100         05  PDB-RPV360-CRWPROD-VID                               00027100
027200                                 PIC X(01)       VALUE 'I'.       00027200
027300         05  PDB-RPV360-CRWPROD-EL                                00027300
027400                                 PIC X(01)       VALUE 'O'.       00027400
027500         05  PDB-RPV360-CRWPROD-DCHG                              00027500
027600                                 PIC X(01)       VALUE ' '.       00027600
027700         05  FILLER              PIC X(01)       VALUE ' '.       00027700
027800         05  PDB-RPV360-CRWACCT                                   00027800
027900                                 PIC X(08)       VALUE 'CRWACCT '.00027900
028000         05  FILLER              PIC S9(04)      COMP             00028000
028100                                                 VALUE +18.       00028100
028200         05  FILLER              PIC S9(04)      COMP             00028200
028300                                                 VALUE +0.        00028300
028400         05  FILLER              PIC S9(04)      COMP             00028400
028500                                                 VALUE +0.        00028500
028600         05  FILLER              PIC X(02)       VALUE 'CD'.      00028600
028700         05  PDB-RPV360-CRWACCT-MASK                              00028700
028800                                 PIC X(01)       VALUE ' '.       00028800
028900         05  PDB-RPV360-CRWACCT-ERROR                             00028900
029000                                 PIC X(01)       VALUE ' '.       00029000
029100         05  PDB-RPV360-CRWACCT-VID                               00029100
029200                                 PIC X(01)       VALUE 'I'.       00029200
029300         05  PDB-RPV360-CRWACCT-EL                                00029300
029400                                 PIC X(01)       VALUE 'O'.       00029400
029500         05  PDB-RPV360-CRWACCT-DCHG                              00029500
029600                                 PIC X(01)       VALUE ' '.       00029600
029700         05  FILLER              PIC X(01)       VALUE ' '.       00029700
029800         05  PDB-RPV360-FREQ                                      00029800
029900                                 PIC X(08)       VALUE 'FREQ    '.00029900
030000         05  FILLER              PIC S9(04)      COMP             00030000
030100                                                 VALUE +1.        00030100
030200         05  FILLER              PIC S9(04)      COMP             00030200
030300                                                 VALUE +0.        00030300
030400         05  FILLER              PIC S9(04)      COMP             00030400
030500                                                 VALUE +0.        00030500
030600         05  FILLER              PIC X(02)       VALUE 'CD'.      00030600
030700         05  PDB-RPV360-FREQ-MASK                                 00030700
030800                                 PIC X(01)       VALUE ' '.       00030800
030900         05  PDB-RPV360-FREQ-ERROR                                00030900
031000                                 PIC X(01)       VALUE ' '.       00031000
031100         05  PDB-RPV360-FREQ-VID                                  00031100
031200                                 PIC X(01)       VALUE 'I'.       00031200
031300         05  PDB-RPV360-FREQ-EL                                   00031300
031400                                 PIC X(01)       VALUE 'O'.       00031400
031500         05  PDB-RPV360-FREQ-DCHG                                 00031500
031600                                 PIC X(01)       VALUE ' '.       00031600
031700         05  FILLER              PIC X(01)       VALUE ' '.       00031700
031800         05  PDB-RPV360-CALCAMT                                   00031800
031900                                 PIC X(08)       VALUE 'CALCAMT '.00031900
032000         05  FILLER              PIC S9(04)      COMP             00032000
032100                                                 VALUE +16.       00032100
032200         05  FILLER              PIC S9(04)      COMP             00032200
032300                                                 VALUE +0.        00032300
032400         05  FILLER              PIC S9(04)      COMP             00032400
032500                                                 VALUE +0.        00032500
032600         05  FILLER              PIC X(02)       VALUE 'CD'.      00032600
032700         05  PDB-RPV360-CALCAMT-MASK                              00032700
032800                                 PIC X(01)       VALUE ' '.       00032800
032900         05  PDB-RPV360-CALCAMT-ERROR                             00032900
033000                                 PIC X(01)       VALUE ' '.       00033000
033100         05  PDB-RPV360-CALCAMT-VID                               00033100
033200                                 PIC X(01)       VALUE 'D'.       00033200
033300         05  PDB-RPV360-CALCAMT-EL                                00033300
033400                                 PIC X(01)       VALUE 'N'.       00033400
033500         05  PDB-RPV360-CALCAMT-DCHG                              00033500
033600                                 PIC X(01)       VALUE ' '.       00033600
033700         05  FILLER              PIC X(01)       VALUE ' '.       00033700
033800         05  PDB-RPV360-TERM                                      00033800
033900                                 PIC X(08)       VALUE 'TERM    '.00033900
034000         05  FILLER              PIC S9(04)      COMP             00034000
034100                                                 VALUE +3.        00034100
034200         05  FILLER              PIC S9(04)      COMP             00034200
034300                                                 VALUE +0.        00034300
034400         05  FILLER              PIC S9(04)      COMP             00034400
034500                                                 VALUE +0.        00034500
034600         05  FILLER              PIC X(02)       VALUE 'CD'.      00034600
034700         05  PDB-RPV360-TERM-MASK                                 00034700
034800                                 PIC X(01)       VALUE ' '.       00034800
034900         05  PDB-RPV360-TERM-ERROR                                00034900
035000                                 PIC X(01)       VALUE ' '.       00035000
035100         05  PDB-RPV360-TERM-VID                                  00035100
035200                                 PIC X(01)       VALUE 'I'.       00035200
035300         05  PDB-RPV360-TERM-EL                                   00035300
035400                                 PIC X(01)       VALUE 'O'.       00035400
035500         05  PDB-RPV360-TERM-DCHG                                 00035500
035600                                 PIC X(01)       VALUE ' '.       00035600
035700         05  FILLER              PIC X(01)       VALUE ' '.       00035700
035800         05  PDB-RPV360-LASTAMT                                   00035800
035900                                 PIC X(08)       VALUE 'LASTAMT '.00035900
036000         05  FILLER              PIC S9(04)      COMP             00036000
036100                                                 VALUE +16.       00036100
036200         05  FILLER              PIC S9(04)      COMP             00036200
036300                                                 VALUE +0.        00036300
036400         05  FILLER              PIC S9(04)      COMP             00036400
036500                                                 VALUE +0.        00036500
036600         05  FILLER              PIC X(02)       VALUE 'CD'.      00036600
036700         05  PDB-RPV360-LASTAMT-MASK                              00036700
036800                                 PIC X(01)       VALUE ' '.       00036800
036900         05  PDB-RPV360-LASTAMT-ERROR                             00036900
037000                                 PIC X(01)       VALUE ' '.       00037000
037100         05  PDB-RPV360-LASTAMT-VID                               00037100
037200                                 PIC X(01)       VALUE 'D'.       00037200
037300         05  PDB-RPV360-LASTAMT-EL                                00037300
037400                                 PIC X(01)       VALUE 'N'.       00037400
037500         05  PDB-RPV360-LASTAMT-DCHG                              00037500
037600                                 PIC X(01)       VALUE ' '.       00037600
037700         05  FILLER              PIC X(01)       VALUE ' '.       00037700
037800         05  PDB-RPV360-DAY                                       00037800
037900                                 PIC X(08)       VALUE 'DAY     '.00037900
038000         05  FILLER              PIC S9(04)      COMP             00038000
038100                                                 VALUE +2.        00038100
038200         05  FILLER              PIC S9(04)      COMP             00038200
038300                                                 VALUE +0.        00038300
038400         05  FILLER              PIC S9(04)      COMP             00038400
038500                                                 VALUE +0.        00038500
038600         05  FILLER              PIC X(02)       VALUE 'CD'.      00038600
038700         05  PDB-RPV360-DAY-MASK                                  00038700
038800                                 PIC X(01)       VALUE ' '.       00038800
038900         05  PDB-RPV360-DAY-ERROR                                 00038900
039000                                 PIC X(01)       VALUE ' '.       00039000
039100         05  PDB-RPV360-DAY-VID                                   00039100
039200                                 PIC X(01)       VALUE 'I'.       00039200
039300         05  PDB-RPV360-DAY-EL                                    00039300
039400                                 PIC X(01)       VALUE 'O'.       00039400
039500         05  PDB-RPV360-DAY-DCHG                                  00039500
039600                                 PIC X(01)       VALUE ' '.       00039600
039700         05  FILLER              PIC X(01)       VALUE ' '.       00039700
039800         05  PDB-RPV360-PERCENT                                   00039800
039900                                 PIC X(08)       VALUE 'PERCENT '.00039900
040000         05  FILLER              PIC S9(04)      COMP             00040000
040100                                                 VALUE +10.       00040100
040200         05  FILLER              PIC S9(04)      COMP             00040200
040300                                                 VALUE +0.        00040300
040400         05  FILLER              PIC S9(04)      COMP             00040400
040500                                                 VALUE +0.        00040500
040600         05  FILLER              PIC X(02)       VALUE 'CD'.      00040600
040700         05  PDB-RPV360-PERCENT-MASK                              00040700
040800                                 PIC X(01)       VALUE ' '.       00040800
040900         05  PDB-RPV360-PERCENT-ERROR                             00040900
041000                                 PIC X(01)       VALUE ' '.       00041000
041100         05  PDB-RPV360-PERCENT-VID                               00041100
041200                                 PIC X(01)       VALUE 'D'.       00041200
041300         05  PDB-RPV360-PERCENT-EL                                00041300
041400                                 PIC X(01)       VALUE 'N'.       00041400
041500         05  PDB-RPV360-PERCENT-DCHG                              00041500
041600                                 PIC X(01)       VALUE ' '.       00041600
041700         05  FILLER              PIC X(01)       VALUE ' '.       00041700
041800         05  PDB-RPV360-DTENXTMM                                  00041800
041900                                 PIC X(08)       VALUE 'DTENXTMM'.00041900
042000         05  FILLER              PIC S9(04)      COMP             00042000
042100                                                 VALUE +2.        00042100
042200         05  FILLER              PIC S9(04)      COMP             00042200
042300                                                 VALUE +0.        00042300
042400         05  FILLER              PIC S9(04)      COMP             00042400
042500                                                 VALUE +0.        00042500
042600         05  FILLER              PIC X(02)       VALUE 'CD'.      00042600
042700         05  PDB-RPV360-DTENXTMM-MASK                             00042700
042800                                 PIC X(01)       VALUE ' '.       00042800
042900         05  PDB-RPV360-DTENXTMM-ERROR                            00042900
043000                                 PIC X(01)       VALUE ' '.       00043000
043100         05  PDB-RPV360-DTENXTMM-VID                              00043100
043200                                 PIC X(01)       VALUE 'I'.       00043200
043300         05  PDB-RPV360-DTENXTMM-EL                               00043300
043400                                 PIC X(01)       VALUE 'O'.       00043400
043500         05  PDB-RPV360-DTENXTMM-DCHG                             00043500
043600                                 PIC X(01)       VALUE ' '.       00043600
043700         05  FILLER              PIC X(01)       VALUE ' '.       00043700
043800         05  PDB-RPV360-DTENXTDD                                  00043800
043900                                 PIC X(08)       VALUE 'DTENXTDD'.00043900
044000         05  FILLER              PIC S9(04)      COMP             00044000
044100                                                 VALUE +2.        00044100
044200         05  FILLER              PIC S9(04)      COMP             00044200
044300                                                 VALUE +0.        00044300
044400         05  FILLER              PIC S9(04)      COMP             00044400
044500                                                 VALUE +0.        00044500
044600         05  FILLER              PIC X(02)       VALUE 'CD'.      00044600
044700         05  PDB-RPV360-DTENXTDD-MASK                             00044700
044800                                 PIC X(01)       VALUE ' '.       00044800
044900         05  PDB-RPV360-DTENXTDD-ERROR                            00044900
045000                                 PIC X(01)       VALUE ' '.       00045000
045100         05  PDB-RPV360-DTENXTDD-VID                              00045100
045200                                 PIC X(01)       VALUE 'I'.       00045200
045300         05  PDB-RPV360-DTENXTDD-EL                               00045300
045400                                 PIC X(01)       VALUE 'O'.       00045400
045500         05  PDB-RPV360-DTENXTDD-DCHG                             00045500
045600                                 PIC X(01)       VALUE ' '.       00045600
045700         05  FILLER              PIC X(01)       VALUE ' '.       00045700
045800         05  PDB-RPV360-DTENXTYY                                  00045800
045900                                 PIC X(08)       VALUE 'DTENXTYY'.00045900
046000         05  FILLER              PIC S9(04)      COMP             00046000
046100                                                 VALUE +4.        00046100
046200         05  FILLER              PIC S9(04)      COMP             00046200
046300                                                 VALUE +0.        00046300
046400         05  FILLER              PIC S9(04)      COMP             00046400
046500                                                 VALUE +0.        00046500
046600         05  FILLER              PIC X(02)       VALUE 'CD'.      00046600
046700         05  PDB-RPV360-DTENXTYY-MASK                             00046700
046800                                 PIC X(01)       VALUE ' '.       00046800
046900         05  PDB-RPV360-DTENXTYY-ERROR                            00046900
047000                                 PIC X(01)       VALUE ' '.       00047000
047100         05  PDB-RPV360-DTENXTYY-VID                              00047100
047200                                 PIC X(01)       VALUE 'I'.       00047200
047300         05  PDB-RPV360-DTENXTYY-EL                               00047300
047400                                 PIC X(01)       VALUE 'O'.       00047400
047500         05  PDB-RPV360-DTENXTYY-DCHG                             00047500
047600                                 PIC X(01)       VALUE ' '.       00047600
047700         05  FILLER              PIC X(01)       VALUE ' '.       00047700
047800         05  PDB-RPV360-CMBUSED                                   00047800
047900                                 PIC X(08)       VALUE 'CMBUSED '.00047900
048000         05  FILLER              PIC S9(04)      COMP             00048000
048100                                                 VALUE +20.       00048100
048200         05  FILLER              PIC S9(04)      COMP             00048200
048300                                                 VALUE +0.        00048300
048400         05  FILLER              PIC S9(04)      COMP             00048400
048500                                                 VALUE +0.        00048500
048600         05  FILLER              PIC X(02)       VALUE 'CD'.      00048600
048700         05  PDB-RPV360-CMBUSED-MASK                              00048700
048800                                 PIC X(01)       VALUE ' '.       00048800
048900         05  PDB-RPV360-CMBUSED-ERROR                             00048900
049000                                 PIC X(01)       VALUE ' '.       00049000
049100         05  PDB-RPV360-CMBUSED-VID                               00049100
049200                                 PIC X(01)       VALUE 'D'.       00049200
049300         05  PDB-RPV360-CMBUSED-EL                                00049300
049400                                 PIC X(01)       VALUE 'N'.       00049400
049500         05  PDB-RPV360-CMBUSED-DCHG                              00049500
049600                                 PIC X(01)       VALUE ' '.       00049600
049700         05  FILLER              PIC X(01)       VALUE ' '.       00049700
049800         05  PDB-RPV360-DTELSTMM                                  00049800
049900                                 PIC X(08)       VALUE 'DTELSTMM'.00049900
050000         05  FILLER              PIC S9(04)      COMP             00050000
050100                                                 VALUE +2.        00050100
050200         05  FILLER              PIC S9(04)      COMP             00050200
050300                                                 VALUE +0.        00050300
050400         05  FILLER              PIC S9(04)      COMP             00050400
050500                                                 VALUE +0.        00050500
050600         05  FILLER              PIC X(02)       VALUE 'CD'.      00050600
050700         05  PDB-RPV360-DTELSTMM-MASK                             00050700
050800                                 PIC X(01)       VALUE ' '.       00050800
050900         05  PDB-RPV360-DTELSTMM-ERROR                            00050900
051000                                 PIC X(01)       VALUE ' '.       00051000
051100         05  PDB-RPV360-DTELSTMM-VID                              00051100
051200                                 PIC X(01)       VALUE 'D'.       00051200
051300         05  PDB-RPV360-DTELSTMM-EL                               00051300
051400                                 PIC X(01)       VALUE 'N'.       00051400
051500         05  PDB-RPV360-DTELSTMM-DCHG                             00051500
051600                                 PIC X(01)       VALUE ' '.       00051600
051700         05  FILLER              PIC X(01)       VALUE ' '.       00051700
051800         05  PDB-RPV360-DTELSTDD                                  00051800
051900                                 PIC X(08)       VALUE 'DTELSTDD'.00051900
052000         05  FILLER              PIC S9(04)      COMP             00052000
052100                                                 VALUE +2.        00052100
052200         05  FILLER              PIC S9(04)      COMP             00052200
052300                                                 VALUE +0.        00052300
052400         05  FILLER              PIC S9(04)      COMP             00052400
052500                                                 VALUE +0.        00052500
052600         05  FILLER              PIC X(02)       VALUE 'CD'.      00052600
052700         05  PDB-RPV360-DTELSTDD-MASK                             00052700
052800                                 PIC X(01)       VALUE ' '.       00052800
052900         05  PDB-RPV360-DTELSTDD-ERROR                            00052900
053000                                 PIC X(01)       VALUE ' '.       00053000
053100         05  PDB-RPV360-DTELSTDD-VID                              00053100
053200                                 PIC X(01)       VALUE 'D'.       00053200
053300         05  PDB-RPV360-DTELSTDD-EL                               00053300
053400                                 PIC X(01)       VALUE 'N'.       00053400
053500         05  PDB-RPV360-DTELSTDD-DCHG                             00053500
053600                                 PIC X(01)       VALUE ' '.       00053600
053700         05  FILLER              PIC X(01)       VALUE ' '.       00053700
053800         05  PDB-RPV360-DTELSTYY                                  00053800
053900                                 PIC X(08)       VALUE 'DTELSTYY'.00053900
054000         05  FILLER              PIC S9(04)      COMP             00054000
054100                                                 VALUE +4.        00054100
054200         05  FILLER              PIC S9(04)      COMP             00054200
054300                                                 VALUE +0.        00054300
054400         05  FILLER              PIC S9(04)      COMP             00054400
054500                                                 VALUE +0.        00054500
054600         05  FILLER              PIC X(02)       VALUE 'CD'.      00054600
054700         05  PDB-RPV360-DTELSTYY-MASK                             00054700
054800                                 PIC X(01)       VALUE ' '.       00054800
054900         05  PDB-RPV360-DTELSTYY-ERROR                            00054900
055000                                 PIC X(01)       VALUE ' '.       00055000
055100         05  PDB-RPV360-DTELSTYY-VID                              00055100
055200                                 PIC X(01)       VALUE 'D'.       00055200
055300         05  PDB-RPV360-DTELSTYY-EL                               00055300
055400                                 PIC X(01)       VALUE 'N'.       00055400
055500         05  PDB-RPV360-DTELSTYY-DCHG                             00055500
055600                                 PIC X(01)       VALUE ' '.       00055600
055700         05  FILLER              PIC X(01)       VALUE ' '.       00055700
055800         05  PDB-RPV360-PAIDYTD                                   00055800
055900                                 PIC X(08)       VALUE 'PAIDYTD '.00055900
056000         05  FILLER              PIC S9(04)      COMP             00056000
056100                                                 VALUE +20.       00056100
056200         05  FILLER              PIC S9(04)      COMP             00056200
056300                                                 VALUE +0.        00056300
056400         05  FILLER              PIC S9(04)      COMP             00056400
056500                                                 VALUE +0.        00056500
056600         05  FILLER              PIC X(02)       VALUE 'CD'.      00056600
056700         05  PDB-RPV360-PAIDYTD-MASK                              00056700
056800                                 PIC X(01)       VALUE ' '.       00056800
056900         05  PDB-RPV360-PAIDYTD-ERROR                             00056900
057000                                 PIC X(01)       VALUE ' '.       00057000
057100         05  PDB-RPV360-PAIDYTD-VID                               00057100
057200                                 PIC X(01)       VALUE 'D'.       00057200
057300         05  PDB-RPV360-PAIDYTD-EL                                00057300
057400                                 PIC X(01)       VALUE 'N'.       00057400
057500         05  PDB-RPV360-PAIDYTD-DCHG                              00057500
057600                                 PIC X(01)       VALUE ' '.       00057600
057700         05  FILLER              PIC X(01)       VALUE ' '.       00057700
057800         05  PDB-RPV360-DTEOPNMM                                  00057800
057900                                 PIC X(08)       VALUE 'DTEOPNMM'.00057900
058000         05  FILLER              PIC S9(04)      COMP             00058000
058100                                                 VALUE +2.        00058100
058200         05  FILLER              PIC S9(04)      COMP             00058200
058300                                                 VALUE +0.        00058300
058400         05  FILLER              PIC S9(04)      COMP             00058400
058500                                                 VALUE +0.        00058500
058600         05  FILLER              PIC X(02)       VALUE 'CD'.      00058600
058700         05  PDB-RPV360-DTEOPNMM-MASK                             00058700
058800                                 PIC X(01)       VALUE ' '.       00058800
058900         05  PDB-RPV360-DTEOPNMM-ERROR                            00058900
059000                                 PIC X(01)       VALUE ' '.       00059000
059100         05  PDB-RPV360-DTEOPNMM-VID                              00059100
059200                                 PIC X(01)       VALUE 'D'.       00059200
059300         05  PDB-RPV360-DTEOPNMM-EL                               00059300
059400                                 PIC X(01)       VALUE 'N'.       00059400
059500         05  PDB-RPV360-DTEOPNMM-DCHG                             00059500
059600                                 PIC X(01)       VALUE ' '.       00059600
059700         05  FILLER              PIC X(01)       VALUE ' '.       00059700
059800         05  PDB-RPV360-DTEOPNDD                                  00059800
059900                                 PIC X(08)       VALUE 'DTEOPNDD'.00059900
060000         05  FILLER              PIC S9(04)      COMP             00060000
060100                                                 VALUE +2.        00060100
060200         05  FILLER              PIC S9(04)      COMP             00060200
060300                                                 VALUE +0.        00060300
060400         05  FILLER              PIC S9(04)      COMP             00060400
060500                                                 VALUE +0.        00060500
060600         05  FILLER              PIC X(02)       VALUE 'CD'.      00060600
060700         05  PDB-RPV360-DTEOPNDD-MASK                             00060700
060800                                 PIC X(01)       VALUE ' '.       00060800
060900         05  PDB-RPV360-DTEOPNDD-ERROR                            00060900
061000                                 PIC X(01)       VALUE ' '.       00061000
061100         05  PDB-RPV360-DTEOPNDD-VID                              00061100
061200                                 PIC X(01)       VALUE 'D'.       00061200
061300         05  PDB-RPV360-DTEOPNDD-EL                               00061300
061400                                 PIC X(01)       VALUE 'N'.       00061400
061500         05  PDB-RPV360-DTEOPNDD-DCHG                             00061500
061600                                 PIC X(01)       VALUE ' '.       00061600
061700         05  FILLER              PIC X(01)       VALUE ' '.       00061700
061800         05  PDB-RPV360-DTEOPNYY                                  00061800
061900                                 PIC X(08)       VALUE 'DTEOPNYY'.00061900
062000         05  FILLER              PIC S9(04)      COMP             00062000
062100                                                 VALUE +4.        00062100
062200         05  FILLER              PIC S9(04)      COMP             00062200
062300                                                 VALUE +0.        00062300
062400         05  FILLER              PIC S9(04)      COMP             00062400
062500                                                 VALUE +0.        00062500
062600         05  FILLER              PIC X(02)       VALUE 'CD'.      00062600
062700         05  PDB-RPV360-DTEOPNYY-MASK                             00062700
062800                                 PIC X(01)       VALUE ' '.       00062800
062900         05  PDB-RPV360-DTEOPNYY-ERROR                            00062900
063000                                 PIC X(01)       VALUE ' '.       00063000
063100         05  PDB-RPV360-DTEOPNYY-VID                              00063100
063200                                 PIC X(01)       VALUE 'D'.       00063200
063300         05  PDB-RPV360-DTEOPNYY-EL                               00063300
063400                                 PIC X(01)       VALUE 'N'.       00063400
063500         05  PDB-RPV360-DTEOPNYY-DCHG                             00063500
063600                                 PIC X(01)       VALUE ' '.       00063600
063700         05  FILLER              PIC X(01)       VALUE ' '.       00063700
063800         05  PDB-RPV360-MSGLINE                                   00063800
063900                                 PIC X(08)       VALUE 'MSGLINE '.00063900
064000         05  FILLER              PIC S9(04)      COMP             00064000
064100                                                 VALUE +78.       00064100
064200         05  FILLER              PIC S9(04)      COMP             00064200
064300                                                 VALUE +0.        00064300
064400         05  FILLER              PIC S9(04)      COMP             00064400
064500                                                 VALUE +0.        00064500
064600         05  FILLER              PIC X(02)       VALUE 'CD'.      00064600
064700         05  PDB-RPV360-MSGLINE-MASK                              00064700
064800                                 PIC X(01)       VALUE ' '.       00064800
064900         05  PDB-RPV360-MSGLINE-ERROR                             00064900
065000                                 PIC X(01)       VALUE ' '.       00065000
065100         05  PDB-RPV360-MSGLINE-VID                               00065100
065200                                 PIC X(01)       VALUE 'D'.       00065200
065300         05  PDB-RPV360-MSGLINE-EL                                00065300
065400                                 PIC X(01)       VALUE 'I'.       00065400
065500         05  PDB-RPV360-MSGLINE-DCHG                              00065500
065600                                 PIC X(01)       VALUE ' '.       00065600
065700         05  FILLER              PIC X(01)       VALUE ' '.       00065700
065800         05  PDB-RPV360-COMMAND                                   00065800
065900                                 PIC X(08)       VALUE 'COMMAND '.00065900
066000         05  FILLER              PIC S9(04)      COMP             00066000
066100                                                 VALUE +65.       00066100
066200         05  FILLER              PIC S9(04)      COMP             00066200
066300                                                 VALUE +0.        00066300
066400         05  FILLER              PIC S9(04)      COMP             00066400
066500                                                 VALUE +0.        00066500
066600         05  FILLER              PIC X(02)       VALUE 'CD'.      00066600
066700         05  PDB-RPV360-COMMAND-MASK                              00066700
066800                                 PIC X(01)       VALUE ' '.       00066800
066900         05  PDB-RPV360-COMMAND-ERROR                             00066900
067000                                 PIC X(01)       VALUE ' '.       00067000
067100         05  PDB-RPV360-COMMAND-VID                               00067100
067200                                 PIC X(01)       VALUE 'I'.       00067200
067300         05  PDB-RPV360-COMMAND-EL                                00067300
067400                                 PIC X(01)       VALUE 'O'.       00067400
067500         05  PDB-RPV360-COMMAND-DCHG                              00067500
067600                                 PIC X(01)       VALUE ' '.       00067600
067700         05  FILLER              PIC X(01)       VALUE ' '.       00067700
067800         05  PDB-RPV360-PFLINE1                                   00067800
067900                                 PIC X(08)       VALUE 'PFLINE1 '.00067900
068000         05  FILLER              PIC S9(04)      COMP             00068000
068100                                                 VALUE +78.       00068100
068200         05  FILLER              PIC S9(04)      COMP             00068200
068300                                                 VALUE +0.        00068300
068400         05  FILLER              PIC S9(04)      COMP             00068400
068500                                                 VALUE +0.        00068500
068600         05  FILLER              PIC X(02)       VALUE 'CD'.      00068600
068700         05  PDB-RPV360-PFLINE1-MASK                              00068700
068800                                 PIC X(01)       VALUE ' '.       00068800
068900         05  PDB-RPV360-PFLINE1-ERROR                             00068900
069000                                 PIC X(01)       VALUE ' '.       00069000
069100         05  PDB-RPV360-PFLINE1-VID                               00069100
069200                                 PIC X(01)       VALUE 'D'.       00069200
069300         05  PDB-RPV360-PFLINE1-EL                                00069300
069400                                 PIC X(01)       VALUE 'N'.       00069400
069500         05  PDB-RPV360-PFLINE1-DCHG                              00069500
069600                                 PIC X(01)       VALUE ' '.       00069600
069700         05  FILLER              PIC X(01)       VALUE ' '.       00069700
069800         05  PDB-RPV360-PFLINE2                                   00069800
069900                                 PIC X(08)       VALUE 'PFLINE2 '.00069900
070000         05  FILLER              PIC S9(04)      COMP             00070000
070100                                                 VALUE +78.       00070100
070200         05  FILLER              PIC S9(04)      COMP             00070200
070300                                                 VALUE +0.        00070300
070400         05  FILLER              PIC S9(04)      COMP             00070400
070500                                                 VALUE +0.        00070500
070600         05  FILLER              PIC X(02)       VALUE 'CD'.      00070600
070700         05  PDB-RPV360-PFLINE2-MASK                              00070700
070800                                 PIC X(01)       VALUE ' '.       00070800
070900         05  PDB-RPV360-PFLINE2-ERROR                             00070900
071000                                 PIC X(01)       VALUE ' '.       00071000
071100         05  PDB-RPV360-PFLINE2-VID                               00071100
071200                                 PIC X(01)       VALUE 'D'.       00071200
071300         05  PDB-RPV360-PFLINE2-EL                                00071300
071400                                 PIC X(01)       VALUE 'N'.       00071400
071500         05  PDB-RPV360-PFLINE2-DCHG                              00071500
071600                                 PIC X(01)       VALUE ' '.       00071600
071700         05  FILLER              PIC X(01)       VALUE ' '.       00071700
071800         05  FILLER              PIC X(08)       VALUE LOW-VALUE. 00071800
071900                                                                  00071900
072000 01  RPV360-PANL-DATA-AREA.                                       00072000
072100     03  RPV360-OPERID           PIC X(08).                       00072100
072200     03  RPV360-INST             PIC X(04).                       00072200
072300     03  RPV360-SYSDATE          PIC X(10).                       00072300
072400     03  RPV360-DELETE           PIC X(01).                       00072400
072500     03  RPV360-PRODCD           PIC X(06).                       00072500
072600     03  RPV360-ACCOUNT          PIC X(18).                       00072600
072700     03  RPV360-CUSTNA           PIC X(40).                       00072700
072800     03  RPV360-MODEL            PIC X(10).                       00072800
072900     03  RPV360-MODDESC          PIC X(20).                       00072900
073000     03  RPV360-IDNBR            PIC X(18).                       00073000
073100     03  RPV360-STATUS           PIC X(08).                       00073100
073200     03  RPV360-CRWINST          PIC X(04).                       00073200
073300     03  RPV360-CRWPROD          PIC X(06).                       00073300
073400     03  RPV360-CRWACCT          PIC X(18).                       00073400
073500     03  RPV360-FREQ             PIC X(01).                       00073500
073600     03  RPV360-CALCAMT          PIC X(16).                       00073600
073700     03  RPV360-TERM             PIC X(03).                       00073700
073800     03  RPV360-LASTAMT          PIC X(16).                       00073800
073900     03  RPV360-DAY              PIC X(02).                       00073900
074000     03  RPV360-PERCENT          PIC X(10).                       00074000
074100     03  RPV360-DTENXTMM         PIC X(02).                       00074100
074200     03  RPV360-DTENXTDD         PIC X(02).                       00074200
074300     03  RPV360-DTENXTYY         PIC X(04).                       00074300
074400     03  RPV360-CMBUSED          PIC X(20).                       00074400
074500     03  RPV360-DTELSTMM         PIC X(02).                       00074500
074600     03  RPV360-DTELSTDD         PIC X(02).                       00074600
074700     03  RPV360-DTELSTYY         PIC X(04).                       00074700
074800     03  RPV360-PAIDYTD          PIC X(20).                       00074800
074900     03  RPV360-DTEOPNMM         PIC X(02).                       00074900
075000     03  RPV360-DTEOPNDD         PIC X(02).                       00075000
075100     03  RPV360-DTEOPNYY         PIC X(04).                       00075100
075200     03  RPV360-MSGLINE          PIC X(78).                       00075200
075300     03  RPV360-COMMAND          PIC X(65).                       00075300
075400     03  RPV360-PFLINE1          PIC X(78).                       00075400
075500     03  RPV360-PFLINE2          PIC X(78).                       00075500
075600 01  RPV360-ERROR-FIELD                                           00075600
075700                                 PIC X(08).                       00075700
075800 01  RPV360-SW-SET-CURSOR                                         00075800
075900                                 PIC X(01)       VALUE 'N'.       00075900
076000******************************************************************00076000
