000010*01  RPW015-AREAS.                                                00001000
000020     03  RPW015-INST             PIC 9(04)       VALUE ZEROS.     00002000
000030     03  RPW015-PRODCODE         PIC X(06)       VALUE SPACES.    00003000
000040     03  RPW015-ACCOUNT          PIC X(18)       VALUE SPACES.    00004000
000050     03  RPW015-EDITEDACCOUNT    PIC X(22)       VALUE SPACES.    00005000
