000010******************************************************************00001000
000020* RPW001   REPORT FORMATTER WORK AREA                            *00002000
000030******************************************************************00003000
000040*01  RPW001-AREAS.                                                00004000
000050     03  WS-TOTNOPRT             PIC X(01)       VALUE SPACE.     00005000
000060     03  WS-ACCDSW               PIC X(01)       VALUE SPACE.     00006000
000070     03  WS-CUSTCOMP.                                             00007000
000080         05  WS-CCNAME           PIC X(06).                       00008000
000090         05  WS-CCI1             PIC X(01).                       00009000
000100         05  WS-CCI2             PIC X(01).                       00010000
000110         05  WS-CCBRK            PIC S9(04)      COMP.            00011000
000120     03  WS-CUSTEXP.                                              00012000
000130         05  WS-CENAME           PIC X(06).                       00013000
000140         05  WS-CEI1             PIC X(01).                       00014000
000150         05  WS-CEI2             PIC X(01).                       00015000
000160         05  WS-CEBRK            PIC 9(04).                       00016000
000170     03  WS-ACCTHEAD.                                             00017000
000180         05  FILLER              PIC X(02)       VALUE SPACES.    00018000
000190         05  WS-AHAPPL           PIC 9(02)       VALUE ZERO.      00019000
000200         05  FILLER              PIC X(01)       VALUE SPACES.    00020000
000210         05  WS-AHACCT           PIC X(22).                       00021000
000220         05  FILLER              PIC X(02)       VALUE SPACES.    00022000
000230         05  WS-AHLIT            PIC X(06)       VALUE 'TOTALS'.  00023000
000240     03  WS-TOTHEAD.                                              00024000
000250         05  WS-THLIT1           PIC X(10).                       00025000
000260         05  FILLER              PIC X(01).                       00026000
000270         05  WS-THOFF.                                            00027000
000280             07  WS-THNBR        PIC Z(06)9(03).                  00028000
000290         05  FILLER              PIC X(01).                       00029000
000300         05  WS-THLIT2           PIC X(06).                       00030000
000310     03  WS-ACCTSW               PIC X(01)       VALUE SPACES.    00031000
000320     03  WS-OLDKEY.                                               00032000
000330         05  WS-OKINST           PIC 9(03)       VALUE ZERO.      00033000
000340         05  WS-OKAPPL           PIC 9(02)       VALUE ZERO.      00034000
000350         05  WS-OKACCOUNT        PIC 9(18)       VALUE ZERO.      00035000
000360     03  WS-NEWKEY.                                               00036000
000370         05  WS-NKINST           PIC 9(03)       VALUE ZERO.      00037000
000380         05  WS-NKAPPL           PIC 9(02)       VALUE ZERO.      00038000
000390         05  WS-NKACCOUNT        PIC 9(18)       VALUE ZERO.      00039000
000400     03  WS-ABEND.                                                00040000
000410         05  WS-ABCODE           PIC 9(04)       VALUE ZERO.      00041000
000420         05  FILLER              PIC X(23)       VALUE            00042000
000430             ' *** PROGRAM ABEND *** '.                           00043000
000440         05  WS-ABPROGID         PIC X(07)       VALUE SPACES.    00044000
000450         05  WS-ABFC             PIC X(01)       VALUE SPACES.    00045000
000460         05  WS-ABORTMSG         PIC X(50)       VALUE SPACES.    00046000
000470*    03  WS-CUSTCOMP.                                             00047000
000480*        05  WS-CCNAME           PIC X(06).                       00048000
000490*        05  WS-CCI1             PIC X(01).                       00049000
000500*        05  WS-CCI2             PIC X(01).                       00050000
000510*        05  WS-CCBRK            PIC S9(04)      COMP.            00051000
000520*    03  WS-CUSTEXP.                                              00052000
000530*        05  WS-CENAME           PIC X(06).                       00053000
000540*        05  WS-CEI1             PIC X(01).                       00054000
000550*        05  WS-CEI2             PIC X(01).                       00055000
000560*        05  WS-CEBRK            PIC 9(04).                       00056000
000570     03  WS-KEYBYTES             PIC X(08).                       00057000
000580     03  WS-KBYTES08     REDEFINES WS-KEYBYTES.                   00058000
000590         05  WS-KB08             PIC X(08).                       00059000
000600     03  WS-KBYTES07     REDEFINES WS-KEYBYTES.                   00060000
000610         05  WS-KB07             PIC X(07).                       00061000
000620         05  WS-KBCLEAR1         PIC X(01).                       00062000
000630     03  WS-KBYTES06     REDEFINES WS-KEYBYTES.                   00063000
000640         05  WS-KB06             PIC X(06).                       00064000
000650         05  WS-KBCLEAR2         PIC X(02).                       00065000
000660     03  WS-KBYTES05     REDEFINES WS-KEYBYTES.                   00066000
000670         05  WS-KB05             PIC X(05).                       00067000
000680         05  WS-KBCLEAR3         PIC X(03).                       00068000
000690     03  WS-KBYTES04     REDEFINES WS-KEYBYTES.                   00069000
000700         05  WS-KB04             PIC X(04).                       00070000
000710         05  WS-KBCLEAR4         PIC X(04).                       00071000
000720     03  WS-KBYTES03     REDEFINES WS-KEYBYTES.                   00072000
000730         05  WS-KB03             PIC X(03).                       00073000
000740         05  WS-KBCLEAR5         PIC X(05).                       00074000
000750     03  WS-KBYTES02     REDEFINES WS-KEYBYTES.                   00075000
000760         05  WS-KB02             PIC X(02).                       00076000
000770         05  WS-KBCLEAR6         PIC X(06).                       00077000
000780     03  WS-KBYTES01     REDEFINES WS-KEYBYTES.                   00078000
000790         05  WS-KB01             PIC X(01).                       00079000
000800         05  WS-KBCLEAR7         PIC X(07).                       00080000
000810******************************************************************00081000
000820*    END OF DEPOSIT SYSTEM REPORT FORMATTER WORK AREAS           *00082000
000830******************************************************************00083000
