000010******************************************************************00001000
000020* RPW002   LINK DATA WORK AREA                                   *00002000
000030******************************************************************00003000
000040*01  WS-LINKDATA.                                                 00004000
000050     03  WS-CONTROL              PIC X(01)       VALUE SPACES.    00005000
000060     03  WS-INITSW               PIC X(01)       VALUE SPACES.    00006000
000070     03  WS-TOTSW                PIC X(01)       VALUE SPACES.    00007000
000080     03  WS-HEADSW               PIC X(01)       VALUE SPACES.    00008000
000090     03  WS-APPL                 PIC 9(02).                       00009000
000100     03  WS-DSACCTLN             PIC 9(02).                       00010000
000110     03  WS-RPEDIT               PIC 9(08).                       00011000
000120     03  WS-RPEDIT4      REDEFINES WS-RPEDIT                      00012000
000130                                 PIC 9(02)       OCCURS 4 TIMES.  00013000
000140     03  WS-RSSAVLN              PIC 9(02).                       00014000
000150     03  WS-RPSAVEDIT            PIC 9(08).                       00015000
000160     03  WS-RPSAVEDIT4   REDEFINES WS-RPSAVEDIT                   00016000
000170                                 PIC 9(02)       OCCURS 4 TIMES.  00017000
000180     03  WS-RSODBLN              PIC 9(02).                       00018000
000190     03  WS-RSODBEDIT            PIC 9(08).                       00019000
000200     03  WS-RSODBEDIT4   REDEFINES WS-RSODBEDIT                   00020000
000210                                 PIC 9(02)       OCCURS 4 TIMES.  00021000
000220     03  WS-DDAAPPL              PIC 9(02).                       00022000
000230     03  WS-SAVAPPL              PIC 9(02).                       00023000
000240     03  WS-ODBAPPL              PIC 9(02).                       00024000
000250     03  WS-3000TRIALB           PIC X(01).                       00025000
000260     03  WS-3000TRIALC           PIC X(01).                       00026000
000270     03  WS-3000RPTBRSRT         PIC X(01).                       00027000
000280     03  WS-3000RPTNAMEPRT       PIC X(01).                       00028000
000290     03  WS-3000RPT13FORM        PIC X(01).                       00029000
000300     03  WS-3000RPT20B           PIC X(01).                       00030000
000310     03  WS-3000RPT21            PIC X(01).                       00031000
000320     03  WS-3000RPT22            PIC X(01).                       00032000
000330     03  WS-3000RPT23            PIC X(01).                       00033000
000340     03  WS-3000RPT24            PIC X(01).                       00034000
000350     03  WS-3000RPT25            PIC X(01).                       00035000
000360     03  WS-3000RPT37A           PIC X(01).                       00036000
000370     03  WS-3000RPT37B           PIC X(01).                       00037000
000380     03  WS-3000COSTCNTR         PIC X(01).                       00038000
000390     03  WS-LINKFUNCT            PIC X(01)       VALUE SPACES.    00039000
000400     03  WS-KEYBYTES.                                             00040000
000410         05  WS-KBHC             PIC X(01).                       00041000
000420         05  WS-KBBK             PIC X(01).                       00042000
000430         05  WS-KBRG             PIC X(01).                       00043000
000440         05  WS-KBBR             PIC X(01).                       00044000
000450         05  WS-KBTY             PIC X(01).                       00045000
000460         05  WS-KBOF             PIC X(01).                       00046000
000470         05  WS-KBCU             PIC X(01).                       00047000
000480         05  WS-KBAC             PIC X(01).                       00048000
000490     03  WS-BRKBYTES.                                             00049000
000500         05  WS-BBBR             PIC X(01).                       00050000
000510         05  WS-BBTY             PIC X(01).                       00051000
000520         05  WS-BBOF             PIC X(01).                       00052000
000530     03  WS-SAVEBYTES.                                            00053000
000540         05  WS-SB1234.                                           00054000
000550             07  WS-SBHC         PIC X(01).                       00055000
000560             07  WS-SBBK         PIC X(01).                       00056000
000570             07  WS-SBRG         PIC X(01).                       00057000
000580             07  WS-SBBR         PIC X(01).                       00058000
000590         05  WS-SBTY             PIC X(01).                       00059000
000600         05  WS-SBOF             PIC X(01).                       00060000
000610         05  WS-SBCU             PIC X(01).                       00061000
000620         05  WS-SBAC             PIC X(01).                       00062000
000630     03  WS-LASTKEY.                                              00063000
000640         05  WS-LKFORMX          PIC X(02).                       00064000
000650         05  WS-LKSEPREPX        PIC X(01).                       00065000
000660         05  WS-LKHOLDCOX.                                        00066000
000670             07  WS-LKHOLDCO     PIC S9(03)      COMP-3.          00067000
000680         05  WS-LKINSTX.                                          00068000
000690             07  WS-LKINST       PIC S9(03)      COMP-3.          00069000
000700         05  WS-LKALTBRNBRX.                                      00070000
000710             07  WS-LKALTBRNBR                                    00071000
000720                                 PIC S9(05)      COMP-3.          00072000
000730         05  WS-LKSPECX          PIC X(01).                       00073000
000740         05  WS-LKREGNBRX.                                        00074000
000750             07  WS-LKREGNBR     PIC S9(03)      COMP-3.          00075000
000760         05  WS-LKRPTNBRX.                                        00076000
000770             07  WS-LKRPTNBR     PIC S9(04)      COMP.            00077000
000780         05  WS-LKBRANCHX.                                        00078000
000790             07  WS-LKBRANCH     PIC S9(05)      COMP-3.          00079000
000800         05  WS-LKTYPEX.                                          00080000
000810             07  WS-LKTYPE       PIC S9(03)      COMP-3.          00081000
000820         05  WS-LKOFFX.                                           00082000
000830             07  WS-LKOFF        PIC X(09).                       00083000
000840         05  WS-LKCUSTX.                                          00084000
000850             07  WS-LKCUST       PIC X(10).                       00085000
000860             07  WS-LKCUSTN                                       00086000
000870                         REDEFINES WS-LKCUST                      00087000
000880                                 PIC 9(18)       COMP-3.          00088000
000890         05  WS-LKACCTX.                                          00089000
000900             07  WS-LKACCT       PIC S9(18)      COMP-3.          00090000
000910         05  WS-LKSORTNBRX.                                       00091000
000920             07  WS-LKSORTNBR    PIC S9(11)      COMP-3.          00092000
000930         05  WS-LASTKEYT.                                         00093000
000940             07  WS-LKCODE1      PIC X(01).                       00094000
000950             07  WS-LKAMOUNTX.                                    00095000
000960                 09  WS-LKAMOUNT                                  00096000
000970                                 PIC S9(09)V99   COMP-3.          00097000
000980             07  WS-LKAMOUNTXR                                    00098000
000990                         REDEFINES WS-LKAMOUNTX.                  00099000
001000                 09  WS-LKSERIAL                                  00100000
001010                                 PIC S9(11)      COMP-3.          00101000
001020             07  WS-LKCODE2      PIC X(01).                       00102000
001030             07  WS-LKSEQX.                                       00103000
001040                 09  WS-LKSEQ                                     00104000
001050                                 PIC S9(09)      COMP.            00105000
001060             07  WS-LKRPTPFC     PIC X(01).                       00106000
001070             07  WS-LKPAGEBRK.                                    00107000
001080                 09  WS-LKBRPAGE                                  00108000
001090                                 PIC X(01).                       00109000
001100                 09  WS-LKTYPAGE                                  00110000
001110                                 PIC X(01).                       00111000
001120     03  WS-OPTFLAGS.                                             00112000
001130         05  WS-OPTFLAG          PIC X(01)       OCCURS 0100.     00113000
001140     03  WS-BKADDR1              PIC X(30)       VALUE SPACES.    00114000
001150     03  WS-BKADDR2              PIC X(30)       VALUE SPACES.    00115000
001160     03  WS-BKZIP                PIC 9(09)       VALUE ZEROS.     00116000
001170     03  WS-EDITACCT             PIC X(22)       VALUE SPACES.    00117000
001180     03  WS-MIMKEYHOLD           PIC X(48)       VALUE SPACES.    00118000
001190     03  WS-MONFLAG              PIC X(01).                       00119000
001200     03  FILLER                  PIC X(76).                       00120000
