P0026 ******************************************************************00001000
P0026 * RPW004   CROSS INSTITUTION WORK AREA                           *00001990
P0026 ******************************************************************00002980
P0026 *01  WS-ACCESS-INFORMATION.                                       00003970
P0026      03  WS-SSUB                 PIC S9(04)      COMP             00004960
P0026                                                  VALUE ZERO.      00005950
P0026      03  WS-SSUBMAX              PIC S9(04)      COMP             00006940
P0026                                                  VALUE +100.      00007930
P0026      03  WS-RPP004-ERROR         PIC X(01).                       00008920
P0026      03  WS-ACCESS-OPERID        PIC X(08).                       00009910
P0026      03  WS-ACCESS-PROFILE       PIC X(08).                       00010900
P0026      03  WS-ACCESS-EXTERNALID    PIC X(08).                       00011890
P0026      03  WS-ACCESS-ALT-INST      PIC 9(04)       VALUE ZEROS.     00012880
P0026      03  WS-ACCESS-PRIM-INST     PIC 9(04)       VALUE ZEROS.     00013870
P0026      03  WS-ACCESS-FILEOPTS      PIC X(25)       VALUE SPACES.    00014860
P0026      03  WS-2024INSTS.                                            00015850
P0026          05  WS-2024INSTX                        OCCURS           00016840
P0026                                                  9999 TIMES.      00017830
P0026              07  WS-2024-EXISTS  PIC X(01).                       00018820
P0026              07  WS-STBL-SUB     PIC 9(03).                       00019810
P0026      03  WS-SEARCH-TABLE.                                         00020800
P0026          05  WS-SEARCH-OPTS                      OCCURS 100 TIMES.00021790
P0026              07 WS-SEARCH-OPT    PIC X(25).                       00022780
P0026 *----------------------------------------------------------------*00023770
P0026 *        END OF CROSS INSTITUTION WORK AREA                      *00024760
P0026 *----------------------------------------------------------------*00025750
