000010******************************************************************00001000
000020* RPW007   PRIMARY ACCOUNT RELATIONSHIP CODE WORK AREA           *00002000
000030******************************************************************00003000
000040*01  WS-PRIMRELCD-WORKAREA.                                       00004000
000050     03  WS-PRIMRELCD-OPTION     PIC X(02)       VALUE SPACES.    00005000
000060     03  WS-PRIMRELCD-VALID      PIC X(01)       VALUE 'N'.       00006000
000070     03  WS-PRIMRELCD-FOUND      PIC X(01)       VALUE 'N'.       00007000
000080     03  WS-PRIMRELCD-ERROR      PIC X(01)       VALUE 'N'.       00008000
000090     03  WS-CUSTRELCD-SKIP       PIC X(01)       VALUE 'N'.       00009000
000100     03  WS-RPW006-MODEL         PIC X(10)       VALUE SPACES.    00010000
000110     03  WS-RPW006-SUB           PIC S9(04)      COMP             00011000
000120                                                 VALUE +0.        00012000
000130     03  WS-SUBSEC1              PIC S9(04)      COMP             00013000
000140                                                 VALUE +0.        00014000
000150******************************************************************00015000
000160*    END OF PRIMARY ACCOUNT RELATIONSHIP CODE WORK AREAS         *00016000
000170******************************************************************00017000
