000010*01  RPW010-LINKAGE-AREA.                                         00001000
000020***************************************************************** 00002000
000030*    RPW010 - ACCOUNT INTERFACE LINKAGE AREA                    * 00003000
000040***************************************************************** 00004000
000050     03  LS-ACT-KEY.                                              00005000
000060         05  LS-ACT-INST         PIC 9(04).                       00006000
000070         05  LS-ACT-PRODCODE     PIC X(06).                       00007000
000080         05  LS-ACT-ACCOUNT      PIC X(18).                       00008000
000100     03  LS-ACT-DATA.                                             00010000
P0198          05  LS-ACT-CALL-OPTION  PIC X(01).                       00011000
P0198          05  LS-ACT-FUNCTION     PIC X(01).                       00011290
000120         05  LS-ACT-SCINCENTIVE  PIC X(01).                       00012000
000130         05  LS-ACT-DISCAMT      PIC S9(09)V99.                   00013000
000140         05  LS-ACT-DISCPCT      PIC SV9(05).                     00014000
000150         05  LS-ACT-RATEINCENTIVE                                 00015000
000160                                 PIC X(01).                       00016000
000170         05  LS-ACT-RATE-TYPE    PIC X(01).                       00017000
000180         05  LS-ACT-RATE-OPTION  PIC X(01).                       00018000
P0162          05  LS-ACT-RATE-PERCENT PIC SV9(09).                     00019000
P0162          05  LS-ACT-RATECHG-FLAG PIC X(01).                       00019190
P0162          05  LS-ACT-RATE-PREV    PIC SV9(09).                     00019380
000200         05  LS-ACT-SPLIT-RATE-TABLE.                             00020000
000210             07  LS-ACT-RATEAMT-1                                 00021000
000220                                 PIC S9(09)      COMP-3.          00022000
000230             07  LS-ACT-RATEPCT-1                                 00023000
000240                                 PIC SV9(09)     COMP-3.          00024000
000250             07  LS-ACT-RATEAMT-2                                 00025000
000260                                 PIC S9(09)      COMP-3.          00026000
000270             07  LS-ACT-RATEPCT-2                                 00027000
000280                                 PIC SV9(09)     COMP-3.          00028000
000290             07  LS-ACT-RATEAMT-3                                 00029000
000300                                 PIC S9(09)      COMP-3.          00030000
000310             07  LS-ACT-RATEPCT-3                                 00031000
000320                                 PIC SV9(09)     COMP-3.          00032000
000330             07  LS-ACT-RATEAMT-4                                 00033000
000340                                 PIC S9(09)      COMP-3.          00034000
000350             07  LS-ACT-RATEPCT-4                                 00035000
000360                                 PIC SV9(09)     COMP-3.          00036000
000370             07  LS-ACT-RATEAMT-5                                 00037000
000380                                 PIC S9(09)      COMP-3.          00038000
000390             07  LS-ACT-RATEPCT-5                                 00039000
000400                                 PIC SV9(09)     COMP-3.          00040000
000410             07  LS-ACT-RATEAMT-6                                 00041000
000420                                 PIC S9(09)      COMP-3.          00042000
000430             07  LS-ACT-RATEPCT-6                                 00043000
000440                                 PIC SV9(09)     COMP-3.          00044000
000450             07  LS-ACT-RATEAMT-7                                 00045000
000460                                 PIC S9(09)      COMP-3.          00046000
000470             07  LS-ACT-RATEPCT-7                                 00047000
000480                                 PIC SV9(09)     COMP-3.          00048000
000490             07  LS-ACT-RATEAMT-8                                 00049000
000500                                 PIC S9(09)      COMP-3.          00050000
000510             07  LS-ACT-RATEPCT-8                                 00051000
000520                                 PIC SV9(09)     COMP-3.          00052000
000530             07  LS-ACT-RATEAMT-9                                 00053000
000540                                 PIC S9(09)      COMP-3.          00054000
000550             07  LS-ACT-RATEPCT-9                                 00055000
000560                                 PIC SV9(09)     COMP-3.          00056000
000570             07  LS-ACT-RATEAMT-10                                00057000
000580                                 PIC S9(09)      COMP-3.          00058000
000590             07  LS-ACT-RATEPCT-10                                00059000
000600                                 PIC SV9(09)     COMP-3.          00060000
000610             07  LS-ACT-RATEAMT-11                                00061000
000620                                 PIC S9(09)      COMP-3.          00062000
000630             07  LS-ACT-RATEPCT-11                                00063000
000640                                 PIC SV9(09)     COMP-3.          00064000
000650             07  LS-ACT-RATEAMT-12                                00065000
000660                                 PIC S9(09)      COMP-3.          00066000
000670             07  LS-ACT-RATEPCT-12                                00067000
000680                                 PIC SV9(09)     COMP-3.          00068000
000690             07  LS-ACT-RATEAMT-13                                00069000
000700                                 PIC S9(09)      COMP-3.          00070000
000710             07  LS-ACT-RATEPCT-13                                00071000
000720                                 PIC SV9(09)     COMP-3.          00072000
000730             07  LS-ACT-RATEAMT-14                                00073000
000740                                 PIC S9(09)      COMP-3.          00074000
000750             07  LS-ACT-RATEPCT-14                                00075000
000760                                 PIC SV9(09)     COMP-3.          00076000
000770             07  LS-ACT-RATEAMT-15                                00077000
000780                                 PIC S9(09)      COMP-3.          00078000
000790             07  LS-ACT-RATEPCT-15                                00079000
000800                                 PIC SV9(09)     COMP-3.          00080000
000810         05  LS-ACT-SPLIT-RATE-TABLEX                             00081000
000820                         REDEFINES LS-ACT-SPLIT-RATE-TABLE        00082000
000830                                                 OCCURS 15.       00083000
000840             07  LS-ACT-RATEAMT  PIC S9(09)      COMP-3.          00084000
000850             07  LS-ACT-RATEPCT  PIC SV9(09)     COMP-3.          00085000
P0162      03  LS-ACT-BALANCE-INFORMATION.                              00086000
P0162          05  LS-ACT-BALFLAG                                       00087000
P0162                                  PIC X(01).                       00088000
P0162          05  LS-ACT-APPL         PIC 9(02).                       00089000
P0162          05  LS-ACT-BALCUR       PIC S9(11)V99   COMP-3.          00090000
P0162          05  LS-ACT-MFLOATC.                                      00091000
P0162              07  LS-ACT-MFCAMT   PIC S9(09)      COMP             00092000
P0162                                                  OCCURS 9.        00093000
P0162          05  LS-ACT-MFLOATB.                                      00094000
P0162              07  LS-ACT-MFBAMT   PIC S9(09)      COMP             00095000
P0162                                                  OCCURS 9.        00096000
P0162          05  LS-ACT-SCLOWBAL                                      00097000
P0162                                  PIC S9(09)      COMP.            00098000
P0162          05  LS-ACT-SCAGRBAL                                      00099000
P0162                                  PIC S9(13)V99   COMP-3.          00100000
P0162          05  LS-ACT-SCCAGR       PIC S9(13)V99   COMP-3.          00101000
P0162          05  LS-ACT-INTAGR       PIC S9(13)V99   COMP-3.          00102000
P0162          05  LS-ACT-SCDL         PIC S9(07)      COMP-3.          00103000
P0162          05  LS-ACT-INTDATE      PIC S9(07)      COMP-3.          00104000
P0162          05  LS-ACT-STMCODLS     PIC S9(07)      COMP-3.          00105000
P0162          05  LS-ACT-NPROCDTA     PIC S9(07)      COMP-3.          00106000
