000010*01  WS-SECONDARY-ACCOUNT-FIELDS.                                 00001000
000020     03  WS-ACC-MAX              PIC S9(04)      COMP             00002000
000030                                                 VALUE +33.       00003000
000040     03  WS-ACC-TABLE.                                            00004000
000050         05  WS-ACC-INFO                         OCCURS 33 TIMES. 00005000
000060             07  WS-ACC-INST     PIC 9(04).                       00006000
000070             07  WS-ACC-CUST-TYPE                                 00007000
000080                                 PIC X(01).                       00008000
000090             07  WS-ACC-CUST     PIC X(21).                       00009000
000100             07  WS-ACC-RELNBR   PIC 9(02).                       00010000
000110             07  WS-ACC-PRIM     PIC 9(01).                       00011000
000120             07  WS-ACC-FILL     PIC X(01).                       00012000
000130         05  WS-ACC-FILLER       PIC X(10).                       00013000
000140     03  WS-MORE-SECONDARYCUST   PIC X(01)       VALUE 'N'.       00014000
000150     03  WS-SECCUSTSUB           PIC S9(04)      COMP             00015000
000160                                                 VALUE ZERO.      00016000
000170     03  WS-PRIMCUSTACCTS        PIC S9(05)      COMP-3           00017000
000180                                                 VALUE ZEROS.     00018000
000190     03  WS-SECTABLE             PIC S9(05)      COMP-3           00019000
000200                                                 VALUE ZEROS.     00020000
000210     03  WS-NUMOFSECCUSTS        PIC S9(05)      COMP-3           00021000
000220                                                 VALUE ZEROS.     00022000
000230     03  WS-NUMOFSECACCTS        PIC S9(05)      COMP-3           00023000
000240                                                 VALUE ZEROS.     00024000
000250     03  WS-DUPSECACCT           PIC X(01)       VALUE SPACE.     00025000
000260     03  WS-BADRELNBR            PIC X(01)       VALUE SPACE.     00026000
000270     03  WS-EACHDUPACCT.                                          00027000
000280         07  WS-DUPINST          PIC 9(04).                       00028000
000290         07  WS-DUPPRODCD        PIC X(06).                       00029000
000300         07  WS-DUPACCOUNT       PIC X(18).                       00030000
000310     03  WS-DUPTEST              PIC S9(05)      COMP-3           00031000
000320                                                 VALUE ZERO.      00032000
000330     03  WS-ALLSEC               PIC S9(05)      COMP-3           00033000
000340                                                 VALUE ZERO.      00034000
000350     03  WS-RELCHECK             PIC X(01)       VALUE 'N'.       00035000
000360     03  WS-VALIDREL             PIC 9(02)       VALUE ZERO.      00036000
000370     03  WS-INCLUDEREL           PIC X(01)       VALUE 'N'.       00037000
000380     03  WS-RELMAX               PIC S9(05)      VALUE 50.        00038000
000390     03  WS-RELSUB               PIC S9(05)      VALUE ZERO.      00039000
000400     03  WS-RELCODETABLE.                                         00040000
000410         05  WS-RELCODE                          OCCURS           00041000
000420                                                 50 TIMES.        00042000
000430             07  WS-SECRELCODE   PIC 9(02).                       00043000
000440     03  WS-RPMIM7104SC          PIC X(06).                       00044000
000450     03  WS-SUBSEC1              PIC S9(03)      COMP-3           00045000
000460                                                 VALUE ZERO.      00046000
000470     03  WS-SUBSEC2              PIC S9(03)      COMP-3           00047000
000480                                                 VALUE ZERO.      00048000
000490     03  WS-SUBSEC3              PIC S9(03)      COMP-3           00049000
000500                                                 VALUE ZERO.      00050000
000510     03  WS-SUBSEC4              PIC S9(03)      COMP-3           00051000
000520                                                 VALUE ZERO.      00052000
000530     03  WS-NEED-SECONDARY       PIC X(01)       VALUE 'N'.       00053000
000540     03  WS-NEW-CUSTKEY.                                          00054000
000550         05  WS-NEW-INST         PIC 9(04).                       00055000
000560         05  WS-NEW-CUST-TYPE    PIC X(01).                       00056000
000570         05  WS-NEW-CUST         PIC X(21).                       00057000
000580                                                                  00058000
000590     03  WS-SECONDARY-CUSTAREA.                                   00059000
000600         05  WS-SEC-INFO                         OCCURS 33 TIMES. 00060000
000610             07  WS-SEC-INST     PIC 9(04).                       00061000
000620             07  WS-SEC-CUST-TYPE                                 00062000
000630                                 PIC X(01).                       00063000
000640             07  WS-SEC-CUST     PIC X(21).                       00064000
000650             07  WS-SEC-RELNBR   PIC 9(02).                       00065000
000660             07  WS-SEC-PRIM     PIC 9(01).                       00066000
000670             07  WS-SEC-FILL     PIC X(01).                       00067000
000680         05  WS-SEC-FILLER       PIC X(10).                       00068000
000690* **                                                              00069000
000700* ** END OF WORK FIELDS                                           00070000
