000010******************************************************************00001000
000020* RPW2023  2023 - RP PRODUCT CODE INFO WORK AREA                 *00002000
000030******************************************************************00003000
000040*01  WS-RPMIM2023AREAS.                                           00004000
000050     03  WS-RPMIM2023KEY.                                         00005000
000060         05  WS-RPMIM2023INST    PIC 9(04).                       00006000
000070     03  WS-RPMIM2023PRODCD      PIC X(06).                       00007000
000080     03  WS-RPMIM2023-RPS        PIC X(06).                       00008000
000090     03  WS-RPMIM2023ERROR       PIC X(01)       VALUE SPACE.     00009000
000100     03  WS-RPMIM2023VALID       PIC X(01)       VALUE SPACE.     00010000
000110     03  WS-RPMIM2023BANKSW      PIC X(01)       VALUE 'Y'.       00011000
000120     03  WS-RPMIM2023LOADSW      PIC X(01)       VALUE 'N'.       00012000
000130     03  WS-RPMIM2023MAXSIZE     PIC S9(04)      COMP             00013000
000140                                                 VALUE +200.      00014000
000150     03  WS-2023-AREA.                                            00015000
000160         05  WS-2023-RECORD                      OCCURS 200 TIMES 00016000
000170                                 ASCENDING KEY IS WS-2023-KEY     00017000
000180                                 INDEXED BY INDX-2023.            00018000
000190             07  WS-2023-KEY.                                     00019000
000200                 09  WS-2023-PRODCODE                             00020000
000210                                 PIC X(06).                       00021000
000220             07  WS-2023-INTAPPL PIC 9(02).                       00022000
000230             07  WS-2023-RPOPTION                                 00023000
000240                                 PIC X(01).                       00024000
000250             07  WS-2023-ACCTLN  PIC 9(02).                       00025000
000260             07  WS-2023-ACCTED  PIC 9(08).                       00026000
000270*----------------------------------------------------------------*00027000
000280*     END WS AREA USED TO HOLD RP PROD CODE 2023 MICM RECORD     *00028000
000290*----------------------------------------------------------------*00029000
