000010******************************************************************00001000
000020* RPW7107  7107 - RP BRANCH/REGION LOOK-UP WORK AREA             *00002000
000030******************************************************************00003000
000040*01  WS-RPMIM7107AREAS.                                           00004000
000050     03  WS-RPMIM7107KEY.                                         00005000
000060         05  WS-RPMIM7107INST    PIC 9(04).                       00006000
000070     03  WS-RPMIM7107RPREC       PIC X(06).                       00007000
000080     03  WS-RPMIM7107INST2       PIC 9(04).                       00008000
000090     03  WS-RPMIM7107BRCHREGION  PIC 9(05).                       00009000
000100     03  WS-RPMIM7107ERROR       PIC X(01)       VALUE SPACE.     00010000
000110     03  WS-RPMIM7107FOUND       PIC X(01)       VALUE SPACE.     00011000
000120     03  WS-RPMIM7107MAXSIZE     PIC S9(04)      COMP             00012000
000130                                                 VALUE +100.      00013000
000140     03  WS-RPMIM7107SUB         PIC S9(04)      COMP             00014000
000150                                                 VALUE +0.        00015000
000160     03  WS-RPMIM7107SEARCHOPT   PIC X(01)       VALUE SPACE.     00016000
000170     03  WS-7107-AREA.                                            00017000
000180         05  WS-7107-RECORD                      OCCURS 100 TIMES 00018000
000190                                 ASCENDING KEY IS WS-7107-KEY     00019000
000200                                 INDEXED BY INDX-7107.            00020000
000210             07  WS-7107-KEY.                                     00021000
000220                 09  WS-7107-RPREC                                00022000
000230                                 PIC X(06).                       00023000
000240             07  WS-RPMIM7107    PIC X(152).                      00024000
000250*----------------------------------------------------------------*00025000
000260*     END WS AREA FOR RP BRANCH/REGION LOOK-UP 7107 MICM RECORD  *00026000
000270*----------------------------------------------------------------*00027000
