000010******************************************************************00001000
000020* RPW7104  7104 - RP RELATIONSHIP CODES WORK AREA                *00002000
000030******************************************************************00003000
000040*01  WS-RPMIM7104AREAS.                                           00004000
000050     03  WS-RPMIM7104KEY.                                         00005000
000060         05  WS-RPMIM7104INST    PIC 9(04).                       00006000
000070     03  WS-RPMIM7104RPREC       PIC X(06).                       00007000
000080     03  WS-RPMIM7104ERROR       PIC X(01)       VALUE SPACE.     00008000
000090     03  WS-RPMIM7104FOUND       PIC X(01)       VALUE SPACE.     00009000
000100     03  WS-RPMIM7104MAXSIZE     PIC S9(04)      COMP             00010000
000110                                                 VALUE +50.       00011000
000120     03  WS-7104-AREA.                                            00012000
000130         05  WS-7104-RECORD                      OCCURS 50 TIMES  00013000
000140                                 ASCENDING KEY IS WS-7104-KEY     00014000
000150                                 INDEXED BY INDX-7104.            00015000
000160             07  WS-7104-KEY.                                     00016000
000170                 09  WS-7104-RPREC                                00017000
000180                                 PIC X(06).                       00018000
000190             07  WS-RPMIM7104    PIC X(101).                      00019000
000200*----------------------------------------------------------------*00020000
000210*     END WS AREA USED TO HOLD RP REL CODES 7104 MICM RECORD     *00021000
000220*----------------------------------------------------------------*00022000
