000010*01  RPEVTA-AREAS.                                                00001000
000020     03  RPS-EVT-OPEN            PIC X(01)       VALUE SPACES.    00002000
000030     03  RPS-EVT-LOG             PIC X(01)       VALUE 'Y'.       00003000
000040     03  RPS-EVT-AIX             PIC X(01)       VALUE SPACES.    00004000
000050 01  RPS-EVT-BEFORE.                                              00005000
000060     03  RPS-EVT-BIMAGE          PIC X(164)      VALUE SPACES.    00006000
000070     03  RPS-EVT-BAPPENDDATA     PIC X(01)       VALUE SPACES.    00007000
000080 01  RPS-EVT-AFTER.                                               00008000
000090     03  RPS-EVT-AIMAGE          PIC X(164)      VALUE SPACES.    00009000
000100     03  RPS-EVT-AAPPENDDATA     PIC X(01)       VALUE SPACES.    00010000
000110 01  RPS-EVT-APPENDLGTH          PIC S9(04)      COMP             00011000
000120                                                 VALUE +0001.     00012000
000130 01  RPS-EVT-APPENDDATA          PIC X(01)       VALUE SPACES.    00013000
000140 01  RPS-EVT-RECLGTH             PIC 9(04)       VALUE 164.       00014000
000150 01  RPS-EVT-PARM                PIC X(01)       VALUE SPACES.    00015000
000160 01  RPS-EVT-KEY                 PIC X(77)       VALUE SPACES.    00016000
000170 01  RPS-EVT-LOCK                PIC X(01)       VALUE SPACES.    00017000
000180 01  RPS-EVT-RDBS.                                                00018000
000190     03  RPS-EVT-TAG-ID          PIC X(08)       VALUE '**BDBS**'.00019000
000200         88 RPS-EVT-GOOD                         VALUE '**BDBS**'.00020000
000210     03  RPS-EVT-REQ-VERB        PIC 9(04).                       00021000
000220     03  RPS-EVT-STAT            PIC X(02).                       00022000
000230     03  RPS-EVT-RETURN          PIC 9(04).                       00023000
000240     03  RPS-EVT-REC-ID.                                          00024000
000250         05 RPS-EVT-REC-PRI      PIC X(03)       VALUE 'SAM'.     00025000
000260         05 RPS-EVT-REC-ALT      PIC X(01)       VALUE '0'.       00026000
000270     03  RPS-EVT-ORG-ID          PIC X(06).                       00027000
000280     03  RPS-EVT-AUDIT           PIC X(01)       VALUE SPACE.     00028000
000290     03  RPS-EVT-AUDIT-LEN       PIC 9(02)       VALUE ZERO.      00029000
000300     03  RPS-EVT-CONC            PIC X(01)       VALUE SPACE.     00030000
000310     03  RPS-EVT-LOG-POS         PIC X(04).                       00031000
000320         88  RPS-EVT-POS-CLOSED                  VALUE LOW-VALUE. 00032000
000330         88  RPS-EVT-POS-OPEN                    VALUE 'OPEN'.    00033000
000340         88  RPS-EVT-POS-VALID                   VALUE 'VALD'.    00034000
000350         88  RPS-EVT-POS-LOCKED                  VALUE 'LOCK'.    00035000
000360         88  RPS-EVT-POS-BAD                     VALUE 'BADP'.    00036000
000370 01  RPSEVTA-WORKAREAS.                                           00037000
000380     03  RPS-EVT-FLAG            PIC X(01)       VALUE SPACE.     00038000
000390     03  RPS-EVT-EVENT-CODE      PIC 9(02)       VALUE ZEROS.     00039000
000400     03  RPS-EVT-IDNUMBER        PIC X(18)       VALUE SPACES.    00040000
000410     03  RPS-EVT-MSGNBR          PIC 9(04)       VALUE ZEROS.     00041000
000420     03  RPS-EVT-MODULE          PIC X(08)       VALUE SPACES.    00042000
000430     03  RPS-EVT-GRP-KEY.                                         00043000
000440         05  RPS-EVT-ACCT1-GRP.                                   00044000
000450             07  RPS-EVT-INST    PIC 9(04).                       00045000
000460             07  RPS-EVT-PRODCODE                                 00046000
000470                                 PIC X(06).                       00047000
000480             07  RPS-EVT-ACCOUNT PIC X(18).                       00048000
000490             07  RPS-EVT-MODEL   PIC X(10).                       00049000
000500         05  RPS-EVT-ACCT2-GRP.                                   00050000
000510             07  RPS-EVT-INST2   PIC 9(04).                       00051000
000520             07  RPS-EVT-PRODCODE2                                00052000
000530                                 PIC X(06).                       00053000
000540             07  RPS-EVT-ACCOUNT2                                 00054000
000550                                 PIC X(18).                       00055000
000560 01  RPSEVTA-EVENTCODES.                                          00056000
000570     03  FILLER                  PIC X(35)       VALUE            00057000
000580         'RELATIONSHIP CREATED               '.                   00058000
000590     03  FILLER                  PIC X(35)       VALUE            00059000
000600         'RELATIONSHIP EXPIRED               '.                   00060000
000610     03  FILLER                  PIC X(35)       VALUE            00061000
000620         'RELATIONSHIP DELETED               '.                   00062000
000630     03  FILLER                  PIC X(35)       VALUE            00063000
000640         'RELATIONSHIP PASSED QUALIFICATIONS '.                   00064000
000650     03  FILLER                  PIC X(35)       VALUE            00065000
000660         'RELATIONSHIP FAILED QUALIFICATIONS '.                   00066000
000670     03  FILLER                  PIC X(35)       VALUE            00067000
000680         'RELATIONSHIP FAILED, REMOVED       '.                   00068000
000690     03  FILLER                  PIC X(35)       VALUE            00069000
000700         'ACCOUNT ADDED TO RELATIONSHIP      '.                   00070000
000710     03  FILLER                  PIC X(35)       VALUE            00071000
000720         'ACCOUNT REMOVED FROM RELATIONSHIP  '.                   00072000
000730     03  FILLER                  PIC X(35)       VALUE            00073000
P0161          'ACCOUNT RATE INCENTIVE CHANGE      '.                   00074000
000750     03  FILLER                  PIC X(35)       VALUE            00075000
000760         '                                   '.                   00076000
P0161      03  FILLER                  PIC X(35)       VALUE            00076200
P0161          '                                   '.                   00076400
P0161      03  FILLER                  PIC X(35)       VALUE            00076600
P0161          '                                   '.                   00076800
000770 01  RPSEVTA-EVENTCODESR REDEFINES RPSEVTA-EVENTCODES.            00077000
P0161      03  RPS-EVT-EVENTCODE       PIC X(35)       OCCURS 12 TIMES. 00078000
000790 01  RPSEVTA-EVENTMODS.                                           00079000
000800     03  FILLER                  PIC X(33)       VALUE            00080000
000810         'RPD100  DAILY ENROLLMENT         '.                     00081000
000820     03  FILLER                  PIC X(33)       VALUE            00082000
000830         'RPD200  INCENTIVE QUALIFICATION  '.                     00083000
000840     03  FILLER                  PIC X(33)       VALUE            00084000
000850         'RPR100  AUTO ENROLLMENT          '.                     00085000
000860     03  FILLER                  PIC X(33)       VALUE            00086000
000870         'RPR120  EXTERNAL ENROLLMENT      '.                     00087000
000880     03  FILLER                  PIC X(33)       VALUE            00088000
000890         'RPR150  AUTO UPDATE              '.                     00089000
000900     03  FILLER                  PIC X(33)       VALUE            00090000
000910         'RPR200  RELATIONSHIP VALIDATION  '.                     00091000
000920     03  FILLER                  PIC X(33)       VALUE            00092000
000930         'RPLXXX03ONLINE MAINTENANCE       '.                     00093000
000940     03  FILLER                  PIC X(33)       VALUE            00094000
000950         'RPLXXX04OUTSIDE RELATIONSHIP     '.                     00095000
000960     03  FILLER                  PIC X(33)       VALUE            00096000
000970         'RPLXXX05ADD-ON ACCOUNT           '.                     00097000
000980     03  FILLER                  PIC X(33)       VALUE            00098000
000990         'RPLXXX33ONLINE ENROLLMENT        '.                     00099000
001000     03  FILLER                  PIC X(33)       VALUE            00100000
001010         'RPLXXX36REAL-TIME MAINTENANCE    '.                     00101000
P0161      03  FILLER                  PIC X(33)       VALUE            00101100
P0161          'RPD111  DEFAULT MODEL ENROLLMENT '.                     00101200
P0161      03  FILLER                  PIC X(33)       VALUE            00101300
P0161          'RPR205  RATE INCENTIVE CHANGE    '.                     00101400
P0161      03  FILLER                  PIC X(33)       VALUE            00101500
P0161          '                                 '.                     00101600
P0161      03  FILLER                  PIC X(33)       VALUE            00101700
P0161          '                                 '.                     00101800
001020 01  RPSEVTA-EVENTMODSR  REDEFINES RPSEVTA-EVENTMODS.             00102000
P0161      03  RPS-EVT-EVENTDATA                       OCCURS 15 TIMES. 00103000
001040         05  RPS-EVT-MODULENAME  PIC X(08).                       00104000
001050         05  RPS-EVT-MODULEDESC  PIC X(25).                       00105000
001060******************************************************************00106000
001070*   END RELATIONSHIP PRICING KEY RECORD WORK AREA                 00107000
001080******************************************************************00108000
