000010*01  RPWPRI-AREAS.                                                00001000
000020     03  MIC-RPS-REC-PRIS.                                        00002000
000030         05  MIC-RPS-7100-PRI    PIC X(03)       VALUE 'S00'.     00003000
000040         05  MIC-RPS-7101-PRI    PIC X(03)       VALUE 'S01'.     00004000
000050         05  MIC-RPS-7102-PRI    PIC X(03)       VALUE 'S02'.     00005000
000060         05  MIC-RPS-7103-PRI    PIC X(03)       VALUE 'S03'.     00006000
000070         05  MIC-RPS-7104-PRI    PIC X(03)       VALUE 'S04'.     00007000
000080         05  MIC-RPS-7105-PRI    PIC X(03)       VALUE 'S05'.     00008000
000090         05  MIC-RPS-7106-PRI    PIC X(03)       VALUE 'S06'.     00009000
000100         05  MIC-RPS-7107-PRI    PIC X(03)       VALUE 'S07'.     00010000
000110         05  MIC-RPS-7108-PRI    PIC X(03)       VALUE 'S08'.     00011000
000120         05  MIC-RPS-7109-PRI    PIC X(03)       VALUE 'S09'.     00012000
000130         05  MIC-RPS-7110-PRI    PIC X(03)       VALUE 'S10'.     00013000
000140         05  MIC-RPS-7111-PRI    PIC X(03)       VALUE 'S11'.     00014000
000150         05  MIC-RPS-7112-PRI    PIC X(03)       VALUE 'S12'.     00015000
000160         05  MIC-RPS-7113-PRI    PIC X(03)       VALUE 'S13'.     00016000
000170         05  MIC-RPS-7114-PRI    PIC X(03)       VALUE 'S14'.     00017000
