000010*01  RPRELA-AREAS.                                                00001000
000020     03  RPS-REL-OPEN            PIC X(01)       VALUE SPACES.    00002000
000030     03  RPS-REL-LOG             PIC X(01)       VALUE 'Y'.       00003000
000040     03  RPS-REL-AIX             PIC X(01)       VALUE SPACES.    00004000
000050 01  RPS-REL-BEFORE.                                              00005000
000060     03  RPS-REL-BIMAGE          PIC X(246)      VALUE SPACES.    00006000
000070     03  RPS-REL-BAPPENDDATA     PIC X(01)       VALUE SPACES.    00007000
000080 01  RPS-REL-AFTER.                                               00008000
000090     03  RPS-REL-AIMAGE          PIC X(246)      VALUE SPACES.    00009000
000100     03  RPS-REL-AAPPENDDATA     PIC X(01)       VALUE SPACES.    00010000
000110 01  RPS-REL-APPENDLGTH          PIC S9(04)      COMP             00011000
000120                                                 VALUE +0001.     00012000
000130 01  RPS-REL-APPENDDATA          PIC X(01)       VALUE SPACES.    00013000
000140 01  RPS-REL-RECLGTH             PIC 9(04)       VALUE 246.       00014000
000150 01  RPS-REL-PARM                PIC X(01)       VALUE SPACES.    00015000
000160 01  RPS-REL-KEY                 PIC X(66)       VALUE SPACES.    00016000
000170 01  RPS-REL-LOCK                PIC X(01)       VALUE SPACES.    00017000
000180 01  RPS-REL-RDBS.                                                00018000
000190     03  RPS-REL-TAG-ID          PIC X(08)       VALUE '**BDBS**'.00019000
000200         88 RPS-REL-GOOD                         VALUE '**BDBS**'.00020000
000210     03  RPS-REL-REQ-VERB        PIC 9(04).                       00021000
000220     03  RPS-REL-STAT            PIC X(02).                       00022000
000230     03  RPS-REL-RETURN          PIC 9(04).                       00023000
000240     03  RPS-REL-REC-ID.                                          00024000
000250         05 RPS-REL-REC-PRI      PIC X(03)       VALUE 'SAH'.     00025000
000260         05 RPS-REL-REC-ALT      PIC X(01)       VALUE '0'.       00026000
000270     03  RPS-REL-ORG-ID          PIC X(06).                       00027000
000280     03  RPS-REL-AUDIT           PIC X(01)       VALUE SPACE.     00028000
000290     03  RPS-REL-AUDIT-LEN       PIC 9(02)       VALUE ZERO.      00029000
000300     03  RPS-REL-CONC            PIC X(01)       VALUE SPACE.     00030000
000310     03  RPS-REL-LOG-POS         PIC X(04).                       00031000
000320         88  RPS-REL-POS-CLOSED                  VALUE LOW-VALUE. 00032000
000330         88  RPS-REL-POS-OPEN                    VALUE 'OPEN'.    00033000
000340         88  RPS-REL-POS-VALID                   VALUE 'VALD'.    00034000
000350         88  RPS-REL-POS-LOCKED                  VALUE 'LOCK'.    00035000
000360         88  RPS-REL-POS-BAD                     VALUE 'BADP'.    00036000
000370******************************************************************00037000
000380*   END RELATIONSHIP PRICING RELATIONSHIP KEY RECORD WORK AREA    00038000
000390******************************************************************00039000
