000010*01  RPWRPTS-AREAS.                                               00001000
000020******************************************************************00002000
000030* RELATIONSHIP PRICING SYSTEM EXCEPTION REPORTS FILE WORK AREA   *00003000
000040******************************************************************00004000
000050     03  WS-RRPTSFIL.                                             00005000
000060         05  WS-RRPTSF6          PIC X(06)       VALUE 'RPRPTS'.  00006000
000070         05  WS-RRPTSF7          PIC X(01)       VALUE SPACE.     00007000
000080         05  WS-RRPTSF8          PIC X(01)       VALUE SPACE.     00008000
000090     03  WS-RRPTSPGM             PIC X(08)       VALUE 'RPIRPTS '.00009000
000100     03  WS-RRPTSLGTH            PIC S9(04)      COMP             00010000
000110                                                 VALUE +0251.     00011000
000120     03  WS-RRPTSKEYL            PIC S9(04)      COMP             00012000
000130                                                 VALUE +0000.     00013000
000140     03  WS-RRPTSOPEN            PIC X(01)       VALUE SPACES.    00014000
000150     03  WS-RRPTSAREA                            VALUE SPACES.    00015000
000160         05  WS-RRPTS.                                            00016000
000170             07  WS-RRPTS1       PIC X(01).                       00017000
000180             07  WS-RRPTS2       PIC X(01).                       00018000
000190             07  WS-RRPTS3       PIC X(01).                       00019000
000200         05  WS-RRPTS-ORGID      PIC X(01).                       00020000
000210         05  WS-RRPTSMSG         PIC X(50).                       00021000
000220******************************************************************00022000
000230*   END REL PRICING SYSTEM EXCEPTION REPORTS FILE WORK AREA      *00023000
000240******************************************************************00024000
