000010*01  RPWRPTO-AREAS.                                               00001000
000020******************************************************************00002000
000030*       RELATIONSHIP PRICING ONLINE REPORTS FILE WORK AREA       *00003000
000040******************************************************************00004000
000050     03  WS-TRPTOFIL.                                             00005000
000060         05  WS-TRPTOF6          PIC X(06)       VALUE 'RPRPTO'.  00006000
000070         05  WS-TRPTOF7          PIC X(01)       VALUE SPACE.     00007000
000080         05  WS-TRPTOF8          PIC X(01)       VALUE SPACE.     00008000
000090     03  WS-TRPTOPGM             PIC X(08)       VALUE 'RPIRPTO '.00009000
000100     03  WS-TRPTOLGTH            PIC S9(04)      COMP             00010000
000110                                                 VALUE +0503.     00011000
000120     03  WS-TRPTOKEYL            PIC S9(04)      COMP             00012000
000130                                                 VALUE +0000.     00013000
000140     03  WS-TRPTOOPEN            PIC X(01)       VALUE SPACES.    00014000
000150     03  WS-TRPTOAREA                            VALUE SPACES.    00015000
000160         05  WS-TRPTO.                                            00016000
000170             07  WS-TRPTO1       PIC X(01).                       00017000
000180             07  WS-TRPTO2       PIC X(01).                       00018000
000190             07  WS-TRPTO3       PIC X(01).                       00019000
000200         05  WS-TRPTOMSG         PIC X(50).                       00020000
000210******************************************************************00021000
000220*   END RELATIONSHIP PRICING REPORTS FILE WORK AREA              *00022000
000230******************************************************************00023000
