000010******************************************************************00001000
000020* RPWSEG   SEGMENTATION WORK AREA                                *00002000
000030******************************************************************00003000
000040 01  RPWSEG-SEGFIELDS.                                            00004000
000050     03  RPWSEG-SEGID                PIC X(01).                   00005000
000060     03  RPWSEG-SEGRETURN            PIC X(01).                   00006000
000070     03  RPWSEG-MSTTABLE.                                         00007000
000080         05  RPWSEG-MSTITEM                      OCCURS 50.       00008000
000090             07  RPWSEG-MSTORGID     PIC X(01).                   00009000
000100             07  RPWSEG-MSTFROMKEY   PIC X(29).                   00010000
000110             07  RPWSEG-MSTTOKEY     PIC X(29).                   00011000
000120     03  RPWSEG-ORGID-TABLE.                                      00012000
000130         05  RPWSEG-ORGID            PIC X(01)   OCCURS 35.       00013000
000140******************************************************************00014000
000150*   END OF COPYBOOK RPWSEG                                       *00015000
000160******************************************************************00016000
