//MMRS712L JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A
//*************************************************************************
//***** MMRS-M01  MAINFRAME MODERNIZATION REFERENCE SYSTEM
//*************************************************************************
//***** VSAM      LISTCAT OF ALL FILES IN CATALOG
//*************************************************************************
//STEPLSTC EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
   LISTCAT ALL CATALOG(CATALOG.USERAA)
//*
