//MMRS712J JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A
//*************************************************************************
//***** MMRS-M01  mainframe modernization reference system
//*************************************************************************
//***** MMRS712J  IDCAMS load data into KSDS, ESDS and RRDS
//*************************************************************************
//LIB  JCLLIB ORDER=(MMRS00C.A.PROC)
//*
//    SET F=MMRS00C.AWA.MMRS0111.FIX
//    SET FB=MMRS00C.AWA.MMRS0111.FIX.BLK
//    SET V=MMRS00C.AWA.MMRS0111.VAR
//    SET VB=MMRS00C.AWA.MMRS0111.VAR.BLK
//    SET VSAMK=MMRS00C.AWA.VSAMK
//    SET VSAMR=MMRS00C.AWA.VSAMR
//    SET VSAME=MMRS00C.AWA.VSAME
//    SET VSAMKUNL=MMRS00C.AWA.VSAMK.UNLOAD
//    SET VSAMRUNL=MMRS00C.AWA.VSAMR.UNLOAD
//    SET VSAMEUNL=MMRS00C.AWA.VSAME.UNLOAD
//    SET VSAMKRAW=MMRS00C.AWA.VSAMK.RAW
//    SET VSAMRRAW=MMRS00C.AWA.VSAMR.RAW
//    SET VSAMERAW=MMRS00C.AWA.VSAME.RAW
//*   FILES FROM Z/OS TRANSFERRED WITH FTP USED TO LOAD INTO ORACLE
//    SET VSAMKRAWZ=MMRS00C.AWA.ZOS.VSAMK.RAW
//    SET VSAMRRAWZ=MMRS00C.AWA.ZOS.VSAMR.RAW
//    SET VSAMERAWZ=MMRS00C.AWA.ZOS.VSAME.RAW
//*   ASSIGN THE FILES TO BE LOADED INTO ORACLE
//    SET LOADK=&VSAMKRAWZ
//    SET LOADR=&VSAMRRAWZ
//    SET LOADE=&VSAMERAWZ
//*
//*************************************************************************
//***** MMRS712J  IDCAMS load data into KSDS, ESDS and RRDS
//*************************************************************************
//STEPVSK  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//IN       DD  DISP=OLD,DSN=&LOADK
//OUT      DD  DISP=SHR,DSN=&VSAMK
//SYSIN    DD  *
  REPRO INFILE(IN) OUTFILE(OUT)
/*
//STEPVSKP EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//MYVSAMK DD DISP=SHR,DSN=&VSAMK
//SYSIN    DD *
   PRINT INFILE(MYVSAMK) HEX
//*
//*
//STEPVSE  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//IN       DD  DISP=OLD,DSN=&LOADE
//OUT      DD  DISP=MOD,DSN=&VSAME
//SYSIN    DD  *
  REPRO INFILE(IN) OUTFILE(OUT)
/*
//STEPVSEP EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//MYVSAME DD DISP=SHR,DSN=&VSAME
//SYSIN    DD *
   PRINT INFILE(MYVSAME)
//*
//*
//STEPVSR  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//IN       DD  DISP=OLD,DSN=&LOADR
//OUT      DD  DISP=SHR,DSN=&VSAMR
//SYSIN    DD  *
  REPRO INFILE(IN) OUTFILE(OUT)
/*
//STEPVSRP EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//MYVSAMR DD DISP=SHR,DSN=&VSAMR
//SYSIN    DD *
   PRINT INFILE(MYVSAMR)
//*
