//MMRS711J JOB 'MMRS00C',CLASS=A,TIME=(1),LINES=1,REGION=0M,
//            MSGLEVEL=(2,1),MSGCLASS=A
//*************************************************************************
//***** MMRS-M01  mainframe modernization reference system
//*************************************************************************
//***** MMRS7111  cobol program writes data into several files
//***** MMRS7111  recordformat of files supported are
//***** MMRS7111     F, FB, V, VB, VSAM-ESDS, VSAM-KSDS, VSAM-RRDS
//*************************************************************************
//    SET F=MMRS00C.AWA.MMRS7111.FIX
//    SET FB=MMRS00C.AWA.MMRS7111.FIX.BLK
//    SET V=MMRS00C.AWA.MMRS7111.VAR
//    SET VB=MMRS00C.AWA.MMRS7111.VAR.BLK
//    SET VSAMK=MMRS00C.AWA.VSAMK
//    SET VSAMR=MMRS00C.AWA.VSAMR
//    SET VSAME=MMRS00C.AWA.VSAME
//*
//STEPDEL  EXEC PGM=IEFBR14
//MYFXOUT DD DISP=(MOD,DELETE),SPACE=(TRK,(1,5)),DSN=&F
//MYFBOUT DD DISP=(MOD,DELETE),SPACE=(TRK,(1,5)),DSN=&FB
//MYVXOUT DD DISP=(MOD,DELETE),SPACE=(TRK,(1,5)),DSN=&V
//MYVBOUT DD DISP=(MOD,DELETE),SPACE=(TRK,(1,5)),DSN=&VB
//*
//STEP01   EXEC PGM=MMRS7111
//STEPLIB  DD DSN=MMRS00C.A.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//MYFXOUT DD DISP=(NEW,CATLG,DELETE),
//         SPACE=(TRK,(1,5)),DCB=(RECFM=F,LRECL=80),
//         DSN=&F
//MYFBOUT DD DISP=(NEW,CATLG,DELETE),
//         SPACE=(TRK,(1,5)),DCB=(RECFM=FB,LRECL=80,BLKSIZE=160),
//         DSN=&FB
//MYVXOUT DD DISP=(NEW,CATLG,DELETE),
//         SPACE=(TRK,(1,5)),DCB=(RECFM=V,LRECL=84),
//         DSN=&V
//MYVBOUT DD DISP=(NEW,CATLG,DELETE),
//         SPACE=(TRK,(1,5)),DCB=(RECFM=VB,LRECL=84,BLKSIZE=172),
//         DSN=&VB
//MYVSAMK DD DISP=SHR,DSN=&VSAMK
//MYVSAMR DD DISP=SHR,DSN=&VSAMR
//MYVSAME DD DISP=SHR,DSN=&VSAME
//MYSYSIN  DD *
ALL
//MYDATIN  DD *
00310000001001111MRS. X
00310000002001111MR. Y
00510000002002AAA66750MAIN STREET
00410000002003BBBAUSTIN, TEXAS
00800000002004CCCTHIS IS A TEXTLINE   WITH 80 BYTES FOR MR. Y XXXXXXXXXXXXXXXXXX
00800000002005CCCTHIS IS A TEXTLINE   WITH 80 BYTES FOR MR. Y XXXXXXXXXXXXXXXXXX
00800000002006CCCTHIS IS A TEXTLINE   WITH 80 BYTES FOR MR. Y XXXXXXXXXXXXXXXXXX
00800000002007CCCTHIS IS A TEXTLINE   WITH 80 BYTES FOR MR. Y XXXXXXXXXXXXXXXXXX
00800000002008DDDSOME SPECIAL CHARACTERS 1: !"§$%&/()=?¡“¶¢[]|{}
00800000002009DDDSOME SPECIAL CHARACTERS 2: €€€€€€€ (EURO)
00800000002010DDDSOME SPECIAL CHARACTERS 3: ÄÖÜÄÖÜ ;:_'*+#-.,
00310000003001111MRS. Z
00510000003002AAA77658ZUNI STREET
00410000003003BBBDENVER, COLORADO
00800000003004CCCTHIS IS A TEXTLINE   WITH 80 BYTES FOR MRS. Z XXXXXXXXXXXXXXXXX
00800000003005CCCTHIS IS A TEXTLINE   WITH 80 BYTES FOR MRS. Z XXXXXXXXXXXXXXXXX
00800000003006CCCTHIS IS A TEXTLINE   WITH 80 BYTES FOR MRS. Z XXXXXXXXXXXXXXXXX
00800000003007CCCTHIS IS A TEXTLINE   WITH 80 BYTES FOR MRS. Z XXXXXXXXXXXXXXXXX
00310000004001111MR. A
00800000004002CCCTHIS IS A TEXTLINE   WITH 80 BYTES FOR MRS. A XXXXXXXXXXXXXXXXX
//*
//STEP02   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//MYVSAMK DD DISP=SHR,DSN=&VSAMK
//* +++CHECK ONLY KEYS LISTED. DATA MISSING IN LISTING
//SYSIN    DD *
   PRINT INFILE(MYVSAMK) HEX
//*
//STEP03   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//MYVSAMR DD DISP=SHR,DSN=&VSAMR
//* +++CHECK ONLY KEYS LISTED. DATA MISSING IN LISTING
//SYSIN    DD *
   PRINT INFILE(MYVSAMR) HEX
//*
//STEP04   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//MYVSAME DD DISP=SHR,DSN=&VSAME
//* +++CHECK ONLY KEYS LISTED. DATA MISSING IN LISTING
//SYSIN    DD *
   PRINT INFILE(MYVSAME) HEX
//*

