       IDENTIFICATION DIVISION.
       PROGRAM-ID. MIN14305A.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370 WITH DEBUGGING MODE. 
       PROCEDURE DIVISION.
       EXEC SQL 
          SELECT B.PNDG_TXN_ID
123456D ,B.VAST_ACCT_NO
135478D ,B.PORT_ID
156786D ,B.PROCS_DT
          INTO :AD052-PNDG-TXN-ID
054646D ,:WS-VAST-ACCT-NO
462363D ,:WS-PORT-ID
154543D ,:WS-PROCS-DT
          FROM VFSORD1 A
          INNER JOIN VPOSN_PNDG_TXN B
          ON A.FND_CUST_ACCT_ID = B.VAST_ACCT_NO
          WHERE A.NSCC_CL_ID = :VFSORD1-NSCC-CL-ID
          WITH UR
         END-EXEC.
         GOBACK.

