 SIMPLE: PROCEDURE OPTIONS(MAIN);
    SELECT ;
    WHEN (LABEL_A()) 
     PUT SKIP LIST('INSIDE WHEN LABEL_A');
    WHEN (LABEL_B())
     PUT SKIP LIST('INSIDE WHEN LABEL_B');
    OTHERWISE PUT SKIP LIST('NO MATCH FOUND');       
    END; 
 END SIMPLE;