 SIMPLE: PROCEDURE OPTIONS(MAIN);
    SELECT (RESULT); 
    WHEN (RESULT)
     PUT SKIP LIST(' MATCH FOUND');
    OTHERWISE PUT SKIP LIST(' NO MATCH FOUND');
    END;
 END SIMPLE;