//OSWAYAO JOB (20,FB3),'I',
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
// NOTIFY=&SYSUID,
// REGION=0M
//*
//*
//DFSF10 JCLLIB ORDER=(VENDOR.PROCLIB,DFSF10.PROCLIB)
//       EXPORT SYMLIST=(*)
//*
//* Change the following variables to match your requirements
//*
//* The name of your PSB
//        SET PSB=INRUN1
//* The name of your DBD
//        SET DBD=INDB1
//* The name of your INDEX DBD for HIDAM or PHIDAM
//        SET DBDI=INDB1I
//* The name of your cobol program that executes IMS commands
//        SET PGM=QATF82B
//* Where your temporary test datasets will be stored
//        SET HLQ=OSWAYAO.TEST
//* Your mainframe username
//        SET UNAME=OSWAYAO
//*
//* SCRATCH DATA SETS
//*
//HIDAMUPD EXEC PGM=DFSRRC00,
//             PARM='DLI,&PGM.,&PSB.,,,,,,,,,,N,N'
//DFSRESLB DD DSNAME=DFSF10.SDFSRESL,DISP=SHR
//DFSPRING DD SYSOUT=*,DCB=(BLKSIZE=605,LRECL=121,RECFM=FBA)
//STEPLIB  DD DISP=SHR,DSN=DFSF10.SDFSRESL
//         DD DISP=SHR,DSN=&HLQ..PGMLIB
//IMS      DD DISP=SHR,DSN=&HLQ..PSBLIB
//         DD DISP=SHR,DSN=&HLQ..DBDLIB
//*
//IEFRDER  DD DSN=&&IMSLOG,DISP=(NEW,PASS)
//DFSVSAMP DD DISP=SHR,DSN=DFSF10.PROCLIB(DFSVSMDB)
//DFSCTL   DD DISP=SHR,DSN=DFSF10.PROCLIB(DFSSBPRM)
//IMSLOGR  DD DSN=&&LOGF,DISP=(NEW,DELETE,DELETE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0,BUFNO=25),
//            SPACE=(TRK,1,RLSE)
//DFSSTAT  DD SYSOUT=*
//SYSEXEC  DD DISP=SHR,DSN=DFSF10.INSTALIB
//         DD DISP=SHR,DSN=DFSF10.SDFSEXEC
//*  Create the output file
//OUT DD DSN=&UNAME..IMSOUT,DISP=(NEW,CATLG,DELETE),
//      SPACE=(CYL,(20,20)),
//      RECFM=FB,LRECL=80,BLKSIZE=8000
//SYSTSIN  DD *
//*
//SYSTSPRT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//*
//* Partitioned DB INDB1
//INDB1  DD DSNAME=&HLQ..&DBD.,DISP=SHR
//INDB1I DD DSNAME=&HLQ..&DBDI.,DISP=SHR
//*