  /* Manual test file for Control flow IF statement  */ 
 WMIN3020_IfMultipleComplexity: PROC OPTIONS(MAIN);
	IF(a > b)
	THEN
		PUT SKIP LIST('INSIDE IF FOR ISFINITE');
		
	ISFIN:PROCEDURE RETURNS(BIT);
		DCL FLOAT_B REAL FLOAT DECIMAL(2) INIT(21);
		DCL RESULT BIT;

		PUT SKIP LIST('INSIDE ISFIN FUNCTION');
		RESULT = ISFINITE(FLOAT_B);
		RETURN (RESULT);
	END ISFIN; 
 END WMIN3020_IfMultipleComplexity;
