 WNDT3227_NestedPreprocessorIf: PROCEDURE OPTIONS(MAIN);
	%if (U > V + W & U < X | V < B) %then
          return (0);
    %else
       %if (Z < P + W +C & U > X | V < B) %then
          return (0);
       %else
          return (U*V*W);
 END WNDT3227_NestedPreprocessorIf;
