 WNDT3227_PreprocessorIf: PROCEDURE OPTIONS(MAIN);
	%if (a > c ) %then
      return (0);
    %else
      return (U*V*W);
 END WNDT3227_PreprocessorIf;
