       IDENTIFICATION DIVISION.
       PROGRAM-ID. MIN636
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           PERFORM FIRSTS THRU SECONDS.
           DISPLAY 'END 1'
           GOBACK.
       FIRSTS SECTION.
       LABEL2.
           DISPLAY '2'.
       LABEL1.
           DISPLAY '1'.
       SECONDS SECTION.
       LABEL5.
           DISPLAY '5'.
       ENDSEC SECTION.
           DISPLAY 'END UNREACHABLE'
           GOBACK.
