       IDENTIFICATION DIVISION.
       PROGRAM-ID. MIN636A
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           DISPLAY 'NO SECTION'.
           PERFORM FIRSTS THRU LABEL2.

       LABEL0.
           DISPLAY 'UNREACHABLE'.
           PERFORM LABEL1.
       LABEL1.
           DISPLAY '1'.
       FIRSTS SECTION.
           PERFORM LABEL2 THRU LABEL1.
           DISPLAY 'SEC 1 NO LABEL'.
       LABEL2.
           DISPLAY 'SEC 1 LABEL 2'.
       LABEL3.
           DISPLAY 'LABEL 3'.
       LABEL1.
           DISPLAY 'LABEL 1 SEC 1'.

       SECONDS SECTION.
           DISPLAY 'SEC 2'.
       LABEL1.
           DISPLAY 'LABEL 1 SEC 2'.

       ENDSEC SECTION.
           DISPLAY 'END'
           GOBACK.
