//IMSBATCH PROC MBR=VAR1,PSB=VAR2                                                   
//STP01   EXEC PGM=DFSRRC00,                                                    
//             PARM=(DLI,&MBR,&PSB)  