//JOB110B JOB (J00,068),'JOB110B',                                            
//      MSGCLASS=A,PRTY=11,TIME=(30)                                            
//PS020   EXEC PROC=IMSBATCH,MBR=XYZ010,PSB=PSB010,IMSID=IMSA,
//            SOUT='*',AGN=AGNA43,SSM=D21E,RGN=4096K,TIME=(60)                                                                           
//*                                                                             
