000060 IDENTIFICATION DIVISION.
000080
000090 PROGRAM-ID.  EXEC_SQL_SUBSTRING.
000100

000260 ENVIRONMENT DIVISION.
000270
000280 CONFIGURATION SECTION.
000290 SOURCE-COMPUTER.        VAX.
000300 OBJECT-COMPUTER.        VAX.
000310
000320 INPUT-OUTPUT SECTION.
000400 DATA DIVISION.
000410 WORKING-STORAGE SECTION.

004920 PROCEDURE DIVISION.

012260     EXEC SQL
012270         SELECT
012280                 SUBSTRING(CLMINV02_BC_PRV_NUM FROM 4 FOR 3),
012290                 SUBSTRING(CLMINV02_BC_PRV_NUM FROM 8 FOR 2),
012300                 SUBSTRING(CLMINV02_BC_PRV_NUM FROM 1 FOR 1)
012350         INTO
012360                 :INV_AA_ERROR        :WS_NULL_IND_21,
012370                 :INV_AA_SVC          :WS_NULL_IND_22,
012380                 :INV_AA_ATTACH       :WS_NULL_IND_23
012430         FROM
012440                 CLMINVDB.CLMINV02_CLAIM_HEADER
012480     END-EXEC.
015660     STOP RUN.
