//A15WP235 JOB (235-0-2481-WG,16),'CVIC PRODUCTION ',CLASS=O,                   
//             REGION=4M                                                        
//LPRV8600 PROC INIT='P',                                                       
//             SYSOUT='T'                                                     
//*---------------------------------------------------------------------        
//PS040   EXEC PGM=BLMP8603                      
//ABENDAID  DD SYSOUT=&SYSOUT                                                 
//      PEND                                                                    
//JS010 EXEC LPRV8600                                                           
