//LPRV8600 PROC INIT='I'                                                     
//*                                                                             
//PS040    EXEC PGM=WAAPDSUT                                                    
//SYSPRINT DD  SYSOUT=T                                                         
                                           