       IDENTIFICATION DIVISION.
       PROGRAM-ID. NDT3022G.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
         WORKING-STORAGE SECTION.
          REPLACE ==VAR3== BY ==D==.
          COPY SAMPLE1 OF WMIN2447.
          REPLACE OFF.
       PROCEDURE DIVISION.
          COPY SAMPLE2 OF WMIN2447 REPLACING ==VAR1== BY ==A==.
          DISPLAY 'Hello'.
       STOP RUN.