DEFINE DATA
LOCAL
1 MYVIEW VIEW OF EMPLOYEES
  2 CITY
  2 INCOME(3)
     3 BONUS(#I)
1 GETVIEW VIEW OF EMPLOYEES
  2 BONUS(3,5)
END-DEFINE

F1. FIND (20) MYVIEW WITH CITY = 'FRANKFURT'
  GET GETVIEW *ISN(F1.)
END-FIND

END
