//APL060    PROC HL1='APP.DAY',          INPUT  FILE
//          HL2='NULLFILE',              OUTPUT
//          HLP1='ENDVR.USR.PROD',       SYSIN LIBRARY
//          HLP2='ENDVR.USR.PROD',       EZTRIEVE LIBRARY
//          LN1='VOUCHRNO',              VOUCHER NO. FILE
//          GDGI='+1',                   GENERATION FOR IMAGE
//          GDGD='+1',                   GENERATION FOR DISTIBUTION
//          CONTROL='NULLFILE',          INPUT FILE NAME CONTROL
//          INAME='NULLFILE',            INPUT FILE NAME CONTROL
//          IFILE='NULLFILE',            INPUT FILE NAME
//          BKUP='NULLFILE',             INPUT FILE NAME CONTROL
//          OUTCA='R'                    BALANCE RPT
//*
//*
//PS040    EXEC PGM=SORT,COND=((0,NE,PS010),(0,NE,PS020),
//         (0,NE,PS030))
//**********************************************************************
//*     SORT RAW INPUT                                                 *
//**********************************************************************
//SORTIN   DD   DSN=&IFILE,DISP=SHR
//SORTOUT  DD   DSN=&&INFILE,DISP=(NEW,PASS),
//         UNIT=SYSDA,
//         SPACE=(CYL,(200,5),RLSE),
//         DCB=(LRECL=255,RECFM=FB)
//SYSOUT   DD   SYSOUT=*
//SYSIN    DD   DSN=&HLP1..SYSIN(APS06001),DISP=SHR
//SORTWK01 DD   UNIT=SYSDA,
//         SPACE=(CYL,(5,2))
//SORTWK02 DD   UNIT=SYSDA,
//         SPACE=(CYL,(5,2))
//SORTWK03 DD   UNIT=SYSDA,
//         SPACE=(CYL,(5,2))
//SYSABOUT DD   SYSOUT=*
//*
//*
//PS050    EXEC PGM=AP00H60A,COND=((0,NE,PS010),(0,NE,PS020),
//         (0,NE,PS040))
//**********************************************************************
//** WILL CREATE THE A/P DISTRIBUTION FILE FOR INPUT FILE              *
//**********************************************************************
//SLCTFILE DD   DSN=&HLP1..SYSIN(INTRFACE),DISP=SHR
//PCEXPNCS DD   DSN=&&INFILE,DISP=(OLD,DELETE)
//AVVCHRNO DD   DSN=&HL1..&LN1,DISP=SHR
//BALRPT   DD   DSN=&&IMAGING,
//         DISP=(NEW,PASS,DELETE),
//         UNIT=SYSDA,SPACE=(CYL,(200,10),RLSE),
//         DCB=(RECFM=FB,LRECL=133)
//APDISTB  DD   DSN=&&OUTTRAN,DISP=(NEW,PASS),
//         UNIT=SYSDA,
//         SPACE=(CYL,(200,5),RLSE),
//         DCB=(RECFM=FB,LRECL=99)
//*
//SYSABOUT DD   SYSOUT=*
//SYSDBOUT DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SYSIN    DD   DUMMY
//SYSUDUMP DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//*
//*
//PS060    EXEC PGM=SORT,COND=((0,NE,PS010),(0,NE,PS020),
//         (0,NE,PS050))
//**********************************************************************
//*     SORT AP TRANSACTIONS                                           *
//**********************************************************************
//SORTIN   DD   DSN=&&OUTTRAN,DISP=(OLD,DELETE)
//SORTOUT  DD   DSN=&&SORTTRAN,
//         DISP=(NEW,PASS,DELETE),
//         UNIT=SYSDA,SPACE=(CYL,(200,10),RLSE),
//         DCB=(RECFM=FB,LRECL=99)
//SYSOUT   DD   SYSOUT=*
//SYSIN    DD   DSN=&HLP1..SYSIN(APS06002),DISP=SHR
//SORTWK01 DD   UNIT=SYSDA,
//         SPACE=(CYL,(5,2))
//SORTWK02 DD   UNIT=SYSDA,
//         SPACE=(CYL,(5,2))
//SORTWK03 DD   UNIT=SYSDA,
//         SPACE=(CYL,(5,2))
//SYSABOUT DD   SYSOUT=*
//*
//*
//PS070    EXEC PGM=EZTPA00,
//          COND=((0,NE,PS010),(0,NE,PS020),
//          (0,NE,PS060))
//**********************************************************************
//*     ADD BATCH IDENTIFIER TO BATCH HEADER                           *
//**********************************************************************
//STEPLIB  DD   DSN=ZXP.EZTP.R619313.LOADLIB,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSSNAP  DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//EZTVFM   DD   UNIT=SYSDA,SPACE=(4096,(300,300))
//MACDDN   DD   DSN=NULLFILE,DISP=SHR
//INFILE   DD   DSN=&&SORTTRAN,DISP=(OLD,DELETE)
//INFILE2  DD   DSN=&HLP1..SYSIN(&CONTROL),DISP=SHR
//OUTFILE  DD   DSN=&HL1..W60NTRFC.&HL2.(&GDGD),
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,
//         SPACE=(CYL,(250,10),RLSE),
//         DCB=(RECFM=FB,LRECL=99)
//SYSIN    DD   DSN=&HLP2..EZTRIEVE(AP10E60B),DISP=SHR
//SYSABOUT DD   SYSOUT=*
//*
//*---------- ENDPROC APL060 ----------*
