//TESTJOB JOB
//*
//SORT1   EXEC PGM=SORT
//SYSIN    DD  DISP=SHR,DSN=TEST.DSA.FOO.CONTROL(CONTROLA)
//*
//SORT2   EXEC PGM=SORT
//SYSIN    DD  DISP=SHR,DSN=TEST.DSB.FOO.CONTROL(CONTROLA)
//*
//SORT3   EXEC PGM=SORT
//SYSIN    DD  DISP=SHR,DSN=TEST.DSC.FOO.CONTROL(CONTROLB)

