       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTFILLERREDEFINES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       01  MY-HEX-SHOW-CHARS PIC X(16) VALUE '0123456789ABCDEF'.
       01  REDEFINES MY-HEX-SHOW-CHARS.
              05 MY-HEX-SHOW-CHAR PIC X(1) OCCURS 16.
              
       PROCEDURE DIVISION.

            DISPLAY MY-HEX-SHOW-CHARS.
            DISPLAY REDEFINES MY-HEX-SHOW-CHARS.
            DISPLAY MY-HEX-SHOW-CHAR.
              
       END PROGRAM TESTFILLERREDEFINES.