       IDENTIFICATION DIVISION.
       PROGRAM-ID. WC47CLLR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

        01 DUMMY PIC X(1).
        01 WS-FIELD-B-1 PIC X(1).

       PROCEDURE DIVISION.

         CALL "TEST8a" USING DUMMY, WS-FIELD-B-1.

       END PROGRAM WC47PGM8.
