00100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PROGB.
000800
000900 DATA DIVISION.
001000 WORKING-STORAGE SECTION.
       01 MY-PROGNAM-NAME PIC X(10) VALUE 'PROGB'.

       LINKAGE SECTION.
       01 LINKAGE-STUFF.
           05 PARAMETER-FIELD PIC X(10).
           05 PARAMETER-FIELD-2 PIC X(5).

001700 PROCEDURE DIVISION USING PARAMETER-FIELD, PARAMETER-FIELD-2.

           DISPLAY MY-PROGNAM-NAME  ' START2 '

