000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. WMIN143B.
000900 DATA DIVISION.
001000 WORKING-STORAGE SECTION.

       01 MY-PROGRAM-NAME PIC X(10) VALUE 'PROGA'.
       01 PROGRAM-NAME PIC X(10) VALUE 'PROGB'.
       
       01 A-GROUP.
           05 A-GROUP-FIELD PIC X(10).
           
       01 ANOTHER-GROUP.
           05 ANOTHER-GROUP-FIELD PIC X(5).
           05 ANOTHER-GROUP-FIELD-2 PIC X(5).
           
       01 ANOTHER-GROUP-REDEFINED REDEFINES A-GROUP.
           05 A-REDEFINED-GROUP-FIELD PIC X(5).
           05 A-REDEFINED-GROUP-FIELD-2 PIC X(5).
001700 PROCEDURE DIVISION.
           DISPLAY MY-PROGRAM-NAME  ' START '.
           MOVE 'ABCDEF' TO A-GROUP-FIELD.
           MOVE A-GROUP-FIELD TO ANOTHER-GROUP-FIELD.
           
           CALL "TEST7b" USING A-GROUP-FIELD, ANOTHER-GROUP-FIELD.
