       IDENTIFICATION DIVISION.

       PROGRAM-ID.    MEE8118C.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
       0000-MAINLINE.
           PERFORM 1000-INITIALIZE THRU 1000-INITIALIZE-EXIT.

       0000-MAINLINE-EXIT. EXIT.

       1000-INITIALIZE.
           DISPLAY 'MEE8118C before call  MEE8118D'.
           CALL 'MEE8118D'.
           DISPLAY 'MEE8118C after call  MEE8118D'.

       1000-INITIALIZE-EXIT. EXIT.

           GOBACK.
       END PROGRAM MEE8118C.
