       IDENTIFICATION DIVISION.

       PROGRAM-ID.    MEE8118D.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY 'MEE8118D Beginning'.
           PERFORM 2000-OPEN-MASTER.
           DISPLAY 'MEE8118D Before goback'.
           GOBACK.
           DISPLAY 'MEE8118D After goback'.

       2000-OPEN-MASTER.
           DISPLAY 'MEE8118D 2000-OPEN-MASTER'.

       2000-OPEN-MASTER-EXIT.
           DISPLAY 'MEE8118D 2000-OPEN-MASTER-EXIT'.
           EXIT.

       3000-CLOSE-MASTER.
           DISPLAY 'MEE8118D 3000-CLOSE-MASTER'.

       3000-CLOSE-MASTER-EXIT. EXIT.

       END PROGRAM MEE8118D.
