       IDENTIFICATION DIVISION.

       PROGRAM-ID.    MEE8118B.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY 'MEE8118B Beginning'.
           PERFORM 2000-OPEN-MASTER THRU 2000-OPEN-MASTER-EXIT.
           DISPLAY 'MEE8118B Before goback'.
           GOBACK.
           DISPLAY 'MEE8118B After goback'.

       2000-OPEN-MASTER.
           DISPLAY 'MEE8118B 2000-OPEN-MASTER'.

       2000-OPEN-MASTER-EXIT. EXIT.

       3000-CLOSE-MASTER.
           DISPLAY 'MEE8118B 3000-CLOSE-MASTER'.

       3000-CLOSE-MASTER-EXIT. EXIT.

       END PROGRAM MEE8118B.
