//T446KADL JOB (00200091,N591265),'RTS DICKSO BDG6 501H',
//  MSGLEVEL=(1,1),TIME=99,CLASS=H,MSGCLASS=R
//*
//IFSTMT2 IF STEP05.RC = 04 THEN
//STEP06   EXEC PGM=IFCOND6     
//        ELSE                  
//STEP07   EXEC PGM=IFCOND7
//        ENDIF

