DEFINE DATA
LOCAL
END-DEFINE

READ1. READ MYVIEW BY CITY STARTING FROM 'M' ENDING AT 'R'

END-READ

F1. FIND (20) MYVIEW WITH CITY = 'FRANKFURT'
  GET GETVIEW *ISN(F1.)
END-FIND

HISTOGRAM MYVIEW IN ASCENDING SEQUENCE CURRENCY-SALARY 
  
END-HISTOGRAM

STORE MYVIEW

F1. FIND (20) MYVIEW WITH CITY = 'FRANKFURT'
  DELETE(F1.)
END-FIND

F2. FIND (20) MYVIEW WITH CITY = 'FRANKFURT'
  UPDATE(F2.)
END-FIND

END
