//$DFPPRVC JOB (A,X,52ZM00),'UPDT STATUS CODE',PRTY=15,MSGCLASS=Y,      00010001
//  USER=ZPRSTJT                                                        00020001
//*                                                                     00030001
//*+JBS BIND XPDDBA1.ONLINE                                             00040001
//*AUTOBEEP PAGE=PMDCSTAT                                               00050001
//LOADUTIL EXEC PGM=IKJEFT01                                            00060001
//STEPLIB  DD DSN=AXXXA1.DB2.RUNLIB.LOAD,DISP=SHR                       00070001
//         DD DSN=AXXXA1.DB2.SDSNLOAD,DISP=SHR                          00080001
//SYSTSPRT DD SYSOUT=*                                                  00090001
//SYSPRINT DD SYSOUT=*                                                  00100001
//SYSTSIN  DD *                                                         00110001
  DSN SYSTEM(DBA1)                                                      00120001
  RUN PROGRAM(DSNTEP2) PLAN(DSNTEP2)                                    00130001
  END                                                                   00140001
/*                                                                      00150001
//*                                                                     00160001
//********************************************************************  00170001
//*** THIS JOB SETS ALL PRE-AUDIT REQUESTS TO A STATUS OF '7'           00180001
//*** SO THAT THEY WON'T GET PICKED UP DURING QUARTER END PROCESSING    00190001
//********************************************************************  00200001
//*                                                                     00210001
//SYSIN DD *                                                            00220001
  SELECT * FROM NZNH.STMT_RQST                                          00220002
   WHERE   CREATE_BY        = 2455                                      00220003
     AND   STMT_STAT_ID    ^= 7;                                        00220004
  UPDATE   NZNH.STMT_RQST                                               00220005
     SET   STMT_STAT_ID     = 7                                         00220006
   WHERE   CREATE_BY        = 2455                                      00220007
     AND   STMT_STAT_ID    ^= 7;                                        00220008
  SELECT * FROM NZNH.STMT_RQST                                          00220009
   WHERE   CREATE_BY        = 2455                                      00220010
     AND   STMT_STAT_ID    ^= 7;                                        00220020
/*                                                                      00270001
//*                                                                     00280001
//********************************************************************  00290001