       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRG1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
 
       COPY CPY1.
 
       01  WS-YEAR-NUM PIC 9(4) VALUE 2000.
 
       PROCEDURE DIVISION.
       DISPLAY WS-YEAR-NUM.
 
       .
       END PROGRAM PRG1.