000010******************************************************************00001000
000020* MIS7114F - CARD LAYOUT (FORM 7114)                             *00002000
000030******************************************************************00003000
000040     03  MI7114C-RECORD.                                          00004000
000050         05  MIC-7114SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7114FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7114CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7114CARD00.                                      00008000
000090             07  MIC-7114INST    PIC 9(04).                       00009000
000100             07  MIC-7114RATETABLE                                00010000
000110                                 PIC X(06).                       00011000
000120             07  MIC-7114TERM    PIC 9(05).                       00012000
000130             07  FILLER          PIC X(49).                       00013000
000140             07  MIC-7114SEQ00   PIC X(08).                       00014000
000150         05  MIC-7114CARD01                                       00015000
000160                         REDEFINES MIC-7114CARD00.                00016000
000170             07  MIC-7114RATEAMT-1                                00017000
000180                                 PIC 9(09).                       00018000
000190             07  MIC-7114RATEPCT-1                                00019000
000200                                 PIC V9(09).                      00020000
000210             07  MIC-7114RATEAMT-2                                00021000
000220                                 PIC 9(09).                       00022000
000230             07  MIC-7114RATEPCT-2                                00023000
000240                                 PIC V9(09).                      00024000
000250             07  MIC-7114RATEAMT-3                                00025000
000260                                 PIC 9(09).                       00026000
000270             07  MIC-7114RATEPCT-3                                00027000
000280                                 PIC V9(09).                      00028000
000290             07  FILLER          PIC X(10).                       00029000
000300             07  MIC-7114SEQ01   PIC X(08).                       00030000
000310         05  MIC-7114CARD02                                       00031000
000320                         REDEFINES MIC-7114CARD00.                00032000
000330             07  MIC-7114RATEAMT-4                                00033000
000340                                 PIC 9(09).                       00034000
000350             07  MIC-7114RATEPCT-4                                00035000
000360                                 PIC V9(09).                      00036000
000370             07  MIC-7114RATEAMT-5                                00037000
000380                                 PIC 9(09).                       00038000
000390             07  MIC-7114RATEPCT-5                                00039000
000400                                 PIC V9(09).                      00040000
000410             07  MIC-7114RATEAMT-6                                00041000
000420                                 PIC 9(09).                       00042000
000430             07  MIC-7114RATEPCT-6                                00043000
000440                                 PIC V9(09).                      00044000
000450             07  FILLER          PIC X(10).                       00045000
000460             07  MIC-7114SEQ02   PIC X(08).                       00046000
000470         05  MIC-7114CARD03                                       00047000
000480                         REDEFINES MIC-7114CARD00.                00048000
000490             07  MIC-7114RATEAMT-7                                00049000
000500                                 PIC 9(09).                       00050000
000510             07  MIC-7114RATEPCT-7                                00051000
000520                                 PIC V9(09).                      00052000
000530             07  MIC-7114RATEAMT-8                                00053000
000540                                 PIC 9(09).                       00054000
000550             07  MIC-7114RATEPCT-8                                00055000
000560                                 PIC V9(09).                      00056000
000570             07  MIC-7114RATEAMT-9                                00057000
000580                                 PIC 9(09).                       00058000
000590             07  MIC-7114RATEPCT-9                                00059000
000600                                 PIC V9(09).                      00060000
000610             07  FILLER          PIC X(10).                       00061000
000620             07  MIC-7114SEQ03   PIC X(08).                       00062000
000630         05  MIC-7114CARD04                                       00063000
000640                         REDEFINES MIC-7114CARD00.                00064000
000650             07  MIC-7114RATEAMT-10                               00065000
000660                                 PIC 9(09).                       00066000
000670             07  MIC-7114RATEPCT-10                               00067000
000680                                 PIC V9(09).                      00068000
000690             07  MIC-7114RATEAMT-11                               00069000
000700                                 PIC 9(09).                       00070000
000710             07  MIC-7114RATEPCT-11                               00071000
000720                                 PIC V9(09).                      00072000
000730             07  MIC-7114RATEAMT-12                               00073000
000740                                 PIC 9(09).                       00074000
000750             07  MIC-7114RATEPCT-12                               00075000
000760                                 PIC V9(09).                      00076000
000770             07  FILLER          PIC X(10).                       00077000
000780             07  MIC-7114SEQ04   PIC X(08).                       00078000
000790         05  MIC-7114CARD05                                       00079000
000800                         REDEFINES MIC-7114CARD00.                00080000
000810             07  MIC-7115RATEAMT-13                               00081000
000820                                 PIC 9(09).                       00082000
000830             07  MIC-7115RATEPCT-13                               00083000
000840                                 PIC V9(09).                      00084000
000850             07  MIC-7114RATEAMT-14                               00085000
000860                                 PIC 9(09).                       00086000
000870             07  MIC-7114RATEPCT-14                               00087000
000880                                 PIC V9(09).                      00088000
000890             07  MIC-7114RATEAMT-15                               00089000
000900                                 PIC 9(09).                       00090000
000910             07  MIC-7114RATEPCT-15                               00091000
000920                                 PIC V9(09).                      00092000
000930             07  FILLER          PIC X(10).                       00093000
000940             07  MIC-7114SEQ05   PIC X(08).                       00094000
000950*----------------------------------------------------------------*00095000
000960*            END OF MICM 7114 CARD DESCRIPTION                   *00096000
000970*----------------------------------------------------------------*00097000
