000010******************************************************************00001000
000020* MIS7112  SECONDARY SERVICE TABLE                         (M12) *00002000
000030******************************************************************00003000
000040*01  MI7112-RECORD.                                              *00004000
000050     03  MIM-7112GRP-KEY.                                         00005000
000060         05  MIM-7112KINST       PIC 9(04).                       00006000
000070         05  MIM-7112KREC        PIC 9(04).                       00007000
000080         05  MIM-7112KSSTABLE    PIC X(06).                       00008000
000090*---------------------------------------------------------------* 00009000
000100     03  MIM-7112AUDIT-STAMP.                                     00010000
000110         05  MIM-7112UPD-DATE    PIC S9(09)      COMP-3.          00011000
000120         05  MIM-7112UPD-TIME    PIC S9(09)      COMP-3.          00012000
000130         05  MIM-7112UPD-USER    PIC X(08).                       00013000
000140         05  MIM-7112UPD-ORG     PIC X(06).                       00014000
000150*---------------------------------------------------------------* 00015000
000160     03  MIM-REC7112.                                             00016000
000170         05  MIM-7112BALOPT      PIC X(01).                       00017000
000180         05  MIM-REC7112-DATA.                                    00018000
000190             07  MIM-7112AMT-1   PIC S9(09)V99   COMP-3.          00019000
000200             07  MIM-7112SECSERV-1                                00020000
000210                                 PIC X(06).                       00021000
000220             07  MIM-7112AMT-2   PIC S9(09)V99   COMP-3.          00022000
000230             07  MIM-7112SECSERV-2                                00023000
000240                                 PIC X(06).                       00024000
000250             07  MIM-7112AMT-3   PIC S9(09)V99   COMP-3.          00025000
000260             07  MIM-7112SECSERV-3                                00026000
000270                                 PIC X(06).                       00027000
000280             07  MIM-7112AMT-4   PIC S9(09)V99   COMP-3.          00028000
000290             07  MIM-7112SECSERV-4                                00029000
000300                                 PIC X(06).                       00030000
000310             07  MIM-7112AMT-5   PIC S9(09)V99   COMP-3.          00031000
000320             07  MIM-7112SECSERV-5                                00032000
000330                                 PIC X(06).                       00033000
000340             07  MIM-7112AMT-6   PIC S9(09)V99   COMP-3.          00034000
000350             07  MIM-7112SECSERV-6                                00035000
000360                                 PIC X(06).                       00036000
000370             07  MIM-7112AMT-7   PIC S9(09)V99   COMP-3.          00037000
000380             07  MIM-7112SECSERV-7                                00038000
000390                                 PIC X(06).                       00039000
000400             07  MIM-7112AMT-8   PIC S9(09)V99   COMP-3.          00040000
000410             07  MIM-7112SECSERV-8                                00041000
000420                                 PIC X(06).                       00042000
000430             07  MIM-7112AMT-9   PIC S9(09)V99   COMP-3.          00043000
000440             07  MIM-7112SECSERV-9                                00044000
000450                                 PIC X(06).                       00045000
000460             07  MIM-7112AMT-10  PIC S9(09)V99   COMP-3.          00046000
000470             07  MIM-7112SECSERV-10                               00047000
000480                                 PIC X(06).                       00048000
000490         05  MIM-REC7112-SECSERVINC                               00049000
000500                         REDEFINES MIM-REC7112-DATA               00050000
000510                                                 OCCURS 10.       00051000
000520             07  MIM-7112AMT     PIC S9(09)V99   COMP-3.          00052000
000530             07  MIM-7112SECSERV PIC X(06).                       00053000
000540*----------------------------------------------------------------*00054000
000550*            END OF MICM 7112 RECORD DESCRIPTION                 *00055000
000560*----------------------------------------------------------------*00056000
