000010******************************************************************00001000
000020* MIS7110F - CARD LAYOUT (FORM 7110)                             *00002000
000030******************************************************************00003000
000040     03  MI7110C-RECORD.                                          00004000
000050         05  MIC-7110SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7110FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7110CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7110CARD00.                                      00008000
000090             07  MIC-7110INST    PIC 9(04).                       00009000
000100             07  MIC-7110TRANPROFILE                              00010000
000110                                 PIC X(06).                       00011000
000120             07  FILLER          PIC X(54).                       00012000
000130             07  MIC-7110SEQ00   PIC X(08).                       00013000
000140         05  MIC-7110CARD01                                       00014000
000150                         REDEFINES MIC-7110CARD00.                00015000
000160             07  MIC-7110GRACE-DAYS                               00016000
000170                                 PIC 9(02).                       00017000
000180             07  MIC-7110DESCRIPTION                              00018000
000190                                 PIC X(30).                       00019000
000200             07  FILLER          PIC X(32).                       00020000
000210             07  MIC-7110SEQ01   PIC X(08).                       00021000
000220         05  MIC-7110CARD02                                       00022000
000230                         REDEFINES MIC-7110CARD00.                00023000
000240             07  MIC-7110COND-01 PIC X(01).                       00024000
000250             07  MIC-7110ACCUM-01                                 00025000
000260                                 PIC 9(02).                       00026000
000270             07  MIC-7110REL-01  PIC X(02).                       00027000
000280             07  MIC-7110OPTION-01                                00028000
000290                                 PIC X(01).                       00029000
000300             07  MIC-7110COUNT-01                                 00030000
000310                                 PIC 9(05).                       00031000
000320             07  MIC-7110AMOUNT-01                                00032000
000330                                 PIC 9(09)V99.                    00033000
000340             07  MIC-7110ACCUMDESC-01                             00034000
000350                                 PIC X(15).                       00035000
000360             07  FILLER          PIC X(27).                       00036000
000370             07  MIC-7110SEQ02   PIC X(08).                       00037000
000380         05  MIC-7110CARD03                                       00038000
000390                         REDEFINES MIC-7110CARD00.                00039000
000400             07  MIC-7110COND-02 PIC X(01).                       00040000
000410             07  MIC-7110ACCUM-02                                 00041000
000420                                 PIC 9(02).                       00042000
000430             07  MIC-7110REL-02  PIC X(02).                       00043000
000440             07  MIC-7110OPTION-02                                00044000
000450                                 PIC X(01).                       00045000
000460             07  MIC-7110COUNT-02                                 00046000
000470                                 PIC 9(05).                       00047000
000480             07  MIC-7110AMOUNT-02                                00048000
000490                                 PIC 9(09)V99.                    00049000
000500             07  MIC-7110ACCUMDESC-02                             00050000
000510                                 PIC X(15).                       00051000
000520             07  FILLER          PIC X(27).                       00052000
000530             07  MIC-7110SEQ03   PIC X(08).                       00053000
000540         05  MIC-7110CARD04                                       00054000
000550                         REDEFINES MIC-7110CARD00.                00055000
000560             07  MIC-7110COND-03 PIC X(01).                       00056000
000570             07  MIC-7110ACCUM-03                                 00057000
000580                                 PIC 9(02).                       00058000
000590             07  MIC-7110REL-03  PIC X(02).                       00059000
000600             07  MIC-7110OPTION-03                                00060000
000610                                 PIC X(01).                       00061000
000620             07  MIC-7110COUNT-03                                 00062000
000630                                 PIC 9(05).                       00063000
000640             07  MIC-7110AMOUNT-03                                00064000
000650                                 PIC 9(09)V99.                    00065000
000660             07  MIC-7110ACCUMDESC-03                             00066000
000670                                 PIC X(15).                       00067000
000680             07  FILLER          PIC X(27).                       00068000
000690             07  MIC-7110SEQ04   PIC X(08).                       00069000
000700         05  MIC-7110CARD05                                       00070000
000710                         REDEFINES MIC-7110CARD00.                00071000
000720             07  MIC-7110COND-04 PIC X(01).                       00072000
000730             07  MIC-7110ACCUM-04                                 00073000
000740                                 PIC 9(02).                       00074000
000750             07  MIC-7110REL-04  PIC X(02).                       00075000
000760             07  MIC-7110OPTION-04                                00076000
000770                                 PIC X(01).                       00077000
000780             07  MIC-7110COUNT-04                                 00078000
000790                                 PIC 9(05).                       00079000
000800             07  MIC-7110AMOUNT-04                                00080000
000810                                 PIC 9(09)V99.                    00081000
000820             07  MIC-7110ACCUMDESC-04                             00082000
000830                                 PIC X(15).                       00083000
000840             07  FILLER          PIC X(27).                       00084000
000850             07  MIC-7110SEQ05   PIC X(08).                       00085000
000860         05  MIC-7110CARD06                                       00086000
000870                         REDEFINES MIC-7110CARD00.                00087000
000880             07  MIC-7110COND-05 PIC X(01).                       00088000
000890             07  MIC-7110ACCUM-05                                 00089000
000900                                 PIC 9(02).                       00090000
000910             07  MIC-7110REL-05  PIC X(02).                       00091000
000920             07  MIC-7110OPTION-05                                00092000
000930                                 PIC X(01).                       00093000
000940             07  MIC-7110COUNT-05                                 00094000
000950                                 PIC 9(05).                       00095000
000960             07  MIC-7110AMOUNT-05                                00096000
000970                                 PIC 9(09)V99.                    00097000
000980             07  MIC-7110ACCUMDESC-05                             00098000
000990                                 PIC X(15).                       00099000
001000             07  FILLER          PIC X(27).                       00100000
001010             07  MIC-7110SEQ06   PIC X(08).                       00101000
001020         05  MIC-7110CARD07                                       00102000
001030                         REDEFINES MIC-7110CARD00.                00103000
001040             07  MIC-7110COND-06 PIC X(01).                       00104000
001050             07  MIC-7110ACCUM-06                                 00105000
001060                                 PIC 9(02).                       00106000
001070             07  MIC-7110REL-06  PIC X(02).                       00107000
001080             07  MIC-7110OPTION-06                                00108000
001090                                 PIC X(01).                       00109000
001100             07  MIC-7110COUNT-06                                 00110000
001110                                 PIC 9(05).                       00111000
001120             07  MIC-7110AMOUNT-06                                00112000
001130                                 PIC 9(09)V99.                    00113000
001140             07  MIC-7110ACCUMDESC-06                             00114000
001150                                 PIC X(15).                       00115000
001160             07  FILLER          PIC X(27).                       00116000
001170             07  MIC-7110SEQ07   PIC X(08).                       00117000
001180         05  MIC-7110CARD08                                       00118000
001190                         REDEFINES MIC-7110CARD00.                00119000
001200             07  MIC-7110COND-07 PIC X(01).                       00120000
001210             07  MIC-7110ACCUM-07                                 00121000
001220                                 PIC 9(02).                       00122000
001230             07  MIC-7110REL-07  PIC X(02).                       00123000
001240             07  MIC-7110OPTION-07                                00124000
001250                                 PIC X(01).                       00125000
001260             07  MIC-7110COUNT-07                                 00126000
001270                                 PIC 9(05).                       00127000
001280             07  MIC-7110AMOUNT-07                                00128000
001290                                 PIC 9(09)V99.                    00129000
001300             07  MIC-7110ACCUMDESC-07                             00130000
001310                                 PIC X(15).                       00131000
001320             07  FILLER          PIC X(27).                       00132000
001330             07  MIC-7110SEQ08   PIC X(08).                       00133000
001340         05  MIC-7110CARD09                                       00134000
001350                         REDEFINES MIC-7110CARD00.                00135000
001360             07  MIC-7110COND-08 PIC X(01).                       00136000
001370             07  MIC-7110ACCUM-08                                 00137000
001380                                 PIC 9(02).                       00138000
001390             07  MIC-7110REL-08  PIC X(02).                       00139000
001400             07  MIC-7110OPTION-08                                00140000
001410                                 PIC X(01).                       00141000
001420             07  MIC-7110COUNT-08                                 00142000
001430                                 PIC 9(05).                       00143000
001440             07  MIC-7110AMOUNT-08                                00144000
001450                                 PIC 9(09)V99.                    00145000
001460             07  MIC-7110ACCUMDESC-08                             00146000
001470                                 PIC X(15).                       00147000
001480             07  FILLER          PIC X(27).                       00148000
001490             07  MIC-7110SEQ09   PIC X(08).                       00149000
001500         05  MIC-7110CARD10                                       00150000
001510                         REDEFINES MIC-7110CARD00.                00151000
001520             07  MIC-7110COND-09 PIC X(01).                       00152000
001530             07  MIC-7110ACCUM-09                                 00153000
001540                                 PIC 9(02).                       00154000
001550             07  MIC-7110REL-09  PIC X(02).                       00155000
001560             07  MIC-7110OPTION-09                                00156000
001570                                 PIC X(01).                       00157000
001580             07  MIC-7110COUNT-09                                 00158000
001590                                 PIC 9(05).                       00159000
001600             07  MIC-7110AMOUNT-09                                00160000
001610                                 PIC 9(09)V99.                    00161000
001620             07  MIC-7110ACCUMDESC-09                             00162000
001630                                 PIC X(15).                       00163000
001640             07  FILLER          PIC X(27).                       00164000
001650             07  MIC-7110SEQ10   PIC X(08).                       00165000
001660         05  MIC-7110CARD11                                       00166000
001670                         REDEFINES MIC-7110CARD00.                00167000
001680             07  MIC-7110COND-10 PIC X(01).                       00168000
001690             07  MIC-7110ACCUM-10                                 00169000
001700                                 PIC 9(02).                       00170000
001710             07  MIC-7110REL-10  PIC X(02).                       00171000
001720             07  MIC-7110OPTION-10                                00172000
001730                                 PIC X(01).                       00173000
001740             07  MIC-7110COUNT-10                                 00174000
001750                                 PIC 9(05).                       00175000
001760             07  MIC-7110AMOUNT-10                                00176000
001770                                 PIC 9(09)V99.                    00177000
001780             07  MIC-7110ACCUMDESC-10                             00178000
001790                                 PIC X(15).                       00179000
001800             07  FILLER          PIC X(27).                       00180000
001810             07  MIC-7110SEQ11   PIC X(08).                       00181000
001820         05  MIC-7110CARD12                                       00182000
001830                         REDEFINES MIC-7110CARD00.                00183000
001840             07  MIC-7110COND-11 PIC X(01).                       00184000
001850             07  MIC-7110ACCUM-11                                 00185000
001860                                 PIC 9(02).                       00186000
001870             07  MIC-7110REL-11  PIC X(02).                       00187000
001880             07  MIC-7110OPTION-11                                00188000
001890                                 PIC X(01).                       00189000
001900             07  MIC-7110COUNT-11                                 00190000
001910                                 PIC 9(05).                       00191000
001920             07  MIC-7110AMOUNT-11                                00192000
001930                                 PIC 9(09)V99.                    00193000
001940             07  MIC-7110ACCUMDESC-11                             00194000
001950                                 PIC X(15).                       00195000
001960             07  FILLER          PIC X(27).                       00196000
001970             07  MIC-7110SEQ12   PIC X(08).                       00197000
001980         05  MIC-7110CARD13                                       00198000
001990                         REDEFINES MIC-7110CARD00.                00199000
002000             07  MIC-7110COND-12 PIC X(01).                       00200000
002010             07  MIC-7110ACCUM-12                                 00201000
002020                                 PIC 9(02).                       00202000
002030             07  MIC-7110REL-12  PIC X(02).                       00203000
002040             07  MIC-7110OPTION-12                                00204000
002050                                 PIC X(01).                       00205000
002060             07  MIC-7110COUNT-12                                 00206000
002070                                 PIC 9(05).                       00207000
002080             07  MIC-7110AMOUNT-12                                00208000
002090                                 PIC 9(09)V99.                    00209000
002100             07  MIC-7110ACCUMDESC-12                             00210000
002110                                 PIC X(15).                       00211000
002120             07  FILLER          PIC X(27).                       00212000
002130             07  MIC-7110SEQ13   PIC X(08).                       00213000
002140*----------------------------------------------------------------*00214000
002150*            END OF MICM 7110 CARD DESCRIPTION                   *00215000
002160*----------------------------------------------------------------*00216000
