000010******************************************************************00001000
000020* MIS7104  RELATIONSHIP PRICING RELATIONSHIP CODES         (M04) *00002000
000030******************************************************************00003000
000040*01  MI7104-RECORD.                                              *00004000
000050     03  MIM-7104GRP-KEY.                                         00005000
000060         05  MIM-7104KINST       PIC 9(04).                       00006000
000070         05  MIM-7104KREC        PIC 9(04).                       00007000
000080         05  MIM-7104KRPREC      PIC X(06).                       00008000
000090*---------------------------------------------------------------* 00009000
000100     03  MIM-7104AUDIT-STAMP.                                     00010000
000110         05  MIM-7104UPD-DATE    PIC S9(09)      COMP-3.          00011000
000120         05  MIM-7104UPD-TIME    PIC S9(09)      COMP-3.          00012000
000130         05  MIM-7104UPD-USER    PIC X(08).                       00013000
000140         05  MIM-7104UPD-ORG     PIC X(06).                       00014000
000150*---------------------------------------------------------------* 00015000
000160     03  MIM-REC7104.                                             00016000
000170         05  MIM-7104OPT         PIC X(01).                       00017000
000180         05  MIM-REC7104-DATA.                                    00018000
000190             07  MIM-7104RLSP-1  PIC 9(02).                       00019000
000200             07  MIM-7104RLSP-2  PIC 9(02).                       00020000
000210             07  MIM-7104RLSP-3  PIC 9(02).                       00021000
000220             07  MIM-7104RLSP-4  PIC 9(02).                       00022000
000230             07  MIM-7104RLSP-5  PIC 9(02).                       00023000
000240             07  MIM-7104RLSP-6  PIC 9(02).                       00024000
000250             07  MIM-7104RLSP-7  PIC 9(02).                       00025000
000260             07  MIM-7104RLSP-8  PIC 9(02).                       00026000
000270             07  MIM-7104RLSP-9  PIC 9(02).                       00027000
000280             07  MIM-7104RLSP-10 PIC 9(02).                       00028000
000290             07  MIM-7104RLSP-11 PIC 9(02).                       00029000
000300             07  MIM-7104RLSP-12 PIC 9(02).                       00030000
000310             07  MIM-7104RLSP-13 PIC 9(02).                       00031000
000320             07  MIM-7104RLSP-14 PIC 9(02).                       00032000
000330             07  MIM-7104RLSP-15 PIC 9(02).                       00033000
000340             07  MIM-7104RLSP-16 PIC 9(02).                       00034000
000350             07  MIM-7104RLSP-17 PIC 9(02).                       00035000
000360             07  MIM-7104RLSP-18 PIC 9(02).                       00036000
000370             07  MIM-7104RLSP-19 PIC 9(02).                       00037000
000380             07  MIM-7104RLSP-20 PIC 9(02).                       00038000
000390             07  MIM-7104RLSP-21 PIC 9(02).                       00039000
000400             07  MIM-7104RLSP-22 PIC 9(02).                       00040000
000410             07  MIM-7104RLSP-23 PIC 9(02).                       00041000
000420             07  MIM-7104RLSP-24 PIC 9(02).                       00042000
000430             07  MIM-7104RLSP-25 PIC 9(02).                       00043000
000440             07  MIM-7104RLSP-26 PIC 9(02).                       00044000
000450             07  MIM-7104RLSP-27 PIC 9(02).                       00045000
000460             07  MIM-7104RLSP-28 PIC 9(02).                       00046000
000470             07  MIM-7104RLSP-29 PIC 9(02).                       00047000
000480             07  MIM-7104RLSP-30 PIC 9(02).                       00048000
000490             07  MIM-7104RLSP-31 PIC 9(02).                       00049000
000500             07  MIM-7104RLSP-32 PIC 9(02).                       00050000
000510             07  MIM-7104RLSP-33 PIC 9(02).                       00051000
000520             07  MIM-7104RLSP-34 PIC 9(02).                       00052000
000530             07  MIM-7104RLSP-35 PIC 9(02).                       00053000
000540             07  MIM-7104RLSP-36 PIC 9(02).                       00054000
000550             07  MIM-7104RLSP-37 PIC 9(02).                       00055000
000560             07  MIM-7104RLSP-38 PIC 9(02).                       00056000
000570             07  MIM-7104RLSP-39 PIC 9(02).                       00057000
000580             07  MIM-7104RLSP-40 PIC 9(02).                       00058000
000590             07  MIM-7104RLSP-41 PIC 9(02).                       00059000
000600             07  MIM-7104RLSP-42 PIC 9(02).                       00060000
000610             07  MIM-7104RLSP-43 PIC 9(02).                       00061000
000620             07  MIM-7104RLSP-44 PIC 9(02).                       00062000
000630             07  MIM-7104RLSP-45 PIC 9(02).                       00063000
000640             07  MIM-7104RLSP-46 PIC 9(02).                       00064000
000650             07  MIM-7104RLSP-47 PIC 9(02).                       00065000
000660             07  MIM-7104RLSP-48 PIC 9(02).                       00066000
000670             07  MIM-7104RLSP-49 PIC 9(02).                       00067000
000680             07  MIM-7104RLSP-50 PIC 9(02).                       00068000
000690         05  MIM-REC7104-RLSP                                     00069000
000700                         REDEFINES MIM-REC7104-DATA.              00070000
000710             07  MIM-7104RLSP    PIC 9(02)       OCCURS 50.       00071000
000720*----------------------------------------------------------------*00072000
000730*            END OF MICM 7104 RECORD DESCRIPTION                 *00073000
000740*----------------------------------------------------------------*00074000
