000010******************************************************************00001000
000020* MIS7112F - CARD LAYOUT (FORM 7112)                             *00002000
000030******************************************************************00003000
000040     03  MI7112C-RECORD.                                          00004000
000050         05  MIC-7112SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7112FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7112CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7112CARD00.                                      00008000
000090             07  MIC-7112INST    PIC 9(04).                       00009000
000100             07  MIC-7112SECSERV PIC X(06).                       00010000
000110             07  FILLER          PIC X(54).                       00011000
000120             07  MIC-7112SEQ00   PIC X(08).                       00012000
000130         05 MIC-7112CARD01                                        00013000
000140                         REDEFINES MIC-7112CARD00.                00014000
000150             07  MIC-7112OPT     PIC X(01).                       00015000
000160             07  MIC-7112AMT-1   PIC 9(09)V99.                    00016000
000170             07  MIC-7112SECSERV-1                                00017000
000180                                 PIC X(06).                       00018000
000190             07  MIC-7112AMT-2   PIC 9(09)V99.                    00019000
000200             07  MIC-7112SECSERV-2                                00020000
000210                                 PIC X(06).                       00021000
000220             07  MIC-7112AMT-3   PIC 9(09)V99.                    00022000
000230             07  MIC-7112SECSERV-3                                00023000
000240                                 PIC X(06).                       00024000
000250             07  FILLER          PIC X(12).                       00025000
000260             07  MIC-7112SEQ01   PIC X(08).                       00026000
000270         05 MIC-7112CARD02                                        00027000
000280                         REDEFINES MIC-7112CARD00.                00028000
000290             07  MIC-7112AMT-4   PIC 9(09)V99.                    00029000
000300             07  MIC-7112SECSERV-4                                00030000
000310                                 PIC X(06).                       00031000
000320             07  MIC-7112AMT-5   PIC 9(09)V99.                    00032000
000330             07  MIC-7112SECSERV-5                                00033000
000340                                 PIC X(06).                       00034000
000350             07  MIC-7112AMT-6   PIC 9(09)V99.                    00035000
000360             07  MIC-7112SECSERV-6                                00036000
000370                                 PIC X(06).                       00037000
000380             07  FILLER          PIC X(13).                       00038000
000390             07  MIC-7112SEQ02   PIC X(08).                       00039000
000400         05 MIC-7112CARD03                                        00040000
000410                         REDEFINES MIC-7112CARD00.                00041000
000420             07  MIC-7112AMT-7   PIC 9(09)V99.                    00042000
000430             07  MIC-7112SECSERV-7                                00043000
000440                                 PIC X(06).                       00044000
000450             07  MIC-7112AMT-8   PIC 9(09)V99.                    00045000
000460             07  MIC-7112SECSERV-8                                00046000
000470                                 PIC X(06).                       00047000
000480             07  MIC-7112AMT-9   PIC 9(09)V99.                    00048000
000490             07  MIC-7112SECSERV-9                                00049000
000500                                 PIC X(06).                       00050000
000510             07  FILLER          PIC X(13).                       00051000
000520             07  MIC-7112SEQ03   PIC X(08).                       00052000
000530         05 MIC-7112CARD04                                        00053000
000540                         REDEFINES MIC-7112CARD00.                00054000
000550             07  MIC-7112AMT-10  PIC 9(09)V99.                    00055000
000560             07  MIC-7112SECSERV-10                               00056000
000570                                 PIC X(06).                       00057000
000580             07  FILLER          PIC X(47).                       00058000
000590             07  MIC-7112SEQ04   PIC X(08).                       00059000
000600*----------------------------------------------------------------*00060000
000610*            END OF MICM 7112 CARD DESCRIPTION                   *00061000
000620*----------------------------------------------------------------*00062000
