000010******************************************************************00001000
000020* MIS7111F - CARD LAYOUT (FORM 7111)                             *00002000
000030******************************************************************00003000
000040     03  MI7111C-RECORD.                                          00004000
000050         05  MIC-7111SYSNBR      PIC 9(02).                       00005000
000060         05  MIC-7111FORMNBR     PIC 9(04).                       00006000
000070         05  MIC-7111CARDNBR     PIC 9(02).                       00007000
000080         05  MIC-7111CARD00.                                      00008000
000090             07  MIC-7111INST    PIC 9(04).                       00009000
000100             07  MIC-7111TRANPROFILE                              00010000
000110                                 PIC X(06).                       00011000
000120             07  MIC-7111TRANPLAN                                 00012000
000130                                 PIC 9(03).                       00013000
000140             07  MIC-7111EXTTRAN PIC X(04).                       00014000
000150             07  MIC-7111INTTRAN PIC X(04).                       00015000
000160             07  MIC-7111DESC    PIC X(30).                       00016000
000170             07  FILLER          PIC X(13).                       00017000
000180             07  MIC-7111SEQ00   PIC X(08).                       00018000
000190         05  MIC-7111CARD01                                       00019000
000200                         REDEFINES MIC-7111CARD00.                00020000
000210             07  MIC-7111OPTION-01                                00021000
000220                                 PIC X(01).                       00022000
000230             07  MIC-7111MINAMT-01                                00023000
000240                                 PIC 9(09).                       00024000
000250             07  MIC-7111OPTION-02                                00025000
000260                                 PIC X(01).                       00026000
000270             07  MIC-7111MINAMT-02                                00027000
000280                                 PIC 9(09).                       00028000
000290             07  FILLER          PIC X(45).                       00029000
000300             07  MIC-7111SEQ01   PIC X(08).                       00030000
000310         05  MIC-7111CARD02                                       00031000
000320                         REDEFINES MIC-7111CARD00.                00032000
000330             07  MIC-7111OPTION-03                                00033000
000340                                 PIC X(01).                       00034000
000350             07  MIC-7111MINAMT-03                                00035000
000360                                 PIC 9(09).                       00036000
000370             07  MIC-7111OPTION-04                                00037000
000380                                 PIC X(01).                       00038000
000390             07  MIC-7111MINAMT-04                                00039000
000400                                 PIC 9(09).                       00040000
000410             07  FILLER          PIC X(45).                       00041000
000420             07  MIC-7111SEQ02   PIC X(08).                       00042000
000430         05  MIC-7111CARD03                                       00043000
000440                         REDEFINES MIC-7111CARD00.                00044000
000450             07  MIC-7111OPTION-05                                00045000
000460                                 PIC X(01).                       00046000
000470             07  MIC-7111MINAMT-05                                00047000
000480                                 PIC 9(09).                       00048000
000490             07  MIC-7111OPTION-06                                00049000
000500                                 PIC X(01).                       00050000
000510             07  MIC-7111MINAMT-06                                00051000
000520                                 PIC 9(09).                       00052000
000530             07  FILLER          PIC X(45).                       00053000
000540             07  MIC-7111SEQ03   PIC X(08).                       00054000
000550         05  MIC-7111CARD04                                       00055000
000560                         REDEFINES MIC-7111CARD00.                00056000
000570             07  MIC-7111OPTION-07                                00057000
000580                                 PIC X(01).                       00058000
000590             07  MIC-7111MINAMT-07                                00059000
000600                                 PIC 9(09).                       00060000
000610             07  MIC-7111OPTION-08                                00061000
000620                                 PIC X(01).                       00062000
000630             07  MIC-7111MINAMT-08                                00063000
000640                                 PIC 9(09).                       00064000
000650             07  FILLER          PIC X(45).                       00065000
000660             07  MIC-7111SEQ04   PIC X(08).                       00066000
000670         05  MIC-7111CARD05                                       00067000
000680                         REDEFINES MIC-7111CARD00.                00068000
000690             07  MIC-7111OPTION-09                                00069000
000700                                 PIC X(01).                       00070000
000710             07  MIC-7111MINAMT-09                                00071000
000720                                 PIC 9(09).                       00072000
000730             07  MIC-7111OPTION-10                                00073000
000740                                 PIC X(01).                       00074000
000750             07  MIC-7111MINAMT-10                                00075000
000760                                 PIC 9(09).                       00076000
000770             07  FILLER          PIC X(45).                       00077000
000780             07  MIC-7111SEQ05   PIC X(08).                       00078000
000790         05  MIC-7111CARD06                                       00079000
000800                         REDEFINES MIC-7111CARD00.                00080000
000810             07  MIC-7111OPTION-11                                00081000
000820                                 PIC X(01).                       00082000
000830             07  MIC-7111MINAMT-11                                00083000
000840                                 PIC 9(09).                       00084000
000850             07  MIC-7111OPTION-12                                00085000
000860                                 PIC X(01).                       00086000
000870             07  MIC-7111MINAMT-12                                00087000
000880                                 PIC 9(09).                       00088000
000890             07  FILLER          PIC X(45).                       00089000
000900             07  MIC-7111SEQ06   PIC X(08).                       00090000
000910*----------------------------------------------------------------*00091000
000920*            END OF MICM 7111 CARD DESCRIPTION                   *00092000
000930*----------------------------------------------------------------*00093000
