000010*EDIT-ACCOUNT SECTION.                                            00001000
000020*----------------------------------------------------------------*00002000
000030*    THIS SECTION WILL SEARCH THE 2023 RECORDS TO FIND THE       *00003000
000040*    ACCOUNT LENGTH AND ACCOUNT EDIT PARAMETERS.  THE ACCOUNT-   *00004000
000050*    EDIT (SRP033) WILL BE PERFORMED TO EDIT THE ACCOUNT.        *00005000
000060*    USE AS FOLLOWS -                                            *00006000
000070*      1.    COPY RPW015 AND RPW2023 TO WORKING STORAGE.         *00007000
000080*      2.    COPY RPP2023 AND RPP2023S TO PROCEDURE DIVISION.    *00008000
000090*      3.    THE 2023 RECORDS WILL NEED TO BE LOADED.            *00009000
000100*      4.    MOVE THE PRODUCT CODE TO RPW015-PRODCODE.           *00010000
000110*      5.    MOVE THE ACCOUNT TO RPW015-ACCOUNT.                 *00011000
000120*      6.    PERFORM EDIT-ACCOUNT.                               *00012000
000130*      7.    THE EDITED ACCOUNT NUMBER WILL BE IN                *00013000
000140*            RPW015-EDITEDACCOUNT.                               *00014000
000150******************************************************************00015000
000160 EA-START.                                                        00016000
000170     MOVE SPACES TO RPW015-EDITEDACCOUNT.                         00017000
000180     MOVE RPW015-PRODCODE TO WS-RPMIM2023PRODCD.                  00018000
000190     PERFORM SEARCH-RPS-2023.                                     00019000
000200     IF WS-RPMIM2023VALID IS EQUAL TO 'Y'                         00020000
000210         MOVE WS-2023-ACCTLN (INDX-2023) TO SR-AEACCTLN           00021000
000220         MOVE WS-2023-ACCTED (INDX-2023) TO SR-AEEDIT             00022000
000230     ELSE                                                         00023000
000240         MOVE 18 TO SR-AEACCTLN                                   00024000
000250         MOVE ZEROS TO SR-AEEDIT.                                 00025000
000260     MOVE RPW015-ACCOUNT TO SR-AEACCOUNT.                         00026000
000270     PERFORM ACCOUNT-EDIT.                                        00027000
000280     MOVE SR-AEACCTEDT TO RPW015-EDITEDACCOUNT.                   00028000
000290 EA-EXIT.                                                         00029000
000300     EXIT.                                                        00030000
