000010*EDIT-ACCOUNT-KEY SECTION.                                        00001000
000020 EAK-START.                                                       00002000
000030     IF EDIT-PANEL                                                00003000
000040         GO TO EAK-CHECK-KEY.                                     00004000
000050 EAK-PARSE-PARMS.                                                 00005000
000060     PERFORM PARAMETER-SEARCH.                                    00006000
000070     MOVE SR-PSPARM TO COM-EXTID.                                 00007000
000080     MOVE SR-PSPARM TO COM-EXTERNALID.                            00008000
000090     PERFORM PARAMETER-SEARCH.                                    00009000
000100     MOVE SR-PSPARM TO RPW014-PRODCODE.                           00010000
000110     PERFORM PARAMETER-SEARCH.                                    00011000
000120     MOVE SR-PSPARM TO RPW014-ACCT.                               00012000
000130 EAK-CHECK-KEY.                                                   00013000
000140     IF RPW014-PRODCODE IS EQUAL TO SPACE                         00014000
000150         MOVE LOW-VALUE TO RPW014-PRODCODE.                       00015000
000160     IF RPW014-ACCT IS EQUAL TO SPACE                             00016000
000170         MOVE LOW-VALUE TO RPW014-ACCT.                           00017000
000180     IF RPW014-PRODCODE IS EQUAL TO LOW-VALUE                     00018000
000190         MOVE '500001' TO WS-MSGNBR                               00019000
000200         GO TO EAK-EXIT.                                          00020000
000210     MOVE COM-INST TO RPW130-INST.                                00021000
000220     MOVE COM-INST-OPT-1 TO RPW130-BANK-LVL-2023.                 00022000
000230     MOVE RPW014-PRODCODE TO RPW130-PRODCODE.                     00023000
000240     MOVE RPW014-ACCT TO RPW130-ACCOUNTINPUT.                     00024000
000250     MOVE 'V' TO RPW130-FUNCTION.                                 00025000
000260     PERFORM ACCOUNT-KEY-EDIT.                                    00026000
000270     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00027000
000280         MOVE '500003' TO WS-MSGNBR                               00028000
000290         GO TO EAK-EXIT.                                          00029000
000300     MOVE RPW130-ACCOUNTKEY TO RPW014-ACCT.                       00030000
000310     MOVE RPW130-FORMATTEDACCT TO RPW014-FORMATTEDACCT.           00031000
000320     MOVE RPW130-2023INTAPPL211 TO RPW014-APPLNBR.                00032000
000330     MOVE RPW130-2023DIALOGROUT TO RPW014-DIALOGROUT.             00033000
000340 EAK-EXIT.                                                        00034000
000350     EXIT.                                                        00035000
