000010******************************************************************00001000
000020* RPP135   GET SECONDARY ACCOUNTS - BATCH                        *00002000
000030******************************************************************00003000
000040*GET-MY-SECONDARY-ACCOUNTS SECTION.                               00004000
000050*   THE PURPOSE OF THIS SECTION IS TO FIND THE ACCOUNTS           00005000
000060*   BELONGING TO SECONDARY CUSTOMERS OF THE PRIMARY ACCOUNT       00006000
000070*   AND ADD THESE ADDITIONAL ACCOUNTS TO THE TABLE                00007000
000080*   OF ACCOUNTS FROM THE PRIMARY CUSTOMER                         00008000
000090 GM-START.                                                        00009000
P0106      MOVE SPACES TO WS-FUNCTION.                                  00009200
P0106      MOVE SPACES TO WS-LAST-PRODCD.                               00009400
P0106      MOVE SPACES TO WS-RPMIM2023PRODCD.                           00009600
P0106      MOVE ZEROS TO WS-NUMOFSECCUSTS.                              00009800
000100     MOVE 'Y' TO WS-RELCHECK.                                     00010000
000110     MOVE 'N' TO WS-SECCUSTOVERFLOW.                              00011000
P0106      MOVE ZEROS TO WS-NUMOFSECCUSTS.                              00012000
P0106 * ** SECONDARY CUSTOMER TABLE, BOTH OR ENROLL ONLY                00012090
P0106      IF MIM-7101PRIMRELCD-Q IS NOT EQUAL TO 'B'                   00012180
P0106          AND MIM-7101PRIMRELCD-Q IS NOT EQUAL TO 'E'              00012270
P0106          MOVE 'N' TO WS-RELCHECK                                  00012360
P0106          GO TO GM-START2.                                         00012450
P0106      MOVE MIM-7101PRIMRELCD TO WS-RPMIM7104RPREC.                 00012540
000130     IF WS-RPMIM7104RPREC IS EQUAL TO SPACES                      00013000
000140        MOVE 'N' TO WS-RELCHECK                                   00014000
000150        GO TO GM-START2.                                          00015000
000200     PERFORM SEARCH-RPS-7104.                                     00020000
000210     IF WS-RPMIM7104FOUND IS EQUAL TO 'N'                         00021000
000220         MOVE 'N' TO WS-RELCHECK                                  00022000
000230         GO TO GM-START2.                                         00023000
000240     MOVE 'N' TO WS-INCLUDEREL.                                   00024000
000250     IF MIM-7104OPT IS EQUAL TO 'I'                               00025000
000260         MOVE 'Y' TO WS-INCLUDEREL.                               00026000
000270     INITIALIZE WS-RELCODETABLE.                                  00027000
000280     MOVE MIM-REC7104-DATA TO WS-RELCODETABLE.                    00028000
000290 GM-START2.                                                       00029000
000300     IF WS-RELCHECK IS EQUAL TO 'N'                               00030000
000310         GO TO GM-END.                                            00031000
000320     MOVE WS-NUMOFACCOUNTS TO WS-PRIMCUSTACCTS.                   00032000
000330     MOVE ZERO TO WS-SECTABLE.                                    00033000
000340     MOVE SPACES TO WS-FUNCTION.                                  00034000
000350     MOVE RPMST-INST TO RPRF21-BASE-ACCT-INST.                    00035000
000360     MOVE WS-PRIM-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.          00036000
000370     MOVE WS-PRIM-ACCOUNT TO RPRF21-BASE-ACCT.                    00037000
000380     MOVE SPACES TO RPRF21-BASE-CUSTOMER.                         00038000
000390     INITIALIZE WS-NEXTACC.                                       00039000
000400     MOVE SPACE TO RPRF21-RETURN.                                 00040000
000410 GM-SEC-AGAIN.                                                    00041000
000420     MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.          00042000
000430     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00043000
000440         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00044000
000450         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00045000
000460     MOVE 'X' TO RPRF21-FUNC.                                     00046000
000470     CALL SR-060CALLNAME USING                                    00047000
000480         WS-LINKRCIF.                                             00048000
000490     MOVE 'N' TO WS-MORE-SECONDARYCUST.                           00049000
000500     IF RPRF21-RETURN IS EQUAL TO 'M'                             00050000
000510         MOVE 'Y' TO WS-MORE-SECONDARYCUST                        00051000
000520         MOVE SPACE TO RPRF21-RETURN.                             00052000
000530     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     00053000
000540         GO TO GM-END.                                            00054000
000550*  HERE I HAVE THE FIRST GROUP OF SECONDARY CUSTOMERS             00055000
000560     MOVE RPRF21-RETURNED-OBJECT TO WS-ACC-TABLE.                 00056000
000570     MOVE +1 TO WS-SECCUSTSUB.                                    00057000
000580 GM-LOAD-SECONDARY.                                               00058000
000590     IF WS-SECCUSTSUB IS GREATER THAN WS-ACC-MAX                  00059000
000600         AND WS-MORE-SECONDARYCUST IS EQUAL TO 'Y'                00060000
000610         MOVE WS-ACC-CUST (WS-ACC-MAX) TO RPRF21-BASE-CUST        00061000
000620         MOVE WS-ACC-CUST-TYPE (WS-ACC-MAX)                       00062000
000630             TO RPRF21-BASE-CUST-TYPE                             00063000
000640         MOVE RPMST-INST TO RPRF21-BASE-ACCT-INST                 00064000
000650         MOVE WS-PRIM-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE       00065000
000660         MOVE WS-PRIM-ACCOUNT TO RPRF21-BASE-ACCT                 00066000
000670         MOVE WS-ACC-INST (WS-ACC-MAX) TO WS-NEXTCINST            00067000
000680         MOVE WS-ACC-CUST-TYPE (WS-ACC-MAX) TO WS-NEXTCTYPE       00068000
000690         MOVE WS-ACC-CUST (WS-ACC-MAX) TO WS-NEXTCCUST            00069000
000700         MOVE WS-ACC-PRIM (WS-ACC-MAX) TO WS-NEXTPRIM             00070000
000710         MOVE WS-ACC-RELNBR (WS-ACC-MAX) TO WS-NEXTRELN           00071000
000720         MOVE 'M' TO RPRF21-RETURN                                00072000
000730         MOVE  WS-NEXTACC TO RPRF21-RETURNED-OBJECT               00073000
000740         GO TO GM-SEC-AGAIN.                                      00074000
000750     IF WS-SECCUSTSUB IS GREATER THAN WS-ACC-MAX                  00075000
000760         AND WS-MORE-SECONDARYCUST IS EQUAL TO 'N'                00076000
000770         GO TO GM-MORE-ACCTS.                                     00077000
000780* ** DONE LOADING CUSTOMERS NOW GET ACCOUNTS                      00078000
000790     IF WS-ACC-CUST (WS-SECCUSTSUB) IS EQUAL TO SPACES            00079000
000800         AND WS-ACC-INST (WS-SECCUSTSUB) IS EQUAL TO ZEROS        00080000
000810         GO TO GM-MORE-ACCTS.                                     00081000
000820* ** EXCLUDE PRIMARY CUSTOMER                                     00082000
000830     IF WS-ACC-PRIM (WS-SECCUSTSUB) IS EQUAL TO ZERO              00083000
000840         ADD +1 TO WS-SECCUSTSUB                                  00084000
000850         GO TO GM-LOAD-SECONDARY.                                 00085000
000860* ** DONE LOADING CUSTOMERS NOW GET ACCOUNTS                      00086000
P0106 * ** CHECK FOR ADJUSTMENT BY RELATE CODE                          00087000
000880     IF WS-RELCHECK IS NOT EQUAL TO 'Y'                           00088000
000890         GO TO GM-LOAD-SEC-CUST.                                  00089000
000900     MOVE WS-ACC-RELNBR (WS-SECCUSTSUB) TO WS-VALIDREL.           00090000
000910     PERFORM GM-CHECKFORRELNBR.                                   00091000
000920     IF WS-BADRELNBR IS EQUAL TO 'Y'                              00092000
000930         ADD +1 TO WS-SECCUSTSUB                                  00093000
000940         GO TO GM-LOAD-SECONDARY.                                 00094000
000950 GM-LOAD-SEC-CUST.                                                00095000
000960     ADD +1 TO WS-SECTABLE.                                       00096000
000970     IF WS-SECTABLE IS GREATER THAN WS-SECCUSTMAX                 00097000
000980         MOVE 'Y' TO WS-SECCUSTOVERFLOW                           00098000
000990         GO TO GM-MORE-ACCTS.                                     00099000
001000     MOVE WS-ACC-INST (WS-SECCUSTSUB)                             00100000
001010         TO WS-SECUST-INST (WS-SECTABLE).                         00101000
001020     MOVE WS-ACC-CUST-TYPE (WS-SECCUSTSUB)                        00102000
001030         TO WS-SECUST-CUST-TYPE (WS-SECTABLE).                    00103000
001040     MOVE WS-ACC-CUST (WS-SECCUSTSUB)                             00104000
001050         TO WS-SECUST-CUST (WS-SECTABLE).                         00105000
001060     MOVE WS-ACC-PRIM (WS-SECCUSTSUB)                             00106000
001070         TO WS-SECUST-PRIM (WS-SECTABLE).                         00107000
P0106      MOVE WS-ACC-RELNBR (WS-SECCUSTSUB)                           00107300
P0106          TO WS-SECUST-RELNBR (WS-SECTABLE).                       00107600
001080     ADD 1 TO WS-SECCUSTSUB.                                      00108000
001090     ADD 1 TO WS-NUMOFSECCUSTS.                                   00109000
001100     GO TO GM-LOAD-SECONDARY.                                     00110000
001110 GM-MORE-ACCTS.                                                   00111000
001120     MOVE ZERO TO WS-SECCUSTSUB.                                  00112000
001130 GM-FIND-SEC-ACCTS.                                               00113000
001140     ADD 1 TO WS-SECCUSTSUB.                                      00114000
001150     IF WS-SECCUSTSUB IS GREATER THAN WS-SECTABLE                 00115000
001160         GO TO GM-END.                                            00116000
001170     IF WS-SECCUSTSUB IS GREATER THAN WS-SECCUSTMAX               00117000
001180         GO TO GM-END.                                            00118000
001190* ** MAXIMUM 1000 ACCOUNTS FOR ALL CUSTOMERS                      00119000
001200     MOVE RPMST-INST TO RPRF21-BASE-ACCT-INST.                    00120000
P0106      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00120200
P0106          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00120400
P0106          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00120600
001210     MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE.                    00121000
001220     MOVE ZEROS TO RPRF21-BASE-ACCT.                              00122000
001230     MOVE WS-SECUST-INST (WS-SECCUSTSUB)                          00123000
001240         TO RPRF21-BASE-CUST-INST.                                00124000
001250     MOVE WS-SECUST-CUST-TYPE (WS-SECCUSTSUB)                     00125000
001260         TO RPRF21-BASE-CUST-TYPE.                                00126000
001270     MOVE WS-SECUST-CUST (WS-SECCUSTSUB) TO RPRF21-BASE-CUST.     00127000
P0106  GM-MORE-SECONDARY-ACCTS.                                         00128000
001290     MOVE 'N' TO RPRF21-FUNC.                                     00129000
001300     CALL SR-060CALLNAME USING                                    00130000
001310         WS-LINKRCIF.                                             00131000
001320     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     00132000
001330         MOVE RPRF21-FUNCTION TO WS-FUNCTION                      00133000
001340         GO TO GM-FIND-SEC-ACCTS.                                 00134000
001350* ** A BAD RETURN CODE FROM GET ACCOUNTS GO TO NEXT CUSTOMER      00135000
001360     MOVE RPRF21-RETURNED-OBJECT TO WS-CAC-TABLE.                 00136000
001370     MOVE ZEROS TO WS-SUB3.                                       00137000
001380 GM-CHECK-PRODCODE.                                               00138000
001390     ADD +1 TO WS-SUB3.                                           00139000
001400     IF WS-SUB3 IS GREATER THAN WS-CAC-MAX                        00140000
001410         GO TO GM-CHECK-MORE-SEC.                                 00141000
001420     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO SPACES                00142000
001430         GO TO GM-CHECK-MORE-SEC.                                 00143000
001440     IF WS-CAC-ACCT (WS-SUB3) IS EQUAL TO SPACES                  00144000
001450         GO TO GM-CHECK-MORE-SEC.                                 00145000
001460     MOVE WS-CAC-INST (WS-SUB3) TO WS-SUBINST.                    00146000
001470     IF WS-2024-EXISTS (WS-SUBINST) IS NOT EQUAL TO 'Y'           00147000
001480         GO TO GM-CHECK-PRODCODE.                                 00148000
001490     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-LAST-PRODCD        00149000
001500         GO TO GM-VALID-SECACCT.                                  00150000
001510     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-RPMIM2023PRODCD    00151000
001520         GO TO GM-CHECK-PRODCODE.                                 00152000
001530     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-RPMIM2023PRODCD.          00153000
001540     PERFORM SEARCH-RPS-2023.                                     00154000
001550     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         00155000
001560         GO TO GM-CHECK-PRODCODE.                                 00156000
001570     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-LAST-PRODCD.              00157000
001580     MOVE WS-LAST-PRODCD TO WS-PRODCODE-SEARCH.                   00158000
001590     PERFORM SEARCH-PRODUCT-CODES.                                00159000
001600     IF WS-FOUND-PRODCODE IS EQUAL TO 'N'                         00160000
001610         ADD +1 TO WS-NUMOFPRODUCTS.                              00161000
001620 GM-VALID-SECACCT.                                                00162000
001630     MOVE WS-CAC-INST (WS-SUB3) TO WS-DUPINST.                    00163000
001640     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-DUPPRODCD.                00164000
001650     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-DUPACCOUNT.                 00165000
001660     MOVE 'N' TO WS-DUPSECACCT.                                   00166000
P0106      IF (MIM-7101CUSTRELCD-Q IS EQUAL TO 'B'                      00166200
P0106          OR MIM-7101CUSTRELCD-Q IS EQUAL TO 'E')                  00166400
P0106          AND MIM-7101CUSTRELCD IS NOT EQUAL TO SPACES             00166600
P0106          GO TO GM-VALID-ADD.                                      00166800
001670     PERFORM GM-CHECKFORDUP.                                      00167000
001680     IF WS-DUPSECACCT IS EQUAL TO 'Y'                             00168000
001690         GO TO GM-CHECK-PRODCODE.                                 00169000
001700 GM-VALID-ADD.                                                    00170000
001710     ADD +1 TO WS-NUMOFACCOUNTS.                                  00171000
001720     ADD +1 TO WS-NUMOFSECACCTS.                                  00172000
001730     IF INDX-SEC IS GREATER THAN WS-SECONDARY-MAX                 00173000
001740         GO TO GM-CHECK-MORE-SEC.                                 00174000
001750* SAVE BEFORE LOAD                                                00175000
001760     ADD +1 TO WS-ALLSEC.                                         00176000
001770     IF WS-ALLSEC IS GREATER THAN WS-SECMAX                       00177000
001780         MOVE WS-SECMAX TO WS-ALLSEC                              00178000
001790         GO TO GM-VALID-AD2.                                      00179000
001800     MOVE WS-CAC-INST (WS-SUB3) TO WS-SECINST (WS-ALLSEC).        00180000
001810     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SECPRODCD (WS-ALLSEC).    00181000
001820     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SECACCOUNT (WS-ALLSEC).     00182000
001830 GM-VALID-AD2.                                                    00183000
001840     MOVE RPMST-GRP-KEY TO WS-SEC-ACCT1-GRP (INDX-SEC).           00184000
001850     MOVE WS-CAC-INST (WS-SUB3) TO WS-SEC-INST2 (INDX-SEC).       00185000
001860     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SEC-PRODCODE2 (INDX-SEC). 00186000
001870     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SEC-ACCOUNT2 (INDX-SEC).    00187000
001880     MOVE WS-2023-INTAPPL (INDX-2023) TO WS-SEC-APPL (INDX-SEC).  00188000
001890     MOVE WS-2023-RPOPTION (INDX-2023)                            00189000
001900         TO WS-SEC-RPOPT (INDX-SEC).                              00190000
001910     MOVE ZEROS TO WS-SEC-BRANCH (INDX-SEC).                      00191000
001920     MOVE ZEROS TO WS-SEC-TYPE (INDX-SEC).                        00192000
001930     MOVE WS-CAC-RELNBR (WS-SUB3) TO WS-SEC-RELNBR (INDX-SEC).    00193000
001940     SET INDX-SEC UP BY +1.                                       00194000
001950     GO TO GM-CHECK-PRODCODE.                                     00195000
001960* ** GET ANOTHER SECONDARY CUSTOMER AND FIND ACCOUNTS             00196000
001970 GM-CHECK-MORE-SEC.                                               00197000
001980     IF RPRF21-RETURN IS NOT EQUAL TO 'M'                         00198000
001990         GO TO GM-FIND-SEC-ACCTS.                                 00199000
002000* ** CHECK FOR ANOTHER CUSTOMER                                   00200000
P0106      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00201000
P0106          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00201090
P0106          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST     00201180
P0106      ELSE                                                         00201270
P0106          MOVE WS-CAC-INST (WS-CAC-MAX) TO RPRF21-BASE-ACCT-INST.  00201360
002020     MOVE WS-CAC-PRODCD (WS-CAC-MAX) TO RPRF21-BASE-ACCT-PRODCODE.00202000
002030     MOVE WS-CAC-ACCT (WS-CAC-MAX) TO RPRF21-BASE-ACCT.           00203000
002040     GO TO GM-MORE-SECONDARY-ACCTS.                               00204000
002050* ** CHECK FOR MORE ACCOUNTS FOR THIS SECONDARY CUSTOMER          00205000
002060 GM-END.                                                          00206000
002070 GM-EXIT.                                                         00207000
002080     EXIT.                                                        00208000
002090***********************************************************       00209000
002100 GM-CHECKFORDUP SECTION.                                          00210000
002110* DETERMINE IF THE NEW SECONDARY ACCOUNT IS ALREADY               00211000
002120* PART OF THE LIST OF SECONDARY ACCOUNTS                          00212000
002130 GM-DUPSTART.                                                     00213000
002140     MOVE +1 TO WS-DUPTEST.                                       00214000
002150     MOVE 'N' TO WS-DUPSECACCT.                                   00215000
002160 GMCFD-START.                                                     00216000
002170     IF WS-DUPTEST IS GREATER THAN WS-SECMAX                      00217000
002180         GO TO GMCFD-EXIT.                                        00218000
002190     IF WS-SEC-ACCOUNT2 (WS-DUPTEST) IS EQUAL TO SPACE            00219000
002200         GO TO GMCFD-EXIT.                                        00220000
002210     IF WS-DUPINST IS EQUAL TO WS-SEC-INST2 (WS-DUPTEST)          00221000
002220         AND WS-DUPPRODCD                                         00222000
002230             IS EQUAL TO WS-SEC-PRODCODE2 (WS-DUPTEST)            00223000
002240         AND WS-DUPACCOUNT                                        00224000
002250             IS EQUAL TO WS-SEC-ACCOUNT2 (WS-DUPTEST)             00225000
002260         MOVE 'Y' TO WS-DUPSECACCT                                00226000
002270         GO TO GMCFD-EXIT.                                        00227000
002280     ADD +1 TO WS-DUPTEST.                                        00228000
002290     GO TO GMCFD-START.                                           00229000
002300 GMCFD-EXIT.                                                      00230000
002310     EXIT.                                                        00231000
002320***********************************************************       00232000
002330 GM-CHECKFORRELNBR SECTION.                                       00233000
002340* DETERMINE IF THE CUSTOMER SHOULD BE INCLUDED BASED ON           00234000
002350* THE RELATIONSHIP CODE WITH THE PRIMARY ACCOUNT                  00235000
002360 GM-CHREL-START.                                                  00236000
002370     MOVE +1 TO WS-RELSUB.                                        00237000
002380 GM-CHECKIT.                                                      00238000
002390     IF WS-RELSUB IS GREATER THAN WS-RELMAX                       00239000
002400         GO TO GM-NOMATCH.                                        00240000
002410     IF WS-SECRELCODE (WS-RELSUB) IS EQUAL TO ZEROS               00241000
002420         GO TO GM-NOMATCH.                                        00242000
002430     IF WS-VALIDREL IS EQUAL TO WS-SECRELCODE (WS-RELSUB)         00243000
002440         GO TO GM-MATCH.                                          00244000
002450     ADD +1 TO WS-RELSUB.                                         00245000
002460     GO TO GM-CHECKIT.                                            00246000
002470 GM-MATCH.                                                        00247000
002480     IF WS-INCLUDEREL IS EQUAL TO 'Y'                             00248000
002490         MOVE 'N' TO WS-BADRELNBR                                 00249000
002500         GO TO GMCFR-EXIT.                                        00250000
002510     MOVE 'Y' TO WS-BADRELNBR.                                    00251000
002520     GO TO GMCFR-EXIT.                                            00252000
002530 GM-NOMATCH.                                                      00253000
002540     IF WS-INCLUDEREL IS EQUAL TO 'Y'                             00254000
002550         MOVE 'Y' TO WS-BADRELNBR                                 00255000
002560         GO TO GMCFR-EXIT.                                        00256000
002570     MOVE 'N' TO WS-BADRELNBR.                                    00257000
002580     GO TO GMCFR-EXIT.                                            00258000
002590 GMCFR-EXIT.                                                      00259000
002600     EXIT.                                                        00260000
002610***********************************************************       00261000
002620 GM-SEAC-SAVE-SECONDARY SECTION.                                  00262000
002630* SAVE THE SECONDARY ACCOUNTS FROM THE PRIMARY CUSTOMER           00263000
002640* TO ALLOW FOR A DUPLICATE CHECK WITH ACCOUNTS FROM               00264000
002650* SECONDARY CUSTOMERS                                             00265000
002660 GM-SEAC-SAVE-START.                                              00266000
002670     ADD +1 TO WS-ALLSEC.                                         00267000
002680     IF WS-ALLSEC IS GREATER THAN WS-SECMAX                       00268000
002690         MOVE WS-SECMAX TO WS-ALLSEC                              00269000
002700         GO TO GM-SEAC-SAVE-EXIT.                                 00270000
002710     MOVE WS-CAC-INST (WS-SUB3) TO WS-SECINST (WS-ALLSEC).        00271000
002720     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SECPRODCD (WS-ALLSEC).    00272000
002730     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SECACCOUNT (WS-ALLSEC).     00273000
002740 GM-SEAC-SAVE-EXIT.                                               00274000
002750     EXIT.                                                        00275000
002760*----------------------------------------------------------------*00276000
002770*     END OF RP135 GET SECONDARY ACCOUNTS                        *00277000
002780*----------------------------------------------------------------*00278000
