000010******************************************************************00001000
000020* RPP138   GET SECONDARY ACCOUNT - BATCH                         *00002000
000030******************************************************************00003000
000040 GET-MY-SECONDARY-ACCOUNTS SECTION.                               00004000
000050*   THE PURPOSE OF THIS SECTION IS TO FIND THE ACCOUNTS           00005000
000060*   BELONGING TO SECONDARY CUSTOMERS OF THE PRIMARY ACCOUNT       00006000
000070*   AND ADD THESE ADDITIONAL ACCOUNTS TO THE TABLE                00007000
000080*   OF ACCOUNTS FROM THE PRIMARY CUSTOMER                         00008000
000090 GM-START.                                                        00009000
000110     MOVE ZERO TO WS-SECTABLE.                                    00011000
P0097      MOVE SPACES TO WS-FUNCTION.                                  00012000
P0097      MOVE SPACES TO WS-LAST-PRODCD.                               00012190
P0097      MOVE SPACES TO WS-RPMIM2023PRODCD.                           00012380
000130     MOVE RPACCT-INST TO RPRF21-BASE-ACCT-INST.                   00013000
000140     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00014000
000150         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00015000
000160         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00016000
000170     MOVE RPACCT-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE.           00017000
000180     MOVE RPACCT-ACCOUNT TO RPRF21-BASE-ACCT.                     00018000
000190     MOVE SPACES TO RPRF21-BASE-CUSTOMER.                         00019000
000200 GM-SEC-AGAIN.                                                    00020000
000210     IF RPACCT-MODEL IS EQUAL TO SPACES                           00021000
000220         MOVE 'N' TO RPRF21-CLOSEDACCTOPT                         00022000
000230     ELSE                                                         00023000
000240         MOVE MIM-7101CLOSEDACCTOPT TO RPRF21-CLOSEDACCTOPT.      00024000
000250     IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00025000
000260         AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00026000
000270         MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST.    00027000
000280     MOVE 'X' TO RPRF21-FUNC.                                     00028000
000290     CALL SR-060CALLNAME USING                                    00029000
000300         WS-LINKRCIF.                                             00030000
000310     MOVE 'N' TO WS-MORE-SECONDARYCUST.                           00031000
000320     IF RPRF21-FUNCTION IS EQUAL TO 'M'                           00032000
000330         MOVE 'Y' TO WS-MORE-SECONDARYCUST                        00033000
000340         MOVE SPACE TO RPRF21-FUNCTION.                           00034000
000350     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     00035000
P0097           GO TO GM-EXIT.                                          00036000
000370*  HERE I HAVE THE FIRST GROUP OF SECONDARY CUSTOMERS             00037000
000380     MOVE RPRF21-RETURNED-OBJECT TO WS-ACC-TABLE.                 00038000
000390     MOVE +1 TO WS-SECCUSTSUB.                                    00039000
000400 GM-LOAD-SECONDARY.                                               00040000
000410     IF WS-SECCUSTSUB IS GREATER THAN WS-ACC-MAX                  00041000
000420         AND WS-MORE-SECONDARYCUST IS EQUAL TO 'Y'                00042000
000430         MOVE WS-ACC-CUST (WS-ACC-MAX) TO RPRF21-BASE-CUST        00043000
000440         MOVE WS-ACC-CUST-TYPE (WS-ACC-MAX) TO                    00044000
000450         RPRF21-BASE-CUST-TYPE                                    00045000
000460         MOVE RPACCT-INST TO RPRF21-BASE-ACCT-INST                00046000
000470         MOVE RPACCT-PRODCODE TO RPRF21-BASE-ACCT-PRODCODE        00047000
000480         MOVE RPACCT-ACCOUNT TO RPRF21-BASE-ACCT                  00048000
000490         GO TO GM-SEC-AGAIN.                                      00049000
000500     IF WS-SECCUSTSUB IS GREATER THAN WS-ACC-MAX                  00050000
000510         AND WS-MORE-SECONDARYCUST IS EQUAL TO 'N'                00051000
000520         GO TO GM-MORE-ACCTS.                                     00052000
000530* ** DONE LOADING CUSTOMERS NOW GET ACCOUNTS                      00053000
000540     IF WS-ACC-CUST (WS-SECCUSTSUB) IS EQUAL TO SPACES            00054000
000550         AND WS-ACC-INST (WS-SECCUSTSUB) IS EQUAL TO ZEROS        00055000
000560         GO TO GM-MORE-ACCTS.                                     00056000
000570* ** EXCLUDE PRIMARY CUSTOMER                                     00057000
000580     IF WS-ACC-PRIM (WS-SECCUSTSUB) IS EQUAL TO ZERO              00058000
000590         ADD +1 TO WS-SECCUSTSUB                                  00059000
000600         GO TO GM-LOAD-SECONDARY.                                 00060000
000610* ** DONE LOADING CUSTOMERS NOW GET ACCOUNTS                      00061000
000620 GM-LOAD-SEC-CUST.                                                00062000
000630     ADD +1 TO WS-SECTABLE.                                       00063000
000640* ** MAXIMUM 198 CUSTOMERS                                        00064000
000650     IF WS-SECTABLE IS GREATER THAN WS-SECCUSTMAX                 00065000
000660         MOVE WS-SECCUSTMAX TO WS-SECTABLE                        00066000
000670         GO TO GM-MORE-ACCTS.                                     00067000
000680     MOVE WS-ACC-INST (WS-SECCUSTSUB)                             00068000
000690         TO WS-SECUST-INST (WS-SECTABLE).                         00069000
000700     MOVE WS-ACC-CUST-TYPE (WS-SECCUSTSUB)                        00070000
000710         TO WS-SECUST-CUST-TYPE (WS-SECTABLE).                    00071000
000720     MOVE WS-ACC-CUST (WS-SECCUSTSUB)                             00072000
000730         TO WS-SECUST-CUST (WS-SECTABLE).                         00073000
000740     MOVE WS-ACC-PRIM (WS-SECCUSTSUB)                             00074000
000750         TO WS-SECUST-PRIM (WS-SECTABLE).                         00075000
000760     MOVE WS-ACC-RELNBR (WS-SECCUSTSUB)                           00076000
000770         TO WS-SECUST-RELNBR (WS-SECTABLE).                       00077000
000780     ADD 1 TO WS-SECCUSTSUB.                                      00078000
000790     GO TO GM-LOAD-SECONDARY.                                     00079000
000800 GM-MORE-ACCTS.                                                   00080000
000810     MOVE ZERO TO WS-SECCUSTSUB.                                  00081000
000820 GM-FIND-SEC-ACCTS.                                               00082000
000830     ADD 1 TO WS-SECCUSTSUB.                                      00083000
000840     IF WS-SECCUSTSUB IS GREATER THAN WS-SECTABLE                 00084000
P0097           GO TO GM-EXIT.                                          00085000
000860     IF WS-SECCUSTSUB IS GREATER THAN WS-SECMAX                   00086000
P0097           GO TO GM-EXIT.                                          00087000
P0097       MOVE RPACCT-INST TO RPRF21-BASE-ACCT-INST.                  00087590
000890     MOVE SPACES TO RPRF21-BASE-ACCT-PRODCODE.                    00089000
000900     MOVE ZEROS TO RPRF21-BASE-ACCT.                              00090000
000910     MOVE WS-SECUST-INST (WS-SECCUSTSUB)                          00091000
000920         TO RPRF21-BASE-CUST-INST.                                00092000
000930     MOVE WS-SECUST-CUST-TYPE (WS-SECCUSTSUB)                     00093000
000940         TO RPRF21-BASE-CUST-TYPE.                                00094000
000950     MOVE WS-SECUST-CUST (WS-SECCUSTSUB)                          00095000
000960         TO RPRF21-BASE-CUST.                                     00096000
P0097      ADD +1 TO WS-SUB4.                                           00096100
P0097      MOVE RPACCT-INST TO WS-SEC-INST (WS-SUB4).                   00096200
P0097      MOVE RPACCT-PRODCODE TO WS-SEC-PRODCD (WS-SUB4).             00096300
P0097      MOVE RPACCT-ACCOUNT TO WS-SEC-ACCT (WS-SUB4).                00096400
P0097      MOVE WS-SECUST-RELNBR (WS-SECCUSTSUB)                        00096500
P0097          TO WS-SEC-RELNBR (WS-SUB4).                              00096600
P0097      MOVE WS-SECUST-RELNBR (WS-SECCUSTSUB)                        00096700
P0097          TO WS-SEC-PRIMCUSTRELNBR (WS-SUB4).                      00096800
P0097      MOVE 'N' TO WS-SEC-QUAL (WS-SUB4).                           00096900
000970 GM-MORE-SECONDARY-ACCTS.                                         00097000
000980     MOVE 'N' TO RPRF21-FUNC.                                     00098000
000990     CALL SR-060CALLNAME USING                                    00099000
001000         WS-LINKRCIF.                                             00100000
001010     IF RPRF21-FUNCTION IS NOT EQUAL TO SPACE                     00101000
001020         MOVE RPRF21-FUNCTION TO WS-FUNCTION                      00102000
001030         GO TO GM-FIND-SEC-ACCTS.                                 00103000
001040* ** A BAD RETURN CODE FROM GET ACCOUNTS GO TO NEXT CUSTOMER      00104000
P0097       MOVE RPRF21-RETURNED-OBJECT TO WS-CAC-TABLE.                00105000
001060     MOVE ZEROS TO WS-SUB3.                                       00106000
001070 GM-CHECK-PRODCODE.                                               00107000
001080     ADD +1 TO WS-SUB3.                                           00108000
001090     IF WS-SUB3 IS GREATER THAN WS-CAC-MAX                        00109000
001100         GO TO GM-CHECK-MORE-SEC.                                 00110000
001110     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO SPACES                00111000
001120         GO TO GM-CHECK-MORE-SEC.                                 00112000
001130     IF WS-CAC-ACCT (WS-SUB3) IS EQUAL TO SPACES                  00113000
001140         GO TO GM-CHECK-MORE-SEC.                                 00114000
001150     MOVE WS-CAC-INST (WS-SUB3) TO WS-SUBINST.                    00115000
001160     IF WS-2024-EXISTS (WS-SUBINST) IS NOT EQUAL TO 'Y'           00116000
001170         GO TO GM-CHECK-PRODCODE.                                 00117000
001180     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-LAST-PRODCD        00118000
P0097          GO TO GM-VALID-ADD.                                      00119000
001200     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO WS-RPMIM2023PRODCD    00120000
001210         GO TO GM-CHECK-PRODCODE.                                 00121000
001220     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-RPMIM2023PRODCD.          00122000
001230     PERFORM SEARCH-RPS-2023.                                     00123000
001240     IF WS-RPMIM2023VALID IS EQUAL TO 'N'                         00124000
001250         GO TO GM-CHECK-PRODCODE.                                 00125000
P0097      MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-LAST-PRODCD.              00126000
001340 GM-VALID-ADD.                                                    00134000
001350     IF WS-CAC-PRODCD (WS-SUB3) IS EQUAL TO RPACCT-PRODCODE       00135000
001360         AND WS-CAC-ACCT (WS-SUB3) IS EQUAL TO RPACCT-ACCOUNT     00136000
001370         AND WS-CAC-INST (WS-SUB3) IS EQUAL TO RPACCT-INST        00137000
001380         GO TO GM-CHECK-PRODCODE.                                 00138000
001390     ADD +1 TO WS-SUB4.                                           00139000
001400     IF WS-SUB4 IS GREATER THAN WS-SECONDARY-MAX                  00140000
P0097           GO TO GM-EXIT.                                          00141000
001420* SAVE BEFORE LOAD                                                00142000
001430     ADD +1 TO WS-ALLSEC.                                         00143000
001440     IF WS-ALLSEC IS GREATER THAN WS-SECMAX                       00144000
001450         MOVE WS-SECMAX TO WS-ALLSEC                              00145000
001460         GO TO GM-VALID-AD2.                                      00146000
001470     MOVE WS-CAC-INST (WS-SUB3) TO WS-SECINST (WS-ALLSEC).        00147000
001480     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SECPRODCD (WS-ALLSEC).    00148000
001490     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SECACCOUNT (WS-ALLSEC).     00149000
001500 GM-VALID-AD2.                                                    00150000
001510     MOVE WS-CAC-PRODCD (WS-SUB3) TO WS-SEC-PRODCD (WS-SUB4).     00151000
001520     MOVE WS-2023-INTAPPL (INDX-2023) TO WS-SEC-APPL (WS-SUB4).   00152000
001530     MOVE WS-2023-RPOPTION (INDX-2023) TO WS-SEC-RPOPT (WS-SUB4). 00153000
001540     MOVE ZEROS TO WS-SEC-BRANCH (WS-SUB4).                       00154000
001550     MOVE ZEROS TO WS-SEC-TYPE (WS-SUB4).                         00155000
001560     MOVE WS-CAC-INST (WS-SUB3) TO WS-SEC-INST (WS-SUB4).         00156000
001570     MOVE WS-CAC-ACCT (WS-SUB3) TO WS-SEC-ACCT (WS-SUB4).         00157000
001580     MOVE WS-CAC-RELNBR (WS-SUB3) TO WS-SEC-RELNBR (WS-SUB4).     00158000
P0097      MOVE ZEROS TO WS-SEC-PRIMCUSTRELNBR (WS-SUB4).               00159000
001610     GO TO GM-CHECK-PRODCODE.                                     00161000
001620 GM-CHECK-MORE-SEC.                                               00162000
001630     IF RPRF21-RETURN IS NOT EQUAL TO 'M'                         00163000
001640         GO TO GM-FIND-SEC-ACCTS.                                 00164000
001650* ** CHECK FOR MORE ACCOUNTS FOR THIS SECONDARY CUSTOMER          00165000
P0097      IF MIM-7100ENTERPRISEOPT IS EQUAL TO 'Y'                     00166000
P0097          AND MIM-7100ENTERPRISEINST IS NOT EQUAL TO ZEROES        00166090
P0097          MOVE MIM-7100ENTERPRISEINST TO RPRF21-BASE-ACCT-INST     00166180
P0097      ELSE                                                         00166270
P0097          MOVE WS-CAC-INST (WS-CAC-MAX) TO RPRF21-BASE-ACCT-INST.  00166360
001670     MOVE WS-CAC-PRODCD (WS-CAC-MAX)                              00167000
001680         TO RPRF21-BASE-ACCT-PRODCODE.                            00168000
001690     MOVE WS-CAC-ACCT (WS-CAC-MAX) TO RPRF21-BASE-ACCT.           00169000
001700     GO TO GM-MORE-SECONDARY-ACCTS.                               00170000
001730 GM-EXIT.                                                         00173000
001740     EXIT.                                                        00174000
001980*----------------------------------------------------------------*00198000
001990*     END OF RP138 GET SECONDARY ACCOUNTS                        *00199000
002000*----------------------------------------------------------------*00200000
