000010******************************************************************00001000
000020* RPP2001S  2001 - RP BRANCH INFO TABLE SEARCH                   *00002000
000030******************************************************************00003000
000040*SEARCH-RPS-2001-SECTION.                                         00004000
000050 SR2001-START.                                                    00005000
000060     MOVE 'N' TO WS-RPMIM2023VALID.                               00006000
000070     SEARCH ALL WS-2001-RECORD                                    00007000
000080         AT END                                                   00008000
000090             MOVE 'N' TO WS-RPMIM2001VALID                        00009000
000100             GO TO SR2001-EXIT                                    00010000
000110         WHEN WS-2001-KEY (INDX-2001) IS EQUAL TO                 00011000
000120             WS-RPMIM2001BRANCH                                   00012000
000130             MOVE WS-2001-REGION (INDX-2001) TO MIM-2001RPREG     00013000
000140             MOVE 'Y' TO WS-RPMIM2001VALID.                       00014000
000150 SR2001-EXIT.                                                     00015000
000160     EXIT.                                                        00016000
000170*----------------------------------------------------------------*00017000
000180*     END OF RP BRANCH INFO 2001 TABLE SEARCH                    *00018000
000190*----------------------------------------------------------------*00019000
