000010******************************************************************00001000
000020* RPP7103S  7103 - RP RATE INCENTIVES TABLE SEARCH               *00002000
000030******************************************************************00003000
000040*SEARCH-RPS-7103 SECTION.                                         00004000
000050 SR7103-START.                                                    00005000
000060     MOVE 'N' TO WS-RPMIM7103FOUND.                               00006000
000070     SEARCH ALL WS-7103-RECORD                                    00007000
000080         AT END                                                   00008000
000090             MOVE 'N' TO WS-RPMIM7103FOUND                        00009000
000100             GO TO SR7103-EXIT                                    00010000
000110         WHEN WS-7103-KEY (INDX-7103) IS EQUAL TO                 00011000
000120             WS-RPMIM7103RATETABLE                                00012000
000130             MOVE WS-RPMIM7103 (INDX-7103) TO MIM-REC7103         00013000
000140             MOVE 'Y' TO WS-RPMIM7103FOUND.                       00014000
000150 SR7103-EXIT.                                                     00015000
000160     EXIT.                                                        00016000
000170*----------------------------------------------------------------*00017000
000180*     END OF RP RATE INCENTIVES 7103 TABLE SEARCH                *00018000
000190*----------------------------------------------------------------*00019000
