000010******************************************************************00001000
000020* RPP7105S  7105 - RP DEMOGRAPHIC QUALIFICATIONS TABLE SEARCH    *00002000
000030******************************************************************00003000
000040*SEARCH-RPS-7105-SECTION.                                         00004000
000050 SR7105-START.                                                    00005000
000060     MOVE 'N' TO WS-RPMIM7105FOUND.                               00006000
000070     SEARCH ALL WS-7105-RECORD                                    00007000
000080         AT END                                                   00008000
000090             MOVE 'N' TO WS-RPMIM7105FOUND                        00009000
000100             GO TO SR7105-EXIT                                    00010000
000110         WHEN WS-7105-KEY (INDX-7105) IS EQUAL TO                 00011000
000120             WS-RPMIM7105DEMO                                     00012000
000130             MOVE WS-RPMIM7105 (INDX-7105) TO MIM-REC7105         00013000
000140             MOVE 'Y' TO WS-RPMIM7105FOUND.                       00014000
000150 SR7105-EXIT.                                                     00015000
000160     EXIT.                                                        00016000
000170*----------------------------------------------------------------*00017000
000180*     END OF RP DEMOGRAPHIC QUALIFICATIONS 7105 TABLE SEARCH     *00018000
000190*----------------------------------------------------------------*00019000
