000010******************************************************************00001000
000020* RPP7111S  7111 - RP TRANSACTION PLAN TABLE SEARCH              *00002000
000030******************************************************************00003000
000040*SEARCH-RPS-7111 SECTION.                                         00004000
000050 SR7111-START.                                                    00005000
000060     MOVE 'N' TO WS-RPMIM7111FOUND.                               00006000
000070     SEARCH ALL WS-7111-RECORD                                    00007000
000080         AT END                                                   00008000
000090             MOVE 'N' TO WS-RPMIM7111FOUND                        00009000
000100             GO TO SR7111-EXIT                                    00010000
000110         WHEN WS-7111-KEY (INDX-7111) IS EQUAL TO WS-RPMITRANKEY  00011000
000120             MOVE WS-RPMIM7111 (INDX-7111) TO MIM-REC7111         00012000
000130             MOVE 'Y' TO WS-RPMIM7111FOUND.                       00013000
000140 SR7111-EXIT.                                                     00014000
000150     EXIT.                                                        00015000
000160*----------------------------------------------------------------*00016000
000170*     END OF RP TRANSACTION PLAN 7102 TABLE SEARCH               *00017000
000180*----------------------------------------------------------------*00018000
