000010******************************************************************00001000
000020* RPP7103  7103 - RP RATE INCENTIVES TABLE LOAD                  *00002000
000030******************************************************************00003000
000040*LOAD-RPS-7103-SECTION.                                           00004000
000050 LR7103-START.                                                    00005000
000060     MOVE HIGH-VALUES TO WS-7103-AREA.                            00006000
000070     SET INDX-7103 TO +1.                                         00007000
000080     MOVE SPACES TO WS-RPMIM7103RATETABLE.                        00008000
000090     MOVE SPACES TO MI7103-RECORD.                                00009000
000100     MOVE WS-RPMIM7103INST TO MIM-7103KINST.                      00010000
000110     MOVE +7103 TO MIM-7103KREC.                                  00011000
000120     MOVE SPACES TO MIM-7103KRATETABLE.                           00012000
000130     MOVE WS-RPMIM7103EFFDT TO MIM-7103KEFFDT.                    00013000
000140     MOVE MIC-RPS-7103-PRI TO MIC-MST-REC-PRI.                    00014000
000150     MOVE MI7103-RECORD TO MIMST-RECORD.                          00015000
000160     PERFORM MIC-MST-GET-EQUAL-REQUEST.                           00016000
000170     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00017000
000180         GO TO LR7103-EXIT.                                       00018000
000190     GO TO LR7103-RECCONT.                                        00019000
000200 LR7103-RECREAD.                                                  00020000
000210     PERFORM MIC-MST-GET-NEXT-REQUEST.                            00021000
000220     IF WS-FUNCTION IS NOT EQUAL TO SPACES                        00022000
000230         GO TO LR7103-EXIT.                                       00023000
000240 LR7103-RECCONT.                                                  00024000
000250     MOVE MIMST-RECORD TO MI7103-RECORD.                          00025000
000260     IF MIM-7103KINST IS NOT EQUAL TO WS-RPMIM7103INST            00026000
000270         GO TO LR7103-EXIT.                                       00027000
000280     IF MIM-7103KEFFDT IS GREATER THAN WS-RPMIM7103EFFDT          00028000
000290         GO TO LR7103-RECREAD.                                    00029000
000300     IF MIM-7103KRATETABLE IS EQUAL TO WS-RPMIM7103RATETABLE      00030000
000310         GO TO LR7103-RECREAD.                                    00031000
000320     IF INDX-7103 IS GREATER THAN WS-RPMIM7103MAXSIZE             00032000
000330         MOVE 'Y' TO WS-RPMIM7103ERROR                            00033000
000340         GO TO LR7103-EXIT.                                       00034000
000350     MOVE MIM-7103KRATETABLE TO WS-7103-RATETABLE (INDX-7103).    00035000
000360     MOVE MIM-7103KRATETABLE TO WS-RPMIM7103RATETABLE.            00036000
000370     MOVE MIM-REC7103 TO WS-RPMIM7103 (INDX-7103).                00037000
000380     SET INDX-7103 UP BY +1.                                      00038000
000390     GO TO LR7103-RECREAD.                                        00039000
000400 LR7103-EXIT.                                                     00040000
000410      EXIT.                                                       00041000
000420*----------------------------------------------------------------*00042000
000430*     END OF RP RATE INCENTIVES TABLE 7103 MICM RECORD LOAD      *00043000
000440*----------------------------------------------------------------*00044000
