000010******************************************************************00001000
000020* RPP7108S  7108 - RP SECONDARY SERVICES LOOK-UP TABLE SEARCH    *00002000
000030******************************************************************00003000
000040*SEARCH-RPS-7108-SECTION.                                         00004000
000050 SR7108-START.                                                    00005000
000060     MOVE 'N' TO WS-RPMIM7108FOUND.                               00006000
000070     SEARCH ALL WS-7108-RECORD                                    00007000
000080         AT END                                                   00008000
000090             MOVE 'N' TO WS-RPMIM7108FOUND                        00009000
000100             GO TO SR7108-EXIT                                    00010000
000110         WHEN WS-7108-KEY (INDX-7108) IS EQUAL TO                 00011000
000120             WS-RPMIM7108RPREC                                    00012000
000130             MOVE WS-RPMIM7108 (INDX-7108) TO MIM-REC7108         00013000
000140             MOVE 'Y' TO WS-RPMIM7108FOUND.                       00014000
000150 SR7108-EXIT.                                                     00015000
000160     EXIT.                                                        00016000
000170*----------------------------------------------------------------*00017000
000180*     END OF RP SECONDARY SERVICES LOOK-UP 7108 TABLE SEARCH     *00018000
000190*----------------------------------------------------------------*00019000
