000010******************************************************************00001000
000020* RPP7106S  7106 - RP CATEGORY BALANCE TABLE SEARCH              *00002000
000030******************************************************************00003000
000040*SEARCH-RPS-7106 SECTION.                                         00004000
000050 SR7106-START.                                                    00005000
000060     MOVE 'N' TO WS-RPMIM7106FOUND.                               00006000
000070     SEARCH ALL WS-7106-RECORD                                    00007000
000080         AT END                                                   00008000
000090             MOVE 'N' TO WS-RPMIM7106FOUND                        00009000
000100             GO TO SR7106-EXIT                                    00010000
000110         WHEN WS-7106-KEY (INDX-7106) IS EQUAL TO                 00011000
000120             WS-RPMIM7106RPREC                                    00012000
000130             MOVE WS-RPMIM7106 (INDX-7106) TO MIM-REC7106         00013000
000140             MOVE 'Y' TO WS-RPMIM7106FOUND.                       00014000
000150 SR7106-EXIT.                                                     00015000
000160     EXIT.                                                        00016000
000170*----------------------------------------------------------------*00017000
000180*     END OF RP CATEGORY BALANCE 7106 TABLE SEARCH                00018000
000190*----------------------------------------------------------------*00019000
