000010******************************************************************00001000
000020* RPPEVTC  READ/ADD ROUTINE FOR EVT - BATCH                      *00002000
000030******************************************************************00003000
000040*ADD-EVENT-HISTORY SECTION.                                       00004000
000050 AEH-START.                                                       00005000
000060     IF RPS-EVT-FLAG IS EQUAL TO 'Y'                              00006000
000070         GO TO AEH-EVT-CONT.                                      00007000
000080     INITIALIZE RPEVT-RECORD.                                     00008000
000090 AEH-EVT-CONT.                                                    00009000
000100     MOVE RPS-EVT-ACCT1-GRP TO RPEVT-ACCT2-GRP.                   00010000
000110     IF RPS-EVT-INST2 IS EQUAL TO ZEROS                           00011000
000120         MOVE RPS-EVT-INST TO RPEVT-INST                          00012000
000130         MOVE RPS-EVT-PRODCODE TO RPEVT-PRODCODE                  00013000
000140         MOVE RPS-EVT-ACCOUNT TO RPEVT-ACCOUNT                    00014000
000150         MOVE RPS-EVT-MODEL TO RPEVT-MODEL2                       00015000
000160         MOVE ZEROS TO RPEVT-INST2                                00016000
000170         MOVE SPACES TO RPEVT-PRODCODE2                           00017000
000180         MOVE SPACES TO RPEVT-ACCOUNT2                            00018000
000190     ELSE                                                         00019000
000200         MOVE RPS-EVT-ACCT2-GRP TO RPEVT-ACCT1-GRP.               00020000
000210     MOVE RPBNK-CURDT TO RPEVT-DATE.                              00021000
000220     MOVE ZEROS TO RPEVT-SEQ.                                     00022000
000230     MOVE RPS-EVT-EVENT-CODE TO RPEVT-EVENT-CODE.                 00023000
000240     MOVE RPS-EVT-IDNUMBER TO RPEVT-IDNUMBER.                     00024000
000250     MOVE RPS-EVT-MSGNBR TO RPEVT-MSGNBR.                         00025000
000260     MOVE RPS-EVT-MODULE TO RPEVT-MODULE.                         00026000
000270 AEH-ADD-EVT.                                                     00027000
000280     MOVE 'A  ' TO SR-APIFUNC.                                    00028000
000290     PERFORM CALL-RPS-EVT.                                        00029000
000300     IF WS-FUNCTION IS EQUAL TO SPACE                             00030000
000310         GO TO AEH-EXIT.                                          00031000
000320     IF WS-FUNCTION IS NOT EQUAL TO '='                           00032000
000330         GO TO AEH-EXIT.                                          00033000
000340     ADD +1 TO RPEVT-SEQ.                                         00034000
000350     GO TO AEH-ADD-EVT.                                           00035000
000360 AEH-EXIT.                                                        00036000
000370     EXIT.                                                        00037000
000380******************************************************************00038000
