000010******************************************************************00001000
000020 CALL-RPRPTO-SECTION.                                             00002000
000030 RPRPTO-START.                                                    00003000
000040     IF WS-TRPTOOPEN IS EQUAL TO SPACE                            00004000
000050         OR WS-TRPTO1 IS EQUAL TO 'O'                             00005000
000060         MOVE WS-TRPTO2 TO WS-TRPTOOPEN.                          00006000
000070     IF WS-TRPTO2 IS EQUAL TO SPACE                               00007000
000080         MOVE WS-TRPTOOPEN TO WS-TRPTO2.                          00008000
000090     IF WS-TRPTO1 IS EQUAL TO 'C'                                 00009000
000100         AND WS-TRPTOOPEN IS EQUAL TO WS-TRPTO2                   00010000
000110         MOVE SPACE TO WS-TRPTOOPEN.                              00011000
000120     CALL 'RPIRPTO' USING                                         00012000
000130         WS-TRPTOAREA                                             00013000
000140         RPRPTO-RECORD.                                           00014000
000150     MOVE WS-TRPTO1 TO WS-FUNCTION.                               00015000
000160     IF WS-TRPTO1 IS EQUAL TO SPACE                               00016000
000170         MOVE SPACES TO WS-ABORTMSG                               00017000
000180     ELSE                                                         00018000
000190         MOVE WS-TRPTOAREA TO WS-ABORTMSG.                        00019000
000200 RPRPTO-EXIT.                                                     00020000
000210     EXIT.                                                        00021000
000220******************************************************************00022000
