000010*01  RP-ACTWREC.                                                  00001000
000020*----------------------------------------------------------------*00002000
000030*    RPSACTW - RP RELATIONSHIP ACCOUNT WORK RECORED              *00003000
000040******************************************************************00004000
000050     03  RPACTW-GRP-KEY.                                          00005000
000060         05  RPACTW-ACCT1-GRP.                                    00006000
000070             07  RPACTW-INST     PIC 9(04).                       00007000
000080             07  RPACTW-PRODCODE PIC X(06).                       00008000
000090             07  RPACTW-ACCOUNT  PIC X(18).                       00009000
000100         05  RPACTW-ACCT2-GRP.                                    00010000
000110             07  RPACTW-INST2    PIC 9(04).                       00011000
000120             07  RPACTW-PRODCODE2                                 00012000
000130                                 PIC X(06).                       00013000
000140             07  RPACTW-ACCOUNT2 PIC X(18).                       00014000
000150             07  RPACTW-MODEL2   PIC X(10).                       00015000
000160     03  RPACTW-GRP-DATA.                                         00016000
000170         05  RPACTW-SC-INC-OPTION                                 00017000
000180                                 PIC X(01).                       00018000
000190         05  RPACTW-SC-INC-QUAL  PIC X(01).                       00019000
000200         05  RPACTW-SC-MODEL     PIC X(10).                       00020000
000210         05  RPACTW-DISCOUNT-AMOUNT                               00021000
000220                                 PIC S9(09)V99   COMP-3.          00022000
000230         05  RPACTW-DISCOUNT-PERCENT                              00023000
000240                                 PIC SV9(05).                     00024000
000250         05  RPACTW-RATE-INC-OPTION                               00025000
000260                                 PIC X(01).                       00026000
000270         05  RPACTW-RATE-INC-QUAL                                 00027000
000280                                 PIC X(01).                       00028000
000290         05  RPACTW-RATE-MODEL   PIC X(10).                       00029000
000300         05  RPACTW-RATE-TYPE    PIC X(01).                       00030000
000310         05  RPACTW-RATE-OPTION  PIC X(01).                       00031000
000320         05  RPACTW-RATE-PERCENT PIC SV9(09).                     00032000
000330         05  RPACTW-PROCOPT      PIC X(01).                       00033000
000340         05  RPACTW-SPLIT-RATE-TABLE.                             00034000
000350             07  RPACTW-RATEAMT-1                                 00035000
000360                                 PIC S9(09)      COMP-3.          00036000
000370             07  RPACTW-RATEPCT-1                                 00037000
000380                                 PIC SV9(09)     COMP-3.          00038000
000390             07  RPACTW-RATEAMT-2                                 00039000
000400                                 PIC S9(09)      COMP-3.          00040000
000410             07  RPACTW-RATEPCT-2                                 00041000
000420                                 PIC SV9(09)     COMP-3.          00042000
000430             07  RPACTW-RATEAMT-3                                 00043000
000440                                 PIC S9(09)      COMP-3.          00044000
000450             07  RPACTW-RATEPCT-3                                 00045000
000460                                 PIC SV9(09)     COMP-3.          00046000
000470             07  RPACTW-RATEAMT-4                                 00047000
000480                                 PIC S9(09)      COMP-3.          00048000
000490             07  RPACTW-RATEPCT-4                                 00049000
000500                                 PIC SV9(09)     COMP-3.          00050000
000510             07  RPACTW-RATEAMT-5                                 00051000
000520                                 PIC S9(09)      COMP-3.          00052000
000530             07  RPACTW-RATEPCT-5                                 00053000
000540                                 PIC SV9(09)     COMP-3.          00054000
000550             07  RPACTW-RATEAMT-6                                 00055000
000560                                 PIC S9(09)      COMP-3.          00056000
000570             07  RPACTW-RATEPCT-6                                 00057000
000580                                 PIC SV9(09)     COMP-3.          00058000
000590             07  RPACTW-RATEAMT-7                                 00059000
000600                                 PIC S9(09)      COMP-3.          00060000
000610             07  RPACTW-RATEPCT-7                                 00061000
000620                                 PIC SV9(09)     COMP-3.          00062000
000630             07  RPACTW-RATEAMT-8                                 00063000
000640                                 PIC S9(09)      COMP-3.          00064000
000650             07  RPACTW-RATEPCT-8                                 00065000
000660                                 PIC SV9(09)     COMP-3.          00066000
000670             07  RPACTW-RATEAMT-9                                 00067000
000680                                 PIC S9(09)      COMP-3.          00068000
000690             07  RPACTW-RATEPCT-9                                 00069000
000700                                 PIC SV9(09)     COMP-3.          00070000
000710             07  RPACTW-RATEAMT-10                                00071000
000720                                 PIC S9(09)      COMP-3.          00072000
000730             07  RPACTW-RATEPCT-10                                00073000
000740                                 PIC SV9(09)     COMP-3.          00074000
000750             07  RPACTW-RATEAMT-11                                00075000
000760                                 PIC S9(09)      COMP-3.          00076000
000770             07  RPACTW-RATEPCT-11                                00077000
000780                                 PIC SV9(09)     COMP-3.          00078000
000790             07  RPACTW-RATEAMT-12                                00079000
000800                                 PIC S9(09)      COMP-3.          00080000
000810             07  RPACTW-RATEPCT-12                                00081000
000820                                 PIC SV9(09)     COMP-3.          00082000
000830             07  RPACTW-RATEAMT-13                                00083000
000840                                 PIC S9(09)      COMP-3.          00084000
000850             07  RPACTW-RATEPCT-13                                00085000
000860                                 PIC SV9(09)     COMP-3.          00086000
000870             07  RPACTW-RATEAMT-14                                00087000
000880                                 PIC S9(09)      COMP-3.          00088000
000890             07  RPACTW-RATEPCT-14                                00089000
000900                                 PIC SV9(09)     COMP-3.          00090000
000910             07  RPACTW-RATEAMT-15                                00091000
000920                                 PIC S9(09)      COMP-3.          00092000
000930             07  RPACTW-RATEPCT-15                                00093000
000940                                 PIC SV9(09)     COMP-3.          00094000
000950         05  RPACTW-SPLIT-RATE-TABLEX                             00095000
000960                         REDEFINES RPACTW-SPLIT-RATE-TABLE        00096000
000970                                                 OCCURS 15.       00097000
000980             07  RPACTW-RATEAMT  PIC S9(09)      COMP-3.          00098000
000990             07  RPACTW-RATEPCT  PIC SV9(09)     COMP-3.          00099000
001000         05  RPACTW-APPL         PIC 9(02).                       00100000
001010         05  RPACTW-SECSVCS-INC-OPTION                            00101000
001020                                 PIC X(01).                       00102000
001030         05  RPACTW-SECONDARY-SERVICES.                           00103000
001040             07  RPACTW-SECSERV1 PIC X(06).                       00104000
001050             07  RPACTW-SECSERV2 PIC X(06).                       00105000
001060             07  RPACTW-SECSERV3 PIC X(06).                       00106000
001070             07  RPACTW-SECSERV4 PIC X(06).                       00107000
001080             07  RPACTW-SECSERV5 PIC X(06).                       00108000
001090             07  RPACTW-SECSERV6 PIC X(06).                       00109000
001100             07  RPACTW-SECSERV7 PIC X(06).                       00110000
001110             07  RPACTW-SECSERV8 PIC X(06).                       00111000
001120             07  RPACTW-SECSERV9 PIC X(06).                       00112000
001130             07  RPACTW-SECSERV10                                 00113000
001140                                 PIC X(06).                       00114000
001150             07  RPACTW-SECSERV11                                 00115000
001160                                 PIC X(06).                       00116000
001170             07  RPACTW-SECSERV12                                 00117000
001180                                 PIC X(06).                       00118000
001190             07  RPACTW-SECSERV13                                 00119000
001200                                 PIC X(06).                       00120000
001210             07  RPACTW-SECSERV14                                 00121000
001220                                 PIC X(06).                       00122000
001230             07  RPACTW-SECSERV15                                 00123000
001240                                 PIC X(06).                       00124000
001250             07  RPACTW-SECSERV16                                 00125000
001260                                 PIC X(06).                       00126000
001270             07  RPACTW-SECSERV17                                 00127000
001280                                 PIC X(06).                       00128000
001290             07  RPACTW-SECSERV18                                 00129000
001300                                 PIC X(06).                       00130000
001310             07  RPACTW-SECSERV19                                 00131000
001320                                 PIC X(06).                       00132000
001330             07  RPACTW-SECSERV20                                 00133000
001340                                 PIC X(06).                       00134000
001350         05  RPACTW-SECONDARY-SERVICES-X                          00135000
001360                         REDEFINES RPACTW-SECONDARY-SERVICES.     00136000
001370             07  RPACTW-SECSERV  PIC X(06)       OCCURS 20.       00137000
001380         05  RPACTW-RSV-AMT      PIC S9(13)V99   COMP-3.          00138000
001390         05  RPACTW-MISC-OPTION1                                  00139000
001400                                 PIC X(01).                       00140000
001410         05  RPACTW-MISC-OPTION2                                  00141000
001420                                 PIC X(01).                       00142000
001430         05  RPACTW-MISC-OPTION3                                  00143000
001440                                 PIC X(01).                       00144000
P0160          05  RPACTW-RSV-FLAG     PIC X(01).                       00144100
P0160          05  RPACTW-RSV-FLAG1    PIC X(01).                       00144200
P0160          05  RPACTW-RSV-FLAG2    PIC X(01).                       00144300
P0160          05  RPACTW-RSV-FLAG3    PIC X(01).                       00144400
P0160          05  RPACTW-RECALC-RATE  PIC X(01).                       00144500
P0160          05  RPACTW-RATE-BALCD   PIC 9(02).                       00144600
P0160          05  RPACTW-RATE-BALORDER                                 00144700
P0160                                  PIC X(02).                       00144800
001450     03  RPACTW-MISC-DATA.                                        00145000
001460         05  RPACTW-ACCT-TYPE    PIC 9(03)        COMP-3.         00146000
001470         05  RPACTW-COMBBAL1     PIC S9(13)V99    COMP-3.         00147000
001480         05  RPACTW-COMBBAL2     PIC S9(13)V99    COMP-3.         00148000
001490         05  RPACTW-COMBBAL3     PIC S9(13)V99    COMP-3.         00149000
001500         05  RPACTW-COMBBAL4     PIC S9(13)V99    COMP-3.         00150000
001510         05  RPACTW-SECSVC-BAL   PIC S9(13)V99    COMP-3.         00151000
