000010*01  WS-CRW-RECORD.                                               00001000
000020*----------------------------------------------------------------*00002000
000030*    RPSCRWW - RP RELATIONSHIP CASH REWARD UPDATE RECORD         *00003000
000040******************************************************************00004000
000050     03  WS-CRW-GRP-KEY.                                          00005000
000060         05  WS-CRW-ACCT1-GRP.                                    00006000
000070             07  WS-CRW-INST     PIC 9(04).                       00007000
000080             07  WS-CRW-PRODCODE PIC X(06).                       00008000
000090             07  WS-CRW-ACCOUNT  PIC X(18).                       00009000
000100             07  WS-CRW-MODEL    PIC X(10).                       00010000
000110         05  WS-CRW-GRP-AIX1.                                     00011000
000120             07  WS-CRW-ACCT2-GRP.                                00012000
000130                 09  WS-CRW-INST2                                 00013000
000140                                 PIC 9(04).                       00014000
000150                 09  WS-CRW-PRODCODE2                             00015000
000160                                 PIC X(06).                       00016000
000170                 09  WS-CRW-ACCOUNT2                              00017000
000180                                 PIC X(18).                       00018000
000190*----------------------------------------------------------------*00019000
000200     03  WS-CRW-GRP-DATA.                                         00020000
000210         05  WS-CRW-FUNCTION     PIC X(01).                       00021000
000220*  U - UPDATE EXISTING CASH REWARD RECORD                         00022000
000230*  D - DELETE EXISTING CASH REWARD RECORD                         00023000
000240         05  WS-CRW-GRP-DATA1.                                    00024000
000250             07  WS-CRW-IDNUMBER PIC X(18).                       00025000
000260             07  WS-CRW-BALOPT   PIC X(01).                       00026000
000270             07  WS-CRW-PCT-USED PIC SV9(09)     COMP-3.          00027000
000280             07  WS-CRW-LSTCOMBBALUSED                            00028000
000290                                 PIC S9(13)V99   COMP-3.          00029000
000300             07  WS-CRW-FREQ     PIC X(01).                       00030000
000310             07  WS-CRW-TERM     PIC S9(03)      COMP-3.          00031000
000320             07  WS-CRW-DAY      PIC 9(02).                       00032000
000330             07  WS-CRW-NXTDATE  PIC S9(09)      COMP-3.          00033000
000340             07  WS-CRW-LSTDATE  PIC S9(09)      COMP-3.          00034000
000350             07  WS-CRW-AMOUNT   PIC S9(09)V99   COMP-3.          00035000
000360             07  WS-CRW-LAST-AMT PIC S9(09)V99   COMP-3.          00036000
000370             07  WS-CRW-AMT-YTD  PIC S9(13)V99   COMP-3.          00037000
000380             07  WS-CRW-MONTHLY-COMBBAL.                          00038000
000390                 09  WS-CRW-MCOMBBAL-1                            00039000
000400                                 PIC S9(13)V99   COMP-3.          00040000
000410                 09  WS-CRW-MCOMBBAL-2                            00041000
000420                                 PIC S9(13)V99   COMP-3.          00042000
000430                 09  WS-CRW-MCOMBBAL-3                            00043000
000440                                 PIC S9(13)V99   COMP-3.          00044000
000450                 09  WS-CRW-MCOMBBAL-4                            00045000
000460                                 PIC S9(13)V99   COMP-3.          00046000
000470                 09  WS-CRW-MCOMBBAL-5                            00047000
000480                                 PIC S9(13)V99   COMP-3.          00048000
000490                 09  WS-CRW-MCOMBBAL-6                            00049000
000500                                 PIC S9(13)V99   COMP-3.          00050000
000510                 09  WS-CRW-MCOMBBAL-7                            00051000
000520                                 PIC S9(13)V99   COMP-3.          00052000
000530                 09  WS-CRW-MCOMBBAL-8                            00053000
000540                                 PIC S9(13)V99   COMP-3.          00054000
000550                 09  WS-CRW-MCOMBBAL-9                            00055000
000560                                 PIC S9(13)V99   COMP-3.          00056000
000570                 09  WS-CRW-MCOMBBAL-10                           00057000
000580                                 PIC S9(13)V99   COMP-3.          00058000
000590                 09  WS-CRW-MCOMBBAL-11                           00059000
000600                                 PIC S9(13)V99   COMP-3.          00060000
000610                 09  WS-CRW-MCOMBBAL-12                           00061000
000620                                 PIC S9(13)V99   COMP-3.          00062000
000630             07  WS-CRW-MONTHLY-COMBBAL-R                         00063000
000640                         REDEFINES WS-CRW-MONTHLY-COMBBAL.        00064000
000650                 09  WS-CRW-MCOMBBAL PIC S9(13)V99   COMP-3       00065000
000660                                                 OCCURS 12.       00066000
000670             07  WS-CRW-DATE-OPEN                                 00067000
000680                                 PIC S9(09)      COMP-3.          00068000
