000010* REL=5.0                                                         00001000
000020*    DESC=ENROLLMENT                                              00002000
000030*    PROD=RPS WU=ENR0                                             00003000
000040*    LDB=BKI136                                                   00004000
000050*    RELATED=XXX,XXX                                              00005000
000060*    RECOVERY=YES                                                 00006000
000070*                                                                 00007000
000080*01  RPENR-RECORD.                                                00008000
000090*----------------------------------------------------------------*00009000
000100*    RPSENR - RP RELATIONSHIP ENROLLMENT RECORD            -ENR- *00010000
000110******************************************************************00011000
000120     03  RPENR-GRP-KEY.                                           00012000
000130         05  RPENR-INST          PIC 9(04).                       00013000
000140         05  RPENR-IDNUMBER      PIC X(18).                       00014000
000150         05  RPENR-RELEXISTS     PIC X(01).                       00015000
000160         05  RPENR-RECID         PIC X(03).                       00016000
000170         05  RPENR-RECSEQ        PIC 9(04).                       00017000
000180*----------------------------------------------------------------*00018000
000190     03  RPENR-AUDIT-STAMP.                                       00019000
000200         05  RPENR-UPD-DATE      PIC S9(09)      COMP-3.          00020000
000210         05  RPENR-UPD-TIME      PIC S9(09)      COMP-3.          00021000
000220         05  RPENR-UPD-USER      PIC X(08).                       00022000
000230         05  RPENR-UPD-ORG       PIC X(06).                       00023000
000240*----------------------------------------------------------------*00024000
000250     03  RPENR-GRP-DATA.                                          00025000
000260         05  RPENR-AREA          PIC X(500).                      00026000
000270***************************************************************** 00027000
000280*        END  RP RELATIONSHIP ENROLLMENT RECORD (ENR)             00028000
000290***************************************************************** 00029000
