000010*01  RP-MSTWREC.                                                  00001000
000020*----------------------------------------------------------------*00002000
000030*    RPSMSTW - RP RELATIONSHIP MASTER WORK RECORD                *00003000
000040******************************************************************00004000
000050     03  RPMSTW-GRP-KEY.                                          00005000
000070         05  RPMSTW-INST         PIC 9(04).                       00007000
000080         05  RPMSTW-PRODCODE     PIC X(06).                       00008000
000090         05  RPMSTW-ACCOUNT      PIC X(18).                       00009000
000100         05  RPMSTW-MODEL        PIC X(10).                       00010000
000160     03  RPMSTW-GRP-DATA.                                         00016000
000170         05  RPMSTW-DEFAULT-MODEL                                 00017000
000170                                 PIC X(10).                       00017000
