000010******************************************************************00001000
000020* RPSRATC  RP RATE INCENTIVE CHANGE RECORD                       *00002000
000030******************************************************************00003000
000040*01  RPRATC-RECORD.                                               00004000
000050*----------------------------------------------------------------*00005000
000060     03  RPRATC-KEY.                                              00006000
000070         05  RPRATC-INST         PIC 9(04).                       00007000
000080         05  RPRATC-PRODCODE     PIC X(06).                       00008000
000090         05  RPRATC-ACCOUNT      PIC X(18).                       00009000
000100*----------------------------------------------------------------*00010000
000110     03  RPRATC-DATA.                                             00011000
000120         05  RPRATC-MODEL        PIC X(10).                       00012000
000130         05  RPRATC-PREV-RATE    PIC SV9(09).                     00013000
000140         05  RPRATC-NEW-RATE     PIC SV9(09).                     00014000
000150         05  RPRATC-RATE-TYPE    PIC X(01).                       00015000
000160         05  FILLER              PIC X(23).                       00016000
000170*----------------------------------------------------------------*00017000
000180*            END OF RP RATE INCENTIVE CHANGE RECORD              *00018000
000190*----------------------------------------------------------------*00019000
