000010* REL=5.0                                                         00001000
000020*    DESC=RELATIONSHIP SECONDARY                                  00002000
000030*    PROD=RPS WU=SEC0                                             00003000
000040*    LDB=BKI136                                                   00004000
000050*    RELATED=XXX,XXX                                              00005000
000060*    RECOVERY=YES                                                 00006000
000070*                                                                 00007000
000080*01  RPSEC-RECORD.                                                00008000
000090*----------------------------------------------------------------*00009000
000100*    RPSSEC - RP RELATIONSHIP SECONDARY RECORD             -SEC- *00010000
000110******************************************************************00011000
000120     03  RPSEC-GRP-KEY.                                           00012000
000130         05  RPSEC-ACCT1-GRP.                                     00013000
000140             07  RPSEC-INST      PIC 9(04).                       00014000
000150             07  RPSEC-PRODCODE  PIC X(06).                       00015000
000160             07  RPSEC-ACCOUNT   PIC X(18).                       00016000
000170         05  RPSEC-ACCT2-GRP.                                     00017000
000180             07  RPSEC-INST2     PIC 9(04).                       00018000
000190             07  RPSEC-PRODCODE2 PIC X(06).                       00019000
000200             07  RPSEC-ACCOUNT2  PIC X(18).                       00020000
000210             07  RPSEC-MODEL2    PIC X(10).                       00021000
000220*----------------------------------------------------------------*00022000
000230     03  RPSEC-AUDIT-STAMP.                                       00023000
000240         05  RPSEC-UPD-DATE      PIC S9(09)      COMP-3.          00024000
000250         05  RPSEC-UPD-TIME      PIC S9(09)      COMP-3.          00025000
000260         05  RPSEC-UPD-USER      PIC X(08).                       00026000
000270         05  RPSEC-UPD-ORG       PIC X(06).                       00027000
000280*----------------------------------------------------------------*00028000
000290     03  RPSEC-GRP-DATA.                                          00029000
000300         05  RPSEC-GRP-AIX1.                                      00030000
000310             07  RPSEC-ALT-INST  PIC 9(04).                       00031000
000320             07  RPSEC-ALT-ACCOUNT                                00032000
000330                                 PIC X(18).                       00033000
000340             07  RPSEC-ALT-PRODCODE                               00034000
000350                                 PIC X(06).                       00035000
000360         05  RPSEC-RESERVED      PIC X(25).                       00036000
000370***************************************************************** 00037000
000380*        END  RP RELATIONSHIP SECONDARY RECORD (SEC)              00038000
000390***************************************************************** 00039000
