000010*01  RPXXX01-MESSAGE.                                             00001000
000020*----------------------------------------------------------------*00002000
000030*    RPSXXX01 - RPS RELATIONSHIP INQUIRY MESSAGE AREA            *00003000
000040******************************************************************00004000
000050     03  RPXXX01-MISC-DATA.                                       00005000
000060         05  RPXXX01-OCCUR       PIC 9(04)       COMP.            00006000
000070         05  RPXXX01-SELECT-RTN  PIC X(01).                       00007000
000080         05  RPXXX01-KEY-RECORD.                                  00008000
000090             07  RPXXX01-KEY-ACCT1-GRP.                           00009000
000100                 09  RPXXX01-KEY-INST                             00010000
000110                                 PIC 9(04).                       00011000
000120                 09  RPXXX01-KEY-PRODCODE                         00012000
000130                                 PIC X(06).                       00013000
000140                 09  RPXXX01-KEY-ACCOUNT                          00014000
000150                                 PIC X(18).                       00015000
000160                 09  RPXXX01-KEY-MODEL                            00016000
000170                                 PIC X(10).                       00017000
000180             07  RPXXX01-KEY-ACCT2-GRP.                           00018000
000190                 09  RPXXX01-KEY-INST2                            00019000
000200                                 PIC 9(04).                       00020000
000210                 09  RPXXX01-KEY-PRODCODE2                        00021000
000220                                 PIC X(06).                       00022000
000230                 09  RPXXX01-KEY-ACCOUNT2                         00023000
000240                                 PIC X(18).                       00024000
000250         05  RPXXX01-KEY-IDNUMBER                                 00025000
000260                                 PIC 9(18).                       00026000
000270         05  RPXXX01-PRIM-OPTION PIC X(01).                       00027000
000280         05  RPXXX01-CUST-TYPE   PIC X(01).                       00028000
000290         05  RPXXX01-CUST-NAME   PIC X(40).                       00029000
000300         05  RPXXX01-IDNUMBER    PIC 9(18).                       00030000
000310         05  RPXXX01-REL-STAT    PIC X(01).                       00031000
000320         05  RPXXX01-QUAL-STAT   PIC X(01).                       00032000
000330         05  RPXXX01-OUT-FLAG    PIC X(01).                       00033000
000340         05  RPXXX01-MODEL-DESC  PIC X(20).                       00034000
000350         05  RPXXX01-DATE-OPENED PIC S9(09)      COMP-3.          00035000
000360         05  RPXXX01-LMNTDT      PIC S9(09)      COMP-3.          00036000
000370         05  RPXXX01-EXPIRE-DATE PIC S9(09)      COMP-3.          00037000
000380         05  RPXXX01-EXTENSION-DATE                               00038000
000390                                 PIC S9(09)      COMP-3.          00039000
000400         05  RPXXX01-CRW-INST    PIC 9(04).                       00040000
000410         05  RPXXX01-CRW-PRODCODE                                 00041000
000420                                 PIC X(06).                       00042000
000430         05  RPXXX01-CRW-ACCOUNT PIC X(18).                       00043000
000440         05  RPXXX01-PRIM-BAL    PIC S9(13)V99   COMP-3.          00044000
000450         05  RPXXX01-PRIM-REQ    PIC S9(13)V99   COMP-3.          00045000
000460         05  RPXXX01-COMB-BAL1   PIC S9(13)V99   COMP-3.          00046000
000470         05  RPXXX01-COMB-REQ1   PIC S9(13)V99   COMP-3.          00047000
000480         05  RPXXX01-COMB-BAL2   PIC S9(13)V99   COMP-3.          00048000
000490         05  RPXXX01-COMB-REQ2   PIC S9(13)V99   COMP-3.          00049000
000500         05  RPXXX01-COMB-BAL3   PIC S9(13)V99   COMP-3.          00050000
000510         05  RPXXX01-COMB-REQ3   PIC S9(13)V99   COMP-3.          00051000
000520         05  RPXXX01-COMB-BAL4   PIC S9(13)V99   COMP-3.          00052000
000530         05  RPXXX01-COMB-REQ4   PIC S9(13)V99   COMP-3.          00053000
000540         05  RPXXX01-GRP-DATA.                                    00054000
000550             07  RPXXX01-GRP-ENTRIES             OCCURS 06 TIMES. 00055000
000560                 09  RPXXX01-RET-KEY.                             00056000
000570                     11  RPXXX01-RET-INST                         00057000
000580                                 PIC 9(04).                       00058000
000590                     11  RPXXX01-RET-PRODCODE                     00059000
000600                                 PIC X(06).                       00060000
000610                     11  RPXXX01-RET-ACCOUNT                      00061000
000620                                 PIC X(18).                       00062000
000630                 09  RPXXX01-RET-CATCD-01                         00063000
000640                                 PIC X(06).                       00064000
000650                 09  RPXXX01-RET-BAL-01                           00065000
000660                                 PIC S9(13)V99   COMP-3.          00066000
000670                 09  RPXXX01-RET-REQ-01                           00067000
000680                                 PIC S9(13)V99   COMP-3.          00068000
000690                 09  RPXXX01-RET-CATCD-02                         00069000
000700                                 PIC X(06).                       00070000
000710                 09  RPXXX01-RET-BAL-02                           00071000
000720                                 PIC S9(13)V99   COMP-3.          00072000
000730                 09  RPXXX01-RET-REQ-02                           00073000
000740                                 PIC S9(13)V99   COMP-3.          00074000
000750         05  RPXXX01-PAGING-CONTROLS.                             00075000
000760             07  RPXXX01-SUB     PIC S9(04)      COMP-3.          00076000
000770             07  RPXXX01-CURPAGE PIC S9(04)      COMP-3.          00077000
000780             07  RPXXX01-PAGES-TO-READ                            00078000
000790                                 PIC S9(04)      COMP-3.          00079000
000800******************************************************************00080000
000810*       END RPS RELATIONSHIP INQUIRY MESSAGE AREA (00)           *00081000
000820******************************************************************00082000
