000200*01  RPV130-PANL-DATA-BLOCK.                                      00000200
000300*----------------------------------------------------------------*00000300
000400*    RPV130W - PANEL DATA BLOCK/AREA                             *00000400
000500*----------------------------------------------------------------*00000500
000600     03  FILLER                  PIC X(08)       VALUE '**BPDB**'.00000600
000700     03  PDB-RPV130-NAME                                          00000700
000800                                 PIC X(08)       VALUE 'RPV130  '.00000800
000900     03  PDB-RPV130-STATUS.                                       00000900
001000         05  PDB-RPV130-KEY-CHG                                   00001000
001100                                 PIC X(01).                       00001100
001200         05  PDB-RPV130-DATA-CHG                                  00001200
001300                                 PIC X(01).                       00001300
001400         05  PDB-RPV130-CURR-OCC                                  00001400
001500                                 PIC S9(04)      COMP             00001500
001600                                                 VALUE +0.        00001600
001700     03  PDB-RPV130-FIELD-TABLE.                                  00001700
001800         05  PDB-RPV130-OPERID                                    00001800
001900                                 PIC X(08)       VALUE 'OPERID  '.00001900
002000         05  FILLER              PIC S9(04)      COMP             00002000
002100                                                 VALUE +8.        00002100
002200         05  FILLER              PIC S9(04)      COMP             00002200
002300                                                 VALUE +0.        00002300
002400         05  FILLER              PIC S9(04)      COMP             00002400
002500                                                 VALUE +0.        00002500
002600         05  FILLER              PIC X(02)       VALUE 'CD'.      00002600
002700         05  PDB-RPV130-OPERID-MASK                               00002700
002800                                 PIC X(01)       VALUE ' '.       00002800
002900         05  PDB-RPV130-OPERID-ERROR                              00002900
003000                                 PIC X(01)       VALUE ' '.       00003000
003100         05  PDB-RPV130-OPERID-VID                                00003100
003200                                 PIC X(01)       VALUE 'D'.       00003200
003300         05  PDB-RPV130-OPERID-EL                                 00003300
003400                                 PIC X(01)       VALUE 'N'.       00003400
003500         05  PDB-RPV130-OPERID-DCHG                               00003500
003600                                 PIC X(01)       VALUE ' '.       00003600
003700         05  FILLER              PIC X(01)       VALUE ' '.       00003700
003800         05  PDB-RPV130-INST                                      00003800
003900                                 PIC X(08)       VALUE 'INST    '.00003900
004000         05  FILLER              PIC S9(04)      COMP             00004000
004100                                                 VALUE +4.        00004100
004200         05  FILLER              PIC S9(04)      COMP             00004200
004300                                                 VALUE +0.        00004300
004400         05  FILLER              PIC S9(04)      COMP             00004400
004500                                                 VALUE +0.        00004500
004600         05  FILLER              PIC X(02)       VALUE 'CD'.      00004600
004700         05  PDB-RPV130-INST-MASK                                 00004700
004800                                 PIC X(01)       VALUE ' '.       00004800
004900         05  PDB-RPV130-INST-ERROR                                00004900
005000                                 PIC X(01)       VALUE ' '.       00005000
005100         05  PDB-RPV130-INST-VID                                  00005100
005200                                 PIC X(01)       VALUE 'D'.       00005200
005300         05  PDB-RPV130-INST-EL                                   00005300
005400                                 PIC X(01)       VALUE 'N'.       00005400
005500         05  PDB-RPV130-INST-DCHG                                 00005500
005600                                 PIC X(01)       VALUE ' '.       00005600
005700         05  FILLER              PIC X(01)       VALUE ' '.       00005700
005800         05  PDB-RPV130-SYSDATE                                   00005800
005900                                 PIC X(08)       VALUE 'SYSDATE '.00005900
006000         05  FILLER              PIC S9(04)      COMP             00006000
006100                                                 VALUE +10.       00006100
006200         05  FILLER              PIC S9(04)      COMP             00006200
006300                                                 VALUE +0.        00006300
006400         05  FILLER              PIC S9(04)      COMP             00006400
006500                                                 VALUE +0.        00006500
006600         05  FILLER              PIC X(02)       VALUE 'CD'.      00006600
006700         05  PDB-RPV130-SYSDATE-MASK                              00006700
006800                                 PIC X(01)       VALUE ' '.       00006800
006900         05  PDB-RPV130-SYSDATE-ERROR                             00006900
007000                                 PIC X(01)       VALUE ' '.       00007000
007100         05  PDB-RPV130-SYSDATE-VID                               00007100
007200                                 PIC X(01)       VALUE 'D'.       00007200
007300         05  PDB-RPV130-SYSDATE-EL                                00007300
007400                                 PIC X(01)       VALUE 'N'.       00007400
007500         05  PDB-RPV130-SYSDATE-DCHG                              00007500
007600                                 PIC X(01)       VALUE ' '.       00007600
007700         05  FILLER              PIC X(01)       VALUE ' '.       00007700
007800         05  PDB-RPV130-MORE                                      00007800
007900                                 PIC X(08)       VALUE 'MORE    '.00007900
008000         05  FILLER              PIC S9(04)      COMP             00008000
008100                                                 VALUE +5.        00008100
008200         05  FILLER              PIC S9(04)      COMP             00008200
008300                                                 VALUE +0.        00008300
008400         05  FILLER              PIC S9(04)      COMP             00008400
008500                                                 VALUE +0.        00008500
008600         05  FILLER              PIC X(02)       VALUE 'CD'.      00008600
008700         05  PDB-RPV130-MORE-MASK                                 00008700
008800                                 PIC X(01)       VALUE ' '.       00008800
008900         05  PDB-RPV130-MORE-ERROR                                00008900
009000                                 PIC X(01)       VALUE ' '.       00009000
009100         05  PDB-RPV130-MORE-VID                                  00009100
009200                                 PIC X(01)       VALUE 'D'.       00009200
009300         05  PDB-RPV130-MORE-EL                                   00009300
009400                                 PIC X(01)       VALUE 'N'.       00009400
009500         05  PDB-RPV130-MORE-DCHG                                 00009500
009600                                 PIC X(01)       VALUE ' '.       00009600
009700         05  FILLER              PIC X(01)       VALUE ' '.       00009700
009800         05  PDB-RPV130-MINUS                                     00009800
009900                                 PIC X(08)       VALUE 'MINUS   '.00009900
010000         05  FILLER              PIC S9(04)      COMP             00010000
010100                                                 VALUE +1.        00010100
010200         05  FILLER              PIC S9(04)      COMP             00010200
010300                                                 VALUE +0.        00010300
010400         05  FILLER              PIC S9(04)      COMP             00010400
010500                                                 VALUE +0.        00010500
010600         05  FILLER              PIC X(02)       VALUE 'CD'.      00010600
010700         05  PDB-RPV130-MINUS-MASK                                00010700
010800                                 PIC X(01)       VALUE ' '.       00010800
010900         05  PDB-RPV130-MINUS-ERROR                               00010900
011000                                 PIC X(01)       VALUE ' '.       00011000
011100         05  PDB-RPV130-MINUS-VID                                 00011100
011200                                 PIC X(01)       VALUE 'D'.       00011200
011300         05  PDB-RPV130-MINUS-EL                                  00011300
011400                                 PIC X(01)       VALUE 'N'.       00011400
011500         05  PDB-RPV130-MINUS-DCHG                                00011500
011600                                 PIC X(01)       VALUE ' '.       00011600
011700         05  FILLER              PIC X(01)       VALUE ' '.       00011700
011800         05  PDB-RPV130-PLUS                                      00011800
011900                                 PIC X(08)       VALUE 'PLUS    '.00011900
012000         05  FILLER              PIC S9(04)      COMP             00012000
012100                                                 VALUE +1.        00012100
012200         05  FILLER              PIC S9(04)      COMP             00012200
012300                                                 VALUE +0.        00012300
012400         05  FILLER              PIC S9(04)      COMP             00012400
012500                                                 VALUE +0.        00012500
012600         05  FILLER              PIC X(02)       VALUE 'CD'.      00012600
012700         05  PDB-RPV130-PLUS-MASK                                 00012700
012800                                 PIC X(01)       VALUE ' '.       00012800
012900         05  PDB-RPV130-PLUS-ERROR                                00012900
013000                                 PIC X(01)       VALUE ' '.       00013000
013100         05  PDB-RPV130-PLUS-VID                                  00013100
013200                                 PIC X(01)       VALUE 'D'.       00013200
013300         05  PDB-RPV130-PLUS-EL                                   00013300
013400                                 PIC X(01)       VALUE 'N'.       00013400
013500         05  PDB-RPV130-PLUS-DCHG                                 00013500
013600                                 PIC X(01)       VALUE ' '.       00013600
013700         05  FILLER              PIC X(01)       VALUE ' '.       00013700
013800         05  PDB-RPV130-PRODCD                                    00013800
013900                                 PIC X(08)       VALUE 'PRODCD  '.00013900
014000         05  FILLER              PIC S9(04)      COMP             00014000
014100                                                 VALUE +6.        00014100
014200         05  FILLER              PIC S9(04)      COMP             00014200
014300                                                 VALUE +0.        00014300
014400         05  FILLER              PIC S9(04)      COMP             00014400
014500                                                 VALUE +0.        00014500
014600         05  FILLER              PIC X(02)       VALUE 'CD'.      00014600
014700         05  PDB-RPV130-PRODCD-MASK                               00014700
014800                                 PIC X(01)       VALUE ' '.       00014800
014900         05  PDB-RPV130-PRODCD-ERROR                              00014900
015000                                 PIC X(01)       VALUE ' '.       00015000
015100         05  PDB-RPV130-PRODCD-VID                                00015100
015200                                 PIC X(01)       VALUE 'D'.       00015200
015300         05  PDB-RPV130-PRODCD-EL                                 00015300
015400                                 PIC X(01)       VALUE 'N'.       00015400
015500         05  PDB-RPV130-PRODCD-DCHG                               00015500
015600                                 PIC X(01)       VALUE ' '.       00015600
015700         05  FILLER              PIC X(01)       VALUE ' '.       00015700
015800         05  PDB-RPV130-ACCOUNT                                   00015800
015900                                 PIC X(08)       VALUE 'ACCOUNT '.00015900
016000         05  FILLER              PIC S9(04)      COMP             00016000
016100                                                 VALUE +18.       00016100
016200         05  FILLER              PIC S9(04)      COMP             00016200
016300                                                 VALUE +0.        00016300
016400         05  FILLER              PIC S9(04)      COMP             00016400
016500                                                 VALUE +0.        00016500
016600         05  FILLER              PIC X(02)       VALUE 'CD'.      00016600
016700         05  PDB-RPV130-ACCOUNT-MASK                              00016700
016800                                 PIC X(01)       VALUE ' '.       00016800
016900         05  PDB-RPV130-ACCOUNT-ERROR                             00016900
017000                                 PIC X(01)       VALUE ' '.       00017000
017100         05  PDB-RPV130-ACCOUNT-VID                               00017100
017200                                 PIC X(01)       VALUE 'D'.       00017200
017300         05  PDB-RPV130-ACCOUNT-EL                                00017300
017400                                 PIC X(01)       VALUE 'N'.       00017400
017500         05  PDB-RPV130-ACCOUNT-DCHG                              00017500
017600                                 PIC X(01)       VALUE ' '.       00017600
017700         05  FILLER              PIC X(01)       VALUE ' '.       00017700
017800         05  PDB-RPV130-SERVICE                                   00017800
017900                                 PIC X(08)       VALUE 'SERVICE '.00017900
018000         05  FILLER              PIC S9(04)      COMP             00018000
018100                                                 VALUE +6.        00018100
018200         05  FILLER              PIC S9(04)      COMP             00018200
018300                                                 VALUE +0.        00018300
018400         05  FILLER              PIC S9(04)      COMP             00018400
018500                                                 VALUE +1.        00018500
018600         05  FILLER              PIC X(02)       VALUE 'CD'.      00018600
018700         05  PDB-RPV130-SERVICE-MASK                              00018700
018800                                 PIC X(01)       VALUE ' '.       00018800
018900         05  PDB-RPV130-SERVICE-ERROR                             00018900
019000                                 PIC X(01)       VALUE ' '.       00019000
019100         05  PDB-RPV130-SERVICE-VID                               00019100
019200                                 PIC X(01)       VALUE 'D'.       00019200
019300         05  PDB-RPV130-SERVICE-EL                                00019300
019400                                 PIC X(01)       VALUE 'N'.       00019400
019500         05  PDB-RPV130-SERVICE-DCHG                              00019500
019600                                 PIC X(01)       VALUE ' '.       00019600
019700         05  FILLER              PIC X(01)       VALUE ' '.       00019700
019800         05  PDB-RPV130-DESC                                      00019800
019900                                 PIC X(08)       VALUE 'DESC    '.00019900
020000         05  FILLER              PIC S9(04)      COMP             00020000
020100                                                 VALUE +30.       00020100
020200         05  FILLER              PIC S9(04)      COMP             00020200
020300                                                 VALUE +0.        00020300
020400         05  FILLER              PIC S9(04)      COMP             00020400
020500                                                 VALUE +1.        00020500
020600         05  FILLER              PIC X(02)       VALUE 'CD'.      00020600
020700         05  PDB-RPV130-DESC-MASK                                 00020700
020800                                 PIC X(01)       VALUE ' '.       00020800
020900         05  PDB-RPV130-DESC-ERROR                                00020900
021000                                 PIC X(01)       VALUE ' '.       00021000
021100         05  PDB-RPV130-DESC-VID                                  00021100
021200                                 PIC X(01)       VALUE 'D'.       00021200
021300         05  PDB-RPV130-DESC-EL                                   00021300
021400                                 PIC X(01)       VALUE 'N'.       00021400
021500         05  PDB-RPV130-DESC-DCHG                                 00021500
021600                                 PIC X(01)       VALUE ' '.       00021600
021700         05  FILLER              PIC X(01)       VALUE ' '.       00021700
021800         05  PDB-RPV130-MODEL                                     00021800
021900                                 PIC X(08)       VALUE 'MODEL   '.00021900
022000         05  FILLER              PIC S9(04)      COMP             00022000
022100                                                 VALUE +10.       00022100
022200         05  FILLER              PIC S9(04)      COMP             00022200
022300                                                 VALUE +0.        00022300
022400         05  FILLER              PIC S9(04)      COMP             00022400
022500                                                 VALUE +1.        00022500
022600         05  FILLER              PIC X(02)       VALUE 'CD'.      00022600
022700         05  PDB-RPV130-MODEL-MASK                                00022700
022800                                 PIC X(01)       VALUE ' '.       00022800
022900         05  PDB-RPV130-MODEL-ERROR                               00022900
023000                                 PIC X(01)       VALUE ' '.       00023000
023100         05  PDB-RPV130-MODEL-VID                                 00023100
023200                                 PIC X(01)       VALUE 'D'.       00023200
023300         05  PDB-RPV130-MODEL-EL                                  00023300
023400                                 PIC X(01)       VALUE 'N'.       00023400
023500         05  PDB-RPV130-MODEL-DCHG                                00023500
023600                                 PIC X(01)       VALUE ' '.       00023600
023700         05  FILLER              PIC X(01)       VALUE ' '.       00023700
023800         05  PDB-RPV130-MSGLINE                                   00023800
023900                                 PIC X(08)       VALUE 'MSGLINE '.00023900
024000         05  FILLER              PIC S9(04)      COMP             00024000
024100                                                 VALUE +78.       00024100
024200         05  FILLER              PIC S9(04)      COMP             00024200
024300                                                 VALUE +0.        00024300
024400         05  FILLER              PIC S9(04)      COMP             00024400
024500                                                 VALUE +0.        00024500
024600         05  FILLER              PIC X(02)       VALUE 'CD'.      00024600
024700         05  PDB-RPV130-MSGLINE-MASK                              00024700
024800                                 PIC X(01)       VALUE ' '.       00024800
024900         05  PDB-RPV130-MSGLINE-ERROR                             00024900
025000                                 PIC X(01)       VALUE ' '.       00025000
025100         05  PDB-RPV130-MSGLINE-VID                               00025100
025200                                 PIC X(01)       VALUE 'D'.       00025200
025300         05  PDB-RPV130-MSGLINE-EL                                00025300
025400                                 PIC X(01)       VALUE 'I'.       00025400
025500         05  PDB-RPV130-MSGLINE-DCHG                              00025500
025600                                 PIC X(01)       VALUE ' '.       00025600
025700         05  FILLER              PIC X(01)       VALUE ' '.       00025700
025800         05  PDB-RPV130-COMMAND                                   00025800
025900                                 PIC X(08)       VALUE 'COMMAND '.00025900
026000         05  FILLER              PIC S9(04)      COMP             00026000
026100                                                 VALUE +65.       00026100
026200         05  FILLER              PIC S9(04)      COMP             00026200
026300                                                 VALUE +0.        00026300
026400         05  FILLER              PIC S9(04)      COMP             00026400
026500                                                 VALUE +0.        00026500
026600         05  FILLER              PIC X(02)       VALUE 'CD'.      00026600
026700         05  PDB-RPV130-COMMAND-MASK                              00026700
026800                                 PIC X(01)       VALUE ' '.       00026800
026900         05  PDB-RPV130-COMMAND-ERROR                             00026900
027000                                 PIC X(01)       VALUE ' '.       00027000
027100         05  PDB-RPV130-COMMAND-VID                               00027100
027200                                 PIC X(01)       VALUE 'I'.       00027200
027300         05  PDB-RPV130-COMMAND-EL                                00027300
027400                                 PIC X(01)       VALUE 'O'.       00027400
027500         05  PDB-RPV130-COMMAND-DCHG                              00027500
027600                                 PIC X(01)       VALUE ' '.       00027600
027700         05  FILLER              PIC X(01)       VALUE ' '.       00027700
027800         05  PDB-RPV130-PFLINE1                                   00027800
027900                                 PIC X(08)       VALUE 'PFLINE1 '.00027900
028000         05  FILLER              PIC S9(04)      COMP             00028000
028100                                                 VALUE +78.       00028100
028200         05  FILLER              PIC S9(04)      COMP             00028200
028300                                                 VALUE +0.        00028300
028400         05  FILLER              PIC S9(04)      COMP             00028400
028500                                                 VALUE +0.        00028500
028600         05  FILLER              PIC X(02)       VALUE 'CD'.      00028600
028700         05  PDB-RPV130-PFLINE1-MASK                              00028700
028800                                 PIC X(01)       VALUE ' '.       00028800
028900         05  PDB-RPV130-PFLINE1-ERROR                             00028900
029000                                 PIC X(01)       VALUE ' '.       00029000
029100         05  PDB-RPV130-PFLINE1-VID                               00029100
029200                                 PIC X(01)       VALUE 'D'.       00029200
029300         05  PDB-RPV130-PFLINE1-EL                                00029300
029400                                 PIC X(01)       VALUE 'N'.       00029400
029500         05  PDB-RPV130-PFLINE1-DCHG                              00029500
029600                                 PIC X(01)       VALUE ' '.       00029600
029700         05  FILLER              PIC X(01)       VALUE ' '.       00029700
029800         05  PDB-RPV130-PFLINE2                                   00029800
029900                                 PIC X(08)       VALUE 'PFLINE2 '.00029900
030000         05  FILLER              PIC S9(04)      COMP             00030000
030100                                                 VALUE +78.       00030100
030200         05  FILLER              PIC S9(04)      COMP             00030200
030300                                                 VALUE +0.        00030300
030400         05  FILLER              PIC S9(04)      COMP             00030400
030500                                                 VALUE +0.        00030500
030600         05  FILLER              PIC X(02)       VALUE 'CD'.      00030600
030700         05  PDB-RPV130-PFLINE2-MASK                              00030700
030800                                 PIC X(01)       VALUE ' '.       00030800
030900         05  PDB-RPV130-PFLINE2-ERROR                             00030900
031000                                 PIC X(01)       VALUE ' '.       00031000
031100         05  PDB-RPV130-PFLINE2-VID                               00031100
031200                                 PIC X(01)       VALUE 'D'.       00031200
031300         05  PDB-RPV130-PFLINE2-EL                                00031300
031400                                 PIC X(01)       VALUE 'N'.       00031400
031500         05  PDB-RPV130-PFLINE2-DCHG                              00031500
031600                                 PIC X(01)       VALUE ' '.       00031600
031700         05  FILLER              PIC X(01)       VALUE ' '.       00031700
031800         05  FILLER              PIC X(08)       VALUE LOW-VALUE. 00031800
031900                                                                  00031900
032000 01  RPV130-PANL-DATA-AREA.                                       00032000
032100     03  RPV130-OPERID           PIC X(08).                       00032100
032200     03  RPV130-INST             PIC X(04).                       00032200
032300     03  RPV130-SYSDATE          PIC X(10).                       00032300
032400     03  RPV130-MORE             PIC X(05).                       00032400
032500     03  RPV130-MINUS            PIC X(01).                       00032500
032600     03  RPV130-PLUS             PIC X(01).                       00032600
032700     03  RPV130-PRODCD           PIC X(06).                       00032700
032800     03  RPV130-ACCOUNT          PIC X(18).                       00032800
032900     03  RPV130-SERVICE          PIC X(06).                       00032900
033000     03  RPV130-DESC             PIC X(30).                       00033000
033100     03  RPV130-MODEL            PIC X(10).                       00033100
033200     03  RPV130-MSGLINE          PIC X(78).                       00033200
033300     03  RPV130-COMMAND          PIC X(65).                       00033300
033400     03  RPV130-PFLINE1          PIC X(78).                       00033400
033500     03  RPV130-PFLINE2          PIC X(78).                       00033500
033600                                                                  00033600
033700*  COUNTERS FOR MULTIPLY OCCURRING FIELDS.                        00033700
033800 01  RPV130-COUNTER-TABLE.                                        00033800
033900     03  RPV130-SERVICE-COUNT                                     00033900
034000                                 PIC S9(04)      COMP             00034000
034100                                                 VALUE +13.       00034100
034200     03  RPV130-DESC-COUNT                                        00034200
034300                                 PIC S9(04)      COMP             00034300
034400                                                 VALUE +13.       00034400
034500     03  RPV130-MODEL-COUNT                                       00034500
034600                                 PIC S9(04)      COMP             00034600
034700                                                 VALUE +13.       00034700
034800     03  RPV130-COUNT                                             00034800
034900                                 PIC S9(04)      COMP.            00034900
035000 01  RPV130-ERROR-FIELD                                           00035000
035100                                 PIC X(08).                       00035100
035200 01  RPV130-SW-SET-CURSOR                                         00035200
035300                                 PIC X(01)       VALUE 'N'.       00035300
035400******************************************************************00035400
