000010*01  RPV120-PANL-DATA-BLOCK.                                      00001000
000020*----------------------------------------------------------------*00002000
000030*    RPV120W - PANEL DATA BLOCK/AREA                             *00003000
000040*----------------------------------------------------------------*00004000
000050     03  FILLER                  PIC X(08)       VALUE '**BPDB**'.00005000
000060     03  PDB-RPV120-NAME                                          00006000
000070                                 PIC X(08)       VALUE 'RPV120  '.00007000
000080     03  PDB-RPV120-STATUS.                                       00008000
000090         05  PDB-RPV120-KEY-CHG                                   00009000
000100                                 PIC X(01).                       00010000
000110         05  PDB-RPV120-DATA-CHG                                  00011000
000120                                 PIC X(01).                       00012000
000130         05  PDB-RPV120-CURR-OCC                                  00013000
000140                                 PIC S9(04)      COMP             00014000
000150                                                 VALUE +0.        00015000
000160     03  PDB-RPV120-FIELD-TABLE.                                  00016000
000170         05  PDB-RPV120-OPERID                                    00017000
000180                                 PIC X(08)       VALUE 'OPERID  '.00018000
000190         05  FILLER              PIC S9(04)      COMP             00019000
000200                                                 VALUE +8.        00020000
000210         05  FILLER              PIC S9(04)      COMP             00021000
000220                                                 VALUE +0.        00022000
000230         05  FILLER              PIC S9(04)      COMP             00023000
000240                                                 VALUE +0.        00024000
000250         05  FILLER              PIC X(02)       VALUE 'CD'.      00025000
000260         05  PDB-RPV120-OPERID-MASK                               00026000
000270                                 PIC X(01)       VALUE ' '.       00027000
000280         05  PDB-RPV120-OPERID-ERROR                              00028000
000290                                 PIC X(01)       VALUE ' '.       00029000
000300         05  PDB-RPV120-OPERID-VID                                00030000
000310                                 PIC X(01)       VALUE 'D'.       00031000
000320         05  PDB-RPV120-OPERID-EL                                 00032000
000330                                 PIC X(01)       VALUE 'N'.       00033000
000340         05  PDB-RPV120-OPERID-DCHG                               00034000
000350                                 PIC X(01)       VALUE ' '.       00035000
000360         05  FILLER              PIC X(01)       VALUE ' '.       00036000
000370         05  PDB-RPV120-INST                                      00037000
000380                                 PIC X(08)       VALUE 'INST    '.00038000
000390         05  FILLER              PIC S9(04)      COMP             00039000
000400                                                 VALUE +4.        00040000
000410         05  FILLER              PIC S9(04)      COMP             00041000
000420                                                 VALUE +0.        00042000
000430         05  FILLER              PIC S9(04)      COMP             00043000
000440                                                 VALUE +0.        00044000
000450         05  FILLER              PIC X(02)       VALUE 'CD'.      00045000
000460         05  PDB-RPV120-INST-MASK                                 00046000
000470                                 PIC X(01)       VALUE ' '.       00047000
000480         05  PDB-RPV120-INST-ERROR                                00048000
000490                                 PIC X(01)       VALUE ' '.       00049000
000500         05  PDB-RPV120-INST-VID                                  00050000
000510                                 PIC X(01)       VALUE 'D'.       00051000
000520         05  PDB-RPV120-INST-EL                                   00052000
000530                                 PIC X(01)       VALUE 'N'.       00053000
000540         05  PDB-RPV120-INST-DCHG                                 00054000
000550                                 PIC X(01)       VALUE ' '.       00055000
000560         05  FILLER              PIC X(01)       VALUE ' '.       00056000
000570         05  PDB-RPV120-SYSDATE                                   00057000
000580                                 PIC X(08)       VALUE 'SYSDATE '.00058000
000590         05  FILLER              PIC S9(04)      COMP             00059000
000600                                                 VALUE +10.       00060000
000610         05  FILLER              PIC S9(04)      COMP             00061000
000620                                                 VALUE +0.        00062000
000630         05  FILLER              PIC S9(04)      COMP             00063000
000640                                                 VALUE +0.        00064000
000650         05  FILLER              PIC X(02)       VALUE 'CD'.      00065000
000660         05  PDB-RPV120-SYSDATE-MASK                              00066000
000670                                 PIC X(01)       VALUE ' '.       00067000
000680         05  PDB-RPV120-SYSDATE-ERROR                             00068000
000690                                 PIC X(01)       VALUE ' '.       00069000
000700         05  PDB-RPV120-SYSDATE-VID                               00070000
000710                                 PIC X(01)       VALUE 'D'.       00071000
000720         05  PDB-RPV120-SYSDATE-EL                                00072000
000730                                 PIC X(01)       VALUE 'N'.       00073000
000740         05  PDB-RPV120-SYSDATE-DCHG                              00074000
000750                                 PIC X(01)       VALUE ' '.       00075000
000760         05  FILLER              PIC X(01)       VALUE ' '.       00076000
000770         05  PDB-RPV120-MORE                                      00077000
000780                                 PIC X(08)       VALUE 'MORE    '.00078000
000790         05  FILLER              PIC S9(04)      COMP             00079000
000800                                                 VALUE +5.        00080000
000810         05  FILLER              PIC S9(04)      COMP             00081000
000820                                                 VALUE +0.        00082000
000830         05  FILLER              PIC S9(04)      COMP             00083000
000840                                                 VALUE +0.        00084000
000850         05  FILLER              PIC X(02)       VALUE 'CD'.      00085000
000860         05  PDB-RPV120-MORE-MASK                                 00086000
000870                                 PIC X(01)       VALUE ' '.       00087000
000880         05  PDB-RPV120-MORE-ERROR                                00088000
000890                                 PIC X(01)       VALUE ' '.       00089000
000900         05  PDB-RPV120-MORE-VID                                  00090000
000910                                 PIC X(01)       VALUE 'D'.       00091000
000920         05  PDB-RPV120-MORE-EL                                   00092000
000930                                 PIC X(01)       VALUE 'N'.       00093000
000940         05  PDB-RPV120-MORE-DCHG                                 00094000
000950                                 PIC X(01)       VALUE ' '.       00095000
000960         05  FILLER              PIC X(01)       VALUE ' '.       00096000
000970         05  PDB-RPV120-MINUS                                     00097000
000980                                 PIC X(08)       VALUE 'MINUS   '.00098000
000990         05  FILLER              PIC S9(04)      COMP             00099000
001000                                                 VALUE +1.        00100000
001010         05  FILLER              PIC S9(04)      COMP             00101000
001020                                                 VALUE +0.        00102000
001030         05  FILLER              PIC S9(04)      COMP             00103000
001040                                                 VALUE +0.        00104000
001050         05  FILLER              PIC X(02)       VALUE 'CD'.      00105000
001060         05  PDB-RPV120-MINUS-MASK                                00106000
001070                                 PIC X(01)       VALUE ' '.       00107000
001080         05  PDB-RPV120-MINUS-ERROR                               00108000
001090                                 PIC X(01)       VALUE ' '.       00109000
001100         05  PDB-RPV120-MINUS-VID                                 00110000
001110                                 PIC X(01)       VALUE 'D'.       00111000
001120         05  PDB-RPV120-MINUS-EL                                  00112000
001130                                 PIC X(01)       VALUE 'N'.       00113000
001140         05  PDB-RPV120-MINUS-DCHG                                00114000
001150                                 PIC X(01)       VALUE ' '.       00115000
001160         05  FILLER              PIC X(01)       VALUE ' '.       00116000
001170         05  PDB-RPV120-PLUS                                      00117000
001180                                 PIC X(08)       VALUE 'PLUS    '.00118000
001190         05  FILLER              PIC S9(04)      COMP             00119000
001200                                                 VALUE +1.        00120000
001210         05  FILLER              PIC S9(04)      COMP             00121000
001220                                                 VALUE +0.        00122000
001230         05  FILLER              PIC S9(04)      COMP             00123000
001240                                                 VALUE +0.        00124000
001250         05  FILLER              PIC X(02)       VALUE 'CD'.      00125000
001260         05  PDB-RPV120-PLUS-MASK                                 00126000
001270                                 PIC X(01)       VALUE ' '.       00127000
001280         05  PDB-RPV120-PLUS-ERROR                                00128000
001290                                 PIC X(01)       VALUE ' '.       00129000
001300         05  PDB-RPV120-PLUS-VID                                  00130000
001310                                 PIC X(01)       VALUE 'D'.       00131000
001320         05  PDB-RPV120-PLUS-EL                                   00132000
001330                                 PIC X(01)       VALUE 'N'.       00133000
001340         05  PDB-RPV120-PLUS-DCHG                                 00134000
001350                                 PIC X(01)       VALUE ' '.       00135000
001360         05  FILLER              PIC X(01)       VALUE ' '.       00136000
001370         05  PDB-RPV120-PRODCD                                    00137000
001380                                 PIC X(08)       VALUE 'PRODCD  '.00138000
001390         05  FILLER              PIC S9(04)      COMP             00139000
001400                                                 VALUE +6.        00140000
001410         05  FILLER              PIC S9(04)      COMP             00141000
001420                                                 VALUE +0.        00142000
001430         05  FILLER              PIC S9(04)      COMP             00143000
001440                                                 VALUE +0.        00144000
001450         05  FILLER              PIC X(02)       VALUE 'CD'.      00145000
001460         05  PDB-RPV120-PRODCD-MASK                               00146000
001470                                 PIC X(01)       VALUE ' '.       00147000
001480         05  PDB-RPV120-PRODCD-ERROR                              00148000
001490                                 PIC X(01)       VALUE ' '.       00149000
001500         05  PDB-RPV120-PRODCD-VID                                00150000
001510                                 PIC X(01)       VALUE 'D'.       00151000
001520         05  PDB-RPV120-PRODCD-EL                                 00152000
001530                                 PIC X(01)       VALUE 'N'.       00153000
001540         05  PDB-RPV120-PRODCD-DCHG                               00154000
001550                                 PIC X(01)       VALUE ' '.       00155000
001560         05  FILLER              PIC X(01)       VALUE ' '.       00156000
001570         05  PDB-RPV120-ACCOUNT                                   00157000
001580                                 PIC X(08)       VALUE 'ACCOUNT '.00158000
001590         05  FILLER              PIC S9(04)      COMP             00159000
001600                                                 VALUE +18.       00160000
001610         05  FILLER              PIC S9(04)      COMP             00161000
001620                                                 VALUE +0.        00162000
001630         05  FILLER              PIC S9(04)      COMP             00163000
001640                                                 VALUE +0.        00164000
001650         05  FILLER              PIC X(02)       VALUE 'CD'.      00165000
001660         05  PDB-RPV120-ACCOUNT-MASK                              00166000
001670                                 PIC X(01)       VALUE ' '.       00167000
001680         05  PDB-RPV120-ACCOUNT-ERROR                             00168000
001690                                 PIC X(01)       VALUE ' '.       00169000
001700         05  PDB-RPV120-ACCOUNT-VID                               00170000
001710                                 PIC X(01)       VALUE 'D'.       00171000
001720         05  PDB-RPV120-ACCOUNT-EL                                00172000
001730                                 PIC X(01)       VALUE 'N'.       00173000
001740         05  PDB-RPV120-ACCOUNT-DCHG                              00174000
001750                                 PIC X(01)       VALUE ' '.       00175000
001760         05  FILLER              PIC X(01)       VALUE ' '.       00176000
001770         05  PDB-RPV120-REL                                       00177000
001780                                 PIC X(08)       VALUE 'REL     '.00178000
001790         05  FILLER              PIC S9(04)      COMP             00179000
001800                                                 VALUE +10.       00180000
001810         05  FILLER              PIC S9(04)      COMP             00181000
001820                                                 VALUE +0.        00182000
001830         05  FILLER              PIC S9(04)      COMP             00183000
001840                                                 VALUE +0.        00184000
001850         05  FILLER              PIC X(02)       VALUE 'CD'.      00185000
001860         05  PDB-RPV120-REL-MASK                                  00186000
001870                                 PIC X(01)       VALUE ' '.       00187000
001880         05  PDB-RPV120-REL-ERROR                                 00188000
001890                                 PIC X(01)       VALUE ' '.       00189000
001900         05  PDB-RPV120-REL-VID                                   00190000
001910                                 PIC X(01)       VALUE 'D'.       00191000
001920         05  PDB-RPV120-REL-EL                                    00192000
001930                                 PIC X(01)       VALUE 'N'.       00193000
001940         05  PDB-RPV120-REL-DCHG                                  00194000
001950                                 PIC X(01)       VALUE ' '.       00195000
001960         05  FILLER              PIC X(01)       VALUE ' '.       00196000
001970         05  PDB-RPV120-INST1                                     00197000
001980                                 PIC X(08)       VALUE 'INST1   '.00198000
001990         05  FILLER              PIC S9(04)      COMP             00199000
002000                                                 VALUE +4.        00200000
002010         05  FILLER              PIC S9(04)      COMP             00201000
002020                                                 VALUE +0.        00202000
002030         05  FILLER              PIC S9(04)      COMP             00203000
002040                                                 VALUE +0.        00204000
002050         05  FILLER              PIC X(02)       VALUE 'CD'.      00205000
002060         05  PDB-RPV120-INST1-MASK                                00206000
002070                                 PIC X(01)       VALUE ' '.       00207000
002080         05  PDB-RPV120-INST1-ERROR                               00208000
002090                                 PIC X(01)       VALUE ' '.       00209000
002100         05  PDB-RPV120-INST1-VID                                 00210000
002110                                 PIC X(01)       VALUE 'D'.       00211000
002120         05  PDB-RPV120-INST1-EL                                  00212000
002130                                 PIC X(01)       VALUE 'N'.       00213000
002140         05  PDB-RPV120-INST1-DCHG                                00214000
002150                                 PIC X(01)       VALUE ' '.       00215000
002160         05  FILLER              PIC X(01)       VALUE ' '.       00216000
002170         05  PDB-RPV120-PRODCD1                                   00217000
002180                                 PIC X(08)       VALUE 'PRODCD1 '.00218000
002190         05  FILLER              PIC S9(04)      COMP             00219000
002200                                                 VALUE +6.        00220000
002210         05  FILLER              PIC S9(04)      COMP             00221000
002220                                                 VALUE +0.        00222000
002230         05  FILLER              PIC S9(04)      COMP             00223000
002240                                                 VALUE +0.        00224000
002250         05  FILLER              PIC X(02)       VALUE 'CD'.      00225000
002260         05  PDB-RPV120-PRODCD1-MASK                              00226000
002270                                 PIC X(01)       VALUE ' '.       00227000
002280         05  PDB-RPV120-PRODCD1-ERROR                             00228000
002290                                 PIC X(01)       VALUE ' '.       00229000
002300         05  PDB-RPV120-PRODCD1-VID                               00230000
002310                                 PIC X(01)       VALUE 'D'.       00231000
002320         05  PDB-RPV120-PRODCD1-EL                                00232000
002330                                 PIC X(01)       VALUE 'N'.       00233000
002340         05  PDB-RPV120-PRODCD1-DCHG                              00234000
002350                                 PIC X(01)       VALUE ' '.       00235000
002360         05  FILLER              PIC X(01)       VALUE ' '.       00236000
002370         05  PDB-RPV120-ACCT                                      00237000
002380                                 PIC X(08)       VALUE 'ACCT    '.00238000
002390         05  FILLER              PIC S9(04)      COMP             00239000
002400                                                 VALUE +18.       00240000
002410         05  FILLER              PIC S9(04)      COMP             00241000
002420                                                 VALUE +0.        00242000
002430         05  FILLER              PIC S9(04)      COMP             00243000
002440                                                 VALUE +0.        00244000
002450         05  FILLER              PIC X(02)       VALUE 'CD'.      00245000
002460         05  PDB-RPV120-ACCT-MASK                                 00246000
002470                                 PIC X(01)       VALUE ' '.       00247000
002480         05  PDB-RPV120-ACCT-ERROR                                00248000
002490                                 PIC X(01)       VALUE ' '.       00249000
002500         05  PDB-RPV120-ACCT-VID                                  00250000
002510                                 PIC X(01)       VALUE 'D'.       00251000
002520         05  PDB-RPV120-ACCT-EL                                   00252000
002530                                 PIC X(01)       VALUE 'N'.       00253000
002540         05  PDB-RPV120-ACCT-DCHG                                 00254000
002550                                 PIC X(01)       VALUE ' '.       00255000
002560         05  FILLER              PIC X(01)       VALUE ' '.       00256000
002570         05  PDB-RPV120-CUSTNA                                    00257000
002580                                 PIC X(08)       VALUE 'CUSTNA  '.00258000
002590         05  FILLER              PIC S9(04)      COMP             00259000
002600                                                 VALUE +40.       00260000
002610         05  FILLER              PIC S9(04)      COMP             00261000
002620                                                 VALUE +0.        00262000
002630         05  FILLER              PIC S9(04)      COMP             00263000
002640                                                 VALUE +0.        00264000
002650         05  FILLER              PIC X(02)       VALUE 'CD'.      00265000
002660         05  PDB-RPV120-CUSTNA-MASK                               00266000
002670                                 PIC X(01)       VALUE ' '.       00267000
002680         05  PDB-RPV120-CUSTNA-ERROR                              00268000
002690                                 PIC X(01)       VALUE ' '.       00269000
002700         05  PDB-RPV120-CUSTNA-VID                                00270000
002710                                 PIC X(01)       VALUE 'D'.       00271000
002720         05  PDB-RPV120-CUSTNA-EL                                 00272000
002730                                 PIC X(01)       VALUE 'N'.       00273000
002740         05  PDB-RPV120-CUSTNA-DCHG                               00274000
002750                                 PIC X(01)       VALUE ' '.       00275000
002760         05  FILLER              PIC X(01)       VALUE ' '.       00276000
002770         05  PDB-RPV120-MODEL                                     00277000
002780                                 PIC X(08)       VALUE 'MODEL   '.00278000
002790         05  FILLER              PIC S9(04)      COMP             00279000
002800                                                 VALUE +10.       00280000
002810         05  FILLER              PIC S9(04)      COMP             00281000
002820                                                 VALUE +0.        00282000
002830         05  FILLER              PIC S9(04)      COMP             00283000
002840                                                 VALUE +0.        00284000
002850         05  FILLER              PIC X(02)       VALUE 'CD'.      00285000
002860         05  PDB-RPV120-MODEL-MASK                                00286000
002870                                 PIC X(01)       VALUE ' '.       00287000
002880         05  PDB-RPV120-MODEL-ERROR                               00288000
002890                                 PIC X(01)       VALUE ' '.       00289000
002900         05  PDB-RPV120-MODEL-VID                                 00290000
002910                                 PIC X(01)       VALUE 'D'.       00291000
002920         05  PDB-RPV120-MODEL-EL                                  00292000
002930                                 PIC X(01)       VALUE 'N'.       00293000
002940         05  PDB-RPV120-MODEL-DCHG                                00294000
002950                                 PIC X(01)       VALUE ' '.       00295000
002960         05  FILLER              PIC X(01)       VALUE ' '.       00296000
002970         05  PDB-RPV120-DESC                                      00297000
002980                                 PIC X(08)       VALUE 'DESC    '.00298000
002990         05  FILLER              PIC S9(04)      COMP             00299000
003000                                                 VALUE +20.       00300000
003010         05  FILLER              PIC S9(04)      COMP             00301000
003020                                                 VALUE +0.        00302000
003030         05  FILLER              PIC S9(04)      COMP             00303000
003040                                                 VALUE +0.        00304000
003050         05  FILLER              PIC X(02)       VALUE 'CD'.      00305000
003060         05  PDB-RPV120-DESC-MASK                                 00306000
003070                                 PIC X(01)       VALUE ' '.       00307000
003080         05  PDB-RPV120-DESC-ERROR                                00308000
003090                                 PIC X(01)       VALUE ' '.       00309000
003100         05  PDB-RPV120-DESC-VID                                  00310000
003110                                 PIC X(01)       VALUE 'D'.       00311000
003120         05  PDB-RPV120-DESC-EL                                   00312000
003130                                 PIC X(01)       VALUE 'N'.       00313000
003140         05  PDB-RPV120-DESC-DCHG                                 00314000
003150                                 PIC X(01)       VALUE ' '.       00315000
003160         05  FILLER              PIC X(01)       VALUE ' '.       00316000
003170         05  PDB-RPV120-SVCCHG                                    00317000
003180                                 PIC X(08)       VALUE 'SVCCHG  '.00318000
003190         05  FILLER              PIC S9(04)      COMP             00319000
003200                                                 VALUE +3.        00320000
003210         05  FILLER              PIC S9(04)      COMP             00321000
003220                                                 VALUE +0.        00322000
003230         05  FILLER              PIC S9(04)      COMP             00323000
003240                                                 VALUE +0.        00324000
003250         05  FILLER              PIC X(02)       VALUE 'CD'.      00325000
003260         05  PDB-RPV120-SVCCHG-MASK                               00326000
003270                                 PIC X(01)       VALUE ' '.       00327000
003280         05  PDB-RPV120-SVCCHG-ERROR                              00328000
003290                                 PIC X(01)       VALUE ' '.       00329000
003300         05  PDB-RPV120-SVCCHG-VID                                00330000
003310                                 PIC X(01)       VALUE 'D'.       00331000
003320         05  PDB-RPV120-SVCCHG-EL                                 00332000
003330                                 PIC X(01)       VALUE 'N'.       00333000
003340         05  PDB-RPV120-SVCCHG-DCHG                               00334000
003350                                 PIC X(01)       VALUE ' '.       00335000
003360         05  FILLER              PIC X(01)       VALUE ' '.       00336000
003370         05  PDB-RPV120-RATE                                      00337000
003380                                 PIC X(08)       VALUE 'RATE    '.00338000
003390         05  FILLER              PIC S9(04)      COMP             00339000
003400                                                 VALUE +3.        00340000
003410         05  FILLER              PIC S9(04)      COMP             00341000
003420                                                 VALUE +0.        00342000
003430         05  FILLER              PIC S9(04)      COMP             00343000
003440                                                 VALUE +0.        00344000
003450         05  FILLER              PIC X(02)       VALUE 'CD'.      00345000
003460         05  PDB-RPV120-RATE-MASK                                 00346000
003470                                 PIC X(01)       VALUE ' '.       00347000
003480         05  PDB-RPV120-RATE-ERROR                                00348000
003490                                 PIC X(01)       VALUE ' '.       00349000
003500         05  PDB-RPV120-RATE-VID                                  00350000
003510                                 PIC X(01)       VALUE 'D'.       00351000
003520         05  PDB-RPV120-RATE-EL                                   00352000
003530                                 PIC X(01)       VALUE 'N'.       00353000
003540         05  PDB-RPV120-RATE-DCHG                                 00354000
003550                                 PIC X(01)       VALUE ' '.       00355000
003560         05  FILLER              PIC X(01)       VALUE ' '.       00356000
003570         05  PDB-RPV120-STATUS                                    00357000
003580                                 PIC X(08)       VALUE 'STATUS  '.00358000
003590         05  FILLER              PIC S9(04)      COMP             00359000
003600                                                 VALUE +10.       00360000
003610         05  FILLER              PIC S9(04)      COMP             00361000
003620                                                 VALUE +0.        00362000
003630         05  FILLER              PIC S9(04)      COMP             00363000
003640                                                 VALUE +0.        00364000
003650         05  FILLER              PIC X(02)       VALUE 'CD'.      00365000
003660         05  PDB-RPV120-STATUS-MASK                               00366000
003670                                 PIC X(01)       VALUE ' '.       00367000
003680         05  PDB-RPV120-STATUS-ERROR                              00368000
003690                                 PIC X(01)       VALUE ' '.       00369000
003700         05  PDB-RPV120-STATUS-VID                                00370000
003710                                 PIC X(01)       VALUE 'D'.       00371000
003720         05  PDB-RPV120-STATUS-EL                                 00372000
003730                                 PIC X(01)       VALUE 'N'.       00373000
003740         05  PDB-RPV120-STATUS-DCHG                               00374000
003750                                 PIC X(01)       VALUE ' '.       00375000
003760         05  FILLER              PIC X(01)       VALUE ' '.       00376000
003770         05  PDB-RPV120-LEVTDT                                    00377000
003780                                 PIC X(08)       VALUE 'LEVTDT  '.00378000
003790         05  FILLER              PIC S9(04)      COMP             00379000
003800                                                 VALUE +10.       00380000
003810         05  FILLER              PIC S9(04)      COMP             00381000
003820                                                 VALUE +0.        00382000
003830         05  FILLER              PIC S9(04)      COMP             00383000
003840                                                 VALUE +0.        00384000
003850         05  FILLER              PIC X(02)       VALUE 'CD'.      00385000
003860         05  PDB-RPV120-LEVTDT-MASK                               00386000
003870                                 PIC X(01)       VALUE ' '.       00387000
003880         05  PDB-RPV120-LEVTDT-ERROR                              00388000
003890                                 PIC X(01)       VALUE ' '.       00389000
003900         05  PDB-RPV120-LEVTDT-VID                                00390000
003910                                 PIC X(01)       VALUE 'D'.       00391000
003920         05  PDB-RPV120-LEVTDT-EL                                 00392000
003930                                 PIC X(01)       VALUE 'N'.       00393000
003940         05  PDB-RPV120-LEVTDT-DCHG                               00394000
003950                                 PIC X(01)       VALUE ' '.       00395000
003960         05  FILLER              PIC X(01)       VALUE ' '.       00396000
003970         05  PDB-RPV120-MSGLINE                                   00397000
003980                                 PIC X(08)       VALUE 'MSGLINE '.00398000
003990         05  FILLER              PIC S9(04)      COMP             00399000
004000                                                 VALUE +78.       00400000
004010         05  FILLER              PIC S9(04)      COMP             00401000
004020                                                 VALUE +0.        00402000
004030         05  FILLER              PIC S9(04)      COMP             00403000
004040                                                 VALUE +0.        00404000
004050         05  FILLER              PIC X(02)       VALUE 'CD'.      00405000
004060         05  PDB-RPV120-MSGLINE-MASK                              00406000
004070                                 PIC X(01)       VALUE ' '.       00407000
004080         05  PDB-RPV120-MSGLINE-ERROR                             00408000
004090                                 PIC X(01)       VALUE ' '.       00409000
004100         05  PDB-RPV120-MSGLINE-VID                               00410000
004110                                 PIC X(01)       VALUE 'D'.       00411000
004120         05  PDB-RPV120-MSGLINE-EL                                00412000
004130                                 PIC X(01)       VALUE 'I'.       00413000
004140         05  PDB-RPV120-MSGLINE-DCHG                              00414000
004150                                 PIC X(01)       VALUE ' '.       00415000
004160         05  FILLER              PIC X(01)       VALUE ' '.       00416000
004170         05  PDB-RPV120-COMMAND                                   00417000
004180                                 PIC X(08)       VALUE 'COMMAND '.00418000
004190         05  FILLER              PIC S9(04)      COMP             00419000
004200                                                 VALUE +65.       00420000
004210         05  FILLER              PIC S9(04)      COMP             00421000
004220                                                 VALUE +0.        00422000
004230         05  FILLER              PIC S9(04)      COMP             00423000
004240                                                 VALUE +0.        00424000
004250         05  FILLER              PIC X(02)       VALUE 'CD'.      00425000
004260         05  PDB-RPV120-COMMAND-MASK                              00426000
004270                                 PIC X(01)       VALUE ' '.       00427000
004280         05  PDB-RPV120-COMMAND-ERROR                             00428000
004290                                 PIC X(01)       VALUE ' '.       00429000
004300         05  PDB-RPV120-COMMAND-VID                               00430000
004310                                 PIC X(01)       VALUE 'I'.       00431000
004320         05  PDB-RPV120-COMMAND-EL                                00432000
004330                                 PIC X(01)       VALUE 'O'.       00433000
004340         05  PDB-RPV120-COMMAND-DCHG                              00434000
004350                                 PIC X(01)       VALUE ' '.       00435000
004360         05  FILLER              PIC X(01)       VALUE ' '.       00436000
004370         05  PDB-RPV120-PFLINE1                                   00437000
004380                                 PIC X(08)       VALUE 'PFLINE1 '.00438000
004390         05  FILLER              PIC S9(04)      COMP             00439000
004400                                                 VALUE +78.       00440000
004410         05  FILLER              PIC S9(04)      COMP             00441000
004420                                                 VALUE +0.        00442000
004430         05  FILLER              PIC S9(04)      COMP             00443000
004440                                                 VALUE +0.        00444000
004450         05  FILLER              PIC X(02)       VALUE 'CD'.      00445000
004460         05  PDB-RPV120-PFLINE1-MASK                              00446000
004470                                 PIC X(01)       VALUE ' '.       00447000
004480         05  PDB-RPV120-PFLINE1-ERROR                             00448000
004490                                 PIC X(01)       VALUE ' '.       00449000
004500         05  PDB-RPV120-PFLINE1-VID                               00450000
004510                                 PIC X(01)       VALUE 'D'.       00451000
004520         05  PDB-RPV120-PFLINE1-EL                                00452000
004530                                 PIC X(01)       VALUE 'N'.       00453000
004540         05  PDB-RPV120-PFLINE1-DCHG                              00454000
004550                                 PIC X(01)       VALUE ' '.       00455000
004560         05  FILLER              PIC X(01)       VALUE ' '.       00456000
004570         05  PDB-RPV120-PFLINE2                                   00457000
004580                                 PIC X(08)       VALUE 'PFLINE2 '.00458000
004590         05  FILLER              PIC S9(04)      COMP             00459000
004600                                                 VALUE +78.       00460000
004610         05  FILLER              PIC S9(04)      COMP             00461000
004620                                                 VALUE +0.        00462000
004630         05  FILLER              PIC S9(04)      COMP             00463000
004640                                                 VALUE +0.        00464000
004650         05  FILLER              PIC X(02)       VALUE 'CD'.      00465000
004660         05  PDB-RPV120-PFLINE2-MASK                              00466000
004670                                 PIC X(01)       VALUE ' '.       00467000
004680         05  PDB-RPV120-PFLINE2-ERROR                             00468000
004690                                 PIC X(01)       VALUE ' '.       00469000
004700         05  PDB-RPV120-PFLINE2-VID                               00470000
004710                                 PIC X(01)       VALUE 'D'.       00471000
004720         05  PDB-RPV120-PFLINE2-EL                                00472000
004730                                 PIC X(01)       VALUE 'N'.       00473000
004740         05  PDB-RPV120-PFLINE2-DCHG                              00474000
004750                                 PIC X(01)       VALUE ' '.       00475000
004760         05  FILLER              PIC X(01)       VALUE ' '.       00476000
004770         05  FILLER              PIC X(08)       VALUE LOW-VALUE. 00477000
004780                                                                  00478000
004790 01  RPV120-PANL-DATA-AREA.                                       00479000
004800     03  RPV120-OPERID           PIC X(08).                       00480000
004810     03  RPV120-INST             PIC X(04).                       00481000
004820     03  RPV120-SYSDATE          PIC X(10).                       00482000
004830     03  RPV120-MORE             PIC X(05).                       00483000
004840     03  RPV120-MINUS            PIC X(01).                       00484000
004850     03  RPV120-PLUS             PIC X(01).                       00485000
004860     03  RPV120-PRODCD           PIC X(06).                       00486000
004870     03  RPV120-ACCOUNT          PIC X(18).                       00487000
004880     03  RPV120-REL              PIC X(10).                       00488000
004890     03  RPV120-INST1            PIC X(04).                       00489000
004900     03  RPV120-PRODCD1          PIC X(06).                       00490000
004910     03  RPV120-ACCT             PIC X(18).                       00491000
004920     03  RPV120-CUSTNA           PIC X(40).                       00492000
004930     03  RPV120-MODEL            PIC X(10).                       00493000
004940     03  RPV120-DESC             PIC X(20).                       00494000
004950     03  RPV120-SVCCHG           PIC X(03).                       00495000
004960     03  RPV120-RATE             PIC X(03).                       00496000
004970     03  RPV120-STATUS           PIC X(10).                       00497000
004980     03  RPV120-LEVTDT           PIC X(10).                       00498000
004990     03  RPV120-MSGLINE          PIC X(78).                       00499000
005000     03  RPV120-COMMAND          PIC X(65).                       00500000
005010     03  RPV120-PFLINE1          PIC X(78).                       00501000
005020     03  RPV120-PFLINE2          PIC X(78).                       00502000
005030 01  RPV120-ERROR-FIELD                                           00503000
005040                                 PIC X(08).                       00504000
005050 01  RPV120-SW-SET-CURSOR                                         00505000
005060                                 PIC X(01)       VALUE 'N'.       00506000
005070******************************************************************00507000
