000200*01  RPV350-PANL-DATA-BLOCK.                                      00000200
000300*----------------------------------------------------------------*00000300
000400*    RPV350W - PANEL DATA BLOCK/AREA                             *00000400
000500*----------------------------------------------------------------*00000500
000600     03  FILLER                  PIC X(08)       VALUE '**BPDB**'.00000600
000700     03  PDB-RPV350-NAME                                          00000700
000800                                 PIC X(08)       VALUE 'RPV350  '.00000800
000900     03  PDB-RPV350-STATUS.                                       00000900
001000         05  PDB-RPV350-KEY-CHG                                   00001000
001100                                 PIC X(01).                       00001100
001200         05  PDB-RPV350-DATA-CHG                                  00001200
001300                                 PIC X(01).                       00001300
001400         05  PDB-RPV350-CURR-OCC                                  00001400
001500                                 PIC S9(04)      COMP             00001500
001600                                                 VALUE +0.        00001600
001700     03  PDB-RPV350-FIELD-TABLE.                                  00001700
001800         05  PDB-RPV350-OPERID                                    00001800
001900                                 PIC X(08)       VALUE 'OPERID  '.00001900
002000         05  FILLER              PIC S9(04)      COMP             00002000
002100                                                 VALUE +8.        00002100
002200         05  FILLER              PIC S9(04)      COMP             00002200
002300                                                 VALUE +0.        00002300
002400         05  FILLER              PIC S9(04)      COMP             00002400
002500                                                 VALUE +0.        00002500
002600         05  FILLER              PIC X(02)       VALUE 'CD'.      00002600
002700         05  PDB-RPV350-OPERID-MASK                               00002700
002800                                 PIC X(01)       VALUE ' '.       00002800
002900         05  PDB-RPV350-OPERID-ERROR                              00002900
003000                                 PIC X(01)       VALUE ' '.       00003000
003100         05  PDB-RPV350-OPERID-VID                                00003100
003200                                 PIC X(01)       VALUE 'D'.       00003200
003300         05  PDB-RPV350-OPERID-EL                                 00003300
003400                                 PIC X(01)       VALUE 'N'.       00003400
003500         05  PDB-RPV350-OPERID-DCHG                               00003500
003600                                 PIC X(01)       VALUE ' '.       00003600
003700         05  FILLER              PIC X(01)       VALUE ' '.       00003700
003800         05  PDB-RPV350-INST                                      00003800
003900                                 PIC X(08)       VALUE 'INST    '.00003900
004000         05  FILLER              PIC S9(04)      COMP             00004000
004100                                                 VALUE +4.        00004100
004200         05  FILLER              PIC S9(04)      COMP             00004200
004300                                                 VALUE +0.        00004300
004400         05  FILLER              PIC S9(04)      COMP             00004400
004500                                                 VALUE +0.        00004500
004600         05  FILLER              PIC X(02)       VALUE 'CD'.      00004600
004700         05  PDB-RPV350-INST-MASK                                 00004700
004800                                 PIC X(01)       VALUE ' '.       00004800
004900         05  PDB-RPV350-INST-ERROR                                00004900
005000                                 PIC X(01)       VALUE ' '.       00005000
005100         05  PDB-RPV350-INST-VID                                  00005100
005200                                 PIC X(01)       VALUE 'D'.       00005200
005300         05  PDB-RPV350-INST-EL                                   00005300
005400                                 PIC X(01)       VALUE 'N'.       00005400
005500         05  PDB-RPV350-INST-DCHG                                 00005500
005600                                 PIC X(01)       VALUE ' '.       00005600
005700         05  FILLER              PIC X(01)       VALUE ' '.       00005700
005800         05  PDB-RPV350-SYSDATE                                   00005800
005900                                 PIC X(08)       VALUE 'SYSDATE '.00005900
006000         05  FILLER              PIC S9(04)      COMP             00006000
006100                                                 VALUE +10.       00006100
006200         05  FILLER              PIC S9(04)      COMP             00006200
006300                                                 VALUE +0.        00006300
006400         05  FILLER              PIC S9(04)      COMP             00006400
006500                                                 VALUE +0.        00006500
006600         05  FILLER              PIC X(02)       VALUE 'CD'.      00006600
006700         05  PDB-RPV350-SYSDATE-MASK                              00006700
006800                                 PIC X(01)       VALUE ' '.       00006800
006900         05  PDB-RPV350-SYSDATE-ERROR                             00006900
007000                                 PIC X(01)       VALUE ' '.       00007000
007100         05  PDB-RPV350-SYSDATE-VID                               00007100
007200                                 PIC X(01)       VALUE 'D'.       00007200
007300         05  PDB-RPV350-SYSDATE-EL                                00007300
007400                                 PIC X(01)       VALUE 'N'.       00007400
007500         05  PDB-RPV350-SYSDATE-DCHG                              00007500
007600                                 PIC X(01)       VALUE ' '.       00007600
007700         05  FILLER              PIC X(01)       VALUE ' '.       00007700
007800         05  PDB-RPV350-PRODCD                                    00007800
007900                                 PIC X(08)       VALUE 'PRODCD  '.00007900
008000         05  FILLER              PIC S9(04)      COMP             00008000
008100                                                 VALUE +6.        00008100
008200         05  FILLER              PIC S9(04)      COMP             00008200
008300                                                 VALUE +0.        00008300
008400         05  FILLER              PIC S9(04)      COMP             00008400
008500                                                 VALUE +0.        00008500
008600         05  FILLER              PIC X(02)       VALUE 'CD'.      00008600
008700         05  PDB-RPV350-PRODCD-MASK                               00008700
008800                                 PIC X(01)       VALUE ' '.       00008800
008900         05  PDB-RPV350-PRODCD-ERROR                              00008900
009000                                 PIC X(01)       VALUE ' '.       00009000
009100         05  PDB-RPV350-PRODCD-VID                                00009100
009200                                 PIC X(01)       VALUE 'D'.       00009200
009300         05  PDB-RPV350-PRODCD-EL                                 00009300
009400                                 PIC X(01)       VALUE 'N'.       00009400
009500         05  PDB-RPV350-PRODCD-DCHG                               00009500
009600                                 PIC X(01)       VALUE ' '.       00009600
009700         05  FILLER              PIC X(01)       VALUE ' '.       00009700
009800         05  PDB-RPV350-ACCOUNT                                   00009800
009900                                 PIC X(08)       VALUE 'ACCOUNT '.00009900
010000         05  FILLER              PIC S9(04)      COMP             00010000
010100                                                 VALUE +18.       00010100
010200         05  FILLER              PIC S9(04)      COMP             00010200
010300                                                 VALUE +0.        00010300
010400         05  FILLER              PIC S9(04)      COMP             00010400
010500                                                 VALUE +0.        00010500
010600         05  FILLER              PIC X(02)       VALUE 'CD'.      00010600
010700         05  PDB-RPV350-ACCOUNT-MASK                              00010700
010800                                 PIC X(01)       VALUE ' '.       00010800
010900         05  PDB-RPV350-ACCOUNT-ERROR                             00010900
011000                                 PIC X(01)       VALUE ' '.       00011000
011100         05  PDB-RPV350-ACCOUNT-VID                               00011100
011200                                 PIC X(01)       VALUE 'D'.       00011200
011300         05  PDB-RPV350-ACCOUNT-EL                                00011300
011400                                 PIC X(01)       VALUE 'N'.       00011400
011500         05  PDB-RPV350-ACCOUNT-DCHG                              00011500
011600                                 PIC X(01)       VALUE ' '.       00011600
011700         05  FILLER              PIC X(01)       VALUE ' '.       00011700
011800         05  PDB-RPV350-CUSTNA                                    00011800
011900                                 PIC X(08)       VALUE 'CUSTNA  '.00011900
012000         05  FILLER              PIC S9(04)      COMP             00012000
012100                                                 VALUE +40.       00012100
012200         05  FILLER              PIC S9(04)      COMP             00012200
012300                                                 VALUE +0.        00012300
012400         05  FILLER              PIC S9(04)      COMP             00012400
012500                                                 VALUE +0.        00012500
012600         05  FILLER              PIC X(02)       VALUE 'CD'.      00012600
012700         05  PDB-RPV350-CUSTNA-MASK                               00012700
012800                                 PIC X(01)       VALUE ' '.       00012800
012900         05  PDB-RPV350-CUSTNA-ERROR                              00012900
013000                                 PIC X(01)       VALUE ' '.       00013000
013100         05  PDB-RPV350-CUSTNA-VID                                00013100
013200                                 PIC X(01)       VALUE 'D'.       00013200
013300         05  PDB-RPV350-CUSTNA-EL                                 00013300
013400                                 PIC X(01)       VALUE 'N'.       00013400
013500         05  PDB-RPV350-CUSTNA-DCHG                               00013500
013600                                 PIC X(01)       VALUE ' '.       00013600
013700         05  FILLER              PIC X(01)       VALUE ' '.       00013700
013800         05  PDB-RPV350-MODEL                                     00013800
013900                                 PIC X(08)       VALUE 'MODEL   '.00013900
014000         05  FILLER              PIC S9(04)      COMP             00014000
014100                                                 VALUE +10.       00014100
014200         05  FILLER              PIC S9(04)      COMP             00014200
014300                                                 VALUE +0.        00014300
014400         05  FILLER              PIC S9(04)      COMP             00014400
014500                                                 VALUE +0.        00014500
014600         05  FILLER              PIC X(02)       VALUE 'CD'.      00014600
014700         05  PDB-RPV350-MODEL-MASK                                00014700
014800                                 PIC X(01)       VALUE ' '.       00014800
014900         05  PDB-RPV350-MODEL-ERROR                               00014900
015000                                 PIC X(01)       VALUE ' '.       00015000
015100         05  PDB-RPV350-MODEL-VID                                 00015100
015200                                 PIC X(01)       VALUE 'D'.       00015200
015300         05  PDB-RPV350-MODEL-EL                                  00015300
015400                                 PIC X(01)       VALUE 'N'.       00015400
015500         05  PDB-RPV350-MODEL-DCHG                                00015500
015600                                 PIC X(01)       VALUE ' '.       00015600
015700         05  FILLER              PIC X(01)       VALUE ' '.       00015700
015800         05  PDB-RPV350-MODDESC                                   00015800
015900                                 PIC X(08)       VALUE 'MODDESC '.00015900
016000         05  FILLER              PIC S9(04)      COMP             00016000
016100                                                 VALUE +20.       00016100
016200         05  FILLER              PIC S9(04)      COMP             00016200
016300                                                 VALUE +0.        00016300
016400         05  FILLER              PIC S9(04)      COMP             00016400
016500                                                 VALUE +0.        00016500
016600         05  FILLER              PIC X(02)       VALUE 'CD'.      00016600
016700         05  PDB-RPV350-MODDESC-MASK                              00016700
016800                                 PIC X(01)       VALUE ' '.       00016800
016900         05  PDB-RPV350-MODDESC-ERROR                             00016900
017000                                 PIC X(01)       VALUE ' '.       00017000
017100         05  PDB-RPV350-MODDESC-VID                               00017100
017200                                 PIC X(01)       VALUE 'D'.       00017200
017300         05  PDB-RPV350-MODDESC-EL                                00017300
017400                                 PIC X(01)       VALUE 'N'.       00017400
017500         05  PDB-RPV350-MODDESC-DCHG                              00017500
017600                                 PIC X(01)       VALUE ' '.       00017600
017700         05  FILLER              PIC X(01)       VALUE ' '.       00017700
017800         05  PDB-RPV350-IDNBR                                     00017800
017900                                 PIC X(08)       VALUE 'IDNBR   '.00017900
018000         05  FILLER              PIC S9(04)      COMP             00018000
018100                                                 VALUE +18.       00018100
018200         05  FILLER              PIC S9(04)      COMP             00018200
018300                                                 VALUE +0.        00018300
018400         05  FILLER              PIC S9(04)      COMP             00018400
018500                                                 VALUE +0.        00018500
018600         05  FILLER              PIC X(02)       VALUE 'CD'.      00018600
018700         05  PDB-RPV350-IDNBR-MASK                                00018700
018800                                 PIC X(01)       VALUE ' '.       00018800
018900         05  PDB-RPV350-IDNBR-ERROR                               00018900
019000                                 PIC X(01)       VALUE ' '.       00019000
019100         05  PDB-RPV350-IDNBR-VID                                 00019100
019200                                 PIC X(01)       VALUE 'D'.       00019200
019300         05  PDB-RPV350-IDNBR-EL                                  00019300
019400                                 PIC X(01)       VALUE 'N'.       00019400
019500         05  PDB-RPV350-IDNBR-DCHG                                00019500
019600                                 PIC X(01)       VALUE ' '.       00019600
019700         05  FILLER              PIC X(01)       VALUE ' '.       00019700
019800         05  PDB-RPV350-STATUS                                    00019800
019900                                 PIC X(08)       VALUE 'STATUS  '.00019900
020000         05  FILLER              PIC S9(04)      COMP             00020000
020100                                                 VALUE +8.        00020100
020200         05  FILLER              PIC S9(04)      COMP             00020200
020300                                                 VALUE +0.        00020300
020400         05  FILLER              PIC S9(04)      COMP             00020400
020500                                                 VALUE +0.        00020500
020600         05  FILLER              PIC X(02)       VALUE 'CD'.      00020600
020700         05  PDB-RPV350-STATUS-MASK                               00020700
020800                                 PIC X(01)       VALUE ' '.       00020800
020900         05  PDB-RPV350-STATUS-ERROR                              00020900
021000                                 PIC X(01)       VALUE ' '.       00021000
021100         05  PDB-RPV350-STATUS-VID                                00021100
021200                                 PIC X(01)       VALUE 'D'.       00021200
021300         05  PDB-RPV350-STATUS-EL                                 00021300
021400                                 PIC X(01)       VALUE 'N'.       00021400
021500         05  PDB-RPV350-STATUS-DCHG                               00021500
021600                                 PIC X(01)       VALUE ' '.       00021600
021700         05  FILLER              PIC X(01)       VALUE ' '.       00021700
021800         05  PDB-RPV350-ADDINST                                   00021800
021900                                 PIC X(08)       VALUE 'ADDINST '.00021900
022000         05  FILLER              PIC S9(04)      COMP             00022000
022100                                                 VALUE +4.        00022100
022200         05  FILLER              PIC S9(04)      COMP             00022200
022300                                                 VALUE +0.        00022300
022400         05  FILLER              PIC S9(04)      COMP             00022400
022500                                                 VALUE +0.        00022500
022600         05  FILLER              PIC X(02)       VALUE 'CD'.      00022600
022700         05  PDB-RPV350-ADDINST-MASK                              00022700
022800                                 PIC X(01)       VALUE ' '.       00022800
022900         05  PDB-RPV350-ADDINST-ERROR                             00022900
023000                                 PIC X(01)       VALUE ' '.       00023000
023100         05  PDB-RPV350-ADDINST-VID                               00023100
023200                                 PIC X(01)       VALUE 'I'.       00023200
023300         05  PDB-RPV350-ADDINST-EL                                00023300
023400                                 PIC X(01)       VALUE 'O'.       00023400
023500         05  PDB-RPV350-ADDINST-DCHG                              00023500
023600                                 PIC X(01)       VALUE ' '.       00023600
023700         05  FILLER              PIC X(01)       VALUE ' '.       00023700
023800         05  PDB-RPV350-ADDPROD                                   00023800
023900                                 PIC X(08)       VALUE 'ADDPROD '.00023900
024000         05  FILLER              PIC S9(04)      COMP             00024000
024100                                                 VALUE +6.        00024100
024200         05  FILLER              PIC S9(04)      COMP             00024200
024300                                                 VALUE +0.        00024300
024400         05  FILLER              PIC S9(04)      COMP             00024400
024500                                                 VALUE +0.        00024500
024600         05  FILLER              PIC X(02)       VALUE 'CD'.      00024600
024700         05  PDB-RPV350-ADDPROD-MASK                              00024700
024800                                 PIC X(01)       VALUE ' '.       00024800
024900         05  PDB-RPV350-ADDPROD-ERROR                             00024900
025000                                 PIC X(01)       VALUE ' '.       00025000
025100         05  PDB-RPV350-ADDPROD-VID                               00025100
025200                                 PIC X(01)       VALUE 'I'.       00025200
025300         05  PDB-RPV350-ADDPROD-EL                                00025300
025400                                 PIC X(01)       VALUE 'O'.       00025400
025500         05  PDB-RPV350-ADDPROD-DCHG                              00025500
025600                                 PIC X(01)       VALUE ' '.       00025600
025700         05  FILLER              PIC X(01)       VALUE ' '.       00025700
025800         05  PDB-RPV350-ADDACCT                                   00025800
025900                                 PIC X(08)       VALUE 'ADDACCT '.00025900
026000         05  FILLER              PIC S9(04)      COMP             00026000
026100                                                 VALUE +18.       00026100
026200         05  FILLER              PIC S9(04)      COMP             00026200
026300                                                 VALUE +0.        00026300
026400         05  FILLER              PIC S9(04)      COMP             00026400
026500                                                 VALUE +0.        00026500
026600         05  FILLER              PIC X(02)       VALUE 'CD'.      00026600
026700         05  PDB-RPV350-ADDACCT-MASK                              00026700
026800                                 PIC X(01)       VALUE ' '.       00026800
026900         05  PDB-RPV350-ADDACCT-ERROR                             00026900
027000                                 PIC X(01)       VALUE ' '.       00027000
027100         05  PDB-RPV350-ADDACCT-VID                               00027100
027200                                 PIC X(01)       VALUE 'I'.       00027200
027300         05  PDB-RPV350-ADDACCT-EL                                00027300
027400                                 PIC X(01)       VALUE 'O'.       00027400
027500         05  PDB-RPV350-ADDACCT-DCHG                              00027500
027600                                 PIC X(01)       VALUE ' '.       00027600
027700         05  FILLER              PIC X(01)       VALUE ' '.       00027700
027800         05  PDB-RPV350-MSGLINE                                   00027800
027900                                 PIC X(08)       VALUE 'MSGLINE '.00027900
028000         05  FILLER              PIC S9(04)      COMP             00028000
028100                                                 VALUE +78.       00028100
028200         05  FILLER              PIC S9(04)      COMP             00028200
028300                                                 VALUE +0.        00028300
028400         05  FILLER              PIC S9(04)      COMP             00028400
028500                                                 VALUE +0.        00028500
028600         05  FILLER              PIC X(02)       VALUE 'CD'.      00028600
028700         05  PDB-RPV350-MSGLINE-MASK                              00028700
028800                                 PIC X(01)       VALUE ' '.       00028800
028900         05  PDB-RPV350-MSGLINE-ERROR                             00028900
029000                                 PIC X(01)       VALUE ' '.       00029000
029100         05  PDB-RPV350-MSGLINE-VID                               00029100
029200                                 PIC X(01)       VALUE 'D'.       00029200
029300         05  PDB-RPV350-MSGLINE-EL                                00029300
029400                                 PIC X(01)       VALUE 'I'.       00029400
029500         05  PDB-RPV350-MSGLINE-DCHG                              00029500
029600                                 PIC X(01)       VALUE ' '.       00029600
029700         05  FILLER              PIC X(01)       VALUE ' '.       00029700
029800         05  PDB-RPV350-COMMAND                                   00029800
029900                                 PIC X(08)       VALUE 'COMMAND '.00029900
030000         05  FILLER              PIC S9(04)      COMP             00030000
030100                                                 VALUE +65.       00030100
030200         05  FILLER              PIC S9(04)      COMP             00030200
030300                                                 VALUE +0.        00030300
030400         05  FILLER              PIC S9(04)      COMP             00030400
030500                                                 VALUE +0.        00030500
030600         05  FILLER              PIC X(02)       VALUE 'CD'.      00030600
030700         05  PDB-RPV350-COMMAND-MASK                              00030700
030800                                 PIC X(01)       VALUE ' '.       00030800
030900         05  PDB-RPV350-COMMAND-ERROR                             00030900
031000                                 PIC X(01)       VALUE ' '.       00031000
031100         05  PDB-RPV350-COMMAND-VID                               00031100
031200                                 PIC X(01)       VALUE 'I'.       00031200
031300         05  PDB-RPV350-COMMAND-EL                                00031300
031400                                 PIC X(01)       VALUE 'O'.       00031400
031500         05  PDB-RPV350-COMMAND-DCHG                              00031500
031600                                 PIC X(01)       VALUE ' '.       00031600
031700         05  FILLER              PIC X(01)       VALUE ' '.       00031700
031800         05  PDB-RPV350-PFLINE1                                   00031800
031900                                 PIC X(08)       VALUE 'PFLINE1 '.00031900
032000         05  FILLER              PIC S9(04)      COMP             00032000
032100                                                 VALUE +78.       00032100
032200         05  FILLER              PIC S9(04)      COMP             00032200
032300                                                 VALUE +0.        00032300
032400         05  FILLER              PIC S9(04)      COMP             00032400
032500                                                 VALUE +0.        00032500
032600         05  FILLER              PIC X(02)       VALUE 'CD'.      00032600
032700         05  PDB-RPV350-PFLINE1-MASK                              00032700
032800                                 PIC X(01)       VALUE ' '.       00032800
032900         05  PDB-RPV350-PFLINE1-ERROR                             00032900
033000                                 PIC X(01)       VALUE ' '.       00033000
033100         05  PDB-RPV350-PFLINE1-VID                               00033100
033200                                 PIC X(01)       VALUE 'D'.       00033200
033300         05  PDB-RPV350-PFLINE1-EL                                00033300
033400                                 PIC X(01)       VALUE 'N'.       00033400
033500         05  PDB-RPV350-PFLINE1-DCHG                              00033500
033600                                 PIC X(01)       VALUE ' '.       00033600
033700         05  FILLER              PIC X(01)       VALUE ' '.       00033700
033800         05  PDB-RPV350-PFLINE2                                   00033800
033900                                 PIC X(08)       VALUE 'PFLINE2 '.00033900
034000         05  FILLER              PIC S9(04)      COMP             00034000
034100                                                 VALUE +78.       00034100
034200         05  FILLER              PIC S9(04)      COMP             00034200
034300                                                 VALUE +0.        00034300
034400         05  FILLER              PIC S9(04)      COMP             00034400
034500                                                 VALUE +0.        00034500
034600         05  FILLER              PIC X(02)       VALUE 'CD'.      00034600
034700         05  PDB-RPV350-PFLINE2-MASK                              00034700
034800                                 PIC X(01)       VALUE ' '.       00034800
034900         05  PDB-RPV350-PFLINE2-ERROR                             00034900
035000                                 PIC X(01)       VALUE ' '.       00035000
035100         05  PDB-RPV350-PFLINE2-VID                               00035100
035200                                 PIC X(01)       VALUE 'D'.       00035200
035300         05  PDB-RPV350-PFLINE2-EL                                00035300
035400                                 PIC X(01)       VALUE 'N'.       00035400
035500         05  PDB-RPV350-PFLINE2-DCHG                              00035500
035600                                 PIC X(01)       VALUE ' '.       00035600
035700         05  FILLER              PIC X(01)       VALUE ' '.       00035700
035800         05  FILLER              PIC X(08)       VALUE LOW-VALUE. 00035800
035900                                                                  00035900
036000 01  RPV350-PANL-DATA-AREA.                                       00036000
036100     03  RPV350-OPERID           PIC X(08).                       00036100
036200     03  RPV350-INST             PIC X(04).                       00036200
036300     03  RPV350-SYSDATE          PIC X(10).                       00036300
036400     03  RPV350-PRODCD           PIC X(06).                       00036400
036500     03  RPV350-ACCOUNT          PIC X(18).                       00036500
036600     03  RPV350-CUSTNA           PIC X(40).                       00036600
036700     03  RPV350-MODEL            PIC X(10).                       00036700
036800     03  RPV350-MODDESC          PIC X(20).                       00036800
036900     03  RPV350-IDNBR            PIC X(18).                       00036900
037000     03  RPV350-STATUS           PIC X(08).                       00037000
037100     03  RPV350-ADDINST          PIC X(04).                       00037100
037200     03  RPV350-ADDPROD          PIC X(06).                       00037200
037300     03  RPV350-ADDACCT          PIC X(18).                       00037300
037400     03  RPV350-MSGLINE          PIC X(78).                       00037400
037500     03  RPV350-COMMAND          PIC X(65).                       00037500
037600     03  RPV350-PFLINE1          PIC X(78).                       00037600
037700     03  RPV350-PFLINE2          PIC X(78).                       00037700
037800 01  RPV350-ERROR-FIELD                                           00037800
037900                                 PIC X(08).                       00037900
038000 01  RPV350-SW-SET-CURSOR                                         00038000
038100                                 PIC X(01)       VALUE 'N'.       00038100
038200******************************************************************00038200
