000200*01  RPV310K-PANL-DATA-BLOCK.                                     00000200
000300*----------------------------------------------------------------*00000300
000400*    RPV310KW - PANEL DATA BLOCK/AREA                            *00000400
000500*----------------------------------------------------------------*00000500
000600     03  FILLER                  PIC X(08)       VALUE '**BPDB**'.00000600
000700     03  PDB-RPV310K-NAME                                         00000700
000800                                 PIC X(08)       VALUE 'RPV310K '.00000800
000900     03  PDB-RPV310K-STATUS.                                      00000900
001000         05  PDB-RPV310K-KEY-CHG                                  00001000
001100                                 PIC X(01).                       00001100
001200         05  PDB-RPV310K-DATA-CHG                                 00001200
001300                                 PIC X(01).                       00001300
001400         05  PDB-RPV310K-CURR-OCC                                 00001400
001500                                 PIC S9(04)      COMP             00001500
001600                                                 VALUE +0.        00001600
001700     03  PDB-RPV310K-FIELD-TABLE.                                 00001700
001800         05  PDB-RPV310K-OPERID                                   00001800
001900                                 PIC X(08)       VALUE 'OPERID  '.00001900
002000         05  FILLER              PIC S9(04)      COMP             00002000
002100                                                 VALUE +8.        00002100
002200         05  FILLER              PIC S9(04)      COMP             00002200
002300                                                 VALUE +0.        00002300
002400         05  FILLER              PIC S9(04)      COMP             00002400
002500                                                 VALUE +0.        00002500
002600         05  FILLER              PIC X(02)       VALUE 'CD'.      00002600
002700         05  PDB-RPV310K-OPERID-MASK                              00002700
002800                                 PIC X(01)       VALUE ' '.       00002800
002900         05  PDB-RPV310K-OPERID-ERROR                             00002900
003000                                 PIC X(01)       VALUE ' '.       00003000
003100         05  PDB-RPV310K-OPERID-VID                               00003100
003200                                 PIC X(01)       VALUE 'D'.       00003200
003300         05  PDB-RPV310K-OPERID-EL                                00003300
003400                                 PIC X(01)       VALUE 'N'.       00003400
003500         05  PDB-RPV310K-OPERID-DCHG                              00003500
003600                                 PIC X(01)       VALUE ' '.       00003600
003700         05  FILLER              PIC X(01)       VALUE ' '.       00003700
003800         05  PDB-RPV310K-INST                                     00003800
003900                                 PIC X(08)       VALUE 'INST    '.00003900
004000         05  FILLER              PIC S9(04)      COMP             00004000
004100                                                 VALUE +4.        00004100
004200         05  FILLER              PIC S9(04)      COMP             00004200
004300                                                 VALUE +0.        00004300
004400         05  FILLER              PIC S9(04)      COMP             00004400
004500                                                 VALUE +0.        00004500
004600         05  FILLER              PIC X(02)       VALUE 'CD'.      00004600
004700         05  PDB-RPV310K-INST-MASK                                00004700
004800                                 PIC X(01)       VALUE ' '.       00004800
004900         05  PDB-RPV310K-INST-ERROR                               00004900
005000                                 PIC X(01)       VALUE ' '.       00005000
005100         05  PDB-RPV310K-INST-VID                                 00005100
005200                                 PIC X(01)       VALUE 'D'.       00005200
005300         05  PDB-RPV310K-INST-EL                                  00005300
005400                                 PIC X(01)       VALUE 'N'.       00005400
005500         05  PDB-RPV310K-INST-DCHG                                00005500
005600                                 PIC X(01)       VALUE ' '.       00005600
005700         05  FILLER              PIC X(01)       VALUE ' '.       00005700
005800         05  PDB-RPV310K-SYSDATE                                  00005800
005900                                 PIC X(08)       VALUE 'SYSDATE '.00005900
006000         05  FILLER              PIC S9(04)      COMP             00006000
006100                                                 VALUE +10.       00006100
006200         05  FILLER              PIC S9(04)      COMP             00006200
006300                                                 VALUE +0.        00006300
006400         05  FILLER              PIC S9(04)      COMP             00006400
006500                                                 VALUE +0.        00006500
006600         05  FILLER              PIC X(02)       VALUE 'CD'.      00006600
006700         05  PDB-RPV310K-SYSDATE-MASK                             00006700
006800                                 PIC X(01)       VALUE ' '.       00006800
006900         05  PDB-RPV310K-SYSDATE-ERROR                            00006900
007000                                 PIC X(01)       VALUE ' '.       00007000
007100         05  PDB-RPV310K-SYSDATE-VID                              00007100
007200                                 PIC X(01)       VALUE 'D'.       00007200
007300         05  PDB-RPV310K-SYSDATE-EL                               00007300
007400                                 PIC X(01)       VALUE 'N'.       00007400
007500         05  PDB-RPV310K-SYSDATE-DCHG                             00007500
007600                                 PIC X(01)       VALUE ' '.       00007600
007700         05  FILLER              PIC X(01)       VALUE ' '.       00007700
007800         05  PDB-RPV310K-PRODCD                                   00007800
007900                                 PIC X(08)       VALUE 'PRODCD  '.00007900
008000         05  FILLER              PIC S9(04)      COMP             00008000
008100                                                 VALUE +6.        00008100
008200         05  FILLER              PIC S9(04)      COMP             00008200
008300                                                 VALUE +0.        00008300
008400         05  FILLER              PIC S9(04)      COMP             00008400
008500                                                 VALUE +0.        00008500
008600         05  FILLER              PIC X(02)       VALUE 'CD'.      00008600
008700         05  PDB-RPV310K-PRODCD-MASK                              00008700
008800                                 PIC X(01)       VALUE ' '.       00008800
008900         05  PDB-RPV310K-PRODCD-ERROR                             00008900
009000                                 PIC X(01)       VALUE ' '.       00009000
009100         05  PDB-RPV310K-PRODCD-VID                               00009100
009200                                 PIC X(01)       VALUE 'E'.       00009200
009300         05  PDB-RPV310K-PRODCD-EL                                00009300
009400                                 PIC X(01)       VALUE 'E'.       00009400
009500         05  PDB-RPV310K-PRODCD-DCHG                              00009500
009600                                 PIC X(01)       VALUE ' '.       00009600
009700         05  FILLER              PIC X(01)       VALUE ' '.       00009700
009800         05  PDB-RPV310K-ACCOUNT                                  00009800
009900                                 PIC X(08)       VALUE 'ACCOUNT '.00009900
010000         05  FILLER              PIC S9(04)      COMP             00010000
010100                                                 VALUE +18.       00010100
010200         05  FILLER              PIC S9(04)      COMP             00010200
010300                                                 VALUE +0.        00010300
010400         05  FILLER              PIC S9(04)      COMP             00010400
010500                                                 VALUE +0.        00010500
010600         05  FILLER              PIC X(02)       VALUE 'CD'.      00010600
010700         05  PDB-RPV310K-ACCOUNT-MASK                             00010700
010800                                 PIC X(01)       VALUE ' '.       00010800
010900         05  PDB-RPV310K-ACCOUNT-ERROR                            00010900
011000                                 PIC X(01)       VALUE ' '.       00011000
011100         05  PDB-RPV310K-ACCOUNT-VID                              00011100
011200                                 PIC X(01)       VALUE 'E'.       00011200
011300         05  PDB-RPV310K-ACCOUNT-EL                               00011300
011400                                 PIC X(01)       VALUE 'E'.       00011400
011500         05  PDB-RPV310K-ACCOUNT-DCHG                             00011500
011600                                 PIC X(01)       VALUE ' '.       00011600
011700         05  FILLER              PIC X(01)       VALUE ' '.       00011700
011800         05  PDB-RPV310K-MODEL                                    00011800
011900                                 PIC X(08)       VALUE 'MODEL   '.00011900
012000         05  FILLER              PIC S9(04)      COMP             00012000
012100                                                 VALUE +10.       00012100
012200         05  FILLER              PIC S9(04)      COMP             00012200
012300                                                 VALUE +0.        00012300
012400         05  FILLER              PIC S9(04)      COMP             00012400
012500                                                 VALUE +0.        00012500
012600         05  FILLER              PIC X(02)       VALUE 'CD'.      00012600
012700         05  PDB-RPV310K-MODEL-MASK                               00012700
012800                                 PIC X(01)       VALUE ' '.       00012800
012900         05  PDB-RPV310K-MODEL-ERROR                              00012900
013000                                 PIC X(01)       VALUE ' '.       00013000
013100         05  PDB-RPV310K-MODEL-VID                                00013100
013200                                 PIC X(01)       VALUE 'E'.       00013200
013300         05  PDB-RPV310K-MODEL-EL                                 00013300
013400                                 PIC X(01)       VALUE 'E'.       00013400
013500         05  PDB-RPV310K-MODEL-DCHG                               00013500
013600                                 PIC X(01)       VALUE ' '.       00013600
013700         05  FILLER              PIC X(01)       VALUE ' '.       00013700
013800         05  PDB-RPV310K-IDNBR                                    00013800
013900                                 PIC X(08)       VALUE 'IDNBR   '.00013900
014000         05  FILLER              PIC S9(04)      COMP             00014000
014100                                                 VALUE +18.       00014100
014200         05  FILLER              PIC S9(04)      COMP             00014200
014300                                                 VALUE +0.        00014300
014400         05  FILLER              PIC S9(04)      COMP             00014400
014500                                                 VALUE +0.        00014500
014600         05  FILLER              PIC X(02)       VALUE 'CD'.      00014600
014700         05  PDB-RPV310K-IDNBR-MASK                               00014700
014800                                 PIC X(01)       VALUE ' '.       00014800
014900         05  PDB-RPV310K-IDNBR-ERROR                              00014900
015000                                 PIC X(01)       VALUE ' '.       00015000
015100         05  PDB-RPV310K-IDNBR-VID                                00015100
015200                                 PIC X(01)       VALUE 'E'.       00015200
015300         05  PDB-RPV310K-IDNBR-EL                                 00015300
015400                                 PIC X(01)       VALUE 'E'.       00015400
015500         05  PDB-RPV310K-IDNBR-DCHG                               00015500
015600                                 PIC X(01)       VALUE ' '.       00015600
015700         05  FILLER              PIC X(01)       VALUE ' '.       00015700
015800         05  PDB-RPV310K-MSGLINE                                  00015800
015900                                 PIC X(08)       VALUE 'MSGLINE '.00015900
016000         05  FILLER              PIC S9(04)      COMP             00016000
016100                                                 VALUE +78.       00016100
016200         05  FILLER              PIC S9(04)      COMP             00016200
016300                                                 VALUE +0.        00016300
016400         05  FILLER              PIC S9(04)      COMP             00016400
016500                                                 VALUE +0.        00016500
016600         05  FILLER              PIC X(02)       VALUE 'CD'.      00016600
016700         05  PDB-RPV310K-MSGLINE-MASK                             00016700
016800                                 PIC X(01)       VALUE ' '.       00016800
016900         05  PDB-RPV310K-MSGLINE-ERROR                            00016900
017000                                 PIC X(01)       VALUE ' '.       00017000
017100         05  PDB-RPV310K-MSGLINE-VID                              00017100
017200                                 PIC X(01)       VALUE 'D'.       00017200
017300         05  PDB-RPV310K-MSGLINE-EL                               00017300
017400                                 PIC X(01)       VALUE 'I'.       00017400
017500         05  PDB-RPV310K-MSGLINE-DCHG                             00017500
017600                                 PIC X(01)       VALUE ' '.       00017600
017700         05  FILLER              PIC X(01)       VALUE ' '.       00017700
017800         05  PDB-RPV310K-COMMAND                                  00017800
017900                                 PIC X(08)       VALUE 'COMMAND '.00017900
018000         05  FILLER              PIC S9(04)      COMP             00018000
018100                                                 VALUE +65.       00018100
018200         05  FILLER              PIC S9(04)      COMP             00018200
018300                                                 VALUE +0.        00018300
018400         05  FILLER              PIC S9(04)      COMP             00018400
018500                                                 VALUE +0.        00018500
018600         05  FILLER              PIC X(02)       VALUE 'CD'.      00018600
018700         05  PDB-RPV310K-COMMAND-MASK                             00018700
018800                                 PIC X(01)       VALUE ' '.       00018800
018900         05  PDB-RPV310K-COMMAND-ERROR                            00018900
019000                                 PIC X(01)       VALUE ' '.       00019000
019100         05  PDB-RPV310K-COMMAND-VID                              00019100
019200                                 PIC X(01)       VALUE 'I'.       00019200
019300         05  PDB-RPV310K-COMMAND-EL                               00019300
019400                                 PIC X(01)       VALUE 'O'.       00019400
019500         05  PDB-RPV310K-COMMAND-DCHG                             00019500
019600                                 PIC X(01)       VALUE ' '.       00019600
019700         05  FILLER              PIC X(01)       VALUE ' '.       00019700
019800         05  PDB-RPV310K-PFLINE1                                  00019800
019900                                 PIC X(08)       VALUE 'PFLINE1 '.00019900
020000         05  FILLER              PIC S9(04)      COMP             00020000
020100                                                 VALUE +78.       00020100
020200         05  FILLER              PIC S9(04)      COMP             00020200
020300                                                 VALUE +0.        00020300
020400         05  FILLER              PIC S9(04)      COMP             00020400
020500                                                 VALUE +0.        00020500
020600         05  FILLER              PIC X(02)       VALUE 'CD'.      00020600
020700         05  PDB-RPV310K-PFLINE1-MASK                             00020700
020800                                 PIC X(01)       VALUE ' '.       00020800
020900         05  PDB-RPV310K-PFLINE1-ERROR                            00020900
021000                                 PIC X(01)       VALUE ' '.       00021000
021100         05  PDB-RPV310K-PFLINE1-VID                              00021100
021200                                 PIC X(01)       VALUE 'D'.       00021200
021300         05  PDB-RPV310K-PFLINE1-EL                               00021300
021400                                 PIC X(01)       VALUE 'N'.       00021400
021500         05  PDB-RPV310K-PFLINE1-DCHG                             00021500
021600                                 PIC X(01)       VALUE ' '.       00021600
021700         05  FILLER              PIC X(01)       VALUE ' '.       00021700
021800         05  PDB-RPV310K-PFLINE2                                  00021800
021900                                 PIC X(08)       VALUE 'PFLINE2 '.00021900
022000         05  FILLER              PIC S9(04)      COMP             00022000
022100                                                 VALUE +78.       00022100
022200         05  FILLER              PIC S9(04)      COMP             00022200
022300                                                 VALUE +0.        00022300
022400         05  FILLER              PIC S9(04)      COMP             00022400
022500                                                 VALUE +0.        00022500
022600         05  FILLER              PIC X(02)       VALUE 'CD'.      00022600
022700         05  PDB-RPV310K-PFLINE2-MASK                             00022700
022800                                 PIC X(01)       VALUE ' '.       00022800
022900         05  PDB-RPV310K-PFLINE2-ERROR                            00022900
023000                                 PIC X(01)       VALUE ' '.       00023000
023100         05  PDB-RPV310K-PFLINE2-VID                              00023100
023200                                 PIC X(01)       VALUE 'D'.       00023200
023300         05  PDB-RPV310K-PFLINE2-EL                               00023300
023400                                 PIC X(01)       VALUE 'N'.       00023400
023500         05  PDB-RPV310K-PFLINE2-DCHG                             00023500
023600                                 PIC X(01)       VALUE ' '.       00023600
023700         05  FILLER              PIC X(01)       VALUE ' '.       00023700
023800         05  FILLER              PIC X(08)       VALUE LOW-VALUE. 00023800
023900                                                                  00023900
024000 01  RPV310K-PANL-DATA-AREA.                                      00024000
024100     03  RPV310K-OPERID          PIC X(08).                       00024100
024200     03  RPV310K-INST            PIC X(04).                       00024200
024300     03  RPV310K-SYSDATE         PIC X(10).                       00024300
024400     03  RPV310K-PRODCD          PIC X(06).                       00024400
024500     03  RPV310K-ACCOUNT         PIC X(18).                       00024500
024600     03  RPV310K-MODEL           PIC X(10).                       00024600
024700     03  RPV310K-IDNBR           PIC X(18).                       00024700
024800     03  RPV310K-MSGLINE         PIC X(78).                       00024800
024900     03  RPV310K-COMMAND         PIC X(65).                       00024900
025000     03  RPV310K-PFLINE1         PIC X(78).                       00025000
025100     03  RPV310K-PFLINE2         PIC X(78).                       00025100
025200 01  RPV310K-ERROR-FIELD                                          00025200
025300                                 PIC X(08).                       00025300
025400 01  RPV310K-SW-SET-CURSOR                                        00025400
025500                                 PIC X(01)       VALUE 'N'.       00025500
025600******************************************************************00025600
