000010*01  RPV355K-PANL-DATA-BLOCK.                                     00001000
000020*----------------------------------------------------------------*00002000
000030*    RPV355KW - PANEL DATA BLOCK/AREA                            *00003000
000040*----------------------------------------------------------------*00004000
000050     03  FILLER                  PIC X(08)       VALUE '**BPDB**'.00005000
000060     03  PDB-RPV355K-NAME                                         00006000
000070                                 PIC X(08)       VALUE 'RPV355K '.00007000
000080     03  PDB-RPV355K-STATUS.                                      00008000
000090         05  PDB-RPV355K-KEY-CHG                                  00009000
000100                                 PIC X(01).                       00010000
000110         05  PDB-RPV355K-DATA-CHG                                 00011000
000120                                 PIC X(01).                       00012000
000130         05  PDB-RPV355K-CURR-OCC                                 00013000
000140                                 PIC S9(04)      COMP             00014000
000150                                                 VALUE +0.        00015000
000160     03  PDB-RPV355K-FIELD-TABLE.                                 00016000
000170         05  PDB-RPV355K-OPERID                                   00017000
000180                                 PIC X(08)       VALUE 'OPERID  '.00018000
000190         05  FILLER              PIC S9(04)      COMP             00019000
000200                                                 VALUE +8.        00020000
000210         05  FILLER              PIC S9(04)      COMP             00021000
000220                                                 VALUE +0.        00022000
000230         05  FILLER              PIC S9(04)      COMP             00023000
000240                                                 VALUE +0.        00024000
000250         05  FILLER              PIC X(02)       VALUE 'CD'.      00025000
000260         05  PDB-RPV355K-OPERID-MASK                              00026000
000270                                 PIC X(01)       VALUE ' '.       00027000
000280         05  PDB-RPV355K-OPERID-ERROR                             00028000
000290                                 PIC X(01)       VALUE ' '.       00029000
000300         05  PDB-RPV355K-OPERID-VID                               00030000
000310                                 PIC X(01)       VALUE 'D'.       00031000
000320         05  PDB-RPV355K-OPERID-EL                                00032000
000330                                 PIC X(01)       VALUE 'N'.       00033000
000340         05  PDB-RPV355K-OPERID-DCHG                              00034000
000350                                 PIC X(01)       VALUE ' '.       00035000
000360         05  FILLER              PIC X(01)       VALUE ' '.       00036000
000370         05  PDB-RPV355K-INST                                     00037000
000380                                 PIC X(08)       VALUE 'INST    '.00038000
000390         05  FILLER              PIC S9(04)      COMP             00039000
000400                                                 VALUE +4.        00040000
000410         05  FILLER              PIC S9(04)      COMP             00041000
000420                                                 VALUE +0.        00042000
000430         05  FILLER              PIC S9(04)      COMP             00043000
000440                                                 VALUE +0.        00044000
000450         05  FILLER              PIC X(02)       VALUE 'CD'.      00045000
000460         05  PDB-RPV355K-INST-MASK                                00046000
000470                                 PIC X(01)       VALUE ' '.       00047000
000480         05  PDB-RPV355K-INST-ERROR                               00048000
000490                                 PIC X(01)       VALUE ' '.       00049000
000500         05  PDB-RPV355K-INST-VID                                 00050000
000510                                 PIC X(01)       VALUE 'D'.       00051000
000520         05  PDB-RPV355K-INST-EL                                  00052000
000530                                 PIC X(01)       VALUE 'N'.       00053000
000540         05  PDB-RPV355K-INST-DCHG                                00054000
000550                                 PIC X(01)       VALUE ' '.       00055000
000560         05  FILLER              PIC X(01)       VALUE ' '.       00056000
000570         05  PDB-RPV355K-SYSDATE                                  00057000
000580                                 PIC X(08)       VALUE 'SYSDATE '.00058000
000590         05  FILLER              PIC S9(04)      COMP             00059000
000600                                                 VALUE +10.       00060000
000610         05  FILLER              PIC S9(04)      COMP             00061000
000620                                                 VALUE +0.        00062000
000630         05  FILLER              PIC S9(04)      COMP             00063000
000640                                                 VALUE +0.        00064000
000650         05  FILLER              PIC X(02)       VALUE 'CD'.      00065000
000660         05  PDB-RPV355K-SYSDATE-MASK                             00066000
000670                                 PIC X(01)       VALUE ' '.       00067000
000680         05  PDB-RPV355K-SYSDATE-ERROR                            00068000
000690                                 PIC X(01)       VALUE ' '.       00069000
000700         05  PDB-RPV355K-SYSDATE-VID                              00070000
000710                                 PIC X(01)       VALUE 'D'.       00071000
000720         05  PDB-RPV355K-SYSDATE-EL                               00072000
000730                                 PIC X(01)       VALUE 'N'.       00073000
000740         05  PDB-RPV355K-SYSDATE-DCHG                             00074000
000750                                 PIC X(01)       VALUE ' '.       00075000
000760         05  FILLER              PIC X(01)       VALUE ' '.       00076000
000770         05  PDB-RPV355K-PRODCD                                   00077000
000780                                 PIC X(08)       VALUE 'PRODCD  '.00078000
000790         05  FILLER              PIC S9(04)      COMP             00079000
000800                                                 VALUE +6.        00080000
000810         05  FILLER              PIC S9(04)      COMP             00081000
000820                                                 VALUE +0.        00082000
000830         05  FILLER              PIC S9(04)      COMP             00083000
000840                                                 VALUE +0.        00084000
000850         05  FILLER              PIC X(02)       VALUE 'CD'.      00085000
000860         05  PDB-RPV355K-PRODCD-MASK                              00086000
000870                                 PIC X(01)       VALUE ' '.       00087000
000880         05  PDB-RPV355K-PRODCD-ERROR                             00088000
000890                                 PIC X(01)       VALUE ' '.       00089000
000900         05  PDB-RPV355K-PRODCD-VID                               00090000
000910                                 PIC X(01)       VALUE 'E'.       00091000
000920         05  PDB-RPV355K-PRODCD-EL                                00092000
000930                                 PIC X(01)       VALUE 'E'.       00093000
000940         05  PDB-RPV355K-PRODCD-DCHG                              00094000
000950                                 PIC X(01)       VALUE ' '.       00095000
000960         05  FILLER              PIC X(01)       VALUE ' '.       00096000
000970         05  PDB-RPV355K-ACCOUNT                                  00097000
000980                                 PIC X(08)       VALUE 'ACCOUNT '.00098000
000990         05  FILLER              PIC S9(04)      COMP             00099000
001000                                                 VALUE +18.       00100000
001010         05  FILLER              PIC S9(04)      COMP             00101000
001020                                                 VALUE +0.        00102000
001030         05  FILLER              PIC S9(04)      COMP             00103000
001040                                                 VALUE +0.        00104000
001050         05  FILLER              PIC X(02)       VALUE 'CD'.      00105000
001060         05  PDB-RPV355K-ACCOUNT-MASK                             00106000
001070                                 PIC X(01)       VALUE ' '.       00107000
001080         05  PDB-RPV355K-ACCOUNT-ERROR                            00108000
001090                                 PIC X(01)       VALUE ' '.       00109000
001100         05  PDB-RPV355K-ACCOUNT-VID                              00110000
001110                                 PIC X(01)       VALUE 'E'.       00111000
001120         05  PDB-RPV355K-ACCOUNT-EL                               00112000
001130                                 PIC X(01)       VALUE 'E'.       00113000
001140         05  PDB-RPV355K-ACCOUNT-DCHG                             00114000
001150                                 PIC X(01)       VALUE ' '.       00115000
001160         05  FILLER              PIC X(01)       VALUE ' '.       00116000
001170         05  PDB-RPV355K-MODEL                                    00117000
001180                                 PIC X(08)       VALUE 'MODEL   '.00118000
001190         05  FILLER              PIC S9(04)      COMP             00119000
001200                                                 VALUE +10.       00120000
001210         05  FILLER              PIC S9(04)      COMP             00121000
001220                                                 VALUE +0.        00122000
001230         05  FILLER              PIC S9(04)      COMP             00123000
001240                                                 VALUE +0.        00124000
001250         05  FILLER              PIC X(02)       VALUE 'CD'.      00125000
001260         05  PDB-RPV355K-MODEL-MASK                               00126000
001270                                 PIC X(01)       VALUE ' '.       00127000
001280         05  PDB-RPV355K-MODEL-ERROR                              00128000
001290                                 PIC X(01)       VALUE ' '.       00129000
001300         05  PDB-RPV355K-MODEL-VID                                00130000
001310                                 PIC X(01)       VALUE 'E'.       00131000
001320         05  PDB-RPV355K-MODEL-EL                                 00132000
001330                                 PIC X(01)       VALUE 'E'.       00133000
001340         05  PDB-RPV355K-MODEL-DCHG                               00134000
001350                                 PIC X(01)       VALUE ' '.       00135000
001360         05  FILLER              PIC X(01)       VALUE ' '.       00136000
001370         05  PDB-RPV355K-IDNBR                                    00137000
001380                                 PIC X(08)       VALUE 'IDNBR   '.00138000
001390         05  FILLER              PIC S9(04)      COMP             00139000
001400                                                 VALUE +18.       00140000
001410         05  FILLER              PIC S9(04)      COMP             00141000
001420                                                 VALUE +0.        00142000
001430         05  FILLER              PIC S9(04)      COMP             00143000
001440                                                 VALUE +0.        00144000
001450         05  FILLER              PIC X(02)       VALUE 'CD'.      00145000
001460         05  PDB-RPV355K-IDNBR-MASK                               00146000
001470                                 PIC X(01)       VALUE ' '.       00147000
001480         05  PDB-RPV355K-IDNBR-ERROR                              00148000
001490                                 PIC X(01)       VALUE ' '.       00149000
001500         05  PDB-RPV355K-IDNBR-VID                                00150000
001510                                 PIC X(01)       VALUE 'E'.       00151000
001520         05  PDB-RPV355K-IDNBR-EL                                 00152000
001530                                 PIC X(01)       VALUE 'E'.       00153000
001540         05  PDB-RPV355K-IDNBR-DCHG                               00154000
001550                                 PIC X(01)       VALUE ' '.       00155000
001560         05  FILLER              PIC X(01)       VALUE ' '.       00156000
001570         05  PDB-RPV355K-MSGLINE                                  00157000
001580                                 PIC X(08)       VALUE 'MSGLINE '.00158000
001590         05  FILLER              PIC S9(04)      COMP             00159000
001600                                                 VALUE +78.       00160000
001610         05  FILLER              PIC S9(04)      COMP             00161000
001620                                                 VALUE +0.        00162000
001630         05  FILLER              PIC S9(04)      COMP             00163000
001640                                                 VALUE +0.        00164000
001650         05  FILLER              PIC X(02)       VALUE 'CD'.      00165000
001660         05  PDB-RPV355K-MSGLINE-MASK                             00166000
001670                                 PIC X(01)       VALUE ' '.       00167000
001680         05  PDB-RPV355K-MSGLINE-ERROR                            00168000
001690                                 PIC X(01)       VALUE ' '.       00169000
001700         05  PDB-RPV355K-MSGLINE-VID                              00170000
001710                                 PIC X(01)       VALUE 'D'.       00171000
001720         05  PDB-RPV355K-MSGLINE-EL                               00172000
001730                                 PIC X(01)       VALUE 'I'.       00173000
001740         05  PDB-RPV355K-MSGLINE-DCHG                             00174000
001750                                 PIC X(01)       VALUE ' '.       00175000
001760         05  FILLER              PIC X(01)       VALUE ' '.       00176000
001770         05  PDB-RPV355K-COMMAND                                  00177000
001780                                 PIC X(08)       VALUE 'COMMAND '.00178000
001790         05  FILLER              PIC S9(04)      COMP             00179000
001800                                                 VALUE +65.       00180000
001810         05  FILLER              PIC S9(04)      COMP             00181000
001820                                                 VALUE +0.        00182000
001830         05  FILLER              PIC S9(04)      COMP             00183000
001840                                                 VALUE +0.        00184000
001850         05  FILLER              PIC X(02)       VALUE 'CD'.      00185000
001860         05  PDB-RPV355K-COMMAND-MASK                             00186000
001870                                 PIC X(01)       VALUE ' '.       00187000
001880         05  PDB-RPV355K-COMMAND-ERROR                            00188000
001890                                 PIC X(01)       VALUE ' '.       00189000
001900         05  PDB-RPV355K-COMMAND-VID                              00190000
001910                                 PIC X(01)       VALUE 'I'.       00191000
001920         05  PDB-RPV355K-COMMAND-EL                               00192000
001930                                 PIC X(01)       VALUE 'O'.       00193000
001940         05  PDB-RPV355K-COMMAND-DCHG                             00194000
001950                                 PIC X(01)       VALUE ' '.       00195000
001960         05  FILLER              PIC X(01)       VALUE ' '.       00196000
001970         05  PDB-RPV355K-PFLINE1                                  00197000
001980                                 PIC X(08)       VALUE 'PFLINE1 '.00198000
001990         05  FILLER              PIC S9(04)      COMP             00199000
002000                                                 VALUE +78.       00200000
002010         05  FILLER              PIC S9(04)      COMP             00201000
002020                                                 VALUE +0.        00202000
002030         05  FILLER              PIC S9(04)      COMP             00203000
002040                                                 VALUE +0.        00204000
002050         05  FILLER              PIC X(02)       VALUE 'CD'.      00205000
002060         05  PDB-RPV355K-PFLINE1-MASK                             00206000
002070                                 PIC X(01)       VALUE ' '.       00207000
002080         05  PDB-RPV355K-PFLINE1-ERROR                            00208000
002090                                 PIC X(01)       VALUE ' '.       00209000
002100         05  PDB-RPV355K-PFLINE1-VID                              00210000
002110                                 PIC X(01)       VALUE 'D'.       00211000
002120         05  PDB-RPV355K-PFLINE1-EL                               00212000
002130                                 PIC X(01)       VALUE 'N'.       00213000
002140         05  PDB-RPV355K-PFLINE1-DCHG                             00214000
002150                                 PIC X(01)       VALUE ' '.       00215000
002160         05  FILLER              PIC X(01)       VALUE ' '.       00216000
002170         05  PDB-RPV355K-PFLINE2                                  00217000
002180                                 PIC X(08)       VALUE 'PFLINE2 '.00218000
002190         05  FILLER              PIC S9(04)      COMP             00219000
002200                                                 VALUE +78.       00220000
002210         05  FILLER              PIC S9(04)      COMP             00221000
002220                                                 VALUE +0.        00222000
002230         05  FILLER              PIC S9(04)      COMP             00223000
002240                                                 VALUE +0.        00224000
002250         05  FILLER              PIC X(02)       VALUE 'CD'.      00225000
002260         05  PDB-RPV355K-PFLINE2-MASK                             00226000
002270                                 PIC X(01)       VALUE ' '.       00227000
002280         05  PDB-RPV355K-PFLINE2-ERROR                            00228000
002290                                 PIC X(01)       VALUE ' '.       00229000
002300         05  PDB-RPV355K-PFLINE2-VID                              00230000
002310                                 PIC X(01)       VALUE 'D'.       00231000
002320         05  PDB-RPV355K-PFLINE2-EL                               00232000
002330                                 PIC X(01)       VALUE 'N'.       00233000
002340         05  PDB-RPV355K-PFLINE2-DCHG                             00234000
002350                                 PIC X(01)       VALUE ' '.       00235000
002360         05  FILLER              PIC X(01)       VALUE ' '.       00236000
002370         05  FILLER              PIC X(08)       VALUE LOW-VALUE. 00237000
002380                                                                  00238000
002390 01  RPV355K-PANL-DATA-AREA.                                      00239000
002400     03  RPV355K-OPERID          PIC X(08).                       00240000
002410     03  RPV355K-INST            PIC X(04).                       00241000
002420     03  RPV355K-SYSDATE         PIC X(10).                       00242000
002430     03  RPV355K-PRODCD          PIC X(06).                       00243000
002440     03  RPV355K-ACCOUNT         PIC X(18).                       00244000
002450     03  RPV355K-MODEL           PIC X(10).                       00245000
002460     03  RPV355K-IDNBR           PIC X(18).                       00246000
002470     03  RPV355K-MSGLINE         PIC X(78).                       00247000
002480     03  RPV355K-COMMAND         PIC X(65).                       00248000
002490     03  RPV355K-PFLINE1         PIC X(78).                       00249000
002500     03  RPV355K-PFLINE2         PIC X(78).                       00250000
002510 01  RPV355K-ERROR-FIELD                                          00251000
002520                                 PIC X(08).                       00252000
002530 01  RPV355K-SW-SET-CURSOR                                        00253000
002540                                 PIC X(01)       VALUE 'N'.       00254000
002550******************************************************************00255000
