000010******************************************************************00001000
000020* RPW007   PRIMARY ACCOUNT RELATIONSHIP CODE WORK AREA           *00002000
000030******************************************************************00003000
000040*01  WS-PRIMRELCD-WORKAREA.                                       00004000
000050     03  WS-PRIMRELCD-OPTION     PIC X(02)       VALUE SPACES.    00005000
000060     03  WS-PRIMRELCD-VALID      PIC X(01)       VALUE 'N'.       00006000
000070     03  WS-PRIMRELCD-FOUND      PIC X(01)       VALUE 'N'.       00007000
000080     03  WS-PRIMRELCD-ERROR      PIC X(01)       VALUE 'N'.       00008000
000090     03  WS-CUSTRELCD-SKIP       PIC X(01)       VALUE 'N'.       00009000
000100     03  WS-PRIMRELCD-SKIP       PIC X(01)       VALUE 'Y'.       00010000
000110     03  WS-RPW007-RELNBR        PIC 9(02)       VALUE ZEROS.     00011000
000120     03  WS-RPW007-SUB           PIC S9(04)      COMP             00012000
000130                                                 VALUE +0.        00013000
000140******************************************************************00014000
000150*    END OF PRIMARY ACCOUNT RELATIONSHIP CODE WORK AREAS         *00015000
000160******************************************************************00016000
