000010******************************************************************00001000
000020* RPW003   LINK DATA WORK AREA                                   *00002000
000030******************************************************************00003000
000040*01  LS-LINKDATA.                                                 00004000
000050     03  LS-CONTROL              PIC X(01)       VALUE SPACES.    00005000
000060     03  LS-INITSW               PIC X(01)       VALUE 'X'.       00006000
000070     03  LS-TOTSW                PIC X(01)       VALUE SPACES.    00007000
000080     03  LS-HEADSW               PIC X(01)       VALUE SPACES.    00008000
000090     03  LS-APPL                 PIC 9(02).                       00009000
000100     03  LS-RSACCTLN             PIC 9(02).                       00010000
000110     03  LS-RPEDIT               PIC 9(08).                       00011000
000120     03  LS-RPEDIT4      REDEFINES LS-RPEDIT                      00012000
000130                                 PIC 9(02)       OCCURS 4 TIMES.  00013000
000140     03  LS-RSSAVLN              PIC 9(02).                       00014000
000150     03  LS-RPSAVEDIT            PIC 9(08).                       00015000
000160     03  LS-RPSAVEDIT4   REDEFINES LS-RPSAVEDIT                   00016000
000170                                 PIC 9(02)       OCCURS 4 TIMES.  00017000
000180     03  LS-RSODBLN              PIC 9(02).                       00018000
000190     03  LS-RSODBEDIT            PIC 9(08).                       00019000
000200     03  LS-RSODBEDIT4   REDEFINES LS-RSODBEDIT                   00020000
000210                                 PIC 9(02)       OCCURS 4 TIMES.  00021000
000220     03  LS-DDAAPPL              PIC 9(02).                       00022000
000230     03  LS-SAVAPPL              PIC 9(02).                       00023000
000240     03  LS-ODBAPPL              PIC 9(02).                       00024000
000250     03  LS-3000TRIALB           PIC X(01).                       00025000
000260     03  LS-3000TRIALC           PIC X(01).                       00026000
000270     03  LS-3000RPTBRSRT         PIC X(01).                       00027000
000280     03  LS-3000RPTNAMEPRT       PIC X(01).                       00028000
000290     03  LS-3000RPT13FORM        PIC X(01).                       00029000
000300     03  LS-3000RPT20B           PIC X(01).                       00030000
000310     03  LS-3000RPT21            PIC X(01).                       00031000
000320     03  LS-3000RPT22            PIC X(01).                       00032000
000330     03  LS-3000RPT23            PIC X(01).                       00033000
000340     03  LS-3000RPT24            PIC X(01).                       00034000
000350     03  LS-3000RPT25            PIC X(01).                       00035000
000360     03  LS-3000RPT37A           PIC X(01).                       00036000
000370     03  LS-3000RPT37B           PIC X(01).                       00037000
000380     03  LS-3000COSTCNTR         PIC X(01).                       00038000
000390     03  LS-LINKFUNCT            PIC X(01)       VALUE SPACES.    00039000
000400     03  LS-KEYBYTES.                                             00040000
000410         05  LS-KBHC             PIC X(01).                       00041000
000420         05  LS-KBBK             PIC X(01).                       00042000
000430         05  LS-KBRG             PIC X(01).                       00043000
000440         05  LS-KBBR             PIC X(01).                       00044000
000450         05  LS-KBTY             PIC X(01).                       00045000
000460         05  LS-KBOF             PIC X(01).                       00046000
000470         05  LS-KBCU             PIC X(01).                       00047000
000480         05  LS-KBAC             PIC X(01).                       00048000
000490     03  LS-BRKBYTES.                                             00049000
000500         05  LS-BBBR             PIC X(01).                       00050000
000510         05  LS-BBTY             PIC X(01).                       00051000
000520         05  LS-BBOF             PIC X(01).                       00052000
000530     03  LS-SAVEBYTES.                                            00053000
000540         05  LS-SB1234.                                           00054000
000550             07  LS-SBHC         PIC X(01).                       00055000
000560             07  LS-SBBK         PIC X(01).                       00056000
000570             07  LS-SBRG         PIC X(01).                       00057000
000580             07  LS-SBBR         PIC X(01).                       00058000
000590         05  LS-SBTY             PIC X(01).                       00059000
000600         05  LS-SBOF             PIC X(01).                       00060000
000610         05  LS-SBCU             PIC X(01).                       00061000
000620         05  LS-SBAC             PIC X(01).                       00062000
000630     03  LS-LASTKEY.                                              00063000
000640         05  LS-LKFORMX          PIC X(02).                       00064000
000650         05  LS-LKSEPREPX        PIC X(01).                       00065000
000660         05  LS-LKHOLDCOX.                                        00066000
000670             07  LS-LKHOLDCO     PIC S9(03)      COMP-3.          00067000
000680         05  LS-LKINSTX.                                          00068000
000690             07  LS-LKINST       PIC S9(03)      COMP-3.          00069000
000700         05  LS-LKALTBRNBRX.                                      00070000
000710             07  LS-LKALTBRNBR                                    00071000
000720                                 PIC S9(05)      COMP-3.          00072000
000730         05  LS-LKSPECX          PIC X(01).                       00073000
000740         05  LS-LKREGNBRX.                                        00074000
000750             07  LS-LKREGNBR     PIC S9(03)      COMP-3.          00075000
000760         05  LS-LKRPTNBRX.                                        00076000
000770             07  LS-LKRPTNBR     PIC S9(04)      COMP.            00077000
000780         05  LS-LKBRANCHX.                                        00078000
000790             07  LS-LKBRANCH     PIC S9(05)      COMP-3.          00079000
000800         05  LS-LKTYPEX.                                          00080000
000810             07  LS-LKTYPE       PIC S9(03)      COMP-3.          00081000
000820         05  LS-LKOFFX.                                           00082000
000830             07  LS-LKOFF        PIC X(09).                       00083000
000840         05  LS-LKCUSTX.                                          00084000
000850             07  LS-LKCUST       PIC X(10).                       00085000
000860             07  LS-LKCUSTN                                       00086000
000870                         REDEFINES LS-LKCUST                      00087000
000880                                 PIC 9(18)       COMP-3.          00088000
000890         05  LS-LKACCTX.                                          00089000
000900             07  LS-LKACCT       PIC S9(18)      COMP-3.          00090000
000910         05  LS-LKSORTNBRX.                                       00091000
000920             07  LS-LKSORTNBR    PIC S9(11)      COMP-3.          00092000
000930         05  LS-LASTKEYT.                                         00093000
000940             07  LS-LKCODE1      PIC X(01).                       00094000
000950             07  LS-LKAMOUNTX.                                    00095000
000960                 09  LS-LKAMOUNT                                  00096000
000970                                 PIC S9(09)V99   COMP-3.          00097000
000980             07  LS-LKAMOUNTXR                                    00098000
000990                         REDEFINES LS-LKAMOUNTX.                  00099000
001000                 09  LS-LKSERIAL                                  00100000
001010                                 PIC S9(11)      COMP-3.          00101000
001020             07  LS-LKCODE2      PIC X(01).                       00102000
001030             07  LS-LKSEQX.                                       00103000
001040                 09  LS-LKSEQ                                     00104000
001050                                 PIC S9(09)      COMP.            00105000
001060             07  LS-LKRPTPFC     PIC X(01).                       00106000
001070             07  LS-LKPAGEBRK.                                    00107000
001080                 09  LS-LKBRPAGE                                  00108000
001090                                 PIC X(01).                       00109000
001100                 09  LS-LKTYPAGE                                  00110000
001110                                 PIC X(01).                       00111000
001120     03  LS-OPTFLAGS.                                             00112000
001130         05  LS-OPTFLAG          PIC X(01)       OCCURS 0100.     00113000
001140     03  LS-BKADDR1              PIC X(30)       VALUE SPACES.    00114000
001150     03  LS-BKADDR2              PIC X(30)       VALUE SPACES.    00115000
001160     03  LS-BKZIP                PIC 9(09)       VALUE ZEROS.     00116000
001170     03  LS-EDITACCT             PIC X(22)       VALUE SPACES.    00117000
001180     03  LS-MIMKEYHOLD           PIC X(48)       VALUE SPACES.    00118000
001190     03  LS-MONFLAG              PIC X(01).                       00119000
001200     03  LS-LANG                 PIC X(02).                       00120000
001210     03  FILLER                  PIC X(74).                       00121000
001220*----------------------------------------------------------------*00122000
001230*        END OF LINK WORK AREA                                   *00123000
001240*----------------------------------------------------------------*00124000
