P0029  01  WS-CURRENT-DATE-TIME.                                        00001000
P0029      03  FILLER                  PIC 9(08)       VALUE ZERO.      00001990
P0029      03  WS-CURRENT-HH           PIC 9(02)       VALUE ZERO.      00002980
P0029      03  WS-CURRENT-MM           PIC 9(02)       VALUE ZERO.      00003970
P0029      03  WS-CURRENT-SS           PIC 9(02)       VALUE ZERO.      00004960
P0029      03  WS-CURRENT-DEC          PIC 9(02)       VALUE ZERO.      00005950
P0029      03  FILLER                  PIC X(05)       VALUE SPACE.     00006940
P0029  01  WS-SEC-COMP                 PIC 9(9)V99     VALUE ZERO.      00007930
P0029  01  FILLER REDEFINES WS-SEC-COMP.                                00008920
P0029      05  FILLER                  PIC X(9).                        00009910
P0029      05  WS-SEC-COMP-DEC         PIC 9(2).                        00010900
P0029  01  WS-SEC-START                PIC 9(9)V99     VALUE ZERO.      00011890
P0029  01  WS-RPIDX-ERROR              PIC X(01)       VALUE SPACE.     00012880
P0029  01  WS-RPIDX-INST               PIC 9(04)       VALUE ZERO.      00013870
