000010*01  RPW014-AREAS.                                                00001000
000020     03  RPW014-PANEL-FIELDS.                                     00002000
000030         05  RPW014-PRODCODE     PIC X(06).                       00003000
000040         05  RPW014-ACCT         PIC X(18).                       00004000
000050         05  RPW014-NACCT                                         00005000
000060                         REDEFINES RPW014-ACCT                    00006000
000070                                 PIC 9(18).                       00007000
000080     03  RPW014-ALLOW-ZERO-ACCT  PIC X(01)       VALUE 'N'.       00008000
000090         88  ALLOW-ZERO-ACCOUNT                  VALUE 'Y'.       00009000
000100     03  RPW014-FORMATTEDACCT    PIC X(22).                       00010000
000110     03  RPW014-APPLNBR          PIC 9(02).                       00011000
000120     03  RPW014-DIALOGROUT       PIC X(02).                       00012000
