000010*01  WS-SECONDARY-ACCOUNT-FIELDS.                                 00001000
000020     03  WS-ACC-MAX              PIC S9(04)      COMP             00002000
000030                                                 VALUE +33.       00003000
000040     03  WS-ACC-TABLE.                                            00004000
000050         05  WS-ACC-INFO                         OCCURS 33 TIMES. 00005000
000060             07  WS-ACC-INST     PIC 9(04).                       00006000
000070             07  WS-ACC-CUST-TYPE                                 00007000
000080                                 PIC X(01).                       00008000
000090             07  WS-ACC-CUST     PIC X(21).                       00009000
000100             07  WS-ACC-RELNBR   PIC 9(02).                       00010000
000110             07  WS-ACC-PRIM     PIC 9(01).                       00011000
000120             07  WS-ACC-FILL     PIC X(01).                       00012000
000130         05  WS-ACC-FILLER       PIC X(10).                       00013000
000140     03  WS-NEXTACC.                                              00014000
000150         05  WS-NEXTACCT         PIC X(28).                       00015000
000160         05  WS-NEXTREL.                                          00016000
000170             07  WS-NEXTPRIM     PIC 9(01).                       00017000
000180             07  WS-NEXTRELN     PIC 9(02).                       00018000
000190         05  WS-NEXTCUST.                                         00019000
000200             07  WS-NEXTCINST    PIC 9(04).                       00020000
000210             07  WS-NEXTCTYPE    PIC X(01).                       00021000
000220             07  WS-NEXTCCUST    PIC X(21).                       00022000
000230     03  WS-SEC-CUSTOMER-TABLE.                                   00023000
000240         05  WS-SEC-CUST-INFO                    OCCURS 198.      00024000
000250             07  WS-SECUST-INST  PIC 9(04).                       00025000
000260             07  WS-SECUST-CUST-TYPE                              00026000
000270                                 PIC X(01).                       00027000
000280             07  WS-SECUST-CUST  PIC X(21).                       00028000
000290             07  WS-SECUST-PRIM  PIC 9(01).                       00029000
P0099              07  WS-SECUST-RELNBR                                 00029300
P0099                                  PIC 9(02).                       00029600
000300             07  WS-SECUST-FILLER                                 00030000
000310                                 PIC X(01).                       00031000
000320         05 FILLER               PIC X(10)       VALUE SPACES.    00032000
000330     03  WS-SECCUSTMAX           PIC S9(03)      COMP-3           00033000
000340                                                 VALUE +198.      00034000
000350     03  WS-SECCUSTOVERFLOW      PIC X(01)       VALUE 'N'.       00035000
000360     03  WS-MORE-SECONDARYCUST   PIC X(01)       VALUE 'N'.       00036000
000370     03  WS-SECCUSTSUB           PIC S9(04)      COMP             00037000
000380                                                 VALUE ZERO.      00038000
000390     03  WS-PRIMCUSTACCTS        PIC S9(05)      COMP-3           00039000
000400                                                 VALUE ZEROS.     00040000
000410     03  WS-SECTABLE             PIC S9(05)      COMP-3           00041000
000420                                                 VALUE ZEROS.     00042000
000430     03  WS-NUMOFSECCUSTS        PIC S9(05)      COMP-3           00043000
000440                                                 VALUE ZEROS.     00044000
000450     03  WS-NUMOFSECACCTS        PIC S9(05)      COMP-3           00045000
000460                                                 VALUE ZEROS.     00046000
000470     03  WS-DUPSECACCT           PIC X(01)       VALUE SPACE.     00047000
000480     03  WS-BADRELNBR            PIC X(01)       VALUE SPACE.     00048000
000490     03  WS-EACHDUPACCT.                                          00049000
000500         07  WS-DUPINST          PIC 9(04).                       00050000
000510         07  WS-DUPPRODCD        PIC X(06).                       00051000
000520         07  WS-DUPACCOUNT       PIC X(18).                       00052000
000530     03  WS-DUPTEST              PIC S9(05)      COMP-3           00053000
000540                                                 VALUE ZERO.      00054000
000550     03  WS-SECMAX               PIC S9(05)      COMP-3           00055000
000560                                                 VALUE +1000.     00056000
000570     03  WS-ALLSEC               PIC S9(05)      COMP-3           00057000
000580                                                 VALUE ZERO.      00058000
000590     03  WS-SAVED-SECACCTS.                                       00059000
000600         05  WS-EACHSECACCT                      OCCURS           00060000
000610                                                 1000 TIMES.      00061000
000620             07  WS-SECINST      PIC 9(04).                       00062000
000630             07  WS-SECPRODCD    PIC X(06).                       00063000
000640             07  WS-SECACCOUNT   PIC X(18).                       00064000
000650     03  WS-RELCHECK             PIC X(01)       VALUE 'N'.       00065000
000660     03  WS-VALIDREL             PIC 9(02)       VALUE ZERO.      00066000
000670     03  WS-INCLUDEREL           PIC X(01)       VALUE 'N'.       00067000
000680     03  WS-RELMAX               PIC S9(05)      VALUE 50.        00068000
000690     03  WS-RELSUB               PIC S9(05)      VALUE ZERO.      00069000
000700     03  WS-RELCODETABLE.                                         00070000
000710         05  WS-RELCODE                          OCCURS           00071000
000720                                                 50 TIMES.        00072000
000730             07  WS-SECRELCODE   PIC 9(02).                       00073000
000740                                                                  00074000
000750                                                                  00075000
000760* ** END OF WORK FIELDS                                           00076000
