000010*01  RPW130-AREAS.                                                00001000
000020******************************************************************00002000
000030*    RPW130 - WORK AREAS FOR ACCOUNT KEY VERIFICATION ROUTINE    *00003000
000040*    AND REFORMATER FOR THE RCIF.                                *00004000
000050******************************************************************00005000
000060     03  RPW130-FUNCTION         PIC X(01)       VALUE SPACES.    00006000
000070     03  RPW130-BANK-LVL-2023    PIC X(01)       VALUE 'N'.       00007000
000080     03  RPW130-EDIT-CKDIGIT     PIC X(01)       VALUE 'N'.       00008000
000090     03  RPW130-INST             PIC S9(04)      COMP             00009000
000100                                                 VALUE ZERO.      00010000
000110     03  RPW130-PRODCODE         PIC X(06)       VALUE SPACES.    00011000
000120     03  RPW130-ACCOUNTINPUT     PIC X(18)       VALUE SPACES.    00012000
000130*----------------------------------------------------------------*00013000
000140     03  RPW130-ACCOUNTKEY       PIC X(18)       VALUE SPACES.    00014000
000150     03  RPW130-ACCTKEYNUM                                        00015000
000160                         REDEFINES RPW130-ACCOUNTKEY              00016000
000170                                 PIC 9(18).                       00017000
000180*----------------------------------------------------------------*00018000
000190     03  RPW130-FORMATTEDACCT    PIC X(22)       VALUE SPACES.    00019000
000200*----------------------------------------------------------------*00020000
000210     03  RPW130-2023PRODNAME     PIC X(30).                       00021000
000220     03  RPW130-2023ASSETCD      PIC X(01).                       00022000
000230     03  RPW130-2023PRODCLASS    PIC 9(05).                       00023000
000240     03  RPW130-2023DIALOGROUT   PIC X(02).                       00024000
000250     03  RPW130-2023INTAPPL211   PIC 9(02).                       00025000
000260     03  RPW130-2023ACCTLN       PIC 9(02).                       00026000
000270     03  RPW130-2023ACCT-EDIT.                                    00027000
000280         05  RPW130-2023-ACCTED1 PIC 9(02).                       00028000
000290         05  RPW130-2023-ACCTED2 PIC 9(02).                       00029000
000300         05  RPW130-2023-ACCTED3 PIC 9(02).                       00030000
000310         05  RPW130-2023-ACCTED4 PIC 9(02).                       00031000
000320     03  RPW130-2023ACCTED                                        00032000
000330                         REDEFINES RPW130-2023ACCT-EDIT           00033000
000340                                 PIC 9(08).                       00034000
000350     03  RPW130-2023ACCTLONG     PIC X(01).                       00035000
000360     03  RPW130-2023ACCTALPHA    PIC X(01).                       00036000
000370     03  RPW130-2023KEYVRFY      PIC X(01).                       00037000
000380     03  RPW130-2023ACCTVER      PIC 9(02).                       00038000
000390     03  RPW130-2023AMT-KEY.                                      00039000
000400         05  RPW130-2023KRECCD   PIC X(03).                       00040000
000410         05  RPW130-2023KAPPLCD  PIC X(02).                       00041000
000420     03  RPW130-2023APPLTYPE     PIC 9(03).                       00042000
000430******************************************************************00043000
