000010******************************************************************00001000
000020* RPW2001  2001 - RP BRANCH INFO WORK AREA                       *00002000
000030******************************************************************00003000
000040*01  WS-RPMIM2001AREAS.                                           00004000
000050     03  WS-RPMIM2001KEY.                                         00005000
000060         05  WS-RPMIM2001INST    PIC 9(04).                       00006000
000070     03  WS-RPMIM2001BRANCH      PIC 9(05).                       00007000
000080     03  WS-RPMIM2001ERROR       PIC X(01)       VALUE SPACE.     00008000
000090     03  WS-RPMIM2001VALID       PIC X(01)       VALUE SPACE.     00009000
000100     03  WS-RPMIM2001BANKSW      PIC X(01)       VALUE 'Y'.       00010000
000110     03  WS-RPMIM2001LOADSW      PIC X(01)       VALUE 'N'.       00011000
000120     03  WS-RPMIM2001FOUND       PIC X(01)       VALUE SPACE.     00012000
000130     03  WS-RPMIM2001MAXSIZE     PIC S9(04)      COMP             00013000
000140                                                 VALUE +1000.     00014000
000150     03  WS-2001-AREA.                                            00015000
000160         05  WS-2001-RECORD                      OCCURS 1000 TIMES00016000
000170                                 ASCENDING KEY IS WS-2001-KEY     00017000
000180                                 INDEXED BY INDX-2001.            00018000
000190             07  WS-2001-KEY.                                     00019000
000200                 09  WS-2001-BRANCH                               00020000
000210                                 PIC 9(05).                       00021000
000220             07  WS-2001-REGION  PIC 9(03).                       00022000
000230     03  WS-M2001-SUB            PIC S9(04)      COMP             00023000
000240                                                 VALUE ZEROS.     00024000
000250     03  WS-M2001-MAX            PIC S9(04)      COMP             00025000
000260                                                 VALUE +500.      00026000
000270     03  WS-M2001-TABLE.                                          00027000
000280         05  WS-M2001-INFO                       OCCURS           00028000
000290                                                 500 TIMES.       00029000
000300             07  WS-M2001-INST   PIC 9(04).                       00030000
000310             07  WS-M2001-BRANCH PIC 9(05).                       00031000
000320             07  WS-M2001-REGION PIC 9(03).                       00032000
000330                                                                  00033000
000340*----------------------------------------------------------------*00034000
000350*     END WS AREA USED TO HOLD RP BRANCH 2001 MICM RECORD        *00035000
000360*----------------------------------------------------------------*00036000
