000010******************************************************************00001000
000020* RPW7111  7111 - RP TRANSACTION PLAN WORK AREA                  *00002000
000030******************************************************************00003000
000040*01  WS-RPMIM7111AREAS.                                           00004000
000050     03  WS-RPMIM7111KEY.                                         00005000
000060         05  WS-RPMIM7111INST    PIC 9(04).                       00006000
000070     03  WS-RPMITRANKEY.                                          00007000
000080         05  WS-RPMIM7111TRANPROFILE                              00008000
000090                                 PIC X(06).                       00009000
000100         05  WS-RPMIM7111TRANPLAN                                 00010000
000110                                 PIC 9(03).                       00011000
000120         05  WS-RPMIM7111EXTTRAN PIC 9(04).                       00012000
000130         05  WS-RPMIM7111INTTRAN PIC 9(04).                       00013000
000140     03  WS-RPMIM7111ERROR       PIC X(01)       VALUE SPACE.     00014000
000150     03  WS-RPMIM7111FOUND       PIC X(01)       VALUE SPACE.     00015000
000160     03  WS-RPMIM7111MAXOCCURS   PIC S9(04)      COMP             00016000
000170                                                 VALUE +12.       00017000
000180     03  WS-RPMIM7111MAXSIZE     PIC S9(04)      COMP             00018000
000190                                                 VALUE +100.      00019000
000200     03  WS-7111-AREA.                                            00020000
000210         05  WS-7111-RECORD                      OCCURS 100 TIMES 00021000
000220                                 ASCENDING KEY IS WS-7111-KEY     00022000
000230                                 INDEXED BY INDX-7111.            00023000
000240             07  WS-7111-KEY.                                     00024000
000250                 09  WS-7111-TRANPROFILE                          00025000
000260                                 PIC X(06).                       00026000
000270                 09  WS-7111-TRANPLAN                             00027000
000280                                 PIC 9(03).                       00028000
000290                 09  WS-7111-EXTTRAN                              00029000
000300                                 PIC X(04).                       00030000
000310                 09  WS-7111-INTTRAN                              00031000
000320                                 PIC X(04).                       00032000
000330             07  WS-RPMIM7111    PIC X(103).                      00033000
000340*----------------------------------------------------------------*00034000
000350*     END WS AREA USED TO HOLD RP TRAN PLAN 7111 MICM RECORD     *00035000
000360*----------------------------------------------------------------*00036000
