000010******************************************************************00001000
000020* RPW7114  7114 - TERM BALANCE RATE TABLE WORK AREA              *00002000
000030******************************************************************00003000
000040*01  WS-RPMIM7114AREAS.                                           00004000
000050     03  WS-RPMIM7114KEY.                                         00005000
000060         05  WS-RPMIM7114INST    PIC 9(04).                       00006000
000070     05  WS-RPMIM7114RATETABLE   PIC X(06).                       00007000
000080     05  WS-RPMIM7114TERM        PIC 9(05).                       00008000
000090     03  WS-INDX-7114            PIC S9(04)      COMP             00009000
000100                                                 VALUE ZEROS.     00010000
000110     03  WS-INDX2-7114           PIC S9(04)      COMP             00011000
000120                                                 VALUE ZEROS.     00012000
000130     03  WS-RPMIM7114ERROR       PIC X(01)       VALUE SPACE.     00013000
000140     03  WS-RPMIM7114FOUND       PIC X(01)       VALUE SPACE.     00014000
000150     03  WS-RPMIM7114MAXSIZE     PIC S9(04)      COMP             00015000
000160                                                 VALUE +600.      00016000
000170     03  WS-7114-AREA.                                            00017000
000180         05  WS-7114-RECORD                      OCCURS 600 TIMES 00018000
000190                                 ASCENDING KEY IS WS-7114-KEY     00019000
000200                                 INDEXED BY INDX-7114.            00020000
000210             07  WS-7114-KEY.                                     00021000
000220                 09  WS-7114-RATETABLE                            00022000
000230                                 PIC X(06).                       00023000
000240                 09  WS-7114-TERM                                 00024000
000250                                 PIC 9(05).                       00025000
000260             07  WS-RPMIM7114    PIC X(150).                      00026000
000270     03  WS-7114-WORK-TABLE.                                      00027000
000280         05  WS-7114-WORK-RECORD                 OCCURS 99 TIMES. 00028000
000290             07  WS-7114-WORK-RATETABLE                           00029000
000300                                 PIC X(06).                       00030000
000310             07  WS-7114-WORK-TERM                                00031000
000320                                 PIC 9(05).                       00032000
000330             07  WS-7114-WORK-RPMIM7114                           00033000
000340                                 PIC X(150).                      00034000
000350*----------------------------------------------------------------*00035000
000360*     END WS AREA USED TO HOLD RP 7114 MICM RECORD               *00036000
000370*----------------------------------------------------------------*00037000
