000010******************************************************************00001000
000020* RPW7103  7103 - RP RATE INCENTIVES TABLE WORK AREA             *00002000
000030******************************************************************00003000
000040*01  WS-RPMIM7103AREAS.                                           00004000
000050     03  WS-RPMIM7103KEY.                                         00005000
000060         05  WS-RPMIM7103INST    PIC 9(04).                       00006000
000070         05  WS-RPMIM7103EFFDT   PIC S9(08).                      00007000
000080     03  WS-RPMIM7103RATETABLE   PIC X(06).                       00008000
000090     03  WS-RPMIM7103ERROR       PIC X(01)       VALUE SPACE.     00009000
000100     03  WS-RPMIM7103FOUND       PIC X(01)       VALUE SPACE.     00010000
000110     03  WS-RPMIM7103MAXSIZE     PIC S9(04)      COMP             00011000
000120                                                 VALUE +100.      00012000
000130     03  WS-7103-AREA.                                            00013000
000140         05  WS-7103-RECORD                      OCCURS 100 TIMES 00014000
000150                                 ASCENDING KEY IS WS-7103-KEY     00015000
000160                                 INDEXED BY INDX-7103.            00016000
000170             07  WS-7103-KEY.                                     00017000
000180                 09  WS-7103-RATETABLE                            00018000
000190                                 PIC X(06).                       00019000
000200             07  WS-RPMIM7103    PIC X(205).                      00020000
000210*----------------------------------------------------------------*00021000
000220*     END WS AREA USED TO HOLD RP RATE INCENTIVE 7103 MICM RECORD*00022000
000230*----------------------------------------------------------------*00023000
