000010******************************************************************00001000
000020* RPW7101  7101 - RP MODEL DEFINITION WORK AREA                  *00002000
000030******************************************************************00003000
000040*01  WS-RPMIM7101AREAS.                                           00004000
000050     03  WS-RPMIM7101KEY.                                         00005000
000060         05  WS-RPMIM7101INST    PIC 9(04).                       00006000
000070         05  WS-RPMIM7101EFFDT   PIC S9(08).                      00007000
000080     03  WS-RPMIM7101MODEL       PIC X(10).                       00008000
000090     03  WS-RPMIM7101ERROR       PIC X(01)       VALUE SPACE.     00009000
000100     03  WS-RPMIM7101FOUND       PIC X(01)       VALUE SPACE.     00010000
000110     03  WS-RPMIM7101MAXSIZE     PIC S9(04)      COMP             00011000
000120                                                 VALUE +100.      00012000
000130     03  WS-7101-AREA.                                            00013000
000140         05  WS-7101-RECORD                      OCCURS 100 TIMES 00014000
000150                                 ASCENDING KEY IS WS-7101-KEY     00015000
000160                                 INDEXED BY INDX-7101.            00016000
000170             07  WS-7101-KEY.                                     00017000
000180                 09  WS-7101-MODEL                                00018000
000190                                 PIC X(10).                       00019000
000200             07  WS-RPMIM7101    PIC X(277).                      00020000
000210*----------------------------------------------------------------*00021000
000220*     END WS AREA USED TO HOLD RP REL MODEL 7101 MICM RECORD     *00022000
000230*----------------------------------------------------------------*00023000
