000010******************************************************************00001000
000020* RPW7102  7102 - RP RATE MODEL WORK AREA                        *00002000
000030******************************************************************00003000
000040*01  WS-RPMIM7102AREAS.                                           00004000
000050     03  WS-RPMIM7102KEY.                                         00005000
000060         05  WS-RPMIM7102INST    PIC 9(04).                       00006000
000070     03  WS-RPMIMODELKEY.                                         00007000
000080         05  WS-RPMIM7102MODEL   PIC X(10).                       00008000
000090         05  WS-RPMIM7102PRODCODE                                 00009000
000100                                 PIC X(06).                       00010000
000110         05  WS-RPMIM7102TYPE    PIC 9(03).                       00011000
000120     03  WS-RPMIM7102ERROR       PIC X(01)       VALUE SPACE.     00012000
000130     03  WS-RPMIM7102FOUND       PIC X(01)       VALUE SPACE.     00013000
000140     03  WS-RPMIM7102MAXSIZE     PIC S9(04)      COMP             00014000
000150                                                 VALUE +600.      00015000
000160     03  WS-7102-AREA.                                            00016000
000170         05  WS-7102-RECORD                      OCCURS 600 TIMES 00017000
000180                                 ASCENDING KEY IS WS-7102-KEY     00018000
000190                                 INDEXED BY INDX-7102.            00019000
000200             07  WS-7102-KEY.                                     00020000
000210                 09  WS-7102-MODEL                                00021000
000220                                 PIC X(10).                       00022000
000230                 09  WS-7102-PRODCODE                             00023000
000240                                 PIC X(06).                       00024000
000250                 09  WS-7102-TYPE                                 00025000
000260                                 PIC 9(03).                       00026000
000270             07  WS-RPMIM7102    PIC X(157).                      00027000
000280*----------------------------------------------------------------*00028000
000290*     END WS AREA USED TO HOLD RP RATE MODEL 7102 MICM RECORD    *00029000
000300*----------------------------------------------------------------*00030000
