000010******************************************************************00001000
000020* RPW7110  7110 - RP TRANSACTION PROFILE TABLE WORK AREA         *00002000
000030******************************************************************00003000
000040*01  WS-RPMIM7110AREAS.                                           00004000
000050     03  WS-RPMIM7110KEY.                                         00005000
000060         05  WS-RPMIM7110INST    PIC 9(04).                       00006000
000070     03  WS-RPMIM7110TRANPROFILE PIC X(06).                       00007000
000080     03  WS-RPMIM7110ERROR       PIC X(01)       VALUE SPACE.     00008000
000090     03  WS-RPMIM7110FOUND       PIC X(01)       VALUE SPACE.     00009000
000100     03  WS-RPMIM7110MAXOCCURS   PIC S9(04)      COMP             00010000
000110                                                 VALUE +12.       00011000
000120     03  WS-RPMIM7110MAXSIZE     PIC S9(04)      COMP             00012000
000130                                                 VALUE +100.      00013000
000140     03  WS-7110-AREA.                                            00014000
000150         05  WS-7110-RECORD                      OCCURS 100 TIMES 00015000
000160                                 ASCENDING KEY IS WS-7110-KEY     00016000
000170                                 INDEXED BY INDX-7110.            00017000
000180             07  WS-7110-KEY.                                     00018000
000190                 09  WS-7110-TRANPROFILE                          00019000
000200                                 PIC X(06).                       00020000
000210             07  WS-RPMIM7110    PIC X(392).                      00021000
000220*----------------------------------------------------------------*00022000
000230*     END WS AREA USED TO HOLD RP TRAN PROFILE 7110 MICM RECORD  *00023000
000240*----------------------------------------------------------------*00024000
