000010*01  RPMSTA-AREAS.                                                00001000
000020     03  RPS-MST-OPEN            PIC X(01)       VALUE SPACES.    00002000
000030     03  RPS-MST-LOG             PIC X(01)       VALUE 'Y'.       00003000
000040     03  RPS-MST-AIX             PIC X(01)       VALUE SPACES.    00004000
000050 01  RPS-MST-BEFORE.                                              00005000
000060     03  RPS-MST-BIMAGE          PIC X(238)      VALUE SPACES.    00006000
000070     03  RPS-MST-BAPPENDDATA     PIC X(01)       VALUE SPACES.    00007000
000080 01  RPS-MST-AFTER.                                               00008000
000090     03  RPS-MST-AIMAGE          PIC X(238)      VALUE SPACES.    00009000
000100     03  RPS-MST-AAPPENDDATA     PIC X(01)       VALUE SPACES.    00010000
000110 01  RPS-MST-APPENDLGTH          PIC S9(04)      COMP             00011000
000120                                                 VALUE +0001.     00012000
000130 01  RPS-MST-APPENDDATA          PIC X(01)       VALUE SPACES.    00013000
000140 01  RPS-MST-RECLGTH             PIC 9(04)       VALUE 238.       00014000
000150 01  RPS-MST-PARM                PIC X(01)       VALUE SPACES.    00015000
000160 01  RPS-MST-KEY                 PIC X(38)       VALUE SPACES.    00016000
000170 01  RPS-MST-LOCK                PIC X(01)       VALUE SPACES.    00017000
000180 01  RPS-MST-RDBS.                                                00018000
000190     03  RPS-MST-TAG-ID          PIC X(08)       VALUE '**BDBS**'.00019000
000200         88 RPS-MST-GOOD                         VALUE '**BDBS**'.00020000
000210     03  RPS-MST-REQ-VERB        PIC 9(04).                       00021000
000220     03  RPS-MST-STAT            PIC X(02).                       00022000
000230     03  RPS-MST-RETURN          PIC 9(04).                       00023000
000240     03  RPS-MST-REC-ID.                                          00024000
000250         05 RPS-MST-REC-PRI      PIC X(03)       VALUE 'SAF'.     00025000
000260         05 RPS-MST-REC-ALT      PIC X(01)       VALUE '0'.       00026000
000270     03  RPS-MST-ORG-ID          PIC X(06).                       00027000
000280     03  RPS-MST-AUDIT           PIC X(01)       VALUE SPACE.     00028000
000290     03  RPS-MST-AUDIT-LEN       PIC 9(02)       VALUE ZERO.      00029000
000300     03  RPS-MST-CONC            PIC X(01)       VALUE SPACE.     00030000
000310     03  RPS-MST-LOG-POS         PIC X(04).                       00031000
000320         88  RPS-MST-POS-CLOSED                  VALUE LOW-VALUE. 00032000
000330         88  RPS-MST-POS-OPEN                    VALUE 'OPEN'.    00033000
000340         88  RPS-MST-POS-VALID                   VALUE 'VALD'.    00034000
000350         88  RPS-MST-POS-LOCKED                  VALUE 'LOCK'.    00035000
000360         88  RPS-MST-POS-BAD                     VALUE 'BADP'.    00036000
000370******************************************************************00037000
000380*   END RELATIONSHIP PRICING MASTER KEY RECORD WORK AREA          00038000
000390******************************************************************00039000
