000010*01  RPSECA-AREAS.                                                00001000
000020     03  RPS-SEC-OPEN            PIC X(01)       VALUE SPACES.    00002000
000030     03  RPS-SEC-LOG             PIC X(01)       VALUE 'Y'.       00003000
000040     03  RPS-SEC-AIX             PIC X(01)       VALUE SPACES.    00004000
000050 01  RPS-SEC-BEFORE.                                              00005000
000060     03  RPS-SEC-BIMAGE          PIC X(143)      VALUE SPACES.    00006000
000070     03  RPS-SEC-BAPPENDDATA     PIC X(01)       VALUE SPACES.    00007000
000080 01  RPS-SEC-AFTER.                                               00008000
000090     03  RPS-SEC-AIMAGE          PIC X(143)      VALUE SPACES.    00009000
000100     03  RPS-SEC-AAPPENDDATA     PIC X(01)       VALUE SPACES.    00010000
000110 01  RPS-SEC-APPENDLGTH          PIC S9(04)      COMP             00011000
000120                                                 VALUE +0001.     00012000
000130 01  RPS-SEC-APPENDDATA          PIC X(01)       VALUE SPACES.    00013000
000140 01  RPS-SEC-RECLGTH             PIC 9(04)       VALUE 143.       00014000
000150 01  RPS-SEC-PARM                PIC X(01)       VALUE SPACES.    00015000
000160 01  RPS-SEC-KEY                 PIC X(66)       VALUE SPACES.    00016000
000170 01  RPS-SEC-LOCK                PIC X(01)       VALUE SPACES.    00017000
000180 01  RPS-SEC-RDBS.                                                00018000
000190     03  RPS-SEC-TAG-ID          PIC X(08)       VALUE '**BDBS**'.00019000
000200         88 RPS-SEC-GOOD                         VALUE '**BDBS**'.00020000
000210     03  RPS-SEC-REQ-VERB        PIC 9(04).                       00021000
000220     03  RPS-SEC-STAT            PIC X(02).                       00022000
000230     03  RPS-SEC-RETURN          PIC 9(04).                       00023000
000240     03  RPS-SEC-REC-ID.                                          00024000
000250         05 RPS-SEC-REC-PRI      PIC X(03)       VALUE 'SAI'.     00025000
000260         05 RPS-SEC-REC-ALT      PIC X(01)       VALUE '0'.       00026000
000270     03  RPS-SEC-ORG-ID          PIC X(06).                       00027000
000280     03  RPS-SEC-AUDIT           PIC X(01)       VALUE SPACE.     00028000
000290     03  RPS-SEC-AUDIT-LEN       PIC 9(02)       VALUE ZERO.      00029000
000300     03  RPS-SEC-CONC            PIC X(01)       VALUE SPACE.     00030000
000310     03  RPS-SEC-LOG-POS         PIC X(04).                       00031000
000320         88  RPS-SEC-POS-CLOSED                  VALUE LOW-VALUE. 00032000
000330         88  RPS-SEC-POS-OPEN                    VALUE 'OPEN'.    00033000
000340         88  RPS-SEC-POS-VALID                   VALUE 'VALD'.    00034000
000350         88  RPS-SEC-POS-LOCKED                  VALUE 'LOCK'.    00035000
000360         88  RPS-SEC-POS-BAD                     VALUE 'BADP'.    00036000
000370***************************************************************** 00037000
000380*   END RELATIONSHIP PRICING SECONDARY KEY RECORD WORK AREA       00038000
000390******************************************************************00039000
