000010*01  RPUSER-MESSAGE.                                              00001000
000020*----------------------------------------------------------------*00002000
000030*    RPWUSER - RP USER EXIT WORK AREA                            *00003000
000040******************************************************************00004000
000050     03  RPUSER-KEY-AREAS.                                        00005000
000060         05  RPUSER-GRP-KEY.                                      00006000
000070             07  RPUSER-INST     PIC 9(04).                       00007000
000080             07  RPUSER-ACCOUNT  PIC 9(18).                       00008000
000090         05  RPUSER-APPL-INFO.                                    00009000
000100             07  RPUSER-PRODCODE                                  00010000
000110                                 PIC X(06).                       00011000
000120             07  RPUSER-APPLR    PIC 9(02).                       00012000
000130     03  RPUSER-GRP-DATA.                                         00013000
000140         05  RPUSER-PASSED       PIC X(01).                       00014000
000150         05  RPUSER-USER-INFO.                                    00015000
000160             07  RPUSER-APPL-STATUS                               00016000
000170                                 PIC X(02).                       00017000
000180             07  RPUSER-BRANCH   PIC S9(05).                      00018000
000190             07  RPUSER-ACCT-TYPE                                 00019000
000200                                 PIC S9(03).                      00020000
000210             07  RPUSER-TERM     PIC S9(05).                      00021000
000220             07  RPUSER-AUTO-DEBIT                                00022000
000230                                 PIC X(01).                       00023000
000240             07  RPUSER-DEL-DAYS PIC S9(03).                      00024000
000250             07  RPUSER-RCODE    PIC X(01).                       00025000
000260             07  RPUSER-CREDIT-RATING                             00026000
000270                                 PIC X(05).                       00027000
000280             07  RPUSER-MDORM    PIC X(01).                       00028000
000290             07  RPUSER-MBLOCK   PIC X(01).                       00029000
000300         05  RPUSER-MISC-INFO.                                    00030000
000310             07  RPUSER-OFFICER1 PIC X(09).                       00031000
000320             07  RPUSER-OFFICER2 PIC X(09).                       00032000
000330             07  RPUSER-COSTC    PIC S9(05).                      00033000
000340             07  RPUSER-SCNXT    PIC S9(09)      COMP-3.          00034000
000350             07  RPUSER-USEROPT1 PIC X(01).                       00035000
000360             07  RPUSER-USEROPT2 PIC X(01).                       00036000
000370             07  RPUSER-USEROPT3 PIC X(01).                       00037000
000380             07  RPUSER-USEROPT4 PIC X(01).                       00038000
000390             07  RPUSER-RESERVE2 PIC X(21).                       00039000
000400         05  RPUSER-BAL-INFO.                                     00040000
000410             07  RPUSER-CURBAL   PIC S9(13)V99   COMP-3.          00041000
000420             07  RPUSER-CURCUSTCOL                                00042000
000430                                 PIC S9(13)V99   COMP-3.          00043000
000440             07  RPUSER-CURBANKCOL                                00044000
000450                                 PIC S9(13)V99   COMP-3.          00045000
000460             07  RPUSER-LOWBAL   PIC S9(13)V99   COMP-3.          00046000
000470             07  RPUSER-AVGBAL   PIC S9(13)V99   COMP-3.          00047000
000480             07  RPUSER-AVGCOLBAL                                 00048000
000490                                 PIC S9(13)V99   COMP-3.          00049000
000500             07  RPUSER-COMMAMT  PIC S9(13)V99   COMP-3.          00050000
000510             07  RPUSER-CREDIT-LIMIT                              00051000
000520                                 PIC S9(13)V99   COMP-3.          00052000
000530             07  RPUSER-RSVBAL1  PIC S9(13)V99   COMP-3.          00053000
000540             07  RPUSER-RSVBAL2  PIC S9(13)V99   COMP-3.          00054000
000550             07  RPUSER-RSVBAL3  PIC S9(13)V99   COMP-3.          00055000
000560             07  RPUSER-RSVBAL4  PIC S9(13)V99   COMP-3.          00056000
000570             07  RPUSER-RSVBAL5  PIC S9(13)V99   COMP-3.          00057000
000580             07  RPUSER-RSVBAL6  PIC S9(13)V99   COMP-3.          00058000
000590             07  RPUSER-RSVBAL7  PIC S9(13)V99   COMP-3.          00059000
000600             07  RPUSER-USRBAL1  PIC S9(13)V99   COMP-3.          00060000
000610             07  RPUSER-USRBAL2  PIC S9(13)V99   COMP-3.          00061000
000620             07  RPUSER-USRBAL3  PIC S9(13)V99   COMP-3.          00062000
000630             07  RPUSER-USRBAL4  PIC S9(13)V99   COMP-3.          00063000
000640             07  RPUSER-USRBAL5  PIC S9(13)V99   COMP-3.          00064000
000650         05  RPUSER-BAL-INFOX                                     00065000
000660                         REDEFINES RPUSER-BAL-INFO.               00066000
000670             07  RPUSER-BAL      PIC S9(13)V99   COMP-3           00067000
000680                                                 OCCURS 20.       00068000
000690******************************************************************00069000
000700*    END OF RP USER EXIT WORK AREA                               *00070000
000710******************************************************************00071000
