000010******************************************************************00001000
000020* RPWXXXN  XXX FIELD NUMBERS                                     *00002000
000030******************************************************************00003000
000040*01  RPXXXN-AREA.                                                 00004000
000050     03  RPXXXN-CUSTOMER-NAME    PIC S9(04)      VALUE +0001.     00005000
000060     03  RPXXXN-RPPRO2-RELTYPE   PIC S9(04)      VALUE +0002.     00006000
000070     03  RPXXXN-RPMAINT-ACTION   PIC S9(04)      VALUE +0003.     00007000
000080     03  RPXXXN-RPRELO-RELTYPE   PIC S9(04)      VALUE +0004.     00008000
000090     03  RPXXXN-RPMHIST-RECCODE  PIC S9(04)      VALUE +0005.     00009000
