//*--------------------------------------------------------------------*        
//INSPR763 PROC DB2PARM='VPRDMIS.PARMLIB', DB2 PARMLIB                          
//*--------------------------------------------------------------------*           
//INSSR074 EXEC PGM=EZTPA00,                                                    
//             COND=(0,NE,INSSR060)                                             
//*                                                                             
//     INCLUDE MEMBER=VSTID1         UNUSED DUMMY DD STMTS                        
//     INCLUDE MEMBER=VSTID2         UNUSED DUMMY DD STMTS                      
//     INCLUDE MEMBER=VSTID3         UNUSED DUMMY DD STMTS                      
//     INCLUDE MEMBER=VSTID4         UNUSED DUMMY DD STMTS                      
//     INCLUDE MEMBER=VSTID5         UNUSED DUMMY DD STMTS                      
//     INCLUDE MEMBER=VSTID6         UNUSED DUMMY DD STMTS                      
//     INCLUDE MEMBER=VSTID7         UNUSED DUMMY DD STMTS                      
//     INCLUDE MEMBER=VSTID8         UNUSED DUMMY DD STMTS                      
//     INCLUDE MEMBER=VSTID9         UNUSED DUMMY DD STMTS                      
//     INCLUDE MEMBER=VSTID10         UNUSED DUMMY DD STMTS                      
//*                                          