* comment 1
/* comment 2
/* comment 3 */
/!* multiline
    comment 4 *!/
* normal comment 5 again
DEFINE DATA
LOCAL
 1 #FLD (A10) /* random comment 1
END-DEFINE
* random comment 2
END