//SCALL JOB 'MMRS00C'
//STEP01   EXEC PGM=CICSPGM
//MYFXOUT  DD DISP=NEW,DSN=DATASET.FOR.WRITE
//MYFBIN  DD DISP=SHR,DSN=DATASET.FOR.READ
//MYFBIO   DD DISP=MOD,DSN=DATASET.FOR.READWRITE
//MYEXTEND DD DISP=OLD,DSN=DATASET.FOR.EXTEND