%%INCLIB WELF.CONTROLM.PROD.AUTOEDIT %%INCMEM RUNCLASS               
%%LIBSYM WELF.CONTROLM.PROD.SYMBOLS %%MEMSYM QSYMBOLS                
//WQDE208P JOB (J00,068),'WQDE208P',                                    
//      MSGCLASS=A,PRTY=11,TIME=(30)                                    
//*                                                                     
//*PROCPDS      JCLLIB  ORDER=WSETS.PROD.PROC                           
//*                        
//JS010   EXEC WQDE107P                                                 
//*                                                                     
