               IDENTIFICATION DIVISION.
               PROGRAM-ID. DSN8CC0.
               ENVIRONMENT DIVISION.
               DATA DIVISION.
               WORKING-STORAGE SECTION.
               PROCEDURE DIVISION.
               COPY PERFCODE
