000160 IDENTIFICATION DIVISION.
000170 PROGRAM-ID.    CAP_CVT_BUM_59.
001220 ENVIRONMENT DIVISION.
001230 CONFIGURATION SECTION.
001240 SPECIAL-NAMES.
001300 
001310 SOURCE-COMPUTER.    ALPHA.
001320 OBJECT-COMPUTER.    ALPHA.
001340 INPUT-OUTPUT SECTION.
001350 FILE-CONTROL.
001370     SELECT PRVTTLS_FILE   ASSIGN TO DUMMY
001380     ORGANIZATION IS INDEXED
001390     ACCESS MODE IS DYNAMIC
001400     RECORD KEY IS PRVTTLS_KEY0 IN PRVTTLS_REC
001410     FILE STATUS IS WS_FILE_STATUS.
001420 
001520     SELECT EXTOUT_SMRY_PHY_FILE ASSIGN TO 'CORRECT1'
001530     FILE STATUS IS WS_FILE_STATUS.
001750 DATA DIVISION.
001760 FILE SECTION.
001780 FD  PRVTTLS_FILE
001790     VALUE OF ID IS WS_PRVTTLS_FILESPEC.
001820 
001830 FD  EXTOUT_DTL_FILE
001835     VALUE OF ID IS 'CORRECT4'.
001860 
002100 WORKING-STORAGE SECTION.
002665 01  TEST_STUFF
002667     05 DUMMY                      PIC X VALUE "FALSCH1".
003900 01  WORK_AREA.
003960     05  WS_OFFSET_PERIOD        PIC S9(9) COMP.
003970     05  WS_FILE_STATUS            PIC X(02).
003980     05  WS_PRVTTLS_FILESPEC       PIC X(19).
003990         88 WSC_PRVTTLS_FILESPEC1  VALUE "CORRECT2".
003990         88 WSC_PRVTTLS_FILESPEC2  VALUE "CORRECT3".
004610 PROCEDURE DIVISION.
004660 MAIN_PROGRAM SECTION.
005530     SET WSC_PRVTTLS_FILESPEC2 TO TRUE
011510 END PROGRAM CAP_CVT_BUM_59.