000100*    Datenstruktur für Tabelle LA_SCHNITTST_INK                   00010001
000200     25 LADTSI0A-KEY.                                             00020001
000300        30 VERTRAGSNUMMER       PIC S9(17)V USAGE COMP-3.         00030001
000400        30 FILLER               PIC  X(3).                        00040001
000500        30 BESTANDSSCHLUESSEL   PIC S9(4) USAGE COMP.             00050001
000600        30 FILLER               PIC  X(2).                        00060001
000700     25 LADTSI0A-DATA.                                            00070001
000800        30 DATENTRAEGERNR       PIC S9(4) USAGE COMP.             00080001
000900        30 FILLER               PIC  X(2).                        00090001
001000        30 INKGKNR              PIC S9(17)V USAGE COMP-3.         00100001
001100        30 FILLER               PIC  X(3).                        00110001
001200        30 LFDNRINKGK           PIC S9(4) USAGE COMP.             00120001
001300        30 FILLER               PIC  X(2).                        00130001
001400        30 BSINKGKKZ            PIC S9(4) USAGE COMP.             00140001
001500        30 FILLER               PIC  X(2).                        00150001
001600        30 RECHNR               PIC S9(4) USAGE COMP.             00160001
001700        30 FILLER               PIC  X(2).                        00170001
001800        30 ABKNR                PIC S9(17)V USAGE COMP-3.         00180001
001900        30 FILLER               PIC  X(3).                        00190001
002000        30 BSABKKZ              PIC S9(4) USAGE COMP.             00200001
002100        30 FILLER               PIC  X(2).                        00210001
002200        30 RECHBEZ              PIC  X(32).                       00220002
002300        30 FILLER               PIC  X(4).                        00230002
