000100*    Datenstruktur für Tabelle LA_AbkKonsFuehrNSH                 00010000
000200     25 LADTK30A-KEY.                                             00020000
000300        30 ABKNR                PIC S9(17)V USAGE COMP-3.         00030000
000400        30 FILLER               PIC  X(3).                        00040000
000500        30 BEARBABKNR           PIC S9(9) USAGE COMP.             00050000
000600        30 BSABKKZ              PIC S9(4) USAGE COMP.             00060000
000700        30 FILLER               PIC  X(2).                        00070000
000800        30 ABGANGABKNR          PIC S9(9) USAGE COMP.             00080000
000900     25 LADTK30A-DATA.                                            00090000
001000        30 BILANZBINDENUMMER    PIC S9(9) USAGE COMP.             00100000
001100        30 BILANZKURZTXT        PIC X(32).                        00110000
001200        30 FILLER               PIC X(4).                         00120000
001300        30 BILANZWERTERMITTJN   PIC X.                            00130000
001400        30 FILLER               PIC X(3).                         00140000
001500        30 BILANZWMITTEILJN     PIC X.                            00150000
001600        30 FILLER               PIC X(3).                         00160000
