DEFINE DATA
LOCAL
01         #I01                        (I004)
01         #ARR                        (N003/2)
END-DEFINE

WRITE NOTITLE  *PROGRAM 'START'

RESET  #ARR(*)
MOVE  2                                TO  #I01
WRITE NOTITLE *PROGRAM 'Vor REPEAT loop. Naechster Index #I01:' #I01

REPEAT  UNTIL  #ARR(#I01)                    NE  0
  SUBTRACT  1                        FROM  #I01
  WRITE NOTITLE *PROGRAM 'In REPEAT loop.  Naechster Index #I01:' #I01

  IF  #I01                             EQ  0
    WRITE NOTITLE  *PROGRAM 'ESCAPE BOTTOM'
    ESCAPE BOTTOM
  END-IF
END-REPEAT

WRITE (1) NOTITLE  *PROGRAM 'ENDE'

END