DEFINE DATA
LOCAL
1 TS-LOCAL (A26)
END-DEFINE

MOVE '2100-12-31-24.00.00.000000' TO TS-LOCAL

DELETE FROM TPL-IW_SQL_TEST
INSERT INTO TPL-IW_SQL_TEST (TIME_STAMP)
	VALUES (TS-LOCAL)

SELECT * INTO VIEW IW_SOLID_TEST_VIEW FROM TPL-IW_SQL_TEST
	WRITE NOTITLE NOHDR IW_SOLID_TEST_VIEW.TIME_STAMP
	MOVE '2101-01-01-00.00.00.000000' TO IW_SOLID_TEST_VIEW.TIME_STAMP
	UPDATE
END-SELECT

WRITE NOTITLE NOHDR IW_SOLID_TEST_VIEW.TIME_STAMP

SELECT SINGLE ALPHA_SHORT, I_2 INTO VIEW SELECT-VIEW FROM TPL-IW_SQL_TEST
  WHERE ALPHA_SHORT = #ALPHA ORDER BY I_2
	ADD 1 TO COUNTER
	WRITE NOTITLE NOHDR SELECT-VIEW COUNTER
END-SELECT

END