DEFINE DATA

LOCAL
1 #KEY (A9)

1 #KEY-FROM (A9)
1 REDEFINE #KEY-FROM
  2 KEY-AA-1 (A1)
  2 KEY-AB-1 (A8)
1 #KEY-TO (A9)
1 REDEFINE #KEY-TO
  2 KEY-AA-1 (A1)
  2 KEY-AB-1 (A8)

1 #KEY-LONG-FROM (A10)
1 REDEFINE #KEY-LONG-FROM
  2 KEY-AA-1  (A1)
  2 KEY-AB-1  (A8)
  2 TOO-MANY (A1)
1 #KEY-LONG-TO (A10)
1 REDEFINE #KEY-LONG-TO
  2 KEY-AA-1  (A1)
  2 KEY-AB-1  (A8)
  2 TOO-MANY (A1)

1 MY-VIEW VIEW DDM0020
  2 AA-1 (A1)
  2 AB-1 (A8)
END-DEFINE

#KEY-FROM := #KEY-TO := #KEY

FIND MY-VIEW WITH SA-1 = #KEY-FROM THRU #KEY-TO

    WRITE  NOTITLE NOHDR 'loop 1'
R1.
FIND MY-VIEW WITH SA-1 = #KEY-FROM THRU #KEY-TO
    WRITE  NOTITLE NOHDR 'loop 2'
R2.
FIND MY-VIEW WITH SA-1 = #KEY-FROM THRU #KEY-TO
    WRITE  NOTITLE NOHDR 'loop 3'
FIND MY-VIEW WITH SA-1 = #KEY-FROM THRU #KEY-TO
    WRITE  NOTITLE NOHDR 'loop 4'
    IF TRUE EQ FALSE
        ESCAPE BOTTOM(R1.)
    END-IF
    WRITE  NOTITLE NOHDR 'end loop 4'
END-FIND
    WRITE  NOTITLE NOHDR 'end loop 3'
END-FIND
    WRITE  NOTITLE NOHDR 'end loop 2'
END-FIND
    WRITE  NOTITLE NOHDR 'end loop 1'
END-FIND
    WRITE  NOTITLE NOHDR 'END'
END
