//TESTJOB  JOB
//STEP01   EXEC PROC=TESTPROC,PROGRAM=TESTPRG
//OUTFILE  DD   DSN=TEST.FILE.OUT,
//              DISP=(NEW,CATLG,DELETE),
//              DCB=(RECFM=VB,BLKSIZE=0,LRECL=5000),
//              SPACE=(CYL,(2000,1000),RLSE)
//INFILE   DD   DSN=TEST.FILE.IN,
//              DISP=SHR
