 ME10566: PROCEDURE OPTIONS(MAIN);
 
 DCL RECRD CHARACTER(80);
 
 DCL INFILE  FILE RECORD INPUT  ENV(FB RECSIZE(80) BUFFERS(20) TOTAL);
 
 DCL INFILE2  FILE VIRTUAL RECORD INPUT  ENV(FB RECSIZE(80) BUFFERS(20) TOTAL);
 
 ON ENDFILE (INFILE) PUT SKIP LIST('EOF CALLED');
 
 READ FILE (INFILE) INTO (RECRD);
 PUT SKIP LIST(RECRD);
 
 READ FILE (INFILE) INTO (RECRD);
 PUT SKIP LIST('AFTER 2ND READ');
 
 CLOSE FILE (INFILE);
 
 READ FILE (INFILE) INTO (RECRD);
 PUT SKIP LIST(RECRD);
 
 READ FILE (INFILE) INTO (RECRD);
 PUT SKIP LIST('AFTER 2ND READ');
 
 CLOSE FILE (INFILE);
 
 READ FILE (INFILE) INTO (RECRD);
 PUT SKIP LIST(RECRD);
 
 READ FILE (INFILE) INTO (RECRD);
 PUT SKIP LIST('AFTER 2ND READ');

 END ME10566;