       IDENTIFICATION DIVISION. 
       PROGRAM-ID. A. 
       ENVIRONMENT DIVISION. 
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY '1'
           COPY CC1
           DISPLAY '2'
           COPY CC2
           DISPLAY '3'
           .
