       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGB.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MY-PROGNAM-NAME PIC X(10) VALUE 'PROGB'.

       LINKAGE SECTION.
       01 LINKAGE-STUFF.
           05 PARAMETER-FIELD PIC X(10).
           05 PARAMETER-FIELD-2 PIC X(5).

       PROCEDURE DIVISION USING PARAMETER-FIELD, PARAMETER-FIELD-2.

           DISPLAY PARAMETER-FIELD 'CALL PARAMETER'.
           DISPLAY PARAMETER-FIELD-2 'CALL PARAMETER 2'.

