       IDENTIFICATION DIVISION.
       PROGRAM-ID. START01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

        01 WS-FIELD-A-4 PIC X(4).

       PROCEDURE DIVISION.

           CALL "Call1Move1B" USING WS-FIELD-A-4.

       END PROGRAM START01.
