       IDENTIFICATION DIVISION.
       PROGRAM-ID. WC47CLLR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

        01 DUMMY PIC X(4).

       PROCEDURE DIVISION.

         CALL "SameVariableNameB" USING DUMMY.

       END PROGRAM WC47PGM8.
