//JCL   JOB
//STEP0010 EXEC PGM=EZTPA00
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSDUMP  DD SYSOUT=*
//EXTRS    DD SPACE=(CYL, (2,2), RISE)
//SORTEX1    DD SPACE=(CYL, (1,1), RISE)
//SYSIN 	DD *
PARM SSID(DPOG)
*
SQL INSECT INTO ABC.XYZ_PQR_MN  +
VALUE(19,						+
	  ,'ABC'					+
	  ,'XYZ'					+
	  ,CURRNT TIMESTAMP    		+
	  
	  IF SQLCODE NE 0
	  	DISPLAY '*********** TEST 'SQLCODE
	  	PERFORM BAD-SQL-RTN
	  ELSE
	  	WS-INS-FXEP-CT = WS-INS-FXEP-CT + 1
	  END-IF
*
STOP
*
//*
	
