//NDMBATCH  PROC MEMB=,PGMHLQ=TKMA,CNTLHLQ=TKMA.T3,EXECPARM=''           00001002
//DB3TEST  EXEC PGM=IKJEFT1B&EXECPARM                                   00005403
//STEPLIB  DD DSN=&PGMHLQ..LOADLIB,DISP=SHR                             00005500
//*                                                                     00073200