//WEO418I1 JOB (HS5300PQ66),'BIN 5 ORSIS HSPROD',                       00010008
//             CLASS=H,MSGCLASS=X,MSGLEVEL=(1,1),                       00020001
//             TIME=1439,REGION=0M                                      00030004
//*                                                                     00040001
//WEO418I1 EXEC WEO418I1,                                                       
//             FTPPARM=B418FT1P,  ** FOR PROD REGION                            
//             RGN=&RGN                                                                                                                
