000060 IDENTIFICATION DIVISION.
000080
000090 PROGRAM-ID.  DUAL_SQL.
000260 ENVIRONMENT DIVISION.
000270
000280 CONFIGURATION SECTION.
000290 SOURCE-COMPUTER.        VAX.
000300 OBJECT-COMPUTER.        VAX.
000310
000320 INPUT-OUTPUT SECTION.
000400 DATA DIVISION.
000410 WORKING-STORAGE SECTION.
000220 01  W_DISPLAY_DATE      PIC X(09).
004920 PROCEDURE DIVISION.
000630     EXEC SQL
000640         SELECT
000650                 TO_CHAR(SYSDATE, 'YYYYMMDD')
000660         INTO
000670         :W_DISPLAY_DATE
000680         FROM DUAL
000690     END-EXEC
015660     STOP RUN.
