        01 DLI-FUNCTIONS.
           05 DLI-GU                 PIC X(4) VALUE 'GU  '.
           05 DLI-GHU                PIC X(4) VALUE 'GHU '.
           05 DLI-GN                 PIC X(4) VALUE 'GN  '.
           05 DLI-GHN                PIC X(4) VALUE 'GHN '.
           05 DLI-GNP                PIC X(4) VALUE 'GNP '.
           05 DLI-GHNP               PIC X(4) VALUE 'GHNP'.
           05 DLI-ISRT               PIC X(4) VALUE 'ISRT'.
           05 DLI-DLET               PIC X(4) VALUE 'DLET'.
           05 DLI-REPL               PIC X(4) VALUE 'REPL'.
           05 DLI-CHKP               PIC X(4) VALUE 'CHKP'.
           05 DLI-XRST               PIC X(4) VALUE 'XRST'.
           05 DLI-PCB                PIC X(4) VALUE 'PCB '.
