        01 LOAD-PCB-MASK.
           05 LPCB-DBD-NAME          PIC X(8).
           05 LPCB-SEGMENT-LEVEL     PIC XX.
           05 LPCB-STATUS-CODE       PIC XX.
           05 LPCB-PROC-OPTIONS      PIC X(4).
           05 FILLER                 PIC S9(5) COMP.
           05 LPCB-SEGMENT-NAME      PIC X(8).
           05 LPCB-KEY-LENGTH        PIC S9(5) COMP.
           05 LPCB-NUMB-SENS-SEGS    PIC S9(5) COMP.
           05 LPCB-KEY               PIC X(11).
