000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MIN6534A.
038100     EJECT
038200 ENVIRONMENT DIVISION.
038300 CONFIGURATION SECTION.
038400 SOURCE-COMPUTER. IBM-370.
038500 OBJECT-COMPUTER. IBM-370.
038600 DATA DIVISION.
038700 WORKING-STORAGE SECTION.
080000 LINKAGE SECTION.
088800 PROCEDURE DIVISION.
088900 S010-000-MAIN-LOGIC  SECTION.
089000 S010-010-START.
089100*
089200     EXEC CICS ADDRESS TWA (ADDRESS OF TWA-WORK-AREA) END-EXEC.
089300*
089400     IF EIBCALEN EQUAL ZERO
089500     THEN
089600         EXEC CICS ABEND ABCODE ('XXXX')
089700             END-EXEC
089800     ELSE
089900         NEXT SENTENCE.
090000*
090100     EVALUATE TRUE
090200            WHEN WW-060-KEY-PANEL
090300                 COMPUTE WP-000-MAPSIZE =
090400                        (LENGTH OF BLV5010-SCREEN)
090500                 END-COMPUTE
090600            WHEN WW-060-SCREEN-01
090700                 COMPUTE WP-000-MAPSIZE =
090800                        (LENGTH OF BLV5011-SCREEN)
090900                 END-COMPUTE
091000            WHEN WW-060-SCREEN-02
091100                 COMPUTE WP-000-MAPSIZE =
091200                        (LENGTH OF BLV5012-SCREEN)
091300            WHEN WW-060-SCREEN-03
091400                 COMPUTE WP-000-MAPSIZE =
091500                        (LENGTH OF BLV5013-SCREEN)
091600                 END-COMPUTE
094400            WHEN OTHER
094500                 MOVE 'BLOP5129 S010-010 NO MAPSIZE'
094600                   TO WL-TWA-815-ERROR-MESSAGE
094700                 MOVE WK-810-ABORT-RETURN
094800                   TO WL-TWA-815-RETURN-CODE
094900     END-EVALUATE.
095000     IF WL-TWA-815-RETURN-CODE IS EQUAL TO
095100        WK-810-ABORT-RETURN
095200     THEN
095300         GO TO S010-900-RETURN.
095400*
095500     EXEC CICS GETMAIN
095600               SET (WL-TWA-815-WORK-ADDRESS-1)
095700               LENGTH (WP-000-MAPSIZE)
095800               INITIMG (WK-005-LOW-VALUES)
095900               END-EXEC.
096000*
096100     MOVE WL-TWA-815-WORK-ADDRESS-1
096200       TO XNVT-BLL-AS-COMP.
096300     SET ADDRESS OF WL-TIO-USER-DEFINED-TIOA
096400       TO XNVT-BLL-AS-POINTER.
096500*
096600     IF WL-TWA-815-FUNCTION-CODE IS EQUAL TO
096700        WK-805-GETMAIN
096800     THEN
096900         IF WW-060-RETURN-CD
097000                 IS EQUAL TO
097100            WK-010-MAPFAIL
097200         THEN
097300             GO TO S010-900-RETURN.
097400*
097500     PERFORM S030-000-FORMAT-SCREEN.
097600*
097700 S010-900-RETURN.
097800*
097900     EXEC CICS RETURN END-EXEC.
098000*
098100     GOBACK.
098200*
098300 S010-999-EXIT.
098400     EXIT.
098500     EJECT
098600 S030-000-FORMAT-SCREEN  SECTION.
098700*
100000 S030-010-START.
100100*
100200     EVALUATE TRUE
100300         WHEN WW-060-KEY-PANEL
100400             GO TO S030-015-FORMAT-SCREEN-0
100900         WHEN WW-060-SCREEN-03
101000             GO TO S030-040-FORMAT-SCREEN-3
102500     END-EVALUATE.
102600*
102700 S030-015-FORMAT-SCREEN-0.
102800*
102900     MOVE WW-060-ACTION-CODE
103000       TO BLV5010-D-ACTION-CD.
103100*
103200     IF WW-060-SAVE-1-PROV NUMERIC
103300     THEN
103400         MOVE WW-060-SAVE-1-PROV
103500           TO BLV5010-D-PROV-NUMBER
103600     ELSE
103700     IF WW-060-SAVE-1-SSN NOT EQUAL LOW-VALUES
103800     THEN
103900         MOVE WW-060-SAVE-1-SSN
104000           TO BLV5010-D-PROV-SSN
104100     ELSE
104200     IF WW-060-SAVE-1-EMP NOT EQUAL LOW-VALUES
104300     THEN
104400         MOVE WW-060-SAVE-1-EMP
104500           TO BLV5010-D-PROV-EIN
104600     ELSE
104700     IF WW-060-SAVE-1-NAME NOT EQUAL LOW-VALUES
104800     THEN
104900         MOVE WW-060-SAVE-1-NAME
105000           TO BLV5010-D-PROV-NAME
105100     ELSE
105200     IF WW-060-SAVE-1-NABP NOT EQUAL LOW-VALUES                   SR0835
105300     THEN
105400         MOVE WW-060-SAVE-1-NABP
105500           TO BLV5010-D-PROV-NCPDP
105600     ELSE
105700     IF WW-060-SAVE-1-NPI NOT EQUAL LOW-VALUES
105800     THEN
105900         MOVE WW-060-SAVE-1-NPI
106000           TO BLV5010-D-PROV-NPI
106100     ELSE
106200     IF  WW-060-SAVE-1-DEA NOT EQUAL LOW-VALUES
106300     THEN
106400         MOVE WW-060-SAVE-1-DEA
106500           TO BLV5010-D-PROV-DEA
106600     ELSE
106700     IF  WW-060-SAVE-1-LICENSE NOT EQUAL LOW-VALUES
106800     THEN
106900         MOVE WW-060-SAVE-1-LICENSE
107000           TO BLV5010-D-PROV-LICENSE
107100     ELSE
107200     IF  WW-060-SAVE-1-CNTY-TYPE-SPEC NOT EQUAL LOW-VALUES
107300     THEN
107400         MOVE WW-060-SAVE-1-PROV-CNTY
107500           TO BLV5010-D-PROV-CNTY
107600         MOVE WW-060-SAVE-1-PROV-TYPE
107700           TO BLV5010-D-PROV-TYPE
107800         MOVE WW-060-SAVE-1-PROV-SPEC
107900           TO BLV5010-D-PROV-SPEC
108000     ELSE
108100         NEXT SENTENCE.
108200*
108300     MOVE WL-TWA-815-ERROR-MESSAGE
108400       TO BLV5010-D-MESSAGE.
108500*
108600     GO TO S030-999-EXIT.
243100*
243200     EJECT
243300 S030-040-FORMAT-SCREEN-3.
243400*
243500     MOVE W1200022-PROV-NUMBER
243600       TO BLV5013-D-PROV-NUMZ.
243700*
243800     IF WW-060-ADD
243900     THEN
244000         MOVE WK-005-ADD
244100           TO BLV5013-D-SCREEN-TYPE
244200     ELSE
244300     IF WW-060-CHANGE
244400     THEN
244500         MOVE WK-005-CHANGE
244600           TO BLV5013-D-SCREEN-TYPE
244700         PERFORM S035-000-LOCK-OUT-SCR-MERGED
244800     ELSE
244900         MOVE WK-005-INQUIRY
245000           TO BLV5013-D-SCREEN-TYPE
245100         PERFORM S400-000-LOCK-OUT-SCR-3-FIELDS.
245200*
245300*
245400     MOVE W1200011-PROV-NW-EXEMPT-IND
245500       TO BLV5013-D-PROV-NW-EXEMPT-IND.
245600     SEARCH ALL W0-21901-TABLE-ENTRY
245700         AT END
245800             MOVE SPACES
245900               TO BLV5013-D-PROV-NW-EXEMPT-DESC
246000         WHEN W0-21901-PROV-NW-EXEMPT-IND
246100            (WX0-21901-TABLE-ENTRY)
246200                       EQUAL
246300              BLV5013-D-PROV-NW-EXEMPT-IND
246400             MOVE W0-21901-SHORT-DESC
246500                    (WX0-21901-TABLE-ENTRY)
246600               TO BLV5013-D-PROV-NW-EXEMPT-DESC.
246700*
246800     MOVE W1200011-PROV-NW-DELEGATE-IND
246900       TO BLV5013-D-PROV-NW-DELEGATE-IND.
247000*
247100     IF  W1200031-NPI-NUMBER
247200             IS GREATER THAN ZEROS
247300     THEN
247400         PERFORM S623-000-CHECK-PROV-NW.
247500*
247600     PERFORM S625-000-FORMAT-PROGRAM
247700       VARYING WX1200092-PROGRAM-PRICE-DATA
247800          FROM +1 BY +1
247900         UNTIL WX1200092-PROGRAM-PRICE-DATA
248000                 IS GREATER THAN
248100                WK-050-MAX-PGM-PRICING-DATA.
248200*
248300     GO TO S030-999-EXIT.
