       IDENTIFICATION DIVISION.
       PROGRAM-ID.     LNCY290.
       AUTHOR.         JANE TUMILTY.
       INSTALLATION.   J SAINSBURY PLC.
       DATE-WRITTEN.   08.12.1997.
       DATE-COMPILED.

      *---------------------------------------------------------------*
      *    Discovering differences between UPPERCASE and              *
      *    lowercase modules                                          *
      *---------------------------------------------------------------*

       ENVIRONMENT DIVISION.
       DATA DIVISION.
      
      *---------------------------------------------------------------*
      *         W O R K I N G   S T O R A G E   S E C T I O N         *
      *---------------------------------------------------------------*

       WORKING-STORAGE SECTION.

           EXEC SQL INCLUDE LNCVB070 END-EXEC.
      
      *---------------------------------------------------------------*
      *                   E N D   O F   P R O G R A M                 *
      *---------------------------------------------------------------*
