       IDENTIFICATION DIVISION.
       PROGRAM-ID. WMIN143B.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 MY-PROGRAM-NAME PIC X(10) VALUE 'PROGA'.
       01 PROGRAM-NAME PIC X(10) VALUE 'PROGB'.
       
       01 A-FIELD PIC X(10).
       
       01 ANOTHER-FIELD PIC X(5).
       
       PROCEDURE DIVISION.
           DISPLAY MY-PROGRAM-NAME  ' START '.
           MOVE 'ABCDEF' TO A-FIELD.
           MOVE A-FIELD TO ANOTHER-FIELD.
           
           CALL "Call1Display3Move2B" USING A-FIELD, ANOTHER-FIELD.
