       IDENTIFICATION DIVISION.
       PROGRAM-ID. START01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

        01 WS-FIELD-A-1 PIC X(4).

       PROCEDURE DIVISION.

           CALL "CallWithParamAndMoveB" USING WS-FIELD-A-1.

       END PROGRAM START01.
