       IDENTIFICATION DIVISION.
       PROGRAM-ID. AND3CLEE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       
       01 DUMMY PIC X(4).

       PROCEDURE DIVISION USING DUMMY.

         DISPLAY DUMMY.

       END PROGRAM AND3CLEE.
