//MC0756   JOB 000,CLASS=P,MSGCLASS=C,PRTY=13                           00001
//STEP EXEC PGM=IDCAMS
//DD1 DD DSN=TEST.VSAM1,DISP=SHR
//DD2 DD DSN=TEST.VSAM1,DISP=SHR
//SYSIN DD *
    DELETE TEST.VSAM9 PURGE
    DEFINE CLUSTER        -
              (NAME(TEST.VSAM3) -
                             SHAREOPTION(2) -
                             NOIMBED SPEED -
                             SPANNED -
                             MGMTCLAS(NOMIG) -
                             DATACLAS(VSAM) -
                             STORCLAS(CICSPROD) -
                             CYLINDERS(175 50) ) -
         DATA -
              (NAME(MIPS235.P.C4070IB.DATA.VSAM.PRIME) -
                             KEYS(30 02) -
                             CISZ(8192) -
                             RECORDSIZE(600 16000) -
                             FREESPACE(20 10) ) -
        INDEX -
              (NAME(MIPS235.P.C4070IB.DATA.VSAM.INDEX)  -
                             CISZ(2048) )
 DELETE TEST.VSAM1 PURGE
    DEFINE CLUSTER        -
              (NAME(TEST.VSAM1) -
                             SHAREOPTION(2) -
                             NOIMBED SPEED -
                             SPANNED -
                             MGMTCLAS(NOMIG) -
                             DATACLAS(VSAM) -
                             STORCLAS(CICSPROD) -
                             CYLINDERS(175 50) ) -
         DATA -
              (NAME(MIPS235.P.C4070IB.DATA.VSAM.PRIME) -
                             KEYS(30 02) -
                             CISZ(8192) -
                             RECORDSIZE(600 16000) -
                             FREESPACE(20 10) ) -
        INDEX -
              (NAME(MIPS235.P.C4070IB.DATA.VSAM.INDEX)  -
                             CISZ(2048) )
/*
//STEP2 EXEC PGM=IDCAMS
//DD1 DD DSN=TEST.VSAM2,DISP=SHR
//DD2 DD DSN=TEST.VSAM2,DISP=SHR
//SYSIN DD *
    DEFINE CLUSTER        -
              (NAME(TEST.VSAM3) -
                             SHAREOPTION(2) -
                             NOIMBED SPEED -
                             SPANNED -
                             MGMTCLAS(NOMIG) -
                             DATACLAS(VSAM) -
                             STORCLAS(CICSPROD) -
                             CYLINDERS(175 50) ) -
         DATA -
              (NAME(MIPS235.P.C4070IB.DATA.VSAM.PRIME) -
                             KEYS(30 02) -
                             CISZ(8192) -
                             RECORDSIZE(600 16000) -
                             FREESPACE(20 10) ) -
        INDEX -
              (NAME(MIPS235.P.C4070IB.DATA.VSAM.INDEX)  -
                             CISZ(2048) )
//STEP3 EXEC PGM=IDCAMS
//DD1 DD DSN=TEST.VSAM2,DISP=SHR
//DD2 DD DSN=TEST.VSAM2,DISP=SHR
//SYSIN DD DSN=TEST.CNTLCRD(MEM)
// DD *
 DELETE TEST.VSAM8 PURGE
// DD DSN=TEST.CNTLCRD(MISSING),DISP=SHR