//MC07516   JOB 000,CLASS=P,MSGCLASS=C,PRTY=13                           00001
//STEP1 EXEC PGM=IDCAMS
//DD2 DD DSN=TEST.VSAM1,DISP=SHR   
//STEP2 EXEC PGM=IDCAMS
//DD2 DD DSN=TEST.VSAM1.FILE,DISP=SHR                     
