       IDENTIFICATION DIVISION.
       PROGRAM-ID. MGOPRGM1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  REC.
       COPY MGOCOPY1.
       COPY MGOCOPY3.

       PROCEDURE DIVISION.
          ACCEPT FIRST-NAME.
          COPY MGOCOPY2.
          DISPLAY 'DETAILS : ' REC.
          STOP RUN.
