//PDVN0241 JOB C10OO,'VENDOR REPORTS',
//         MSGCLASS=Q,
//         MSGLEVEL=(1,1),
//         CLASS=K,
//         REGION=0M

//STEP05    EXEC PGM=EZTPA00,REGION=1500K                               00012007
//SYSIN     DD   DSN=ENDVR.USR.PROD.EZTRIEVE(AP36E03A),DISP=SHR
