 SAMPLE1: PROC OPTIONS(MAIN);
    DECLARE RESULT BIT(1) INIT(1B);
    GOTO LABEL1;
    GOTO LABEL3;
    LABEL1:
       SPROD: PROC;
           X = SUBSTR(X,LENGTH(X)+1 , Z);
           PUT SKIP LIST(' INSIDE LABEL1', X);
       END;
    PUT SKIP LIST('POST LABEL2');
    LABEL3: 
    PUT SKIP LIST('INSIDE LABEL3');
 OUT : END SAMPLE1;