       IDENTIFICATION DIVISION.
       PROGRAM-ID. MEE3131C.
       PROCEDURE DIVISION.
           GO TO LABEL_1.
           DISPLAY "PERFORM RETURNED!".
       LABEL_1.
           DISPLAY "LABEL1".
           GOBACK.
