//PROC_A2   PROC CYCLE=CYCNN,
//             DMCLBT=BTCHRE22,
//             GHPROD=GHTEST,
//             IDMS=IDMS,
//             PROD=TEST,
//             PRODREN=TESTREN,
//             RE629=RE629,
//             SPACE=,
//             SPACERX=,
//             SPCCLM=,
//             SPCLMO=,
//             SPCNOMAT=,
//             UNIT=TAPE,
//             UNITRX=TAPE,
//             UNTCLM=TAPE,
//             UNTLMO=TAPE,
//             UNTNOMAT=TAPE,
//             VOL='(,,,50)',
//             VOLCLM='(,,,20)',
//             VOLLMO='(,,,20)',
//             VOLNOMAT='(,,,50)',
//             VOLRX='(,,,50)'
//*            ** CREATE PRIOR EXPENSED CLAIM DATA FILE **
//RE629    EXEC PGM=&RE629
//*            ** CREATE PRIOR EXPENSED CLAIM DATA FILE **
//STEPLIB  DD  DSN=&IDMS..XADC.&PROD..LOADLIB,
//             DISP=SHR
//         DD  DSN=&IDMS..&PROD..HUMANA.LOADLIB,
//             DISP=SHR
//         DD  DSN=&IDMS..&PROD..SUBSLOAD,
//             DISP=SHR
//         DD  DSN=&IDMS..&PROD..SYS.LOADLIB,
//             DISP=SHR
//         DD  DSN=&GHPROD..LINKLIB,
//             DISP=SHR
//         DD  DSN=GHPROD.LINKLIB,
//             DISP=SHR
//SYSOUT   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=D
//REXPCLMR DD  DSN=&PRODREN..&CYCLE..RE629I.CLAIMS.PREGDG,
//             DISP=SHR
//REPRCLMS DD  DSN=&PRODREN..&CYCLE..RE629I.PRIOR.CLAIMS,
//             DISP=SHR
//REPRXCLM DD  DSN=&PRODREN..&CYCLE..RE629.REPRXCLM.FILE,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=&SPACERX,
//             UNIT=&UNITRX,
//             RECFM=FB,
//             VOL=&VOLRX
//REXPCLMO DD  DSN=&PRODREN..&CYCLE..RE629.REXPCLM.FILE,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=&SPCLMO,
//             UNIT=&UNTLMO,
//             RECFM=FB,
//             VOL=&VOLLMO
//REEXCEPT DD  DSN=&PRODREN..&CYCLE..RE629.REEXCEPT.FILE,
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,
//             RECFM=FB
//RERVSCLM DD  DSN=&PRODREN..&CYCLE..RE629.REVISED.CLAIM.FILE,
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,
//             RECFM=FB
//RECLMHST DD  DSN=&PRODREN..&CYCLE..RE629.CLMHST,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=&SPACE,
//             UNIT=&UNIT,
//             RECFM=FB,
//             VOL=&VOL
//RECNOMAT DD  DSN=&PRODREN..&CYCLE..RE629.RECNOMAT,
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,
//             RECFM=FB
//REPNOMAT DD  DSN=&PRODREN..&CYCLE..RE629.REPNOMAT,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=&SPCNOMAT,
//             UNIT=&UNTNOMAT,
//             RECFM=FB,
//             VOL=&VOLNOMAT
//RESEGMBR DD  DSN=&PRODREN..&CYCLE..RE629.SEGMBR,
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,
//             RECFM=FB
//RECLAIM  DD  DSN=&PRODREN..&CYCLE..RE629.CLAIMS,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=&SPCCLM,
//             UNIT=&UNTCLM,
//             RECFM=FB,
//             VOL=&VOLCLM
//DCMSG    DD  DSN=&IDMS..&PROD..SYSMSG.DDLDCMSG,
//             DISP=SHR
//SYSIDMS  DD  DSN=&IDMS..&PROD..SYSIDMS(&DMCLBT),
//             DISP=SHR
//TAPEJRNL DD  DUMMY
