      *--A--
      *--B--
       IDENTIFICATION DIVISION.
       PROGRAM-ID.    MMRS7101.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  MY-PROGRAM-NAME PIC X(10) VALUE 'MMRS7101:'.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
           .
****************************************************************************