 WMIN3020_SelectWhen: PROCEDURE OPTIONS(MAIN);
     SELECT( PTEXT );
           WHEN( 'I' )
              return ('I');
           WHEN( 'D' )
              return ('D');
           otherwise 
              call Smaller;
           END;
     END;
 END WMIN3020_SelectWhen;
