DEFINE DATA
LOCAL

END-DEFINE

DEFINE SUBROUTINE SRTN

FETCH 'MISSING'

END-SUBROUTINE
DEFINE SUBROUTINE ROUTINE-HELP

FETCH 'MISSING'

END-SUBROUTINE

DEFINE SUBROUTINE ROUTINE-INSERT

FETCH 'MISSING'

END-SUBROUTINE

DEFINE SUBROUTINE ROUTINE-READ

FETCH 'MISSING'

END-SUBROUTINE