       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBL_CALLS_C_FUNC.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
001600
000880 01  MY_FIELD                   PIC  X(80).
001780
001790 PROCEDURE DIVISION.
005340
000000     CALL  "my_func"          USING  MY_FIELD.  
005350     EXIT PROGRAM.
