//MULTIJCL JOB 'MMRS00C'
//STEP01   EXEC PGM=MULTIPGM
//MYFXOUT  DD DISP=NEW,DSN=DATASET.MUTLI.FOR.WRITE.ONE
//MYIO     DD DISP=MOD,DSN=DATASET.MUTLI.FOR.READ.WRITE.ONE
//STEP02   EXEC PGM=MULTIPGM
//MYFXOUT  DD DISP=NEW,DSN=DATASET.MUTLI.FOR.WRITE.TWO
//MYFBIN  DD DISP=SHR,DSN=DATASET.MUTLI.FOR.READ.TWO
