DEFINE DATA
LOCAL
  1 A (A1)
  1 C (I4) INIT <1>
  1 D (I4) INIT <1>
END-DEFINE

* No candidate: MOVE ROUNDED is a function but no ARITHMETIC_STATEMENT or ARITHMETIC_EXPRESSION
IF A SPECIFIED
    MOVE ROUNDED C TO D
END-IF

* No candidate: ATN is a function but no ARITHMETIC_STATEMENT or ARITHMETIC_EXPRESSION
IF A SPECIFIED
   COMPUTE C = ATN(D)
END-IF

* No candidate: ABS is a function but no ARITHMETIC_STATEMENT or ARITHMETIC_EXPRESSION
IF A SPECIFIED
   COMPUTE C = ABS(D)
END-IF

* Candidate Branch statement: The body contains an ARITHMETIC_STATEMENT
IF C SPECIFIED
    ADD 1 TO C
ELSE
    ADD 1 TO A
END-IF

* Candidate: Branch statement: The if body contains an ARITHMETIC_STATEMENT
IF A SPECIFIED
    ADD 1 TO C
END-IF

* Candidate: Branch statement: The if body contains an ARITHMETIC_STATEMENT
IF A SPECIFIED
    COMPUTE C = C + 1
END-IF

* Candidate: Branch statement: The body contains an ASSIGNMENT_STATEMENT with an ARITHMETIC_EXPRESSION on its right hand side
IF A SPECIFIED
    C := C + 1
END-IF

* Candidate: Branch statement: The if body contains an ARITHMETIC_STATEMENT
IF A SPECIFIED
    SUBTRACT 2 FROM C
END-IF

* Candidate: Branch statement: The body contains an ASSIGNMENT_STATEMENT with an ARITHMETIC_EXPRESSION on its right hand side
IF A SPECIFIED
    C := C - 2
END-IF

* Candidate: Branch statement: The if body contains an ARITHMETIC_STATEMENT
IF A SPECIFIED
    COMPUTE C = C - 2
END-IF

* Candidate: Branch statement: The if body contains an ARITHMETIC_STATEMENT
IF A SPECIFIED
    MULTIPLY C BY 3
END-IF

* Candidate: Branch statement: The if body contains an ARITHMETIC_STATEMENT
IF A SPECIFIED
    COMPUTE C = C * 3
END-IF

* Candidate: Branch statement: The body contains an ASSIGNMENT_STATEMENT with an ARITHMETIC_EXPRESSION on its right hand side
IF A SPECIFIED
    C := C * 3
END-IF

* Candidate: Branch statement: The if body contains an ARITHMETIC_STATEMENT
IF A SPECIFIED
    DIVIDE 4 INTO C
END-IF

* Candidate: Branch statement: The body contains an ASSIGNMENT_STATEMENT with an ARITHMETIC_EXPRESSION on its right hand side
IF A SPECIFIED
    C := C / 4
END-IF

* Candidate: Branch statement: The if body contains an ARITHMETIC_STATEMENT
IF A SPECIFIED
    COMPUTE C = C / 4
END-IF

* Candidate: Branch statement: The if body contains an ARITHMETIC_STATEMENT
IF A SPECIFIED
    COMPUTE C = C ** 5
END-IF

* Candidate: Branch statement: The body contains an ASSIGNMENT_STATEMENT with an ARITHMETIC_EXPRESSION on its right hand side
IF A SPECIFIED
    C := C ** 5
END-IF

END