 TEST_SQL : PROCEDURE OPTIONS(MAIN);
 EXEC SQL INCLUDE SQLCA;
 
 * Candidate: body contains another BRANCH_STATEMENT
 if (SQLCAID > 10) then
		return (0);
 
 END TEST_SQL;