DEFINE DATA LOCAL
  1 #A (A1)
  1 #B (A2)
END-DEFINE

DECIDE FOR EVERY CONDITION
  WHEN #A >= 0
    WRITE 'A >= 0'
  WHEN #B >= 0
    WRITE 'B >= 0'
  WHEN ANY
    WRITE 'Any of the above conditions is true.'
  WHEN ALL
    WRITE '#A is zero.'
  WHEN NONE
    IGNORE 
END-DECIDE

* Candidate: Condition contains at least two FIELD_REFERENCEs and two CONSTANT_REFERENCEs
DECIDE FOR EVERY CONDITION
  WHEN #A >= 0 AND #B <= 0
    WRITE 'A >= 0'
  WHEN NONE
    IGNORE 
END-DECIDE

* Candidate: body contains another BRANCH_STATEMENT
DECIDE FOR EVERY CONDITION
  WHEN #A >= 0
    WRITE 'A >= 0'
  WHEN ANY
* Branch statement in body
    IF #A = '0'
      WRITE 'if'
    END-IF
  WHEN ALL
    WRITE '#FIELD1 is zero.'
  WHEN NONE
    IGNORE 
END-DECIDE

* No candidate
DECIDE FOR FIRST CONDITION
    WHEN #A = 5
		WRITE NOTITLE '1'
    WHEN NONE 
		WRITE NOTITLE '1 NONE'
    WHEN ANY 
		WRITE NOTITLE '1 ANY'
END-DECIDE

* Candidate: body contains another BRANCH_STATEMENT
DECIDE FOR FIRST CONDITION
    WHEN #A = 5
        WRITE NOTITLE '1'
    WHEN NONE 
        DECIDE FOR FIRST CONDITION
            WHEN #A = 5
                WRITE NOTITLE '1'
            WHEN NONE 
                WRITE NOTITLE '1 NONE'
            WHEN ANY 
                WRITE NOTITLE '1 ANY'
        END-DECIDE
    WHEN ANY 
        WRITE NOTITLE '1 ANY'
END-DECIDE

* Candidate: Condition contains at least two FIELD_REFERENCEs and two CONSTANT_REFERENCEs
DECIDE FOR FIRST CONDITION
    WHEN #A = 5 AND #A EQ 4
		WRITE NOTITLE '1'
    WHEN NONE 
		WRITE NOTITLE '1 NONE'
    WHEN ANY 
		WRITE NOTITLE '1 ANY'
END-DECIDE

* No candidate: No condition contains at least two FIELD_REFERENCEs and two CONSTANT_REFERENCEs
DECIDE ON FIRST VALUE OF #A
  VALUE 'BLUB'
    WRITE 'BLUB entered.'
  VALUE 'BLAB'
    WRITE 'BLAB  entered.'
  ANY VALUE
    WRITE 'BLUB or BLAB entered.'
  NONE VALUE
    WRITE 'Neither BLUB nor BLAB key entered.'
END-DECIDE

* Candidate: body contains another BRANCH_STATEMENT
DECIDE ON FIRST VALUE OF #A
  VALUE 'BLUB'
    WRITE 'BLUB entered.'
  VALUE 'BLAB'
    WRITE 'BLAB  entered.'
  ANY VALUE

* Candidate: Condition contains at least two FIELD_REFERENCEs and two CONSTANT_REFERENCEs
    IF #B = 'A' OR #B = 'B'
       WRITE 'BLUB or BLAB entered.'
    END-IF
  NONE VALUE
    WRITE 'Neither BLUB nor BLAB key entered.'
END-DECIDE

END
