 BrBranch: PROCEDURE OPTIONS(MAIN);
	Dcl U fixed binary(10);
	Dcl V fixed binary(10);
	Dcl C1 value(148) fixed bin;
	Dcl C2 value(261) fixed bin;
 
	/* Candidate: body contains another BRANCH_STATEMENT */
	if (U > 10) then
		if (V > 10) then
			return (3);

	
 END BrBranch;
