DEFINE DATA
LOCAL
  1 A (A1)
  1 C (I4) INIT <1>
  1 D (I4) INIT <1>
END-DEFINE

* Candidate: Branch statement: The if body contains an ARITHMETIC_STATEMENT
IF A SPECIFIED
    COMPUTE C = C + 1
END-IF