DEFINE DATA
LOCAL
  1 C (I4) INIT <1>
END-DEFINE

* Candidate: Branch statement: The if body contains an ARITHMETIC_STATEMENT
IF A SPECIFIED
    SUBTRACT 2 FROM C
END-IF